000001$SET LIST LINEINFO MAP XREF                                       000100      
000002$SET OPTIMIZE                                                     000200      
000003$SET LISTOMITTED                                                  000300      
000004 IDENTIFICATION DIVISION.                                         000400      
000005 PROGRAM-ID. DGOPROTCOB.                                          000500      
000006 AUTHOR. MOISES BAUTISTA VELAZQUEZ.                               000600      
000007******************************************************************000605      
000008**MAR 250929 SE MODIFICA PARA GENERAR LOS MENSAJES DE ALERTAS    *000610      
000009**PARA INTEGRAR LOS MOVIMIENTOS DE BALCON                        *000615      
000010*                                                                *000620      
000011*                                                                *000625      
000012*                                                                *000630      
000013*                                                                *000635      
000014*                                                                *000640      
000015*                                                                *000645      
000016*                                                                *000650      
000017*                                                                *000655      
000018*                                                                *000660      
000019*                                                                *000665      
000020*                                                                *000670      
000021******************************************************************000675      
000022                                                                  000700      
000023 ENVIRONMENT DIVISION.                                            000800      
000024 INPUT-OUTPUT SECTION.                                            000900      
000025 FILE-CONTROL.                                                    001000      
000026                                                                  001100      
000027     SELECT A01-MOVS500   ASSIGN       TO DISK                    001200      
000028                          ORGANIZATION IS SEQUENTIAL              001300      
000029                          ACCESS MODE  IS SEQUENTIAL              001400      
000030                          ACTUAL KEY   IS W77-NUMREG-MOV500.      001500      
000031                                                                  001600      
000032                                                                  001700      
000033     SELECT A02-CTL-PC ASSIGN       TO DISK                       001800      
000034                          ACCESS MODE  IS SEQUENTIAL              001900      
000035                          ACTUAL KEY   IS W77-NUMREG-ACC.         002000      
000036                                                                  002100      
000037     SELECT L01-DISPLAY ASSIGN TO DISK.                           002200      
000038                                                                  002300      
000039     SELECT L02-MONITOR ASSIGN TO DISK.                           002400      
000040*INICIO JMLT ARCHIVO DE DESCRIPCIONES                             002415      
000041     SELECT DES         ASSIGN TO DISK                            002430      
000042                        ACCESS MODE IS RANDOM                     002445      
000043                        ACTUAL KEY IS W77-LLAVE.                  002460      
000044*FIN JMLT ARCHIVO DE DESCRIPCIONES                                002475      
000045                                                                  002500      
000046*INICIO JMLT ARCHIVO DESCRIPCIONES PRODUCTO                       002512      
000047     SELECT ARCH-DES ASSIGN       TO DISK                         002524      
000048          ORGANIZATION IS INDEXED                                 002536      
000049          ACCESS MODE  IS RANDOM                                  002548      
000050          RECORD KEY   IS KEY-CAT .                               002560      
000051                                                                  002572      
000052*FIN JMLT ARCHIVO DESCRIPCIONES PRODUCTO                          002584      
000053 DATA        DIVISION.                                            002600      
000054 FILE SECTION.                                                    002700      
000055 FD A01-MOVS500                                                   002800      
000056*==============                                                   002900      
000057    VALUE OF TITLE            IS WKS-TITLE-MOVS500                003000      
000058    VALUE OF BUFFERS IS 1                                         003100      
000059    BLOCK  CONTAINS 144 RECORDS.                                  003200      
000060                                                                  003300      
000061    01 A01-R01-S500           PIC X(450).                         003400      
000062                                                                  003500      
000063                                                                  003600      
000064 FD A02-CTL-PC                                                    003700      
000065    VALUE OF TITLE            IS WKS-CTLENV.                      003800      
000066                                                                  003900      
000067 01 R01-REG-ENVIO.                                                004000      
000068    03 R01-REG-AUTS500        PIC 9(08).                          004100      
000069    03 FILLER                 PIC X(32).                          004200      
000070                                                                  004300      
000071                                                                  004400      
000072  FD L01-DISPLAY VALUE OF PROTECTION    IS PROTECTED,             004500      
000073                 VALUE TITLE IS WKS-RUT-L01.                      004600      
000074  01 REG-DISPLAY                   PIC X(180).                    004700      
000075                                                                  004800      
000076  FD L02-MONITOR VALUE OF PROTECTION    IS PROTECTED,             004900      
000077                 VALUE TITLE IS WKS-RUT-L02.                      005000      
000078  01 REG-MONITOR.                                                 005100      
000079     05 WKS-SENTIDO-MSG            PIC X(30).                     005200      
000080     05 WKS-ESPACIO1               PIC X(01).                     005300      
000081     05 WKS-FEC-MON                PIC 9(06).                     005325      
000082     05 WKS-HRS-MON                PIC 9(08).                     005350      
000083     05 WKS-ESPACIO2               PIC X(01).                     005375      
000084     05 WKS-LLAVE-MSG              PIC X(10).                     005400      
000085     05 WKS-ESPACIO3               PIC X(01).                     005500      
000086     05 WKS-DATOS-MSJ              PIC X(1000).                   005600      
000087                                                                  005605      
000088*INICIO JMLT ARCHIVO DE DESCRIPCIONES                             005610      
000089  FD DES                                                          005615      
000090*========                                                         005620      
000091      VALUE OF BUFFERS IS 1                                       005625      
000092      BLOCK  CONTAINS 120 RECORDS                                 005630      
000093      VALUE  OF DEPENDENTSPECS IS TRUE                            005632      
000094      VALUE OF TITLE IS WKS-TIT-DESS151.                          005635      
000095                                                                  005640      
000096   01 REG-DES.                                                    005645      
000097      02 REG-DES-DATOS      PIC X(540).                           005650      
000098*FIN JMLT ARCHIVO DE DESCRIPCIONES                                005655      
000099                                                                  005700      
000100*INICIO JMLT ARCHIVO DESCRIPCIONES PRODUCTO                       005706      
000101  FD ARCH-DES                                                     005712      
000102    VALUE OF TITLE          IS WKS-TIT-DESCVE .                   005754      
000103  01 REG-CAT                                   .                  005760      
000104     03 KEY-CAT                                .                  005766      
000105        05 WKS-CAT9-PROD  PIC 9(04).                              005772      
000106        05 WKS-CAT9-INST  PIC 9(04).                              005778      
000107     03 WKS-CAT9-LEY      PIC X(20).                              005784      
000108*FIN JMLT ARCHIVO DESCRIPCIONES PRODUCTO                          005790      
000109                                                                  005800      
000110 DATA-BASE SECTION .                                              005900      
000111  DB S151BD13BIFIN.                                               006000      
000112                                                                  006100      
000113 WORKING-STORAGE SECTION.                                         006200      
000114*=========================                                        006300      
000115                                                                  006400      
000116******************************************************************006500      
000117*         NOMBRE DEL ARCHIVO DE MOVIMIENTOS NVO S151             *006600      
000118******************************************************************006700      
000119*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000120* COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS    ON CMEMP.".          006800      
000121                                                                  000100      
000122******************************************************************000200      
000123**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
000124**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
000125**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
000126******************************************************************000600      
000127                                                                  000700      
000128 01 A00-R00-HDR-MOV .                                             000800      
000129    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
000130    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
000131    02 FILLER                          PIC  X(08).                001100      
000132    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
000133    02 FILLER                          PIC  X(430).               001300      
000134                                                                  001400      
000135 01 A00-R01-REGMOV .                                              001500      
000136    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
000137    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
000138    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
000139                                                                  001900      
000140    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
000141    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
000142                                       PIC  9(04)      COMP.      002200      
000143    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
000144                                       PIC  9(04)      COMP.      002400      
000145                                                                  002500      
000146    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000147    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
000148                                       PIC  9(02)      COMP.      002800      
000149    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
000150                                       PIC  9(02)      COMP.      003000      
000151    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
000152    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
000153                                       A00-R01-SERVICIO-ALERTA.   003060      
000154       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
000155       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
000156    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
000157    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
000158    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
000159                                       PIC  9(04)      COMP.      003420      
000160    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
000161    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
000162                                       PIC  9(04)      COMP.      003520      
000163    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
000164    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
000165    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
000166                                       PIC  9(02)      COMP.      003900      
000167                                                                  004000      
000168    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
000169    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
000170       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
000171          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
000172          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
000173          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
000174          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
000175          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
000176          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
000177          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
000178                                                                  005100      
000179    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
000180       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
000181       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
000182       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
000183       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
000184       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
000185       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
000186       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
000187                                                                  006000      
000188       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
000189       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
000190       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
000191       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
000192       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
000193       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
000194       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
000195                                                                  006800      
000196       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
000197       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
000198       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
000199       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
000200       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
000201       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
000202       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
000203                                                                  007600      
000204       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
000205       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
000206       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
000207       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
000208       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
000209       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
000210       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
000211                                                                  008400      
000212       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
000213       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
000214       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
000215       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
000216       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
000217       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
000218       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
000219                                                                  009200      
000220    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
000221    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
000222    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
000223    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
000224    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
000225    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
000226       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
000227    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
000228    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
000229    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
000230    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
000231    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
000232    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
000233    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
000234    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
000235       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
000236       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
000237    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
000238    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
000239    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
000240    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
000241    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
000242    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
000243    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
000244    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
000245    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
000246    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
000247    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
000248    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
000249    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
000250    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
000251                                       PIC X(10).                 012600      
000252    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
000253       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
000254       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
000255    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
000256    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
000257    03 A00-R01-FILIAL                  PIC  X(05).                013200      
000258    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
000259       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
000260       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
000261                                                                  013300      
000262    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
000263    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
000264                                       PIC  X(09).                013600      
000265    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
000266                                       PIC  9(18)      COMP.      013800      
000267    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
000268    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
000269                                       PIC  X(9).                 014100      
000270    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
000271    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
000272                                       PIC  X(05).                014400      
000273    03 A00-R01-NIO                     PIC  X(16).                014500      
000274    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
000275    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
000276    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
000277       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
000278    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
000279    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
000280       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
000281    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
000282    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
000283    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
000284    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
000285    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
000286    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
000287                                       PIC  X(04).                015900      
000288    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
000289    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
000290    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
000291                                       PIC  9(04)      COMP.      016300      
000292    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
000293    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
000294    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
000295    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
000296    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
000297                                                                  016900      
000298    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
000299    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
000300       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
000301    03 A00-R01-FILXAPL                 PIC X(165).                017300      
000302                                                                  017400      
000303    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
000304       05 FILLER                       PIC X(96).                 017510      
000305       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
000306       05 FILLER                       PIC X(67).                 017700      
000307                                                                  017702      
000308    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
000309       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
000310       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
000311       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
000312       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
000313       06 WKS-MOV-FILS084              PIC X(154).                017714      
000314                                                                  017800      
000315    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
000316       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
000317       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
000318       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
000319       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
000320       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
000321       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
000322       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
000323       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
000324       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018155      
000325*      CAMPOS NUEVOS                                              018160      
000326       05 A00-R01-SUCFOND              PIC 9(04)      COMP.       018161      
000327       05 A00-R01-CTAFOND              PIC 9(16)      COMP.       018162      
000328       05 A00-R01-OPBANEL              PIC 9(04)      COMP.       018163      
000329       05 A00-R01-GATN                 PIC S9(03)V99   COMP.      018164      
000330       05 A00-R01-GATR                 PIC S9(03)V99   COMP.      018165      
000331       05 A00-R01-FECGAT               PIC 9(08)      COMP.       018166      
000332       05 FILLER                       PIC X(43).                 018167      
000333*       05 FILLER                       PIC X(62).                018170      
000334       05 A00-R01-CTE-087              PIC X(07).                 018210      
000335       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
000336          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
000337          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
000338          07 FILLER                    PIC X(01).                 018281      
000339       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
000340       05 FILLER                       PIC X(58).                 018400      
000341                                                                  018500      
000342    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
000343       05 FILLER                       PIC  X(96).                018610      
000344       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
000345       05 FILLER                       PIC  X(65).                018630      
000346                                                                  018640      
000347    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
000348       05 A00-R01-FORMATO0             PIC  9(02).                018700      
000349       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
000350       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
000351       05 FILLER                       PIC  X(141).               018910      
000352                                                                  019100      
000353    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
000354       05 A00-R01-FORMATO1             PIC  9(02).                019300      
000355       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
000356       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
000357       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
000358       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
000359       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
000360       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
000361       05 A00-R01-ENTSAL               PIC  X(01).                020000      
000362       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
000363       05 FILLER                       PIC  X(69).                020200      
000364                                                                  020300      
000365    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
000366       05 A00-R01-FORMATO2             PIC  9(02).                020500      
000367       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
000368       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
000369       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
000370       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
000371       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
000372       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
000373       05 FILLER                       PIC  X(77).                021200      
000374                                                                  021300      
000375    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
000376       05 A00-R01-FORMATO3             PIC  9(02).                021500      
000377       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
000378       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
000379       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
000380       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
000381       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
000382       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
000383       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
000384       05 FILLER                       PIC  X(69).                022300      
000385                                                                  022400      
000386    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
000387       05 A00-R01-FORMATO4             PIC  9(02).                022600      
000388       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
000389       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
000390       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
000391       05 A00-R01-RFCFT04              PIC  X(13).                023000      
000392       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
000393       05 A00-R01-DIRECCION            PIC  X(40).                023200      
000394       05 FILLER                       PIC  X(85).                023300      
000395                                                                  023400      
000396    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
000397       05 A00-R01-COBERTURA            PIC  X(01).                023408      
000398       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
000399       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
000400       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
000401       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
000402       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
000403       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
000404       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
000405       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
000406       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
000407       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
000408       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
000409       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
000410       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
000411       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
000412       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
000413       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
000414       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
000415       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
000416       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
000417       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
000418       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
000419       05 FILLER                       PIC  X(05).                023492      
000420                                                                  023497      
000421    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
000422       05 A00-R01-4CEROS               PIC  9(04).                023600      
000423       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
000424       05 FILLER                       PIC  X(157).               023800      
000425                                                                  023900      
000426    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
000427       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
000428        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
000429       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
000430       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
000431       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
000432       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
000433       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
000434       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
000435       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
000436       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
000437       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
000438       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
000439       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
000440       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
000441       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
000442       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
000443       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
000444       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
000445       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
000446       05 A00-R01-FILLER               PIC  X(41).                025850      
000447       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
000448       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
000449       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
000450       05 A00-R01-INDPAGO              PIC  9(01).                026200      
000451       05 FILLER                       PIC  X(01).                026210      
000452       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
000453       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
000454       05 FILLER                       PIC  X(52).                026300      
000455                                                                  026400      
000456    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
000457       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
000458       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
000459       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
000460       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
000461       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
000462       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
000463       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
000464       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
000465       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
000466       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
000467       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
000468       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
000469       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
000470          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
000471          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
000472       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
000473       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
000474          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
000475       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
000476          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
000477       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
000478          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
000479       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
000480          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
000481       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
000482          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
000483       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
000484          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
000485       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
000486          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
000487       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
000488          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
000489       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
000490          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
000491       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
000492          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
000493          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
000494       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
000495       05 FILLER                       PIC X(01).                 030101      
000496       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
000497       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
000498       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
000499       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
000500       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
000501       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
000502       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
000503       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
000504          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
000505       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
000506       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
000507       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
000508       05 FILLER                       PIC X(14).                 030700      
000509                                                                  030800      
000510    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
000511       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
000512       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
000513       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
000514       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
000515       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
000516       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
000517       05 A00-R01-151-CITI             PIC  9(02)     COMP.       031520      
000518       05 A00-R01-151-IND-BNE          PIC  9(02)     COMP.       031540      
000519       05 FILLER                       PIC  X(140).               031600      
000520                                                                  031700      
000521    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
000522       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
000523       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
000524       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
000525       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
000526       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
000527       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
000528       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
000529       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
000530       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
000531       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
000532          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
000533          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
000534          07 FILLER                    PIC  X(08).                032740      
000535       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
000536       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
000537       05 A00-R01-NOMORD               PIC  X(30).                033000      
000538       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
000539       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
000540       05 A00-R01-REF-CECO             PIC  X(07).                033500      
000541       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
000542       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
000543          A00-R01-NUM-ORD-PAGO.                                   033800      
000544          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
000545          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
000546                                                                  034100      
000547    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
000548       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
000549       05 A00-R01-RFC-S501             PIC  X(13).                034160      
000550       05 FILLER                       PIC  X(151).               034180      
000551                                                                  034190      
000552    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
000553       05 A00-R01-DATOS-S701           PIC X(116).                034300      
000554       05 A00-R01-PAG-SERV             REDEFINES                  034400      
000555                                       A00-R01-DATOS-S701.        034500      
000556          07 A00-R01-ID                PIC X(30).                 034600      
000557          07 A00-R01-FECREC            PIC 9(06).                 034700      
000558          07 A00-R01-REF1              PIC X(20).                 034800      
000559          07 A00-R01-REF2              PIC X(20).                 034900      
000560          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
000561          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
000562                                       A00-R01-TIPOPAGO.          035200      
000563             09 A00-R01-ESTAB          PIC 9(04).                 035300      
000564             09 A00-R01-SEQ            PIC 9(02).                 035400      
000565          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
000566          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
000567          07 A00-R01-EBPP              PIC 9(03).                 035700      
000568          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
000569          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
000570          07 FILLER                    PIC X(01).                 035728      
000571          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
000572          07 FILLER                    PIC X(18).                 035760      
000573       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
000574                                       A00-R01-DATOS-S701.        035900      
000575          07 A00-R01-RFC               PIC X(13).                 036000      
000576          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
000577          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
000578          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
000579          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
000580          07 FILLER                    PIC X(85).                 036200      
000581       05 FILLER                       PIC X(49).                 036300      
000582                                                                  036400      
000583    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
000584       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
000585       05 A00-R01-CTA-S702             PIC X(40).                 036700      
000586       05 FILLER                       PIC X(113).                036710      
000587                                                                  036720      
000588    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
000589       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
000590       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
000591       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
000592       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
000593       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
000594       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
000595       05 FILLER                       PIC X(72).                 036800      
000596                                                                  036810      
000597                                                                  036820      
000598    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
000599       05 A00-R01-TRUI-S711.                                      036915      
000600          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
000601          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
000602          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
000603           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
000604          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
000605       05 A00-R01-MICR-S711.                                      036945      
000606          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
000607          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
000608          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
000609          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
000610          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
000611          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
000612          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
000613          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
000614       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
000615       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
000616       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
000617       05 A00-R01-FIL-S711             PIC X(05).                 036965      
000618       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
000619       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
000620       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
000621                                                                  036990      
000622    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
000623       05 A00-R01-RFC-502              PIC  X(13).                037100      
000624       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
000625          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
000626          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
000627          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
000628          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
000629          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
000630          07 FILLER                    PIC  9(01) COMP.           037650      
000631       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
000632       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
000633       05 FILLER                       PIC  X(06).                038680      
000634                                                                  038682      
000635    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
000636       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
000637       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
000638       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
000639       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
000640       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
000641       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
000642       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
000643       05 FILLER                       PIC  X(81).                038750      
000644                                                                  038755      
000645    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
000646       05 A00-R01-COP                  PIC  9(13)        .        038900      
000647       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
000648       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
000649       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
000650       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
000651       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
000652       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
000653       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
000654       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
000655       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
000656       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
000657       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
000658       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
000659       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
000660       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
000661       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
000662       05 FILLER                       PIC  X(81)        .        040800      
000663                                                                  040810      
000664    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
000665       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
000666       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
000667       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
000668       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
000669       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
000670       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
000671       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
000672       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
000673       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
000674       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
000675       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
000676       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
000677       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
000678       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
000679       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
000680       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
000681       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
000682       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
000683       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
000684       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
000685       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
000686       05 FILLER                       PIC  X(18).                041040      
000687                                                                  041400      
000688    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
000689    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
000690*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000691                                                                  006900      
000692 01 WKS-TITLE-MOVS500.                                            007000      
000693    02 FILLER                  PIC X(17) VALUE                    007100      
000694                               "S151/FILE/MOVS500".               007200      
000695    02 FILLER                  PIC X(01) VALUE "/".               007300      
000696    02 WKS-MOVS1-FECHA         PIC 9(06).                         007400      
000697    02 FILLER                  PIC X(04) VALUE " ON ".            007500      
000698    02 WKS-PACK-MOVS           PIC X(17).                         007600      
000699    02 FILLER                  PIC X(01) VALUE ".".               007700      
000700                                                                  007800      
000701                                                                  007900      
000702*INICIO JMLT FORMATO Y NOMBRE DEL ARCHIVO DE DESCRIPCIONES        007905      
000703******************************************************************007910      
000704*NOMBRE DEL ARCHIVO DE DESCRIPCIONES DEL ARCHIVO DE MOVS DEL S500*007915      
000705******************************************************************007920      
000706*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000707* COPY                                                            007925      
000708* "(S151)CITIDIRECT/S151/FORMATO/ARCHIVO/DATOSADIC ON CMEMP.".    007930      
000709 01 A01-R00-HDR-DES .                                             000100      
000710     03 A00-R00-HDR-HD                 PIC X(02).                 000200      
000711     03 A00-R00-HDR-FCH                PIC 9(08).                 000300      
000712     03 FILLER                         PIC X(530).                000400      
000713 01 A01-R01-DATOS.                                                000500      
000714     03 A01-R01-AUTS151ORI             PIC 9(08) COMP.            000600      
000715     03 A01-R01-DATOS-1.                                          000610      
000716        05 A01-R01-REF-BANAMEX         PIC X(26).                 000620      
000717        05 A01-R01-CVECON-YREFLOC REDEFINES                       000640      
000718           A01-R01-REF-BANAMEX         PIC X(26).                 000700      
000719        05 A01-R01-CVECON-Y-REFV REDEFINES A01-R01-REF-BANAMEX.   000800      
000720           07 A01-R01-CONT-ORIG        PIC 9(20) COMP.            000900      
000721           07 A01-R01-REFLOC-BNM       PIC X(12).                 001000      
000722           07 A01-R01-REFLOC-23POS REDEFINES A01-R01-REFLOC-BNM.  001100      
000723              09 A01-R01-COMPREF       PIC 9(01) COMP.            001200      
000724              09 A01-R01-REF23POS      PIC 9(23) COMP.            001250      
000725           07 A01-R01-REFALFA REDEFINES A01-R01-REFLOC-BNM        001270      
000726                                       PIC X(12).                 001290      
000727           07 FILLER                   PIC X(04).                 001300      
000728        05 A01-R01-REFLOC7-BNM REDEFINES A01-R01-REF-BANAMEX.     001400      
000729           07 FILLER                   PIC X(02).                 001500      
000730           07 A01-R01-LOC07BNM         PIC X(24).                 001600      
000731        05 A01-R01-NOMINA-FUN1         PIC 9(14) COMP.            003600      
000732        05 A01-R01-NOMINA-FUN2         PIC 9(14) COMP.            003700      
000733        05 A01-R01-SDO-FIN.                                       003720      
000734           07 A01-R01-SDO-FIN-S500     PIC S9(15)V99 COMP.        003740      
000735           07 FILLER                   PIC X(05).                 003760      
000736        05 A01-R01-NOMINAS-MC REDEFINES A01-R01-SDO-FIN.          003780      
000737           07 A01-R01-NOM-MAKER        PIC 9(14) COMP.            003800      
000738           07 A01-R01-NOM-CHECKER      PIC 9(14) COMP.            003900      
000739        05 A01-R01-REF-CLIENTE         PIC X(16).                 004000      
000740        05 A01-R01-REFERENCIA1         PIC X(35).                 004100      
000741        05 A01-R01-REFERENCIA1-S500 REDEFINES A01-R01-REFERENCIA1.004110      
000742           07 A01-R01-ORIG-HRAMOV      PIC 9(06).                 004120      
000743           07 A01-R01-ORIG-FECMOV      PIC 9(06).                 004130      
000744           07 A01-R01-ORIG-FOLIO       PIC X(12).                 004140      
000745           07 A01-R01-ORIG-MDE         PIC 9(02).                 004150      
000746           07 A01-R01-ORIG-FILREF1     PIC X(09).                 004160      
000747        05 A01-R01-REF2-CTE            PIC X(35).                 004200      
000748        05 A01-R01-REF3-CTE            PIC X(35).                 004300      
000749        05 A01-R01-REF4-CTE            PIC X(35).                 004400      
000750        05 A01-R01-DATOS-2.                                       004450      
000751           07 A01-R01-LEY1             PIC X(40).                 004500      
000752           07 A01-R02-LEY2             PIC X(40).                 004600      
000753           07 A01-R02-LEY3             PIC X(40).                 004700      
000754           07 A01-R02-LEY4             PIC X(40).                 004800      
000755           07 A01-R02-LEY5             PIC X(40).                 004900      
000756           07 A01-R01-FILXAPL          PIC X(120).                004910      
000757           07 A01-R01-FILXAPL-S203 REDEFINES A01-R01-FILXAPL.     004912      
000758              09 A01-R01-CVE-IMPTO10   PIC 9(06).                 004914      
000759              09 A01-R01-FORMA-PAG10   PIC 9(03).                 004916      
000760              09 A01-R01-IMP-IMPTO10   PIC 9(12).                 004918      
000761              09 A01-R01-CVE-IMPTO11   PIC 9(06).                 004920      
000762              09 A01-R01-FORMA-PAG11   PIC 9(03).                 004922      
000763              09 A01-R01-IMP-IMPTO11   PIC 9(12).                 004924      
000764              09 A01-R01-CVE-IMPTO12   PIC 9(06).                 004926      
000765              09 A01-R01-FORMA-PAG12   PIC 9(03).                 004928      
000766              09 A01-R01-IMP-IMPTO12   PIC 9(12).                 004930      
000767              09 A01-R01-CVE-IMPTO13   PIC 9(06).                 004932      
000768              09 A01-R01-FORMA-PAG13   PIC 9(03).                 004934      
000769              09 A01-R01-IMP-IMPTO13   PIC 9(12).                 004936      
000770              09 A01-R01-CVE-IMPTO14   PIC 9(06).                 004938      
000771              09 A01-R01-FORMA-PAG14   PIC 9(03).                 004940      
000772              09 A01-R01-IMP-IMPTO14   PIC 9(12).                 004942      
000773              09 FILLER                PIC X(15).                 004944      
000774                                                                  004946      
000775*          07 A01-R01-FILXAPL-S711 REDEFINES A01-R01-FILXAPL.     004948      
000776*             09 A01-R01-TRUI-S711.                               004949      
000777*                11 A01-R01-CSIREC-S711 PIC 9(08) COMP.           004950      
000778*                11 A01-R01-CSIOR-S711  PIC 9(08) COMP.           004951      
000779*                11 A01-R01-NUMOP-S711  PIC 9(08) COMP.           004952      
000780*                11 A01-R01-NUMTR-S711  PIC 9(08) COMP.           004953      
000781*                11 A01-R01-INSMN-S711  PIC 9(02) COMP.           004954      
000782*             09 A01-R01-MICR-S711.                               004955      
000783*                11 A01-R01-CODSEG-S711 PIC 9(04) COMP.           004956      
000784*                11 A01-R01-VERPRE-S711 PIC 9(02) COMP.           004957      
000785*                11 A01-R01-CTRMON-S711 PIC 9(02) COMP.           004958      
000786*                11 A01-R01-PLCEC-S711  PIC 9(04) COMP.           004959      
000787*                11 A01-R01-BNCEM-S711  PIC 9(04) COMP.           004960      
000788*                11 A01-R01-DVEIN-S711  PIC 9(02) COMP.           004961      
000789*                11 A01-R01-CTACH-S711  PIC 9(12) COMP.           004962      
000790*                11 A01-R01-REFCH-S711  PIC 9(08) COMP.           004963      
000791*             09 A01-R01-CTABEN-S711    PIC 9(20) COMP.           004964      
000792*             09 A01-R01-BCREC-S711     PIC 9(04) COMP.           004965      
000793*             09 A01-R01-NOMBEN-S711    PIC X(40).                004966      
000794*             09 A01-R01-RFCBCO-S711    PIC X(13).                004967      
000795*             09 A01-R01-FILLER-S711    PIC X(19).                004968      
000796                                                                  004969      
000797           07 A01-R01-FILXAPL-S701 REDEFINES A01-R01-FILXAPL.     004970      
000798              09 A01-R01-NVAAUT-S701   PIC 9(08).                 004971      
000799              09 A01-R01-NVASUCTR-S701 PIC 9(04).                 004972      
000800              09 A01-R01-NVACAJTR-S701 PIC 9(02).                 004973      
000801              09 A01-R01-NVAFECT-S701  PIC 9(08).                 004974      
000802              09 A01-R01-NVOMDPA-S701  PIC 9(02).                 004975      
000803              09 A01-R01-NVALINC-S701  PIC X(30).                 004976      
000804              09 A01-R01-FILLER2-S701  PIC X(66).                 004977      
000805                                                                  004978      
000806           07 A01-R01-FILXAPL-S702 REDEFINES A01-R01-FILXAPL.     004979      
000807              09 A01-R01-STTRAN-S702   PIC 9(01).                 004980      
000808              09 A01-R01-CTEEMI-S702   PIC 9(12) COMP.            004981      
000809              09 A01-R01-CTADES-S702   PIC 9(20) COMP.            004982      
000810              09 A01-R01-IDEORI-S702   PIC 9(01).                 004983      
000811              09 A01-R01-IDEDES-S702   PIC 9(01).                 004984      
000812              09 A01-R01-TCTAEM-S702   PIC 9(02) COMP.            004985      
000813              09 A01-R01-TIARCH-S702   PIC X(01).                 004986      
000814              09 A01-R01-FECARC-S702   PIC 9(08) COMP.            004987      
000815              09 A01-R01-SECARC-S702   PIC 9(02) COMP.            004988      
000816              09 A01-R01-AUTORI-S702   PIC 9(20) COMP.            004989      
000817              09 A01-R01-NOMUSU-S702   PIC X(40).                 004990      
000818              09 A01-R01-TCTAUS-S702   PIC 9(02) COMP.            004991      
000819              09 A01-R01-SUCCON-S702   PIC 9(04) COMP.            004992      
000820              09 A01-R01-CAJCON-S702   PIC 9(04) COMP.            004993      
000821              09 A01-R01-FILLER-S702   PIC X(39).                 004994      
000822                                                                  004995      
000823           07 A01-R01-FILXAPL-S500 REDEFINES A01-R01-FILXAPL.     004996      
000824              09 A01-R01-NOMB-CTE          PIC  X(36).            004997      
000825              09 A01-R01-NOMB-BENEF        PIC  X(50).            004998      
000826              09 A01-R01-CVE-RASTREO-S500  PIC  X(30).            004999      
000827* INI VML                                                         005000      
000828              09 A01-R01-CVE-RASTREO-S500-R REDEFINES             005001      
000829                              A01-R01-CVE-RASTREO-S500.           005002      
000830                 11 A01-R01-TIP-CTA-TRASP  PIC 9(02).             005004      
000831                 11 A01-R01-BCO-CTA-TRASP  PIC 9(05).             005006      
000832                 11 A01-R01-NUM-CTA-TRASP  PIC 9(18).             005007      
000833                 11 A01-R01-FILLER-TRASP   PIC X(05).             005008      
000834* FIN VML                                                         005009      
000835              09 A01-R01-FECHA-PAGO        PIC  9(08)     COMP.   005010      
000836        05 A01-R01-DATOS-2-S264 REDEFINES A01-R01-DATOS-2.        005012      
000837           07 A01-R01-NOMINA-FUN3      PIC 9(14) COMP.            005014      
000838           07 A01-R01-COMISION         PIC 9(10)V99 COMP.         005016      
000839           07 A01-R01-SITUACION        PIC 9(10)V99 COMP.         005018      
000840           07 A01-R01-IVA-COMIS        PIC 9(08)V99 COMP.         005020      
000841           07 A01-R01-IVA-SITUACION    PIC 9(08)V99 COMP.         005022      
000842           07 A01-R01-IVA-FISCAL       PIC 9(12)V99 COMP.         005024      
000843           07 A01-R01-FOLIO-RECEP      PIC 9(10) COMP.            005026      
000844           07 A01-R01-OCUPACION        PIC X(40).                 005028      
000845           07 A01-R01-POBLACION        PIC X(40).                 005030      
000846           07 A01-R01-TIPO-CTA         PIC 9(02) COMP.            005032      
000847           07 A01-R01-NUM-CTE          PIC 9(12) COMP.            005034      
000848           07 A01-R01-NUM-CTA          PIC 9(20) COMP.            005036      
000849           07 A01-R01-CVE-TIPO-IDEN    PIC 9(02) COMP.            005038      
000850           07 A01-R01-NUM-IDEN-OFIC    PIC X(18).                 005040      
000851           07 A01-R01-FECHA-NAC-BEN    PIC 9(08) COMP.            005042      
000852           07 A01-R01-DOMICILIO        PIC X(55).                 005044      
000853           07 A01-R01-COLONIA          PIC X(30).                 005046      
000854           07 A01-R01-TELEFONO         PIC X(10).                 005048      
000855           07 A01-R01-COD-POS          PIC 9(06) COMP.            005050      
000856           07 A01-R01-REF-EMISOR       PIC X(20).                 005052      
000857           07 A01-R01-PIN              PIC 9(12) COMP.            005054      
000858           07 A01-R01-TIPO-CHQ-ORD     PIC 9(02) COMP.            005056      
000859           07 A01-R01-FECHA-EVENTO     PIC 9(08) COMP.            005058      
000860           07 A01-R01-CVE-RASTREO-S264 PIC X(30).                 005060      
000861     03 A01-R01-DATOS-1-R    REDEFINES A01-R01-DATOS-1.           005062      
000862        05 A01-R01-SUB-STA-DOC         PIC 9(02) COMP.            005064      
000863        05 A01-R01-SUC-DESTINO         PIC 9(04) COMP.            005066      
000864        05 A01-R01-TIPO-PREV           PIC X(01).                 005068      
000865        05 A01-R01-CAUSA-CAN-DEV       PIC 9(04) COMP.            005070      
000866        05 A01-R01-NVO-BCO-ORI         PIC 9(06) COMP.            005072      
000867        05 A01-R01-NVO-BCO-DES         PIC 9(06) COMP.            005074      
000868        05 A01-R01-NOM-BENEF-IDEN      PIC X(55).                 005076      
000869        05 A01-R01-NVO-NOM-BENEF       PIC X(55).                 005078      
000870        05 A01-R01-RFC-CURP-BENEF      PIC X(18).                 005080      
000871        05 A01-R01-GTOS-ORD-PAGO       PIC 9(16)V99 COMP.         005082      
000872        05 A01-R01-TIPO-PAGO-CECO      PIC 9(02) COMP.            005084      
000873        05 A01-R01-TIPO-PAGO-SPEI      PIC 9(02) COMP.            005086      
000874        05 A01-R01-TIPO-CONVENIO       PIC 9(02) COMP.            005088      
000875        05 A01-R01-PZA-EDO             PIC 9(06) COMP.            005090      
000876        05 A01-R01-TIPO-CTA-ABO        PIC 9(02) COMP.            005092      
000877        05 A01-R01-NUM-CTE-ABO         PIC 9(12) COMP.            005094      
000878        05 A01-R01-NUM-CTA-ABO         PIC 9(20) COMP.            005096      
000879        05 FILLER                      PIC X(358).                005098      
000880                                                                  005100      
000881     03 A01-R01-DATOS-2-S500 REDEFINES A01-R01-DATOS-1.           005102      
000882        05 A01-R01-TRUI.                                          005104      
000883           07 A01-R01-CSIID-RECEPTOR   PIC 9(08) COMP.            005106      
000884           07 A01-R01-CSIID-ORIGEN     PIC 9(08) COMP.            005108      
000885           07 A01-R01-NUM-OPERACION    PIC 9(08) COMP.            005110      
000886           07 A01-R01-NUM-TRANSACCI    PIC 9(08) COMP.            005112      
000887           07 A01-R01-INST-MONETARIO   PIC 9(02) COMP.            005114      
000888        05 A01-R01-MICR.                                          005116      
000889           07 A01-R01-COD-SEGURIDAD    PIC 9(04) COMP.            005118      
000890           07 A01-R01-VER-PREMARCADO   PIC 9(02) COMP.            005120      
000891           07 A01-R01-COD-TRANSMONE    PIC 9(02) COMP.            005122      
000892           07 A01-R01-PLAZA-CECOBAN    PIC 9(04) COMP.            005124      
000893           07 A01-R01-COD-BCOEMISOR    PIC 9(04) COMP.            005126      
000894           07 A01-R01-DIG-VINTERCAM    PIC 9(02) COMP.            005128      
000895           07 A01-R01-NUM-CTACHEQUE    PIC 9(12) COMP.            005130      
000896           07 A01-R01-NUM-REFCHEQUE    PIC 9(08) COMP.            005132      
000897        05 A01-R01-CTA-BENEFOTROBCO    PIC 9(20) COMP.            005134      
000898        05 A01-R01-BCO-RECEPOTROBCO    PIC 9(04) COMP.            005136      
000899        05 A01-R01-NOM-BENEFOTROBCO    PIC X(40).                 005138      
000900        05 A01-R01-RFC-OTROBCO         PIC X(13).                 005140      
000901        05 A01-R01-NOMPAN-S500         PIC X(05).                 005142      
000902        05 A01-R01-OPCPAN-S500         PIC X(01).                 005144      
000903        05 A01-R01-NUMCTO1-S500        PIC 9(16) COMP.            005146      
000904        05 A01-R01-NUMCTO2-S500        PIC 9(16) COMP.            005148      
000905        05 A01-R01-NUMCTO3-S500        PIC 9(16) COMP.            005150      
000906        05 A01-R01-INDIC-EST           PIC 9(08) COMP.            005152      
000907        05 A01-R01-FILLER-DATOS2-S500  PIC X(395).                005160      
000908                                                                  005170      
000909     03 FILLER                         PIC X(01).                 005198      
000910     03 A01-R01-APUDES                 PIC 9(08) COMP.            005200      
000911     03 A01-R01-TIPREG                 PIC 9(02) COMP.            005300      
000912                                                                  005400      
000913*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000914 01 WKS-TIT-DESS151.                                              007935      
000915    02 FILLER               PIC X(10) VALUE "(S151)S151".         007940      
000916    02 FILLER               PIC X(10) VALUE "/FILE/DESS".         007945      
000917    02 WS-DES-SISTEMA       PIC 9(03) VALUE 500.                  007950      
000918    02 FILLER               PIC X(01) VALUE "/".                  007955      
000919    02 WS-DES-FECHA         PIC 9(06) VALUE 0.                    007960      
000920    02 FILLER               PIC X(04) VALUE " ON ".               007965      
000921    02 WS-PACK-DES          PIC X(17).                            007970      
000922    02 FILLER               PIC X(01) VALUE ".".                  007975      
000923*FIN JMLT FORMATO Y NOMBRE DEL ARCHIVO DE DESCRIPCIONES           007980      
000924******************************************************************008000      
000925*  NOMBRE DE ARCHIVO EN EL CUAL SE LLEVA EL CONTROL DEL NUMERO   *008100      
000926*  DE AUTORIZACION PARA ENVIAR A ESTRUCTURA B07PROTCOB.          *008200      
000927******************************************************************008300      
000928                                                                  008400      
000929 01  WKS-CTLENV.                                                  008500      
000930     03 FILLER                     PIC X(27) VALUE                008600      
000931        "(S151)S151/FILE/CTLENVP014/".                            008700      
000932     03 WKS-FECHA-ENV              PIC 9(06).                     008800      
000933     03 FILLER                     PIC X(10) VALUE                008900      
000934        " ON CMEMP.".                                             009000      
000935                                                                  009100      
000936******************************************************************009200      
000937*             NOMBRE DE ARCHIVO DE ERRORES                       *009300      
000938*                                                                *009400      
000939******************************************************************009500      
000940 01 WKS-RUT-L01.                                                  009600      
000941    10 FILLER                    PIC X(27) VALUE                  009700      
000942        "S151/FILE/L01/DISPLAY/P014/"       .                     009800      
000943    10 WKS-RUT-L01-CSI           PIC X(03)   .                    009900      
000944    10 FILLER                    PIC X(01) VALUE "/".             010000      
000945    10 WKS-RUT-L01-FCH           PIC 9(06).                       010050      
000946    10 FILLER                    PIC X(01) VALUE "/".             010070      
000947    10 WKS-RUT-L01-HORA          PIC 9(08)   .                    010100      
000948    10 FILLER                    PIC X(01) VALUE "." .            010200      
000949                                                                  010300      
000950******************************************************************010400      
000951*               NOMBRE DE ARCHIVO MONITOR                        *010500      
000952*                                                                *010600      
000953******************************************************************010700      
000954 01 WKS-RUT-L02.                                                  010800      
000955    10 FILLER                    PIC X(27) VALUE                  010900      
000956        "S151/FILE/L02/MONITOR/P014/".                            011000      
000957    10 WKS-RUT-L02-CSI           PIC X(03)   .                    011100      
000958    10 FILLER                    PIC X(01) VALUE "/".             011200      
000959    10 WKS-RUT-L02-FCH           PIC 9(06)   .                    011300      
000960    10 FILLER                    PIC X(01) VALUE "/".             011400      
000961    10 WKS-RUT-L02-HORA          PIC 9(08).                       011500      
000962    10 FILLER                    PIC X(01) VALUE "." .            011600      
000963******************************************************************011602      
000964*             VARIABLES ARCHIVO TASKFILE                         *011604      
000965******************************************************************011606      
000966  01  WKS-TIT-TASKFILE.                                           011608      
000967      03 FILLER                     PIC X(30) VALUE               011610      
000968         "FILE TASKFILE (USERBACKUPNAME=".                        011612      
000969      03 FILLER                     PIC X(30) VALUE               011614      
000970         "TRUE,TITLE=S151/TASKFILE/P014/".                        011616      
000971      03 WKS-TSK-NODO               PIC 9(02).                    011618      
000972      03 WKS-TSK-SUBN               PIC 9(02) VALUE ZERO.         011620      
000973      03 FILLER                     PIC X(06) VALUE               011622      
000974         "/R000/".                                                011624      
000975      03 WKS-TSK-FECHA              PIC 9(06).                    011629      
000976      03 FILLER                     PIC X(01) VALUE "/".          011632      
000977      03 WKS-TSK-MXNB               PIC 9(07).                    011634      
000978      03 FILLER                     PIC X(01) VALUE "/".          011636      
000979      03 WKS-TSK-MNEMONICO          PIC X(14) VALUE               011638      
000980         "001TASKFILE );".                                        011640      
000981                                                                  011642      
000982******************************************************************011700      
000983*             VARIABLES DE ARCHIVO ERRORES                       *011800      
000984*                                                                *011900      
000985******************************************************************012000      
000986 01  REGISTRO-DIS-HEADER                          .               012100      
000987     10 FILLER                    PIC X(05) VALUE "FECHA"  .      012200      
000988     10 FILLER                    PIC X(10) VALUE SPACES   .      012300      
000989     10 FILLER                    PIC X(04) VALUE "HORA"   .      012400      
000990     10 FILLER                    PIC X(04) VALUE SPACES   .      012500      
000991     10 FILLER                    PIC X(05) VALUE "PASO "  .      012600      
000992     10 FILLER                    PIC X(02) VALUE SPACES   .      012700      
000993     10 FILLER                    PIC X(07) VALUE "MENSAJE".      012800      
000994 01  REGISTRO-DIS-DETALLE.                                        012900      
000995     10 WKS-DIS-FECHA-S           PIC ZZ.                         013000      
000996     10 WKS-DIS-FECHA-A           PIC ZZ.                         013100      
000997     10 FILLER                    PIC X(01) VALUE "/".            013200      
000998     10 WKS-DIS-FECHA-M           PIC ZZ.                         013300      
000999     10 FILLER                    PIC X(01) VALUE "/".            013400      
001000     10 WKS-DIS-FECHA-D           PIC ZZ.                         013500      
001001     10 FILLER                    PIC X(05) VALUE SPACES .        013600      
001002     10 WKS-DIS-HORA              PIC 9(02) .                     013700      
001003     10 FILLER                    PIC X(01) VALUE ":" .           013800      
001004     10 WKS-DIS-MINUTO            PIC 9(02) .                     013900      
001005     10 FILLER                    PIC X(03) VALUE SPACES.         014000      
001006     10 FILLER                    PIC X(01) VALUE "P" .           014100      
001007     10 WKS-DIS-PASO              PIC 9(03) VALUE 014.            014200      
001008     10 FILLER                    PIC X(03) VALUE SPACES.         014300      
001009     10 WKS-DIS-MENSAJE           PIC X(140) .                    014400      
001010 01 WKS-DIS-TEXTO                 PIC X(140) .                    014500      
001011 01 WKS-DUPLICADO                 PIC 9(002) .                    014510      
001012*===============================================                  014600      
001013*      PARAMETROS LIBRERIA CALENDAR            =                  014700      
001014*===============================================                  014800      
001015 01 WKS-FECHA1                    PIC 9(08).                      014900      
001016 01 WKS-FECHA1-R                  REDEFINES WKS-FECHA1 PIC X(08). 015000      
001017 01 WKS-FECHA2                    PIC 9(08).                      015100      
001018 01 WKS-FECHA2-R                  REDEFINES WKS-FECHA2 PIC X(08). 015200      
001019 77 W77-FORMATO                   PIC S9(11) BINARY.              015300      
001020 77 W77-FUNCION                   PIC S9(11) BINARY.              015400      
001021 77 W77-HABIL                     PIC 9(02).                      015500      
001022    88 W88-HABIL                  VALUE 0.                        015600      
001023    88 W88-INHABIL                VALUE 1.                        015700      
001024 77 W77-LIMITE-ENVIOS             PIC 9(04) VALUE 500.            015750      
001025 77 W77-LIMITE-PENDIENTES         PIC 9(04) VALUE 300.            015785      
001026*INICIO JMLT ARCHIVO  DESCRIPCIONES POR PRODUCTO INSTRUMENTO      015819      
001027 01 WKS-TIT-DESCVE                                            .   015820      
001028    03 FILLER              PIC X(19) VALUE "S151/FILE/DESCPRIN/". 015830      
001029    03 WKS-DESCPRIN-FCH    PIC 9(06)                     .        015840      
001030    03 FILLER              PIC X(01) VALUE "/"              .     015850      
001031    03 WKS-DESCPRIN-HORA   PIC 9(08)                     .        015860      
001032    03 FILLER              PIC X(01) VALUE "."              .     015870      
001033*FIN JMLT ARCHIVO  DESCRIPCIONES POR PRODUCTO INSTRUMENTO         015880      
001034*============================================================     015900      
001035*         VARIABLES PARA CARGA DE CATALOGOS                 *     016000      
001036*============================================================     016100      
001037 77  W77-L710-SISTEMA             PIC S9(11) BINARY.              016200      
001038 77  W77-L710-PROGRAMA            PIC S9(11) BINARY.              016300      
001039 01  WKS-L710-ENT.                                                016400      
001040      03 WKS-EL710-CAT             PIC 9(06) COMP.                016500      
001041      03 WKS-EL710-CLAVE           PIC 9(02) COMP.                016600      
001042      03 WKS-EL710-BUSQUEDA        PIC 9(02) COMP.                016700      
001043      03 WKS-EL710-REGISTROS       PIC 9(02) COMP.                016800      
001044      03 WKS-EL710-LLAVE1          PIC 9(12).                     016900      
001045      03 WKS-EL710-LLAVE2          PIC 9(12).                     017000      
001046      03 WKS-EL710-LLAVE3          PIC 9(12).                     017100      
001047      03 WKS-EL710-LLAVE4          PIC 9(12).                     017200      
001048      03 WKS-EL710-LLAVE5          PIC 9(12).                     017300      
001049      03 WKS-EL710-LLAVE6          PIC 9(12).                     017400      
001050      03 WKS-EL710-FEC-VIG         PIC 9(06) COMP.                017500      
001051      03 WKS-EL710-FECINI          PIC 9(06) COMP.                017600      
001052      03 WKS-EL710-NIVINI          PIC 9(02) COMP.                017700      
001053      03 FILLER                    PIC X(11).                     017800      
001054                                                                  017900      
001055 01  WKS-L710-SAL.                                                018000      
001056      03 WKS-SL710-NUMREG          PIC 9(02) COMP.                018100      
001057      03 WKS-SL710-CAT             PIC 9(06) COMP.                018200      
001058      03 WKS-SL710-FECINI          PIC 9(06) COMP.                018300      
001059      03 WKS-SL710-NIVINI          PIC 9(02) COMP.                018400      
001060      03 FILLER                    PIC X(22).                     018500      
001061      03 WKS-SL710-REG             OCCURS 10 TIMES.               018600      
001062         05 WKS-SL710-DAT          PIC 9(12) OCCURS 28 TIMES.     018700      
001063         05 WKS-SL710-FECALTA      PIC 9(06) COMP.                018800      
001064         05 WKS-SL710-FECBAJA      PIC 9(06) COMP.                018900      
001065         05 WKS-SL710-FECMOD       PIC 9(06) COMP.                019000      
001066         05 WKS-SL710-FECVIG       PIC 9(06) COMP.                019100      
001067         05 FILLER                 PIC X(42).                     019200      
001068 77 W77-DIAS-SIN-MOV              PIC 9(04) COMP.                 019300      
001069 77 W77-L710-RESULT               PIC S9(11) BINARY.              019400      
001070 77 W77-ERR-CAT                   PIC 9(02).                      019500      
001071 77 W77-CAT-FORMATO               PIC 9(02).                      019600      
001072 77 W77-CAT-NUMCAT                PIC 9(04).                      019700      
001073 77 W77-NUMCAT                    PIC 9(04).                      019800      
001074 77 W77-EOF                       PIC 9(02).                      019900      
001075                                                                  020000      
001076*INICIO JMLT                                                      020002      
001077 77 S080-CD-SISTEMA                       PIC S9(11) BINARY.      020004      
001078 77 S080-CD-PROGRAMA                      PIC S9(11) BINARY.      020006      
001079 77 S080-CD-RESULT                        PIC S9(11) BINARY.      020008      
001080 01 S080-CD-PARAMETRO-ENT.                                        020010      
001081    02 S080-CDPE-CATALOGO                 PIC 9(06) COMP.         020012      
001082    02 S080-CDPE-CLAVE                    PIC 9(02) COMP.         020014      
001083    02 S080-CDPE-ORDEN-BUSQ               PIC 9(02) COMP.         020016      
001084    02 S080-CDPE-REGISTROS                PIC 9(02) COMP.         020018      
001085    02 S080-CDPE-CVE-REGIST               PIC 9(12).              020020      
001086    02 S080-CDPE-CVE-REGIST-ASOC          PIC 9(12).              020022      
001087    02 S080-CDPE-NIVEL-INI                PIC 9(02) COMP.         020024      
001088    02 S080-CDPE-FECHA-CONS              PIC 9(06) COMP.          020026      
001089    02 FILLER                             PIC X(14).              020028      
001090                                                                  020030      
001091 01 S080-CD-PARAMETRO-SAL.                                        020032      
001092    02 S080-CDPS-NUM-REGISTRO             PIC 9(02) COMP.         020034      
001093    02 S080-CDPS-NUM-CATALOGO             PIC 9(06) COMP.         020036      
001094    02 S080-CDPS-FECHA-CONS               PIC 9(06) COMP.         020038      
001095    02 S080-CDPS-NIVEL-INI                PIC 9(02) COMP.         020040      
001096    02 S080-CDPS-DATOS OCCURS 10 TIMES.                           020042      
001097       04 S080-CDPS-CVE-REGIST            PIC 9(12).              020044      
001098       04 S080-CDPS-CVE-REGIST-ASOC       PIC 9(12).              020046      
001099       04 S080-CDPS-TEXTO-LARGO           PIC X(40).              020048      
001100       04 S080-CDPS-TEXTO-CORTO           PIC X(20).              020050      
001101       04 S080-CDPS-TEXTO-PANTALLA        PIC X(12).              020052      
001102       04 S080-CDPS-TEXTO-ABREV           PIC X(05).              020054      
001103       04 S080-CDPS-FECHA-ALTA            PIC 9(06) COMP.         020056      
001104       04 S080-CDPS-FECHA-BAJA            PIC 9(06) COMP.         020058      
001105       04 S080-CDPS-FECHA-ULTMOD          PIC 9(06) COMP.         020060      
001106       04 FILLER                          PIC X(10).              020062      
001107 01 WKS-NOTFOUND                  PIC 9(01).                      020064      
001108*FIN JMLT                                                         020066      
001109 01 W77-IND                       PIC 9(06).                      020100      
001110 01 W77-FIN-ARCH                  PIC 9(02).                      020200      
001111 01 CONT-REG-DISPLAY              PIC 9(06).                      020300      
001112 01 WKS-NUM-TRANS.                                                020400      
001113    05 WKS-NUM-TRANS-OCCURS        PIC 9(01).                     020500      
001114    05 WKS-NUM-TRANS-AUTS151       PIC 9(07).                     020600      
001115                                                                  020700      
001116*************************************************************     020800      
001117*                CVE TRANSACCION DE PC                      *     020900      
001118*************************************************************     021000      
001119    01 CVETRAN-PC.                                                021100      
001120           05 WKS-CVETRAN-PC   OCCURS 10000 TIMES.                021162      
001121                                                                  021600      
001122         10 WKS-CAT6-CVETRAN  PIC 9(06) COMP.                     021630      
001123         10 WKS-CAT6-SERV1    PIC 9(01) COMP.                     021645      
001124         10 WKS-CAT6-SERV2    PIC 9(01) COMP.                     021660      
001125         10 WKS-CAT6-NATC     PIC 9(01) COMP.                     021675      
001126         10 WKS-CAT6-ENVDHBL  PIC 9(01) COMP.                     021679      
001127         10 WKS-CAT6-SUMPAN   PIC 9(01) COMP.                     021682      
001128*FIN JMLT                                                         021690      
001129 01 WKS-NUM-CVETRANS      PIC 9(06).                              021700      
001130                                                                  021800      
001131 01 WKS-REIN-ACT          PIC 9(02).                              021802      
001132 01 WKS-REIT-ALER         PIC 9(02).                              021804      
001133 01  WKS-CONTRATO         PIC 9(16).                              021806      
001134 01  WKS-AUT-S151         PIC 9(08).                              021808      
001135 01 WKS-ENV-MAX-REIN             PIC 9(08) VALUE ZEROS.           021810      
001136                                                                  021812      
001137*INICIO JMLT                                                      021814      
001138*************************************************************     021816      
001139*                ARREGLO PARA LOS SERVICIOS                 *     021818      
001140*************************************************************     021820      
001141 01 ARR-SERV.                                                     021822      
001142     05 VAL-SERV  OCCURS 10 TIMES.                                021824      
001143        10 WKS-VAL-NUM-SERV               PIC 9(02).              021826      
001144        10 WKS-VAL-HR-INI                 PIC 9(08).              021828      
001145        10 WKS-VAL-HR-FIN                 PIC 9(08).              021830      
001146*1-DIA HABIL, 0-DIA INHABIL                                       021832      
001147        10 WKS-VAL-DIA-HAB                PIC 9(02).              021834      
001148        10 WKS-VAL-ACA-DES                PIC 9(06).              021836      
001149        10 WKS-VAL-CVE-TRAN-DES.                                  021838      
001150           20 WKS-VAL-CVE-TRAN-DES-SIS    PIC 9(04).              021840      
001151           20 WKS-VAL-CVE-TRAN-DES-COD    PIC 9(02).              021842      
001152           20 WKS-VAL-CVE-TRAN-DES-SUB    PIC 9(03).              021844      
001153        10 WKS-VAL-CVE-TRAN-OR.                                   021846      
001154           20 WKS-VAL-CVE-TRAN-OR-SIS     PIC 9(04).              021848      
001155           20 WKS-VAL-CVE-TRAN-OR-COD     PIC 9(02).              021850      
001156           20 WKS-VAL-CVE-TRAN-OR-SUB     PIC 9(03).              021852      
001157*0 Centralizado, 1 Descentralizado                                021854      
001158        10 WKS-VAL-CENTR                  PIC 9(02).              021856      
001159*0 Inactivos, 1 Activos                                           021858      
001160        10 WKS-REINT-ACT                  PIC 9(02).              021860      
001161        10 WKS-LONG-MSG                   PIC 9(04).              021862      
001162        10 WKS-VAL-SUC                    PIC 9(04).              021864      
001163        10 WKS-VAL-CAJA                   PIC 9(02).              021866      
001164        10 WKS-VAL-RDO                    PIC 9(02).              021868      
001165        10 WKS-VAL-TESP                   PIC 9(02).              021870      
001166        10 WKS-VAL-MODO                   PIC 9(01).              021872      
001167                                                                  021874      
001168 01 IND-SERV                      PIC 9(02).                      021876      
001169 01 WKS-NOT-FND                   PIC 9(01).                      021878      
001170*FIN JMLT                                                         021880      
001171*************************************************************     021900      
001172*             VARIABLES DE ARMADO  BUSQUEDA                 *     022000      
001173*************************************************************     022100      
001174 01  WKS-R01-FECMOV                PIC 9(06).                     022200      
001175*INICIO JMLT                                                      022230      
001176 01  WKS-R01-NUMCTE                PIC 9(12).                     022260      
001177*FIN JMLT                                                         022290      
001178 01  WKS-R01-CONTRATO              PIC 9(16).                     022300      
001179 01  WKS-R01-AUT-S151              PIC 9(08).                     022400      
001180 01  WKS-R01-OCCUR                 PIC 9(02).                     022500      
001181 01  WKS-R01-NUM-ID                PIC 9(02).                     022600      
001182 01  WKS-STATUS                    PIC 9(02).                     022700      
001183 01  WKS-NUM-OCCURS                PIC 9(02).                     022800      
001184 01  AUX-AUT-ANT-S151              PIC 9(08).                     022900      
001185                                                                  023000      
001186*INICIO JMLT                                                      023002      
001187 01  WKS-BUSQUEDA                  PIC 9(01).                     023004      
001188*************************************************************     023006      
001189*                 VARIABLES DE DATOS GENERALES              *     023008      
001190*************************************************************     023010      
001191 01 WKS-DATGEN.                                                   023012      
001192    03 WKS-PROD             PIC 9(04).                            023014      
001193    03 WKS-INST             PIC 9(02).                            023016      
001194    03 WKS-MDE              PIC 9(02).                            023018      
001195    03 WKS-SUC              PIC 9(04).                            023020      
001196    03 WKS-CAJA             PIC 9(04).                            023022      
001197    03 WKS-IMP              PIC 9(16)V99.                         023024      
001198    03 WKS-SDOF             PIC S9(15)V99.                        023026      
001199    03 WKS-HORADG           PIC 9(06).                            023028      
001200    03 WKS-NAT              PIC 9(02).                            023030      
001201    03 WKS-FECMOV           PIC 9(08).                            023032      
001202    03 WKS-FECMOV-2 REDEFINES WKS-FECMOV.                         023034      
001203       05 WKS-CENT          PIC 9(02).                            023036      
001204       05 WKS-FECHA         PIC 9(06).                            023038      
001205    03 WKS-MONEDA           PIC 9(04).                            023040      
001206    03 WKS-SUMPAM           PIC 9(01).                            023042      
001207*valor de fecha y hora de envio                                   023044      
001208    03 WKS-FECHA-NATURAL    PIC 9(06).                            023046      
001209    03 WKS-HRS-ENVPROC.                                           023048      
001210       05 WKS-HH-ENVPROC    PIC 9(02).                            023050      
001211       05 WKS-MM-ENVPROC    PIC 9(02).                            023052      
001212       05 WKS-SS-ENVPROC    PIC 9(02).                            023054      
001213    03 WKS-FEC-NAT-CAN      PIC 9(06).                            023056      
001214    03 WKS-HRS-CAN.                                               023058      
001215       05 WKS-HH-CAN        PIC 9(02).                            023060      
001216       05 WKS-MM-CAN        PIC 9(02).                            023062      
001217       05 WKS-SS-CAN        PIC 9(02).                            023064      
001218    03 FILLER               PIC X(50).                            023066      
001219 01 WKS-ERROR               PIC 9(04).                            023068      
001220                                                                  023070      
001221*FIN JMLT                                                         023076      
001222*************************************************************     023100      
001223*                      FIN DE ARCHIVO                       *     023200      
001224*************************************************************     023300      
001225 01 WKS-EOF-B07                  PIC 9(04).                       023400      
001226 77 W77-NUMREG-MOV500            PIC 9(08).                       023500      
001227 77 W77-NUMREG-ACC               PIC 9(08).                       023600      
001228 01 W77-FIN                      PIC 9(04).                       023700      
001229 77 W77-CONTROL                  PIC 9(02) VALUE ZEROS.           023800      
001230*************************************************************     023900      
001231*                      CONTADORES                           *     024000      
001232*************************************************************     024100      
001233 01 WKS-CONT-MSG-ENV             PIC 9(08) VALUE ZEROS.           024200      
001234 01 WKS-CONT-MSG-ENV-AL          PIC 9(08) VALUE ZEROS.           024250      
001235 01 WKS-CONT-MSG-REC             PIC 9(08) VALUE ZEROS.           024300      
001236 01 WKS-CONT-ENC                 PIC 9(04) VALUE ZEROS.           024350      
001237 01 WKS-CONT-MSG-REIN            PIC 9(08) VALUE ZEROS.           024400      
001238 01 WKS-CONT-MSG-ENV-ELIM        PIC 9(08) VALUE ZEROS.           024500      
001239 01 WKS-CONT-MSG-ENV-ELIM-AL     PIC 9(08) VALUE ZEROS.           024512      
001240 01 WKS-NUM-ENVIOS               PIC 9(04).                       024525      
001241 01 WKS-NUM-ID                   PIC 9(02).                       024550      
001242 01 WKS-NUM-OCR                  PIC 9(02).                       024575      
001243 01 WKS-B07-NUM-ERROR            PIC 9(02).                       024590      
001244*************************************************************     024600      
001245*               ENCIENDE/APAGA MONITOR                      *     024700      
001246*************************************************************     024800      
001247 01 WKS-STATUS-MONITOR              PIC 9(02).                    024900      
001248*============================================================     025000      
001249*         CONTROL DE TIEMPO PARA ENVIO DE MSG Y REINTENTOS  *     025100      
001250*============================================================     025200      
001251 77 W77-ENVIO-REINT               PIC 9(02).                      025300      
001252     88 W88-ENVIO-REINT           VALUE 1.                        025400      
001253 77 W77-500-ENVIO                 PIC 9(02).                      025500      
001254     88 W88-500-ENVIO             VALUE 1.                        025600      
001255*INICIO JMLT                                                      025620      
001256 77 W77-RECEPCION                 PIC 9(02).                      025640      
001257     88 W88-RECEPCION             VALUE 1.                        025660      
001258*FIN JMLT                                                         025680      
001259 77 WKS-REINTENTO                 PIC 9(02).                      025700      
001260                                                                  025800      
00126177 W77-ENVIO-ALERTAS             PIC 9(02) VALUE 1.               025820      
001262    88 W88-ENVIO-ALERTAS         VALUE 1.                         025840      
001263                                                                  025845      
00126477 W77-ENVIO-ALER-CLINOCON       PIC 9(02).                       025850      
001265    88 W88-ENVIO-ALER-CLINOCON   VALUE 1.                         025855      
001266                                                                  025860      
001267 77 W77-IND-FUNCANCELA            PIC 9(02) VALUE 0.              025900      
001268 77 W77-AUT-ENVIO500              PIC 9(08).                      026000      
001269 77 W77-CANCELADOS                PIC 9(08).                      026100      
001270 77 W77-CANC-PROC                 PIC 9(02).                      026200      
001271 77 W77-CANC-FUNCION              PIC 9(02).                      026300      
001272 77 W77-CANC-AUT-AELIM-S151       PIC 9(08).                      026400      
001273 77 W77-CAN-AUT-S151              PIC 9(08).                      026500      
001274  01 WKS-SEG-MAQUINA-MSG           PIC 9(08).                     027900      
001275  01 WKS-SEG-MAQUINA-MSG-ANT       PIC 9(08).                     028000      
001276  01 WKS-SIG-PROCESO               PIC 9(02).                     028100      
001277  01 WKS-HR-INI-PG-AUX             PIC 9(08).                     028140      
001278  01 WKS-HR-INI-PG-AUX-R REDEFINES  WKS-HR-INI-PG-AUX  PIC X(08). 028145      
001279  01 WKS-INICIA-AUX                PIC 9(02) VALUE ZERO.          028160      
001280  01 WKS-INICIA-AUX-R              PIC 9(02) VALUE ZERO.          028165      
001281  01 WKS-HR-INI-PG                 PIC 9(08).                     028200      
001282  01 WKS-HR-INI-PG-R REDEFINES WKS-HR-INI-PG PIC X(08).           028250      
001283  01 WKS-HR-INI-FUN                PIC 9(08).                     028300      
001284  01 WKS-HR-INI-FUN-R REDEFINES WKS-HR-INI-FUN PIC X(08).         028360      
001285  01 WKS-HR-FIN-FUN                PIC 9(08).                     028400      
001286  01 WKS-HR-FIN-FUN-R REDEFINES WKS-HR-FIN-FUN PIC X(08).         028450      
001287  01 WKS-DORMIR                    PIC 9(08).                     028500      
001288  01 WKS-SIS-HORAINI-FIN.                                         028600      
001289     10 WKS-SIS-HORAINI-FIN-HH PIC 9(02).                         028630      
001290     10 WKS-SIS-HORAINI-FIN-MM PIC 9(02).                         028660      
001291     10 WKS-SIS-HORAINI-FIN-SS PIC 9(02).                         028690      
001292  01 WKS-SIS-HORAINI-FIN-R REDEFINES WKS-SIS-HORAINI-FIN.         028700      
001293     05 WKS-SIS-HH-INI-FIN         PIC 9(02).                     028800      
001294     05 WKS-SIS-MM-INI-FIN         PIC 9(02).                     028900      
001295     05 WKS-SIS-SS-INI-FIN         PIC 9(02).                     029000      
001296  01 WKS-SIS-HORAINI-FIN-RR REDEFINES                             029040      
001297          WKS-SIS-HORAINI-FIN PIC X(06).                          029060      
001298                                                                  029100      
001299*============================================================     029200      
001300*                    VARIABLES PARA HI                      *     029300      
001301*============================================================     029400      
001302 01 WKS-HI2                       PIC 9(6).                       029410      
001303                                                                  029420      
001304 01 WKS-HI-R                      REDEFINES                       029430      
001305    WKS-HI2.                                                      029440      
001306    05 WKS-HI-1                   PIC 9(02).                      029450      
001307       88 HI-90                   VALUE 90.                       029460      
001308       88 HI-80                   VALUE 80.                       029465      
001309       88 HI-24                   VALUE 24.                       029467      
001310       88 HI-30                   VALUE 30.                       029469      
001311    05 WKS-HI-TRANS               PIC 9(04).                      029470      
001312    05 WKS-HI-TRANS-R     REDEFINES   WKS-HI-TRANS.               029473      
001313       10 WKS-HIT1                PIC 9(02).                      029476      
001314       10 WKS-HIT2                PIC 9(02).                      029479      
001315                                                                  029480      
001316 77 W77-HI                        PIC 9(02) VALUE 0.              029500      
001317    88 W88-HI-1                   VALUE 1.                        029600      
001318    88 W88-HI-2                   VALUE 2.                        029700      
001319    88 W88-HI-3                   VALUE 3.                        029800      
001320    88 W88-HI-4                   VALUE 4.                        029900      
001321    88 W88-HI-6                   VALUE 6.                        030000      
001322    88 W88-HI-7                   VALUE 7.                        030020      
001323    88 W88-HI-8                   VALUE 8.                        030040      
001324    88 W88-HI-9                   VALUE 9.                        030060      
001325    88 W88-HI-10                  VALUE 10.                       030080      
001326    88 W88-HI-11                  VALUE 11.                       030100      
001327    88 W88-HI-12                  VALUE 12.                       030200      
001328    88 W88-HI-13                  VALUE 13.                       030250      
001329    88 W88-HI-14                  VALUE 14.                       030251      
001330    88 W88-HI-15                  VALUE 15.                       030252      
001331    88 W88-HI-16                  VALUE 16.                       030253      
001332    88 W88-HI-17                  VALUE 17.                       030254      
001333    88 W88-HI-18                  VALUE 18.                       030255      
001334    88 W88-HI-19                  VALUE 19.                       030256      
001335*INICIO JMLT                                                      030260      
001336    88 W88-HI-25                  VALUE 25.                       030270      
001337    88 W88-HI-80                  VALUE 80.                       030280      
001338*FIN JMLT                                                         030290      
001339 01 MY-ID                         PIC X(10) VALUE "S151/P014>".   030300      
001340 77 W77-RESULT-COMS               PIC 9(06).                      030400      
001341*** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ       030500      
001342*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001343* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           030600      
001344**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
001345  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
001346  01 MENSAJE-LJ.                                                  100300      
001347     02 SISTEMA-LJ     PIC X(04).                                 100400      
001348     02 FILLER         PIC X VALUE "/".                           100500      
001349     02 PASO-LJ        PIC X(04).                                 100600      
001350     02 FILLER         PIC X VALUE "/".                           100700      
001351     02 MTP-LJ         PIC 9(03).                                 100800      
001352     02 FILLER         PIC X VALUE ":".                           100900      
001353     02 TIPO-LJ        PIC X.                                     101000      
001354     02 FILLER         PIC X VALUE ">".                           101100      
001355     02 CODIGO-LJ      PIC 9(06).                                 101200      
001356     02 FILLER         PIC X VALUE "<".                           101300      
001357     02 TEXTO-LJ       PIC X(250).                                101400      
001358*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001359                                                                  030700      
001360****************************************************************  030800      
001361*              RUTINAS PARA FECHA Y HORA                       *  030900      
001362****************************************************************  031000      
001363 01 WKS-DATO                     PIC 9(06).                       031100      
001364 01 WKS-DATOR REDEFINES WKS-DATO.                                 031200      
001365    10 WKS-DATO-AMO              PIC 9(02).                       031300      
001366    10 WKS-DATO-MES              PIC 9(02).                       031400      
001367    10 WKS-DATO-DIA              PIC 9(02).                       031500      
001368*<INI> LRA VAR PARA PROCESOS                                      031503      
001369 01 WKS-B07-NUM-ID                PIC 9(02).                      031505      
001370 01 WKS-B07-FEC-CARGO             PIC 9(06).                      031506      
001371 01 WKS-B07-NUM-CTE               PIC 9(12).                      031509      
001372 01 WKS-B07-CONTRATO              PIC 9(16).                      031512      
001373 01 WKS-B07-AUT-S151              PIC 9(08).                      031515      
001374 01 WKS-B07-NUM-OCURR             PIC 9(02).                      031518      
001375 01 WKS-LOCK-OK                   PIC 9(02).                      031521      
001376 01 WKS-MAS-PEND                  PIC 9(02).                      031524      
001377 01 WKS-PRIMER-VEZ                PIC 9(01) VALUE ZERO.           031527      
001378 01 WKS-HRS-ACT                   PIC 9(08) TYPE IS NUMERIC-TIME. 031530      
001379 01 WKS-HRS-ACT-R REDEFINES WKS-HRS-ACT.                          031533      
001380     03 WKS-HRS-ACT-HH            PIC 9(02).                      031536      
001381     03 WKS-DP1-ACT               PIC X(01).                      031539      
001382     03 WKS-HRS-ACT-MM            PIC 9(02).                      031542      
001383     03 WKS-DP2-ACT               PIC X(01).                      031545      
001384     03 WKS-HRS-ACT-SS            PIC 9(02).                      031548      
001385 01 WKS-ZERO-STATUS               PIC 9(02).                      031551      
001386 01 WKS-SIX-STATUS                PIC 9(02).                      031554      
001387 01 WKS-B07-HR-ENVIO              PIC 9(06).                      031600      
001388 01 WKS-STORE                     PIC 9(01).                      031700      
001389                                                                  031800      
001390 01 WKS-HORMAQ-HMSD               PIC 9(08).                      031900      
001391 01 WKS-HORA-R    REDEFINES WKS-HORMAQ-HMSD.                      032000      
001392    10  WKS-HORA-H               PIC 9(02).                       032100      
001393    10  WKS-HORA-M               PIC 9(02).                       032200      
001394    10  WKS-HORA-S               PIC 9(02).                       032300      
001395    10  WKS-HORA-D               PIC 9(02).                       032400      
001396*INICIO JMLT REDEFINICION DE WKS-HORA-R                           032417      
001397 01 WKS-HORA-R2    REDEFINES WKS-HORMAQ-HMSD.                     032434      
001398    10  WKS-HORAR-HMS            PIC 9(06).                       032451      
001399    10  WKS-HORAR-C              PIC 9(02).                       032468      
001400*FIN JMLT REDEFINICION DE WKS-HORA-R                              032485      
001401 01  WKS-FECHR-MAQ.                                               032500      
001402     05  WKS-FEC-MAQ-DG          PIC 9(06).                       032600      
001403     05  WKS-HR-MAQ-DG           PIC 9(08).                       032700      
001404 01  WKS-FECHR-ENV-DG      REDEFINES WKS-FECHR-MAQ.               032800      
001405     05  WKS-FEC-ENV-MQDG        PIC 9(12).                       032900      
001406     05  WKS-HR-ENV-DG           PIC 9(02).                       033000      
001407                                                                  033100      
001408 01 WKS-FIN-RECEIVE              PIC 9(01).                       033200      
001409 01 WRK-R01-FECMOV               PIC 9(08).                       033300      
001410 01 WKS-R01-FECMOV-AUX     REDEFINES  WRK-R01-FECMOV.             033400      
001411    03 WKS-FECMOV-CC-AUX         PIC 9(02).                       033500      
001412    03 WKS-FECMOV-6D-AUX         PIC 9(06).                       033600      
001413                                                                  033700      
001414 01 WKS-NUM-CTE                  PIC X(12).                       033710      
001415 01 WKS-NUM-CTE-R            REDEFINES                            033720      
001416    WKS-NUM-CTE                   PIC 9(12).                      033730      
001417 01 WKS-NUM-CONTRATO              PIC X(16).                      033740      
001418 01 WKS-NUM-CONTRATO-R        REDEFINES                           033750      
001419    WKS-NUM-CONTRATO             PIC 9(16).                       033760      
001420 01 WKS-VAL-FIN                  PIC 9(01).                       033770      
001421 77 W77-ERROR                    PIC 9(02).                       033800      
001422 01 W77-RESULT-B01               PIC 9(08).                       033900      
001423 01 WKS-FECPRO-S500              PIC 9(08).                       034000      
001424 01 WKS-FECHA-PROCESO      REDEFINES WKS-FECPRO-S500.             034100      
001425    03 WKS-FECPRO-CC             PIC 9(02).                       034200      
001426    03 WKS-FECPRO-6D             PIC 9(06).                       034300      
001427    03 WKS-FECPRO-6D-R     REDEFINES WKS-FECPRO-6D.               034400      
001428       05 WKS-FECPRO-AA          PIC 9(02).                       034500      
001429       05 WKS-FECPRO-MM          PIC 9(02).                       034600      
001430       05 WKS-FECPRO-DD          PIC 9(02).                       034700      
001431                                                                  034800      
001432 01 WKS-HORA-MOV                 PIC 9(06).                       034900      
001433 01 WKS-HR-MOV             REDEFINES WKS-HORA-MOV.                035000      
001434    03 WKS-HH-MM                 PIC 9(04).                       035100      
001435    03 WKS-SS                    PIC 9(02).                       035200      
001436                                                                  035300      
001437 01 WKS-FECHAS.                                                   035400      
001438    03 WKS-FECHA-MAQUINA         PIC X(10) TYPE IS NUMERIC-DATE.  035500      
001439    03 WKS-FECHA-MAQUINA-R REDEFINES WKS-FECHA-MAQUINA.           035600      
001440       05 WKS-FECMAQ-MM          PIC 9(02).                       035700      
001441       05 WKS-DIAGONAL1          PIC X(01).                       035800      
001442       05 WKS-FECMAQ-DD          PIC 9(02).                       035900      
001443       05 WKS-DIAGONAL2          PIC X(01).                       036000      
001444       05 WKS-FECMAQ-AAAA        PIC 9(04).                       036100      
001445       05 WKS-FECMAQ-AAAA-R      REDEFINES WKS-FECMAQ-AAAA.       036200      
001446          07 WKS-FECMAQ-CC       PIC 9(02).                       036300      
001447          07 WKS-FECMAQ-AA       PIC 9(02).                       036400      
001448    03 WKS-FECHA-MAQ-8D.                                          036500      
001449       05 WKS-CC-MAQ             PIC 9(02).                       036600      
001450       05 WKS-FECHA-MAQ-6D.                                       036700      
001451          07 WKS-AA-MAQ          PIC 9(02).                       036800      
001452          07 WKS-MM-MAQ          PIC 9(02).                       036900      
001453          07 WKS-DD-MAQ          PIC 9(02).                       037000      
001454       05 WKS-FECHA-MAQ-6D-R REDEFINES WKS-FECHA-MAQ-6D PIC 9(06).037100      
001455    03 WKS-FECHA-MAQ-ANT-8D.                                      037200      
001456       05 WKS-CC-MAQ-ANT         PIC 9(02).                       037300      
001457       05 WKS-FECHA-MAQ-ANT-6D.                                   037400      
001458          07 WKS-AA-MAQ-ANT      PIC 9(02).                       037500      
001459          07 WKS-MM-MAQ-ANT      PIC 9(02).                       037600      
001460          07 WKS-DD-MAQ-ANT      PIC 9(02).                       037700      
001461 01 WKS-HR-MAQUINA               PIC 9(08) TYPE IS NUMERIC-TIME.  037800      
001462 01 WKS-HR-MAQUINA-R             REDEFINES WKS-HR-MAQUINA.        037900      
001463    03 WKS-HH-MAQUINA            PIC 9(02).                       038000      
001464    03 WKS-DP1-MAQUINA           PIC X(01).                       038100      
001465    03 WKS-MM-MAQUINA            PIC 9(02).                       038200      
001466    03 WKS-DP2-MAQUINA           PIC X(01).                       038300      
001467    03 WKS-SS-MAQUINA            PIC 9(02).                       038400      
001468 01 WKS-HR-MAQUINA-RR      REDEFINES WKS-HR-MAQUINA PIC X(08).    038450      
001469 01 WKS-SEG-MAQUINA              PIC 9(08).                       038500      
001470*INICIO JMLT                                                      038525      
001471 01 WKS-SEG-MAQUINA2             PIC 9(08).                       038550      
001472*FIN JMLT                                                         038575      
001473 01 WKS-SEG-MAQUINA-ANT          PIC 9(08).                       038600      
001474 01 WKS-BASURA                   PIC X(10).                       038700      
001475 01 WKS-ESPERACOMS-TIPO-EVENTO   PIC 9(11).                       038710      
001476 01 WKS-COMS-IN-STATUS-KEY       PIC X(22).                       038720      
001477 01 W77-INTENTO                  PIC 9(02).                       038800      
001478 01 WKS-HORA                     PIC 9(08) TYPE IS NUMERIC-TIME.  038810      
001479 01 WKS-HORA2-R                  REDEFINES WKS-HORA.              038820      
001480    03 WKS-HORA-HH               PIC 9(02).                       038830      
001481    03 WKS-HORA-DP1              PIC X(01).                       038840      
001482    03 WKS-HORA-MM               PIC 9(02).                       038850      
001483    03 WKS-HORA-DP2              PIC X(01).                       038860      
001484    03 WKS-HORA-SS               PIC 9(02).                       038870      
001485 01 WKS-HORA-RR      REDEFINES WKS-HORA PIC X(08).                038880      
001486*INICIO JMLT NUEVA VARIABLE PARA FECHA                            038881      
001487 01 WKS-FEC-MAQ.                                                  038882      
001488     05  WKS-FEC-MAQ-YYYY.                                        038883      
001489        10  WKS-FEC-MAQ-CC      PIC 9(02).                        038884      
001490        10  WKS-FEC-MAQ-YY      PIC 9(02).                        038885      
001491     05  WKS-FEC-MAQ-MM         PIC 9(02).                        038886      
001492     05  WKS-FEC-MAQ-DD         PIC 9(02).                        038887      
001493*FIN JMLT NUEVA VARIABLE PARA FECHA                               038888      
001494****************************************************************  038900      
001495*              RUTINAS PARA LIBRERIA CONCEPTOS                 *  039000      
001496****************************************************************  039100      
001497 01 WKS-CTLVER-LIBID             PIC X(12).                       039200      
001498 01 WKS-CTLVER-NOMLIB            PIC X(72).                       039300      
001499 01 W77-CTLVER-RESULT            PIC S9(11) BINARY.               039400      
001500                                                                  039500      
001501****************************************************************  039600      
001502*                       CSI COMS                               *  039700      
001503****************************************************************  039800      
001504 01 WKS-DATOS-HOST.                                               039900      
001505    03 WKS-NUMCSI-HOST           PIC 9(02).                       040000      
001506    03 WKS-NOMEQUIPO             PIC X(10).                       040100      
001507    03 WKS-NOMCSI                PIC X(26).                       040200      
001508    03 WKS-LINEA-BATCH           PIC X(05).                       040300      
001509                                                                  040400      
001510****************************************************************  040500      
001511*                   MENSAGE COMS                               *  040600      
001512****************************************************************  040700      
001513*01  WKS-REG-MSG               PIC X(1920) WITH LOWER-BOUNDS.     040800      
001514 01  WKS-REG-MSG               PIC X(534) WITH LOWER-BOUNDS.      040900      
001515 01  WKS-REG-MSG-R REDEFINES WKS-REG-MSG.                         041000      
001516     03  WKS-HDR-MSG.                                             041100      
001517         05  WKS-HDR-PREFIJO                      PIC X(001).     041200      
001518         05  WKS-HDR-APLDEST                      PIC X(001).     041300      
001519         05  WKS-HDR-CCRDEST                      PIC 9(002).     041400      
001520         05  WKS-HDR-LSNORGN                      PIC 9(004).     041500      
001521         05  WKS-HDR-LSNORGN-H                    REDEFINES       041600      
001522             WKS-HDR-LSNORGN                      PIC 9(08) COMP. 041700      
001523         05  WKS-HDR-STATION                      PIC X(008).     041800      
001524         05  WKS-HDR-STATION-R REDEFINES WKS-HDR-STATION.         041900      
001525             07  WKS-HDR-STA-TIPO                 PIC X(001).     042000      
001526             07  WKS-HDR-STA-SUC                  PIC 9(004).     042100      
001527             07  WKS-HDR-STA-PRIV                 PIC X(001).     042200      
001528             07  WKS-HDR-STA-CAJA                 PIC 9(002).     042300      
001529         05  WKS-HDR-CCRORGN                      PIC 9(002).     042400      
001530         05  WKS-HDR-COPORGN                      PIC 9(002).     042500      
001531         05  WKS-HDR-FACULTAD                     PIC X(002).     042600      
001532         05  WKS-HDR-APLORIG                      PIC X(001).     042700      
001533         05  WKS-HDR-RSLTDO                       PIC 9(002).     042800      
001534             88  W88-HDR-VINO-TERM            VALUE 11, 12.       042900      
001535             88  W88-HDR-VINO-APLI            VALUE 02, 04.       043000      
001536             88  W88-MSGRES-REDFOR            VALUE 12.           043100      
001537             88  W88-MSGRES-MAS               VALUE 3.            043200      
001538             88  W88-MSGRES-TER               VALUE 1.            043300      
001539             88  W88-MSGRES-ERR               VALUE 31, 32, 33.   043310      
001540         05  WKS-HDR-MASCARA                      PIC X(005).     043400      
001541         05  WKS-HDR-PASSWORD                     PIC X(006).     043500      
001542     03  WKS-MSG-TEXTO                            PIC X(498).     043600      
001543     03  WKS-MSG-TEXTO-R REDEFINES WKS-MSG-TEXTO.                 043700      
001544         05  WKS-ACA.                                             043800      
001545             10  WKS-ACA-DESTINO                  PIC 9(06).      043900      
001546             10  WKS-ACA-ORIGEN                   PIC 9(06).      044000      
001547         05  WKS-SA0.                                             044100      
001548             10  WKS-SA0-TRN-DEST                 PIC 9(09).      044200      
001549             10  WKS-SA0-TRN-DEST-R REDEFINES WKS-SA0-TRN-DEST.   044300      
001550                 15  WKS-SA0-TRN-DSIS             PIC 9(04).      044400      
001551                     88 W88-SA0-TRN-DSIS-S151     VALUE 0151.     044500      
001552                 15  WKS-SA0-TRN-DCOD             PIC 9(02).      044600      
001553                 15  WKS-SA0-TRN-DSCOD            PIC 9(03).      044700      
001554             10  WKS-SA0-TRN-ORIG                 PIC 9(09).      044800      
001555             10  WKS-SA0-TRN-DEST-O REDEFINES WKS-SA0-TRN-ORIG.   044900      
001556                 15  WKS-SA0-TRN-OSIS             PIC 9(04).      045000      
001557                     88 W88-SA0-TRN-OSIS-S702     VALUE 0702.     045100      
001558*INICIO JMLT AGREGAR VARIABLE                                     045130      
001559                     88 W88-SA0-TRN-OSIS-C845     VALUE 0845.     045160      
001560*FIN JMLT AGREGAR VARIABLE                                        045190      
001561                 15  WKS-SA0-TRN-OCOD             PIC 9(02).      045200      
001562                 15  WKS-SA0-TRN-OSCOD            PIC 9(03).      045300      
001563             10  WKS-SA0-DIRECCION                PIC 9(01).      045400      
001564                 88  W88-SA0-ALTA                 VALUE  1.       045500      
001565                 88  W88-SA0-RESP                 VALUE  2.       045600      
001566                 88  W88-SA0-BAJA                 VALUE  3.       045700      
001567                 88  W88-SA0-RES-BAJA             VALUE  4.       045800      
001568             10  WKS-SA0-LONG                     PIC 9(04).      045900      
001569             10  WKS-SA0-TIEMPO-ESPERA            PIC 9(05).      046000      
001570             10  WKS-SA0-RESPUESTA                PIC 9(02).      046100      
001571         05  WKS-SA2.                                             046200      
001572             10  WKS-SA2-ID-FMT.                                  046300      
001573                 15 WKS-SA2-IDENT-FMT             PIC 9(02).      046400      
001574                 15 WKS-SA2-RECONOC               PIC 9(01).      046500      
001575             10  WKS-SA2-VERSION                  PIC X(01).      046600      
001576             10  WKS-SA2-CLASE                    PIC 9(01).      046700      
001577             10  WKS-SA2-RESULTADO                PIC 9(01).      046800      
001578             10  WKS-SA2-MODO                     PIC 9(01).      046900      
001579             10  WKS-SA2-IDENTIFICACION.                          047000      
001580                 15  WKS-SA2-SUCURSAL             PIC 9(04).      047100      
001581                 15  WKS-SA2-IDEN-CAJA            PIC 9(03).      047200      
001582                 15  WKS-SA2-IDEN-CAJA-R                          047300      
001583                                   REDEFINES WKS-SA2-IDEN-CAJA.   047400      
001584                     20 WKS-SA2-PRIV              PIC X(01).      047500      
001585                     20 WKS-SA2-CAJA              PIC 9(02).      047600      
001586                 15  WKS-SA2-TRN-NUM              PIC 9(08).      047700      
001587                 15  WKS-SA2-FEC-HR               PIC 9(12).      047800      
001588                 15  WKS-SA2-FEC-HR-R REDEFINES  WKS-SA2-FEC-HR.  047900      
001589                     20 WKS-SA2-FECHA             PIC 9(06).      048000      
001590                     20 WKS-SA2-HORA              PIC 9(06).      048100      
001591             10  WKS-SA2-MODALIDAD                PIC 9(02).      048200      
001592             10  WKS-SA2-IEFE-NOPE                PIC X(10).      048300      
001593             10  WKS-SA2-IEFE-NOPE-R              REDEFINES       048400      
001594                 WKS-SA2-IEFE-NOPE.                               048500      
001595                 15  WKS-SA2-INDEFECTIVO          PIC X(01).      048600      
001596                 15  WKS-SA2-FILLER               PIC X(01).      048700      
001597                 15  WKS-SA2-OPERADOR             PIC X(08).      048800      
001598             10  WKS-SA2-IEFE-NOPE-R2             REDEFINES       048820      
001599                 WKS-SA2-IEFE-NOPE.                               048830      
001600                 15  WKS-SA2-FILLER-AUT           PIC 9(02).      048840      
001601                 15  WKS-SA2-AUT-S151             PIC 9(08).      048860      
001602             10  WKS-SA2-VER-OPC                  PIC X(01).      048900      
001603*JMLT    05  WKS-AREA-USUARIO                     PIC X(100).     049000      
001604*INICIO JMLT CAMBIAR LA LONGITUD DE WKS-AREA-USUARIO DE 100       049020      
001605*A 409                                                            049040      
001606         05  WKS-AREA-USUARIO                    PIC X(409).      049060      
001607*FIN JMLT                                                         049080      
001608                                                                  049100      
001609 01 WKS-AREA-MSG-OBL                             PIC X(409).      049200      
001610 01 WKS-AREA-MSG-OBL-SERV1 REDEFINES WKS-AREA-MSG-OBL.            049250      
001611    10  MSG-R01-CONTRATO                         PIC 9(16).       049300      
001612    10  MSG-R01-CVEMDA                           PIC 9(04).       049400      
001613    10  MSG-R01-MDA-SUC                          PIC 9(04).       049500      
001614    10  MSG-R01-MDA-CTA                          PIC 9(16).       049600      
001615    10  MSG-R01-AUTORIZA                         PIC 9(08).       049700      
001616    10  MSG-R01-REFNUM                           PIC 9(12).       049800      
001617    10  MSG-R01-AUT-S151                         PIC 9(08).       049900      
001618    10  MSG-R01-FECMOV                           PIC 9(06).       050000      
001619    10  MSG-R01-CVETRAN                          PIC 9(04).       050100      
001620    10  MSG-R01-OCCUR                            PIC 9(02).       050200      
001621    10  MSG-R01-IMPORTE                          PIC 9(14)V99.    050300      
001622    10  MSG-R01-ERROR                            PIC 9(04).       050400      
001623*INICIO JMLT                                                      050401      
001624    10  FILLER                                   PIC X(309).      050402      
001625 01 WKS-AREA-MSG-OBL-SERV2 REDEFINES WKS-AREA-MSG-OBL.            050403      
001626    05 MSG-R02-IDRUTEO            PIC X(05).                      050404      
001627    05 MSG-R02-AUTORIZA           PIC X(15).                      050405      
001628    05 MSG-R02-LONGITUD           PIC X(05).                      050406      
001629    05 MSG-R02-IFILEID.                                           050407      
001630       10  MSG-R02-IFILEIDMX      PIC X(04).                      050408      
001631       10  MSG-R02-IFILEIDPROD    PIC X(04).                      050409      
001632       10  MSG-R02-IFILEIDA       PIC X(01).                      050410      
001633       10  MSG-R02-IFILEIDFEC     PIC X(08).                      050411      
001634       10  MSG-R02-IFILEIDHORA    PIC X(08).                      050412      
001635    05 MSG-R02-COUNTRY            PIC X(02).                      050413      
001636    05 MSG-R02-CUSTIDN.                                           050414      
001637          10 MSG-R02-CUSTID       PIC X(12).                      050415      
001638          10 MSG-R02-SPACES       PIC X(03).                      050416      
001639    05 MSG-R02-ACCNUM             PIC X(16).                      050417      
001640    05 MSG-R02-FIELDID            PIC X(05).                      050418      
001641    05 MSG-R02-FILTSR             PIC X(01).                      050419      
001642    05 MSG-R02-FILTID             PIC X(01).                      050420      
001643    05 MSG-R02-VALUE.                                             050421      
001644*       10  MSG-R02-VALUESIGN      PIC X(01).                     050422      
001645       10  MSG-R02-VALUESALDO     PIC X(15).                      050423      
001646    05 MSG-R02-ACCNUMH            PIC X(07).                      050424      
001647    05 MSG-R02-ACCNUMD.                                           050425      
001648       10  MSG-R02-ACCNUMD-AST    PIC X(03).                      050426      
001649       10  MSG-R02-ACCNUMD-THR    PIC 9(03).                      050427      
001650    05 MSG-R02-BEFBAL             PIC X(15).                      050428      
001651    05 MSG-R02-CURRBAL.                                           050429      
001652       10  MSG-R02-CURRBALSIGN    PIC X(01).                      050430      
001653       10  MSG-R02-CURRBALSALDO   PIC X(14).                      050431      
001654    05 MSG-R02-CUTDATE            PIC X(02).                      050432      
001655    05 MSG-R02-PAYDATE            PIC X(08).                      050433      
001656    05 MSG-R02-MINDATE            PIC X(15).                      050434      
001657    05 MSG-R02-CREDDLIM           PIC X(15).                      050435      
001658    05 MSG-R02-AVACRED            PIC X(15).                      050436      
001659    05 MSG-R02-MOVIND             PIC X(30).                      050437      
001660    05 MSG-R02-TRANDATE.                                          050438      
001661       10  MSG-R02-CC             PIC X(02).                      050439      
001662       10  MSG-R02-FECHA          PIC X(06).                      050440      
001663       10  MSG-R02-HORA           PIC X(04).                      050441      
001664    05 MSG-R02-REF                PIC X(40).                      050442      
001665    05 MSG-R02-REPID              PIC X(02).                      050443      
001666    05 MSG-R02-CVEMDA             PIC X(01).                      050444      
001667    05 MSG-R02-SHARP              PIC X(01).                      050445      
001668    05 MSG-R02-PRNAME             PIC X(33).                      050446      
001669    05 MSG-R02-CURRCODE           PIC X(02).                      050447      
001670    05 MSG-R02-TRANMEANID         PIC X(05).                      050448      
001671    05 MSG-R02-TRANMEAN           PIC X(30).                      050449      
001672    05 MSG-R02-PRODNUM            PIC X(20).                      050450      
001673    05 MSG-R02-TIMESTAMP.                                         050451      
001674       10  MSG-R02-FEC            PIC X(08).                      050452      
001675       10  MSG-R02-HOR            PIC X(06).                      050453      
001676    05 MSG-R02-SERV-NOTALERT      PIC X(04).                      050454      
001677    05 MSG-R02-FECCON             PIC X(06).                      050455      
001678    05 MSG-R02-CVETRAN            PIC X(06).                      050456      
001679                                                                  050457      
001680*VARIABLE MIX                                                     050461      
001681 01 WS00-MIX      PIC 9(07) VALUE 0.                              050462      
001682                                                                  050463      
001683*VARIABLES PARA DIALOGO                                           050464      
001684 01 WKS-IMPORTE   PIC 9(12)V99.                                   050465      
001685 01 WKS-IMPALPHA  REDEFINES WKS-IMPORTE  PIC X(15).               050466      
001686 01 WKS-MDA       PIC 9(03).                                      050467      
001687 01 WKS-MON       PIC 9(02).                                      050468      
001688 01 WKS-SERVAL    PIC 9(04).                                      050469      
001689 01 WKS-AUT-APLIC PIC 9(07).                                      050470      
001690*FIN JMLT                                                         050471      
001691                                                                  050500      
001692*INICIO JMLT AUXILIARES JUSTIFICACION                             050505      
001693 01  WKS-AUX1.                                                    050510      
001694    05 WKS-AUX1-ARR OCCURS 16.                                    050515      
001695          10 WKS-AUX1-VAL1 PIC X(01).                             050520      
001696                                                                  050525      
001697 01  WKS-AUX2.                                                    050530      
001698    05 WKS-AUX2-ARR OCCURS 21.                                    050535      
001699          10 WKS-AUX2-VAL2 PIC X(01).                             050540      
001700                                                                  050545      
001701 01  WKS-AUX3.                                                    050550      
001702    05 WKS-AUX3-ARR OCCURS 21.                                    050555      
001703          10 WKS-AUX3-VAL3 PIC X(01).                             050560      
001704                                                                  050565      
001705 01  WKS-COUNTER1         PIC 9(02).                              050570      
001706 01  WKS-COUNTER2         PIC 9(02).                              050575      
001707 01  WKS-LIMITE           PIC 9(02) VALUE 16.                     050580      
001708 01  WKS-VARAUX           PIC Z(15)9(01).                         050582      
001709 01  WKS-VARMONTO         PIC 9(16)V99.                           050583      
001710 01  WKS-VAREDIT          PIC Z(16).99.                           050584      
001711*FIN JMLT AUXILIARES JUSTIFICACION                                050585      
001712 01  WKS-CSIDEST          PIC 9(02).                              050600      
001713****************************************************************  050700      
001714*                    VARIABLES MANEJO DE ERROR                 *  050800      
001715****************************************************************  050900      
001716 01 WKS-DMCATEGORY                               PIC 9(04).       051000      
001717 01 WKS-DMERRORTYPE                              PIC 9(04).       051100      
001718 01 WKS-DMSTRUCTURE                              PIC 9(04).       051200      
001719 01 WKS-DMS-DSCERR                               PIC X(140).      051300      
001720****************************************************************  051400      
001721*   DESCRIPCION DE FORMATOS DE LLAMADO A LIBRERIA DE CONTROL   *  051500      
001722****************************************************************  051600      
001723*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001724* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         051700      
001725*================================================================ 000100      
001726*         ENTRY-POINT CONSISDIA :                               = 000200      
001727*                                                                 000300      
001728* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
001729* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
001730* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
001731* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
001732* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
001733* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
001734* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
001735* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
001736* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
001737* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
001738*                                                               = 001400      
001739*================================================================ 001500      
001740                                                                  001600      
001741                                                                  001700      
001742*================================================================ 001800      
001743* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
001744*                                                               = 002000      
001745* ENTRADA REQUERIDA :                                           = 002100      
001746*                                                               = 002200      
001747*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
001748*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
001749*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
001750*================================================================ 002600      
001751 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
001752    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
001753    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
001754    03 WKS-B01-CSI                 PIC 9(02).                     003000      
001755    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
001756    03 WKS-B01-FECCON              PIC 9(08).                     003202      
001757    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
001758    03 WKS-B01-STAREG              PIC 9(02).                     003400      
001759    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
001760    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
001761    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
001762    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
001763    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
001764    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
001765    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
001766    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
001767    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
001768    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
001769    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
001770    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
001771    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
001772       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
001773       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
001774       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
001775       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
001776*==============================================================   005200      
001777*                                                             =   005300      
001778* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
001779*                                                             =   005500      
001780* CAMPOS REQUERIDOS :                                         =   005600      
001781*                                                             =   005700      
001782* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
001783* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
001784* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
001785* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
001786*==============================================================   006200      
001787 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
001788    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
001789    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
001790    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
001791    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
001792                                                                  006800      
001793*==============================================================   006900      
001794*                                                             =   007000      
001795* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
001796*                                                             =   007200      
001797* CAMPOS REQUERIDOS :                                         =   007300      
001798*                                                             =   007400      
001799* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
001800* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
001801* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
001802* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
001803*==============================================================   007900      
001804 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
001805    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
001806    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
001807    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
001808    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
001809                                                                  008500      
001810*==============================================================   008600      
001811*                                                             =   008700      
001812* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
001813*                                                             =   008900      
001814* CAMPOS REQUERIDOS :                                         =   009000      
001815*                                                             =   009100      
001816* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
001817* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
001818* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
001819* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
001820*==============================================================   009600      
001821 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
001822    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
001823    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
001824    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
001825    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
001826                                                                  010200      
001827*============================================================     010300      
001828* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
001829*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
001830*                                                           =     010600      
001831*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
001832*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
001833*                                                           =     010900      
001834*  ENTRADA REQUERIDA.                                       =     011000      
001835*                                                           =     011100      
001836*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
001837*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
001838*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
001839*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
001840*============================================================     011600      
001841                                                                  011700      
001842 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
001843     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
001844     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
001845     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
001846     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
001847                                                                  012300      
001848*=============================================================    012400      
001849*                                                            =    012500      
001850* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
001851*             B01-SIS-FECARMOV.                              =    012700      
001852*                                                            =    012800      
001853* ENTRADA REQUERIDAD :                                       =    012900      
001854*                                                            =    013000      
001855*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
001856*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
001857*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
001858*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
001859*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
001860*=============================================================    013600      
001861                                                                  013700      
001862 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
001863     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
001864     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
001865     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
001866     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
001867     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
001868*================================================================ 014400      
001869*                                                               = 014500      
001870* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
001871*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
001872*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
001873*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
001874*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
001875*                                                               = 015100      
001876* ENTRADA REQUERIDA :                                           = 015200      
001877*                                                               = 015300      
001878* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
001879* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
001880* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
001881* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
001882* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
001883*================================================================ 015900      
001884 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
001885    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
001886    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
001887    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
001888    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
001889    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
001890                                                                  016600      
001891*============================================================     016700      
001892*                                                           =     016800      
001893* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
001894*                                                           =     017000      
001895* DATOS REQUERIDOS :                                        =     017100      
001896*                                                           =     017200      
001897* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
001898* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
001899* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
001900* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
001901* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
001902*============================================================     017800      
001903                                                                  017900      
001904 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
001905     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
001906     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
001907     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
001908     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
001909     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
001910                                                                  018600      
001911*============================================================     018700      
001912*                                                           =     018800      
001913* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
001914*                                                           =     019000      
001915* DATOS REQUERIDOS :                                        =     019100      
001916*                                                           =     019200      
001917* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
001918* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
001919* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
001920* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
001921* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
001922*============================================================     019800      
001923                                                                  019900      
001924 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
001925     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
001926     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
001927     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
001928     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
001929     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
001930                                                                  020600      
001931*===============================================================  020700      
001932*                                                              =  020800      
001933* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
001934*              MOVIMIENTOS.                                    =  021000      
001935* DATOS REQUERIDOS :                                           =  021100      
001936*                                                              =  021200      
001937* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
001938* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
001939* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
001940* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
001941* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
001942* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
001943*==============================================================   021900      
001944                                                                  022000      
001945 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
001946     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
001947     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
001948     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
001949     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
001950     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
001951     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
001952*==============================================================   022800      
001953*                                                             =   022900      
001954* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
001955*                                                             =   023100      
001956* CAMPOS REQUERIDOS :                                         =   023200      
001957*                                                             =   023300      
001958* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
001959* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
001960* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
001961* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
001962*==============================================================   023800      
001963 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
001964    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
001965    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
001966    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
001967    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
001968                                                                  024304      
001969*=================================================================024306      
001970*                ENTRY POINT CONSISB01                           =024308      
001971*                                                                =024310      
001972*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
001973*                                                                =024314      
001974*  FUNCIONES DISPONIBLES :                                       =024316      
001975*                                                                =024318      
001976*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
001977*                                                                =024322      
001978*  PARAMETROS REQUERIDOS                                         =024324      
001979*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
001980*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
001981*=================================================================024330      
001982                                                                  024332      
001983 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
001984     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
001985     03 WKS-CON-CSI                PIC 9(02).                     024336      
001986     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
001987     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
001988        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
001989        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
001990        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
001991        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
001992        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
001993                                                                  024400      
001994*=================================================================024500      
001995*                ENTRY POINT B02ARCINTER                         =024600      
001996*                                                                =024700      
001997*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
001998*                                                                =024900      
001999*  FUNCIONES DISPONIBLES :                                       =025000      
002000*                                                                =025100      
002001*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
002002* 19.- ALTAS DE ARCHIVOS.                                        =025300      
002003* 22.- BAJAS DE ARCHIVOS.                                        =025400      
002004* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
002005*                                                                =025600      
002006*  PARAMETROS REQUERIDOS                                         =025700      
002007*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
002008*                                                                =025900      
002009*=================================================================026000      
002010 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
002011     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
002012     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
002013     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
002014     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
002015     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
002016     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
002017     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
002018     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
002019     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
002020     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
002021     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
002022     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
002023     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
002024     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
002025     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
002026     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
002027     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
002028     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
002029     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
002030     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
002031     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
002032     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
002033     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
002034     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
002035     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
002036     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
002037     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
002038     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
002039                                                                  029000      
002040*=================================================================029100      
002041*                ENTRY POINT B04SISTEMA                          =029200      
002042*                                                                =029300      
002043*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
002044*                                                                =029500      
002045*  FUNCIONES DISPONIBLES :                                       =029600      
002046*                                                                =029700      
002047*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
002048*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
002049*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
002050*                                                                =030100      
002051*  PARAMETROS REQUERIDOS                                         =030200      
002052*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
002053*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
002054*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
002055*                                                                =030600      
002056*=================================================================030700      
002057 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
002058     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
002059     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
002060     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
002061     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
002062     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
002063     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
002064     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
002065                                                                  031600      
002066*================================================================ 031700      
002067*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
002068*                                                               = 031900      
002069*  FUNCION                                                      = 032000      
002070*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
002071*   19       ALTAS.                                             = 032200      
002072*   22       BAJAS                                              = 032300      
002073*   37       CAMBIOS.                                           = 032400      
002074*                                                               = 032500      
002075*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
002076*                      FECHA DE PROCESO                         = 032700      
002077*                      NUMERO DE PROCESO                        = 032800      
002078*                      FECHA INICIO                             = 032900      
002079*                      REGISTRO INICIAL                         = 033000      
002080*================================================================ 033100      
002081                                                                  033200      
002082 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
002083     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
002084     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
002085     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
002086     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
002087     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
002088     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
002089     03 WKS-B05-MIX                PIC 9(08).                     034000      
002090     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
002091     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
002092     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
002093     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
002094     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
002095     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
002096                                                                  034700      
002097                                                                  034800      
002098*================================================================ 034900      
002099*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
002100*                                                               = 035100      
002101*  FUNCION                                                      = 035200      
002102*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
002103*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
002104*                                                               = 035500      
002105*================================================================ 035600      
002106                                                                  035700      
002107 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
002108     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
002109     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
002110     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
002111     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
002112     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
002113     03 WKS-B09-NOMREN             PIC X(15).                     036400      
002114                                                                  036500      
002115*===============================================================  036600      
002116*                                                              =  036700      
002117*         ENTRY-POINT CONSISMEN                                =  036800      
002118*                                                              =  036900      
002119*   DATOS REQUERIDOS : FUNCION                                 =  037000      
002120*                      SISTEMA                                 =  037100      
002121*                                                              =  037200      
002122*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
002123*                                                              =  037400      
002124*===============================================================  037500      
002125 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
002126     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
002127     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
002128     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
002129     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
002130     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
002131     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
002132     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
002133     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
002134     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
002135     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
002136     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
002137     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
002138     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
002139     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
002140     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
002141        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
002142        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
002143        05 WKS-B03-AAMM            PIC 9(06).                     039402      
002144        05 WKS-B03-SECOK           PIC 9(10).                     039500      
002145        05 WKS-B03-SECINF          PIC 9(10).                     039600      
002146        05 WKS-B03-SECERR          PIC 9(10).                     039700      
002147        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
002148                                                                  039900      
002149*=====================================================            040000      
002150*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
002151*=====================================================            040200      
002152 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
002153     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
002154     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
002155     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
002156                                                                  040700      
002157*=====================================================            040800      
002158*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
002159*=====================================================            041000      
002160 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
002161     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
002162     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
002163     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
002164                                                                  041500      
002165*=====================================================            041600      
002166*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
002167*=====================================================            041800      
002168 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
002169     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
002170     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
002171     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
002172*=====================================================            042300      
002173*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
002174*=====================================================            042500      
002175 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
002176     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
002177     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
002178     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
002179                                                                  043000      
002180*=====================================================            043100      
002181*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
002182*=====================================================            043300      
002183 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
002184     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
002185     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
002186     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
002187                                                                  043800      
002188*=====================================================            043900      
002189*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
002190*=====================================================            044100      
002191 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
002192     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
002193     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
002194     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
002195                                                                  044600      
002196*=====================================================            044700      
002197*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
002198*=====================================================            044900      
002199 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
002200     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
002201     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
002202     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
002203                                                                  045400      
002204*=====================================================            045500      
002205*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
002206*=====================================================            045700      
002207 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
002208     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
002209     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
002210     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
002211                                                                  046200      
002212*=====================================================            046300      
002213*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
002214*=====================================================            046500      
002215 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
002216     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
002217     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
002218     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
002219                                                                  047000      
002220*=====================================================            047100      
002221*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
002222*=====================================================            047300      
002223 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
002224     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
002225     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
002226     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
002227                                                                  047800      
002228*=====================================================            047900      
002229*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
002230*=====================================================            048100      
002231 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
002232     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
002233     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
002234     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
002235                                                                  048600      
002236*=====================================================            048700      
002237*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
002238*=====================================================            048900      
002239 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
002240     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
002241     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
002242     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
002243                                                                  049400      
002244*=====================================================            049500      
002245*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
002246*=====================================================            049700      
002247 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
002248     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
002249     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
002250     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
002251     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
002252     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
002253     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
002254     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
002255     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
002256     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
002257     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
002258                                                                  050900      
002259*=====================================================            051000      
002260*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
002261*=====================================================            051200      
002262 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
002263     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
002264     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
002265     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
002266     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
002267                                                                  051800      
002268*=====================================================            051900      
002269*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
002270*=====================================================            052100      
002271 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
002272     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
002273     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
002274     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
002275     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
002276                                                                  052700      
002277*=====================================================            052800      
002278*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
002279*=====================================================            053000      
002280 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
002281     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
002282     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
002283     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
002284     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
002285                                                                  053600      
002286*=====================================================            053700      
002287*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
002288*=====================================================            053900      
002289 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
002290     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
002291     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
002292     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
002293     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
002294                                                                  054500      
002295*=====================================================            054600      
002296*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
002297*=====================================================            054800      
002298 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
002299     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
002300     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
002301     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
002302     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
002303                                                                  055400      
002304*=====================================================            055500      
002305*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
002306*=====================================================            055700      
002307 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
002308     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
002309     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
002310     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
002311     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
002312                                                                  056300      
002313*=====================================================            056400      
002314*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
002315*=====================================================            056600      
002316 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
002317     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
002318     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
002319     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
002320     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
002321                                                                  057200      
002322 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
002323*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002324 77 W77-MSG-OK                   PIC 9(02).                       051800      
002325 88 W88-MSG-OK                   VALUE 1.                         051900      
002326 01 WKS-B05-HORAINI-AUX.                                          051940      
002327    10 WKS-B05-HORAINI-AUX-HH PIC 9(02).                          051943      
002328    10 WKS-B05-HORAINI-AUX-MM PIC 9(02).                          051946      
002329    10 WKS-B05-HORAINI-AUX-SS PIC 9(02).                          051949      
002330 01 WKS-B05-HORAINI-R   REDEFINES WKS-B05-HORAINI-AUX PIC X(06).  051950      
002331                                                                  051960      
002332 01 WKS-B05-HORAFIN-AUX.                                          051970      
002333    10 WKS-B05-HORAFIN-AUX-HH PIC 9(02).                          051971      
002334    10 WKS-B05-HORAFIN-AUX-MM PIC 9(02).                          051972      
002335    10 WKS-B05-HORAFIN-AUX-SS PIC 9(02).                          051973      
002336 01 WKS-B05-HORAFIN-R   REDEFINES WKS-B05-HORAFIN-AUX PIC X(06).  051975      
002337 LINKAGE SECTION.                                                 052000      
002338                                                                  052100      
002339 01 WKS-COMS-MY-PROGRAM-NAME     PIC X(0018).                     052200      
002340 77 W77-COMS-MY-PROGRAM-DESG     REAL.                            052300      
002341                                                                  052400      
002342 01 WKS-COMS-EX-AGENDA-NAME.                                      052500      
002343    03 FILLER                    PIC X(01) VALUE   "S".           052600      
002344    03 WKS-COMS-EX-AGENDA-SIS    PIC 9(03) VALUE   151.           052700      
002345    03 WKS-COMS-EX-AGENDA-MOD    PIC 9(02) VALUE    14.           052800      
002346                                                                  052900      
002347 77 W77-COMS-EX-AGENDA-DESG      REAL.                            053000      
002348                                                                  053100      
002349 01 WKS-COMS-AG-SALIDA-NAME      PIC X(50).                       053200      
002350 77 W77-COMS-AG-SALIDA-DESG      REAL.                            053300      
002351 77 W77-COMS-RESULT              PIC S9(011) BINARY.              053400      
002352    88 W88-COMS-OK               VALUE     0.                     053500      
002353 01 WKS-COMS-DEFSTATION-NAME     PIC X(18).                       053600      
002354 77 W77-COMS-DEFSTATION-DESG     REAL.                            053700      
002355 01 WKS-NOAPLINCLUDE-PARAMETRO   PIC  X(30).                      053800      
002356 77 W77-NOAPLINCLUDE-DESG        REAL.                            053900      
002357 77 W77-NOAPL-RESULT             PIC S9(11) BINARY.               054000      
002358    88 W88-NOAPL-OK              VALUE 0.                         054100      
002359 77 W77-ACEPTA-MSG               PIC S9(11) BINARY.               054200      
002360    88 W88-ACEPTA-MSG            VALUE 1.                         054300      
002361 77 W77-ESPERACOMS-TIEMPO        PIC S9(11) BINARY VALUE 2.       054400      
002362 01 WKS-TIEMPO                   PIC  9(02).                      054450      
002363 77 W77-ESPERACOMS-TIPO-EVENTO   PIC S9(11) BINARY.               054500      
002364    88 W88-POR-MSG               VALUE  1.                        054600      
002365    88 W88-POR-ACCEPT            VALUE  2.                        054700      
002366    88 W88-POR-HI                VALUE  3.                        054800      
002367    88 W88-POR-TIMEOUT           VALUE  4.                        054900      
002368    88 W88-POR-EVENTO            VALUE  5.                        055000      
002369 01 WKS-TIPO-EVENTO              PIC 9(02).                       055100      
002370 77 W77-EVENTO                   USAGE IS EVENT.                  055200      
002371 01 WKS-SMCOMS-COMANDO.                                           055300      
002372    03 WKS-SMCOMS-STRING1        PIC X(20).                       055400      
002373    03 WKS-SMCOMS-STRING2        PIC X(20).                       055500      
002374 01 WKS-SMCOMS-TRABAJO           PIC X(132).                      055600      
002375 77 W77-SMCOMS-RESULT            PIC S9(11) BINARY.               055700      
002376    88 W88-SMCOMS-OK             VALUE 0.                         055800      
002377 77 W77-STATUS-KEY               PIC 9(04).                       055900      
002378                                                                  056000      
002379 77 W77-LLAVE                    PIC 9(08) VALUE ZERO.            056100      
002380 77 W77-MOV-NIVDES               PIC 9(08) VALUE ZERO.            056200      
002381 01 WKS-SEC-REF-CTE              PIC X(10) VALUE ZERO.            056300      
002382                                                                  056400      
002383 77 W77-CLAVES-EXCLUIDAS          PIC 9(04).                      056410      
002384    88 W88-CLAVES-EXCLUIDAS VALUE 526, 527, 532, 534, 571, 579,   056420      
002385                                  2017, 2020, 2103, 2105, 2115,   056430      
002386                                  2131, 2141, 2268, 2334, 2336.   056440      
002387                                                                  056450      
002388 COMMUNICATION SECTION.                                           056500      
002389 INPUT  HEADER COMS-IN;                                           056600      
002390        PROGRAMDESG              IS CS-COMS-IN-PROGRAM;           056700      
002391        FUNCTIONSTATUS           IS CS-COMS-IN-FUNCTION-STATUS;   056800      
002392        FUNCTIONINDEX            IS CS-COMS-IN-FUNCTION-INDEX;    056900      
002393        USERCODE                 IS CS-COMS-IN-USERCODE;          057000      
002394        SECURITYDESG             IS CS-COMS-IN-SECURITY-DESG;     057100      
002395        TRANSPARENT              IS CS-COMS-IN-TRANSPARENT;       057200      
002396        VTFLAG                   IS CS-COMS-IN-VT-FLAG;           057300      
002397        TIMESTAMP                IS CS-COMS-IN-TIMESTAMP;         057400      
002398        STATION                  IS CS-COMS-IN-STATION;           057500      
002399        TEXTLENGTH               IS CS-COMS-IN-TEXT-LENGTH;       057600      
002400        STATUSVALUE              IS CS-COMS-IN-STATUS-KEY;        057700      
002401        MESSAGECOUNT             IS CS-COMS-IN-MSG-COUNT;         057800      
002402        RESTART                  IS CS-COMS-IN-RST-LOC;           057900      
002403        AGENDA                   IS CS-COMS-IN-AGENDA.            058000      
002404 OUTPUT HEADER COMS-OUT;                                          058100      
002405        DESTCOUNT              IS CS-COMS-OUT-COUNT;              058200      
002406        TEXTLENGTH             IS CS-COMS-OUT-TEXT-LENGTH;        058300      
002407        STATUSVALUE            IS CS-COMS-OUT-STATUS-KEY;         058400      
002408        TRANSPARENT            IS CS-COMS-OUT-TRANSPARENT;        058500      
002409        VTFLAG                 IS CS-COMS-OUT-VT-FLAG;            058600      
002410        CONFIRMFLAG            IS CS-COMS-OUT-CONFIRM-FLAG;       058700      
002411        CONFIRMKEY             IS CS-COMS-OUT-CONFIRM-KEY;        058800      
002412        DESTINATIONDESG        IS CS-COMS-OUT-DESTINATION;        058900      
002413        NEXTINPUTAGENDA        IS CS-COMS-OUT-NEXT-INPUT-AGENDA;  059000      
002414        SETNEXTINPUTAGENDA     IS CS-COMS-OUT-SNEXT-INPUT-AGENDA; 059100      
002415        RETAINTRANSACTIONMODE  IS CS-COMS-OUT-SAVE-TRANS-MODE;    059200      
002416        AGENDA                 IS CS-COMS-OUT-AGENDA.             059300      
002417 PROCEDURE DIVISION.                                              059400      
002418 DECLARATIVES.                                                    059500      
002419 INTERRUPT-BY-HI SECTION.                                         059600      
002420     USE AS INTERRUPT PROCEDURE.                                  059700      
002421 000A-BEGIN-INTERRUPT.                                            059800      
002422    DISALLOW INTERRUPT.                                           059900      
002423    MOVE "I"                           TO TIPO-LJ.                060000      
002424    MOVE 050104                        TO CODIGO-LJ.              060100      
002425    MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-HI2.                060105      
002426    MOVE WKS-HIT2 TO W77-HI.                                      060110      
002427    IF  HI-90                                                     060115      
002428*cambiamos el valo de la variable de ENVIO DE MOVS-REINT          060120      
002429         PERFORM 020810-OBTEN-NUM-ENV-PEND                        060130      
002430         MOVE 37            TO WKS-B05-FUNCION                    060140      
002431         MOVE WKS-HI-TRANS  TO WKS-B05-HORAINI                    060145      
002432                               W77-LIMITE-ENVIOS                  060150      
002433         MOVE W77-LIMITE-PENDIENTES                               060152      
002434                            TO WKS-B05-HORAFIN                    060154      
002435         PERFORM 000-CREA-REG-B05-NUMENV-PEND                     060155      
002436         STRING "SE CAMBIA VALOR DE LIMITE DE ENVIO DE MOVS "     060160      
002437                  " A WKS-HI-TRANS " DELIMITED BY SIZE            060165      
002438                  W77-LIMITE-ENVIOS                               060170      
002439         DELIMITED BY SIZE INTO TEXTO-LJ                          060175      
002440         MOVE TEXTO-LJ TO WKS-DIS-TEXTO                           060180      
002441         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ      060185      
002442         PERFORM 060700-DISPLAY                                   060190      
002443    ELSE                                                          060195      
002444    IF HI-80                                                      060200      
002445*CAMBIAMOS EL LIMITE DE PENDIENTES Y GUARADAMOS EN BASE DE DATOS. 060205      
002446         PERFORM 020810-OBTEN-NUM-ENV-PEND                        060220      
002447         MOVE 37                 TO WKS-B05-FUNCION               060230      
002448         MOVE WKS-HI-TRANS       TO WKS-B05-HORAFIN               060235      
002449                                    W77-LIMITE-PENDIENTES         060240      
002450         MOVE W77-LIMITE-ENVIOS  TO WKS-B05-HORAINI               060242      
002451         PERFORM 000-CREA-REG-B05-NUMENV-PEND                     060245      
002452         STRING "SE CAMBIA VALOR DE LIMITE DE ENVIO DE PENDIENTE" 060250      
002453                " A WKS-HI-TRANS " DELIMITED BY SIZE              060255      
002454                  W77-LIMITE-PENDIENTES                           060260      
002455         DELIMITED BY SIZE INTO TEXTO-LJ                          060300      
002456         MOVE TEXTO-LJ TO WKS-DIS-TEXTO                           060301      
002457         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ      060302      
002458         PERFORM 060700-DISPLAY                                   060303      
002459    ELSE                                                          060304      
002460    IF W88-HI-1                                                   060350      
002461*      MUESSTRA ESTADISTICO                                       060400      
002462                   PERFORM 800200-MUESTRA-ESTADISTICO             060500      
002463    ELSE                                                          060600      
002464    IF HI-24                                                      060610      
002465        MOVE WKS-HI-TRANS       TO WKS-CSIDEST                    060620      
002466         STRING "SE CAMBIA EL VALOR DEL CSI DESTINO "             060630      
002467                " A " DELIMITED BY SIZE                           060640      
002468                  WKS-CSIDEST                                     060650      
002469         DELIMITED BY SIZE INTO TEXTO-LJ                          060660      
002470         MOVE TEXTO-LJ TO WKS-DIS-TEXTO                           060670      
002471         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ      060680      
002472         PERFORM 060700-DISPLAY                                   060690      
002473    ELSE                                                          060695      
002474    IF W88-HI-2                                                   060700      
002475             MOVE "  SE ENCIENDE MONITOR "                        060800      
002476                                   TO TEXTO-LJ WKS-DIS-TEXTO      060850      
002477             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  060900      
002478             PERFORM 060700-DISPLAY                               061000      
002479             PERFORM 060800-ENCIENDE-MONITOR                      061100      
002480    ELSE                                                          061200      
002481    IF W88-HI-3                                                   061300      
002482    MOVE "  SE APAGA MONITOR " TO TEXTO-LJ WKS-DIS-TEXTO          061400      
002483             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  061500      
002484             PERFORM 060700-DISPLAY                               061600      
002485             PERFORM 060900-APAGA-MONITOR                         061700      
002486    ELSE                                                          061800      
002487    IF W88-HI-4 OR W88-HI-6                                       061900      
002488             MOVE SPACES                     TO TEXTO-LJ          062000      
002489             PERFORM 800100-HI-SALIDA                             062100      
002490    ELSE                                                          062200      
002491    IF W88-HI-7                                                   062205      
002492       MOVE "  SE DESHABILITO ENVIO MENSAJES ALERTAS "            062210      
002493                                    TO TEXTO-LJ WKS-DIS-TEXTO     062215      
002494       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        062220      
002495       PERFORM 060700-DISPLAY                                     062225      
002496       MOVE 0 TO W77-ENVIO-ALERTAS                                062230      
002497    ELSE                                                          062235      
002498    IF W88-HI-8                                                   062240      
002499       MOVE "  SE HABILITO ENVIO MENSAJES ALERTAS "               062245      
002500                                    TO TEXTO-LJ WKS-DIS-TEXTO     062250      
002501       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        062255      
002502       PERFORM 060700-DISPLAY                                     062260      
002503       MOVE 1 TO W77-ENVIO-ALERTAS                                062265      
002504    ELSE                                                          062267      
002505    IF W88-HI-9                                                   062269      
002506       STRING "  SE DESHABILITO ENVIO MENSAJES ALERTAS DE"        062271      
002507              " CLIENTES NO CONTRATADOS"                          062273      
002508              DELIMITED BY SIZE INTO TEXTO-LJ                     062275      
002509       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        062277      
002510       PERFORM 060700-DISPLAY                                     062279      
002511       PERFORM 020810-OBTEN-NUM-ENV-PEND                          062280      
002512       MOVE 0 TO W77-ENVIO-ALER-CLINOCON WKS-B05-STAPGM           062282      
002513       MOVE 37                 TO WKS-B05-FUNCION                 062284      
002514       PERFORM 000-CREA-REG-B05-NUMENV-PEND                       062286      
002515    ELSE                                                          062288      
002516    IF W88-HI-10                                                  062290      
002517       STRING "  SE HABILITO ENVIO MENSAJES ALERTAS DE CLIENTES"  062292      
002518              " NO CONTRATADOS"                                   062294      
002519              DELIMITED BY SIZE INTO TEXTO-LJ                     062296      
002520       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        062298      
002521       PERFORM 060700-DISPLAY                                     062300      
002522       PERFORM 020810-OBTEN-NUM-ENV-PEND                          062302      
002523       MOVE 1 TO W77-ENVIO-ALER-CLINOCON WKS-B05-STAPGM           062304      
002524       MOVE 37                 TO WKS-B05-FUNCION                 062306      
002525       PERFORM 000-CREA-REG-B05-NUMENV-PEND                       062308      
002526    ELSE                                                          062310      
002527    IF  W88-HI-17                                                 062312      
002528             ADD  1 TO W77-ESPERACOMS-TIEMPO                      062314      
002529             MOVE "  SE INCREMENTA EN 1 EL ESPERACOMS"            062316      
002530                                 TO TEXTO-LJ WKS-DIS-TEXTO        062318      
002531             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  062320      
002532             PERFORM 060700-DISPLAY                               062324      
002533    ELSE                                                          062328      
002534    IF  W88-HI-18                                                 062332      
002535              SUBTRACT 1 FROM W77-ESPERACOMS-TIEMPO               062336      
002536              MOVE "  SE DECREMENTA EN 1 EL ESPERACOMS "          062340      
002537                                  TO TEXTO-LJ WKS-DIS-TEXTO       062344      
002538              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 062348      
002539              PERFORM 060700-DISPLAY                              062352      
002540     ELSE                                                         062356      
002541     IF  W88-HI-19                                                062360      
002542              MOVE 3 TO W77-ESPERACOMS-TIEMPO                     062364      
002543              MOVE "  RESTABLECE EL VALOR DE ESPERACOMS "         062368      
002544                                  TO TEXTO-LJ WKS-DIS-TEXTO       062372      
002545              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 062376      
002546              PERFORM 060700-DISPLAY                              062380      
002547    ELSE                                                          062384      
002548    IF W88-HI-11                                                  062400      
002549                                                                  062500      
002550              MOVE 1      TO  WKS-REINTENTO                       062600      
002551              MOVE "  SE DESACTIVO REINTENTOS "                   062700      
002552                                  TO TEXTO-LJ WKS-DIS-TEXTO       062750      
002553              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 062800      
002554              PERFORM 060700-DISPLAY                              062900      
002555    ELSE                                                          063000      
002556    IF W88-HI-12                                                  063100      
002557*      ACTIVAR REINTENTOS                                         063200      
002558              MOVE 0      TO  WKS-REINTENTO                       063300      
002559              MOVE "  SE ACTIVO REINTENTOS "                      063400      
002560                                  TO TEXTO-LJ WKS-DIS-TEXTO       063450      
002561              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 063500      
002562              PERFORM 060700-DISPLAY                              063600      
002563    ELSE                                                          063603      
002564    IF  W88-HI-13                                                 063606      
002565              MOVE 1 TO WKS-INICIA-AUX                            063609      
002566              MOVE "  SE ACTIVO INICIO DE SERVICIO DEL PROGRAMA"  063612      
002567                                 TO TEXTO-LJ WKS-DIS-TEXTO        063615      
002568              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 063618      
002569              PERFORM 060700-DISPLAY                              063621      
002570    ELSE                                                          063624      
002571    IF  W88-HI-14                                                 063627      
002572              ADD  5 TO W77-LIMITE-ENVIOS                         063630      
002573              MOVE "  SE INCREMENTA EN 5 EL LIMITE POR ENVIOS"    063633      
002574                                 TO TEXTO-LJ WKS-DIS-TEXTO        063636      
002575              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 063639      
002576              PERFORM 060700-DISPLAY                              063642      
002577    ELSE                                                          063645      
002578    IF  W88-HI-15                                                 063648      
002579              SUBTRACT 5 FROM W77-LIMITE-ENVIOS                   063651      
002580              MOVE "  SE DECREMENTA EN 5 EL LIMITE DE ENVIOS "    063654      
002581                                 TO TEXTO-LJ WKS-DIS-TEXTO        063657      
002582              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 063660      
002583              PERFORM 060700-DISPLAY                              063663      
002584    ELSE                                                          063666      
002585    IF  W88-HI-16                                                 063669      
002586              MOVE 150 TO W77-LIMITE-ENVIOS                       063672      
002587              STRING " RESTABLECE EL VALOR DE LIMITE DE"          063675      
002588               DELIMITED BY SIZE                                  063676      
002589                     " ENVIOS EN 150 "                            063678      
002590               DELIMITED BY SIZE INTO TEXTO-LJ                    063681      
002591              MOVE TEXTO-LJ TO WKS-DIS-TEXTO                      063684      
002592              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 063687      
002593              PERFORM 060700-DISPLAY                              063690      
002594    ELSE                                                          063700      
002595*INICIO JMLT NUEVOS HI                                            063702      
002596    IF W88-HI-80                                                  063705      
002597*             MOVE LOW-VALUES TO CVETRAN-PC                       063710      
002598*             PERFORM 020700-CATALOGO                             063715      
002599              MOVE "  SE ACTIVO LLENADO DE CATALOGO "             063720      
002600                                 TO TEXTO-LJ WKS-DIS-TEXTO        063725      
002601              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 063730      
002602              PERFORM 060700-DISPLAY                              063735      
002603    ELSE                                                          063740      
002604    IF W88-HI-25                                                  063745      
002605             MOVE "  SE ACTIVO CAMBIO DE DIA "                    063750      
002606                           TO TEXTO-LJ WKS-DIS-TEXTO              063755      
002607             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  063760      
002608                                                                  063767      
002609                                                                  063768      
002610    ELSE                                                          063772      
002611*FIN JMLT                                                         063775      
002612             MOVE "     HI12   -> ACTIVA REINTENTOS   "           063800      
002613                                              TO TEXTO-LJ         063850      
002614             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  063900      
002615             MOVE "     HI11   -> DESACTIVA REINTENTOS"           064000      
002616                                              TO TEXTO-LJ         064050      
002617             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  064100      
002618             MOVE "     HI1   -> ESTATUS Y ESTADISTICAS ENVIO  "  064200      
002619                                              TO TEXTO-LJ         064300      
002620             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ. 064400      
002621                                                                  064500      
002622             CHANGE ATTRIBUTE TASKVALUE OF MYSELF TO 0.           064600      
002623                                                                  064700      
002624     ALLOW INTERRUPT.                                             064800      
002625 0000A-END.                                                       064900      
002626 END DECLARATIVES.                                                065000      
002627 010000-INICIO-PGMA SECTION.                                      065100      
002628 010100-INICIA-CONTROL.                                           065200      
002629    MOVE ":" TO WKS-DP1-MAQUINA                                   065220      
002630                WKS-DP2-MAQUINA                                   065240      
002631                WKS-HORA-DP1                                      065260      
002632                WKS-HORA-DP1                                      065280      
002633    MOVE "S151"                        TO SISTEMA-LJ              065300      
002634    MOVE "P014"                        TO PASO-LJ                 065400      
002635    MOVE  01                           TO MTP-LJ                  065500      
002636    MOVE "I"                           TO TIPO-LJ                 065600      
002637    MOVE 050104                        TO CODIGO-LJ               065700      
002638    PERFORM 020000-INICIO                                         065800      
002639    OPEN  INPUT ARCH-DES                                          065887      
002640    PERFORM 030100-PROCESO UNTIL W77-FIN = 1                      065900      
002641    CLOSE ARCH-DES                                                065932      
002642    MOVE 22 TO WKS-B05-FUNCION                                    065948      
002643    PERFORM 021100-REGB05                                         065964      
002644    PERFORM 701000-CIERRA-BD-DISPLAY                              066000      
002645    PERFORM 999999-FIN                                            066100      
002646    STOP RUN.                                                     066200      
002647                                                                  066300      
002648 020000-INICIO.                                                   066400      
002649*==============                                                   066500      
002650     PERFORM 020200-TASKFILE                                      066600      
002651     PERFORM 020400-LIBRERIAS                                     066700      
002652     PERFORM 020500-COMS                                          066800      
002653     PERFORM 020600-ARCHIVOS                                      066900      
002654     PERFORM 020650-OPN-TSKFILE                                   066950      
002655     PERFORM 020700-CATALOGO                                      067000      
002656*INICIO JMLT DESCRIPCIONES PRODUCTO E INSTRUMENTO                 067025      
002657     PERFORM 020750-DESCR-PRIN                                    067050      
002658*FIN JMLT DESCRIPCIONES PRODUCTO E INSTRUMENTO                    067075      
002659*****************   HABILITA INTERRUPCIONES    *****************  067100      
002660     ALLOW INTERRUPT                                              067200      
002661     ATTACH INTERRUPT-BY-HI            TO ATTRIBUTE EXCEPTIONEVENT067300      
002662                                       OF MYSELF                  067400      
002663     MOVE    1              TO    W77-FIN                         067410      
002664     PERFORM 700100-ABRE-BD UNTIL W77-FIN = 0 OR W77-INTENTO > 6. 067500      
002665     IF W77-FIN = 1                                               067501      
002666        MOVE "ERROR AL ABRIR BASE S151BD13BIFIN" TO WKS-DMS-DSCERR067502      
002667        PERFORM 8000000-DMTERMINATE.                              067503      
002668                                                                  067504      
002669     IF  W77-FIN = ZERO                                           067505      
002670         PERFORM 020900-LLENAR-DAT-SERVS                          067506      
002671         PERFORM 020750-VALIDA-DIA-HABIL                          067507      
002672         PERFORM 020800-CALCULA-ESPERA                            067508      
002673*        MOVE LOW-VALUES TO WKS-B05PROCESOS                       067509      
002674         MOVE 22 TO WKS-B05-FUNCION                               067510      
002675         PERFORM 021100-REGB05                                    067511      
002676         MOVE 19 TO WKS-B05-FUNCION                               067512      
002677         PERFORM 021100-REGB05.                                   067513      
002678                                                                  067515      
002679*JMLT IF   W77-FIN = ZERO                                         067600      
002680*JMLT       PERFORM 020800-CALCULA-ESPERA.                        067700      
002681                                                                  067800      
002682     PERFORM 000-BUSCAR-LIM-ENV-PEND.                             067900      
002683     PERFORM 000-VALIDA-LIM-ENV-PEND.                             067950      
002684     PERFORM 000-VALIDA-CSI-DESTINO.                              067975      
002685                                                                  068000      
002686 020200-TASKFILE.                                                 068100      
002687*================                                                 068200      
002688    MOVE ZERO                          TO W77-FIN                 068300      
002689    MOVE "/"                           TO WKS-DIAGONAL1           068400      
002690                                          WKS-DIAGONAL2           068500      
002691    ACCEPT WKS-FECHA-MAQUINA           FROM TODAYS-DATE           068600      
002692    MOVE WKS-FECMAQ-CC                 TO WKS-CC-MAQ              068700      
002693    MOVE WKS-FECMAQ-AA                 TO WKS-AA-MAQ              068800      
002694    MOVE WKS-FECMAQ-MM                 TO WKS-MM-MAQ              068900      
002695    MOVE WKS-FECMAQ-DD                 TO WKS-DD-MAQ              069000      
002696    MOVE WKS-FECHA-MAQ-8D              TO WKS-FECHA1              069100      
002697                                         WKS-FECHA-MAQ-ANT-8D.    069200      
002698                                                                  069300      
002699                                                                  069400      
002700 020400-LIBRERIAS.                                                069500      
002701*=================                                                069600      
002702    CHANGE ATTRIBUTE LIBACCESS         OF "CTRLVERS"              069700      
002703                                       TO BYFUNCTION.             069800      
002704    CHANGE ATTRIBUTE FUNCTIONNAME      OF "CTRLVERS"              069900      
002705                                       TO "CTLVERS".              070000      
002706    CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION.      070100      
002707    CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP".        070200      
002708    CHANGE ATTRIBUTE TITLE             OF "LIB-DISP"              070300      
002709       TO "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".        070400      
002710                                                                  070500      
002711*****************      LIGA S080 CONCEPTOS   *******************  070600      
002712    MOVE "S080BD01CON"                 TO     WKS-CTLVER-LIBID.   070700      
002713    CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID    070800      
002714                                              WKS-CTLVER-NOMLIB   070900      
002715                                       GIVING W77-CTLVER-RESULT.  071000      
002716     IF W77-CTLVER-RESULT = 0                                     071100      
002717        CHANGE ATTRIBUTE TITLE OF "S080L710"                      071200      
002718                                       TO     WKS-CTLVER-NOMLIB.  071300      
002719                                                                  071400      
002720                                                                  071500      
002721*********** OBTIENE NOMBRE DEL ARCHIVO DE MOVS500 *************** 071600      
002722    MOVE "S151L001CTL"                 TO     WKS-CTLVER-LIBID.   071700      
002723    CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID    071800      
002724                                              WKS-CTLVER-NOMLIB   071900      
002725                                       GIVING W77-CTLVER-RESULT.  072000      
002726     IF W77-CTLVER-RESULT = 0                                     072100      
002727        CHANGE ATTRIBUTE TITLE         OF "S151-L001"             072200      
002728                                       TO WKS-CTLVER-NOMLIB       072300      
002729     ELSE                                                         072400      
002730        CHANGE ATTRIBUTE TITLE         OF "S151-L001" TO          072500      
002731               "(S151)S151/OBJECT/L001/CONTROL ON CMEMP.".        072600      
002732                                                                  072700      
002733     MOVE 500                          TO WKS-B01-SISTEMA         072800      
002734     MOVE 01                           TO WKS-B01-FUNCION.        072900      
002735     CALL "CONSISDIA IN S151-L001"     USING  WKS-S151B01SISDIA   073000      
002736                                       GIVING W77-RESULT-B01.     073100      
002737                                                                  073200      
002738     IF W77-RESULT-B01 > 0                                        073300      
002739        MOVE W77-RESULT-B01            TO W77-ERROR               073400      
002740        STRING "NO PUEDO OBTENER FECHA DE PROCESO "               073500      
002741               " ERROR EN S151-L001 S500, ERR #" W77-ERROR        073600      
002742        DELIMITED BY SIZE INTO TEXTO-LJ                           073700      
002743        MOVE "O"                       TO TIPO-LJ                 073800      
002744        MOVE 020901                    TO CODIGO-LJ               073900      
002745        CALL "LJ IN LIB-DISP"          USING CONTADOR-LJ,         074000      
002746                                             MENSAJE-LJ           074100      
002747        SET MYSELF(STATUS) TO -1                                  074200      
002748     ELSE                                                         074300      
002749        MOVE WKS-B01-NOMPACMOV         TO WKS-PACK-MOVS           074400      
002750*INICIO JMLT PACK PARA ARCHIVO DE DESCRIPCIONES                   074430      
002751                                          WS-PACK-DES.            074460      
002752*FIN JMLT PACK PARA ARCHIVO DE DESCRIPCIONES                      074490      
002753        MOVE WKS-B01-FECCON            TO WKS-FECHA-PROCESO.      074500      
002754                                                                  074600      
002755                                                                  074700      
002756                                                                  074800      
002757                                                                  074900      
002758 020600-ARCHIVOS.                                                 075000      
002759*================                                                 075100      
002760    MOVE WKS-FECPRO-6D                 TO WKS-MOVS1-FECHA         075200      
002761                                          WKS-FECHA-ENV           075300      
002762                                          WKS-RUT-L01-FCH         075400      
002763                                          WKS-RUT-L02-FCH         075500      
002764*INICIO JMLT FECHA PARA EL ARCHIVO DE DESCRIPCIONES Y CAT         075501      
002765                                          WS-DES-FECHA            075502      
002766                                          WKS-DESCPRIN-FCH.       075503      
002767*FIN JMLT FECHA PARA EL ARCHIVO DE DESCRIPCIONES Y CAT            075504      
002768    ACCEPT WKS-HORMAQ-HMSD        FROM  TIME.                     075505      
002769    MOVE   WKS-HORMAQ-HMSD        TO WKS-RUT-L01-HORA.            075510      
002770*INICIO JMLT HORA PARA EL ARCHIVO DE CATALOGO                     075511      
002771    MOVE   WKS-HORMAQ-HMSD        TO WKS-DESCPRIN-HORA            075512      
002772*FIN JMLT HORA PARA EL ARCHIVO DE CATALOGO                        075513      
002773                                                                  075515      
002774    MOVE "VDM"                         TO WKS-RUT-L01-CSI         075600      
002775                                          WKS-RUT-L02-CSI.        075700      
002776    IF WKS-NUMCSI-HOST = 04                                       075800      
002777       MOVE "MTY"                      TO WKS-RUT-L01-CSI         075900      
002778                                          WKS-RUT-L02-CSI.        076000      
002779*INICIO JMLT                                                      076020      
002780    CHANGE ATTRIBUTE NEWFILE OF DES TO VALUE FALSE                076030      
002781    CHANGE ATTRIBUTE TITLE             OF DES                     076040      
002782                                       TO WKS-TIT-DESS151.        076060      
002783*FIN JMLT                                                         076080      
002784    CHANGE ATTRIBUTE TITLE             OF A01-MOVS500             076100      
002785                                       TO WKS-TITLE-MOVS500.      076200      
002786    CHANGE ATTRIBUTE TITLE             OF A02-CTL-PC              076300      
002787                                       TO WKS-CTLENV.             076400      
002788*INICIO JMLT                                                      076425      
002789    CHANGE ATTRIBUTE NEWFILE OF L01-DISPLAY TO VALUE FALSE.       076450      
002790*FIN JMLT                                                         076475      
002791    CHANGE ATTRIBUTE TITLE             OF L01-DISPLAY             076500      
002792                                       TO WKS-RUT-L01.            076600      
002793                                                                  076650      
002794    CHANGE ATTRIBUTE TITLE             OF ARCH-DES                076660      
002795                                       TO WKS-TIT-DESCVE.         076670      
002796                                                                  076700      
002797    IF ATTRIBUTE RESIDENT              OF A02-CTL-PC = 1          076800      
002798       NEXT SENTENCE                                              076900      
002799    ELSE                                                          077000      
002800       OPEN OUTPUT A02-CTL-PC                                     077100      
002801       MOVE 1                          TO R01-REG-AUTS500         077200      
002802                                          W77-AUT-ENVIO500        077300      
002803       WRITE R01-REG-ENVIO                                        077400      
002804       CLOSE A02-CTL-PC                WITH SAVE.                 077500      
002805                                                                  077600      
002806   IF  ATTRIBUTE RESIDENT  OF L01-DISPLAY  = VALUE TRUE           077700      
002807        OPEN EXTEND L01-DISPLAY                                   077800      
002808   ELSE                                                           077900      
002809        OPEN OUTPUT L01-DISPLAY                                   078000      
002810        ADD   1  TO  CONT-REG-DISPLAY                             078005      
002811        WRITE REG-DISPLAY       FROM REGISTRO-DIS-HEADER.         078100      
002812                                                                  078200      
002813 020650-OPN-TSKFILE.                                              078300      
002814*===================                                              078400      
002815    ACCEPT  WKS-FEC-MAQ-DG        FROM DATE       .               078402      
002816    MOVE WKS-FEC-MAQ-DG           TO WKS-TSK-FECHA.               078405      
002817    MOVE WKS-NUMCSI-HOST          TO WKS-TSK-NODO .               078410      
002818    MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WKS-TSK-MXNB.           078420      
002819    SET MYSELF (OPTION)           TO 1926.                        078430      
002820    SET MYSELF (FILECARDS)        TO WKS-TIT-TASKFILE.            078440      
002821                                                                  078450      
002822 020500-COMS.                                                     078500      
002823*============                                                     078600      
002824    CHANGE ATTRIBUTE LIBACCESS         OF "SOPORTECOMS"           078700      
002825                                       TO BYFUNCTION.             078800      
002826    CHANGE ATTRIBUTE FUNCTIONNAME      OF "SOPORTECOMS"           078900      
002827                                       TO "SOPORTECOMS".          079000      
002828                                                                  079100      
002829    CHANGE ATTRIBUTE LIBACCESS         OF "DCILIBRARY"            079200      
002830                                       TO  BYFUNCTION.            079300      
002831    CHANGE ATTRIBUTE FUNCTIONNAME      OF "DCILIBRARY"            079400      
002832                                       TO "COMSSUPPORT".          079500      
002833     ENABLE INPUT COMS-IN    KEY "ONLINE".                        079600      
002834                                                                  079700      
002835*=============== VALIDACION DE AGENDA DE SALIDA ================= 079800      
002836     MOVE "OUTPUT OF LINEA"           TO WKS-COMS-AG-SALIDA-NAME. 079900      
002837     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               080000      
002838           USING  WKS-COMS-AG-SALIDA-NAME                         080100      
002839                  VALUE AGENDA                                    080200      
002840                  W77-COMS-AG-SALIDA-DESG                         080300      
002841           GIVING W77-COMS-RESULT.                                080400      
002842     IF W88-COMS-OK                                               080500      
002843        NEXT SENTENCE                                             080600      
002844     ELSE                                                         080700      
002845        PERFORM 900000-FIN-MAL.                                   080800      
002846                                                                  080900      
002847     MOVE CS-COMS-IN-PROGRAM          TO W77-COMS-MY-PROGRAM-DESG.081000      
002848     CALL "GET-NAME-USING-DESIGNATOR OF DCILIBRARY"               081100      
002849           USING  W77-COMS-MY-PROGRAM-DESG                        081200      
002850                  WKS-COMS-MY-PROGRAM-NAME                        081300      
002851           GIVING W77-COMS-RESULT.                                081400      
002852     IF W88-COMS-OK                                               081500      
002853        NEXT SENTENCE                                             081600      
002854     ELSE                                                         081700      
002855        PERFORM 900000-FIN-MAL.                                   081800      
002856*=============== DESIGNACION DE ESTACION DEFAULT  =============   081900      
002857     MOVE "DEFAULTSTATION"            TO WKS-COMS-DEFSTATION-NAME 082000      
002858     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               082100      
002859           USING  WKS-COMS-DEFSTATION-NAME                        082200      
002860           VALUE  STATION                                         082300      
002861                  W77-COMS-DEFSTATION-DESG                        082400      
002862           GIVING W77-COMS-RESULT.                                082500      
002863     IF W88-COMS-OK                                               082600      
002864        NEXT SENTENCE                                             082700      
002865     ELSE                                                         082800      
002866        PERFORM 900000-FIN-MAL.                                   082900      
002867                                                                  083000      
002868                                                                  083100      
002869     CALL "CSIID OF SOPORTECOMS"       USING WKS-DATOS-HOST.      083200      
002870                                                                  083300      
002871                                                                  084000      
002872 020700-CATALOGO.                                                 084100      
002873*================                                                 084200      
002874     MOVE 151                         TO W77-L710-SISTEMA.        084300      
002875     MOVE 14                          TO W77-L710-PROGRAMA.       084400      
002876     MOVE 6                           TO WKS-EL710-CAT.           084500      
002877     MOVE 20                          TO WKS-EL710-CLAVE.         084600      
002878     MOVE 10                          TO WKS-EL710-REGISTROS.     084700      
002879* Asi buscaria solo los del S500.                                 084800      
002880*     MOVE 1                           TO WKS-EL710-BUSQUEDA.     084900      
002881*     MOVE 2300                        TO WKS-EL710-LLAVE1.       085000      
002882*     MOVE 500                         TO WKS-EL710-LLAVE2.       085100      
002883* Si no importa el sistema                                        085200      
002884     MOVE 2                           TO WKS-EL710-BUSQUEDA.      085300      
002885     MOVE ZERO                        TO WKS-EL710-LLAVE1.        085400      
002886     MOVE 500                         TO WKS-EL710-LLAVE2.        085500      
002887     MOVE ZERO                        TO WKS-EL710-LLAVE3         085600      
002888                                         WKS-EL710-LLAVE4         085700      
002889                                         WKS-EL710-LLAVE5         085800      
002890                                         WKS-EL710-LLAVE6         085900      
002891                                         WKS-EL710-FECINI         086000      
002892                                         WKS-EL710-NIVINI         086100      
002893                                         WKS-EL710-FEC-VIG.       086200      
002894     MOVE 0                           TO WKS-NUM-CVETRANS.        086300      
002895*INICIO JMLT                                                      086305      
002896     MOVE ZERO                        TO W77-EOF                  086310      
002897*FIN JMLT                                                         086320      
002898     PERFORM 020720-CLAVES-TRAN       UNTIL W77-EOF = 1.          086400      
002899                                                                  086500      
002900                                                                  086600      
002901 020720-CLAVES-TRAN.                                              086700      
002902*===================                                              086800      
002903     CALL "L710_CONSUL_DETALLE IN S080L710"                       086900      
002904          USING  W77-L710-SISTEMA,                                087000      
002905                 W77-L710-PROGRAMA,                               087100      
002906                 WKS-L710-ENT,                                    087200      
002907                 WKS-L710-SAL,                                    087300      
002908          GIVING W77-L710-RESULT.                                 087400      
002909                                                                  087500      
002910     IF W77-L710-RESULT = 0 OR 1                                  087600      
002911        PERFORM 020730-LLENA-CATALOGO                             087700      
002912                VARYING WKS-NUM-OCCURS FROM 1 BY 1                087800      
002913                UNTIL WKS-NUM-OCCURS > WKS-SL710-NUMREG           087900      
002914        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,1) TO WKS-EL710-LLAVE1088000      
002915        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,2) TO WKS-EL710-LLAVE2088100      
002916        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,3) TO WKS-EL710-LLAVE3088200      
002917        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,4) TO WKS-EL710-LLAVE4088300      
002918        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,5) TO WKS-EL710-LLAVE5088400      
002919        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,6) TO WKS-EL710-LLAVE6088500      
002920        MOVE WKS-SL710-NIVINI         TO WKS-EL710-NIVINI         088600      
002921        MOVE WKS-SL710-FECINI         TO WKS-EL710-FECINI         088700      
002922     ELSE                                                         088800      
002923        MOVE 1                        TO W77-EOF                  088900      
002924        MOVE W77-L710-RESULT          TO W77-ERR-CAT              089000      
002925        IF W77-ERR-CAT = 20                                       089100      
002926           IF WKS-NUM-CVETRANS = 0                                089200      
002927             MOVE  1                       TO  W77-FIN            089300      
002928             MOVE  "EN CAT 6 NO EXISTEN REG CON MARCA PC"         089400      
002929                                           TO TEXTO-LJ            089500      
002930              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 089600      
002931            MOVE                                                  089700      
002932            "EN CAT 6 NO EXISTEN REG CON MARCA PC, FIN DE PROGAMA"089800      
002933                                           TO WKS-DIS-TEXTO       089900      
002934              PERFORM 060700-DISPLAY                              090000      
002935           ELSE                                                   090100      
002936              NEXT SENTENCE                                       090200      
002937        ELSE                                                      090300      
002938           MOVE  1                   TO  W77-FIN                  090400      
002939           MOVE "I"                   TO TIPO-LJ                  090500      
002940           MOVE 020901                TO CODIGO-LJ                090600      
002941           STRING "ERROR AL LLAMAR S080BD01CON, RESULT = "        090700      
002942                  W77-ERR-CAT                                     090800      
002943           DELIMITED BY SIZE                                      090900      
002944           INTO TEXTO-LJ                                          091000      
002945           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ    091100      
002946           STRING "ERROR AL LLAMAR S080BD01CON, RESULT = "        091200      
002947                   W77-ERR-CAT             DELIMITED BY SIZE      091300      
002948                   " , FIN DE PROGRAMA "   DELIMITED BY SIZE      091400      
002949           INTO WKS-DIS-TEXTO                                     091500      
002950           PERFORM 060700-DISPLAY.                                091600      
002951                                                                  091700      
002952                                                                  091800      
002953                                                                  091900      
002954                                                                  092000      
002955 020730-LLENA-CATALOGO.                                           092100      
002956*========================                                         092200      
002957*INICIO JML CARGA CATALOGO                                        092203      
002958  MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,1) TO WKS-NUM-CVETRANS        092205      
002959  IF  WKS-SL710-DAT(WKS-NUM-OCCURS,14) = 5                        092206      
002960     MOVE 1       TO WKS-CAT6-SERV1(WKS-NUM-CVETRANS)             092218      
002961     MOVE 1       TO WKS-CAT6-SERV2(WKS-NUM-CVETRANS)             092221      
002962     MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,11)                        092224      
002963                  TO WKS-CAT6-NATC(WKS-NUM-CVETRANS)              092225      
002964     MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,15)                        092226      
002965                  TO WKS-CAT6-SUMPAN(WKS-NUM-CVETRANS)            092227      
002966     MOVE WKS-NUM-CVETRANS TO WKS-CAT6-CVETRAN(WKS-NUM-CVETRANS)  092229      
002967*LRA LLENAMOS OCURRENCIA 19 DEL CATALOGO.                         092231      
002968     MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,19)                        092233      
002969                  TO WKS-CAT6-ENVDHBL(WKS-NUM-CVETRANS)           092236      
002970  ELSE                                                            092239      
002971  IF  WKS-SL710-DAT(WKS-NUM-OCCURS,14) = 6 OR 10                  092242      
002972     MOVE 0       TO WKS-CAT6-SERV1(WKS-NUM-CVETRANS)             092251      
002973     MOVE 1       TO WKS-CAT6-SERV2(WKS-NUM-CVETRANS)             092254      
002974     MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,11)                        092257      
002975                  TO WKS-CAT6-NATC(WKS-NUM-CVETRANS)              092258      
002976     MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,15)                        092259      
002977                  TO WKS-CAT6-SUMPAN(WKS-NUM-CVETRANS)            092260      
002978     MOVE WKS-NUM-CVETRANS TO WKS-CAT6-CVETRAN(WKS-NUM-CVETRANS)  092262      
002979*LRA LLENAMOS OCURRENCIA 19 DEL CATALOGO.                         092264      
002980     MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,19)                        092266      
002981                  TO WKS-CAT6-ENVDHBL(WKS-NUM-CVETRANS)           092269      
002982  ELSE                                                            092272      
002983*FIN  JML CARGA CATALOGO                                          092275      
002984  IF  WKS-SL710-DAT(WKS-NUM-OCCURS,14) = 4                        092300      
002985*INICIO JMLT                                                      092325      
002986     MOVE WKS-NUM-CVETRANS TO WKS-CAT6-CVETRAN(WKS-NUM-CVETRANS)  092350      
002987     MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,15)                        092430      
002988                  TO WKS-CAT6-SUMPAN(WKS-NUM-CVETRANS)            092510      
002989     MOVE 1       TO WKS-CAT6-SERV1(WKS-NUM-CVETRANS)             092605      
002990     MOVE 0       TO WKS-CAT6-SERV2(WKS-NUM-CVETRANS)             092606      
002991     MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,11)                        092607      
002992                  TO WKS-CAT6-NATC(WKS-NUM-CVETRANS).             092608      
002993*LRA LLENAMOS OCURRENCIA 19 DEL CATALOGO.                         092611      
002994     MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,19)                        092612      
002995                   TO WKS-CAT6-ENVDHBL(WKS-NUM-CVETRANS).         092613      
002996 020750-VALIDA-DIA-HABIL.                                         092615      
002997*============================                                     092620      
002998    ACCEPT WKS-FECHA-MAQUINA           FROM TODAYS-DATE.          092625      
002999    MOVE WKS-FECMAQ-CC                 TO WKS-CC-MAQ.             092630      
003000    MOVE WKS-FECMAQ-AA                 TO WKS-AA-MAQ.             092635      
003001    MOVE WKS-FECMAQ-MM                 TO WKS-MM-MAQ.             092640      
003002    MOVE WKS-FECMAQ-DD                 TO WKS-DD-MAQ.             092645      
003003    MOVE 18                            TO W77-FUNCION             092650      
003004    MOVE WKS-FECHA-MAQ-8D              TO WKS-FECHA1              092655      
003005    MOVE 0                             TO WKS-FECHA2              092660      
003006    MOVE 13                            TO W77-FORMATO             092665      
003007    CALL "THECALENDAR IN LOCSUP"       USING W77-FUNCION,         092670      
003008                                          WKS-FECHA1,             092675      
003009                                          WKS-FECHA2,             092680      
003010                                          W77-FORMATO             092685      
003011   IF WKS-FECHA1 = 1                                              092690      
003012       MOVE 1 TO WKS-VAL-DIA-HAB(1)                               092697      
003013    ELSE                                                          092700      
003014       MOVE 0 TO WKS-VAL-DIA-HAB(1)                               092707      
003015       MOVE "DIA INHABIL PARA PROTECCION DE COB"  TO WKS-DIS-TEXTO092710      
003016       PERFORM 060700-DISPLAY.                                    092715      
003017 020800-CALCULA-ESPERA.                                           092720      
003018*========================                                         092725      
003019*INI LRA VALIDAMOS EL HORARIO PARA DIAS HABILES E INHABILES.      092730      
003020    IF WKS-VAL-DIA-HAB(1)= 1                                      092735      
003021          PERFORM 020810-OBTEN-HORA                               092800      
003022                                                                  092900      
003023          IF W77-RESULT-LIBCON = ZERO                             093000      
003024                 MOVE WKS-B05-HORAINI TO WKS-SIS-HORAINI-FIN      093100      
003025                                                                  093200      
003026                 PERFORM 020910-CAL-HORARIO-HABIL                 093300      
003027                                                                  093400      
003028          ELSE                                                    093500      
003029                 MOVE 060000            TO WKS-SIS-HORAINI-FIN    093600      
003030                                                                  093700      
003031                 PERFORM 020910-CAL-HORARIO-HABIL                 093800      
003032                                                                  093900      
003033    ELSE                                                          094000      
003034          MOVE 080000               TO WKS-SIS-HORAINI-FIN        094100      
003035                                                                  094200      
003036          MOVE WKS-SIS-HORAINI-FIN  TO WKS-B05-HORAINI            094300      
003037                                                                  094306      
003038          COMPUTE WKS-HR-INI-FUN   = WKS-SIS-HH-INI-FIN * 3600 +  094700      
003039                                     WKS-SIS-MM-INI-FIN * 60   +  094800      
003040                                     WKS-SIS-SS-INI-FIN           094900      
003041                                                                  095000      
003042          ACCEPT  WKS-HR-MAQUINA    FROM TIME                     095100      
003043          COMPUTE WKS-HR-INI-PG   = WKS-HH-MAQUINA * 3600 +       095200      
003044                                    WKS-MM-MAQUINA * 60   +       095300      
003045                                    WKS-SS-MAQUINA                095301      
003046          PERFORM 030350-IMP-HR-DISP                              095303      
003047                                                                  095305      
003048          MOVE 193000               TO WKS-SIS-HORAINI-FIN        095306      
003049                                                                  095600      
003050          MOVE WKS-SIS-HORAINI-FIN TO WKS-B05-HORAFIN             095602      
003051                                                                  095604      
003052          COMPUTE WKS-HR-FIN-FUN =  WKS-SIS-HH-INI-FIN * 3600 +   095606      
003053                                    WKS-SIS-MM-INI-FIN * 60   +   095608      
003054                                    WKS-SIS-SS-INI-FIN            095610      
003055                                                                  095612      
003056          MOVE WKS-HR-FIN-FUN TO WKS-VAL-HR-FIN(1)                095614      
003057                                                                  095616      
003058          PERFORM 030360-IMP-HR-DISP.                             095618      
003059                                                                  095620      
003060 020910-CAL-HORARIO-HABIL.                                        095622      
003061     COMPUTE WKS-HR-INI-FUN   =                                   095624      
003062                              WKS-SIS-HH-INI-FIN * 3600 +         095626      
003063                              WKS-SIS-MM-INI-FIN * 60   +         095628      
003064                              WKS-SIS-SS-INI-FIN.                 095630      
003065                                                                  095632      
003066      ACCEPT  WKS-HR-MAQUINA    FROM TIME                         095634      
003067      COMPUTE WKS-HR-INI-PG   = WKS-HH-MAQUINA * 3600 +           095636      
003068                                WKS-MM-MAQUINA * 60   +           095638      
003069                                WKS-SS-MAQUINA                    095640      
003070      PERFORM 030350-IMP-HR-DISP                                  095642      
003071      IF W77-RESULT-LIBCON = ZERO                                 095644      
003072              MOVE WKS-B05-HORAFIN   TO WKS-SIS-HORAINI-FIN       095646      
003073      ELSE                                                        095648      
003074              MOVE 220000       TO WKS-SIS-HORAINI-FIN.           095650      
003075                                                                  095652      
003076      COMPUTE WKS-HR-FIN-FUN =  WKS-SIS-HH-INI-FIN * 3600 +       095654      
003077                                WKS-SIS-MM-INI-FIN * 60   +       095656      
003078                                WKS-SIS-SS-INI-FIN                095658      
003079                                                                  095660      
003080      MOVE WKS-HR-FIN-FUN TO WKS-VAL-HR-FIN(1)                    095662      
003081                                                                  095664      
003082      PERFORM 030360-IMP-HR-DISP.                                 095666      
003083*FIN LRA VALIDAMOS EL HORARIO PARA DIAS HABILES E INHABILES.      095668      
003084 020810-OBTEN-HORA.                                               095700      
003085*========================                                         095800      
003086    MOVE 0                          TO W77-RESULT-LIBCON          095900      
003087    MOVE 1                          TO WKS-B05-FUNCION            096000      
003088    MOVE 151                        TO WKS-B05-SISTEMA            096100      
003089    MOVE 14                         TO WKS-B05-NUMPRO             096200      
003090    CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS        096300      
003091                                    GIVING W77-RESULT-LIBCON.     096400      
003092                                                                  096500      
003093 030100-PROCESO.                                                  096600      
003094*===============                                                  096700      
003095  MOVE 0                            TO WKS-FIN-RECEIVE            096750      
003096  PERFORM 030363-MARCA-INICIO-PROG                                096875      
003097  PERFORM 030300-PROCESA-MOVS500                                  096900      
003098  PERFORM 080500-ACEPTA-MENSAGE UNTIL WKS-FIN-RECEIVE = 1.        097000      
003099                                                                  097400      
003100 030150-CHECA-FIN.                                                097500      
003101*===================                                              097600      
003102  ACCEPT  WKS-HR-MAQUINA    FROM TIME.                            097700      
003103  COMPUTE WKS-HR-INI-PG-AUX   = WKS-HH-MAQUINA * 3600 +           097800      
003104                                WKS-MM-MAQUINA * 60   +           097900      
003105                                WKS-SS-MAQUINA.                   098000      
003106  IF WKS-HR-FIN-FUN      NOT >  WKS-HR-INI-PG-AUX                 098100      
003107      MOVE 1             TO W77-FIN.                              098200      
003108                                                                  102400      
003109  030203-ACTUALIZA-B07-RES.                                       102500      
003110*==========================                                       102600      
003111    MOVE WKS-SA0-DIRECCION TO B07-STATUS                          102700      
003112    MOVE WKS-ERROR         TO B07-NUM-ERROR                       102800      
003113    PERFORM 700200-ALMACENA-REG.                                  102900      
003114                                                                  103000      
003115                                                                  103100      
003116                                                                  103200      
003117                                                                  103300      
003118                                                                  103400      
003119 030300-PROCESA-MOVS500.                                          103500      
003120*======================                                           103600      
003121       PERFORM 030370-CALC-HR-MQ.                                 103700      
003122       PERFORM 030320-LEE-CONTROL.                                103900      
003123                                                                  104000      
003124    IF W88-HI-13 OR (WKS-MAS-PEND = 0 AND                         104018      
003125       WKS-HR-INI-FUN     < WKS-SEG-MAQUINA                       104027      
003126       AND WKS-HR-FIN-FUN > WKS-SEG-MAQUINA                       104036      
003127       AND WKS-VAL-DIA-HAB(1) = 0)                                104041      
003128       PERFORM 030370-ENV-MSG-ENC                                 104045      
003129       IF WKS-ZERO-STATUS = 1 AND WKS-SIX-STATUS = 1              104054      
003130          MOVE 1 TO WKS-MAS-PEND.                                 104063      
003131                                                                  104072      
003132                                                                  104081      
003133    IF  W88-HI-13 OR                                              104090      
003134       (WKS-HR-INI-FUN     < WKS-SEG-MAQUINA                      104100      
003135        AND WKS-HR-FIN-FUN > WKS-SEG-MAQUINA)                     104200      
003136       MOVE   ZERO          TO WKS-EOF-B07                        104350      
003137       MOVE    1            TO WKS-REIN-ACT WKS-NUM-ID WKS-STATUS 104400      
003138       PERFORM 030330-REINTENTA-MOVS UNTIL WKS-STATUS = 3         104516      
003139       MOVE    0            TO WKS-REIN-ACT.                      104525      
003140*RUTINA DE REINTENTO DE ALERTAS DE AQUELLOS MENSAJES CON          104560      
003141* PROBLEMAS DE ENVIO DIF DE 0 O 99.                               104600      
003142    IF W88-ENVIO-ALERTAS                                          104650      
003143       PERFORM 0380500-REINT-ALERTAS.                             104700      
003144                                                                  104800      
003145                                                                  104900      
003146                                                                  105000      
003147       PERFORM 030340-ENVIA-MOVS500                               105020      
003148       PERFORM 030350-ACTUALIZA-CONTROL                           105040      
003149       PERFORM 030310-VERIFICA-ENVIO.                             105045      
003150                                                                  105100      
003151                                                                  105200      
003152                                                                  105300      
003153 030310-VERIFICA-ENVIO.                                           105400      
003154*======================                                           105500      
003155                                                                  105600      
003156    MOVE    WKS-SEG-MAQUINA2           TO WKS-SEG-MAQUINA-ANT     105650      
003157    ACCEPT  WKS-HR-MAQUINA             FROM TIME.                 105700      
003158    COMPUTE WKS-SEG-MAQUINA = WKS-HH-MAQUINA * 3600 +             105800      
003159                              WKS-MM-MAQUINA * 60   +             105900      
003160                              WKS-SS-MAQUINA.                     106000      
003161                                                                  106025      
003162    MOVE WKS-SEG-MAQUINA TO WKS-SEG-MAQUINA2                      106050      
003163                                                                  106075      
003164    IF WKS-SEG-MAQUINA-ANT > WKS-SEG-MAQUINA                      106100      
003165       PERFORM 030302-CAMBIA-DIA.                                 106200      
003166                                                                  107700      
003167 030302-CAMBIA-DIA.                                               107800      
003168*===================                                              107900      
003169    PERFORM 020750-VALIDA-DIA-HABIL                               108960      
003170    PERFORM 020800-CALCULA-ESPERA.                                108975      
003171                                                                  108990      
003172    MOVE 0 TO WKS-MAS-PEND WKS-ZERO-STATUS WKS-SIX-STATUS.        109000      
003173                                                                  109800      
003174                                                                  109900      
003175 030320-LEE-CONTROL.                                              110000      
003176*===================                                              110100      
003177    OPEN  I-O A02-CTL-PC                                          110200      
003178    READ  A02-CTL-PC                                              110300      
003179    MOVE  R01-REG-AUTS500              TO W77-AUT-ENVIO500        110400      
003180    CLOSE A02-CTL-PC WITH SAVE.                                   110500      
003181                                                                  110600      
003182                                                                  110700      
003183  030340-ENVIA-MOVS500.                                           110800      
003184*=====================                                            110900      
003185     MOVE ZERO                          TO W77-FIN-ARCH           111000      
003186     MOVE W77-AUT-ENVIO500              TO W77-NUMREG-MOV500      111100      
003187     ADD  1                             TO W77-NUMREG-MOV500      111200      
003188     OPEN  INPUT A01-MOVS500                                      111300      
003189*INI-LRA ABRIMOS ARCHIVO DE DESCRIPCIONES                         111325      
003190     OPEN INPUT DES                                               111350      
003191     SEEK A01-MOVS500 RECORD.                                     111400      
003192     MOVE ZERO TO WKS-NUM-ENVIOS                                  111450      
003193     PERFORM 030342-LEE-ARCHS500                                  111500      
003194*BEGIN TRANSATION                                                 111600      
003195     PERFORM 030344-SELECCIONA-MOVS     UNTIL W77-FIN-ARCH = 1    111700      
003196*END TRANSATION                                                   111800      
003197     CLOSE A01-MOVS500                  WITH RELEASE.             111900      
003198*FIN-LRA CERRAMOS ARCHIVO DESCRPCIONES                            112000      
003199     CLOSE DES                          WITH RELEASE.             112100      
003200                                                                  112200      
003201                                                                  112300      
003202                                                                  112400      
003203 030344-SELECCIONA-MOVS.                                          112500      
003204*=======================                                          112600      
003205    MOVE ZERO                     TO W77-IND-FUNCANCELA           112602      
003206    ADD  1                        TO W77-AUT-ENVIO500             112604      
003207* <IBM>-INICIO -ESS- FILTRO PARA MOVIMIENTOS TELETON              112610      
003208    IF A00-R01-TIPO-PROC > 39  AND A00-R01-TIPO-PROC < 44         112620      
003209       NEXT SENTENCE                                              112630      
003210    ELSE                                                          112640      
003211* <IBM>-FIN -ESS- FILTRO PARA MOVIMIENTOS TELETON                 112650      
003212      IF A00-R01-FUNCION = 21 OR 22                               112900      
003213        MOVE A00-R01-FUNCION        TO W77-CANC-FUNCION           113000      
003214        MOVE A00-R01-TIPO-PROC      TO W77-CANC-PROC              113100      
003215        MOVE A00-R01-AUT-AELIM-S151 TO W77-CANC-AUT-AELIM-S151    113200      
003216        MOVE A00-R01-AUT-S151       TO W77-CAN-AUT-S151           113300      
003217                                                                  113400      
003218        PERFORM 030390-CANCELA                                    113450      
003219        MOVE 1                      TO W77-IND-FUNCANCELA         113500      
003220        MOVE 1                      TO W77-FIN-ARCH               113600      
003221      ELSE                                                        113700      
003222        PERFORM 030341-VALIDA-PC                                  113800      
003223                      VARYING WKS-NUM-OCCURS FROM 1 BY 1          113900      
003224                      UNTIL   WKS-NUM-OCCURS > 5.                 114000      
003225*                     OR    A00-R01-CVETRAN(WKS-NUM-OCCURS) = 0.  114100      
003226    IF W77-IND-FUNCANCELA = 0                                     114200      
003227       PERFORM 030342-LEE-ARCHS500.                               114300      
003228                                                                  114400      
003229                                                                  114500      
003230 030341-VALIDA-PC.                                                114600      
003231*=======================                                          114700      
003232   IF A00-R01-CVETRAN(WKS-NUM-OCCURS) = 0                         114720      
003233      MOVE 6 TO WKS-NUM-OCCURS                                    114740      
003234      EXIT PERFORM.                                               114760      
003235   IF A00-R01-FUNCION = 2                                         114800      
003236      PERFORM 010700-CICLO-ACT                                    114825      
003237   ELSE                                                           115100      
003238       MOVE A00-R01-CVETRAN(WKS-NUM-OCCURS) TO WKS-NUM-CVETRANS   115130      
003239       IF A00-R01-FUNCION = 1 AND                                 115145      
003240          WKS-CAT6-CVETRAN(WKS-NUM-CVETRANS) NOT = 0              115160      
003241          PERFORM 030370-GENERA-PC.                               115800      
003242                                                                  115900      
003243                                                                  116000      
003244 030370-GENERA-PC.                                                116100      
003245*=================                                                116200      
003246                                                                  116300      
003247      IF WKS-CAT6-SERV1(WKS-NUM-CVETRANS) = 1                     116450      
003248         PERFORM 030500-ALTA-SERV1.                               116460      
003249      IF WKS-CAT6-SERV2(WKS-NUM-CVETRANS) = 1 AND                 116942      
003250         (A00-R01-ORIGEN = 1 OR 3) AND                            116945      
003251         (A00-R01-SERVICIO-ALERTA = 2 OR                          116951      
003252         (A00-R01-SERVICIO-ALERTA NOT = 2 AND                     116960      
003253         W88-ENVIO-ALER-CLINOCON))                                116965      
003254         PERFORM 030500-ALTA-SERV2.                               116968      
003255                                                                  117000      
003256                                                                  117100      
003257 030371-ARMA-REG-PC.                                              117200      
003258*=======================                                          117300      
003259    PERFORM 700700-CREAT-B07                                      117400      
003260*JMLTMOVE 1                             TO B07-NUM-ID             117500      
003261*INICIO JMLT                                                      117525      
003262    MOVE WKS-VAL-NUM-SERV(IND-SERV)    TO B07-NUM-ID              117550      
003263                                         WKS-B07-NUM-ID           117575      
003264    MOVE A00-R01-CONTRATO              TO B07-CONTRATO            117600      
003265                                          WKS-B07-CONTRATO        117650      
003266    MOVE A00-R01-CVEMDA                TO B07-MED-ACCESO          117700      
003267    MOVE A00-R01-MDA-SUC               TO B07-MDA-PREF            117800      
003268    MOVE A00-R01-MDA-CTA               TO B07-MDA-CUENTA          117900      
003269    MOVE A00-R01-AUTORIZA              TO B07-AUT-APLIC           118000      
003270    MOVE A00-R01-FECCONT               TO WRK-R01-FECMOV          118100      
003271                                          WKS-B07-FEC-CARGO       118150      
003272    MOVE WKS-FECMOV-6D-AUX             TO B07-FEC-CARGO           118200      
003273    MOVE A00-R01-HORMOV                TO B07-HR-CARGO            118300      
003274    MOVE A00-R01-REFNUM                TO B07-AUT-PC              118400      
003275    MOVE A00-R01-IMPORTE(WKS-NUM-OCCURS)                          118500      
003276                                       TO B07-IMPORTE             118600      
003277    MOVE A00-R01-AUT-S151              TO B07-AUT-S151            118700      
003278                                         WKS-B07-AUT-S151         118750      
003279    MOVE A00-R01-AUT-ANT-S151          TO B07-AUT-ANT-S151        118800      
003280    MOVE A00-R01-CVETRAN(WKS-NUM-OCCURS)                          118900      
003281                                       TO B07-CVE-TRANS           119000      
003282    MOVE WKS-NUM-OCCURS                TO B07-NUM-OCURR           119100      
003283                                          WKS-B07-NUM-OCURR       119150      
003284    MOVE 1                             TO B07-STATUS              119200      
003285    MOVE 1                             TO B07-NUM-ENV             119220      
003286    IF IND-SERV = 2 OR 3                                          119240      
003287       IF W88-ENVIO-ALERTAS                                       119250      
003288*          MOVE 1                             TO B07-NUM-ENV      119300      
003289          NEXT SENTENCE                                           119310      
003290       ELSE                                                       119320      
003291          MOVE 0                       TO B07-NUM-ENV             119340      
003292                                          B07-STATUS.             119360      
003293    MOVE A00-R01-FUNCION               TO B07-TIPO-MOV            119400      
003294    MOVE 0                             TO B07-NUM-ERROR.          119500      
003295*INICIO JMLT                                                      119515      
003296    MOVE A00-R01-CLIENTE               TO B07-NUM-CTE             119530      
003297                                         WKS-B07-NUM-CTE          119535      
003298    MOVE A00-R01-TIPO-PROC             TO B07-NUM-PROC.           119537      
003299    MOVE SPACES                        TO B07-DAT-GEN.            119545      
003300                                                                  119700      
003301 030360-ACTUALIZA-REG-PC.                                         119800      
003302*=========================                                        119900      
003303    MOVE A00-R01-FECCONT          TO WRK-R01-FECMOV               120000      
003304    MOVE WKS-FECMOV-6D-AUX        TO WKS-R01-FECMOV               120100      
003305    MOVE AUX-AUT-ANT-S151         TO WKS-R01-AUT-S151             120200      
003306    MOVE A00-R01-CONTRATO         TO WKS-R01-CONTRATO             120220      
003307    MOVE     ZERO                 TO AUX-AUT-ANT-S151             120240      
003308    PERFORM 303670-CICLO-NUM-ID VARYING WKS-NUM-ID FROM 1 BY 1    120260      
003309    UNTIL   WKS-NUM-ID > 2.                                       120280      
003310                                                                  120300      
003311                                                                  120400      
003312                                                                  120500      
003313                                                                  120600      
003314                                                                  120700      
003315                                                                  120706      
003316 303670-CICLO-NUM-ID.                                             120712      
003317*========================                                         120718      
003318    PERFORM 303680-CICLO-NUM-OCR VARYING WKS-NUM-OCR FROM 1 BY 1  120724      
003319    UNTIL   WKS-NUM-OCR > 5.                                      120730      
003320                                                                  120736      
003321 303680-CICLO-NUM-OCR.                                            120742      
003322*========================                                         120748      
003323   MOVE A00-R01-CVETRAN(WKS-NUM-OCCURS) TO W77-CLAVES-EXCLUIDAS.  120749      
003324   IF WKS-NUM-ID = 2 AND W88-CLAVES-EXCLUIDAS OR                  120750      
003325      (W77-CLAVES-EXCLUIDAS = 1015 AND                            120752      
003326       A00-R01-SUC-INIC = 342 AND A00-R01-CAJA-INIC = 68)         120754      
003327      NEXT SENTENCE                                               120756      
003328   ELSE                                                           120758      
003329   MOVE 0                     TO WKS-LOCK-OK                      120760      
003330   PERFORM 700600-BUSCA-ELIM-B07SXFECHA UNTIL WKS-LOCK-OK = 1     120762      
003331   IF WKS-EOF-B07 = ZERO                                          120766      
003332      PERFORM 030363-ACTB07-ENV-DGO                               120772      
003333      MOVE B07-AUT-ANT-S151    TO AUX-AUT-ANT-S151.               120778      
003334                                                                  120800      
003335 030363-ACTB07-ENV-DGO.                                           120900      
003336*=========================                                        121000      
003337                                                                  121100      
003338     MOVE    A00-R01-FUNCION       TO B07-TIPO-MOV                121200      
003339                                                                  121220      
003340     IF B07-NUM-ID = 1                                            121240      
003341        PERFORM 030500-GEN-AUTELIM-SERV1.                         121260      
003342                                                                  122030      
003343     IF B07-NUM-ID = 2                                            122045      
003344        PERFORM 030500-GEN-AUTELIM-SERV2.                         122060      
003345                                                                  122075      
003346                                                                  122090      
003347                                                                  122100      
003348                                                                  122200      
003349                                                                  122300      
003350  030330-REINTENTA-MOVS.                                          122400      
003351*========================                                         122500      
003352     MOVE ZERO      TO  WKS-ENV-MAX-REIN                          122600      
003353     IF  WKS-EOF-B07 = 1                                          122700      
003354         MOVE ZERO  TO  WKS-EOF-B07                               122800      
003355         MOVE 3     TO  WKS-STATUS.                               122900      
003356                                                                  122912      
003357     PERFORM 030350-BUSCAENVIA-MOVS.                              122924      
003358                                                                  122936      
003359                                                                  122948      
003360                                                                  122960      
003361  030350-BUSCAENVIA-MOVS.                                         122972      
003362*=========================                                        122984      
003363                                                                  123000      
003364     MOVE 0                               TO WKS-LOCK-OK          123100      
003365     PERFORM 700400-BUSCA-REG-B07SXFECSTA UNTIL  WKS-LOCK-OK = 1. 123200      
003366     PERFORM 030335-REINTENTA-MENSAJE     UNTIL  WKS-EOF-B07 = 1. 123300      
003367                                                                  123400      
003368                                                                  123500      
003369 030335-REINTENTA-MENSAJE.                                        123600      
003370*=========================                                        123700      
003371                                                                  123712      
003372    PERFORM 030600-GEN-REINT-SERV1.                               123724      
003373    IF WKS-CONT-ENC < W77-LIMITE-ENVIOS                           123734      
003374       MOVE 0 TO WKS-LOCK-OK                                      123735      
003375       PERFORM 700500-BUSCA-REG-B07SXFECSTAN                      123736      
003376                                          UNTIL  WKS-LOCK-OK = 1  123738      
003377    ELSE                                                          123741      
003378       MOVE 1  TO WKS-EOF-B07.                                    123746      
003379                                                                  123748      
003380                                                                  123760      
003381  030339-ACTUALIZA-ENVIOS.                                        125000      
003382*==========================                                       125100      
003383*    IF B07-NUM-ID = 2 AND B07-TIPO-MOV = 2                       125120      
003384*       NEXT SENTENCE                                             125140      
003385*    ELSE                                                         125160      
003386    COMPUTE B07-NUM-ENV = B07-NUM-ENV + 1.                        125200      
003387    COMPUTE WKS-CONT-MSG-REIN = WKS-CONT-MSG-REIN + 1             125300      
003388    PERFORM 700200-ALMACENA-REG.                                  125400      
003389                                                                  125500      
003390                                                                  125600      
003391                                                                  125700      
003392 030342-LEE-ARCHS500.                                             125800      
003393*====================                                             125900      
003394   READ A01-MOVS500 INTO A00-R01-REGMOV                           126000      
003395        AT END MOVE 1     TO W77-FIN-ARCH.                        126100      
003396   IF A00-R01-FUNCION = 99 OR WKS-NUM-ENVIOS > W77-LIMITE-ENVIOS  126200      
003397       MOVE 1             TO W77-FIN-ARCH.                        126300      
003398                                                                  126400      
003399                                                                  126500      
003400                                                                  126600      
003401                                                                  126700      
003402 030350-ACTUALIZA-CONTROL.                                        126800      
003403*=========================                                        126900      
003404   OPEN I-O A02-CTL-PC.                                           127000      
003405   MOVE 1                             TO W77-NUMREG-ACC.          127100      
003406   SEEK A02-CTL-PC RECORD.                                        127200      
003407   READ A02-CTL-PC.                                               127300      
003408   MOVE W77-AUT-ENVIO500              TO R01-REG-AUTS500.         127400      
003409   REWRITE R01-REG-ENVIO                                          127500      
003410         INVALID KEY NEXT SENTENCE.                               127600      
003411   CLOSE A02-CTL-PC WITH SAVE.                                    127700      
003412                                                                  130500      
003413                                                                  131500      
003414                                                                  132600      
003415***************************************************************   134500      
003416*                RUTINAS COMUNES                              *   134600      
003417***************************************************************   134700      
003418 060100-ARMA-DIALO-OBL.                                           134800      
003419*=========================                                        134900      
003420*Datos Obligatorios                                               135000      
003421      MOVE SPACES                 TO  WKS-AREA-MSG-OBL.           135050      
003422      MOVE B07-CONTRATO           TO  MSG-R01-CONTRATO            135100      
003423                                      WKS-B07-CONTRATO            135150      
003424      MOVE B07-MED-ACCESO         TO  MSG-R01-CVEMDA              135200      
003425      MOVE B07-MDA-PREF           TO  MSG-R01-MDA-SUC             135300      
003426      MOVE B07-MDA-CUENTA         TO  MSG-R01-MDA-CTA             135400      
003427      MOVE B07-AUT-APLIC          TO  MSG-R01-AUTORIZA            135500      
003428      MOVE B07-AUT-PC             TO  MSG-R01-REFNUM              135600      
003429      MOVE B07-AUT-S151           TO  MSG-R01-AUT-S151            135700      
003430                                      WKS-B07-AUT-S151            135750      
003431      MOVE B07-FEC-CARGO          TO  MSG-R01-FECMOV              135800      
003432                                      WKS-B07-FEC-CARGO           135850      
003433      MOVE B07-CVE-TRANS          TO  MSG-R01-CVETRAN             135900      
003434      MOVE B07-NUM-OCURR          TO  MSG-R01-OCCUR               136000      
003435                                      WKS-B07-NUM-OCURR           136050      
003436      MOVE B07-IMPORTE            TO  MSG-R01-IMPORTE             136100      
003437      MOVE B07-NUM-ERROR          TO  MSG-R01-ERROR               136200      
003438      MOVE WKS-AREA-MSG-OBL       TO  WKS-AREA-USUARIO            136300      
003439                                                                  136335      
003440      MOVE  B07-NUM-CTE           TO WKS-B07-NUM-CTE.             136370      
003441                                                                  136400      
003442 060200-ARMAREST-ENV-DIALOGO.                                     136500      
003443*==========================                                       136600      
003444      MOVE "F"                    TO  WKS-HDR-PREFIJO             136700      
003445      MOVE "0"                    TO  WKS-HDR-APLDEST             136800      
003446*********** EL S702 ES CENTRALIZADO  *****************            136900      
003447*INICIO JMLT                                                      136920      
003448* 0 ES CENTRALIZADO                                               136940      
003449      IF WKS-VAL-CENTR(IND-SERV) = 0                              136960      
003450*FIN JMLT                                                         136980      
003451         MOVE 10                  TO  WKS-HDR-CCRDEST             137000      
003452*INICIO JMLT                                                      137006      
003453      ELSE                                                        137012      
003454      IF WKS-NOMEQUIPO = "VDMBETA."                               137018      
003455          MOVE WKS-CSIDEST TO WKS-HDR-CCRDEST                     137024      
003456      ELSE                                                        137030      
003457      IF WKS-NOMEQUIPO = "ACYPGAMA." OR WKS-NOMEQUIPO = "MONALFA."137036      
003458          MOVE WKS-CSIDEST TO WKS-HDR-CCRDEST                     137042      
003459      ELSE                                                        137048      
003460         IF WKS-NUMCSI-HOST = 10 AND (IND-SERV = 2 OR 3)          137054      
003461                  MOVE WKS-CSIDEST TO WKS-HDR-CCRDEST             137060      
003462         ELSE                                                     137066      
003463         IF WKS-NUMCSI-HOST = 4 AND (IND-SERV = 2 OR 3)           137072      
003464                  MOVE WKS-CSIDEST TO WKS-HDR-CCRDEST.            137078      
003465*FIN JMLT                                                         137084      
003466      IF   WKS-NUMCSI-HOST = 32                                   137100      
003467           MOVE 32                TO  WKS-HDR-CCRDEST.            137200      
003468                                                                  137300      
003469      MOVE 0                      TO  WKS-HDR-LSNORGN             137400      
003470      MOVE "Y"                    TO  WKS-HDR-STA-TIPO            137500      
003471      MOVE WKS-VAL-SUC(IND-SERV)  TO  WKS-HDR-STA-SUC             137550      
003472*JMLT MOVE 342                    TO  WKS-HDR-STA-SUC             137600      
003473      MOVE "A"                    TO  WKS-HDR-STA-PRIV            137700      
003474      MOVE WKS-VAL-CAJA(IND-SERV) TO  WKS-HDR-STA-CAJA            137750      
003475*JMLT MOVE 50                     TO  WKS-HDR-STA-CAJA            137800      
003476      MOVE WKS-NUMCSI-HOST        TO  WKS-HDR-CCRORGN             137900      
003477      MOVE WKS-NUMCSI-HOST        TO  WKS-HDR-COPORGN             138000      
003478      MOVE "0"                    TO  WKS-HDR-FACULTAD            138100      
003479      MOVE "0"                    TO  WKS-HDR-APLORIG             138200      
003480      MOVE WKS-VAL-RDO(IND-SERV)  TO  WKS-HDR-RSLTDO              138250      
003481*JMLT MOVE 2                      TO  WKS-HDR-RSLTDO              138300      
003482      MOVE SPACES                 TO  WKS-HDR-MASCARA             138400      
003483      MOVE SPACES                 TO  WKS-HDR-PASSWORD            138500      
003484*JMLT MOVE 070224                 TO  WKS-ACA-DESTINO             138600      
003485      MOVE WKS-VAL-ACA-DES(IND-SERV)                              138630      
003486                                  TO  WKS-ACA-DESTINO             138660      
003487      MOVE 015114                 TO  WKS-ACA-ORIGEN              138700      
003488*JMLT MOVE 0702                   TO  WKS-SA0-TRN-DSIS            138800      
003489      MOVE WKS-VAL-CVE-TRAN-DES-SIS(IND-SERV)                     138830      
003490                                  TO  WKS-SA0-TRN-DSIS            138860      
003491*JMLT MOVE 10                     TO  WKS-SA0-TRN-DCOD            138900      
003492      MOVE WKS-VAL-CVE-TRAN-DES-COD(IND-SERV)                     138930      
003493                                  TO  WKS-SA0-TRN-DCOD            138960      
003494*JMLT MOVE 001                    TO  WKS-SA0-TRN-DSCOD           139000      
003495      MOVE WKS-VAL-CVE-TRAN-DES-SUB(IND-SERV)                     139030      
003496                                  TO  WKS-SA0-TRN-DSCOD           139060      
003497*JMLT MOVE 0151                   TO  WKS-SA0-TRN-OSIS            139100      
003498      MOVE WKS-VAL-CVE-TRAN-OR-SIS(IND-SERV)                      139130      
003499                                  TO  WKS-SA0-TRN-OSIS            139160      
003500*JMLT MOVE 01                     TO  WKS-SA0-TRN-OCOD            139200      
003501      MOVE WKS-VAL-CVE-TRAN-OR-COD(IND-SERV)                      139230      
003502                                  TO  WKS-SA0-TRN-OCOD            139260      
003503*JMLT MOVE 001                    TO  WKS-SA0-TRN-OSCOD           139300      
003504      MOVE WKS-VAL-CVE-TRAN-OR-SUB(IND-SERV)                      139330      
003505                                  TO  WKS-SA0-TRN-OSCOD           139360      
003506      MOVE B07-STATUS             TO  WKS-SA0-DIRECCION           139400      
003507*JMLT MOVE 225                    TO  WKS-SA0-LONG                139500      
003508      MOVE WKS-LONG-MSG(IND-SERV)                                 139530      
003509                                   TO  WKS-SA0-LONG               139560      
003510*JMLT MOVE 60                     TO  WKS-SA0-TIEMPO-ESPERA       139600      
003511      MOVE WKS-VAL-TESP(IND-SERV) TO  WKS-SA0-TIEMPO-ESPERA       139650      
003512      MOVE 0                      TO  WKS-SA0-RESPUESTA           139700      
003513      MOVE 0                      TO  WKS-SA2-IDENT-FMT           139800      
003514      MOVE 0                      TO  WKS-SA2-RECONOC             139900      
003515      MOVE "B"                    TO  WKS-SA2-VERSION             140000      
003516      MOVE 0                      TO  WKS-SA2-CLASE               140100      
003517      MOVE 0                      TO  WKS-SA2-RESULTADO           140200      
003518      MOVE WKS-VAL-MODO(IND-SERV) TO  WKS-SA2-MODO                140250      
003519*JMLT MOVE 1                      TO  WKS-SA2-MODO                140300      
003520      MOVE WKS-VAL-SUC(IND-SERV)  TO  WKS-SA2-SUCURSAL            140350      
003521*JMLT MOVE 342                    TO  WKS-SA2-SUCURSAL            140400      
003522      MOVE WKS-VAL-CAJA(IND-SERV) TO  WKS-SA2-IDEN-CAJA           140450      
003523*JMLT MOVE 50                     TO  WKS-SA2-IDEN-CAJA           140500      
003524      MOVE WKS-NUM-TRANS          TO  WKS-SA2-TRN-NUM             140600      
003525      IF  IND-SERV = 2 OR 3                                       140620      
003526          MOVE WKS-FECMOV         TO  WKS-SA2-FECHA               140640      
003527          MOVE WKS-HORADG         TO  WKS-SA2-HORA                140660      
003528          MOVE B07-AUT-S151       TO  WKS-SA2-AUT-S151            140665      
003529          MOVE ZEROS              TO  WKS-SA2-FILLER-AUT          140670      
003530      ELSE                                                        140680      
003531*JMLT MOVE WKS-FEC-ENV-MQDG       TO  WKS-SA2-FEC-HR              140700      
003532          MOVE WKS-FEC-ENV-MQDG       TO  WKS-SA2-FEC-HR          140750      
003533          MOVE "0"                    TO  WKS-SA2-IEFE-NOPE.      140760      
003534      MOVE 0                      TO  WKS-SA2-MODALIDAD           140800      
003535*      MOVE "0"                    TO  WKS-SA2-IEFE-NOPE          140900      
003536      MOVE "1"                    TO  WKS-SA2-VER-OPC             141000      
003537      PERFORM 060300-ENVIA-RESPUESTA.                             141100      
003538                                                                  141200      
003539                                                                  141300      
003540 060300-ENVIA-RESPUESTA.                                          141400      
003541*=======================                                          141500      
003542    MOVE 1                            TO CS-COMS-OUT-COUNT        141600      
003543*JMLTMOVE 225                          TO CS-COMS-OUT-TEXT-LENGTH 141700      
003544    MOVE WKS-LONG-MSG(IND-SERV)       TO CS-COMS-OUT-TEXT-LENGTH  141750      
003545    MOVE 0                            TO CS-COMS-OUT-STATUS-KEY   141800      
003546    MOVE W77-COMS-AG-SALIDA-DESG      TO CS-COMS-OUT-AGENDA       141900      
003547    MOVE W77-COMS-DEFSTATION-DESG     TO CS-COMS-OUT-DESTINATION  142000      
003548*INICIO JMLT COMPARACION PARA ESCRIBIR EN EL ARCHIVO MONITOR      142025      
003549    IF IND-SERV = 1                                               142050      
003550*FIN JMLT                                                         142075      
003551    MOVE "ENVIO MENSAJE  S151-S702"   TO WKS-SENTIDO-MSG          142100      
003552*INICIO JMLT COMPARACION PARA ESCRIBIR EN EL ARCHIVO MONITOR      142115      
003553    ELSE                                                          142130      
003554          IF IND-SERV = 2 OR 3                                    142145      
003555          MOVE "ENVIO MENSAJE  S151-C845"   TO WKS-SENTIDO-MSG.   142160      
003556*FIN JMLT                                                         142175      
003557    PERFORM 060950-ESCRIBE-MONITOR                                142200      
003558    PERFORM 030710-ENVIA-COMS.                                    142300      
003559                                                                  142400      
003560                                                                  142500      
003561 060400-OBT-FECH-TANS-DGO.                                        142600      
003562*=======================                                          142700      
003563    MOVE    B07-NUM-OCURR  TO WKS-NUM-TRANS-OCCURS                142800      
003564    MOVE    B07-AUT-S151   TO WKS-NUM-TRANS-AUTS151               142900      
003565    ACCEPT  WKS-FEC-MAQ-DG FROM DATE                              143000      
003566    ACCEPT  WKS-HR-MAQ-DG  FROM TIME.                             143100      
003567                                                                  143200      
003568                                                                  143300      
003569                                                                  143400      
003570 060700-DISPLAY.                                                  143500      
003571    IF CONT-REG-DISPLAY = 6500                                    143505      
003572        CLOSE  L01-DISPLAY       WITH SAVE                        143508      
003573        ACCEPT WKS-HORMAQ-HMSD   FROM  TIME                       143511      
003574        MOVE   WKS-HORMAQ-HMSD   TO WKS-RUT-L01-HORA              143514      
003575        CHANGE ATTRIBUTE TITLE   OF L01-DISPLAY                   143517      
003576                                 TO WKS-RUT-L01                   143520      
003577        OPEN  OUTPUT  L01-DISPLAY                                 143523      
003578        MOVE    1                TO  CONT-REG-DISPLAY             143526      
003579        WRITE REG-DISPLAY        FROM REGISTRO-DIS-HEADER.        143529      
003580                                                                  143540      
003581     ADD    1                      TO  CONT-REG-DISPLAY           143545      
003582     ACCEPT WKS-HORMAQ-HMSD        FROM  TIME                     143600      
003583     ACCEPT WKS-DATO               FROM DATE                      143700      
003584     MOVE   20                     TO WKS-DIS-FECHA-S             143800      
003585     MOVE   WKS-DATO-AMO           TO WKS-DIS-FECHA-A             143900      
003586     MOVE   WKS-DATO-MES           TO WKS-DIS-FECHA-M             144000      
003587     MOVE   WKS-DATO-DIA           TO WKS-DIS-FECHA-D             144100      
003588     MOVE   WKS-HORA-H             TO WKS-DIS-HORA                144200      
003589     MOVE   WKS-HORA-M             TO WKS-DIS-MINUTO              144300      
003590     MOVE   WKS-DIS-TEXTO          TO WKS-DIS-MENSAJE             144400      
003591     WRITE  REG-DISPLAY FROM  REGISTRO-DIS-DETALLE.               144500      
003592                                                                  144600      
003593                                                                  144700      
003594 060800-ENCIENDE-MONITOR.                                         144800      
003595*========================                                         144900      
003596   ACCEPT WKS-HORMAQ-HMSD        FROM  TIME                       145000      
003597   MOVE   WKS-HORMAQ-HMSD        TO WKS-RUT-L02-HORA              145100      
003598   IF WKS-STATUS-MONITOR = 1                                      145200      
003599      CLOSE  L02-MONITOR WITH SAVE.                               145300      
003600   CHANGE ATTRIBUTE TITLE        OF L02-MONITOR                   145400      
003601                                 TO WKS-RUT-L02.                  145500      
003602   OPEN OUTPUT L02-MONITOR.                                       145600      
003603   MOVE  1                       TO  WKS-STATUS-MONITOR.          145700      
003604                                                                  145800      
003605                                                                  145900      
003606 060900-APAGA-MONITOR.                                            146000      
003607*=======================                                          146100      
003608  IF  WKS-STATUS-MONITOR = 1                                      146200      
003609      CLOSE L02-MONITOR WITH SAVE.                                146300      
003610  MOVE 0                        TO WKS-STATUS-MONITOR.            146400      
003611                                                                  146500      
003612                                                                  146600      
003613 060950-ESCRIBE-MONITOR.                                          146700      
003614*=======================                                          146800      
003615 IF WKS-STATUS-MONITOR = 1                                        146900      
003616    MOVE WKS-FEC-MAQ-DG  TO WKS-FEC-MON                           146945      
003617    ACCEPT WKS-HRS-MON FROM TIME                                  146990      
003618    MOVE SPACES        TO WKS-ESPACIO1 WKS-ESPACIO2               147000      
003619    MOVE WKS-REG-MSG   TO WKS-DATOS-MSJ                           147100      
003620*INICIO JMLT COMPARACION PARA ESCRIBIR EN EL ARCHIVO MONITOR      147125      
003621    IF IND-SERV = 1                                               147150      
003622*FIN JMLT                                                         147175      
003623    STRING  MSG-R01-AUT-S151 DELIMITED BY SIZE,                   147200      
003624            MSG-R01-OCCUR    DELIMITED BY SIZE,                   147300      
003625    INTO    WKS-LLAVE-MSG                                         147400      
003626*INICIO JMLT COMPARACION PARA ESCRIBIR EN EL ARCHIVO MONITOR      147410      
003627    WRITE REG-MONITOR                                             147420      
003628    ELSE                                                          147430      
003629    IF IND-SERV = 2 OR 3                                          147440      
003630    MOVE  WKS-SA2-TRN-NUM       TO WKS-NUM-TRANS                  147445      
003631    STRING  "0"                   DELIMITED BY SIZE,              147450      
003632            WKS-NUM-TRANS-AUTS151 DELIMITED BY SIZE,              147453      
003633            "0"                   DELIMITED BY SIZE,              147456      
003634            WKS-NUM-TRANS-OCCURS  DELIMITED BY SIZE,              147460      
003635    INTO    WKS-LLAVE-MSG                                         147470      
003636*FIN JMLT                                                         147480      
003637    WRITE REG-MONITOR.                                            147500      
003638                                                                  147600      
003639                                                                  147700      
003640 060960-BEGIN-TRANS.                                              147800      
003641*=======================                                          147900      
003642     BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL                   148000      
003643     ON EXCEPTION                                                 148100      
003644        MOVE "ERROR EN BEGIN TRANS " TO WKS-DMS-DSCERR            148200      
003645        PERFORM 8000000-DMTERMINATE.                              148300      
003646                                                                  148400      
003647                                                                  148500      
003648 060970-END-TRANS.                                                148600      
003649*=======================                                          148700      
003650      END-TRANSACTION AUDIT S151B99REINICTL                       148800      
003651      ON EXCEPTION                                                148900      
003652         MOVE "ERROR EN END TRANS "  TO WKS-DMS-DSCERR            149000      
003653         PERFORM 8000000-DMTERMINATE.                             149100      
003654                                                                  149200      
003655                                                                  149300      
003656                                                                  149400      
003657***************************************************************   149500      
003658*                RUTINAS DE ACCESO BD                         *   149600      
003659***************************************************************   149700      
003660                                                                  149800      
003661 700100-ABRE-BD.                                                  149900      
003662*==================                                               150000      
003663    MOVE ZERO  TO  W77-FIN                                        150010      
003664    OPEN UPDATE S151BD13BIFIN                                     150100      
003665    ON EXCEPTION                                                  150200      
003666       MOVE     1                               TO W77-FIN        150300      
003667       ADD      1                               TO W77-INTENTO    150400      
003668       WAIT(10).                                                  150500      
003669                                                                  150600      
003670                                                                  150700      
003671 700200-ALMACENA-REG.                                             150800      
003672*=========================                                        150900      
003673   MOVE ZERO    TO  WKS-DUPLICADO                                 150905      
003674   STORE  S151B07PROTCOB                                          151000      
003675        ON EXCEPTION                                              151100      
003676        IF DMSTATUS (DUPLICATES)                                  151105      
003677           MOVE A00-R01-CONTRATO  TO MSG-R01-CONTRATO             151106      
003678           MOVE A00-R01-REFNUM    TO MSG-R01-REFNUM               151107      
003679           MOVE A00-R01-AUT-S151  TO MSG-R01-AUT-S151             151108      
003680          STRING "REG DUPLICADO  "                                151110      
003681               MSG-R01-CONTRATO       DELIMITED BY SIZE ,         151115      
003682               MSG-R01-REFNUM         DELIMITED BY SIZE ,         151120      
003683               MSG-R01-AUT-S151       DELIMITED BY SIZE ,         151125      
003684               WKS-NUM-OCCURS         DELIMITED BY SIZE ,         151130      
003685                                      INTO WKS-DIS-TEXTO          151135      
003686          PERFORM 060700-DISPLAY                                  151140      
003687          MOVE    1  TO  WKS-DUPLICADO                            151145      
003688          MOVE LOW-VALUES TO MSG-R01-CONTRATO                     151146      
003689                             MSG-R01-REFNUM                       151147      
003690                             MSG-R01-AUT-S151                     151148      
003691        ELSE                                                      151150      
003692           MOVE "ERROR STORE S151B07PROTCOB" TO WKS-DMS-DSCERR    151200      
003693           PERFORM 8000000-DMTERMINATE.                           151300      
003694                                                                  151400      
003695                                                                  151500      
003696 700300-BUSCA-REG-B07SXFECHA.                                     151600      
003697*============================                                     151700      
003698   MOVE ZERO        TO WKS-EOF-B07                                151800      
003699   LOCK FIRST B07SXFECHA AT                                       151900      
003700       B07-NUM-ID    =  WKS-R01-NUM-ID    AND                     152000      
003701       B07-FEC-CARGO =  WKS-R01-FECMOV    AND                     152100      
003702       B07-CONTRATO  =  WKS-R01-CONTRATO  AND                     152200      
003703       B07-AUT-S151  =  WKS-R01-AUT-S151  AND                     152300      
003704       B07-NUM-OCURR =  WKS-R01-OCCUR                             152400      
003705   ON EXCEPTION                                                   152500      
003706      MOVE  1    TO WKS-EOF-B07                                   152550      
003707      IF DMSTATUS(NOTFOUND)                                       152600      
003708         MOVE  1    TO WKS-EOF-B07                                152700      
003709          STRING "MSG RECIBIDO REG NO LOCALIZADO  "               152800      
003710              MSG-R01-CONTRATO       DELIMITED BY SIZE ,          152900      
003711              MSG-R01-REFNUM         DELIMITED BY SIZE ,          153000      
003712              MSG-R01-AUT-S151       DELIMITED BY SIZE ,          153100      
003713              MSG-R01-OCCUR          DELIMITED BY SIZE ,          153200      
003714              WKS-SA0-DIRECCION      DELIMITED BY SIZE ,          153300      
003715                                     INTO WKS-DIS-TEXTO           153400      
003716         PERFORM 060700-DISPLAY                                   153500      
003717      ELSE                                                        153600      
003718         MOVE "ERROR LOCK FIRST B07SXFECHA" TO WKS-DMS-DSCERR     153700      
003719         PERFORM 8000000-DMTERMINATE.                             153800      
003720                                                                  153900      
003721                                                                  154000      
003722 700400-BUSCA-REG-B07SXFECSTA.                                    154100      
003723*==============================                                   154200      
003724   MOVE ZERO        TO WKS-EOF-B07                                154300      
003725   MOVE 1           TO WKS-LOCK-OK.                               154400      
003726   LOCK FIRST B07SXFECSTA AT                                      154450      
003727       B07-NUM-ID    =  WKS-NUM-ID    AND                         154500      
003728       B07-FEC-CARGO =  WKS-FECPRO-6D AND                         154600      
003729       B07-STATUS    =  WKS-STATUS    AND                         154650      
003730       B07-HR-ENVIO  <  WKS-SEG-MAQUINA                           154700      
003731   ON EXCEPTION                                                   154750      
003732      IF DMSTATUS(DEADLOCK)                                       154800      
003733           MOVE 0 TO WKS-LOCK-OK                                  154900      
003734           MOVE "DEADLOCK              " TO WKS-DIS-TEXTO         155000      
003735           PERFORM 060700-DISPLAY                                 155100      
003736      ELSE                                                        155200      
003737           MOVE  1    TO WKS-EOF-B07                              155300      
003738           IF DMSTATUS(NOTFOUND)                                  155315      
003739                  MOVE  1    TO WKS-EOF-B07                       155330      
003740           ELSE                                                   155345      
003741                  MOVE "ERROR LOCK FIRST B07SXFECSTA"             155360      
003742                              TO WKS-DMS-DSCERR                   155375      
003743                  PERFORM 8000000-DMTERMINATE.                    155390      
003744                                                                  155400      
003745 700500-BUSCA-REG-B07SXFECSTAN.                                   155500      
003746*==============================                                   155600      
003747   MOVE ZERO        TO WKS-EOF-B07.                               155700      
003748   MOVE 1           TO WKS-LOCK-OK.                               155800      
003749   LOCK NEXT B07SXFECSTA AT                                       155850      
003750       B07-NUM-ID    =  WKS-NUM-ID    AND                         155900      
003751       B07-FEC-CARGO =  WKS-FECPRO-6D AND                         156000      
003752       B07-STATUS    =  WKS-STATUS    AND                         156050      
003753       B07-HR-ENVIO  <  WKS-SEG-MAQUINA                           156100      
003754   ON EXCEPTION                                                   156150      
003755       IF DMSTATUS(DEADLOCK)                                      156200      
003756            MOVE 0 TO WKS-LOCK-OK                                 156300      
003757            MOVE "DEADLOCK     " TO WKS-DIS-TEXTO                 156400      
003758            PERFORM 060700-DISPLAY                                156500      
003759       ELSE                                                       156600      
003760           IF DMSTATUS(NOTFOUND)                                  156700      
003761                  MOVE  1    TO WKS-EOF-B07                       156715      
003762          ELSE                                                    156730      
003763                  MOVE "ERROR LOCK NEXT B07SXFECSTA"              156745      
003764                          TO WKS-DMS-DSCERR                       156760      
003765                  PERFORM 8000000-DMTERMINATE.                    156775      
003766                                                                  156790      
003767 700600-BUSCA-ELIM-B07SXFECHA.                                    156800      
003768*==============================                                   156900      
003769   MOVE ZERO             TO WKS-EOF-B07                           157000      
003770   MOVE 1                TO WKS-LOCK-OK                           157050      
003771   LOCK FIRST B07SXFECHA  AT                                      157100      
003772       B07-NUM-ID    =  WKS-NUM-ID        AND                     157240      
003773       B07-FEC-CARGO =  WKS-R01-FECMOV    AND                     157300      
003774       B07-CONTRATO  =  WKS-R01-CONTRATO  AND                     157350      
003775       B07-AUT-S151  =  WKS-R01-AUT-S151  AND                     157400      
003776       B07-NUM-OCURR =  WKS-NUM-OCR                               157450      
003777   ON EXCEPTION                                                   157500      
003778      IF DMSTATUS(DEADLOCK)                                       157525      
003779           MOVE 0 TO WKS-LOCK-OK                                  157550      
003780           MOVE "DEADLOCK              " TO WKS-DIS-TEXTO         157575      
003781           PERFORM 060700-DISPLAY                                 157600      
003782      ELSE                                                        157700      
003783          IF DMSTATUS(NOTFOUND)                                   157800      
003784             MOVE  1    TO WKS-EOF-B07                            157900      
003785          ELSE                                                    158000      
003786             MOVE "ERROR LOCK FIRST B07SXFECHA" TO WKS-DMS-DSCERR 158100      
003787             PERFORM 8000000-DMTERMINATE.                         158200      
003788 700700-BUSCA-ELIM-B07SXFECHAN.                                   158300      
003789*==============================                                   158400      
003790   MOVE ZERO        TO WKS-EOF-B07                                158500      
003791   LOCK NEXT B07SXFECHA  AT                                       158600      
003792       B07-NUM-ID    >  0                 AND                     158740      
003793       B07-FEC-CARGO =  WKS-R01-FECMOV    AND                     158760      
003794       B07-CONTRATO  =  A00-R01-CONTRATO  AND                     158800      
003795       B07-AUT-S151  =  WKS-R01-AUT-S151                          158900      
003796   ON EXCEPTION                                                   159000      
003797       IF DMSTATUS(NOTFOUND)                                      159100      
003798          MOVE  1    TO WKS-EOF-B07                               159200      
003799       ELSE                                                       159300      
003800          MOVE "ERROR LOCK NEXT B07SXFECHA" TO WKS-DMS-DSCERR     159400      
003801          PERFORM 8000000-DMTERMINATE.                            159500      
003802                                                                  159600      
003803                                                                  159700      
003804 700700-CREAT-B07.                                                159800      
003805*==========================                                       159900      
003806    CREATE S151B07PROTCOB                                         160000      
003807    ON EXCEPTION                                                  160100      
003808       MOVE "ERROR AL CREAR B07" TO WKS-DMS-DSCERR                160200      
003809       PERFORM 8000000-DMTERMINATE.                               160300      
003810                                                                  160400      
003811                                                                  160500      
003812 701000-CIERRA-BD-DISPLAY.                                        160600      
003813*===========================                                      160700      
003814   CLOSE S151BD13BIFIN                                            160800      
003815   ON EXCEPTION                                                   160810      
003816      MOVE "ERROR AL CERRAR BD S151BD13BIFIN"  TO WKS-DIS-TEXTO   160820      
003817      PERFORM 060700-DISPLAY.                                     160830      
003818   CLOSE L01-DISPLAY WITH SAVE                                    160900      
003819   PERFORM 060900-APAGA-MONITOR.                                  161000      
003820                                                                  161100      
003821                                                                  161200      
003822 8000000-DMTERMINATE.                                             161300      
003823*================================                                 161400      
003824     MOVE DMSTATUS(DMCATEGORY)     TO WKS-DMCATEGORY.             161500      
003825     MOVE DMSTATUS(DMERRORTYPE)    TO WKS-DMERRORTYPE.            161600      
003826     MOVE DMSTATUS(DMSTRUCTURE)    TO WKS-DMSTRUCTURE.            161700      
003827     STRING WKS-DMCATEGORY         DELIMITED BY SIZE,             161800      
003828     WKS-DMERRORTYPE               DELIMITED BY SIZE,             161900      
003829     WKS-DMSTRUCTURE               DELIMITED BY SIZE,             162000      
003830     "  :  "                       DELIMITED BY SIZE,             162100      
003831     WKS-DMS-DSCERR                DELIMITED BY SIZE              162200      
003832                                   INTO WKS-DIS-TEXTO.            162300      
003833     PERFORM 060700-DISPLAY                                       162400      
003834     MOVE SPACES                       TO TEXTO-LJ.               162500      
003835     STRING WKS-DMS-DSCERR DELIMITED BY SIZE                      162600      
003836                           INTO TEXTO-LJ.                         162700      
003837     CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         162800      
003838*    PERFORM 999999-FIN.                                          162900      
003839     PERFORM 8500000-ERROR-FATAL.                                 162903      
003840                                                                  162906      
003841 8500000-ERROR-FATAL.                                             162909      
003842*====================                                             162912      
003843     MOVE SPACES TO WKS-DIS-TEXTO                                 162915      
003844     IF DMSTATUS (SYSTEMERROR)                                    162918      
003845        MOVE "SYSTEM ERROR" TO WKS-DIS-TEXTO                      162921      
003846        PERFORM 060700-DISPLAY                                    162924      
003847        PERFORM 999999-FIN                                        162927      
003848     ELSE                                                         162930      
003849     IF DMSTATUS (OPENERROR)                                      162933      
003850        MOVE "OPEN ERROR" TO WKS-DIS-TEXTO                        162936      
003851        PERFORM 060700-DISPLAY                                    162939      
003852        PERFORM 999999-FIN                                        162942      
003853     ELSE                                                         162945      
003854     IF DMSTATUS (CLOSEERROR)                                     162948      
003855        MOVE "CLOSE ERROR" TO WKS-DIS-TEXTO                       162951      
003856        PERFORM 060700-DISPLAY                                    162954      
003857        PERFORM 999999-FIN                                        162957      
003858     ELSE                                                         162960      
003859     IF DMSTATUS (AUDITERROR)                                     162963      
003860        MOVE "AUDIT ERROR" TO WKS-DIS-TEXTO                       162966      
003861        PERFORM 060700-DISPLAY                                    162969      
003862        PERFORM 999999-FIN                                        162972      
003863     ELSE                                                         162975      
003864     IF DMSTATUS (VERSIONERROR)                                   162978      
003865        MOVE "VERSION ERROR" TO WKS-DIS-TEXTO                     162981      
003866        PERFORM 060700-DISPLAY                                    162984      
003867        PERFORM 999999-FIN.                                       162987      
003868                                                                  162990      
003869***************************************************************   163000      
003870*                       COMS                              *       163100      
003871***************************************************************   163200      
003872 080500-ACEPTA-MENSAGE.                                           163300      
003873*======================                                           163400      
003874    MOVE ZERO                TO W77-ACEPTA-MSG                    163500      
003875                                WKS-HDR-RSLTDO                    163600      
003876                                W77-ESPERACOMS-TIPO-EVENTO        163700      
003877                                W77-CONTROL.                      163800      
003878    CALL "ESPERACOMS OF SOPORTECOMS"                              163900      
003879         USING  W77-ESPERACOMS-TIEMPO                             164000      
003880         GIVING W77-ESPERACOMS-TIPO-EVENTO.                       164100      
003881                                                                  164200      
003882    IF W88-POR-MSG  OR W88-POR-EVENTO                             164300      
003883           NEXT SENTENCE                                          164400      
003884    ELSE                                                          164500      
003885    IF W88-POR-TIMEOUT                                            164600      
003886            MOVE 1     TO W77-CONTROL                             164700      
003887            MOVE 1     TO WKS-FIN-RECEIVE                         164750      
003888    ELSE                                                          164800      
003889    IF W88-POR-ACCEPT                                             164900      
003890            MOVE 1     TO W77-CONTROL                             165000      
003891            ACCEPT WKS-BASURA                                     165100      
003892            MOVE 1     TO WKS-FIN-RECEIVE                         165135      
003893    ELSE                                                          165175      
003894    IF W88-POR-HI                                                 165200      
003895       MOVE 1     TO WKS-FIN-RECEIVE                              165250      
003896       IF W88-HI-4 OR W88-HI-6                                    165300      
003897             MOVE    1                TO W77-CONTROL              165400      
003898             PERFORM 999999-FIN                                   165500      
003899             MOVE 22 TO WKS-B05-FUNCION                           165520      
003900             PERFORM 021100-REGB05                                165540      
003901       ELSE                                                       165600      
003902          IF W88-HI-80                                            165610      
003903             MOVE LOW-VALUES TO CVETRAN-PC                        165620      
003904             PERFORM 020700-CATALOGO                              165630      
003905          ELSE                                                    165640      
003906             IF W88-HI-25                                         165650      
003907                MOVE LOW-VALUES TO CVETRAN-PC                     165660      
003908                PERFORM 010100-CAMBIO-DIA                         165670      
003909             ELSE                                                 165680      
003910                MOVE ZERO  TO W77-HI                              165700      
003911                MOVE 1     TO W77-CONTROL                         165800      
003912    ELSE                                                          165900      
003913       MOVE W77-ESPERACOMS-TIPO-EVENTO TO                         166000      
003914            WKS-ESPERACOMS-TIPO-EVENTO                            166100      
003915       STRING "EVENTO DESCONOCIDO "WKS-ESPERACOMS-TIPO-EVENTO     166200      
003916       DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                      166300      
003917       PERFORM 060700-DISPLAY                                     166400      
003918       MOVE 1        TO W77-CONTROL.                              166500      
003919                                                                  166600      
003920      PERFORM  00000-RECEIVE.                                     166615      
003921                                                                  166630      
003922 00000-RECEIVE.                                                   166645      
003923     IF  W77-CONTROL = ZEROS                                      166700      
003924         MOVE  SPACES                 TO  WKS-AREA-MSG-OBL        166800      
003925         RECEIVE  COMS-IN  MESSAGE    INTO  WKS-REG-MSG           166900      
003926         NO DATA NEXT SENTENCE.                                   166950      
003927     IF  W77-CONTROL = ZEROS                                      166975      
003928          MOVE "RECEPCCION DE HI, ECOS " TO WKS-SENTIDO-MSG       167000      
003929          MOVE WKS-AREA-USUARIO          TO WKS-AREA-MSG-OBL-SERV2167100      
003930          IF W88-POR-MSG                                          167200      
003931             PERFORM 060950-ESCRIBE-MONITOR.                      167300      
003932                                                                  167600      
003933     MOVE CS-COMS-IN-STATUS-KEY TO WKS-COMS-IN-STATUS-KEY         167700      
003934     IF W77-CONTROL = ZERO                                        167800      
003935        IF  CS-COMS-IN-STATUS-KEY  =  99                          167900      
003936            MOVE ZERO            TO CS-COMS-IN-STATUS-KEY         167950      
003937            STRING "FIN DE PROGRAMA X ESTATUS  "                  168000      
003938                    WKS-COMS-IN-STATUS-KEY                        168100      
003939            DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                 168200      
003940            PERFORM 060700-DISPLAY                                168300      
003941            MOVE  1              TO W77-FIN WKS-FIN-RECEIVE       168400      
003942        ELSE                                                      168500      
003943        IF  CS-COMS-IN-STATUS-KEY  =  0 OR 89 OR 91 OR 92 OR 93   168600      
003944            PERFORM  00000-VAL-MSG-ENTRADA                        168700      
003945        ELSE                                                      168800      
003946           MOVE " >> ERROR RECEIVE MSG >>> " TO WKS-DIS-TEXTO     168900      
003947           PERFORM 060700-DISPLAY                                 169000      
003948           STRING "CS-COMS-IN-STATUS-KEY = "                      169100      
003949                  WKS-COMS-IN-STATUS-KEY                          169200      
003950           DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                  169300      
003951           PERFORM 060700-DISPLAY                                 169400      
003952           STRING "HEADER " WKS-HDR-MSG " ACA " WKS-ACA           169500      
003953                  " SA0 " WKS-SA0 " SA2 " WKS-SA2                 169600      
003954           DELIMITED BY SIZE INTO WKS-DIS-TEXTO                   169700      
003955           PERFORM 060700-DISPLAY.                                169800      
003956                                                                  169805      
003957 00000-VAL-MSG-ENTRADA.                                           169810      
003958    IF WKS-HDR-RSLTDO = 31 OR 32 OR 3                             169815      
003959        IF WKS-ACA-DESTINO = 015114  AND (WKS-ACA-ORIGEN = 013703 169820      
003960                                          OR 013706)              169822      
003961            MOVE WKS-AREA-USUARIO    TO WKS-AREA-MSG-OBL-SERV2    169825      
003962            PERFORM 0000-LLENAR-DAT-BUS                           169830      
003963            MOVE 0                   TO WKS-LOCK-OK  WKS-EOF-B07  169831      
003964            PERFORM 0000-BUSCA-REG-PEND UNTIL WKS-LOCK-OK =1      169835      
003965            IF WKS-EOF-B07 = 0                                    169837      
003966                  PERFORM 0000-SETEA-STATUS                       169840      
003967                  PERFORM 060960-BEGIN-TRANS                      169845      
003968                  PERFORM 700200-ALMACENA-REG                     169850      
003969                  PERFORM 060970-END-TRANS                        169855      
003970             ELSE                                                 169857      
003971                  NEXT SENTENCE                                   169859      
003972        ELSE                                                      169860      
003973            NEXT SENTENCE                                         169865      
003974    ELSE                                                          169870      
003975        NEXT SENTENCE.                                            169875      
003976                                                                  169880      
003977 0000-LLENAR-DAT-BUS.                                             169885      
003978    MOVE WKS-SA2-TRN-NUM        TO WKS-NUM-TRANS.                 169890      
003979    MOVE 2                      TO WKS-NUM-ID                     169895      
003980    MOVE MSG-R02-FECCON         TO WKS-B07-FEC-CARGO              169900      
003981    MOVE 0                      TO WKS-VAL-FIN                    169905      
003982    PERFORM 00000-VAL-NUM-CTE UNTIL WKS-VAL-FIN =1                169910      
003983    MOVE 0                      TO WKS-VAL-FIN                    169915      
003984    PERFORM 00000-VAL-NUM-CTO UNTIL WKS-VAL-FIN = 1               169920      
003985    MOVE WKS-NUM-TRANS-AUTS151  TO WKS-B07-AUT-S151               169925      
003986    MOVE WKS-NUM-TRANS-OCCURS   TO WKS-B07-NUM-OCURR              169930      
003987    MOVE WKS-SA0-DIRECCION      TO WKS-STATUS                     169935      
003988    MOVE WKS-HDR-RSLTDO         TO WKS-B07-NUM-ERROR.             169940      
003989                                                                  169945      
003990 00000-VAL-NUM-CTE.                                               169950      
003991     MOVE 1                      TO WKS-VAL-FIN                   169955      
003992     MOVE 3                      TO W77-FUNCION                   169958      
003993     MOVE 0                      TO W77-FORMATO                   169960      
003994     MOVE MSG-R02-CUSTID         TO WKS-NUM-CTE                   169965      
003995     CALL "JUSTIFIER IN LOCSUP"                                   169970      
003996          USING WKS-NUM-CTE,W77-FUNCION,W77-FORMATO.              169975      
003997     IF W77-FUNCION > ZEROS                                       169980      
003998        MOVE 0                      TO WKS-VAL-FIN                169985      
003999        STRING "ERROR AL VALIDAR NUM CTE "                        169990      
004000        DELIMITED BY SIZE INTO WKS-DIS-TEXTO                      169995      
004001        PERFORM 060700-DISPLAY                                    170000      
004002     ELSE                                                         170005      
004003        MOVE WKS-NUM-CTE-R            TO WKS-B07-NUM-CTE.         170010      
004004                                                                  170015      
004005 00000-VAL-NUM-CTO.                                               170020      
004006     MOVE 1                         TO WKS-VAL-FIN                170025      
004007     MOVE 3                      TO W77-FUNCION                   170027      
004008     MOVE 0                         TO W77-FORMATO                170030      
004009     MOVE MSG-R02-ACCNUM            TO WKS-NUM-CONTRATO           170035      
004010     CALL "JUSTIFIER IN LOCSUP"                                   170040      
004011          USING WKS-NUM-CONTRATO,W77-FUNCION,W77-FORMATO.         170045      
004012     IF W77-FUNCION > ZEROS                                       170050      
004013        MOVE 0                      TO WKS-VAL-FIN                170055      
004014        STRING "ERROR AL VALIDAR NUM CTO "                        170060      
004015        DELIMITED BY SIZE INTO WKS-DIS-TEXTO                      170065      
004016        PERFORM 060700-DISPLAY                                    170070      
004017     ELSE                                                         170075      
004018        MOVE WKS-NUM-CONTRATO-R     TO WKS-B07-CONTRATO.          170080      
004019                                                                  170085      
004020                                                                  170090      
004021                                                                  170095      
004022 030710-ENVIA-COMS.                                               170200      
004023*==================                                               170300      
004024    SEND COMS-OUT FROM WKS-REG-MSG.                               170400      
004025     MOVE CS-COMS-OUT-STATUS-KEY TO WKS-B07-NUM-ERROR             170450      
004026    IF CS-COMS-OUT-STATUS-KEY = 0 OR 96                           170500      
004027       NEXT SENTENCE                                              170600      
004028    ELSE                                                          170700      
004029       PERFORM 00400-VAL-STATUS-ENV                               170750      
004030       MOVE CS-COMS-OUT-STATUS-KEY    TO W77-STATUS-KEY           170800      
004031       STRING MY-ID " ERROR EN SEND MSG ST-KEY "                  170900      
004032              W77-STATUS-KEY                                      171000      
004033       DELIMITED BY SIZE INTO MENSAJE-LJ                          171100      
004034       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        171200      
004035       STRING MY-ID " ERROR EN SEND MSG ST-KEY "                  171300      
004036              W77-STATUS-KEY            DELIMITED BY SIZE ,       171400      
004037              MSG-R01-CONTRATO          DELIMITED BY SIZE ,       171500      
004038              MSG-R01-REFNUM            DELIMITED BY SIZE ,       171600      
004039              MSG-R01-AUT-S151          DELIMITED BY SIZE ,       171700      
004040              MSG-R01-OCCUR             DELIMITED BY SIZE ,       171800      
004041              WKS-SA0-DIRECCION         DELIMITED BY SIZE ,       171900      
004042                                        INTO WKS-DIS-TEXTO        172000      
004043       PERFORM 060700-DISPLAY.                                    172100      
004044*INCIO JMLT                                                       172120      
004045       MOVE SPACES TO WKS-AREA-USUARIO.                           172140      
004046       MOVE SPACES TO WKS-AREA-MSG-OBL.                           172160      
004047*FIN JMLT                                                         172180      
004048                                                                  172200      
004049                                                                  172300      
004050***************************************************************   172400      
004051*                       MENSAJES ERROR                        *   172500      
004052***************************************************************   172600      
004053                                                                  172700      
004054 800100-HI-SALIDA.                                                172800      
004055*=================                                                172900      
004056    MOVE  020201                      TO CODIGO-LJ.               173000      
004057    MOVE  "I"                         TO TIPO-LJ.                 173100      
004058                                                                  173200      
004059    IF W88-HI-4                                                   173300      
004060       MOVE "TERMINACION NORMAL"      TO TEXTO-LJ                 173400      
004061    ELSE                                                          173500      
004062    IF W88-HI-6                                                   173600      
004063       MOVE "TERMINACION DE EMERGENCIA" TO TEXTO-LJ.              173700      
004064    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                      173800      
004065                                MENSAJE-LJ.                       173900      
004066*    CLOSE L01-DISPLAY SAVE.                                      174000      
004067                                                                  174100      
004068 800200-MUESTRA-ESTADISTICO.                                      174200      
004069*===========================                                      174300      
004070   IF  WKS-REINTENTO = 0                                          174400      
004071       MOVE " REINTENTOS  ACTIVO      " TO   TEXTO-LJ             174500      
004072       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        174600      
004073   ELSE                                                           174700      
004074       MOVE " REINTENTOS  INACTIVOS   " TO TEXTO-LJ               174800      
004075       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       174900      
004076                                                                  175000      
004077       MOVE W77-ESPERACOMS-TIEMPO TO WKS-TIEMPO.                  175005      
004078       STRING                                                     175010      
004079       "Tiempo de espera                                : "       175020      
004080               WKS-TIEMPO                                         175030      
004081       DELIMITED BY SIZE INTO TEXTO-LJ                            175040      
004082       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       175050      
004083                                                                  175060      
004084       STRING                                                     175100      
004085       "Numero de registros leido de archivo MOVS500    : "       175200      
004086               W77-AUT-ENVIO500                                   175300      
004087       DELIMITED BY SIZE INTO TEXTO-LJ                            175400      
004088       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       175500      
004089                                                                  175600      
004090       STRING                                                     175700      
004091       "Numero de mensajes enviados al S702             : "       175800      
004092               WKS-CONT-MSG-ENV                                   175900      
004093       DELIMITED BY SIZE INTO TEXTO-LJ                            176000      
004094       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       176100      
004095                                                                  176200      
004096       STRING                                                     176300      
004097       "Numero de mensajes eliminacion enviados al S702 : "       176400      
004098               WKS-CONT-MSG-ENV-ELIM                              176500      
004099       DELIMITED BY SIZE INTO TEXTO-LJ                            176600      
004100       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       176700      
004101                                                                  176800      
004102       STRING                                                     176900      
004103       "Numero de mensajes recibidos del S702           : "       177000      
004104               WKS-CONT-MSG-REC                                   177100      
004105       DELIMITED BY SIZE INTO TEXTO-LJ                            177200      
004106       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       177300      
004107                                                                  177400      
004108       STRING                                                     177500      
004109       "Numero de mensajes reintentados al S702         : "       177600      
004110               WKS-CONT-MSG-REIN                                  177700      
004111       DELIMITED BY SIZE INTO TEXTO-LJ                            177800      
004112       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       177900      
004113                                                                  177907      
004114       STRING                                                     177914      
004115       "Numero de mensajes enviados a alertas           : "       177921      
004116               WKS-CONT-MSG-ENV-AL                                177928      
004117       DELIMITED BY SIZE INTO TEXTO-LJ                            177935      
004118       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       177942      
004119                                                                  177949      
004120       STRING                                                     177956      
004121       "Numero de mensajes elim enviados a alertas      : "       177963      
004122               WKS-CONT-MSG-ENV-ELIM-AL                           177970      
004123       DELIMITED BY SIZE INTO TEXTO-LJ                            177977      
004124       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       177984      
004125                                                                  178000      
004126       STRING                                                     178010      
004127        "Numero de limite de envios y reintento es      : "       178020      
004128                W77-LIMITE-ENVIOS                                 178030      
004129        DELIMITED BY SIZE INTO TEXTO-LJ                           178040      
004130        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      178050      
004131                                                                  178060      
004132       STRING                                                     178070      
004133        "Numero de limite de pendientes   es             : "      178080      
004134                W77-LIMITE-PENDIENTES                             178090      
004135        DELIMITED BY SIZE INTO TEXTO-LJ                           178100      
004136        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      178110      
004137                                                                  178120      
004138       STRING                                                     178130      
004139        "CSI Destino alertas y notificaciones            : "      178140      
004140                WKS-CSIDEST                                       178150      
004141        DELIMITED BY SIZE INTO TEXTO-LJ                           178160      
004142        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      178170      
004143                                                                  178171      
004144   IF  W88-ENVIO-ALERTAS                                          178172      
004145       MOVE " ENVIO MENSAJES ALERTAS HABILITADO  " TO   TEXTO-LJ  178173      
004146       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        178174      
004147   ELSE                                                           178175      
004148       MOVE " ENVIO MENSAJES ALERTAS DESHABILITADO  " TO TEXTO-LJ 178176      
004149       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       178177      
004150                                                                  178180      
004151   IF  W88-ENVIO-ALER-CLINOCON                                    178182      
004152       STRING " ENVIO MENSAJES ALERTAS CLIENTES NO CONTRATADOS"   178184      
004153              " HABILITADO  " DELIMITED BY SIZE INTO TEXTO-LJ     178186      
004154       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        178188      
004155   ELSE                                                           178190      
004156       STRING " ENVIO MENSAJES ALERTAS CLIENTES NO CONTRATADOS"   178192      
004157              " DESHABILITADO  " DELIMITED BY SIZE INTO TEXTO-LJ  178194      
004158       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       178196      
004159                                                                  178198      
004160 900000-FIN-MAL.                                                  178200      
004161*===============                                                  178300      
004162    MOVE SPACES                       TO TEXTO-LJ.                178400      
004163    STRING " ERROR EN COMS, FIN ERRONEO DE PROGRAMA "             178500      
004164           " AVISAR AL RESPONSABLE DEL SISTEMA "                  178600      
004165    DELIMITED BY SIZE                                             178700      
004166    INTO TEXTO-LJ.                                                178800      
004167    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.          178900      
004168    PERFORM 999999-FIN.                                           179000      
004169                                                                  179100      
004170 999999-FIN.                                                      179200      
004171*===========                                                      179300      
004172     IF W88-HI-6                                                  179400      
004173        MOVE "DISABLE NOW PROGRAM "   TO WKS-SMCOMS-STRING1       179500      
004174     ELSE                                                         179600      
004175        MOVE "DISABLE PROGRAM "       TO WKS-SMCOMS-STRING1.      179700      
004176     MOVE WKS-COMS-MY-PROGRAM-NAME    TO WKS-SMCOMS-STRING2       179800      
004177     CALL "SMCOMS OF SOPORTECOMS"                                 179900      
004178           USING  WKS-SMCOMS-COMANDO                              180000      
004179                  WKS-SMCOMS-TRABAJO                              180100      
004180           GIVING W77-SMCOMS-RESULT.                              180200      
004181     IF W88-SMCOMS-OK                                             180300      
004182        NEXT SENTENCE                                             180400      
004183     ELSE                                                         180500      
004184        MOVE SPACES                   TO TEXTO-LJ                 180600      
004185        MOVE W77-SMCOMS-RESULT        TO W77-RESULT-COMS          180700      
004186        STRING                                                    180800      
004187             " ERROR DISABLE RESULTS "                            180900      
004188             W77-RESULT-COMS                                      181000      
004189        DELIMITED BY SIZE                                         181100      
004190        INTO TEXTO-LJ                                             181200      
004191        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      181300      
004192                                                                  181900      
004193                                                                  182000      
004194 030370-CALC-HR-MQ.                                               182100      
004195     ACCEPT  WKS-HR-MAQUINA             FROM TIME.                182200      
004196     COMPUTE WKS-SEG-MAQUINA = WKS-HH-MAQUINA * 3600 +            182300      
004197                               WKS-MM-MAQUINA * 60   +            182400      
004198                               WKS-SS-MAQUINA.                    182500      
004199                                                                  182600      
004200                                                                  182700      
004201 030350-IMP-HR-DISP.                                              182800      
004202    MOVE ":" TO WKS-DP1-MAQUINA                                   182820      
004203                WKS-DP2-MAQUINA                                   182840      
004204                WKS-HORA-DP1                                      182860      
004205                WKS-HORA-DP2.                                     182880      
004206    MOVE WKS-B05-HORAINI TO WKS-B05-HORAINI-AUX                   182900      
004207    MOVE WKS-B05-HORAINI-AUX-HH TO WKS-HORA-HH                    182930      
004208    MOVE WKS-B05-HORAINI-AUX-MM TO WKS-HORA-MM                    182960      
004209    MOVE WKS-B05-HORAINI-AUX-SS TO WKS-HORA-SS                    182990      
004210    STRING "HORA INICIO BD B05               : "                  183000      
004211                 WKS-HORA-RR DELIMITED BY SIZE                    183050      
004212               INTO     WKS-DIS-TEXTO                             183100      
004213    MOVE WKS-DIS-TEXTO   TO       TEXTO-LJ                        183200      
004214    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ           183400      
004215    PERFORM 060700-DISPLAY.                                       183500      
004216    MOVE SPACES TO TEXTO-LJ WKS-DIS-TEXTO                         183600      
004217    MOVE WKS-SIS-HORAINI-FIN-HH TO WKS-HORA-HH                    183630      
004218    MOVE WKS-SIS-HORAINI-FIN-MM TO WKS-HORA-MM                    183660      
004219    MOVE WKS-SIS-HORAINI-FIN-SS TO WKS-HORA-SS                    183690      
004220    STRING "HORA INICIO SERVICIO PROT COB    : "                  183700      
004221                         WKS-HORA-RR DELIMITED BY SIZE            183900      
004222                         INTO WKS-DIS-TEXTO                       184000      
004223    MOVE WKS-DIS-TEXTO   TO TEXTO-LJ                              184100      
004224    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ           184200      
004225    PERFORM 060700-DISPLAY.                                       184300      
004226    MOVE SPACES TO TEXTO-LJ WKS-DIS-TEXTO                         184400      
004227    STRING "HORA LEVANTAMIENTO DEL PROGRAMA  : "                  184500      
004228                          WKS-HR-MAQUINA-RR  DELIMITED BY SIZE    184700      
004229                          INTO WKS-DIS-TEXTO                      184800      
004230    MOVE WKS-DIS-TEXTO    TO TEXTO-LJ                             184900      
004231    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ           185000      
004232    PERFORM 060700-DISPLAY                                        185100      
004233    MOVE SPACES TO TEXTO-LJ WKS-DIS-TEXTO .                       185200      
004234                                                                  185300      
004235 030360-IMP-HR-DISP.                                              185400      
004236    MOVE ":" TO WKS-DP1-MAQUINA                                   185420      
004237                WKS-DP2-MAQUINA                                   185440      
004238                WKS-HORA-DP1                                      185460      
004239                WKS-HORA-DP2.                                     185480      
004240    MOVE WKS-B05-HORAFIN TO WKS-B05-HORAFIN-AUX                   185500      
004241    MOVE WKS-B05-HORAFIN-AUX-HH TO WKS-HORA-HH                    185530      
004242    MOVE WKS-B05-HORAFIN-AUX-MM TO WKS-HORA-MM                    185560      
004243    MOVE WKS-B05-HORAFIN-AUX-SS TO WKS-HORA-SS                    185590      
004244    STRING "HORA FIN BD B05                  : "                  185600      
004245                          WKS-HORA-RR DELIMITED BY SIZE           185650      
004246                          INTO WKS-DIS-TEXTO                      185800      
004247    MOVE WKS-DIS-TEXTO    TO TEXTO-LJ                             185900      
004248    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ           186000      
004249    PERFORM 060700-DISPLAY.                                       186100      
004250    MOVE SPACES TO TEXTO-LJ WKS-DIS-TEXTO                         186200      
004251    MOVE WKS-SIS-HORAINI-FIN-HH TO WKS-HORA-HH                    186210      
004252    MOVE WKS-SIS-HORAINI-FIN-MM TO WKS-HORA-MM                    186220      
004253    MOVE WKS-SIS-HORAINI-FIN-SS TO WKS-HORA-SS                    186230      
004254    STRING "HORA FIN SERVICIO PROT COB       : "                  187000      
004255                          WKS-HORA-RR  DELIMITED BY SIZE          187200      
004256                          INTO WKS-DIS-TEXTO                      187300      
004257    MOVE WKS-DIS-TEXTO    TO TEXTO-LJ                             187400      
004258    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ           187500      
004259    PERFORM 060700-DISPLAY.                                       187600      
004260    MOVE SPACES TO TEXTO-LJ WKS-DIS-TEXTO .                       187700      
004261                                                                  187750      
004262 030363-MARCA-INICIO-PROG.                                        187800      
004263    IF WKS-INICIA-AUX-R = 0                                       187900      
004264       MOVE ":" TO WKS-DP1-MAQUINA                                187940      
004265                   WKS-DP2-MAQUINA                                187980      
004266       STRING "HORA INICIO DE PROCESO PROT COB  : "               188000      
004267                       WKS-HR-MAQUINA-RR DELIMITED BY SIZE        188100      
004268                             INTO WKS-DIS-TEXTO                   188200      
004269       MOVE WKS-DIS-TEXTO    TO TEXTO-LJ                          188300      
004270       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        188400      
004271       PERFORM 060700-DISPLAY                                     188500      
004272       MOVE 1 TO WKS-INICIA-AUX-R.                                188600      
004273                                                                  188700      
004274 030362-HR-DESPUES-DESPER.                                        188800      
004275     ACCEPT  WKS-HR-MAQUINA    FROM TIME.                         188900      
004276     COMPUTE WKS-HR-INI-PG-AUX   = WKS-HH-MAQUINA * 3600 +        189000      
004277                                   WKS-MM-MAQUINA * 60   +        189100      
004278                                   WKS-SS-MAQUINA.                189200      
004279                                                                  189300      
004280 060100-ARMA-DIALO-OBL-SERV2.                                     189400      
004281*=============================================================    189500      
004282     MOVE SPACES                 TO  WKS-AREA-MSG-OBL.            189550      
004283     MOVE B07-DAT-GEN            TO  WKS-DATGEN                   189600      
004284     MOVE WKS-PROD               TO  MSG-R02-IFILEIDPROD          189700      
004285                                     MSG-R02-PRODNUM.             189800      
004286     PERFORM 020900-MUEVE-FECHA                                   189900      
004287     MOVE WKS-FEC-MAQ            TO  MSG-R02-IFILEIDFEC           190000      
004288     ACCEPT WKS-HORMAQ-HMSD      FROM  TIME                       190100      
004289     MOVE WKS-HORMAQ-HMSD        TO  MSG-R02-IFILEIDHORA          190200      
004290*                                                                 190225      
004291     MOVE SPACES                 TO  WKS-AUX1                     190250      
004292     MOVE SPACES                 TO  WKS-AUX2                     190275      
004293     MOVE B07-NUM-CTE            TO  WKS-VARAUX                   190300      
004294     MOVE WKS-VARAUX             TO  WKS-AUX1                     190310      
004295     PERFORM 030537-JUSTIFICA-VAR-NUM.                            190313      
004296     MOVE WKS-AUX2               TO  MSG-R02-CUSTID               190326      
004297*                                                                 190339      
004298     MOVE SPACES                 TO  WKS-AUX1                     190352      
004299     MOVE SPACES                 TO  WKS-AUX2                     190365      
004300     MOVE B07-CONTRATO           TO  WKS-VARAUX                   190378      
004301     MOVE WKS-VARAUX             TO  WKS-AUX1                     190379      
004302     PERFORM 030537-JUSTIFICA-VAR-NUM.                            190391      
004303     MOVE WKS-AUX2               TO  MSG-R02-ACCNUM               190400      
004304*                                                                 190450      
004305     PERFORM 060130-CHECA-NAT.                                    190500      
004306     MOVE SPACES                 TO  WKS-AUX3                     190533      
004307     MOVE SPACES                 TO  WKS-AUX2                     190566      
004308     MOVE B07-IMPORTE            TO  WKS-VARMONTO                 190600      
004309     MOVE WKS-VARMONTO           TO  WKS-VAREDIT                  190625      
004310     MOVE WKS-VAREDIT            TO  WKS-AUX2                     190650      
004311     PERFORM 030537-JUSTIFICA-VAR-ALP                             190675      
004312     MOVE WKS-AUX3               TO  MSG-R02-VALUESALDO           190700      
004313*                                                                 190725      
004314     MOVE SPACES                 TO  WKS-AUX1                     190750      
004315     MOVE SPACES                 TO  WKS-AUX2                     190775      
004316     MOVE B07-AUT-APLIC          TO  WKS-VARAUX                   190800      
004317     MOVE WKS-VARAUX             TO  WKS-AUX1                     190833      
004318     PERFORM 030537-JUSTIFICA-VAR-NUM.                            190866      
004319     MOVE WKS-AUX2               TO  MSG-R02-ACCNUMH              190900      
004320                                     MSG-R02-AUTORIZA.            191000      
004321     PERFORM  060150-CHECA-MDA-CTO.                               191100      
004322                                                                  191200      
004323     PERFORM 060120-CHECA-SFINAL.                                 191300      
004324     MOVE SPACES                 TO  WKS-AUX3                     191333      
004325     MOVE SPACES                 TO  WKS-AUX2                     191366      
004326     MOVE WKS-SDOF               TO  WKS-VAREDIT                  191400      
004327     MOVE WKS-VAREDIT            TO  WKS-AUX2                     191433      
004328     PERFORM 030537-JUSTIFICA-VAR-ALP                             191466      
004329     MOVE WKS-AUX3               TO  MSG-R02-CURRBALSALDO         191500      
004330                                                                  191550      
004331                                                                  191600      
004332     MOVE WKS-HORADG             TO  MSG-R02-HORA                 191700      
004333     MOVE WKS-FECHA              TO  MSG-R02-FECHA                191800      
004334                                                                  191825      
004335     MOVE SPACES                 TO  WKS-AUX1                     191850      
004336     MOVE SPACES                 TO  WKS-AUX2                     191875      
004337     MOVE WKS-MONEDA             TO  WKS-VARAUX                   191900      
004338     MOVE WKS-VARAUX             TO  WKS-AUX1                     191925      
004339     PERFORM 030537-JUSTIFICA-VAR-NUM                             191950      
004340     MOVE WKS-AUX2               TO  MSG-R02-CURRCODE             192000      
004341                                                                  192010      
004342     MOVE SPACES                 TO  WKS-AUX1                     192020      
004343     MOVE SPACES                 TO  WKS-AUX2                     192030      
004344     MOVE B07-MED-ACCESO         TO  WKS-VARAUX                   192040      
004345     MOVE WKS-VARAUX             TO  WKS-AUX1                     192050      
004346     PERFORM 030537-JUSTIFICA-VAR-NUM.                            192060      
004347     MOVE WKS-AUX2               TO  MSG-R02-CVEMDA               192070      
004348                                                                  192080      
004349     MOVE WKS-MDE                TO  MSG-R02-TRANMEANID           192100      
004350                                                                  192200      
004351     MOVE B07-AUT-PC             TO  WKS-SERVAL                   192300      
004352     MOVE WKS-PROD               TO  MSG-R02-PRODNUM              192400      
004353     PERFORM 060170-CONSULTA-DESCRIPCION.                         192450      
004354     MOVE WKS-FEC-MAQ            TO  MSG-R02-FEC                  192500      
004355     MOVE WKS-HORAR-HMS          TO  MSG-R02-HOR                  192600      
004356     MOVE WKS-SERVAL             TO  MSG-R02-SERV-NOTALERT        192700      
004357     MOVE B07-FEC-CARGO          TO  MSG-R02-FECCON               192800      
004358     MOVE B07-CVE-TRANS          TO  MSG-R02-CVETRAN              193500      
004359     MOVE 368                    TO MSG-R02-LONGITUD.             194000      
004360     PERFORM 020800-LLENADATDIAL.                                 194100      
004361     PERFORM 020900-VAL-CANCEL.                                   194150      
004362     MOVE WKS-AREA-MSG-OBL       TO  WKS-AREA-USUARIO.            194200      
004363     MOVE B07-FEC-CARGO          TO  WKS-B07-FEC-CARGO            194300      
004364     MOVE B07-NUM-CTE            TO  WKS-B07-NUM-CTE              194400      
004365     MOVE B07-CONTRATO           TO  WKS-B07-CONTRATO             194500      
004366     MOVE B07-AUT-S151           TO  WKS-B07-AUT-S151             194510      
004367     MOVE B07-NUM-OCURR          TO  WKS-B07-NUM-OCURR            194520      
004368     MOVE B07-NUM-ID             TO  WKS-B07-NUM-ID.              194530      
004369                                                                  194540      
004370                                                                  194600      
004371 030370-ENV-MSG-ENC.                                              194700      
004372*===================                                              194800      
004373   MOVE 1 TO IND-SERV WKS-NUM-ID                                  194900      
004374   MOVE ZERO TO WKS-STATUS WKS-EOF-B07                            195200      
004375   PERFORM 030400-BUSCA-PENDIENTES                                195400      
004376   MOVE 6    TO WKS-STATUS                                        195500      
004377   MOVE ZERO TO WKS-EOF-B07                                       195600      
004378   PERFORM 030400-BUSCA-PENDIENTES                                195700      
004379   MOVE "ENVIO MENSAJES PENDIENTES PROT COB" TO WKS-DIS-TEXTO     196200      
004380   PERFORM 060700-DISPLAY.                                        196300      
004381                                                                  197600      
004382                                                                  197860      
004383 030400-BUSCA-PENDIENTES.                                         197875      
004384*========================                                         197890      
004385    PERFORM 700400-BUSCA-PEN-B07SXFECSTA                          197900      
004386                                                                  197940      
004387    MOVE ZERO      TO WKS-CONT-ENC                                197950      
004388    IF WKS-EOF-B07 = 0                                            197980      
004389           PERFORM 030335-ENVIA-MENSAJE-ENC                       198000      
004390                                        UNTIL  WKS-EOF-B07 = 1    198050      
004391                                                                  198100      
004392     ELSE                                                         198110      
004393          IF WKS-STATUS = 0                                       198120      
004394                  MOVE  1     TO WKS-ZERO-STATUS                  198130      
004395                                                                  198140      
004396          ELSE                                                    198150      
004397                  MOVE  1      TO WKS-SIX-STATUS.                 198160      
004398                                                                  198170      
004399 030335-ENVIA-MENSAJE-ENC.                                        198200      
004400*=========================                                        198300      
004401   IF WKS-VAL-DIA-HAB(IND-SERV) = 1 OR                            198350      
004402     (WKS-VAL-DIA-HAB(IND-SERV) = 0  AND                          198400      
004403      WKS-CAT6-ENVDHBL(B07-CVE-TRANS)= 2)                         198450      
004404     IF B07-STATUS = 0                                            198500      
004405        MOVE 1 TO B07-STATUS B07-NUM-ENV B07-TIPO-MOV WKS-STORE   198600      
004406        PERFORM 030340-ENVIA-MENSAJE-ENC-SERV1                    198700      
004407        IF WKS-VAL-DIA-HAB(IND-SERV) = 1                          198710      
004408           ADD 1     TO WKS-CONT-ENC                              198750      
004409        ELSE                                                      198755      
004410           NEXT SENTENCE                                          198760      
004411     ELSE                                                         198800      
004412     IF B07-STATUS = 6                                            198900      
004413        MOVE 1 TO B07-STATUS B07-TIPO-MOV                         199000      
004414        MOVE ZERO TO WKS-STORE                                    199050      
004415        PERFORM 030340-ENVIA-MENSAJE-ENC-SERV1                    199100      
004416        MOVE 3 TO B07-STATUS                                      199150      
004417        MOVE 2 TO B07-TIPO-MOV                                    199170      
004418        MOVE 1 TO B07-NUM-ENV WKS-STORE                           199190      
004419        PERFORM 030340-ENVIA-MENSAJE-ENC-SERV1                    199200      
004420        IF WKS-VAL-DIA-HAB(IND-SERV) = 1                          199205      
004421           ADD 2 TO WKS-CONT-ENC.                                 199300      
004422                                                                  199400      
004423     PERFORM 700500-BUSCA-PEN-B07SXFECSTAN.                       199450      
004424                                                                  199500      
004425     IF WKS-CONT-ENC > W77-LIMITE-PENDIENTES                      199600      
004426                                                                  199700      
004427           IF WKS-EOF-B07 = 1                                     199750      
004428                                                                  199800      
004429               IF WKS-STATUS = 0                                  199900      
004430                    MOVE  1      TO WKS-ZERO-STATUS               200000      
004431               ELSE                                               200100      
004432                    MOVE  1            TO WKS-SIX-STATUS          200200      
004433           ELSE                                                   200300      
004434                MOVE 1 TO WKS-EOF-B07                             200304      
004435      ELSE                                                        200360      
004436                                                                  200364      
004437            IF WKS-EOF-B07 = 1                                    200368      
004438                                                                  200372      
004439                IF WKS-STATUS = 0                                 200376      
004440                      MOVE  1     TO WKS-ZERO-STATUS              200380      
004441                                                                  200384      
004442                ELSE                                              200400      
004443                      MOVE  1      TO WKS-SIX-STATUS              200500      
004444            ELSE                                                  200535      
004445                NEXT SENTENCE.                                    200570      
004446                                                                  200600      
004447 030340-ENVIA-MENSAJE-ENC-SERV1.                                  200700      
004448*===============================                                  200800      
004449        PERFORM 060100-ARMA-DIALO-OBL                             201000      
004450        PERFORM 030350-ARMA-ACTMOV-STATUSZERO.                    201100      
004451                                                                  201200      
004452                                                                  201300      
004453                                                                  201900      
004454 030350-ARMA-ACTMOV-STATUSZERO.                                   202000      
004455*===============================                                  202100      
004456     PERFORM 00300-OBT-HRS-FEC-ENV-RIE-PEND                       202315      
004457     IF WKS-STORE = 1                                             202325      
004458        PERFORM 060960-BEGIN-TRANS                                202330      
004459        PERFORM 700200-ALMACENA-REG                               202345      
004460        PERFORM 060970-END-TRANS.                                 202360      
004461     PERFORM 060400-OBT-FECH-TANS-DGO                             202400      
004462     PERFORM 060200-ARMAREST-ENV-DIALOGO.                         202500      
004463                                                                  202800      
004464                                                                  203900      
004465 020900-LLENAR-DAT-SERVS.                                         204000      
004466*=======================================                          204100      
004467*DATOS RESTANTES PARA PROTECCION DE COBROS                        204200      
004468     MOVE 1      TO WKS-VAL-NUM-SERV (1)                          204300      
004469     MOVE 21600  TO WKS-VAL-HR-INI(1)                             204400      
004470     MOVE 79200  TO WKS-VAL-HR-FIN(1)                             204500      
004471     MOVE 0      TO WKS-VAL-DIA-HAB(1)                            204600      
004472     MOVE 070224 TO WKS-VAL-ACA-DES(1)                            204700      
004473     MOVE 0702   TO WKS-VAL-CVE-TRAN-DES-SIS(1)                   204800      
004474     MOVE 10     TO WKS-VAL-CVE-TRAN-DES-COD(1)                   204900      
004475     MOVE 001    TO WKS-VAL-CVE-TRAN-DES-SUB(1)                   205000      
004476     MOVE 0151   TO WKS-VAL-CVE-TRAN-OR-SIS(1)                    205100      
004477     MOVE 01     TO WKS-VAL-CVE-TRAN-OR-COD(1)                    205200      
004478     MOVE 001    TO WKS-VAL-CVE-TRAN-OR-SUB(1)                    205300      
004479     MOVE 0      TO WKS-VAL-CENTR(1)                              205400      
004480     MOVE 225    TO WKS-LONG-MSG(1)                               205500      
004481     MOVE 1      TO WKS-REINT-ACT(1)                              205600      
004482     MOVE 342    TO WKS-VAL-SUC(1)                                205700      
004483     MOVE 50     TO WKS-VAL-CAJA (1)                              205800      
004484     MOVE 2      TO WKS-VAL-RDO (1)                               205900      
004485     MOVE 60     TO WKS-VAL-TESP(1)                               206000      
004486     MOVE 1      TO WKS-VAL-MODO (1)                              206100      
004487*DATOS PARA ENVIO DE ALERTAS                                      206200      
004488     MOVE 2      TO WKS-VAL-NUM-SERV(2)                           206300      
004489     MOVE 0      TO WKS-VAL-HR-INI(2)                             206400      
004490     MOVE 0      TO WKS-VAL-HR-FIN(2)                             206500      
004491     MOVE 1      TO WKS-VAL-DIA-HAB(2)                            206600      
004492     MOVE 013703 TO WKS-VAL-ACA-DES(2)                            206700      
004493     MOVE 0500   TO WKS-VAL-CVE-TRAN-DES-SIS(2)                   206800      
004494     MOVE 01     TO WKS-VAL-CVE-TRAN-DES-COD(2)                   206900      
004495     MOVE 001    TO WKS-VAL-CVE-TRAN-DES-SUB(2)                   207000      
004496     MOVE 0151   TO WKS-VAL-CVE-TRAN-OR-SIS(2)                    207100      
004497     MOVE 01     TO WKS-VAL-CVE-TRAN-OR-COD(2)                    207200      
004498     MOVE 002    TO WKS-VAL-CVE-TRAN-OR-SUB(2)                    207300      
004499     MOVE 1      TO WKS-VAL-CENTR(2)                              207400      
004500     MOVE 534    TO WKS-LONG-MSG(2)                               207500      
004501     MOVE 0      TO WKS-REINT-ACT(2)                              207600      
004502     MOVE 845    TO WKS-VAL-SUC(2)                                207700      
004503     MOVE 00     TO WKS-VAL-CAJA(2)                               207800      
004504     MOVE 2      TO WKS-VAL-RDO(2)                                207900      
004505     MOVE 15     TO WKS-VAL-TESP(2)                               208000      
004506     MOVE 2      TO WKS-VAL-MODO(2).                              208100      
004507*0 Centralizado, 1 Descentralizado                                208200      
004508*DATOS PARA ENVIO DE ALERTAS CUANDO SERVICIO-ALERTAS NOT = 2      208204      
004509     MOVE 2      TO WKS-VAL-NUM-SERV(3)                           208208      
004510     MOVE 0      TO WKS-VAL-HR-INI(3)                             208212      
004511     MOVE 0      TO WKS-VAL-HR-FIN(3)                             208216      
004512     MOVE 1      TO WKS-VAL-DIA-HAB(3)                            208220      
004513     MOVE 013706 TO WKS-VAL-ACA-DES(3)                            208224      
004514     MOVE 0500   TO WKS-VAL-CVE-TRAN-DES-SIS(3)                   208228      
004515     MOVE 01     TO WKS-VAL-CVE-TRAN-DES-COD(3)                   208232      
004516     MOVE 001    TO WKS-VAL-CVE-TRAN-DES-SUB(3)                   208236      
004517     MOVE 0151   TO WKS-VAL-CVE-TRAN-OR-SIS(3)                    208240      
004518     MOVE 01     TO WKS-VAL-CVE-TRAN-OR-COD(3)                    208244      
004519     MOVE 002    TO WKS-VAL-CVE-TRAN-OR-SUB(3)                    208248      
004520     MOVE 1      TO WKS-VAL-CENTR(3)                              208252      
004521     MOVE 534    TO WKS-LONG-MSG(3)                               208256      
004522     MOVE 0      TO WKS-REINT-ACT(3)                              208260      
004523     MOVE 845    TO WKS-VAL-SUC(3)                                208264      
004524     MOVE 00     TO WKS-VAL-CAJA(3)                               208268      
004525     MOVE 2      TO WKS-VAL-RDO(3)                                208272      
004526     MOVE 15     TO WKS-VAL-TESP(3)                               208276      
004527     MOVE 2      TO WKS-VAL-MODO(3).                              208280      
004528                                                                  208300      
004529 030400-DATGEN-SERV2.                                             208400      
004530*=======================================                          208500      
004531    MOVE A00-R01-PRODUCTO                TO WKS-PROD              208600      
004532    MOVE A00-R01-INSTRUMENTO             TO WKS-INST              208700      
004533    MOVE A00-R01-CVEMDE                  TO WKS-MDE               208800      
004534    MOVE A00-R01-SUCTRAN                 TO WKS-SUC               208900      
004535    MOVE A00-R01-CAJATRAN                TO WKS-CAJA              209000      
004536    MOVE A00-R01-IMPORTE(WKS-NUM-OCCURS) TO WKS-IMP               209100      
004537    MOVE ZERO                            TO WKS-SDOF              209200      
004538    MOVE A00-R01-HORMOV                  TO WKS-HORADG            209300      
004539                                                                  209400      
004540                                                                  209425      
004541    MOVE WKS-CAT6-NATC(WKS-NUM-CVETRANS) TO WKS-NAT               209450      
004542    MOVE WKS-CAT6-SUMPAN(WKS-NUM-CVETRANS) TO WKS-SUMPAM          209462      
004543                                                                  209475      
004544    MOVE A00-R01-FECMOV                  TO WKS-FECMOV            209500      
004545                                                                  209600      
004546    MOVE A00-R01-MONEDA                  TO WKS-MONEDA            209700      
004547    PERFORM 31700-VALIDA-DESCRIPCIONES.                           209800      
004548                                                                  209900      
004549 31700-VALIDA-DESCRIPCIONES.                                      210000      
004550*===========================                                      210100      
004551     IF A00-R01-APUDES > 0                                        210200      
004552*       OPEN INPUT DES                                            210300      
004553        PERFORM 31750-LEE-DATOS-ADIC.                             210400      
004554*       CLOSE DES WITH RELEASE.                                   210500      
004555                                                                  210600      
004556 31750-LEE-DATOS-ADIC.                                            210700      
004557*=====================                                            210800      
004558     COMPUTE W77-LLAVE = A00-R01-APUDES + 1.                      210900      
004559                                                                  211000      
004560     READ DES INTO A01-R01-DATOS                                  211100      
004561        INVALID KEY                                               211200      
004562           MOVE A00-R01-APUDES TO W77-MOV-NIVDES                  211300      
004563           MOVE "I"    TO TIPO-LJ                                 211400      
004564           MOVE 020101 TO CODIGO-LJ                               211500      
004565           STRING "ERROR EN LECTURA DATOS ADICIONALES ",          211600      
004566                  W77-LLAVE, " ** ", W77-MOV-NIVDES               211700      
004567           DELIMITED BY SIZE INTO TEXTO-LJ                        211800      
004568           CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ    211900      
004569           MOVE LOW-VALUES TO A01-R01-DATOS.                      212000      
004570                                                                  212100      
004571     MOVE A01-R01-SDO-FIN-S500            TO WKS-SDOF.            212200      
004572                                                                  212300      
004573 030500-ALTA-SERV1.                                               212400      
004574*=======================================                          212500      
004575     ADD  1 TO WKS-CONT-MSG-ENV WKS-NUM-ENVIOS                    212550      
004576     MOVE 1 TO IND-SERV                                           212600      
004577     IF  W88-HI-13  OR                                            212700      
004578     WKS-HR-INI-FUN < WKS-SEG-MAQUINA                             212800      
004579     AND WKS-HR-FIN-FUN > WKS-SEG-MAQUINA                         212900      
004580           IF WKS-VAL-DIA-HAB(IND-SERV) = 1 OR                    213000      
004581           (WKS-VAL-DIA-HAB(IND-SERV) = 0  AND                    213100      
004582           WKS-CAT6-ENVDHBL(WKS-NUM-CVETRANS)= 2)                 213200      
004583                   PERFORM 060960-BEGIN-TRANS                     213300      
004584                   PERFORM 030371-ARMA-REG-PC                     213400      
004585                   MOVE SPACES             TO WKS-DATGEN          213450      
004586                   PERFORM 00300-OBT-HRS-FEC-ENV                  213500      
004587                   PERFORM 700200-ALMACENA-REG                    213600      
004588                   PERFORM 060970-END-TRANS                       213700      
004589                   IF WKS-DUPLICADO = 0                           213800      
004590                          PERFORM 060400-OBT-FECH-TANS-DGO        213900      
004591                          PERFORM 060100-ARMA-DIALO-OBL           214000      
004592                          PERFORM 060200-ARMAREST-ENV-DIALOGO     214100      
004593                   ELSE                                           214200      
004594                        NEXT SENTENCE                             214300      
004595           ELSE                                                   214335      
004596                 PERFORM 0030550-GUARD-PEN-ALT                    214370      
004597     ELSE                                                         214400      
004598          PERFORM 0030550-GUARD-PEN-ALT.                          214435      
004599                                                                  214470      
004600 0030550-GUARD-PEN-ALT.                                           214500      
004601        PERFORM 060960-BEGIN-TRANS                                214600      
004602        PERFORM 030371-ARMA-REG-PC                                214700      
004603        MOVE 0 TO B07-STATUS                                      214750      
004604        MOVE 0 TO B07-NUM-ENV                                     214800      
004605        PERFORM 700200-ALMACENA-REG                               214900      
004606        PERFORM 060970-END-TRANS.                                 215000      
004607 030500-ALTA-SERV2.                                               215100      
004608*=======================================                          215200      
004609     MOVE WKS-NUM-CVETRANS TO W77-CLAVES-EXCLUIDAS.               215210      
004610     IF W88-CLAVES-EXCLUIDAS OR (W77-CLAVES-EXCLUIDAS = 1015 AND  215220      
004611        A00-R01-SUC-INIC = 342 AND A00-R01-CAJA-INIC = 68)        215225      
004612        NEXT SENTENCE                                             215230      
004613     ELSE                                                         215240      
004614     ADD  1 TO WKS-CONT-MSG-ENV-AL WKS-NUM-ENVIOS                 215250      
004615*     MOVE 2 TO IND-SERV                                          215300      
004616     PERFORM 060150-VALIDA-IND-SERV                               215320      
004617     MOVE SPACES             TO WKS-DATGEN                        215350      
004618     PERFORM 060960-BEGIN-TRANS                                   215400      
004619     PERFORM 000000-LIMP-VAR-AUX-BUSQUEDA                         215500      
004620     PERFORM 030371-ARMA-REG-PC                                   215600      
004621     MOVE ZERO TO B07-AUT-PC                                      215700      
004622     MOVE A00-R01-SERVICIO-ALERTA TO B07-AUT-PC                   215800      
004623     MOVE A00-R01-HORMOV TO B07-HR-CARGO                          215900      
004624     MOVE B07-STATUS              TO WKS-STATUS                   215950      
004625     PERFORM 030400-DATGEN-SERV2                                  216000      
004626     PERFORM 00300-OBT-HRS-FEC-ENV                                216100      
004627     PERFORM 700200-ALMACENA-REG                                  216200      
004628     PERFORM 060970-END-TRANS                                     216300      
004629     IF WKS-DUPLICADO = 0 AND W88-ENVIO-ALERTAS                   216400      
004630         PERFORM 060400-OBT-FECH-TANS-DGO                         216500      
004631         PERFORM 060100-ARMA-DIALO-OBL-SERV2                      216600      
004632         PERFORM 060200-ARMAREST-ENV-DIALOGO.                     216700      
004633                                                                  217200      
004634                                                                  218400      
004635 030500-GEN-AUTELIM-SERV1.                                        218500      
004636*=======================================                          218600      
004637     ADD  1 TO WKS-CONT-MSG-ENV-ELIM WKS-NUM-ENVIOS               218650      
004638     MOVE 1 TO IND-SERV                                           218700      
004639     IF W88-HI-13 OR (WKS-HR-INI-FUN < WKS-SEG-MAQUINA            218800      
004640     AND WKS-HR-FIN-FUN > WKS-SEG-MAQUINA)                        218900      
004641          IF WKS-VAL-DIA-HAB(IND-SERV) = 1 OR                     219000      
004642          (WKS-VAL-DIA-HAB(IND-SERV) = 0  AND                     219100      
004643          WKS-CAT6-ENVDHBL(WKS-NUM-CVETRANS)= 2)                  219200      
004644              MOVE    3          TO B07-STATUS                    219300      
004645              PERFORM 060960-BEGIN-TRANS                          219400      
004646              MOVE SPACE TO WKS-DATGEN                            219425      
004647              MOVE B07-DAT-GEN TO WKS-DATGEN                      219450      
004648              PERFORM 00300-OBT-HRS-FEC-ENV                       219500      
004649              PERFORM 700200-ALMACENA-REG                         219600      
004650              PERFORM 060970-END-TRANS                            219700      
004651              PERFORM 060400-OBT-FECH-TANS-DGO                    219800      
004652              PERFORM 060100-ARMA-DIALO-OBL                       219900      
004653              PERFORM 060200-ARMAREST-ENV-DIALOGO                 220000      
004654          ELSE                                                    220200      
004655              PERFORM 0030600-GUARDAR-PEND                        220300      
004656     ELSE                                                         220400      
004657          PERFORM 0030600-GUARDAR-PEND.                           220500      
004658 0030600-GUARDAR-PEND.                                            220600      
004659                                                                  220610      
004660     PERFORM 030600-VALIDA-STATUS                                 220620      
004661     PERFORM 060960-BEGIN-TRANS                                   220630      
004662     PERFORM 700200-ALMACENA-REG                                  220640      
004663     PERFORM 060970-END-TRANS.                                    220650      
004664                                                                  220700      
004665  030500-GEN-AUTELIM-SERV2.                                       220800      
004666*=======================================                          220900      
004667                                                                  221000      
004668     ADD     1        TO WKS-CONT-MSG-ENV-ELIM-AL WKS-NUM-ENVIOS  221100      
004669*     MOVE    2        TO IND-SERV                                221200      
004670     PERFORM 060150-VALIDA-IND-SERV2                              221250      
004671  IF W88-ENVIO-ALERTAS                                            221270      
004672     MOVE    3        TO B07-STATUS WKS-STATUS                    221300      
004673  ELSE                                                            221320      
004674     MOVE    0        TO B07-STATUS WKS-STATUS.                   221340      
004675  IF W88-ENVIO-ALERTAS                                            221350      
004676     IF B07-AUT-PC NOT = 2 AND NOT W88-ENVIO-ALER-CLINOCON        221360      
004677        MOVE 8        TO B07-STATUS WKS-STATUS.                   221370      
004678     MOVE B07-DAT-GEN TO WKS-DATGEN                               221400      
004679     PERFORM 060960-BEGIN-TRANS                                   221500      
004680     PERFORM 00300-OBT-HRS-FEC-ENV                                221600      
004681     PERFORM 700200-ALMACENA-REG                                  221700      
004682     PERFORM 060970-END-TRANS                                     221800      
004683  IF W88-ENVIO-ALERTAS                                            221850      
004684     IF B07-AUT-PC NOT = 2 AND NOT W88-ENVIO-ALER-CLINOCON        221870      
004685        NEXT SENTENCE                                             221880      
004686     ELSE                                                         221890      
004687        PERFORM 060400-OBT-FECH-TANS-DGO                          221900      
004688        PERFORM 060100-ARMA-DIALO-OBL-SERV2                       222000      
004689        PERFORM 060200-ARMAREST-ENV-DIALOGO.                      222100      
004690                                                                  222300      
004691                                                                  222400      
004692                                                                  222500      
004693                                                                  222600      
004694                                                                  222700      
004695                                                                  222800      
004696                                                                  222900      
004697  030600-GEN-REINT-SERV1.                                         223000      
004698*=======================================                          223100      
004699     MOVE 1 TO IND-SERV                                           223200      
004700     ADD  1 TO WKS-CONT-ENC                                       223400      
004701     PERFORM 060100-ARMA-DIALO-OBL                                223500      
004702     PERFORM 030700-GEN-DAT-REINT.                                223600      
004703                                                                  223700      
004704                                                                  225400      
004705  030700-GEN-DAT-REINT.                                           225500      
004706*=======================================                          225600      
004707     PERFORM 00300-OBT-HRS-FEC-ENV-RIE-PEND                       225750      
004708     PERFORM 060400-OBT-FECH-TANS-DGO                             225775      
004709     PERFORM 060960-BEGIN-TRANS                                   225800      
004710     PERFORM 030339-ACTUALIZA-ENVIOS                              225900      
004711     PERFORM 060970-END-TRANS                                     226000      
004712     PERFORM 060200-ARMAREST-ENV-DIALOGO.                         226100      
004713 700300-BUSCA-REG-B07SXCTE.                                       226300      
004714*============================                                     226400      
004715   MOVE ZERO        TO WKS-EOF-B07                                226500      
004716   LOCK FIRST B07SXCTE AT                                         226600      
004717       B07-NUM-ID    =  WKS-R01-NUM-ID    AND                     226700      
004718       B07-FEC-CARGO =  WKS-R01-FECMOV    AND                     226800      
004719       B07-NUM-CTE   =  WKS-R01-NUMCTE    AND                     226900      
004720       B07-CONTRATO  =  WKS-R01-CONTRATO  AND                     227000      
004721       B07-AUT-S151  =  WKS-R01-AUT-S151  AND                     227100      
004722       B07-NUM-OCURR =  WKS-R01-OCCUR                             227200      
004723   ON EXCEPTION                                                   227300      
004724      MOVE  1    TO WKS-EOF-B07                                   227350      
004725      IF DMSTATUS(NOTFOUND)                                       227400      
004726         MOVE  1    TO WKS-EOF-B07                                227500      
004727         PERFORM 010300-IMP-DISPLAY                               227600      
004728         PERFORM 060700-DISPLAY                                   227700      
004729      ELSE                                                        227800      
004730         MOVE "ERROR LOCK FIRST B07SXCTE" TO WKS-DMS-DSCERR       227900      
004731         PERFORM 8000000-DMTERMINATE.                             228000      
004732                                                                  228100      
004733                                                                  228200      
004734  030600-VALIDA-STATUS.                                           228300      
004735*=================================                                228400      
004736   IF B07-STATUS = ZERO                                           228500      
004737      MOVE 6 TO B07-STATUS                                        228600      
004738   ELSE                                                           228700      
004739      MOVE 5 TO B07-STATUS.                                       228800      
004740                                                                  228900      
004741  010100-CAMBIO-DIA.                                              229000      
004742*=================================                                229100      
004743*   MOVE 22 TO WKS-B05-FUNCION                                    229200      
004744*   PERFORM 021100-REGB05                                         229300      
004745   PERFORM 010400-GET-FEC-CONT                                    229400      
004746   MOVE SPACES TO WKS-DIS-TEXTO.                                  229415      
004747   STRING "FECHA CONTABLE: "                                      229430      
004748           WKS-FECHA-PROCESO       DELIMITED BY SIZE              229445      
004749   INTO WKS-DIS-TEXTO                                             229460      
004750   PERFORM 060700-DISPLAY                                         229475      
004751   PERFORM 010600-CLOSE-FILE                                      229500      
004752   PERFORM 020600-ARCHIVOS                                        229600      
004753   MOVE 19 TO WKS-B05-FUNCION                                     229700      
004754   PERFORM 021100-REGB05                                          229800      
004755   PERFORM 020750-DESCR-PRIN                                      229950      
004756   PERFORM 020900-LLENAR-DAT-SERVS                                230000      
004757*   PERFORM 020750-VALIDA-DIA-HABIL                               230100      
004758*   PERFORM 020800-CALCULA-ESPERA                                 230200      
004759   PERFORM 030302-CAMBIA-DIA                                      230250      
004760   PERFORM 010200-INIC-VAR-EST                                    230300      
004761   MOVE SPACES TO WKS-DIS-TEXTO.                                  230405      
004762   MOVE "CAMBIO DE DIA EXITOSO " TO WKS-DIS-TEXTO                 230410      
004763   PERFORM 060700-DISPLAY.                                        230420      
004764   PERFORM 020700-CATALOGO                                        230440      
004765   PERFORM 060900-APAGA-MONITOR.                                  230500      
004766   OPEN INPUT ARCH-DES.                                           230550      
004767                                                                  230600      
004768  010200-INIC-VAR-EST.                                            230700      
004769*=================================                                230800      
004770   MOVE 0 TO WKS-CONT-MSG-ENV                                     230900      
004771             WKS-CONT-MSG-REC                                     231000      
004772             WKS-CONT-MSG-REIN                                    231100      
004773             WKS-CONT-MSG-ENV-ELIM.                               231200      
004774   MOVE 0 TO WKS-CONT-MSG-ENV-AL                                  231233      
004775             WKS-CONT-MSG-ENV-ELIM-AL.                            231266      
004776                                                                  231300      
004777                                                                  231400      
004778                                                                  231500      
004779  010300-IMP-DISPLAY.                                             231600      
004780*=================================                                231700      
004781  IF WKS-BUSQUEDA = 0                                             231800      
004782   STRING "MSG RECIBIDO REG NO LOCALIZADO  "                      231900      
004783       MSG-R01-CONTRATO       DELIMITED BY SIZE ,                 232000      
004784       MSG-R01-REFNUM         DELIMITED BY SIZE ,                 232100      
004785       MSG-R01-AUT-S151       DELIMITED BY SIZE ,                 232200      
004786       MSG-R01-OCCUR          DELIMITED BY SIZE ,                 232300      
004787       WKS-SA0-DIRECCION      DELIMITED BY SIZE ,                 232400      
004788                              INTO WKS-DIS-TEXTO.                 232500      
004789                                                                  232600      
004790  010400-GET-FEC-CONT.                                            232700      
004791*=================================                                232800      
004792     MOVE LOW-VALUES                   TO WKS-S151B01SISDIA       232900      
004793     MOVE ZERO                         TO W77-RESULT-B01          233000      
004794     MOVE 500                          TO WKS-B01-SISTEMA         233100      
004795     MOVE 01                           TO WKS-B01-FUNCION.        233200      
004796     CALL "CONSISDIA IN S151-L001"     USING  WKS-S151B01SISDIA   233300      
004797                                       GIVING W77-RESULT-B01.     233400      
004798                                                                  233500      
004799     IF W77-RESULT-B01 > 0                                        233600      
004800        MOVE W77-RESULT-B01            TO W77-ERROR               233700      
004801        STRING "NO PUEDO OBTENER FECHA DE PROCESO "               233800      
004802               " ERROR EN S151-L001 S500, ERR #" W77-ERROR        233900      
004803        DELIMITED BY SIZE INTO TEXTO-LJ                           234000      
004804        MOVE "O"                       TO TIPO-LJ                 234100      
004805        MOVE 020901                    TO CODIGO-LJ               234200      
004806        CALL "LJ IN LIB-DISP"          USING CONTADOR-LJ,         234300      
004807                                             MENSAJE-LJ           234400      
004808        SET MYSELF(STATUS) TO -1                                  234500      
004809     ELSE                                                         234600      
004810        MOVE WKS-B01-NOMPACMOV         TO WKS-PACK-MOVS           234700      
004811*INICIO JMLT PACK PARA ARCHIVO DE DESCRIPCIONES                   234800      
004812                                          WS-PACK-DES.            234900      
004813*FIN JMLT PACK PARA ARCHIVO DE DESCRIPCIONES                      235000      
004814        MOVE WKS-B01-FECCON            TO WKS-FECHA-PROCESO.      235100      
004815                                                                  235200      
004816                                                                  235700      
004817                                                                  235800      
004818  010600-CLOSE-FILE.                                              235900      
004819*==========================                                       236000      
004820   IF ATTRIBUTE FILESTATE OF DES = 3                              236100      
004821      CLOSE DES WITH RELEASE.                                     236200      
004822      CLOSE  L01-DISPLAY  WITH RELEASE.                           236300      
004823   CLOSE ARCH-DES.                                                236350      
004824                                                                  236400      
004825                                                                  236500      
004826  010700-CICLO-ACT.                                               236600      
004827*==========================                                       236700      
004828  MOVE    A00-R01-AUT-AELIM-S151  TO AUX-AUT-ANT-S151             236800      
004829  PERFORM 030360-ACTUALIZA-REG-PC UNTIL AUX-AUT-ANT-S151 = 0.     236900      
004830                                                                  237000      
004831 020500-DATOSB05.                                                 237100      
004832*========================                                         237200      
004833*    MOVE WKS-FECPRO-6D TO WKS-B05-FCHPRO                         237300      
004834    MOVE WS00-MIX      TO WKS-B05-MIX.                            237400      
004835    MOVE 14            TO WKS-B05-FCHPRO.                         237500      
004836    IF WKS-B05-FUNCION = 19                                       237520      
004837       MOVE 060000     TO WKS-B05-HORAINI                         237540      
004838       MOVE 220000     TO WKS-B05-HORAFIN.                        237560      
004839*    MOVE WKS-FECPRO-6D TO WKS-B05-FCHINI.                        237600      
004840                                                                  237700      
004841 020700-CALLB05.                                                  237800      
004842*========================                                         237900      
004843    MOVE 0                          TO W77-RESULT-LIBCON          238000      
004844    MOVE 151                        TO WKS-B05-SISTEMA            238100      
004845    MOVE 14                         TO WKS-B05-NUMPRO             238200      
004846    CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS        238300      
004847                                    GIVING W77-RESULT-LIBCON.     238400      
004848 020900-GETMIX.                                                   238500      
004849*=======================                                          238600      
004850     MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WS00-MIX.              238700      
004851                                                                  238800      
004852 021100-REGB05.                                                   238900      
004853*=======================                                          239000      
004854     PERFORM 020900-GETMIX                                        239100      
004855     PERFORM 020500-DATOSB05.                                     239200      
004856     PERFORM 020700-CALLB05.                                      239300      
004857                                                                  239400      
004858                                                                  239500      
004859 060120-CHECA-SFINAL.                                             239600      
004860*======================                                           239700      
004861    IF WKS-SDOF < 0                                               239800      
004862          MOVE "-" TO MSG-R02-CURRBALSIGN                         239900      
004863    ELSE                                                          240000      
004864          MOVE "+" TO MSG-R02-CURRBALSIGN.                        240100      
004865                                                                  240200      
004866 060130-CHECA-NAT.                                                240300      
004867*======================                                           240400      
004868    IF WKS-NAT = 1                                                240500      
004869          MOVE "RETIRO"   TO MSG-R02-MOVIND                       240600      
004870          MOVE 101        TO MSG-R02-FIELDID                      240700      
004871          MOVE "04   "    TO MSG-R02-IDRUTEO                      240750      
004872*          MOVE "-"        TO MSG-R02-VALUESIGN                   240800      
004873    ELSE                                                          240900      
004874       IF WKS-NAT = 2                                             240950      
004875          MOVE "DEPOSITO" TO MSG-R02-MOVIND                       241000      
004876          MOVE "05   "    TO MSG-R02-IDRUTEO                      241050      
004877          MOVE 102        TO MSG-R02-FIELDID                      241100      
004878*          MOVE "+"        TO MSG-R02-VALUESIGN.                  241200      
004879       ELSE                                                       241209      
004880       IF WKS-SUMPAM = 1                                          241218      
004881          MOVE "RETIRO"   TO MSG-R02-MOVIND                       241227      
004882          MOVE 101        TO MSG-R02-FIELDID                      241236      
004883          MOVE "04   "    TO MSG-R02-IDRUTEO                      241245      
004884       ELSE                                                       241254      
004885       IF WKS-SUMPAM = 2                                          241263      
004886          MOVE "DEPOSITO" TO MSG-R02-MOVIND                       241272      
004887          MOVE "05   "    TO MSG-R02-IDRUTEO                      241281      
004888          MOVE 102        TO MSG-R02-FIELDID.                     241290      
004889                                                                  241300      
004890 020800-LLENADATDIAL.                                             241400      
004891*======================                                           241500      
004892    MOVE "MX01" TO MSG-R02-IFILEIDMX.                             241600      
004893    MOVE "A"    TO MSG-R02-IFILEIDA.                              241700      
004894    MOVE "MX"   TO MSG-R02-COUNTRY.                               241800      
004895    MOVE "1"    TO MSG-R02-FILTSR.                                241900      
004896    MOVE "4"    TO MSG-R02-FILTID.                                242000      
004897    MOVE "20"   TO MSG-R02-CC.                                    242050      
004898    MOVE "***"  TO MSG-R02-ACCNUMD-AST.                           242075      
004899    MOVE SPACES TO MSG-R02-BEFBAL.                                242100      
004900    MOVE SPACES TO MSG-R02-CUTDATE.                               242200      
004901    MOVE SPACES TO MSG-R02-PAYDATE.                               242300      
004902    MOVE SPACES TO MSG-R02-MINDATE.                               242400      
004903    MOVE SPACES TO MSG-R02-CREDDLIM.                              242500      
004904    MOVE SPACES TO MSG-R02-AVACRED.                               242600      
004905    MOVE SPACES TO MSG-R02-REF.                                   242700      
004906    MOVE SPACES TO MSG-R02-REPID.                                 242800      
004907*    MOVE SPACES TO MSG-R02-PRNAME.                               242900      
004908    MOVE SPACES TO MSG-R02-SPACES.                                243000      
004909*    MOVE SPACES TO MSG-R02-TRANMEANID.                           243100      
004910    MOVE SPACES TO MSG-R02-TRANMEAN.                              243200      
004911    MOVE "#"    TO MSG-R02-SHARP.                                 243250      
004912*    MOVE SPACES TO MSG-R02-PRODNUM.                              243300      
004913                                                                  243400      
004914 020900-MUEVE-FECHA.                                              243500      
004915*===================                                              243600      
004916    ACCEPT WKS-HR-MAQUINA FROM DATE                               243700      
004917    MOVE WKS-FECMAQ-AAAA  TO WKS-FEC-MAQ-YYYY                     243800      
004918    MOVE WKS-FECMAQ-MM    TO WKS-FEC-MAQ-MM                       243900      
004919    MOVE WKS-FECMAQ-DD    TO WKS-FEC-MAQ-DD.                      244000      
004920                                                                  244100      
004921                                                                  244200      
004922 030390-CANCELA.                                                  244300      
004923*=========================                                        244400      
004924   PERFORM 030350-ACTUALIZA-CONTROL.                              244500      
004925*   CLOSE A01-MOVS500                  WITH RELEASE               244600      
004926   IF W77-CANC-FUNCION = 21                                       244700      
004927      MOVE 0                        TO WKS-LOCK-OK                244750      
004928      PERFORM 030450-FINDFIRST-B07SXPROC UNTIL WKS-LOCK-OK = 1    244800      
004929      PERFORM 030475-ENVIO-CANC-F21 UNTIL WKS-EOF-B07 = 1         244900      
004930   ELSE                                                           245000      
004931      COMPUTE  W77-NUMREG-MOV500   = W77-CANC-AUT-AELIM-S151  + 1 245100      
004932      MOVE 0                        TO WKS-LOCK-OK                245200      
004933      PERFORM 030550-FINDFIRST-B07SXAUTPROC UNTIL  WKS-LOCK-OK = 1245300      
004934      PERFORM 030575-ENVIO-CANC-F22 UNTIL WKS-EOF-B07 = 1.        245400      
004935 030450-FINDFIRST-B07SXPROC.                                      245500      
004936*==========================                                       245600      
004937   MOVE ZERO        TO WKS-EOF-B07                                245700      
004938   MOVE 1                TO WKS-LOCK-OK                           245750      
004939   LOCK FIRST B07SXPROC AT                                        245800      
004940       B07-FEC-CARGO =  WKS-FECPRO-6D     AND                     245900      
004941       B07-NUM-PROC  =  W77-CANC-PROC                             246000      
004942   ON EXCEPTION                                                   246100      
004943       IF DMSTATUS(DEADLOCK)                                      246110      
004944            MOVE 0 TO WKS-LOCK-OK                                 246120      
004945            MOVE "DEADLOCK              " TO WKS-DIS-TEXTO        246130      
004946            PERFORM 060700-DISPLAY                                246140      
004947       ELSE                                                       246150      
004948           IF DMSTATUS(NOTFOUND)                                  246160      
004949              MOVE  1    TO WKS-EOF-B07                           246170      
004950           ELSE                                                   246180      
004951              MOVE "ERROR LOCK FIRST B07SXPROC"                   246200      
004952                                          TO WKS-DMS-DSCERR       246300      
004953              PERFORM 8000000-DMTERMINATE.                        246400      
004954                                                                  246500      
004955                                                                  246600      
004956                                                                  246700      
004957 030487-FINDNEXTB07SXPROC.                                        246800      
004958*==========================                                       246900      
004959   MOVE ZERO        TO WKS-EOF-B07                                247000      
004960   MOVE 1           TO WKS-LOCK-OK                                247050      
004961   LOCK NEXT B07SXPROC AT                                         247100      
004962       B07-FEC-CARGO =  WKS-FECPRO-6D     AND                     247200      
004963       B07-NUM-PROC  =  W77-CANC-PROC                             247300      
004964   ON EXCEPTION                                                   247400      
004965       IF DMSTATUS(DEADLOCK)                                      247415      
004966            MOVE 0 TO WKS-LOCK-OK                                 247430      
004967            MOVE "DEADLOCK              " TO WKS-DIS-TEXTO        247445      
004968            PERFORM 060700-DISPLAY                                247460      
004969       ELSE                                                       247475      
004970           IF DMSTATUS(NOTFOUND)                                  247490      
004971              MOVE  1    TO WKS-EOF-B07                           247500      
004972           ELSE                                                   247600      
004973              MOVE "ERROR LOCK NEXT B07SXPROC" TO WKS-DMS-DSCERR  247700      
004974              PERFORM 8000000-DMTERMINATE.                        247800      
004975                                                                  247900      
004976                                                                  248000      
004977 030550-FINDFIRST-B07SXAUTPROC.                                   248100      
004978*==========================                                       248200      
004979   MOVE ZERO        TO WKS-EOF-B07                                248300      
004980   MOVE 1           TO WKS-LOCK-OK                                248350      
004981   LOCK FIRST B07SXAUTPROC AT                                     248400      
004982       B07-FEC-CARGO =  WKS-FECPRO-6D             AND             248500      
004983       B07-AUT-S151  >  W77-CANC-AUT-AELIM-S151   AND             248600      
004984       B07-NUM-PROC  =  W77-CANC-PROC                             248700      
004985   ON EXCEPTION                                                   248800      
004986       IF DMSTATUS(DEADLOCK)                                      248815      
004987            MOVE 0 TO WKS-LOCK-OK                                 248830      
004988            MOVE "DEADLOCK              " TO WKS-DIS-TEXTO        248845      
004989            PERFORM 060700-DISPLAY                                248860      
004990       ELSE                                                       248875      
004991           IF DMSTATUS(NOTFOUND)                                  248890      
004992              MOVE  1    TO WKS-EOF-B07                           248900      
004993           ELSE                                                   249000      
004994              MOVE "ERROR LOCK FIRST B07SXAUTPROC"                249100      
004995                                          TO WKS-DMS-DSCERR       249200      
004996              PERFORM 8000000-DMTERMINATE.                        249300      
004997                                                                  249400      
004998 030587-FINDNEXTB07SXAUTPROC.                                     249500      
004999*==========================                                       249600      
005000   MOVE ZERO        TO WKS-EOF-B07                                249700      
005001   MOVE 1           TO WKS-LOCK-OK                                249750      
005002   LOCK NEXT B07SXAUTPROC AT                                      249800      
005003       B07-FEC-CARGO =  WKS-FECPRO-6D             AND             249900      
005004       B07-AUT-S151  >  W77-CANC-AUT-AELIM-S151   AND             250000      
005005       B07-NUM-PROC  =  W77-CANC-PROC                             250100      
005006   ON EXCEPTION                                                   250200      
005007       IF DMSTATUS(DEADLOCK)                                      250220      
005008            MOVE 0 TO WKS-LOCK-OK                                 250240      
005009            MOVE "DEADLOCK              " TO WKS-DIS-TEXTO        250260      
005010            PERFORM 060700-DISPLAY                                250280      
005011       ELSE                                                       250290      
005012       IF DMSTATUS(NOTFOUND)                                      250300      
005013          MOVE  1    TO WKS-EOF-B07                               250400      
005014       ELSE                                                       250500      
005015          MOVE "ERROR LOCK NEXT B07SXAUTPROC" TO WKS-DMS-DSCERR   250600      
005016          PERFORM 8000000-DMTERMINATE.                            250700      
005017                                                                  250800      
005018                                                                  250900      
005019 030475-ENVIO-CANC-F21.                                           251000      
005020*======================                                           251100      
005021   MOVE   2                TO  B07-TIPO-MOV.                      251200      
005022   PERFORM 030525-CHECA-SERV-ELIM.                                251300      
005023   MOVE   0                TO WKS-LOCK-OK                         251400      
005024   PERFORM 030487-FINDNEXTB07SXPROC UNTIL WKS-LOCK-OK = 1.        251500      
005025 030575-ENVIO-CANC-F22.                                           251600      
005026*======================                                           251700      
005027   MOVE   2                TO  B07-TIPO-MOV.                      251800      
005028   PERFORM 030525-CHECA-SERV-ELIM.                                251900      
005029   MOVE   0                TO WKS-LOCK-OK                         252000      
005030   PERFORM 030587-FINDNEXTB07SXAUTPROC UNTIL WKS-LOCK-OK = 1.     252100      
005031 030525-CHECA-SERV-ELIM.                                          252200      
005032*======================                                           252300      
005033   IF B07-NUM-ID = 1                                              252400      
005034      PERFORM 030500-GEN-AUTELIM-SERV1                            252500      
005035   ELSE                                                           252600      
005036   IF B07-NUM-ID = 2                                              252700      
005037      PERFORM 030500-GEN-AUTELIM-SERV2.                           252800      
005038                                                                  252900      
005039 030537-JUSTIFICA-VAR-NUM.                                        253000      
005040*======================                                           253100      
005041   MOVE 16 TO WKS-LIMITE.                                         253150      
005042   MOVE 1 TO WKS-COUNTER2.                                        253200      
005043   PERFORM 030549-CICLO-JUST-NUM VARYING WKS-COUNTER1 FROM 1 BY 1 253300      
005044           UNTIL WKS-COUNTER1 > WKS-LIMITE.                       253400      
005045                                                                  253500      
005046 030549-CICLO-JUST-NUM.                                           253600      
005047*======================                                           253700      
005048   IF WKS-AUX1-VAL1(WKS-COUNTER1) NOT = SPACE                     253800      
005049  MOVE WKS-AUX1-VAL1(WKS-COUNTER1) TO WKS-AUX2-VAL2(WKS-COUNTER2) 253900      
005050    ADD 1 TO WKS-COUNTER2.                                        254000      
005051                                                                  254100      
005052 030537-JUSTIFICA-VAR-ALP.                                        254200      
005053*======================                                           254300      
005054   MOVE 1 TO WKS-COUNTER2.                                        254400      
005055   MOVE 21 TO WKS-LIMITE.                                         254450      
005056   PERFORM 030549-CICLO-JUST-ALP VARYING WKS-COUNTER1 FROM 1 BY 1 254500      
005057           UNTIL WKS-COUNTER1 > WKS-LIMITE.                       254600      
005058                                                                  254700      
005059 030549-CICLO-JUST-ALP.                                           254800      
005060*======================                                           254900      
005061   IF WKS-AUX2-VAL2(WKS-COUNTER1) NOT = SPACE                     255000      
005062  MOVE WKS-AUX2-VAL2(WKS-COUNTER1) TO WKS-AUX3-VAL3(WKS-COUNTER2) 255100      
005063    ADD 1 TO WKS-COUNTER2.                                        255200      
005064                                                                  255300      
005065 060150-CHECA-MDA-CTO.                                            255400      
005066*========================                                         255500      
005067   IF B07-MDA-CUENTA > 0                                          255600      
005068          MOVE B07-MDA-CUENTA     TO  MSG-R02-ACCNUMD-THR         255700      
005069   ELSE                                                           255800      
005070          MOVE B07-CONTRATO       TO  MSG-R02-ACCNUMD-THR.        255900      
005071                                                                  256000      
005072                                                                  256100      
005073 020750-DESCR-PRIN.                                               256200      
005074*=======================                                          256300      
005075   MOVE 0 TO W77-EOF.                                             256400      
005076   OPEN OUTPUT ARCH-DES.                                          256500      
005077   MOVE 151        TO S080-CD-SISTEMA                             256600      
005078   MOVE 14         TO S080-CD-PROGRAMA                            256700      
005079   MOVE 9          TO S080-CDPE-CATALOGO                          256800      
005080   MOVE 20         TO S080-CDPE-CLAVE                             256900      
005081   MOVE 1          TO S080-CDPE-ORDEN-BUSQ                        257000      
005082   MOVE 10         TO S080-CDPE-REGISTROS                         257100      
005083   MOVE 0          TO S080-CDPE-CVE-REGIST                        257200      
005084   MOVE 0          TO S080-CDPE-CVE-REGIST-ASOC                   257300      
005085   MOVE 0          TO S080-CDPE-NIVEL-INI                         257400      
005086   MOVE 0          TO S080-CDPE-FECHA-CONS                        257500      
005087   PERFORM 020720-LLENA-DESC-PRIN       UNTIL W77-EOF = 1.        257600      
005088   CLOSE ARCH-DES WITH SAVE.                                      257700      
005089                                                                  257800      
005090 020720-LLENA-DESC-PRIN.                                          257900      
005091*========================                                         258000      
005092  CALL "L700_CONSUL_DESC IN S080L710"                             258100      
005093        USING S080-CD-SISTEMA                                     258200      
005094              S080-CD-PROGRAMA                                    258300      
005095              S080-CD-PARAMETRO-ENT                               258400      
005096              S080-CD-PARAMETRO-SAL                               258500      
005097        GIVING S080-CD-RESULT.                                    258600      
005098                                                                  258700      
005099  IF S080-CD-RESULT = 0 OR 1                                      258800      
005100     PERFORM 020730-LLENA-DESCRIPCIONES                           258900      
005101     VARYING WKS-NUM-OCCURS FROM 1 BY 1                           259000      
005102     UNTIL WKS-NUM-OCCURS > S080-CDPS-NUM-REGISTRO                259100      
005103     MOVE S080-CDPS-CVE-REGIST(10) TO S080-CDPE-CVE-REGIST        259200      
005104     MOVE S080-CDPS-CVE-REGIST-ASOC(10) TO                        259300      
005105                                  S080-CDPE-CVE-REGIST-ASOC       259400      
005106     MOVE S080-CDPS-NIVEL-INI      TO S080-CDPE-NIVEL-INI         259500      
005107  ELSE                                                            259600      
005108*INICIO JMLT                                                      259606      
005109     MOVE S080-CD-RESULT               TO W77-ERR-CAT             259612      
005110     MOVE "I"                          TO TIPO-LJ                 259618      
005111     MOVE 020901                       TO CODIGO-LJ               259624      
005112     STRING "ERROR EN CALL S080BD01CON LEYENDAS ,RESULT = ",      259630      
005113        W77-ERR-CAT  DELIMITED BY SIZE                            259636      
005114        INTO TEXTO-LJ                                             259642      
005115     CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ          259648      
005116     STRING "ERROR AL LLAMAR S080BD01CON LEYENDAS, RESULT = "     259654      
005117     W77-ERR-CAT             DELIMITED BY SIZE                    259660      
005118     " , FIN DE PROGRAMA "   DELIMITED BY SIZE                    259666      
005119     INTO WKS-DIS-TEXTO                                           259672      
005120     PERFORM 060700-DISPLAY                                       259678      
005121*FIN JMLT                                                         259684      
005122*         MOVE 1 TO W77-FIN                                       259692      
005123          MOVE 1 TO W77-EOF.                                      259700      
005124  IF S080-CD-RESULT = 0                                           259800      
005125          MOVE 1 TO W77-EOF.                                      259900      
005126                                                                  260000      
005127 020730-LLENA-DESCRIPCIONES.                                      260100      
005128*=========================                                        260200      
005129   MOVE S080-CDPS-CVE-REGIST(WKS-NUM-OCCURS) TO                   260300      
005130        WKS-CAT9-INST                                             260400      
005131   MOVE S080-CDPS-CVE-REGIST-ASOC(WKS-NUM-OCCURS) TO              260500      
005132        WKS-CAT9-PROD                                             260600      
005133   MOVE S080-CDPS-TEXTO-CORTO(WKS-NUM-OCCURS) TO                  260700      
005134        WKS-CAT9-LEY.                                             260800      
005135   WRITE REG-CAT.                                                 260900      
005136                                                                  261000      
005137 060170-CONSULTA-DESCRIPCION.                                     261100      
005138*============================                                     261200      
005139   MOVE WKS-PROD TO WKS-CAT9-PROD                                 261300      
005140   MOVE WKS-INST TO WKS-CAT9-INST                                 261400      
005141   MOVE ZERO TO WKS-NOTFOUND                                      261500      
005142   READ ARCH-DES INVALID KEY                                      261600      
005143          MOVE 1 TO WKS-NOTFOUND.                                 261700      
005144   IF WKS-NOTFOUND = 1                                            261800      
005145          MOVE SPACES TO MSG-R02-PRNAME                           261900      
005146   ELSE                                                           262000      
005147          MOVE WKS-CAT9-LEY TO MSG-R02-PRNAME.                    262100      
005148                                                                  262200      
005149 020900-VAL-CANCEL.                                               262300      
005150*======================                                           262400      
005151  IF B07-STATUS = 3  OR 7 OR (WKS-STATUS=0 AND B07-TIPO-MOV=2)    262500      
005152     MOVE "03" TO MSG-R02-REPID.                                  262600      
005153                                                                  262700      
005154 00300-OBT-HRS-FEC-ENV.                                           262800      
005155     ACCEPT WKS-HRS-ACT  FROM TIME                                262900      
005156     IF A00-R01-FUNCION=2 OR 22 OR 21                             263000      
005157           ACCEPT WKS-FEC-NAT-CAN        FROM DATE                263100      
005158           MOVE WKS-HRS-ACT-HH     TO WKS-HH-CAN                  263200      
005159           MOVE WKS-HRS-ACT-MM     TO WKS-MM-CAN                  263300      
005160           MOVE WKS-HRS-ACT-SS     TO WKS-SS-CAN                  263400      
005161      ELSE                                                        263500      
005162           IF  A00-R01-FUNCION=1                                  263600      
005163               ACCEPT WKS-FECHA-NATURAL      FROM DATE            263900      
005164               MOVE WKS-HRS-ACT-HH     TO WKS-HH-ENVPROC          264000      
005165               MOVE WKS-HRS-ACT-MM     TO WKS-MM-ENVPROC          264100      
005166               MOVE WKS-HRS-ACT-SS     TO WKS-SS-ENVPROC.         264200      
005167                                                                  264300      
005168      COMPUTE WKS-B07-HR-ENVIO =( WKS-HRS-ACT-HH * 3600 +         264400      
005169                                 WKS-HRS-ACT-MM * 60 +            264500      
005170                                 WKS-HRS-ACT-SS +                 264600      
005171                                 120).                            264700      
005172   MOVE  WKS-B07-HR-ENVIO TO B07-HR-ENVIO.                        264800      
005173   MOVE WKS-DATGEN        TO B07-DAT-GEN.                         265000      
005174                                                                  265100      
005175 00400-VAL-STATUS-ENV.                                            265200      
005176  IF WKS-NUM-ID = 2                                               265300      
005177      IF WKS-STATUS = 0 OR 1 OR 7 OR 3                            265400      
005178         PERFORM 0000-BUSCA-REG-PEND UNTIL WKS-LOCK-OK =1         265800      
005179         PERFORM 0000-SETEA-STATUS                                266050      
005180         PERFORM 060960-BEGIN-TRANS                               266070      
005181         PERFORM 700200-ALMACENA-REG                              266090      
005182         PERFORM 060970-END-TRANS.                                266110      
005183                                                                  266200      
005184                                                                  266300      
005185 0000-SETEA-STATUS.                                               266400      
005186   MOVE WKS-B07-NUM-ERROR TO B07-NUM-ERROR                        266450      
005187   IF WKS-STATUS = 0 OR 1                                         266500      
005188      MOVE 0     TO B07-STATUS                                    266600      
005189   ELSE                                                           266700      
005190      MOVE 7     TO B07-STATUS.                                   266800      
005191                                                                  266900      
005192                                                                  267000      
005193                                                                  267100      
005194                                                                  267700      
005195 0000-BUSCA-REG-PEND.                                             267800      
005196*==============================                                   267900      
005197   MOVE ZERO        TO WKS-EOF-B07                                268000      
005198   MOVE 1           TO WKS-LOCK-OK.                               268100      
005199   LOCK FIRST  B07SXCTE AT                                        268200      
005200        B07-NUM-ID     = WKS-NUM-ID          AND                  268300      
005201        B07-FEC-CARGO  = WKS-B07-FEC-CARGO   AND                  268400      
005202        B07-NUM-CTE    = WKS-B07-NUM-CTE     AND                  268500      
005203        B07-CONTRATO   = WKS-B07-CONTRATO    AND                  268600      
005204        B07-AUT-S151   = WKS-B07-AUT-S151    AND                  268700      
005205        B07-NUM-OCURR  = WKS-B07-NUM-OCURR                        268800      
005206   ON EXCEPTION                                                   268900      
005207      IF DMSTATUS(DEADLOCK)                                       269000      
005208           MOVE 0 TO WKS-LOCK-OK                                  269100      
005209           MOVE "DEADLOCK              " TO WKS-DIS-TEXTO         269200      
005210           PERFORM 060700-DISPLAY                                 269300      
005211      ELSE                                                        269400      
005212           IF DMSTATUS(NOTFOUND)                                  269500      
005213                  MOVE  1    TO WKS-EOF-B07                       269600      
005214           ELSE                                                   269700      
005215                  MOVE "ERROR LOCK FIRST B07SXFECSTA"             269800      
005216                              TO WKS-DMS-DSCERR                   269900      
005217                  PERFORM 8000000-DMTERMINATE.                    270000      
005218                                                                  270100      
005219 000000-LIMP-VAR-AUX-BUSQUEDA.                                    270200      
005220    MOVE 0 TO WKS-B07-FEC-CARGO                                   270300      
005221              WKS-B07-NUM-CTE                                     270400      
005222              WKS-B07-CONTRATO                                    270500      
005223              WKS-B07-AUT-S151                                    270600      
005224              WKS-B07-NUM-OCURR                                   270700      
005225              WKS-B07-NUM-ID.                                     270800      
005226                                                                  270900      
005227 0380500-REINT-ALERTAS.                                           271000      
005228 MOVE 0                        TO WKS-STATUS WKS-EOF-B07          271100      
005229 MOVE 2                        TO WKS-NUM-ID                      271300      
005230 MOVE 1                        TO WKS-REIT-ALER                   271400      
005231 PERFORM 030335-REINTENTA-ALER UNTIL WKS-STATUS =7                271500      
005232 MOVE 0                        TO WKS-REIT-ALER.                  271600      
005233                                                                  271700      
005234                                                                  271800      
005235 030335-REINTENTA-ALER.                                           271900      
005236  IF  WKS-EOF-B07 = 1                                             272000      
005237      MOVE ZERO  TO  WKS-EOF-B07                                  272100      
005238      MOVE 7     TO  WKS-STATUS.                                  272200      
005239   MOVE 0 TO WKS-LOCK-OK WKS-CONT-ENC                             272300      
005240   PERFORM 700400-BUSCA-REG-B07SXFECSTA UNTIL WKS-LOCK-OK =1.     272400      
005241   PERFORM 030335-REINTENTA-ALERTA UNTIL  WKS-EOF-B07 = 1.        272500      
005242                                                                  272600      
005243 030335-REINTENTA-ALERTA.                                         272700      
005244    IF B07-NUM-ID = 2 AND B07-AUT-PC NOT = 2                      272705      
005245       AND NOT W88-ENVIO-ALER-CLINOCON                            272710      
005246       MOVE 8    TO B07-STATUS                                    272715      
005247       PERFORM 00300-OBT-HRS-FEC-ENV-RIE-PEND                     272720      
005248       PERFORM 060960-BEGIN-TRANS                                 272725      
005249       PERFORM 700200-ALMACENA-REG                                272730      
005250       PERFORM 060970-END-TRANS                                   272735      
005251    ELSE                                                          272740      
005252       PERFORM 030800-REINTENTA-MENSAJE.                          272745      
005253*    PERFORM 000000-LIMP-VAR-AUX-BUSQUEDA.                        272750      
005254*    MOVE 2 TO IND-SERV                                           272800      
005255*    PERFORM 060150-VALIDA-IND-SERV2.                             272820      
005256*    ADD  1 TO WKS-CONT-ENC                                       272850      
005257*    PERFORM 060100-ARMA-DIALO-OBL-SERV2.                         272900      
005258*    IF WKS-STATUS = 0                                            272950      
005259*       IF B07-TIPO-MOV = 1                                       273000      
005260*          MOVE 1                TO B07-STATUS                    273050      
005261*       ELSE                                                      273070      
005262*          MOVE 3                TO B07-STATUS                    273090      
005263*    ELSE                                                         273100      
005264*          MOVE 3                TO B07-STATUS.                   273150      
005265*    PERFORM 030700-GEN-DAT-REINT.                                273200      
005266    MOVE 0 TO  WKS-LOCK-OK                                        273250      
005267    IF WKS-CONT-ENC < W77-LIMITE-ENVIOS                           273270      
005268       MOVE 0                   TO WKS-LOCK-OK                    273295      
005269       PERFORM 700500-BUSCA-REG-B07SXFECSTAN UNTIL WKS-LOCK-OK =1 273300      
005270    ELSE                                                          273320      
005271        MOVE 1 TO WKS-EOF-B07.                                    273340      
005272                                                                  273360      
005273 030800-REINTENTA-MENSAJE.                                        273560      
005274*=========================                                        273760      
005275    PERFORM 000000-LIMP-VAR-AUX-BUSQUEDA.                         273960      
005276    PERFORM 060150-VALIDA-IND-SERV2.                              274160      
005277    ADD  1 TO WKS-CONT-ENC                                        274360      
005278    PERFORM 060100-ARMA-DIALO-OBL-SERV2.                          274560      
005279    IF WKS-STATUS = 0                                             274760      
005280       IF B07-TIPO-MOV = 1                                        274960      
005281          MOVE 1                TO B07-STATUS                     275160      
005282       ELSE                                                       275360      
005283          MOVE 3                TO B07-STATUS                     275560      
005284    ELSE                                                          275760      
005285       MOVE 3                TO B07-STATUS.                       275960      
005286    PERFORM 030700-GEN-DAT-REINT.                                 276160      
005287                                                                  276360      
005288 700400-BUSCA-PEN-B07SXFECSTA.                                    277600      
005289*==============================                                   277700      
005290   MOVE ZERO        TO WKS-EOF-B07                                277800      
005291   LOCK FIRST B07SXFECSTA AT                                      277900      
005292       B07-NUM-ID    =  WKS-NUM-ID    AND                         278000      
005293       B07-FEC-CARGO =  WKS-FECPRO-6D AND                         278100      
005294       B07-STATUS    =  WKS-STATUS                                278200      
005295   ON EXCEPTION                                                   278300      
005296       MOVE  1    TO WKS-EOF-B07                                  278400      
005297       IF DMSTATUS(NOTFOUND)                                      278500      
005298          MOVE  1    TO WKS-EOF-B07                               278600      
005299                                                                  278700      
005300       ELSE                                                       278800      
005301          MOVE "ERROR LOCK FIRST B07SXFECSTA" TO WKS-DMS-DSCERR   278900      
005302          PERFORM 8000000-DMTERMINATE.                            279000      
005303                                                                  279100      
005304 700500-BUSCA-PEN-B07SXFECSTAN.                                   279200      
005305*==============================                                   279300      
005306   MOVE ZERO        TO WKS-EOF-B07                                279400      
005307   LOCK NEXT B07SXFECSTA AT                                       279500      
005308       B07-NUM-ID    =  WKS-NUM-ID    AND                         279600      
005309       B07-FEC-CARGO =  WKS-FECPRO-6D AND                         279700      
005310       B07-STATUS    =  WKS-STATUS                                279800      
005311   ON EXCEPTION                                                   279900      
005312       MOVE  1    TO WKS-EOF-B07                                  280000      
005313       IF DMSTATUS(NOTFOUND)                                      280100      
005314          MOVE  1    TO WKS-EOF-B07                               280200      
005315       ELSE                                                       280300      
005316          MOVE "ERROR LOCK NEXT B07SXFECSTA" TO WKS-DMS-DSCERR    280400      
005317          PERFORM 8000000-DMTERMINATE.                            280500      
005318 00300-OBT-HRS-FEC-ENV-RIE-PEND.                                  280600      
005319    ACCEPT WKS-HRS-ACT                      FROM TIME             280700      
005320    IF B07-TIPO-MOV = 2 AND WKS-REIN-ACT =0 AND WKS-REIT-ALER =0  280800      
005321          ACCEPT WKS-FEC-NAT-CAN             FROM DATE            280900      
005322          MOVE WKS-HRS-ACT-HH                TO WKS-HH-CAN        281000      
005323          MOVE WKS-HRS-ACT-MM                TO WKS-MM-CAN        281100      
005324          MOVE WKS-HRS-ACT-SS                TO WKS-SS-CAN        281200      
005325     ELSE                                                         281300      
005326          IF  B07-TIPO-MOV = 1 AND WKS-REIN-ACT =0                281400      
005327          AND WKS-REIT-ALER=0                                     281500      
005328               ACCEPT WKS-FECHA-NATURAL      FROM DATE            281600      
005329               MOVE WKS-HRS-ACT-HH           TO WKS-HH-ENVPROC    281700      
005330               MOVE WKS-HRS-ACT-MM           TO WKS-MM-ENVPROC    281800      
005331               MOVE WKS-HRS-ACT-SS           TO WKS-SS-ENVPROC.   281900      
005332                                                                  282000      
005333                                                                  282100      
005334     COMPUTE WKS-B07-HR-ENVIO =( WKS-HRS-ACT-HH * 3600 +          282200      
005335                                WKS-HRS-ACT-MM * 60 +             282300      
005336                                WKS-HRS-ACT-SS +                  282400      
005337                                120).                             282500      
005338  MOVE  WKS-B07-HR-ENVIO TO B07-HR-ENVIO.                         282600      
005339  IF WKS-REIN-ACT =0 AND  WKS-REIT-ALER =0                        282700      
005340        MOVE  WKS-DATGEN       TO B07-DAT-GEN.                    282800      
005341 000-BORRAR-REG-B05-ENV-PEND.                                     282900      
005342     MOVE 1             TO WKS-B05-NUMPRO                         283000      
005343     MOVE 0             TO WKS-B05-HORAINI                        283100      
005344     MOVE 0             TO WKS-B05-HORAFIN.                       283200      
005345     PERFORM 020700-CALLB05-GUARD-NUM-ENV.                        283300      
005346                                                                  283400      
005347 000-CREA-REG-B05-NUMENV-PEND.                                    283500      
005348     MOVE 17              TO WKS-B05-FCHPRO                       283600      
005349     MOVE 1              TO WKS-B05-NUMPRO                        283700      
005350     PERFORM 020700-CALLB05-GUARD-NUM-ENV.                        283800      
005351                                                                  283900      
005352 000-BUSCAR-LIM-ENV-PEND.                                         284000      
005353     PERFORM 020810-OBTEN-NUM-ENV-PEND.                           284100      
005354     IF  W77-RESULT-LIBCON = ZERO                                 284200      
005355         MOVE  WKS-B05-HORAINI        TO W77-LIMITE-ENVIOS        284300      
005356         MOVE  WKS-B05-HORAFIN        TO W77-LIMITE-PENDIENTES    284400      
005357         MOVE  WKS-B05-STAPGM         TO W77-ENVIO-ALER-CLINOCON  284500      
005358     ELSE                                                         284600      
005359         MOVE 22                      TO WKS-B05-FUNCION          284700      
005360         PERFORM 000-BORRAR-REG-B05-ENV-PEND                      284800      
005361         MOVE 19                      TO WKS-B05-FUNCION          284900      
005362         MOVE 0                       TO WKS-B05-MIX              285000      
005363         MOVE 1                       TO WKS-B05-NUMPRO           285100      
005364         MOVE 17                      TO WKS-B05-FCHPRO           285200      
005365         MOVE W77-LIMITE-ENVIOS       TO WKS-B05-HORAINI          285300      
005366         MOVE W77-LIMITE-PENDIENTES   TO WKS-B05-HORAFIN          285400      
005367         PERFORM 020700-CALLB05-GUARD-NUM-ENV.                    285500      
005368                                                                  285600      
005369                                                                  285700      
005370 020810-OBTEN-NUM-ENV-PEND.                                       285800      
005371*========================                                         285900      
005372    MOVE 0                          TO W77-RESULT-LIBCON          286000      
005373    MOVE 17                         TO WKS-B05-FCHPRO             286100      
005374    MOVE 1                          TO WKS-B05-FUNCION            286200      
005375    MOVE 151                        TO WKS-B05-SISTEMA            286300      
005376    MOVE 1                          TO WKS-B05-NUMPRO             286400      
005377    CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS        286500      
005378                                    GIVING W77-RESULT-LIBCON.     286600      
005379 020700-CALLB05-GUARD-NUM-ENV.                                    286700      
005380*========================                                         286800      
005381    MOVE 0                          TO W77-RESULT-LIBCON          286900      
005382    MOVE 151                        TO WKS-B05-SISTEMA            287000      
005383    CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS        287100      
005384                                    GIVING W77-RESULT-LIBCON.     287200      
005385                                                                  287300      
005386 000-VALIDA-LIM-ENV-PEND.                                         287400      
005387*========================                                         287500      
005388*Se Valida que el limite de envios sea 80 o mas ya que en         287600      
005389*produccion 80 es el valor minimo con el que funciona mejor       287700      
005390*el servicio de proteccion de cobros                              287800      
005391    IF W77-LIMITE-ENVIOS < 80                                     287900      
005392       MOVE 80 TO W77-LIMITE-ENVIOS.                              288000      
005393                                                                  288100      
005394*Se Valida que el limite de pendientes sea 40 o mas ya que en     288200      
005395*produccion 40 es el valor minimo con el que funciona mejor       288300      
005396*el servicio de proteccion de cobros                              288400      
005397    IF W77-LIMITE-PENDIENTES < 40                                 288500      
005398       MOVE 40 TO W77-LIMITE-PENDIENTES.                          288600      
005399                                                                  288700      
005400 000-VALIDA-CSI-DESTINO.                                          288800      
005401*=========================                                        288900      
005402    IF WKS-NOMEQUIPO = "VDMBETA."                                 289000      
005403       MOVE 24 TO WKS-HDR-CCRDEST WKS-CSIDEST                     289100      
005404    ELSE                                                          289200      
005405    IF WKS-NOMEQUIPO = "ACYPGAMA."  OR WKS-NOMEQUIPO = "MONALFA." 289300      
005406    OR WKS-NOMEQUIPO = "ACYPOMEGA." OR WKS-NOMEQUIPO = "VDMKAPPA."289350      
005407       MOVE 23 TO WKS-HDR-CCRDEST WKS-CSIDEST                     289400      
005408    ELSE                                                          289500      
005409       IF WKS-NUMCSI-HOST = 10                                    289600      
005410                MOVE 24 TO WKS-HDR-CCRDEST WKS-CSIDEST            289700      
005411       ELSE                                                       289800      
005412          IF WKS-NUMCSI-HOST = 4                                  289900      
005413                MOVE 23 TO WKS-HDR-CCRDEST WKS-CSIDEST.           290000      
005414                                                                  290100      
005415 060150-VALIDA-IND-SERV.                                          290200      
005416*======================                                           290300      
005417    IF A00-R01-SERVICIO-ALERTA = 2                                290400      
005418       MOVE 2 TO IND-SERV                                         290500      
005419    ELSE                                                          291000      
005420       IF A00-R01-SERVICIO-ALERTA NOT = 2                         292000      
005421          MOVE 3 TO IND-SERV.                                     293000      
005422                                                                  294000      
005423 060150-VALIDA-IND-SERV2.                                         295000      
005424*========================                                         296000      
005425    IF B07-AUT-PC = 2                                             297000      
005426       MOVE 2 TO IND-SERV                                         298000      
005427    ELSE                                                          299000      
005428       IF B07-AUT-PC NOT = 2                                      300000      
005429          MOVE 3 TO IND-SERV.                                     301000      
