000001$$SET LIST STACK MAP XREF ERRORLIMIT=50 LINEINFO NEWID "S151/P117"000200      
000002*$SET TADS                                                        000347      
000003*$SET FEDLEVEL = 5                                                000400      
000004 IDENTIFICATION DIVISION.                                         000600      
000005   PROGRAM-ID.                S151-P117-DIFERENCIAS.              000800      
000006*                                                                 001000      
000007* IMPLANTACION.              ROGELIO RAMOS P.  NOV/84             001200      
000008* MODIFICACION.              ANSELMO SANCHEZ MTZ. ABRIL 1999      001400      
000009* INSTALLATION.              BANCO NACIONAL DE MEXICO             001600      
000010  DATE-WRITTEN.              NOVIEMBRE 1984.                      001800      
000011  DATE-COMPILED.                                                  002000      
000012*                                                                 002200      
000013* SECURITY.                                                       002400      
000014*--------------------------------------------------------------*  002600      
000015*                                                                 002800      
000016*   SSSSS  00000  33333  00000       //      11    11    7777     003000      
000017*   S      0   0      3  0   0      //      1 1   1 1       7     003200      
000018*   SSSSS  0   0  3333   0   0     //         1     1      7      003400      
000019*       S  0   0      3  0   0    //          1     1     7       003600      
000020*   SSSSS  00000  33333  00000   //           1     1    7        003800      
000021*                                                                 004000      
000022*                                                              *  004010      
000023* RECOMPILACION POR EL UPGRADE DEL MCP A 55                    *  004012      
000024* 20141208 15MTP001 MJGRG                                      *  004014      
000025*--------------------------------------------------------------*  004200      
000026/*****************************************************************004400      
000027*    SISTEMA.     COMPENSACION CONTABLE NACIONAL.                 004600      
000028*                                                                 004800      
000029*    OBJETIVO.                                                    005000      
000030*                                                                 005200      
000031*      PRODUCIR UN REPORTE CON LAS DIFERENCIAS DETECTADAS EN LAS  005400      
000032*      OPERACIONES DE LOS ARCHIVOS LOG DE CADA C.S.I., PARA CON-  005600      
000033*      TROL DE LA COMPENSADORA NACIONAL.                          005800      
000034******************************************************************008800      
000035*                                                                 009000      
000036 ENVIRONMENT DIVISION.                                            009200      
000037 CONFIGURATION SECTION.                                           009400      
000038 SOURCE-COMPUTER. A5.                                             009600      
000039 OBJECT-COMPUTER. A5.                                             009800      
000040*                                                                 010000      
000041 INPUT-OUTPUT SECTION.                                            010200      
000042 FILE-CONTROL.                                                    010400      
000043**********************************************************        010600      
000044*                                                                 010800      
000045     SELECT LOG-GRAL           ASSIGN TO DISK.                    011000      
000046     SELECT FILE1              ASSIGN TO DISK.                    011200      
000047     SELECT SORT-LOG           ASSIGN TO SORT DISK.               011400      
000048     SELECT REPORTE            ASSIGN TO PRINTER.                 011600      
000049     SELECT DIFNOCON           ASSIGN TO PRINTER.                 011800      
000050     SELECT LISTADO            ASSIGN TO PRINTER.                 012000      
000051     SELECT TEMPFILE           ASSIGN TO DISK.                    012200      
000052     SELECT HISTDIF            ASSIGN TO DISK.                    012400      
000053     SELECT MOVSXTERM          ASSIGN TO DISK.                    013400      
000054     SELECT S028MANIOBRA       ASSIGN TO DISK.                    013600      
000055     SELECT A01-CONTROL        ASSIGN TO DISK                     013650      
000056                               ORGANIZATION IS SEQUENTIAL.        013700      
000057     SELECT SORT-S028          ASSIGN TO SORT DISK.               013800      
000058     SELECT INICSUC            ASSIGN TO PRINTER.                 014000      
000059     SELECT V00-REPORTE2       ASSIGN TO PRINTER.                 014100      
000060*                                                                 014200      
000061**********************************************************        014400      
000062/                                                                 014600      
000063 DATA DIVISION.                                                   014800      
000064 FILE SECTION.                                                    015000      
000065                                                                  015020      
000066 FD  V00-REPORTE2                                                 015040      
000067     VALUE OF TITLE WKS-TIT-REPORTE2.                             015060      
000068                                                                  015080      
000069 01  V00-R00-REPORTE2             PIC X(132).                     015100      
000070                                                                  015120      
000071*************************************                             015220      
000072*   ARCHIVO DE CONTROL DE FECHAS    *                             015320      
000073*************************************                             015420      
000074 FD  A01-CONTROL                                                  015520      
000075     VALUE OF TITLE IS "(S151)S151/FILE/CONTROL/CORP."            015620      
000076     VALUE OF DEPENDENTSPECS IS TRUE.                             015720      
000077                                                                  015820      
000078 01  A01-REG-CONTROL                      PIC X(90).              015920      
000079*                                                                 017200      
000080 FD  FILE1                                                        017400      
000081     VALUE OF DEPENDENTSPECS TRUE.                                017600      
000082 01  REG-FILE1                    PIC X(180).                     017800      
000083*                                                                 018000      
000084****************************************************              018200      
000085*    LOG GENERAL CON TODAS LAS TRANSACCIONES DE    *              018400      
000086*    APLICACIONES EN LINEA, ACEPTADAS PARA EL      *              018600      
000087*    PROCESO DE COMPENSACION.                      *              018800      
000088****************************************************              019000      
000089*                                                                 019200      
000090 FD  LOG-GRAL                                                     019400      
000091                  BLOCK  CONTAINS  40 RECORDS                     019600      
000092                  RECORD CONTAINS 160 CHARACTERS                  019800      
000093                  VALUE OF TITLE NOMBRE-LOG-GRAL                  020000      
000094                  VALUE OF DEPENDENTSPECS IS TRUE                 020100      
000095                  DATA RECORD IS REG-LOG-GRAL.                    020200      
000096 01  REG-LOG-GRAL                 PIC X(160).                     020400      
000097*                                                                 020600      
000098/                                                                 020800      
000099 FD  TEMPFILE                                                     021000      
000100                 RECORD CONTAINS 160 CHARACTERS                   021200      
000101                 BLOCK  CONTAINS  40 RECORDS                      021400      
000102                 VALUE OF TITLE "S151/FILE/TEMPFILE"              021600      
000103                 DATA RECORD IS REG-TEMP-LOG.                     021800      
000104 01  REG-TEMP-LOG                 PIC X(160).                     022000      
000105*                                                                 022200      
000106*                                                                 022400      
000107 FD  MOVSXTERM                                                    022600      
000108                 RECORD CONTAINS  60 CHARACTERS                   022800      
000109                 BLOCK  CONTAINS  15 RECORDS                      023000      
000110                 VALUE OF TITLE WS-NOMB-S028                      023200      
000111                 DATA RECORD IS REG-MOVSXTERM.                    023400      
000112 01  REG-MOVSXTERM                PIC X(60).                      023600      
000113*                                                                 023800      
000114 FD  S028MANIOBRA                                                 024000      
000115                 RECORD CONTAINS 204 CHARACTERS                   024200      
000116                 BLOCK  CONTAINS  10 RECORDS                      024400      
000117                 VALUE OF TITLE "S151/FILE/S028MANIOBRA"          024600      
000118                 DATA RECORD IS REG-S028MANIOBRA.                 024800      
000119 01  REG-S028MANIOBRA             PIC X(204).                     025000      
000120/                                                                 025200      
000121 FD  REPORTE                                                      025400      
000122     VALUE OF TITLE WS-NOMB-REPORTE                               025450      
000123              USERBACKUPNAME TRUE                                 025500      
000124     REPORT IS REP-DIFERENCIA.                                    025550      
000125*                                                                 025600      
000126 FD  DIFNOCON                                                     025800      
000127     VALUE OF TITLE WS-NOMB-REPORTE                               025850      
000128              USERBACKUPNAME TRUE                                 025900      
000129     DATA RECORD IS LDNC.                                         025950      
000130 01  LDNC                         PIC X(132).                     026000      
000131*                                                                 026200      
000132 FD  LISTADO                                                      026400      
000133     VALUE OF TITLE WS-NOMB-REPORTE                               026450      
000134              USERBACKUPNAME TRUE                                 026500      
000135     DATA RECORD IS LISTA.                                        026550      
000136 01  LISTA                        PIC X(132).                     026600      
000137*                                                                 026800      
000138 FD  INICSUC                                                      027000      
000139     VALUE OF TITLE WS-NOMB-REPORTE                               027050      
000140              USERBACKUPNAME TRUE                                 027100      
000141     REPORT IS REP-INICSUC.                                       027150      
000142*                                                                 027200      
000143******************************************************************027400      
000144*** ARCHIVO HISTORICO DE DIFERENCIAS EN OPER/APLI POR CADA CSI ***027600      
000145******************************************************************027800      
000146*                                                                 028000      
000147 FD  HISTDIF                                                      028200      
000148              BLOCK  CONTAINS  10 RECORDS                         028400      
000149              RECORD CONTAINS 204 CHARACTERS                      028600      
000150              VALUE OF TITLE IS "S151/FILE/HISTDIF".              028800      
000151*                                                                 029000      
000152 01  REG-HIST-DIF                    PIC X(204).                  029200      
000153/                                                                 029400      
000154 SD  SORT-LOG.                                                    029600      
000155 01  REG-SORT-LOG.                                                029800      
000156     03 SLOG-LLAVE.                                               030000      
000157        05 SLOG-CSI-ORI              PIC 9(02)    COMP.           030200      
000158        05 SLOG-MONEDA               PIC 9(03)    COMP.           030400      
000159        05 SLOG-FEC-CON              PIC 9(08)    COMP.           030600      
000160        05 SLOG-APL-ORI              PIC 9(04)    COMP.           030800      
000161        05 SLOG-CSI-DES              PIC 9(02)    COMP.           031000      
000162        05 SLOG-APL-DES              PIC 9(04)    COMP.           031200      
000163        05 FILLER                    PIC 9(03)    COMP.           031400      
000164        05 SLOG-CTA-DES              PIC X(20).                   031600      
000165        05 SLOG-CVE-MOV              PIC 9(02)    COMP.           031800      
000166        05 SLOG-IMPORTE              PIC 9(16)V99 COMP.           032000      
000167        05 SLOG-STATUS               PIC 9(02)    COMP.           032200      
000168     03 SLOG-RESTO                   PIC X(160).                  032400      
000169*                                                                 032600      
000170*                                                                 032800      
000171 SD  SORT-S028.                                                   033000      
000172 01  REG-SORT-S028.                                               033200      
000173     03 RS-LLAVE                  PIC X(044).                     033400      
000174     03 RS-RESTO                  PIC X(160).                     033600      
000175*                                                                 033800      
000176 WORKING-STORAGE                 SECTION.                         034000      
000177                                                                  034050      
000178* 01 WS-PROGRAMA PIC X(19) VALUE "S151 P117 15MTP001 ".           034100      
000179  01 WS-PROGRAMA PIC X(19) VALUE "S151 P117 25MTP001 ".           034102      
000180                                                                  034150      
000181*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000182* COPY "(S151)S151/FORMATO/DISPLAY.".                             034200      
000183                                                                  000100      
000184*===============================================================* 000200      
000185*         FORMATO PARA DISPLAYS                                 * 000300      
000186*===============================================================* 000400      
000187                                                                  000500      
000188 01 WKS-TIT-REPORTE2.                                             000600      
000189    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000190    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000191    02 FILLER                       PIC X(06) VALUE               000900      
000192                                              "/LIST/".           001000      
000193    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000194    02 FILLER                       PIC X(01) VALUE "/".          001071      
000195    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000196    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000197    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000198    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000199    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000200    02 FILLER                       PIC X(11) VALUE               001600      
000201                                              "/001MSGIMP.".      001700      
000202                                                                  002100      
000203 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000204                                                                  002300      
000205***********************************************************       002400      
000206*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000207***********************************************************       002600      
000208 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000209*8D                                                               002800      
000210 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000211 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000212    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000213    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000214    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000215*8D                                                               003400      
000216 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000217 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000218    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000219    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000220    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000221                                                                  004100      
000222 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000223                                                                  004300      
000224 01 WKS-FECHA-HORA2.                                              004400      
000225    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000226    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000227       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000228       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000229    02 WKS-TIME-MAQ2.                                             004600      
000230       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
000231       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
000232          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
000233          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
000234          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
000235       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
000236    02 FILLER                             PIC X(01).              004900      
000237    02 WKS-RESTO2                         PIC X(04).              005000      
000238                                                                  005100      
000239*8D                                                               005200      
000240****************** REPORTE DE MENSAJES *********************      005300      
000241 01 WLI-ENCAB-12.                                                 005400      
000242    03 FILLER                             PIC X(05) VALUE         005500      
000243       "S151-".                                                   005600      
000244    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000245    03 FILLER                             PIC X(15) VALUE         005671      
000246       "-001IMPMENSAJES".                                         005691      
000247    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000248    03 FILLER                             PIC X(34) VALUE         005800      
000249       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000250    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000251    03 FILLER                             PIC X(26) VALUE         006100      
000252       "FECHA DE LA INFORMACION : ".                              006200      
000253    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000254    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000255       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000256       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000257       05  WKS-SLASH1                         PIC X(01).          006356      
000258       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000259       05  WKS-SLASH2                         PIC X(01).          006358      
000260       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000261 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000262 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000263    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000264    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000265    03 FILLER                          PIC X(01).                 006371      
000266    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000267    03 FILLER                          PIC X(01).                 006381      
000268    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000269*8D                                                               006400      
000270 01 WLI-ENCAB-22.                                                 006500      
000271     03 FILLER                          PIC X(11) VALUE           006600      
000272        "F.PROCESO: ".                                            006700      
000273     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000274     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000275     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
000276     03 FILLER                          PIC X(01) VALUE ":".      007020      
000277     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
000278     03 FILLER                          PIC X(01) VALUE ":".      007060      
000279     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
000280     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000281     03 FILLER                          PIC X(24) VALUE           007200      
000282              "IMPRESION MENSAJES DEL S".                         007300      
000283     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000284     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000285     03 FILLER                          PIC X(14) VALUE           007600      
000286        "TIPO PROCESO: ".                                         007700      
000287     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000288*8D                                                               007900      
000289 01 WLI-ENCAB-32.                                                 008000      
000290     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000291*       "VERSION  : ".                                            008200      
000292*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000293     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000294     03 FILLER                     PIC X(07) VALUE                008500      
000295        "HOJA : ".                                                008600      
000296     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000297                                                                  008800      
000298 01 WLI-ENCAB-42.                                                 008900      
000299     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000300     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000301     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000302                                                                  009300      
000303 01 WLI-ENCAB-52.                                                 009400      
000304    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000305    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000306    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000307    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000308                                                                  009900      
000309*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
000310 01 WLI-ENCAB-62.                                                 009910      
000311    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
000312    03 WLI-RESULT                 PIC X(04).                      009920      
000313    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
000314    03 WLI-TEXTO                  PIC X(110).                     009930      
000315                                                                  009935      
000316 01 WLI-TOT-ENVIO.                                                009940      
000317    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
000318    03 FILLER                     PIC X(37) VALUE                 009950      
000319       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
000320    03 WLI-ENV-CTD                PIC X(04).                      009960      
000321*FIN - INFOWARE                                                   009970      
000322****************************************************************  010000      
000323*                 CONTADORES DE HOJAS                          *  010100      
000324****************************************************************  010200      
000325                                                                  010300      
000326  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000327*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000328/***************************************************************  034202      
000329***          CARGA DE TIEMPOS ESPECIALES PARA COBOL74        ***  034204      
000330****************************************************************  034206      
000331 01  CODE-FILE            PIC X(300).                             034208      
000332*                                                                 034210      
000333 01  TIME-1               PIC 9(013).                             034212      
000334*          ........ SEXAGESIMOS DE SEGUNDO DESDE LA MEDIA NOCHE.  034214      
000335 01  COMPILETIME-10       PIC 9(006).                             034216      
000336*                  ................. FECHA DE COMPILACION DDDAA.  034218      
000337 01  COMPILETIME-11       PIC 9(011).                             034220      
000338*      ... HORA DE COMPILACION EN UNIDADES DE 2.4 MICROSEGUNDOS.  034222      
000339 01  COMPILETIME-15       PIC 9(006).                             034224      
000340*                   ............... FECHA DE COMPILACION MMDDAA.  034226      
000341 01  JUL-FECHA            PIC 9(006).                             034228      
000342 01  JUL-DATE             REDEFINES JUL-FECHA.                    034230      
000343     03 FILLER            PIC 9(001).                             034232      
000344     03 JUL-YY            PIC 9(002).                             034234      
000345     03 JUL-DDD           PIC 9(003).                             034236      
000346 01  DATE-MMDDYY.                                                 034238      
000347     03 DATE-MM           PIC 9(002).                             034240      
000348     03 DATE-DD           PIC 9(002).                             034242      
000349     03 DATE-YY           PIC 9(002).                             034244      
000350 01  COCIENTE             PIC 9(002).                             034246      
000351 01  T-CREA               PIC 9(013).                             034248      
000352 01  WRESIDUO              PIC 9(002).                            034250      
000353 01  APUNT-MES            PIC 9(002).                             034252      
000354 01  MESES-BISIESTO       PIC X(036) VALUE                        034254      
000355     "031060091121152182213244274305335366".                      034256      
000356 01  MESES-BISIESTO-R     REDEFINES MESES-BISIESTO.               034258      
000357     02 M-DAY             PIC 9(003) OCCURS 12 TIMES.             034260      
000358 01  MESES                PIC X(036) VALUE                        034262      
000359     "031059090120151181212243273304334365".                      034264      
000360 01  MESES-R              REDEFINES MESES.                        034266      
000361     02 D-DAY             PIC 9(003) OCCURS 12 TIMES.             034268      
000362/                                                                 034270      
000363*                                                                 034400      
000364*                                                                 034700      
000365********************************************************          034702      
000366*    DESCRIPCION DEL ARCHIVO S151/FILE/CONTROL/CORP    *          034704      
000367********************************************************          034706      
000368 01  WKS-REG-HD-CONTROL.                                          034711      
000369     03  WKS-HD-CSI       PIC 9(02).                              034716      
000370     03  WKS-HD-FECPRO    PIC 9(08).                              034721      
000371     03  FILLER           PIC X(80).                              034726      
000372                                                                  034731      
000373 01  WKS-REG-DET-CONTROL.                                         034736      
000374     03  WKS-DET-SIST     PIC 9(03).                              034741      
000375     03  WKS-DET-FECPRO   PIC 9(08).                              034746      
000376     03  WKS-DET-INDPF    PIC 9(01).                              034751      
000377/                                                                 034786      
000378*                                                                 034800      
000379 01  WS-REG-SORT-S028.                                            035000      
000380     03 WS-RS-LLAVE.                                              035200      
000381        05 WS-RS-CSI              PIC 9(002) COMP.                035400      
000382        05 WS-RS-SUC              PIC 9(004) COMP.                035600      
000383        05 WS-RS-TREP             PIC 9(001) COMP.                035800      
000384        05 WS-RS-MON              PIC 9(003) COMP.                036000      
000385        05 WS-RS-FEC-CON          PIC 9(008).                     036200      
000386        05 WS-RS-APL              PIC 9(004).                     036400      
000387        05 WS-RS-SUCOPE           PIC 9(004).                     036600      
000388        05 WS-RS-CAJOPE           PIC X(003).                     036800      
000389        05 WS-RS-NUMAUT           PIC X(020).                     037000      
000390     03 WS-RS-RESTO               PIC X(160).                     037200      
000391/                                                                 037400      
000392*----------------------------------------------------------------*037602      
000393*       DESCRIPCION DEL S151/XFER/FILE/INFOICA/OOODDD/AAMMDD     *037604      
000394*----------------------------------------------------------------*037606      
000395*                                                                 037608      
000396**** -------       D  E  T  A  L  L  E       -------- ****        037610      
000397*                                                                 037612      
000398 01 WS-REG-DET-INFOICA            PIC X(160).                     037614      
000399 01 WS-REG-DET-INFOICA-R          REDEFINES WS-REG-DET-INFOICA.   037616      
000400    03 WS-RDI-CSI-ORI             PIC 9(02).                      037618      
000401       88 RDI-CSI-ORI-VAL         VALUES ARE 2,4,10.              037620      
000402    03 WS-RDI-NOD-ORI             PIC 9(02).                      037622      
000403    03 WS-RDI-CSI-DES             PIC 9(02).                      037624      
000404       88 RDI-CSI-DES-VAL         VALUES ARE 2,4,10.              037626      
000405    03 WS-RDI-NOM-EST             PIC X(08).                      037628      
000406    03 WS-RDI-NOM-EST-R           REDEFINES WS-RDI-NOM-EST.       037630      
000407       05 WS-RDI-TIPO-DISP        PIC X(01).                      037632      
000408       05 WS-RDI-SUC-ORI          PIC 9(04).                      037634      
000409       05 WS-RDI-CAJA-ORI         PIC X(03).                      037636      
000410    03 WS-RDI-FEC-GEN             PIC 9(08).                      037638      
000411    03 WS-RDI-HOR-GEN             PIC 9(06).                      037640      
000412    03 WS-RDI-HOR-GEN-R           REDEFINES WS-RDI-HOR-GEN.       037642      
000413       05 WS-RDI-HOR-GEN-HHMM     PIC 9(04).                      037643      
000414       05 WS-RDI-HOR-GEN-HHMM-R REDEFINES WS-RDI-HOR-GEN-HHMM.    037644      
000415         07 WS-RDI-HOR-GEN-HH     PIC 9(02).                      037645      
000416         07 WS-RDI-HOR-GEN-MM     PIC 9(02).                      037646      
000417       05 FILLER                  PIC 9(02).                      037647      
000418    03 WS-RDI-APL-ORI             PIC 9(04).                      037648      
000419    03 WS-RDI-APL-DES             PIC 9(04).                      037650      
000420    03 WS-RDI-STA-TRN             PIC 9(02).                      037652      
000421       88 RDI-STA-TRN-ENVIADO     VALUE 1.                        037654      
000422       88 RDI-STA-TRN-APLICADO    VALUE 2.                        037656      
000423       88 RDI-STA-TRN-OPERADO     VALUE 3.                        037658      
000424       88 RDI-STA-TRN-DENEGADO    VALUE 4.                        037660      
000425       88 RDI-STA-TRN-PENDIENTE   VALUE 5.                        037662      
000426       88 RDI-STA-TRN-VAL         VALUE 1 THRU 5.                 037664      
000427    03 WS-RDI-COD-SER             PIC 9(02).                      037666      
000428       88 RDI-COD-SER-CARGO       VALUE 10.                       037668      
000429       88 RDI-COD-SER-ABONO       VALUE 20.                       037670      
000430       88 RDI-COD-SER-ELIMCARGO   VALUE 11.                       037672      
000431       88 RDI-COD-SER-ELIMABONO   VALUE 21.                       037674      
000432       88 RDI-COD-SER-VAL         VALUES ARE 10,11,20,21.         037676      
000433    03 WS-RDI-SUB-SER             PIC 9(03).                      037678      
000434    03 WS-RDI-CTA-DES             PIC X(20).                      037680      
000435    03 WS-RDI-CTA-DES-R           REDEFINES WS-RDI-CTA-DES.       037682      
000436       05 FILLER                  PIC X(09).                      037684      
000437       05 WS-RDI-CTA-DES-SUC      PIC 9(04).                      037686      
000438       05 WS-RDI-CTA-DES-NUM      PIC 9(07).                      037688      
000439    03 WS-RDI-IMP-TRN             PIC 9(16)V99.                   037690      
000440    03 WS-RDI-MON-TRN             PIC 9(03).                      037692      
000441    03 WS-RDI-FEC-CON             PIC 9(08).                      037694      
000442    03 WS-RDI-CVE-AUT             PIC X(20).                      037696      
000443    03 WS-RDI-NUM-TRN             PIC 9(08).                      037698      
000444    03 WS-RDI-CTA-ACC             PIC X(20).                      037700      
000445    03 WS-RDI-REF-OPE             PIC X(20).                      037702      
000446*                                                                 037704      
000447**** -------  REGISTRO DE CONTROL O HEADER  --------- ****        037706      
000448 01 WS-REG-HEA-INFOICA            PIC X(160).                     037708      
000449 01 WS-REG-HEA-INFOICA-R          REDEFINES WS-REG-HEA-INFOICA.   037710      
000450    03 WS-RHI-ID                  PIC X(003).                     037712      
000451       88 RHI-ID-HDR              VALUE "HDR".                    037714      
000452    03 WS-RHI-FEC-PRO             PIC 9(008).                     037716      
000453    03 WS-RHI-FEC-GEN             PIC 9(008).                     037718      
000454    03 WS-RHI-HOR-GEN             PIC 9(004).                     037720      
000455    03 WS-RHI-SIS-EMI             PIC X(004).                     037722      
000456    03 WS-RHI-SIS-REC             PIC X(004).                     037724      
000457    03 WS-RHI-NOM-EXT             PIC X(008).                     037726      
000458    03 WS-RHI-NUM-REG             PIC 9(007).                     037728      
000459    03 WS-RHI-CSI-ORI             PIC X(003).                     037730      
000460    03 WS-RHI-CSI-DES             PIC X(003).                     037732      
000461    03 FILLER                     PIC X(108).                     037734      
000462*                                                                 037736      
000463**** -------  REGISTRO TOTALIZADOR O TRAILER  --------- ****      037738      
000464 01 WS-REG-TRA-INFOICA            PIC X(160).                     037740      
000465 01 WS-REG-TRA-INFOICA-R          REDEFINES WS-REG-TRA-INFOICA.   037742      
000466    03 WS-RTI-ID                  PIC X(003).                     037744      
000467       88 RTI-ID-HDR              VALUE "TLR".                    037746      
000468    03 WS-RTI-NUM-REG             PIC 9(007).                     037748      
000469    03 FILLER                     PIC X(150).                     037750      
000470*                                                                 037752      
000471* ETIQUETA EXTERNA                                                037754      
000472*                                                                 037756      
000473 01 NOMBRE-INFOICA.                                               037758      
000474    03 FILLER                     PIC X(23) VALUE                 037760      
000475                                  "S151/XFER/FILE/INFOICA/".      037762      
000476    03 NI-CSI-ORI                 PIC X(03).                      037764      
000477    03 NI-CSI-DES                 PIC X(03).                      037766      
000478    03 FILLER                     PIC X(01) VALUE "/".            037768      
000479    03 NI-CSI-FEC                 PIC 9(06).                      037770      
000480    03 NI-CSI-FEC-R               REDEFINES NI-CSI-FEC.           037772      
000481       05 NI-CSI-FEC-AA           PIC 9(02).                      037774      
000482       05 NI-CSI-FEC-MM           PIC 9(02).                      037776      
000483       05 NI-CSI-FEC-DD           PIC 9(02).                      037778      
000484    03 FILLER                     PIC X(01) VALUE ".".            037780      
000485*                                                                 037782      
000486 01 WS-REG-DET-INFOICA-TEMP       PIC X(160).                     037800      
000487*                                                                 038000      
000488 01  WS-REG-HIST-DIF.                                             038200      
000489     03 WS-RHD-FEC                PIC 9(08) COMP.                 038400      
000490     03 WS-RHD-MON                PIC 9(03).                      038600      
000491     03 WS-RHD-SIS                PIC 9(04).                      038800      
000492     03 WS-RHD-CSI                PIC 9(02).                      039000      
000493     03 WS-RHD-APLI-CONF          OCCURS 2 TIMES.                 039200      
000494        05 WS-RHD-CARABO-ELIM     OCCURS 4 TIMES.                 039400      
000495           07 WS-RHD-NUM          PIC 9(10) COMP.                 039600      
000496           07 WS-RHD-IMP          PIC S9(16)V99.                  039800      
000497*                                                                 040000      
000498 01  WS-REG-HIST-DIF-CTL.                                         040200      
000499     03 WS-RHD-FEC-CTL            PIC 9(08).                      040400      
000500     03 WS-RHD-FEC-PROC           PIC 9(08).                      040600      
000501     03 WS-RHD-HORA-PROC          PIC 9(06).                      040800      
000502     03 FILLER                    PIC X(186) VALUE                041000      
000503        "REGISTRO DE CONTROL DE HISTORICO DE DIFERENCIAS".        041200      
000504/                                                                 041400      
000505****** DEFINICION ENLACE CON EL SISTEMA S028 ************         041600      
000506*                                                                 041800      
000507 01 WS-REG-CTL-S028.                                              042000      
000508    03 WS-R028-CHEA               PIC X(02).                      042200      
000509    03 WS-R028-FPRO.                                              042400      
000510       05 WS-R028-DIAP            PIC 9(02).                      042600      
000511       05 WS-R028-MESP            PIC 9(02).                      042800      
000512       05 WS-R028-ANOP            PIC 9(04).                      043000      
000513    03 WS-R028-FREAL              PIC 9(08).                      043200      
000514    03 WS-R028-HREAL              PIC 9(06).                      043400      
000515    03 WS-R028-CSIS               PIC X(04).                      043600      
000516    03 WS-R028-NSIS               PIC X(14).                      043800      
000517    03 WS-R028-CFOR               PIC X(02).                      044000      
000518    03 FILLER                     PIC X(20).                      044200      
000519*                                                                 044400      
000520 01 WS-REG-MOV-S028.                                              044600      
000521    03 WS-R028-SUC                PIC 9(04).                      044800      
000522    03 WS-R028-NECO               PIC 9(04).                      045000      
000523    03 FILLER                     PIC X(04).                      045200      
000524    03 WS-R028-TERM               PIC X(03).                      045400      
000525    03 WS-R028-MON                PIC 9(03).                      045600      
000526    03 WS-R028-CCTA               PIC 9(06).                      045800      
000527    03 WS-R028-NCAR               PIC 9(04)    COMP.              046000      
000528    03 WS-R028-ICAR               PIC 9(14)V99 COMP.              046200      
000529    03 WS-R028-NABO               PIC 9(04)    COMP.              046400      
000530    03 WS-R028-IABO               PIC 9(14)V99 COMP.              046600      
000531    03 WS-R028-LEY                PIC X(16).                      046800      
000532*                                                                 047000      
000533 01 WS-REG-TRA-S028.                                              047200      
000534    03 WS-R028-CTRA               PIC X(02).                      047400      
000535    03 WS-R028-TREG               PIC 9(06).                      047600      
000536    03 WS-R028-TCAR               PIC 9(14)V99.                   047800      
000537    03 WS-R028-TABO               PIC 9(14)V99.                   048000      
000538    03 FILLER                     PIC X(20).                      048200      
000539*                                                                 048400      
000540 01 WS-NOMB-S028.                                                 048600      
000541    03 FILLER                     PIC X(20) VALUE                 048800      
000542       "S151/FILE/MOVSXTERM/".                                    049000      
000543    03 WS-NS028-CSI               PIC X(03).                      049200      
000544    03 FILLER                     PIC X(01) VALUE "/".            049400      
000545    03 WS-NS028-FEC               PIC 9(06).                      049600      
000546    03 FILLER                     PIC X(01) VALUE ".".            049800      
000547/                                                                 050000      
000548********************************************************          050200      
000549 01  INDICES.                                                     050400      
000550     03 IND-FINCOMPENSA          PIC  9.                          050600      
000551     03 IND-FIN-LOG              PIC  9.                          050800      
000552     03 IND-FIN-SORT             PIC  9.                          051000      
000553     03 IND-FIN-TEMP             PIC  9.                          051200      
000554     03 IND-FIN-MAN              PIC  9.                          051400      
000555     03 IND-FIN-DIF              PIC  9.                          051600      
000556     03 IND-OP                   PIC  9.                          051800      
000557     03 OP-APL                   PIC  9.                          052000      
000558     03 IND-LOG                  PIC  9(04).                      052200      
000559     03 IND-TAB                  PIC  9(04).                      052400      
000560         88 IND-TAB-VAL           VALUES ARE 0 THRU 99.           052600      
000561     03 IND-1                    PIC  9(04).                      052800      
000562     03 IND-2                    PIC  9(04).                      053000      
000563     03 IND-3                    PIC  9(04).                      053200      
000564     03 W-CAMBIO                 PIC  9(06).                      053400      
000565     03 W-SUC                    PIC  9(04).                      053600      
000566     03 W-TREP                   PIC  9(01).                      053800      
000567     03 W-CSI-ORI                PIC  9(02).                      054000      
000568     03 W-FEC-CON                PIC  9(08).                      054200      
000569     03 W-APL-ORI                PIC  9(04).                      054400      
000570     03 W-MONEDA                 PIC  9(03).                      054600      
000571     03 W-DESTINO                PIC  9(02).                      054800      
000572     03 W-SUCOPE                 PIC  9(04).                      055000      
000573     03 WS-CSI-ORI               PIC  9(02).                      055200      
000574     03 WS-FEC-CON               PIC  9(08).                      055400      
000575     03 WS-SUC                   PIC  9(04).                      055600      
000576     03 WS-TREP                  PIC  9(01).                      055800      
000577     03 WS-MONEDA                PIC  9(03).                      056000      
000578     03 WS-APL-ORI               PIC  9(04).                      056200      
000579     03 WS-APL-ORI-PTE           PIC  9(04).                      056400      
000580     03 WS-NUM-AUT               PIC  X(20).                      056600      
000581     03 CVE-DRCR-1               PIC  X(02).                      056800      
000582     03 CVE-DRCR-2               PIC  X(02).                      057000      
000583     03 WS-CTAMAE                PIC  X(02).                      057200      
000584     03 CSI-ORI-ANT              PIC  9(02).                      057400      
000585     03 WS-CARGOS                PIC S9(16)V99.                   057600      
000586     03 WS-ABONOS                PIC S9(16)V99.                   057800      
000587     03 WS-LOW                   PIC  X(36).                      058000      
000588*                                                                 058200      
000589*                                                                 058400      
000590 01 WS-STA-NAME.                                                  058600      
000591    03 WS-STANAME-DISP            PIC X(01).                      058800      
000592    03 WS-STANAME-SUC             PIC 9(04).                      059000      
000593    03 WS-STANAME-CAJA            PIC X(03).                      059200      
000594*                                                                 059400      
000595 01  WS-SPACE       PIC  X(20)  VALUE SPACES.                     059600      
000596 01  WS-LLAVE-COMP  PIC  X(12).                                   059800      
000597*                                                                 060000      
000598 01 NOMBRE-LOG-GRAL.                                              060200      
000599    03 FILLER       PIC X(18) VALUE "S151/FILE/LOGGRAL/".         060400      
000600    03 FECHA-NL     PIC 9(6).                                     060600      
000601    03 FECHA-NLR    REDEFINES FECHA-NL.                           060700      
000602       05 FECNL-AA  PIC 9(02).                                    060710      
000603       05 FECNL-MM  PIC 9(02).                                    060720      
000604       05 FECNL-DD  PIC 9(02).                                    060730      
000605    03 FILLER       PIC X(1)  VALUE ".".                          060800      
000606/                                                                 061000      
000607 01  WS-DATOS-SORTS.                                              061200      
000608     03  WS-MEM-SIZE             PIC 9(10) VALUE 0.               061400      
000609     03  WS-DISK-SIZE            PIC 9(10) VALUE 0.               061600      
000610     03  WS-ULTREG-LOGGRAL       PIC 9(10) VALUE 0.               061800      
000611     03  WS-ULTREG-MAN           PIC 9(10) VALUE 0.               062000      
000612     03  WS-ULTREG-S028MAN       PIC 9(10) VALUE 0.               062200      
000613     03  WS-REGSIZE-SORTLOG      PIC 9(02) VALUE 34.              062400      
000614     03  WS-REGSIZE-SORTS028     PIC 9(02) VALUE 34.              062600      
000615     03  WS-CT1-MSIZE            PIC 9(02) VALUE 03.              062800      
000616     03  WS-CT2-MSIZE            PIC 9(04) VALUE 2000.            063000      
000617     03  WS-CT3-MSIZE            PIC 9(04) VALUE 1500.            063200      
000618*                                                                 063400      
000619 01  CONTADORES.                                                  063600      
000620     03 UNO                      PIC 9.                           063800      
000621     03 CONT-NFOLIOS             PIC 9(10).                       064000      
000622     03 CONT-LINEAS              PIC 9(3).                        064200      
000623     03 CONT-PAGINA              PIC 9(8).                        064400      
000624     03 CONTLIN                  PIC 9(2).                        064600      
000625     03 CONTLIN2                 PIC 9(2).                        064800      
000626     03 NUM-HOJA-LG              PIC 9(03).                       065000      
000627     03 NUM-HOJA-DUPL            PIC 9(03).                       065200      
000628 01  ACUMULADORES.                                                065400      
000629     03 DIAS-ELIMINA             PIC  9(11).                      065600      
000630     03 DIAS-MOVIMIENTO          PIC  9(11).                      065800      
000631     03 IMPORTE-ENTERO           PIC  9(16)V99.                   066000      
000632     03 WS-NUM-REGS              PIC  9(07).                      066200      
000633     03 WS-NUM-PAL-MEM           PIC  9(07).                      066400      
000634     03 WS-NUM-PAL-DISK          PIC  9(07).                      066600      
000635 01  TOTALIZADORES.                                               066800      
000636     03 TOT-SIS-CSI              OCCURS 5 TIMES.                  067000      
000637        05 TOT-OP-APL            OCCURS 2 TIMES.                  067200      
000638          07 TOT-CAR             PIC S9(16)V99.                   067400      
000639          07 TOT-ABO             PIC S9(16)V99.                   067600      
000640       05 TOT-DIF                PIC S9(16)V99.                   067800      
000641 01 WS-PTER                      PIC  9(02).                      068000      
000642/                                                                 068200      
000643 01  TABLA-CCRS-DIF              PIC  X(40).                      068400      
000644 01  TABLA-CCRS-DIF-R            REDEFINES TABLA-CCRS-DIF.        068600      
000645     03 TAB-CCR-OK               PIC 99  OCCURS 20 TIMES.         068800      
000646*                                                                 069000      
000647 01 TABLA-CCRS.                                                   069200      
000648     02  FILLER      PIC X(57) VALUE                              069400      
000649     "01   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 069600      
000650     02  FILLER      PIC X(57) VALUE                              069800      
000651     "02CONT CNTRL FIN INT0829CONTAB CONTROL FINANZAS INTERNAC ". 070000      
000652     02  FILLER      PIC X(57) VALUE                              070200      
000653     "03   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 070400      
000654     02  FILLER      PIC X(57) VALUE                              070600      
000655     "04MONNORTE          0904CONTADURIA REGIONAL MONTERREY    ". 070800      
000656     02  FILLER      PIC X(57) VALUE                              071000      
000657     "05   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 071200      
000658     02  FILLER      PIC X(57) VALUE                              071400      
000659     "06   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 071600      
000660     02  FILLER      PIC X(57) VALUE                              071800      
000661     "07   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 072000      
000662     02  FILLER      PIC X(57) VALUE                              072200      
000663     "08   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 072400      
000664     02  FILLER      PIC X(57) VALUE                              072600      
000665     "09   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 072800      
000666     02  FILLER      PIC X(57) VALUE                              073000      
000667     "10VDMVALLE DE MEXICO0907CONTADURIA REGIONAL V. DE MEXICO ". 073200      
000668     02  FILLER      PIC X(57) VALUE                              073400      
000669     "11   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 073600      
000670     02  FILLER      PIC X(57) VALUE                              073800      
000671     "12   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 074000      
000672     02  FILLER      PIC X(57) VALUE                              074200      
000673     "13   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 074400      
000674     02  FILLER      PIC X(57) VALUE                              074600      
000675     "14   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 074800      
000676     02  FILLER      PIC X(57) VALUE                              075000      
000677     "15   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 075200      
000678     02  FILLER      PIC X(57) VALUE                              075400      
000679     "16   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 075600      
000680     02  FILLER      PIC X(57) VALUE                              075800      
000681     "17   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 076000      
000682     02  FILLER      PIC X(57) VALUE                              076200      
000683     "18   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 076400      
000684     02  FILLER      PIC X(57) VALUE                              076600      
000685     "19   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 076800      
000686     02  FILLER      PIC X(57) VALUE                              077000      
000687     "20   -DESCONOCIDO-  0000-DESCONOCIDO-                    ". 077200      
000688 01  TAB-CCRS-R REDEFINES TABLA-CCRS.                             077400      
000689     02  INFO-TAB-CCRS OCCURS 20 TIMES.                           077600      
000690         03  NUM-CCR-TC         PIC 9(02).                        077800      
000691         03  ABR-CSI-TC         PIC X(03).                        078000      
000692         03  NOMBRE-CCR         PIC X(15).                        078200      
000693         03  NUM-OCCA-CCR-TC    PIC 9(04).                        078400      
000694         03  OCCA-CCR-TC        PIC X(33).                        078600      
000695 01  LIM-CCRS                   PIC 9(02) VALUE 20.               078800      
000696*                                                                 079000      
000697 01  IND-CSI                    PIC 9(02).                        079200      
000698     88 CSI-VALIDO              VALUES ARE 2,4,10.                079400      
000699/                                                                 079600      
000700 01 TAB-MENSAJES.                                                 079800      
000701    03 FILLER                  PIC X(16) VALUE "CONF NO APLICADO".080000      
000702    03 FILLER                  PIC X(16) VALUE "APLICADO NO CONF".080200      
000703    03 FILLER                  PIC X(16) VALUE "ELIM CONF NO APL".080400      
000704    03 FILLER                  PIC X(16) VALUE "ELIM APL NO CONF".080600      
000705 01 TAB-MENSAJES-R             REDEFINES TAB-MENSAJES.            080800      
000706    03 TAB-TEXTO               PIC X(16) OCCURS 4 TIMES.          081000      
000707*                                                                 081200      
000708 01 TAB-TIPOSUC.                                                  081400      
000709    03 FILLER                  PIC X(14) VALUE "              ".  081600      
000710    03 FILLER                  PIC X(14) VALUE "** NO CONTABLE".  081800      
000711*                                                                 082000      
000712 01 TAB-TIPOSUC-R              REDEFINES TAB-TIPOSUC.             082200      
000713    03  TIPOSUC                PIC X(14) OCCURS 2 TIMES.          082400      
000714*                                                                 082600      
000715 01 TAB-DIFNOCON.                                                 082800      
000716    03 FILLER                     PIC X(27) VALUE SPACES.         083000      
000717    03 FILLER                     PIC X(03) VALUE " CR".          083200      
000718    03 FILLER                     PIC X(03) VALUE "ECR".          083400      
000719    03 FILLER                     PIC X(24) VALUE SPACES.         083600      
000720    03 FILLER                     PIC X(03) VALUE " DR".          083800      
000721    03 FILLER                     PIC X(03) VALUE "EDR".          084000      
000722*                                                                 084200      
000723 01 TAB-DIFNOCON-R                REDEFINES TAB-DIFNOCON.         084400      
000724    03 TAB-DNC                    PIC X(03)                       084600      
000725                                  OCCURS    21 TIMES.             084800      
000726 01 LIM-DNC                       PIC 9(02) VALUE 21.             085000      
000727*                                                                 085200      
000728 01  TABLA-SISTEMAS.                                              085400      
000729      02  FILLER                  PIC X(27) VALUE                 085600      
000730          "CHS001CHEQUES       CHEQUES".                          085800      
000731      02  FILLER                  PIC X(27) VALUE                 086000      
000732          "CMS001CUENTA MAESTRACTAMAE ".                          086200      
000733      02  FILLER                  PIC X(27) VALUE                 086400      
000734          "LBS001LINEA BANAMEX LIN.BNM".                          086600      
000735      02  FILLER                  PIC X(27) VALUE                 086800      
000736          "OAS001ORDENES ABONO O.ABONO".                          087000      
000737      02  FILLER                  PIC X(27) VALUE                 087200      
000738          "BCS001BCO EN SU CASAB.CASA ".                          087400      
000739 01  TAB-SIST-R                   REDEFINES TABLA-SISTEMAS.       087600      
000740     02  INFO-TAB-SIST            OCCURS   5 TIMES.               087800      
000741         03  PREFIJO-TS           PIC X(02).                      088000      
000742         03  SISTEMA-TS           PIC X(04).                      088200      
000743         03  SIST-R-TS            REDEFINES SISTEMA-TS.           088400      
000744             04  FILLER           PIC X(01).                      088600      
000745             04  SISTEMA-NUM-TS   PIC 9(03).                      088800      
000746         03  DESCR-SIST-TS        PIC X(14).                      089000      
000747         03  DESCR-SIST-CORTA     PIC X(07).                      089200      
000748 01 LIM-SISTEMAS                  PIC 9(01) VALUE 5.              089400      
000749*                                                                 089600      
000750/                                                                 089800      
000751 01 WS-TABLA-VERIF-MSG.                                           090000      
000752    03 WS-TVM-TOTAL               PIC X(16000).                   090200      
000753    03 WS-TVM-OCC                 OCCURS 100 TIMES.               090400      
000754       05 WS-TVM-REG              PIC X(160).                     090600      
000755       05 WS-TVM-REG-R            REDEFINES WS-TVM-REG.           090800      
000756          07 WS-TVM-CSI-ORI       PIC 9(02).                      091000      
000757          07 FILLER               PIC X(02).                      091200      
000758          07 WS-TVM-CSI-DES       PIC 9(02).                      091400      
000759          07 FILLER               PIC X(01).                      091600      
000760          07 WS-TVM-SUC-ORI       PIC 9(04).                      091800      
000761          07 WS-TVM-CAJA-ORI      PIC X(03).                      092000      
000762          07 FILLER               PIC X(14).                      092200      
000763          07 WS-TVM-APL-ORI       PIC 9(04).                      092400      
000764          07 WS-TVM-APL-DES       PIC 9(04).                      092600      
000765          07 WS-TVM-STA-TRN       PIC 9(02).                      092800      
000766             88 TVM-ENVIADO       VALUE 1.                        093000      
000767             88 TVM-APLICADO      VALUE 2.                        093200      
000768             88 TVM-OPERADO       VALUE 3.                        093400      
000769             88 TVM-DENEGADO      VALUE 4.                        093600      
000770             88 TVM-PENDIENTE     VALUE 5.                        093800      
000771          07 WS-TVM-COD-SER       PIC 9(02).                      094000      
000772             88 TVM-CARGO         VALUE 10.                       094200      
000773             88 TVM-ANUCARGO      VALUE 11.                       094400      
000774             88 TVM-INSTCARGO     VALUE 12.                       094600      
000775             88 TVM-EINSTCARGO    VALUE 13.                       094800      
000776             88 TVM-ABONO         VALUE 20.                       095000      
000777             88 TVM-ANUABONO      VALUE 21.                       095200      
000778             88 TVM-INSTABONO     VALUE 22.                       095400      
000779             88 TVM-EINSTABONO    VALUE 23.                       095600      
000780          07 FILLER               PIC 9(03).                      095800      
000781          07 WS-TVM-ID-CTA        PIC X(20).                      096000      
000782          07 WS-TVM-IMPORTE       PIC 9(18).                      096200      
000783          07 WS-TVM-CVE-MON       PIC 9(03).                      096400      
000784          07 WS-TVM-FECHA         PIC 9(08).                      096600      
000785          07 WS-TVM-CVE-AUT       PIC X(20).                      096800      
000786          07 FILLER               PIC X(48).                      097000      
000787*                                                                 097200      
000788/*******************************************************          097400      
000789 01  WS-FECHAS.                                                   097600      
000790    03 WS-FECHA-DMA               PIC 9(08).                      097605      
000791    03 WS-FECHA-DMA-R REDEFINES WS-FECHA-DMA.                     097610      
000792       05 WS-FE-DMA-DIA           PIC 9(02).                      097615      
000793       05 WS-FE-DMA-MES           PIC 9(02).                      097620      
000794       05 WS-FE-DMA-YEAR          PIC 9(04).                      097625      
000795    03 WS-FECHA-AMD               PIC 9(08).                      097630      
000796    03 WS-FECHA-AMD-R REDEFINES WS-FECHA-AMD.                     097635      
000797       05 WS-FE-AMD-YEAR          PIC 9(04).                      097640      
000798       05 WS-FE-AMD-MES           PIC 9(02).                      097645      
000799       05 WS-FE-AMD-DIA           PIC 9(02).                      097650      
000800    03 WS-FEMAQ-DMA               PIC 9(08).                      097655      
000801    03 WS-FEMAQ-DMA-R REDEFINES WS-FEMAQ-DMA.                     097660      
000802       05 WS-FM-DMA-DIA           PIC 9(02).                      097665      
000803       05 WS-FM-DMA-MES           PIC 9(02).                      097670      
000804       05 WS-FM-DMA-YEAR          PIC 9(04).                      097675      
000805    03 WS-FEMAQ-AMD               PIC 9(08).                      097680      
000806    03 WS-FEMAQ-AMD-R REDEFINES WS-FEMAQ-AMD.                     097685      
000807       05 WS-FM-AMD-YEAR          PIC 9(04).                      097690      
000808       05 WS-FM-AMD-MES           PIC 9(02).                      097695      
000809       05 WS-FM-AMD-DIA           PIC 9(02).                      097700      
000810     03 WS-TIME                  PIC  9(8).                       097800      
000811     03 WS-TIME-R                REDEFINES WS-TIME.               098000      
000812        05 WS-TIME-HMS           PIC 9(06).                       098050      
000813        05 WS-TIME-HMS-R REDEFINES WS-TIME-HMS.                   098100      
000814          07 WS-TIME-HH          PIC  9(2).                       098200      
000815          07 WS-TIME-MM          PIC  9(2).                       098250      
000816          07 WS-TIME-SS          PIC  9(2).                       098300      
000817        05 WS-TIME-DD            PIC  9(2).                       098400      
000818     03 WS-DATE                  PIC  9(8).                       098600      
000819     03 WS-DATE-R                REDEFINES WS-DATE.               098800      
000820        05 WS-DATE-AA            PIC  9999.                       099000      
000821        05 WS-DATE-MM            PIC  99.                         099200      
000822        05 WS-DATE-DD            PIC  99.                         099400      
000823     03 WS-DIA                   PIC  9999.                       099600      
000824     03 VERSION-WS               PIC 9(8).                        099800      
000825     03 VERS-WS     REDEFINES    VERSION-WS.                      100000      
000826        05 DD-VS                 PIC  99.                         100200      
000827        05 MM-VS                 PIC  99.                         100400      
000828        05 AA-VS                 PIC  9999.                       100600      
000829     03 DUMMY-WS                 PIC  9999.                       100800      
000830*                                                                 101000      
000831     03 WS-SISTEMA-LG             PIC X(14).                      101200      
000832     03 WS-SISTEMA-LG-R           REDEFINES WS-SISTEMA-LG.        101400      
000833        05  WS-SIS-LG             PIC Z(04).                      101600      
000834        05  FILLER                PIC X(10).                      101800      
000835     03 WS-SISTEMA-CR             PIC X(07).                      102000      
000836     03 WS-SISTEMA-CR-R           REDEFINES WS-SISTEMA-CR.        102200      
000837        05  WS-SIS-CR             PIC Z(04).                      102400      
000838        05  FILLER                PIC X(03).                      102600      
000839     03 WS-SISTEMA-CR-X           REDEFINES WS-SISTEMA-CR.        102800      
000840        05  FILLER                PIC X(03).                      103000      
000841        05  WS-SIS-SIGLAS         PIC X(02).                      103200      
000842        05  FILLER                PIC X(02).                      103400      
000843*                                                                 103600      
000844     03 WS-ENCONTRE-SIST         PIC 9(01).                       103800      
000845        88 ENCONTRE-SIST         VALUE 0.                         104000      
000846     03 APL-ORI-WS               PIC 9(04).                       104200      
000847        88 APL-ORI-LOGCCR        VALUE 1001 THRU 1005.            104400      
000848     03 APL-ORI-WS-R             REDEFINES  APL-ORI-WS.           104600      
000849        05 FILLER                PIC 9(01).                       104800      
000850        05 SIS-WS                PIC 9(03).                       105000      
000851/                                                                 105200      
000852 01  TIT-NDIF1.                                                   105400      
000853     03  FILLER                 PIC X(27) VALUE                   105600      
000854          "R/151-117/004-DIFNOCONTABLE".                          105800      
000855     03  FILLER                 PIC X(13) VALUE SPACES.           106000      
000856     03  FILLER                 PIC X(52) VALUE                   106200      
000857         "BANCO NACIONAL DE MEXICO - SERVICIOS TRANSACCIONALES".  106400      
000858     03  FILLER                 PIC X(25) VALUE SPACES.           106600      
000859     03  FILLER                 PIC X(07) VALUE                   106800      
000860         "HOJA:  ".                                               107000      
000861     03  TIT-NDIF1-PAGE         PIC Z(05).                        107200      
000862     03  FILLER                 PIC X(03) VALUE SPACES.           107400      
000863*                                                                 107600      
000864 01  TIT-NDIF2.                                                   107800      
000865     03  FILLER                 PIC X(12) VALUE                   108000      
000866         "FECHA REAL: ".                                          108200      
000867     03  TIT-NDIF2-FEC          PIC 99/99/9999.                   108400      
000868     03  FILLER                 PIC X(31) VALUE SPACES.           108600      
000869     03  FILLER                 PIC X(30) VALUE                   108800      
000870         "COMPENSACION CONTABLE NACIONAL".                        109000      
000871     03  FILLER                 PIC X(36) VALUE SPACES.           109200      
000872*JRC 03  FILLER                 PIC X(05) VALUE                   109400      
000873*JRC     "V  : ".                                                 109600      
000874*JRC 03  TIT-NDIF2-VER          PIC 9(08).                        109800      
000875*JRC 03  FILLER                 PIC X(03) VALUE SPACES.           110000      
000876*                                                                 110200      
000877 01  TIT-NDIF3.                                                   110400      
000878     03  FILLER                 PIC X(12) VALUE                   110600      
000879         "HORA  REAL: ".                                          110800      
000880     03  TIT-NDIF3-HH           PIC 99.                           111000      
000881     03  FILLER                 PIC X VALUE ":".                  111020      
000882     03  TIT-NDIF3-MM           PIC 99.                           111040      
000883     03  FILLER                 PIC X VALUE ":".                  111060      
000884     03  TIT-NDIF3-SS           PIC 99.                           111080      
000885     03  FILLER                 PIC X(23) VALUE SPACES.           111200      
000886     03  FILLER                 PIC X(46) VALUE                   111400      
000887         "          DIFERENCIAS  NO  CONTABLES          ".        111600      
000888     03  FILLER                 PIC X(43) VALUE SPACES.           111800      
000889*                                                                 112000      
000890 01  TIT-NDIF4.                                                   112200      
000891     03  FILLER                 PIC X(51) VALUE SPACES.           112400      
000892     03  FILLER                 PIC X(22) VALUE                   112600      
000893         "FECHA DE MOVIMIENTOS: ".                                112800      
000894     03  TIT-NDIF4-FEC          PIC 99/99/9999.                   113000      
000895     03  FILLER                 PIC X(51) VALUE SPACES.           113200      
000896*                                                                 113400      
000897 01  TIT-NDIF5.                                                   113600      
000898     03  FILLER                 PIC X(35) VALUE                   113800      
000899         "CENTRO DE SERVICIO DE INFORMACION: ".                   114000      
000900     03  TIT-NDIF5-NOM          PIC X(15) VALUE SPACES.           114200      
000901     03  FILLER                 PIC X(82) VALUE SPACES.           114400      
000902/                                                                 114600      
000903 01  SUBTIT-1.                                                    114800      
000904     03  FILLER                   PIC X(48) VALUE                 115000      
000905         "CSI APL  CSI APL   NOMBRE        CLAVE DE       ".      115200      
000906     03  FILLER                   PIC X(50) VALUE                 115400      
000907         "                       TIPO                       ".    115600      
000908     03  FILLER                   PIC X(34) VALUE                 115800      
000909         "CVE       FECHA   HORA   FECHA    ".                    116000      
000910*                                                                 116200      
000911 01  SUBTIT-2.                                                    116400      
000912     03  FILLER                   PIC X(48) VALUE                 116600      
000913         "ORI ORI  DES DES  ESTACION     AUTORIZACION     ".      116800      
000914     03  FILLER                   PIC X(50) VALUE                 117000      
000915         "    CUENTA-DESTINO      MOV    I M P O R T E      ".    117200      
000916     03  FILLER                   PIC X(34) VALUE                 117400      
000917         "MOV MON    CONT.   GEN.   GEN. STA".                    117600      
000918*                                                                 117800      
000919 01  SUBTIT-3.                                                    118000      
000920     03  FILLER                   PIC X(48) VALUE                 118200      
000921         "--- ---- --- ---- -------- -------------------- ".      118400      
000922     03  FILLER                   PIC X(50) VALUE                 118600      
000923         "---------------------- ---- --------------------- ".    118800      
000924     03  FILLER                   PIC X(34) VALUE                 119000      
000925         "--- --- -------- ----- -------- --".                    119200      
000926*                                                                 119400      
000927/                                                                 119600      
000928 01  REP2-DET1.                                                   119800      
000929     03  R2D1-CSI-ORI             PIC X(03).                      120000      
000930     03  FILLER                   PIC X(01).                      120200      
000931     03  R2D1-APL-ORI             PIC X(04).                      120400      
000932     03  FILLER                   PIC X(01).                      120600      
000933     03  R2D1-CSI-DES             PIC X(03).                      120800      
000934     03  FILLER                   PIC X(01).                      121000      
000935     03  R2D1-APL-DES             PIC X(04).                      121200      
000936     03  FILLER                   PIC X(01).                      121400      
000937     03  R2D1-STA-NAME            PIC X(08).                      121600      
000938     03  FILLER                   PIC X(01).                      121800      
000939     03  R2D1-N-AUTOR             PIC X(20).                      122000      
000940     03  FILLER                   PIC X(01).                      122200      
000941     03  R2D1-CTA-DES             PIC X(22).                      122400      
000942     03  FILLER                   PIC X(01).                      122600      
000943     03  R2D1-TIPO-MOV            PIC X(03).                      122800      
000944     03  FILLER                   PIC X(01).                      123000      
000945     03  R2D1-IMPORTE             PIC ZZZZZZZ,ZZZ,ZZZ,ZZ9.99.     123200      
000946     03  FILLER                   PIC X(01).                      123400      
000947     03  R2D1-SUB-SER             PIC X(03).                      123600      
000948     03  FILLER                   PIC X(01).                      123800      
000949     03  R2D1-MONEDA              PIC ZZ9.                        124000      
000950     03  FILLER                   PIC X(01).                      124200      
000951     03  R2D1-FEC-CON             PIC 9(08).                      124400      
000952     03  FILLER                   PIC X(01).                      124600      
000953     03  R2D1-HORA-HH             PIC 99.                         124800      
000954     03  FILLER                   PIC X VALUE ":".                124850      
000955     03  R2D1-HORA-MM             PIC 99.                         124900      
000956     03  FILLER                   PIC X(01).                      125000      
000957     03  R2D1-FEC-GEN             PIC 9(08).                      125200      
000958     03  FILLER                   PIC X(01).                      125400      
000959     03  R2D1-STATUS              PIC Z9.                         125600      
000960*                                                                 125800      
000961*                                                                 126000      
000962 01  REP2-DET2.                                                   126200      
000963     03  FILLER                   PIC X(15) VALUE SPACES.         126400      
000964     03  FILLER                   PIC X(12) VALUE "CTA-ACCESO: ". 126600      
000965     03  R2D2-CTA-ACC             PIC X(20).                      126800      
000966     03  FILLER                   PIC X(02) VALUE SPACES.         127000      
000967     03  FILLER                   PIC X(05) VALUE "REF: ".        127200      
000968     03  R2D2-REF-OPE             PIC X(20).                      127400      
000969     03  FILLER                   PIC X(57) VALUE SPACES.         127600      
000970*                                                                 127800      
000971*                                                                 128000      
000972 01 WS-EDIT-CTADES.                                               128200      
000973    03 WS-SUC-CTADES            PIC Z(12)9.                       128400      
000974    03 FILLER                   PIC X(01) VALUE SPACES.           128600      
000975    03 WS-CTA-CTADES            PIC Z(05)99.                      128800      
000976*                                                                 129000      
000977 01 WS-PARTE-CTADES             PIC 9(20).                        129200      
000978 01 WS-PARTE-CTADES-R           REDEFINES WS-PARTE-CTADES.        129400      
000979    03 WS-PARTE-SUC             PIC 9(13).                        129600      
000980    03 WS-PARTE-CTA             PIC 9(07).                        129800      
000981*                                                                 130000      
000982/                                                                 130200      
000983 01  TIT-DUPL1.                                                   130400      
000984     03  FILLER                 PIC X(27) VALUE                   130600      
000985          "R/151-117/002-DUPLICADOS   ".                          130800      
000986     03  FILLER                 PIC X(13) VALUE SPACES.           131000      
000987     03  FILLER                 PIC X(52) VALUE                   131200      
000988         "BANCO NACIONAL DE MEXICO - SERVICIOS TRANSACCIONALES".  131400      
000989     03  FILLER                 PIC X(25) VALUE SPACES.           131600      
000990     03  FILLER                 PIC X(07) VALUE                   131800      
000991         "HOJA:  ".                                               132000      
000992     03  TIT-DUPL1-PAGE         PIC Z(05).                        132200      
000993     03  FILLER                 PIC X(03) VALUE SPACES.           132400      
000994*                                                                 132600      
000995 01  TIT-DUPL2.                                                   132800      
000996     03  FILLER                 PIC X(12) VALUE                   133000      
000997         "FECHA REAL: ".                                          133200      
000998     03  TIT-DUPL2-FEC          PIC 99/99/9999.                   133400      
000999     03  FILLER                 PIC X(31) VALUE SPACES.           133600      
001000     03  FILLER                 PIC X(30) VALUE                   133800      
001001         "COMPENSACION CONTABLE NACIONAL".                        134000      
001002     03  FILLER                 PIC X(36) VALUE SPACES.           134200      
001003*JRC 03  FILLER                 PIC X(05) VALUE                   134400      
001004*JRC     "V  : ".                                                 134600      
001005*JRC 03  TIT-DUPL2-VER          PIC 9(08).                        134800      
001006*JRC 03  FILLER                 PIC X(03) VALUE SPACES.           135000      
001007*                                                                 135200      
001008 01  TIT-DUPL3.                                                   135400      
001009     03  FILLER                 PIC X(12) VALUE                   135600      
001010         "HORA  REAL: ".                                          135800      
001011     03  TIT-DUPL3-HH           PIC 99.                           136000      
001012     03  FILLER                 PIC X VALUE ":".                  136020      
001013     03  TIT-DUPL3-MM           PIC 99.                           136040      
001014     03  FILLER                 PIC X VALUE ":".                  136060      
001015     03  TIT-DUPL3-SS           PIC 99.                           136080      
001016                                                                  136100      
001017     03  FILLER                 PIC X(23) VALUE SPACES.           136200      
001018     03  FILLER                 PIC X(46) VALUE                   136400      
001019         "MOVIMIENTOS DUPLICADOS DE LOS DIFERENTES CSI'S".        136600      
001020     03  FILLER                 PIC X(43) VALUE SPACES.           136800      
001021*                                                                 137000      
001022/                                                                 137200      
001023*********************************************************         137400      
001024*     AREA DE TITULOS PARA ENCABEZADOS DE PAGINAS       **        137600      
001025**********************************************************        137800      
001026 01  TIT-DIF1.                                                    138000      
001027     03 FILLER                   PIC  X(25)  VALUE                138200      
001028         "R/151-117/001-DIFERENCIAS".                             138400      
001029     03 FILLER                   PIC  X(15)  VALUE SPACE.         138600      
001030     03 FILLER                   PIC  X(52)  VALUE                138800      
001031        "BANCO NACIONAL DE MEXICO - SERVICIOS TRANSACCIONALES".   139000      
001032     03 FILLER                   PIC  X(22)  VALUE SPACE.         139200      
001033     03 FILLER                   PIC  X(08)  VALUE "  HOJA: ".    139400      
001034*                                                                 139600      
001035 01  TIT-DIF1A.                                                   139800      
001036     03 FILLER                   PIC  X(25)  VALUE                140000      
001037         "R/151-117/003-DIFSUCURSAL".                             140200      
001038     03 FILLER                   PIC  X(15)  VALUE SPACE.         140400      
001039     03 FILLER                   PIC  X(52)  VALUE                140600      
001040        "BANCO NACIONAL DE MEXICO - SERVICIOS TRANSACCIONALES".   140800      
001041     03 FILLER                   PIC  X(23)  VALUE SPACE.         141000      
001042     03 FILLER                   PIC  X(11)  VALUE "PAGINA:    ". 141200      
001043*                                                                 141400      
001044 01  TIT-DIF2.                                                    141600      
001045     03 FILLER                   PIC  X(18)  VALUE                141800      
001046                                 "FECHA    REAL   : ".            142000      
001047     03 TIT-LIN-2-DATE           PIC 99/99/9999.                  142200      
001048     03 FILLER                   PIC  X(22)  VALUE SPACE.         142400      
001049     03 FILLER                   PIC  X(34)  VALUE                142600      
001050        "  COMPENSACION CONTABLE NACIONAL  ".                     142800      
001051     03 FILLER                   PIC  X(29)  VALUE SPACE.         143000      
001052*JRC 03 FILLER                   PIC  X(09)  VALUE "VERSION: ".   143200      
001053*    03 TIT-LIN-2-VERSION        PIC  99/99/9999.                 143400      
001054*                                                                 143600      
001055 01  TIT-DIF3.                                                    143800      
001056     03 FILLER                   PIC  X(18)  VALUE                144000      
001057                                 "HORA     REAL   : ".            144200      
001058     03 TIT-LIN-3-TIME-HH        PIC 99.                          144400      
001059     03 FILLER                   PIC X VALUE ":".                 144420      
001060     03 TIT-LIN-3-TIME-MM        PIC 99.                          144440      
001061     03 FILLER                   PIC X VALUE ":".                 144460      
001062     03 TIT-LIN-3-TIME-SS        PIC 99.                          144480      
001063     03 FILLER                   PIC  X(11)  VALUE SPACE.         144600      
001064     03 FILLER                   PIC  X(40) VALUE                 144800      
001065        "MOVIMIENTOS  APLICADOS  Y/O  CONFIRMADOS".               145000      
001066     03 FILLER                   PIC  X(45) VALUE                 145200      
001067        "  CON  DIFERENCIAS                F.PROCESO: ".          145400      
001068*                                                                 145600      
001069 01  TIT-DIF3A.                                                   145800      
001070     03 FILLER                   PIC  X(18)  VALUE                146000      
001071                                 "HORA     REAL   : ".            146200      
001072     03 TIT-DIF3A-TIME-HH        PIC 99.                          146400      
001073     03 FILLER                   PIC X VALUE ":".                 146420      
001074     03 TIT-DIF3A-TIME-MM        PIC 99.                          146450      
001075     03 FILLER                   PIC X VALUE ":".                 146470      
001076     03 TIT-DIF3A-TIME-SS        PIC 99.                          146500      
001077     03 FILLER                   PIC  X(11)  VALUE SPACE.         146600      
001078     03 FILLER                   PIC  X(40) VALUE                 146800      
001079        "MOVIMIENTOS  APLICADOS  Y/O  CONFIRMADOS".               147000      
001080     03 FILLER                   PIC  X(45) VALUE                 147200      
001081        "  CON  DIFERENCIAS".                                     147400      
001082/                                                                 147600      
001083 01  TIT-DIF4.                                                    147800      
001084     03 FILLES                   PIC  X(48)  VALUE SPACES.        148000      
001085     03 FILLER                   PIC  X(22)  VALUE                148200      
001086                                 "FECHA DE MOVIMIENTOS:".         148400      
001087     03 TIT-FEC-DATOS            PIC 99/99/9999.                  148600      
001088     03 FILLER                   PIC  X(12) VALUE SPACES.         148800      
001089*                                                                 149000      
001090 01 TIT-DIF6.                                                     149200      
001091    03 FILLER                    PIC X(35) VALUE                  149400      
001092              "CENTRO DE SERVICIO DE INFORMACION: ".              149600      
001093*                                                                 149800      
001094 01 TIT-DIF7.                                                     150000      
001095    03 FILLER                    PIC X(10) VALUE SPACES.          150200      
001096    03 FILLER                    PIC X(10) VALUE "SUCURSAL: ".    150400      
001097*                                                                 150600      
001098 01  TIT-NO-DIFER.                                                150800      
001099     03 FILLER                   PIC  X(52) VALUE                 151000      
001100       "NO EXISTIERON DIFERENCIAS  NO EXISTIERON DIFERENCIAS".    151200      
001101*                                                                 151400      
001102 01  TIT-DIF8.                                                    151600      
001103     03 FILLER                   PIC  X(40)  VALUE                151800      
001104       "DES  SUC-CAJA  CLAVE-AUTORIZACION  CVE  ".                152000      
001105     03 FILLER                   PIC  X(52)  VALUE                152200      
001106       "  SUC/CUENTA DESTINO   HORA       C A R G O        ".     152400      
001107     03 FILLER                   PIC  X(40)  VALUE                152600      
001108       "      A B O N O         TIPO DIFERENCIA ".                152800      
001109*                                                                 153000      
001110 01  TIT-DIF9.                                                    153200      
001111     03 FILLER                   PIC  X(40)  VALUE                153400      
001112       "--- --------- -------------------- --- -".                153600      
001113     03 FILLER                   PIC  X(52)  VALUE                153800      
001114       "--------------------- ----- ---------------------   ".    154000      
001115     03 FILLER                   PIC  X(40)  VALUE                154200      
001116       "---------------------   ----------------".                154400      
001117/                                                                 154600      
001118 01 TIT-DIF20.                                                    154800      
001119     03 FILLER                   PIC  X(12)  VALUE ">>> MONEDA: ".155000      
001120*                                                                 155200      
001121 01 TIT-DIF21.                                                    155400      
001122     03 FILLER                   PIC  X(10)  VALUE ">> FECHA: ".  155600      
001123*                                                                 155800      
001124 01 TIT-DIF10.                                                    156000      
001125     03 FILLER                   PIC  X(10)  VALUE "> SISTEMA:".  156200      
001126*                                                                 156400      
001127 01 TIT-DIF11.                                                    156600      
001128     03 FILLER                   PIC  X(20)  VALUE SPACES.        156800      
001129     03 FILLER                   PIC  X(21)  VALUE                157000      
001130                                         "    > TOTAL SISTEMA  ". 157200      
001131*                                                                 157400      
001132 01 TIT-DIF12.                                                    157600      
001133     03 FILLER                   PIC  X(20)  VALUE SPACES.        157800      
001134     03 FILLER                   PIC  X(21)  VALUE                158000      
001135                                         " >>>> TOTAL C.S.I.   ". 158200      
001136*                                                                 158400      
001137 01 TIT-DIF13.                                                    158600      
001138     03 FILLER                   PIC  X(20)  VALUE SPACES.        158800      
001139     03 FILLER                   PIC  X(21)  VALUE                159000      
001140                                         "  >>> TOTAL MONEDA   ". 159200      
001141*                                                                 159400      
001142 01 TIT-DIF14.                                                    159600      
001143     03 FILLER                   PIC  X(20)  VALUE SPACES.        159800      
001144     03 FILLER                   PIC  X(21)  VALUE                160000      
001145                                         " >>>> TOTAL SUCURSAL ". 160200      
001146*                                                                 160400      
001147 01 TIT-DIF18.                                                    160600      
001148     03 FILLER                   PIC  X(20)  VALUE SPACES.        160800      
001149     03 FILLER                   PIC  X(21)  VALUE                161000      
001150                                         "   >> TOTAL FECHA    ". 161200      
001151*                                                                 161400      
001152 01 TIT-DIF19.                                                    161600      
001153     03 FILLER                   PIC  X(20)  VALUE SPACES.        161800      
001154     03 FILLER                   PIC  X(21)  VALUE                162000      
001155                                         ">>>>> TOTAL GENERAL  ". 162200      
001156*                                                                 162400      
001157 01 TIT-DIF15.                                                    162600      
001158     03 FILLER                   PIC  X(15)  VALUE SPACES.        162800      
001159     03 FILLER                   PIC  X(12)  VALUE "CTA-ACCESO: ".163000      
001160*                                                                 163200      
001161 01 TIT-DIF16.                                                    163400      
001162     03 FILLER                   PIC  X(08)  VALUE "   REF: ".    163600      
001163*                                                                 163800      
001164 01 TIT-DIF17.                                                    164000      
001165     03 FILLER                   PIC  X(12)  VALUE "   CVE-MOV: ".164200      
001166*                                                                 164210      
001167 01 TIT-DIF22.                                                    164220      
001168    03 FILLER                   PIC  X(33)  VALUE                 164230      
001169     "CIFRAS EXPRESADAS EN PESOS".                                164240      
001170*                                                                 164250      
001171* >>> ESTANDAR NOMBRE DE REPORTES >>> SEPARACION POR NODO/SUBNODO 164252      
001172*                                                                 164254      
001173 01  WS-NOMB-REPORTE.                                             164256      
001174     03 FILLER                    PIC X(15) VALUE                 164258      
001175                                   "S151/LIST/P117/".             164260      
001176     03 WS-RM-NODO                PIC 9(02) VALUE ZEROS.          164262      
001177     03 WS-RM-SUBNODO             PIC 9(02) VALUE ZEROS.          164264      
001178     03 FILLER                    PIC X(01) VALUE "/".            164266      
001179     03 WS-RM-TIPO                PIC X(01) VALUE "R".            164268      
001180     03 FILLER                    PIC X(04) VALUE "000/".         164270      
001181     03 WS-RM-AAMMDD              PIC 9(06).                      164272      
001182     03 WS-RM-AAMMDD-R            REDEFINES WS-RM-AAMMDD.         164274      
001183        05 WS-RM-AA               PIC 9(02).                      164276      
001184        05 WS-RM-MM               PIC 9(02).                      164278      
001185        05 WS-RM-DD               PIC 9(02).                      164280      
001186     03 FILLER                    PIC X(01) VALUE "/".            164282      
001187     03 WS-RM-MIX                 PIC 9(07) VALUE ZEROS.          164284      
001188     03 FILLER                    PIC X(01) VALUE "/".            164286      
001189     03 WS-RM-SEQ                 PIC 9(03) VALUE ZEROS.          164288      
001190      03 FILLER                    PIC X(04) VALUE "P117".        164290      
001191     03 WS-RM-DESC                PIC X(10) VALUE SPACES.         164292      
001192     03 FILLER                    PIC X(01) VALUE ".".            164294      
001193 01  APUNTADORES-WS               COMP .                          164314      
001194     02  PTER-CSI-WS              PIC 9(02).                      164316      
001195         88 PTER-CSIOK            VALUES ARE 2,4,10,32.           164318      
001196         88 PTER-CSI-CORP         VALUES ARE 10.                  164320      
001197         88 PTER-CSI-TANDEM       VALUES ARE 02.                  164322      
001198         88 PTER-CSI-ICA          VALUES ARE 2,4,10.              164324      
001199     02  WS-CSI-TANDEM            PIC 9(02) VALUE 02.             164326      
001200     02  PTER-LOG-WS              PIC 9(02).                      164328      
001201     02  PTER-SIST-WS             PIC 9(02).                      164330      
001202     02  WS-AP-OPER-APL           PIC 9(02).                      164332      
001203     02  PTER-CORTE-WS            PIC 9(02).                      164334      
001204     02  PTER-1-CSI-WS            PIC 9(02).                      164336      
001205         88 CSI-1-VALIDO          VALUES ARE 2,4,10.              164338      
001206     02  PTER-2-CSI-WS            PIC 9(02).                      164340      
001207         88 CSI-2-VALIDO          VALUES ARE 2,4,10.              164342      
001208*                                                                 164408      
001209     02  FECHA-PROCESO-WS       PIC 9(08).                        164409      
001210     02  FECHA-PROCESO-WS-R     REDEFINES FECHA-PROCESO-WS.       164410      
001211         03 FPROCESO-AA         PIC  9999.                        164411      
001212         03 FPROCESO-MM         PIC  99.                          164412      
001213         03 FPROCESO-DD         PIC  99.                          164413      
001214*                                                                 164414      
001215     02  WS-FECHA-PROCESO       PIC 9(08).                        164415      
001216     02  WS-FECHA-PROCESO-R     REDEFINES WS-FECHA-PROCESO.       164416      
001217         03 WPROCESO-DD         PIC  99.                          164417      
001218         03 WPROCESO-MM         PIC  99.                          164418      
001219         03 WPROCESO-AA         PIC  9999.                        164419      
001220                                                                  164420      
001221 77 W77-FECHA-PROC                PIC 9(08).                      164421      
001222 77 W77-STATUS                    PIC  9(04).                     164422      
001223 77 W77-VALUE                     PIC  9(08).                     164423      
001224                                                                  164424      
001225 01  WKS-CTLVERS-LIBRERIA            PIC X(12).                   164425      
001226 01  WKS-CTLVERS-TITULO              PIC X(72).                   164426      
001227 01  WKS-CTLVERS-STATUS              PIC S9(11) BINARY.           164427      
001228                                                                  164428      
001229 77  W77-JUL-YY4                       PIC 9(04).                 164429      
001230 01  WKS-DATOS-HOST.                                              164430      
001231     03  WKS-NUMCSI                    PIC 9(02).                 164448      
001232     03  WKS-NOMEQUIPO                 PIC X(10).                 164468      
001233     03  WKS-NOMCSI                    PIC X(26).                 164488      
001234     03  WKS-LINEABATCH                PIC X(05).                 164508      
001235*                                                                 164528      
001236*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001237*  COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL".                  164548      
001238*================================================================ 000100      
001239*         ENTRY-POINT CONSISDIA :                               = 000200      
001240*                                                                 000300      
001241* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
001242* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
001243* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
001244* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
001245* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
001246* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
001247* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
001248* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
001249* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
001250* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
001251*                                                               = 001400      
001252*================================================================ 001500      
001253                                                                  001600      
001254                                                                  001700      
001255*================================================================ 001800      
001256* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
001257*                                                               = 002000      
001258* ENTRADA REQUERIDA :                                           = 002100      
001259*                                                               = 002200      
001260*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
001261*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
001262*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
001263*================================================================ 002600      
001264 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
001265    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
001266    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
001267    03 WKS-B01-CSI                 PIC 9(02).                     003000      
001268    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
001269    03 WKS-B01-FECCON              PIC 9(08).                     003202      
001270    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
001271    03 WKS-B01-STAREG              PIC 9(02).                     003400      
001272    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
001273    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
001274    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
001275    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
001276    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
001277    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
001278    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
001279    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
001280    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
001281    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
001282    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
001283    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
001284    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
001285       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
001286       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
001287       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
001288       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
001289*==============================================================   005200      
001290*                                                             =   005300      
001291* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
001292*                                                             =   005500      
001293* CAMPOS REQUERIDOS :                                         =   005600      
001294*                                                             =   005700      
001295* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
001296* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
001297* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
001298* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
001299*==============================================================   006200      
001300 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
001301    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
001302    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
001303    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
001304    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
001305                                                                  006800      
001306*==============================================================   006900      
001307*                                                             =   007000      
001308* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
001309*                                                             =   007200      
001310* CAMPOS REQUERIDOS :                                         =   007300      
001311*                                                             =   007400      
001312* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
001313* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
001314* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
001315* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
001316*==============================================================   007900      
001317 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
001318    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
001319    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
001320    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
001321    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
001322                                                                  008500      
001323*==============================================================   008600      
001324*                                                             =   008700      
001325* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
001326*                                                             =   008900      
001327* CAMPOS REQUERIDOS :                                         =   009000      
001328*                                                             =   009100      
001329* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
001330* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
001331* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
001332* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
001333*==============================================================   009600      
001334 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
001335    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
001336    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
001337    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
001338    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
001339                                                                  010200      
001340*============================================================     010300      
001341* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
001342*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
001343*                                                           =     010600      
001344*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
001345*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
001346*                                                           =     010900      
001347*  ENTRADA REQUERIDA.                                       =     011000      
001348*                                                           =     011100      
001349*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
001350*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
001351*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
001352*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
001353*============================================================     011600      
001354                                                                  011700      
001355 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
001356     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
001357     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
001358     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
001359     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
001360                                                                  012300      
001361*=============================================================    012400      
001362*                                                            =    012500      
001363* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
001364*             B01-SIS-FECARMOV.                              =    012700      
001365*                                                            =    012800      
001366* ENTRADA REQUERIDAD :                                       =    012900      
001367*                                                            =    013000      
001368*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
001369*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
001370*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
001371*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
001372*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
001373*=============================================================    013600      
001374                                                                  013700      
001375 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
001376     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
001377     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
001378     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
001379     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
001380     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
001381*================================================================ 014400      
001382*                                                               = 014500      
001383* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
001384*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
001385*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
001386*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
001387*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
001388*                                                               = 015100      
001389* ENTRADA REQUERIDA :                                           = 015200      
001390*                                                               = 015300      
001391* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
001392* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
001393* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
001394* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
001395* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
001396*================================================================ 015900      
001397 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
001398    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
001399    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
001400    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
001401    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
001402    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
001403                                                                  016600      
001404*============================================================     016700      
001405*                                                           =     016800      
001406* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
001407*                                                           =     017000      
001408* DATOS REQUERIDOS :                                        =     017100      
001409*                                                           =     017200      
001410* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
001411* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
001412* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
001413* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
001414* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
001415*============================================================     017800      
001416                                                                  017900      
001417 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
001418     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
001419     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
001420     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
001421     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
001422     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
001423                                                                  018600      
001424*============================================================     018700      
001425*                                                           =     018800      
001426* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
001427*                                                           =     019000      
001428* DATOS REQUERIDOS :                                        =     019100      
001429*                                                           =     019200      
001430* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
001431* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
001432* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
001433* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
001434* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
001435*============================================================     019800      
001436                                                                  019900      
001437 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
001438     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
001439     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
001440     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
001441     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
001442     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
001443                                                                  020600      
001444*===============================================================  020700      
001445*                                                              =  020800      
001446* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
001447*              MOVIMIENTOS.                                    =  021000      
001448* DATOS REQUERIDOS :                                           =  021100      
001449*                                                              =  021200      
001450* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
001451* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
001452* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
001453* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
001454* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
001455* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
001456*==============================================================   021900      
001457                                                                  022000      
001458 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
001459     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
001460     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
001461     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
001462     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
001463     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
001464     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
001465*==============================================================   022800      
001466*                                                             =   022900      
001467* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
001468*                                                             =   023100      
001469* CAMPOS REQUERIDOS :                                         =   023200      
001470*                                                             =   023300      
001471* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
001472* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
001473* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
001474* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
001475*==============================================================   023800      
001476 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
001477    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
001478    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
001479    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
001480    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
001481                                                                  024304      
001482*=================================================================024306      
001483*                ENTRY POINT CONSISB01                           =024308      
001484*                                                                =024310      
001485*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
001486*                                                                =024314      
001487*  FUNCIONES DISPONIBLES :                                       =024316      
001488*                                                                =024318      
001489*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
001490*                                                                =024322      
001491*  PARAMETROS REQUERIDOS                                         =024324      
001492*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
001493*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
001494*=================================================================024330      
001495                                                                  024332      
001496 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
001497     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
001498     03 WKS-CON-CSI                PIC 9(02).                     024336      
001499     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
001500     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
001501        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
001502        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
001503        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
001504        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
001505        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
001506                                                                  024400      
001507*=================================================================024500      
001508*                ENTRY POINT B02ARCINTER                         =024600      
001509*                                                                =024700      
001510*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
001511*                                                                =024900      
001512*  FUNCIONES DISPONIBLES :                                       =025000      
001513*                                                                =025100      
001514*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
001515* 19.- ALTAS DE ARCHIVOS.                                        =025300      
001516* 22.- BAJAS DE ARCHIVOS.                                        =025400      
001517* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
001518*                                                                =025600      
001519*  PARAMETROS REQUERIDOS                                         =025700      
001520*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
001521*                                                                =025900      
001522*=================================================================026000      
001523 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
001524     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
001525     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
001526     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
001527     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
001528     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
001529     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
001530     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
001531     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
001532     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
001533     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
001534     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
001535     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
001536     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
001537     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
001538     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
001539     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
001540     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
001541     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
001542     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
001543     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
001544     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
001545     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
001546     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
001547     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
001548     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
001549     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
001550     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
001551     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
001552                                                                  029000      
001553*=================================================================029100      
001554*                ENTRY POINT B04SISTEMA                          =029200      
001555*                                                                =029300      
001556*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
001557*                                                                =029500      
001558*  FUNCIONES DISPONIBLES :                                       =029600      
001559*                                                                =029700      
001560*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
001561*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
001562*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
001563*                                                                =030100      
001564*  PARAMETROS REQUERIDOS                                         =030200      
001565*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
001566*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
001567*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
001568*                                                                =030600      
001569*=================================================================030700      
001570 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
001571     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
001572     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
001573     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
001574     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
001575     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
001576     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
001577     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
001578                                                                  031600      
001579*================================================================ 031700      
001580*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
001581*                                                               = 031900      
001582*  FUNCION                                                      = 032000      
001583*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
001584*   19       ALTAS.                                             = 032200      
001585*   22       BAJAS                                              = 032300      
001586*   37       CAMBIOS.                                           = 032400      
001587*                                                               = 032500      
001588*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
001589*                      FECHA DE PROCESO                         = 032700      
001590*                      NUMERO DE PROCESO                        = 032800      
001591*                      FECHA INICIO                             = 032900      
001592*                      REGISTRO INICIAL                         = 033000      
001593*================================================================ 033100      
001594                                                                  033200      
001595 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
001596     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
001597     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
001598     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
001599     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
001600     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
001601     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
001602     03 WKS-B05-MIX                PIC 9(08).                     034000      
001603     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
001604     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
001605     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
001606     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
001607     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
001608     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
001609                                                                  034700      
001610                                                                  034800      
001611*================================================================ 034900      
001612*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
001613*                                                               = 035100      
001614*  FUNCION                                                      = 035200      
001615*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
001616*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
001617*                                                               = 035500      
001618*================================================================ 035600      
001619                                                                  035700      
001620 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
001621     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
001622     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
001623     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
001624     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
001625     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
001626     03 WKS-B09-NOMREN             PIC X(15).                     036400      
001627                                                                  036500      
001628*===============================================================  036600      
001629*                                                              =  036700      
001630*         ENTRY-POINT CONSISMEN                                =  036800      
001631*                                                              =  036900      
001632*   DATOS REQUERIDOS : FUNCION                                 =  037000      
001633*                      SISTEMA                                 =  037100      
001634*                                                              =  037200      
001635*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
001636*                                                              =  037400      
001637*===============================================================  037500      
001638 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
001639     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
001640     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
001641     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
001642     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
001643     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
001644     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
001645     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
001646     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
001647     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
001648     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
001649     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
001650     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
001651     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
001652     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
001653     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
001654        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
001655        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
001656        05 WKS-B03-AAMM            PIC 9(06).                     039402      
001657        05 WKS-B03-SECOK           PIC 9(10).                     039500      
001658        05 WKS-B03-SECINF          PIC 9(10).                     039600      
001659        05 WKS-B03-SECERR          PIC 9(10).                     039700      
001660        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
001661                                                                  039900      
001662*=====================================================            040000      
001663*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
001664*=====================================================            040200      
001665 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
001666     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
001667     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
001668     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
001669                                                                  040700      
001670*=====================================================            040800      
001671*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
001672*=====================================================            041000      
001673 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
001674     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
001675     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
001676     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
001677                                                                  041500      
001678*=====================================================            041600      
001679*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
001680*=====================================================            041800      
001681 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
001682     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
001683     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
001684     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
001685*=====================================================            042300      
001686*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
001687*=====================================================            042500      
001688 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
001689     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
001690     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
001691     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
001692                                                                  043000      
001693*=====================================================            043100      
001694*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
001695*=====================================================            043300      
001696 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
001697     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
001698     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
001699     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
001700                                                                  043800      
001701*=====================================================            043900      
001702*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
001703*=====================================================            044100      
001704 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
001705     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
001706     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
001707     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
001708                                                                  044600      
001709*=====================================================            044700      
001710*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
001711*=====================================================            044900      
001712 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
001713     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
001714     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
001715     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
001716                                                                  045400      
001717*=====================================================            045500      
001718*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
001719*=====================================================            045700      
001720 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
001721     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
001722     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
001723     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
001724                                                                  046200      
001725*=====================================================            046300      
001726*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
001727*=====================================================            046500      
001728 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
001729     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
001730     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
001731     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
001732                                                                  047000      
001733*=====================================================            047100      
001734*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
001735*=====================================================            047300      
001736 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
001737     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
001738     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
001739     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001740                                                                  047800      
001741*=====================================================            047900      
001742*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001743*=====================================================            048100      
001744 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001745     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001746     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001747     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001748                                                                  048600      
001749*=====================================================            048700      
001750*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001751*=====================================================            048900      
001752 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001753     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001754     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001755     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001756                                                                  049400      
001757*=====================================================            049500      
001758*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001759*=====================================================            049700      
001760 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001761     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001762     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001763     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001764     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001765     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001766     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001767     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001768     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001769     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001770     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001771                                                                  050900      
001772*=====================================================            051000      
001773*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001774*=====================================================            051200      
001775 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001776     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001777     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001778     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001779     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001780                                                                  051800      
001781*=====================================================            051900      
001782*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001783*=====================================================            052100      
001784 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001785     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001786     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001787     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001788     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001789                                                                  052700      
001790*=====================================================            052800      
001791*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001792*=====================================================            053000      
001793 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001794     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001795     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001796     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001797     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001798                                                                  053600      
001799*=====================================================            053700      
001800*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001801*=====================================================            053900      
001802 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001803     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001804     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001805     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001806     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001807                                                                  054500      
001808*=====================================================            054600      
001809*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001810*=====================================================            054800      
001811 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001812     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001813     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001814     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001815     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001816                                                                  055400      
001817*=====================================================            055500      
001818*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001819*=====================================================            055700      
001820 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001821     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001822     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001823     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001824     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001825                                                                  056300      
001826*=====================================================            056400      
001827*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001828*=====================================================            056600      
001829 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001830     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001831     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001832     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001833     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001834                                                                  057200      
001835 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001836*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001837*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001838*  COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".          164568      
001839**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
001840  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
001841  01 MENSAJE-LJ.                                                  100300      
001842     02 SISTEMA-LJ     PIC X(04).                                 100400      
001843     02 FILLER         PIC X VALUE "/".                           100500      
001844     02 PASO-LJ        PIC X(04).                                 100600      
001845     02 FILLER         PIC X VALUE "/".                           100700      
001846     02 MTP-LJ         PIC 9(03).                                 100800      
001847     02 FILLER         PIC X VALUE ":".                           100900      
001848     02 TIPO-LJ        PIC X.                                     101000      
001849     02 FILLER         PIC X VALUE ">".                           101100      
001850     02 CODIGO-LJ      PIC 9(06).                                 101200      
001851     02 FILLER         PIC X VALUE "<".                           101300      
001852     02 TEXTO-LJ       PIC X(250).                                101400      
001853*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001854/                                                                 164598      
001855******************************************************************164600      
001856 REPORT SECTION.                                                  164800      
001857 RD  REP-DIFERENCIA CONTROLS ARE FINAL W-CAMBIO W-DESTINO         165000      
001858     PAGE  LIMIT  62      LINES HEADING  1                        165200      
001859     FIRST DETAIL 10      LAST  DETAIL  62      FOOTING 62.       165400      
001860*                                                                 165600      
001861 01                      TYPE IS PAGE    HEADING.                 165800      
001862    03  LINE 01.                                                  166000      
001863        05 COLUMN 01  PIC  X(126)     SOURCE IS TIT-DIF1.         166200      
001864        05 COLUMN 127 PIC  Z(5)       SOURCE IS PAGE-COUNTER.     166400      
001865    03  LINE 02.                                                  166600      
001866        05 COLUMN 01  PIC  X(132)     SOURCE IS TIT-DIF2.         166800      
001867    03  LINE 03.                                                  167000      
001868        05 COLUMN 01  PIC  X(122)     SOURCE IS TIT-DIF3.         167200      
001869        05 COLUMN 123 PIC  99/99/9999 SOURCE IS WS-FECHA-DMA.     167400      
001870    03  LINE 05.                                                  167600      
001871        05 COLUMN 01  PIC  X(35)      SOURCE IS TIT-DIF6.         167800      
001872        05 COLUMN 36  PIC  X(15)      SOURCE IS                   168000      
001873                                      NOMBRE-CCR(W-CSI-ORI).      168200      
001874        05 COLUMN 51  PIC  X(1)       VALUE  SPACES.              168400      
001875        05 COLUMN 96  PIC  X(33)      SOURCE IS TIT-DIF22.        168500      
001876    03  LINE 07.                                                  168600      
001877        05 COLUMN 01  PIC  X(132)     SOURCE IS TIT-DIF8.         168800      
001878    03  LINE 08.                                                  169000      
001879        05 COLUMN 01  PIC  X(132)     SOURCE IS TIT-DIF9.         169200      
001880*                                                                 169400      
001881 01 DET-DIF-VACIO        TYPE IS DETAIL.                          169600      
001882    03 LINE PLUS 3.                                               169800      
001883       05 COLUMN  40 PIC X(52)        SOURCE IS TIT-NO-DIFER.     170000      
001884/                                                                 170200      
001885 01 DET-DIFER            TYPE IS DETAIL.                          170400      
001886    03 LINE PLUS 1.                                               170600      
001887       05 COLUMN 01  PIC X(3)         SOURCE IS                   170800      
001888                                      ABR-CSI-TC(WS-RDI-CSI-DES). 171000      
001889       05 COLUMN 05  PIC X(1)         SOURCE IS WS-STANAME-DISP.  171200      
001890       05 COLUMN 06  PIC Z(3)9        SOURCE IS WS-STANAME-SUC.   171400      
001891       05 COLUMN 11  PIC X(3)         SOURCE IS WS-STANAME-CAJA.  171600      
001892       05 COLUMN 15  PIC X(20)        SOURCE IS WS-RDI-CVE-AUT.   171800      
001893       05 COLUMN 36  PIC Z9           SOURCE IS WS-RDI-COD-SER.   172000      
001894       05 COLUMN 40  PIC Z(12)9       SOURCE IS WS-PARTE-SUC.     172200      
001895       05 COLUMN 54  PIC ZZZZZ99      SOURCE IS WS-PARTE-CTA.     172400      
001896       05 COLUMN 64  PIC 9999         SOURCE IS                   172600      
001897                                      WS-RDI-HOR-GEN-HHMM.        172800      
001898       05 COLUMN 70  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    173000      
001899                                      SOURCE IS WS-CARGOS.        173200      
001900       05 COLUMN 91  PIC X(02)        SOURCE IS CVE-DRCR-1.       173400      
001901       05 COLUMN 94  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    173600      
001902                                      SOURCE IS WS-ABONOS.        173800      
001903       05 COLUMN 115 PIC X(02)        SOURCE IS CVE-DRCR-2.       174000      
001904       05 COLUMN 118 PIC X(16)        SOURCE IS TAB-TEXTO(IND-OP).174200      
001905*                                                                 174400      
001906    03 LINE PLUS 1.                                               174600      
001907       05 COLUMN 01  PIC X(27)        SOURCE IS TIT-DIF15.        174800      
001908       05 COLUMN 28  PIC X(20)        SOURCE IS WS-RDI-CTA-ACC.   175000      
001909       05 COLUMN 48  PIC X(08)        SOURCE IS TIT-DIF16.        175200      
001910       05 COLUMN 56  PIC X(20)        SOURCE IS WS-RDI-REF-OPE.   175400      
001911       05 COLUMN 76  PIC X(12)        SOURCE IS TIT-DIF17.        175600      
001912       05 COLUMN 88  PIC X(03)        SOURCE IS WS-RDI-SUB-SER.   175800      
001913 01                      TYPE IS CONTROL FOOTING W-DESTINO.       176000      
001914    03 LINE PLUS 1.                                               176200      
001915       05 COLUMN 01  PIC  X(20)       SOURCE IS WS-SPACE.         176400      
001916/                                                                 176600      
001917 01 TOT-GRAL             TYPE IS DETAIL.                          176800      
001918    03 LINE PLUS 2.                                               177000      
001919       05 COLUMN 01  PIC  X(41)       SOURCE IS TIT-DIF19.        177200      
001920       05 COLUMN 69  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    177400      
001921                                      SOURCE IS WS-CARGOS.        177600      
001922       05 COLUMN 93  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    177800      
001923                                      SOURCE IS WS-ABONOS.        178000      
001924*                                                                 178200      
001925 01 TOT-FEC              TYPE IS DETAIL.                          178400      
001926    03 LINE PLUS 2.                                               178600      
001927       05 COLUMN 01  PIC  X(41)       SOURCE IS TIT-DIF18.        178800      
001928       05 COLUMN 42  PIC  9999/99/99  SOURCE IS WS-FEC-CON.       179000      
001929       05 COLUMN 69  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    179200      
001930                                      SOURCE IS WS-CARGOS.        179400      
001931       05 COLUMN 93  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    179600      
001932                                      SOURCE IS WS-ABONOS.        179800      
001933*                                                                 180000      
001934 01 TOT-MON              TYPE IS DETAIL.                          180200      
001935    03 LINE PLUS 2.                                               180400      
001936       05 COLUMN 01  PIC  X(41)       SOURCE IS TIT-DIF13.        180600      
001937       05 COLUMN 42  PIC  ZZ9         SOURCE IS WS-MONEDA.        180800      
001938       05 COLUMN 69  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    181000      
001939                                      SOURCE IS WS-CARGOS.        181200      
001940       05 COLUMN 93  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    181400      
001941                                      SOURCE IS WS-ABONOS.        181600      
001942*                                                                 181800      
001943 01 TOT-CSI              TYPE IS DETAIL.                          182000      
001944    03 LINE PLUS 2.                                               182200      
001945       05 COLUMN 01  PIC  X(41)       SOURCE IS TIT-DIF12.        182400      
001946       05 COLUMN 42  PIC  X(15)       SOURCE IS                   182600      
001947                                      NOMBRE-CCR(WS-CSI-ORI).     182800      
001948       05 COLUMN 69  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    183000      
001949                                      SOURCE IS WS-CARGOS.        183200      
001950       05 COLUMN 93  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    183400      
001951                                      SOURCE IS WS-ABONOS.        183600      
001952/                                                                 183800      
001953 01 SALDO                TYPE IS DETAIL.                          184000      
001954    03 LINE PLUS 1.                                               184200      
001955       05 COLUMN 69  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    184400      
001956                                      SOURCE IS WS-CARGOS.        184600      
001957       05 COLUMN 93  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    184800      
001958                                      SOURCE IS WS-ABONOS.        185000      
001959*                                                                 185200      
001960 01 TOT-SISTEMA          TYPE IS DETAIL.                          185400      
001961    03 LINE PLUS 2.                                               185600      
001962       05 COLUMN 01  PIC  X(41)       SOURCE IS TIT-DIF11.        185800      
001963       05 COLUMN 42  PIC  X(14)       SOURCE IS WS-SISTEMA-LG.    186000      
001964       05 COLUMN 69  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    186200      
001965                                      SOURCE IS WS-CARGOS.        186400      
001966       05 COLUMN 93  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    186600      
001967                                      SOURCE IS WS-ABONOS.        186800      
001968*                                                                 187000      
001969 01 DET-MONEDA           TYPE IS DETAIL.                          187200      
001970    03 LINE PLUS 1.                                               187400      
001971       05 COLUMN 01  PIC  X(12)       SOURCE IS TIT-DIF20.        187600      
001972       05 COLUMN 14  PIC  ZZ9         SOURCE IS W-MONEDA.         187800      
001973*                                                                 188000      
001974 01 DET-FECHA            TYPE IS DETAIL.                          188200      
001975    03 LINE PLUS 1.                                               188400      
001976       05 COLUMN 06  PIC  X(10)       SOURCE IS TIT-DIF21.        188600      
001977       05 COLUMN 17  PIC  9999/99/99  SOURCE IS W-FEC-CON.        188800      
001978*                                                                 189000      
001979 01 DET-SISTEMA          TYPE IS DETAIL.                          189200      
001980    03 LINE PLUS 1.                                               189400      
001981       05 COLUMN 11  PIC  X(10)       SOURCE IS TIT-DIF10.        189600      
001982       05 COLUMN 22  PIC  X(14)       SOURCE IS WS-SISTEMA-LG.    189800      
001983*                                                                 190000      
001984 01 NEXT GROUP NEXT PAGE TYPE IS CONTROL FOOTING W-CAMBIO.        190200      
001985    03 LINE PLUS 1.                                               190400      
001986       05 COLUMN 01  PIC  X(20)       SOURCE IS WS-SPACE.         190600      
001987***********************************************************       190800      
001988/**********************************************************       191000      
001989 RD  REP-INICSUC    CONTROLS ARE FINAL W-CAMBIO WS-SUC            191200      
001990     PAGE  LIMIT  62 LINES               HEADING  1               191400      
001991     FIRST DETAIL 10 LAST DETAIL 62      FOOTING 62.              191600      
001992*                                                                 191800      
001993 01                      TYPE IS PAGE    HEADING.                 192000      
001994    03  LINE 01.                                                  192200      
001995        05 COLUMN 01  PIC  X(126)     SOURCE IS TIT-DIF1A.        192400      
001996        05 COLUMN 127 PIC  Z(5)       SOURCE IS PAGE-COUNTER.     192600      
001997    03  LINE 02.                                                  192800      
001998        05 COLUMN 01  PIC  X(132)     SOURCE IS TIT-DIF2.         193000      
001999    03  LINE 03.                                                  193200      
002000        05 COLUMN 01  PIC  X(122)     SOURCE IS TIT-DIF3.         193400      
002001        05 COLUMN 123 PIC  99/99/9999 SOURCE IS WS-FECHA-DMA.     193600      
002002    03  LINE 05.                                                  193800      
002003        05 COLUMN 01  PIC  X(35)      SOURCE IS TIT-DIF6.         194000      
002004        05 COLUMN 36  PIC  X(15)      SOURCE IS                   194200      
002005                                      NOMBRE-CCR(WS-CSI-ORI).     194400      
002006        05 COLUMN 51  PIC  X(20)      SOURCE IS TIT-DIF7.         194600      
002007        05 COLUMN 71  PIC  Z(04)      SOURCE IS WS-SUC.           194800      
002008        05 COLUMN 80  PIC  X(14)      SOURCE IS TIPOSUC(WS-TREP). 195000      
002009        05 COLUMN 96  PIC  X(33)      SOURCE IS TIT-DIF22.        195100      
002010    03  LINE 07.                                                  195200      
002011        05 COLUMN 01  PIC  X(132)     SOURCE IS TIT-DIF8.         195400      
002012    03  LINE 08.                                                  195600      
002013        05 COLUMN 01  PIC  X(132)     SOURCE IS TIT-DIF9.         195800      
002014*                                                                 196000      
002015/                                                                 196200      
002016 01 DET-DIFER-1          TYPE IS DETAIL.                          196400      
002017    03 LINE PLUS 1.                                               196600      
002018       05 COLUMN 01  PIC X(3)         SOURCE IS                   196800      
002019                                      ABR-CSI-TC(WS-RDI-CSI-DES). 197000      
002020       05 COLUMN 05  PIC X(1)         SOURCE IS WS-STANAME-DISP.  197200      
002021       05 COLUMN 06  PIC Z(3)9        SOURCE IS WS-STANAME-SUC.   197400      
002022       05 COLUMN 11  PIC X(3)         SOURCE IS WS-STANAME-CAJA.  197600      
002023       05 COLUMN 15  PIC X(20)        SOURCE IS WS-RDI-CVE-AUT.   197800      
002024       05 COLUMN 36  PIC Z9           SOURCE IS WS-RDI-COD-SER.   198000      
002025       05 COLUMN 40  PIC Z(12)9       SOURCE IS WS-PARTE-SUC.     198200      
002026       05 COLUMN 54  PIC ZZZZZ99      SOURCE IS WS-PARTE-CTA.     198400      
002027       05 COLUMN 63  PIC 9999         SOURCE IS                   198600      
002028                                      WS-RDI-HOR-GEN-HHMM.        198800      
002029       05 COLUMN 70  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    199000      
002030                                      SOURCE IS WS-CARGOS.        199200      
002031       05 COLUMN 91  PIC X(02)        SOURCE IS CVE-DRCR-1.       199400      
002032       05 COLUMN 94  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    199600      
002033                                      SOURCE IS WS-ABONOS.        199800      
002034       05 COLUMN 115 PIC X(02)        SOURCE IS CVE-DRCR-2.       200000      
002035       05 COLUMN 118 PIC X(16)        SOURCE IS TAB-TEXTO(IND-OP).200200      
002036*                                                                 200400      
002037 01 TOT-CSI-1            TYPE IS DETAIL.                          200600      
002038    03 LINE PLUS 2.                                               200800      
002039       05 COLUMN 01  PIC  X(41)       SOURCE IS TIT-DIF12.        201000      
002040       05 COLUMN 42  PIC  X(15)       SOURCE IS                   201200      
002041                                      NOMBRE-CCR(WS-CSI-ORI).     201400      
002042       05 COLUMN 69  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    201600      
002043                                      SOURCE IS WS-CARGOS.        201800      
002044       05 COLUMN 93  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    202000      
002045                                      SOURCE IS WS-ABONOS.        202200      
002046/                                                                 202400      
002047 01 SALDO-1              TYPE IS DETAIL.                          202600      
002048    03 LINE PLUS 1.                                               202800      
002049       05 COLUMN 69  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    203000      
002050                                      SOURCE IS WS-CARGOS.        203200      
002051       05 COLUMN 93  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    203400      
002052                                      SOURCE IS WS-ABONOS.        203600      
002053*                                                                 203800      
002054 01 TOT-SISTEMA-1        TYPE IS DETAIL.                          204000      
002055    03 LINE PLUS 2.                                               204200      
002056       05 COLUMN 01  PIC  X(41)       SOURCE IS TIT-DIF11.        204400      
002057       05 COLUMN 42  PIC  X(14)       SOURCE IS WS-SISTEMA-LG.    204600      
002058       05 COLUMN 69  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    204800      
002059                                      SOURCE IS WS-CARGOS.        205000      
002060       05 COLUMN 93  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    205200      
002061                                      SOURCE IS WS-ABONOS.        205400      
002062       05 COLUMN 117 PIC  X(07)       SOURCE IS WS-SISTEMA-CR.    205600      
002063*                                                                 205800      
002064 01 TOT-MONEDA-1         TYPE IS DETAIL.                          206000      
002065    03 LINE PLUS 2.                                               206200      
002066       05 COLUMN 01  PIC  X(41)       SOURCE IS TIT-DIF13.        206400      
002067       05 COLUMN 42  PIC  ZZ9         SOURCE IS WS-MONEDA.        206600      
002068       05 COLUMN 69  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    206800      
002069                                      SOURCE IS WS-CARGOS.        207000      
002070       05 COLUMN 93  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    207200      
002071                                      SOURCE IS WS-ABONOS.        207400      
002072*                                                                 207600      
002073 01 TOT-FECHA-1          TYPE IS DETAIL.                          207800      
002074    03 LINE PLUS 2.                                               208000      
002075       05 COLUMN 01  PIC  X(41)       SOURCE IS TIT-DIF18.        208200      
002076       05 COLUMN 42  PIC  9999/99/99  SOURCE IS WS-FEC-CON.       208400      
002077       05 COLUMN 69  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    208600      
002078                                      SOURCE IS WS-CARGOS.        208800      
002079       05 COLUMN 93  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    209000      
002080                                      SOURCE IS WS-ABONOS.        209200      
002081*                                                                 209400      
002082 01 TOT-SUCURSAL-1       TYPE IS DETAIL.                          209600      
002083    03 LINE PLUS 2.                                               209800      
002084       05 COLUMN 01  PIC  X(41)       SOURCE IS TIT-DIF14.        210000      
002085       05 COLUMN 42  PIC  ZZZ9        SOURCE IS WS-SUC.           210200      
002086       05 COLUMN 47  PIC  X(14)       SOURCE IS TIPOSUC(WS-TREP). 210400      
002087       05 COLUMN 69  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    210600      
002088                                      SOURCE IS WS-CARGOS.        210800      
002089       05 COLUMN 93  PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ                    211000      
002090                                      SOURCE IS WS-ABONOS.        211200      
002091/                                                                 211400      
002092 01 DET-MONEDA-1         TYPE IS DETAIL.                          211600      
002093    03 LINE PLUS 1.                                               211800      
002094       05 COLUMN 01  PIC  X(12)       SOURCE IS TIT-DIF20.        212000      
002095       05 COLUMN 14  PIC  ZZ9         SOURCE IS W-MONEDA.         212200      
002096*                                                                 212400      
002097 01 DET-FECHA-1          TYPE IS DETAIL.                          212600      
002098    03 LINE PLUS 1.                                               212800      
002099       05 COLUMN 06  PIC  X(10)       SOURCE IS TIT-DIF21.        213000      
002100       05 COLUMN 17  PIC  9999/99/99  SOURCE IS W-FEC-CON.        213200      
002101*                                                                 213400      
002102 01 DET-SISTEMA-1        TYPE IS DETAIL.                          213600      
002103    03 LINE PLUS 1.                                               213800      
002104       05 COLUMN 11  PIC  X(10)       SOURCE IS TIT-DIF10.        214000      
002105       05 COLUMN 22  PIC  X(14)       SOURCE IS WS-SISTEMA-LG.    214200      
002106       05 COLUMN 38  PIC  X(07)       SOURCE IS WS-SISTEMA-CR.    214400      
002107*                                                                 214600      
002108 01 NEXT GROUP NEXT PAGE TYPE IS CONTROL FOOTING WS-SUC.          214800      
002109    03 LINE PLUS 1.                                               215000      
002110       05 COLUMN 01  PIC  X(20)       SOURCE IS WS-SPACE.         215200      
002111*                                                                 215400      
002112***********************************************************       215500      
002113/                                                                 215600      
002114 PROCEDURE DIVISION.                                              215800      
002115 MAIN-SECCION                    SECTION.                         216000      
002116/**********************************************************       216202      
002117***      CARGA DE TIEMPOS ESPECIALES PARA COBOL74       ***       216204      
002118***********************************************************       216206      
002119 FNC-CARGA-TIEMPOS.                                               216208      
002120                                                                  216210      
002121     MOVE   ATTRIBUTE NAME  OF MYSELF TO CODE-FILE.               216212      
002122     CHANGE ATTRIBUTE TITLE OF FILE1  TO CODE-FILE.               216214      
002123     IF ATTRIBUTE PRESENT   OF FILE1 IS EQUAL TO VALUE TRUE       216216      
002124        PERFORM 100-CARGATIMES                                    216218      
002125     ELSE                                                         216220      
002126        MOVE 999999      TO COMPILETIME-15                        216222      
002127        MOVE 99999999999 TO COMPILETIME-11                        216224      
002128        MOVE 99999       TO COMPILETIME-10.                       216226      
002129     ACCEPT  TIME-1    FROM TIMER.                                216228      
002130     COMPUTE TIME-1 = ((TIME-1 * 2.4) / 1000000) * 60.            216230      
002131*                                                                 216232      
002132 100-CARGATIMES.                                                  216234      
002133*                                                                 216236      
002134     MOVE ATTRIBUTE CREATIONTIME OF FILE1 TO COMPILETIME-11.      216238      
002135     COMPUTE COMPILETIME-11 = COMPILETIME-11 / 2.4.               216240      
002136     MOVE ATTRIBUTE CREATIONDATE OF FILE1 TO COMPILETIME-10.      216241      
002137     MOVE COMPILETIME-10 TO JUL-FECHA.                            216242      
002138     MOVE JUL-YY         TO DATE-YY.                              216243      
002139*    DIVIDE JUL-YY BY 4 GIVING COCIENTE REMAINDER WRESIDUO.       216244      
002140*    SI DA COMO RESIDUO = 0, ENTONCES SE TRATA DE A\O BISIESTO.   216245      
002141                                                                  216246      
002142     IF JUL-YY < 80                                               216247      
002143        COMPUTE W77-JUL-YY4 = JUL-YY + 2000                       216248      
002144     ELSE                                                         216249      
002145        COMPUTE W77-JUL-YY4 = JUL-YY + 1900.                      216250      
002146                                                                  216251      
002147     DIVIDE W77-JUL-YY4 BY 4 GIVING COCIENTE REMAINDER WRESIDUO.  216254      
002148     IF WRESIDUO = 0                                              216255      
002149        PERFORM 200-SUMAUNO VARYING APUNT-MES    FROM 1 BY 1      216256      
002150                      UNTIL JUL-DDD < (M-DAY(APUNT-MES) + 1)      216258      
002151        MOVE APUNT-MES TO DATE-MM                                 216260      
002152        IF APUNT-MES > 1                                          216262      
002153           SUBTRACT M-DAY(APUNT-MES - 1)                          216264      
002154                    FROM JUL-DDD          GIVING DATE-DD          216266      
002155        ELSE                                                      216268      
002156           MOVE JUL-DDD                   TO DATE-DD              216270      
002157     ELSE                                                         216272      
002158        PERFORM 200-SUMAUNO VARYING APUNT-MES    FROM 1 BY 1      216274      
002159                      UNTIL JUL-DDD < (D-DAY(APUNT-MES) + 1)      216276      
002160        MOVE APUNT-MES TO DATE-MM                                 216278      
002161        IF APUNT-MES > 1                                          216280      
002162           SUBTRACT D-DAY(APUNT-MES - 1)                          216282      
002163                    FROM JUL-DDD          GIVING DATE-DD          216284      
002164        ELSE                                                      216286      
002165           MOVE JUL-DDD                   TO DATE-DD.             216288      
002166      MOVE DATE-MMDDYY                    TO COMPILETIME-15.      216290      
002167 200-SUMAUNO. EXIT.                                               216292      
002168/                                                                 216294      
002169**********************************************************        216400      
002170 000-RUTINA-PRINCIPAL.                                            216600      
002171     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   216650      
002172      "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".            216700      
002173     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     216750      
002174     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      216800      
002175     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.216820      
002176     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            216840      
002177                                      "SOPORTECOMS".              216860      
002178     CALL "CSIID OF SOPORTECOMS" USING WKS-DATOS-HOST.            216862      
002179     MOVE WKS-NUMCSI      TO      WKS-TR-CSI2.                    216864      
002180*                                                                 216866      
002181*ASM CHANGE ATTRIBUTE LIBACCESS    OF "CTRLVERS" TO BYFUNCTION.   216868      
002182*ASM CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".    216870      
002183*ASM                                                              216872      
002184*ASM MOVE "S151L001CTL"         TO WKS-CTLVERS-LIBRERIA           216874      
002185*ASM CALL "DAME_TIT IN CTRLVERS"                                  216876      
002186*ASM      USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO          216878      
002187*ASM      GIVING WKS-CTLVERS-STATUS.                              216880      
002188*ASM                                                              216881      
002189*ASM IF WKS-CTLVERS-STATUS < 0                                    216882      
002190*ASM    MOVE "ERROR EN CTLVERS, USO LIBEST SIN RELEASE NI MTP"    216883      
002191*ASM                     TO TEXTO-LJ                              216884      
002192*ASM ELSE                                                         216885      
002193*ASM    CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL" TO             216886      
002194*ASM           WKS-CTLVERS-TITULO.                                216887      
002195     MOVE "S151"                  TO SISTEMA-LJ.                  216888      
002196     MOVE "P117"                  TO WKS-PASO-BACK2               216889      
002197                                     PASO-LJ                      216890      
002198                                     WLI-RB-E1-PASO.              216891      
002199     MOVE "001"                   TO MTP-LJ.                      216892      
002200     MOVE "DIARIO"                TO WLI-RB-E2-TIPO-PROC2.        216893      
002201     MOVE "151"        TO WKS-SIS-BACK2, WLI-RB-E3-SISTEMA2.      216894      
002202     MOVE ZEROS                  TO INDICES WS-FECHAS.            216896      
002203     MOVE ZERO                   TO WS-NUM-AUT.                   216897      
002204     MOVE ZEROS                  TO CONTADORES.                   216898      
002205     PERFORM 11500-OBTIENE-FECHA-CTRL.                            216899      
002206     PERFORM 12500-VACIA-FECHAS.                                  216909      
002207      MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ       216910      
002208      MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ        216920      
002209      MOVE 020101                 TO CODIGO-LJ                    216930      
002210      MOVE "INICIO DE PROCESO"                                    216940      
002211                                  TO WLI-TEXTO-LJ, TEXTO-LJ       216950      
002212      PERFORM      000-030-IMPRIME-MENSAJE                        216960      
002213      ACCEPT WS-TIME              FROM TIME.                      217600      
002214*JRC  CALL "COMPILETIME-15 IN COBOL74"                            219620      
002215*                                 GIVING WKS-COMPILA2.            219640      
002216*     MOVE WKS-COMPILA2           TO WKS-VERSION2.                219710      
002217      MOVE WKS-MES-VERSION2       TO MM-VS.                       219712      
002218      MOVE WKS-DIA-VERSION2       TO DD-VS.                       219714      
002219      MOVE WKS-AAA-VERSION2       TO AA-VS.                       219716      
002220      IF AA-VS < 50                                               219720      
002221         COMPUTE AA-VS = AA-VS + 2000                             219730      
002222      ELSE                                                        219740      
002223         COMPUTE AA-VS = AA-VS + 1900.                            219750      
002224*ASM  MOVE DD-VS                  TO DUMMY-WS.                    219800      
002225*ASM  MOVE MM-VS                  TO DD-VS.                       220000      
002226*ASM  MOVE DUMMY-WS               TO MM-VS.                       220200      
002227*JRC  MOVE VERSION-WS             TO TIT-LIN-2-VERSION.           220400      
002228*JRC  MOVE VERSION-WS             TO TIT-NDIF2-VER.               220600      
002229*JRC  MOVE VERSION-WS             TO TIT-DUPL2-VER.               220800      
002230      MOVE LOW-VALUES             TO WS-REG-CTL-S028.             221000      
002231      MOVE LOW-VALUES             TO WS-REG-TRA-S028.             221200      
002232      MOVE LOW-VALUES             TO WS-REG-MOV-S028.             221400      
002233      MOVE "HR"                   TO WS-R028-CHEA.                221600      
002234      MOVE "TR"                   TO WS-R028-CTRA.                221800      
002235      MOVE "S151"                 TO WS-R028-CSIS.                222000      
002236      MOVE "COMP. NACIONAL"       TO WS-R028-NSIS.                222200      
002237      MOVE ZEROS                  TO WS-R028-CFOR.                222400      
002238      MOVE WS-FECHA-AMD           TO FECHA-NL WS-RM-AAMMDD.       222600      
002239      MOVE WS-FECHA-AMD           TO WS-RHD-FEC-CTL.              222800      
002240      MOVE WS-FECHA-AMD           TO WS-NS028-FEC.                223000      
002241      MOVE WS-FE-AMD-DIA          TO WS-R028-DIAP.                223200      
002242      MOVE WS-FE-AMD-MES          TO WS-R028-MESP.                223400      
002243      MOVE WS-FE-AMD-YEAR         TO WS-R028-ANOP.                223600      
002244      MOVE WS-FECHA-DMA           TO TIT-FEC-DATOS.               223800      
002245      MOVE WS-FECHA-DMA           TO TIT-NDIF4-FEC.               224000      
002246      MOVE WS-TIME-HH   TO TIT-LIN-3-TIME-HH TIT-DIF3A-TIME-HH    224200      
002247                           TIT-NDIF3-HH TIT-DUPL3-HH.             224210      
002248      MOVE WS-TIME-MM   TO TIT-LIN-3-TIME-MM TIT-DIF3A-TIME-MM    224220      
002249                           TIT-NDIF3-MM TIT-DUPL3-MM.             224230      
002250      MOVE WS-TIME-SS   TO TIT-LIN-3-TIME-SS TIT-DIF3A-TIME-SS    224240      
002251                           TIT-NDIF3-SS TIT-DUPL3-SS.             224245      
002252      MOVE WS-TIME-HMS            TO WS-RHD-HORA-PROC.            225000      
002253      MOVE WS-TIME-HMS            TO WS-R028-HREAL.               225200      
002254*ASM  MOVE WS-DATE-AA             TO WS-DIA.                      225400      
002255*ASM  MOVE WS-DATE-DD             TO WS-DATE-AA.                  225600      
002256*ASM  MOVE WS-DIA                 TO WS-DATE-DD.                  225800      
002257      MOVE WS-FEMAQ-DMA           TO TIT-LIN-2-DATE.              226000      
002258      MOVE WS-FEMAQ-DMA           TO TIT-NDIF2-FEC.               226200      
002259      MOVE WS-FEMAQ-DMA           TO TIT-DUPL2-FEC.               226400      
002260      MOVE WS-FECHA-DMA           TO WS-RHD-FEC-PROC.             226600      
002261      MOVE WS-FEMAQ-DMA           TO WS-R028-FREAL.               226800      
002262      MOVE LOW-VALUES             TO WS-LOW.                      227000      
002263      MOVE LOW-VALUES             TO ACUMULADORES.                227200      
002264      MOVE LOW-VALUES             TO INDICES.                     227400      
002265     MOVE SPACES                  TO REP2-DET1.                   227600      
002266      MOVE 80                     TO CONTLIN.                     227800      
002267      MOVE 80                     TO CONTLIN2.                    228000      
002268      MOVE 1                      TO IND-CSI.                     228200      
002269      MOVE ZEROS                  TO NUM-HOJA-LG.                 228400      
002270*     DISPLAY "S151/300: VERSION > " VERSION-WS " PROCESO "       228600      
002271*                                    FECHA-NL.                    228800      
002272*                                                                 228810      
002273*ASM  IF FECNL-AA < 93  AND  FECNL-AA > 95                        228820      
002274*ASM     MOVE SPACES              TO TIT-DIF22.                   228830      
002275/                                                                 229000      
002276      OPEN OUTPUT HISTDIF.                                        229200      
002277      WRITE REG-HIST-DIF          FROM WS-REG-HIST-DIF-CTL        229400      
002278      INVALID KEY                                                 229600      
002279*ASM        DISPLAY "010105 02  " WS-PROGRAMA,                    229700      
002280*ASM                " NO PUEDE GRABAR REG CTL HISTORICO"          229800      
002281            MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ 229820      
002282            MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ  229840      
002283            MOVE 010105                 TO CODIGO-LJ              229860      
002284            MOVE "NO SE PUEDE GRABAR REG DE CTRL HISTORICO"       229880      
002285                                        TO WLI-TEXTO-LJ, TEXTO-LJ 229900      
002286            PERFORM      000-030-IMPRIME-MENSAJE                  229920      
002287            SET MYSELF(STATUS)    TO -1.                          230000      
002288*                                                                 230200      
002289* ===> PREPARA EL ENLACE AL S028                                  230400      
002290      PERFORM 1000-CREA-MOVSXTERM VARYING IND-CSI FROM 1 BY 1     230600      
002291                                    UNTIL IND-CSI > LIM-CCRS.     230800      
002292*                                                                 231000      
002293      CHANGE ATTRIBUTE TITLE OF LOG-GRAL TO NOMBRE-LOG-GRAL.      231200      
002294      MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WS-RM-MIX.            231300      
002295      MOVE 10                      TO WS-RM-NODO.                 231306      
002296      MOVE ZEROES                  TO WS-RM-SUBNODO.              231308      
002297      MOVE "R"                     TO WS-RM-TIPO.                 231310      
002298      MOVE 001                     TO WS-RM-SEQ.                  231312      
002299      MOVE "DIFERENCIA"            TO WS-RM-DESC.                 231314      
002300      CHANGE ATTRIBUTE TITLE OF REPORTE  TO WS-NOMB-REPORTE.      231316      
002301      OPEN OUTPUT REPORTE.                                        231318      
002302      MOVE 002                     TO WS-RM-SEQ.                  231323      
002303      MOVE "DUPLICADOS"            TO WS-RM-DESC.                 231328      
002304      CHANGE ATTRIBUTE TITLE OF LISTADO  TO WS-NOMB-REPORTE.      231333      
002305      OPEN OUTPUT LISTADO.                                        231338      
002306      MOVE 003                     TO WS-RM-SEQ.                  231343      
002307      MOVE "DIFSUCUR  "            TO WS-RM-DESC.                 231348      
002308      CHANGE ATTRIBUTE TITLE OF INICSUC  TO WS-NOMB-REPORTE.      231353      
002309      OPEN OUTPUT INICSUC.                                        231358      
002310      MOVE 004                     TO WS-RM-SEQ.                  231363      
002311      MOVE "DIFNOCONT "            TO WS-RM-DESC.                 231368      
002312      CHANGE ATTRIBUTE TITLE OF DIFNOCON TO WS-NOMB-REPORTE.      231373      
002313      OPEN OUTPUT DIFNOCON.                                       231378      
002314      INITIATE REP-DIFERENCIA.                                    231600      
002315      INITIATE REP-INICSUC.                                       231800      
002316*                                                                 232000      
002317      PERFORM 2000-PROCESO.                                       232200      
002318*                                                                 232400      
002319      TERMINATE REP-DIFERENCIA.                                   232600      
002320      TERMINATE REP-INICSUC.                                      232800      
002321      CLOSE HISTDIF  WITH LOCK.                                   233000      
002322*ASM   CLOSE GUARDIAN WITH LOCK.                                  233200      
002323      CLOSE REPORTE  LISTADO  INICSUC   DIFNOCON.                 233400      
002324*ASM  DISPLAY "020201 01  " WS-PROGRAMA, "FIN DE PROCESO".        233500      
002325      MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ       233510      
002326      MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ        233520      
002327      MOVE 020201                 TO CODIGO-LJ                    233530      
002328      MOVE "FIN NORMAL DEL PROCESO"                               233540      
002329                                  TO WLI-TEXTO-LJ, TEXTO-LJ       233550      
002330      PERFORM      000-030-IMPRIME-MENSAJE                        233560      
002331      STOP RUN.                                                   233600      
002332*                                                                 233620      
002333 0100-FORMATO-DISPLAY.                                            233640      
002334*---------------------                                            233660      
002335                                                                  233680      
002336*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002337* COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY.".                   233700      
002338                                                                  000100      
002339*===============================================================* 000200      
002340*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
002341*         PARA LLAMADO DE DISPLAY                               * 000400      
002342*===============================================================* 000500      
002343                                                                  000600      
002344     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
002345            TO BYFUNCTION.                                        000671      
002346                                                                  000691      
002347     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
002348          USING WKS-DATE-ARRAY2.                                  000800      
002349     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
002350     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
002351     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
002352     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
002353     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
002354     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
002355                                                                  001300      
002356     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
002357     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
002358     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
002359                               WKS-TIT-REPORTE2.                  001700      
002360*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
002361*                                  GIVING WKS-COMPILA2.           001900      
002362*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
002363*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
002364*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
002365*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
002366                                                                  002066      
002367*    IF WKS-AAA-VERSION2  < 50                                    002071      
002368*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
002369*    ELSE                                                         002081      
002370*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
002371                                                                  002091      
002372                                                                  002500      
002373*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
002374     OPEN OUTPUT V00-REPORTE2.                                    002700      
002375     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
002376     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
002377                                                                  003000      
002378 000-050-CHECA-SALTO-HOJA2.                                       003051      
002379*==========================                                       003071      
002380    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
002381     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
002382        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
002383     ELSE                                                         003079      
002384        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
002385     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
002386     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
002387     MOVE "/"                     TO WKS-SLASH1.                  003086      
002388     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
002389     MOVE "/"                     TO WKS-SLASH2.                  003088      
002390     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
002391     IF  WKS-NUM-LINEAS2 > 56                                     003091      
002392         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
002393         ADD 1                   TO    W77-CONT-HOJA2             003200      
002394         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
002395         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
002396         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
002397         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
002398         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
002399         MOVE SPACES             TO V00-R00-REPORTE2              003800      
002400         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
002401         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
002402                                                                  004100      
002403 000-030-IMPRIME-MENSAJE.                                         004200      
002404*========================                                         004300      
002405*LP                                                               004400      
002406     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
002407     ADD             2       TO WKS-NUM-LINEAS2                   004600      
002408     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
002409                                                                  004800      
002410*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002411*                                                                 233800      
002412 11500-OBTIENE-FECHA-CTRL.                                        233801      
002413*-------------------------                                        233802      
002414     OPEN INPUT A01-CONTROL.                                      233803      
002415     READ A01-CONTROL INTO WKS-REG-HD-CONTROL.                    233804      
002416     MOVE WKS-HD-FECPRO           TO WS-FECHA-AMD.                233805      
002417     CLOSE A01-CONTROL.                                           233806      
002418*                                                                 233807      
002419*===================                                              233813      
002420 12500-VACIA-FECHAS.                                              233814      
002421*===================                                              233815      
002422     MOVE WS-FECHA-AMD              TO WLI-RB-E1-FECHA-INF2.      233834      
002423     PERFORM 0100-FORMATO-DISPLAY.                                233835      
002424     MOVE WKS-FEMAQ8D2              TO WS-FEMAQ-AMD.              233836      
002425     PERFORM 1012-INVIERTE-FECHAS.                                233837      
002426     MOVE WS-FECHA-DMA              TO W77-FECHA-PROC.            233838      
002427     MOVE WKS-NUMCSI              TO PTER-CSI-WS.                 233839      
002428     MOVE WS-CSI-TANDEM        TO PTER-CSI-WS.                    233841      
002429     IF NOT PTER-CSIOK                                            233842      
002430        MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ     233845      
002431        MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ      233846      
002432        MOVE 010104                 TO CODIGO-LJ                  233847      
002433        MOVE "CSI INVALIDO EN LIB-CONTROL"                        233849      
002434                                    TO WLI-TEXTO-LJ, TEXTO-LJ     233851      
002435        PERFORM      000-030-IMPRIME-MENSAJE                      233853      
002436        SET MYSELF(STATUS)        TO -1.                          233855      
002437*                                                                 233870      
002438 1012-INVIERTE-FECHAS.                                            233880      
002439*---------------------                                            233890      
002440     MOVE WS-FE-AMD-DIA             TO WS-FE-DMA-DIA.             233900      
002441     MOVE WS-FE-AMD-MES             TO WS-FE-DMA-MES.             233910      
002442     MOVE WS-FE-AMD-YEAR            TO WS-FE-DMA-YEAR.            233920      
002443     MOVE WS-FM-AMD-DIA             TO WS-FM-DMA-DIA.             233930      
002444     MOVE WS-FM-AMD-MES             TO WS-FM-DMA-MES.             233940      
002445     MOVE WS-FM-AMD-YEAR            TO WS-FM-DMA-YEAR.            233950      
002446*                                                                 233960      
002447 1000-CREA-MOVSXTERM.                                             234000      
002448*                                                                 234200      
002449     IF CSI-VALIDO                                                234400      
002450        PERFORM 1010-CREA-S028.                                   234600      
002451*                                                                 234800      
002452 1010-CREA-S028.                                                  235000      
002453     MOVE ABR-CSI-TC  (IND-CSI)          TO WS-NS028-CSI.         235200      
002454     CHANGE ATTRIBUTE TITLE OF MOVSXTERM TO WS-NOMB-S028.         235400      
002455*                                                                 238000      
002456/**************************************************************** 238200      
002457 2000-PROCESO.                                                    238400      
002458*                                                                 238600      
002459     PERFORM 2500-ANALIZA-LOGS.                                   238800      
002460     SORT SORT-LOG ON ASCENDING KEY SLOG-LLAVE                    239000      
002461          INPUT  PROCEDURE IS 3000-LEE-TEMP-FILE                  239200      
002462          OUTPUT PROCEDURE IS 3500-REPORTA-LOGS                   239400      
002463                 MEMORY SIZE WS-MEM-SIZE  WORDS                   239600      
002464                 DISK   SIZE WS-DISK-SIZE WORDS.                  239800      
002465*                                                                 240000      
002466* ===> ENLACE AL S028.                                            240200      
002467     OPEN INPUT S028MANIOBRA.                                     240400      
002468     COMPUTE WS-MEM-SIZE =                                        240600      
002469           ( WS-REGSIZE-SORTS028 + WS-CT1-MSIZE ) * WS-CT2-MSIZE  240800      
002470                                                  + WS-CT3-MSIZE. 241000      
002471     MOVE ATTRIBUTE LASTRECORD    OF S028MANIOBRA                 241200      
002472                                  TO WS-ULTREG-S028MAN.           241400      
002473     COMPUTE WS-DISK-SIZE =                                       241600      
002474           ( WS-REGSIZE-SORTS028 * WS-ULTREG-S028MAN * 3.5 )      241800      
002475     CLOSE S028MANIOBRA WITH SAVE.                                242000      
002476                                                                  242200      
002477     SORT SORT-S028 ON ASCENDING KEY RS-LLAVE                     242400      
002478          USING S028MANIOBRA GIVING S028MANIOBRA                  242600      
002479                 MEMORY SIZE WS-MEM-SIZE  WORDS                   242800      
002480                 DISK   SIZE WS-DISK-SIZE WORDS.                  243000      
002481                                                                  243200      
002482     PERFORM 5000-ENLACE-S028.                                    243400      
002483/                                                                 243600      
002484 2500-ANALIZA-LOGS.                                               243800      
002485*                                                                 244000      
002486     COMPUTE WS-MEM-SIZE =                                        244200      
002487           ( WS-REGSIZE-SORTLOG + WS-CT1-MSIZE ) * WS-CT2-MSIZE   244400      
002488                                                 + WS-CT3-MSIZE.  244600      
002489*                                                                 244800      
002490     IF ATTRIBUTE RESIDENT OF LOG-GRAL EQUAL TO VALUE TRUE        245000      
002491        OPEN INPUT LOG-GRAL                                       245200      
002492        MOVE ATTRIBUTE LASTRECORD  OF LOG-GRAL                    245400      
002493                                   TO WS-ULTREG-LOGGRAL           245600      
002494        COMPUTE WS-DISK-SIZE =                                    245800      
002495              ( WS-REGSIZE-SORTLOG * WS-ULTREG-LOGGRAL * 3.5 )    246000      
002496        PERFORM 2530-LEE-LOGGRAL                                  246200      
002497        IF IND-FIN-LOG = 0                                        246400      
002498           OPEN OUTPUT TEMPFILE S028MANIOBRA                      246600      
002499           PERFORM 2510-ANALIZA-MOVTOS UNTIL IND-FIN-LOG = 1      246800      
002500           CLOSE TEMPFILE WITH SAVE    S028MANIOBRA WITH SAVE     247000      
002501        ELSE                                                      247200      
002502*ASM       DISPLAY "010106 02  " WS-PROGRAMA,                     247300      
002503*ASM               "NO HAY INFORMACION EN LOG GRAL"               247400      
002504           MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ  247420      
002505           MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ   247440      
002506           MOVE 010106                 TO CODIGO-LJ               247460      
002507           MOVE "NO HAY INFORMACION EN LOG GRAL."                 247480      
002508                                       TO WLI-TEXTO-LJ, TEXTO-LJ  247500      
002509           PERFORM      000-030-IMPRIME-MENSAJE                   247520      
002510           SET MYSELF(STATUS)     TO -1                           247600      
002511     ELSE                                                         247800      
002512*ASM    DISPLAY "010501 01  " WS-PROGRAMA,                        247900      
002513*ASM            " LOG GRAL AUSENTE"                               248000      
002514        MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ     248020      
002515        MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ      248040      
002516        MOVE 010501                 TO CODIGO-LJ                  248060      
002517        MOVE "LOG GRAL. AUSENTE"                                  248080      
002518                                    TO WLI-TEXTO-LJ, TEXTO-LJ     248100      
002519        PERFORM      000-030-IMPRIME-MENSAJE                      248120      
002520        SET MYSELF(STATUS)        TO -1.                          248200      
002521/                                                                 248400      
002522 2510-ANALIZA-MOVTOS.                                             248600      
002523*                                                                 248800      
002524     MOVE SPACES                 TO WS-TABLA-VERIF-MSG.           249000      
002525     MOVE 0                      TO IND-TAB.                      249200      
002526     MOVE WS-RDI-CVE-AUT         TO WS-NUM-AUT.                   249400      
002527     PERFORM 2520-CARGA-TABLA-LOGS UNTIL IND-FIN-LOG = 1 OR       249600      
002528                                WS-RDI-CVE-AUT NOT = WS-NUM-AUT.  249800      
002529     IF IND-TAB > 1                                               250000      
002530        PERFORM 2540-COMPARA-REGS-LOGS VARYING IND-1 FROM 1 BY 1  250200      
002531                                       UNTIL   IND-1 > IND-TAB.   250400      
002532* ELIMINACION DE DIFS. NO CONTABLES.                              250600      
002533     IF IND-TAB > 1                                               250800      
002534        PERFORM 2542-COMPARA-REGS-LOGS VARYING IND-1 FROM 1 BY 1  251000      
002535                                       UNTIL   IND-1 > IND-TAB.   251200      
002536     PERFORM 2550-CARGA-MOVTOS         VARYING IND-1 FROM 1 BY 1  251400      
002537                                       UNTIL   IND-1 > IND-TAB.   251600      
002538*                                                                 251800      
002539 2520-CARGA-TABLA-LOGS.                                           252000      
002540     IF IND-TAB-VAL                                               252200      
002541        IF WS-RDI-CSI-ORI NOT = WS-RDI-CSI-DES                    252400      
002542           ADD  1                  TO IND-TAB                     252600      
002543           MOVE WS-REG-DET-INFOICA TO WS-TVM-REG(IND-TAB)         252800      
002544        ELSE                                                      253000      
002545           PERFORM 2560-IMPRIME-DUPLICADOS                        253200      
002546     ELSE                                                         253400      
002547        PERFORM 2560-IMPRIME-DUPLICADOS.                          253600      
002548     PERFORM 2530-LEE-LOGGRAL.                                    253800      
002549*                                                                 254000      
002550 2530-LEE-LOGGRAL.                                                254200      
002551     READ LOG-GRAL               INTO WS-REG-DET-INFOICA          254400      
002552      AT END                                                      254600      
002553            MOVE 1                 TO IND-FIN-LOG.                254800      
002554/                                                                 255000      
002555 2540-COMPARA-REGS-LOGS.                                          255200      
002556     PERFORM 2541-COMPARA-REGS-LOGS                               255400      
002557                            VARYING IND-2 FROM (IND-1 + 1)  BY 1  255600      
002558                            UNTIL   IND-2  >    IND-TAB.          255800      
002559*                                                                 256000      
002560 2541-COMPARA-REGS-LOGS.                                          256200      
002561     IF WS-TVM-REG           (IND-1) NOT = SPACES                 256400      
002562        IF WS-TVM-REG        (IND-2) NOT = SPACES                 256600      
002563           IF ( TVM-OPERADO (IND-1) AND  TVM-APLICADO(IND-2)   OR 256800      
002564                TVM-APLICADO(IND-1) AND  TVM-OPERADO (IND-2) ) AND257000      
002565             WS-TVM-IMPORTE (IND-1) = WS-TVM-IMPORTE (IND-2)   AND257200      
002566             WS-TVM-ID-CTA  (IND-1) = WS-TVM-ID-CTA  (IND-2)   AND257400      
002567              ( TVM-CARGO   (IND-1) AND  TVM-CARGO   (IND-2)   OR 257600      
002568                TVM-ABONO   (IND-1) AND  TVM-ABONO   (IND-2)   OR 257800      
002569                TVM-ANUCARGO(IND-1) AND  TVM-ANUCARGO(IND-2)   OR 258000      
002570                TVM-ANUABONO(IND-1) AND  TVM-ANUABONO(IND-2) )    258200      
002571              PERFORM 25411-CANCELA.                              258400      
002572*                                                                 258600      
002573 2542-COMPARA-REGS-LOGS.                                          258800      
002574     PERFORM 2543-COMPARA-REGS-LOGS                               259000      
002575                            VARYING IND-2 FROM (IND-1 + 1)  BY 1  259200      
002576                            UNTIL   IND-2  >    IND-TAB.          259400      
002577*                                                                 259600      
002578 2543-COMPARA-REGS-LOGS.                                          259800      
002579     IF WS-TVM-REG          (IND-1) NOT = SPACES                  260000      
002580        IF WS-TVM-REG       (IND-2) NOT = SPACES                  260200      
002581           IF ( TVM-OPERADO (IND-1) AND  TVM-OPERADO (IND-2)   OR 260400      
002582                TVM-APLICADO(IND-1) AND  TVM-APLICADO(IND-2) ) AND260600      
002583             WS-TVM-IMPORTE (IND-1) = WS-TVM-IMPORTE (IND-2)   AND260800      
002584             WS-TVM-ID-CTA  (IND-1) = WS-TVM-ID-CTA  (IND-2)   AND261000      
002585              ( TVM-CARGO   (IND-1) AND  TVM-ANUCARGO(IND-2)   OR 261200      
002586                TVM-ABONO   (IND-1) AND  TVM-ANUABONO(IND-2)   OR 261400      
002587                TVM-ANUCARGO(IND-1) AND  TVM-CARGO   (IND-2)   OR 261600      
002588                TVM-ANUABONO(IND-1) AND  TVM-ABONO   (IND-2) )    261800      
002589              PERFORM 2580-IMPRIME-DIFNOCONT                      262000      
002590              PERFORM 25411-CANCELA.                              262200      
002591*                                                                 262400      
002592 25411-CANCELA.                                                   262600      
002593      MOVE SPACES                 TO WS-TVM-REG(IND-1).           262800      
002594      MOVE SPACES                 TO WS-TVM-REG(IND-2).           263000      
002595*                                                                 263200      
002596 2550-CARGA-MOVTOS.                                               263400      
002597     IF WS-TVM-REG    (IND-1)    NOT = SPACES AND                 263600      
002598        WS-TVM-IMPORTE(IND-1)    NOT = 0                          263800      
002599        MOVE WS-TVM-REG(IND-1)    TO REG-TEMP-LOG                 264000      
002600        WRITE REG-TEMP-LOG                                        264200      
002601        PERFORM 2552-GRABA-ENLACE.                                264400      
002602*                                                                 264600      
002603/                                                                 264800      
002604 2552-GRABA-ENLACE.                                               265000      
002605*                                                                 265200      
002606     MOVE LOW-VALUES              TO WS-REG-SORT-S028.            265400      
002607     IF TVM-OPERADO(IND-1)                                        265600      
002608        NEXT SENTENCE                                             265800      
002609     ELSE                                                         266000      
002610        MOVE WS-TVM-CSI-ORI(IND-1) TO WS-CSI-ORI                  266200      
002611        MOVE WS-TVM-CSI-DES(IND-1) TO WS-TVM-CSI-ORI(IND-1)       266400      
002612        MOVE WS-CSI-ORI             TO WS-TVM-CSI-DES(IND-1).     266600      
002613     IF WS-TVM-CSI-ORI(IND-1) > 0 AND < ( LIM-CCRS + 1 )          266800      
002614        PERFORM 25521-A-S028.                                     267000      
002615*                                                                 267200      
002616 25521-A-S028.                                                    267400      
002617*                                                                 267600      
002618     MOVE 1                       TO WS-RS-TREP.                  267800      
002619     MOVE WS-TVM-CSI-ORI  (IND-1) TO WS-RS-CSI.                   268000      
002620     MOVE WS-TVM-SUC-ORI  (IND-1) TO WS-RS-SUC.                   268200      
002621     MOVE WS-TVM-APL-ORI  (IND-1) TO WS-RS-APL.                   268400      
002622     MOVE WS-TVM-CVE-MON  (IND-1) TO WS-RS-MON.                   268600      
002623     MOVE WS-TVM-SUC-ORI  (IND-1) TO WS-RS-SUCOPE.                268800      
002624     MOVE WS-TVM-CAJA-ORI (IND-1) TO WS-RS-CAJOPE.                269000      
002625     MOVE WS-TVM-CVE-AUT  (IND-1) TO WS-RS-NUMAUT.                269200      
002626     MOVE WS-TVM-FECHA    (IND-1) TO WS-RS-FEC-CON.               269400      
002627*                                                                 269600      
002628     IF TVM-CARGO   (IND-1)                                       269800      
002629        MOVE 20                   TO WS-TVM-COD-SER(IND-1)        270000      
002630     ELSE                                                         270200      
002631     IF TVM-ABONO   (IND-1)                                       270400      
002632        MOVE 10                   TO WS-TVM-COD-SER(IND-1)        270600      
002633     ELSE                                                         270800      
002634     IF TVM-ANUCARGO(IND-1)                                       271000      
002635        MOVE 21                   TO WS-TVM-COD-SER(IND-1)        271200      
002636     ELSE                                                         271400      
002637        MOVE 11                   TO WS-TVM-COD-SER(IND-1).       271600      
002638     MOVE WS-TVM-REG(IND-1)       TO WS-RS-RESTO.                 271800      
002639     WRITE REG-S028MANIOBRA     FROM WS-REG-SORT-S028.            272000      
002640*    IF NUM-OCCA-CCR-TC(WS-RS-CSI) NOT EQUAL TO WS-RS-SUC         272200      
002641        MOVE 2                    TO WS-RS-TREP                   272400      
002642        MOVE NUM-OCCA-CCR-TC(WS-RS-CSI) TO WS-RS-SUC              272600      
002643        WRITE REG-S028MANIOBRA  FROM WS-REG-SORT-S028.            272800      
002644/                                                                 273000      
002645 2560-IMPRIME-DUPLICADOS.                                         273200      
002646*                                                                 273400      
002647     IF WS-RDI-CSI-ORI NOT = CSI-ORI-ANT                          273600      
002648**      PERFORM 2570-ENCABEZADO-DUPLICADOS                        273800      
002649        MOVE WS-RDI-CSI-ORI       TO CSI-ORI-ANT.                 274000      
002650     IF CONTLIN > 60                                              274200      
002651       PERFORM 2570-ENCABEZADO-DUPLICADOS.                        274400      
002652     MOVE WS-RDI-APL-ORI          TO APL-ORI-WS.                  274600      
002653     IF APL-ORI-LOGCCR                                            274800      
002654        MOVE DESCR-SIST-CORTA(SIS-WS)                             275000      
002655                                  TO WS-SISTEMA-CR                275200      
002656     ELSE                                                         275400      
002657        MOVE SPACES               TO WS-SISTEMA-CR                275600      
002658        MOVE APL-ORI-WS           TO WS-SIS-CR.                   275800      
002659     MOVE WS-SISTEMA-CR           TO R2D1-APL-ORI.                276000      
002660     MOVE WS-RDI-APL-DES          TO APL-ORI-WS.                  276200      
002661     IF APL-ORI-LOGCCR                                            276400      
002662        MOVE DESCR-SIST-CORTA(SIS-WS)                             276600      
002663                                  TO WS-SISTEMA-CR                276800      
002664     ELSE                                                         277000      
002665        MOVE SPACES               TO WS-SISTEMA-CR                277200      
002666        MOVE APL-ORI-WS           TO WS-SIS-CR.                   277400      
002667     MOVE WS-SISTEMA-CR           TO R2D1-APL-DES.                277600      
002668     IF RDI-CSI-ORI-VAL                                           277800      
002669        MOVE ABR-CSI-TC(WS-RDI-CSI-ORI)                           278000      
002670                                  TO R2D1-CSI-ORI                 278200      
002671     ELSE                                                         278400      
002672        MOVE WS-RDI-CSI-ORI       TO R2D1-CSI-ORI.                278600      
002673     IF RDI-CSI-DES-VAL                                           278800      
002674        MOVE ABR-CSI-TC(WS-RDI-CSI-DES)                           279000      
002675                                  TO R2D1-CSI-DES                 279200      
002676     ELSE                                                         279400      
002677        MOVE WS-RDI-CSI-DES       TO R2D1-CSI-DES.                279600      
002678     MOVE WS-RDI-NOM-EST          TO R2D1-STA-NAME.               279800      
002679     MOVE WS-RDI-CTA-DES          TO WS-PARTE-CTADES.             280000      
002680     MOVE WS-PARTE-SUC            TO WS-SUC-CTADES.               280200      
002681     MOVE WS-PARTE-CTA            TO WS-CTA-CTADES.               280400      
002682     MOVE WS-EDIT-CTADES          TO R2D1-CTA-DES.                280600      
002683     MOVE WS-RDI-IMP-TRN          TO IMPORTE-ENTERO.              280800      
002684     IF   RDI-COD-SER-CARGO      OR RDI-COD-SER-ABONO             281000      
002685     OR   RDI-COD-SER-ELIMCARGO  OR RDI-COD-SER-ELIMABONO         281200      
002686        MOVE TAB-DNC(WS-RDI-COD-SER)                              281400      
002687                                  TO R2D1-TIPO-MOV                281600      
002688     ELSE                                                         281800      
002689        MOVE WS-RDI-COD-SER       TO R2D1-TIPO-MOV.               282000      
002690     MOVE IMPORTE-ENTERO          TO R2D1-IMPORTE.                282200      
002691     MOVE WS-RDI-STA-TRN          TO R2D1-STATUS.                 282400      
002692     MOVE WS-RDI-CVE-AUT          TO R2D1-N-AUTOR.                282600      
002693     MOVE WS-RDI-MON-TRN          TO R2D1-MONEDA.                 282800      
002694     MOVE WS-RDI-FEC-CON          TO R2D1-FEC-CON.                283000      
002695     MOVE WS-RDI-HOR-GEN-HH       TO R2D1-HORA-HH.                283200      
002696     MOVE WS-RDI-HOR-GEN-MM       TO R2D1-HORA-MM.                283300      
002697     MOVE WS-RDI-FEC-GEN          TO R2D1-FEC-GEN.                283400      
002698     MOVE WS-RDI-CTA-ACC          TO R2D2-CTA-ACC.                283600      
002699     MOVE WS-RDI-REF-OPE          TO R2D2-REF-OPE.                283800      
002700     MOVE WS-RDI-SUB-SER          TO R2D1-SUB-SER.                284000      
002701     WRITE LISTA FROM REP2-DET1   BEFORE 1.                       284200      
002702     WRITE LISTA FROM REP2-DET2   BEFORE 2.                       284400      
002703     ADD 3                           TO CONTLIN.                  284600      
002704/                                                                 284800      
002705 2570-ENCABEZADO-DUPLICADOS.                                      285000      
002706     MOVE ZEROS                      TO CONTLIN.                  285200      
002707     ADD  1                          TO NUM-HOJA-DUPL.            285400      
002708     MOVE NUM-HOJA-DUPL              TO TIT-DUPL1-PAGE.           285600      
002709     MOVE NOMBRE-CCR(WS-RDI-CSI-ORI) TO TIT-NDIF5-NOM.            285800      
002710*                                                                 286000      
002711     WRITE LISTA FROM TIT-DUPL1      AFTER  PAGE.                 286200      
002712     MOVE SPACES TO LISTA.                                        286250      
002713     WRITE LISTA                     BEFORE 1.                    286300      
002714     WRITE LISTA FROM TIT-DUPL2      BEFORE 1.                    286400      
002715     WRITE LISTA FROM TIT-DUPL3      BEFORE 1.                    286600      
002716     WRITE LISTA FROM TIT-NDIF4      BEFORE 2.                    286800      
002717*    WRITE LISTA FROM TIT-NDIF5      BEFORE 2.                    287000      
002718     WRITE LISTA FROM SUBTIT-1       BEFORE 1.                    287200      
002719     WRITE LISTA FROM SUBTIT-2       BEFORE 1.                    287400      
002720     WRITE LISTA FROM SUBTIT-3       BEFORE 3.                    287600      
002721     ADD  13                         TO CONTLIN.                  287800      
002722*                                                                 288000      
002723 2580-IMPRIME-DIFNOCONT.                                          288200      
002724     MOVE IND-1                   TO IND-3.                       288400      
002725     PERFORM 2581-MUEVE-DNC.                                      288600      
002726     MOVE IND-2                   TO IND-3.                       288800      
002727     PERFORM 2581-MUEVE-DNC.                                      289000      
002728/                                                                 289200      
002729 2581-MUEVE-DNC.                                                  289400      
002730     IF TVM-OPERADO(IND-3)                                        289600      
002731        NEXT SENTENCE                                             289800      
002732     ELSE                                                         290000      
002733        MOVE WS-TVM-CSI-ORI(IND-3) TO WS-CSI-ORI                  290200      
002734        MOVE WS-TVM-CSI-DES(IND-3) TO WS-TVM-CSI-ORI(IND-3)       290400      
002735        MOVE WS-CSI-ORI             TO WS-TVM-CSI-DES(IND-3).     290600      
002736*                                                                 290800      
002737     MOVE SPACES                  TO REP2-DET1.                   291000      
002738     MOVE WS-REG-DET-INFOICA      TO WS-REG-DET-INFOICA-TEMP.     291200      
002739     MOVE WS-TVM-REG(IND-3)       TO WS-REG-DET-INFOICA.          291400      
002740     IF CONTLIN2 > 60                                             291600      
002741        PERFORM 2582-ENCABEZADO-DIFNOCONT.                        291800      
002742     MOVE WS-RDI-APL-ORI          TO APL-ORI-WS.                  292000      
002743     IF APL-ORI-LOGCCR                                            292200      
002744        MOVE DESCR-SIST-CORTA(SIS-WS)                             292400      
002745                                  TO WS-SISTEMA-CR                292600      
002746     ELSE                                                         292800      
002747        MOVE SPACES               TO WS-SISTEMA-CR                293000      
002748        MOVE APL-ORI-WS           TO WS-SIS-CR.                   293200      
002749     MOVE WS-SISTEMA-CR           TO R2D1-APL-ORI.                293400      
002750     MOVE WS-RDI-APL-DES          TO APL-ORI-WS.                  293600      
002751     IF APL-ORI-LOGCCR                                            293800      
002752        MOVE DESCR-SIST-CORTA(SIS-WS)                             294000      
002753                                  TO WS-SISTEMA-CR                294200      
002754     ELSE                                                         294400      
002755        MOVE SPACES               TO WS-SISTEMA-CR                294600      
002756        MOVE APL-ORI-WS           TO WS-SIS-CR.                   294800      
002757     MOVE WS-SISTEMA-CR           TO R2D1-APL-DES.                295000      
002758     IF RDI-CSI-ORI-VAL                                           295200      
002759        MOVE ABR-CSI-TC(WS-RDI-CSI-ORI)                           295400      
002760                                  TO R2D1-CSI-ORI                 295600      
002761     ELSE                                                         295800      
002762        MOVE WS-RDI-CSI-ORI       TO R2D1-CSI-ORI.                296000      
002763     IF RDI-CSI-DES-VAL                                           296200      
002764        MOVE ABR-CSI-TC(WS-RDI-CSI-DES)                           296400      
002765                                  TO R2D1-CSI-DES                 296600      
002766     ELSE                                                         296800      
002767        MOVE WS-RDI-CSI-DES       TO R2D1-CSI-DES.                297000      
002768/                                                                 297200      
002769     MOVE WS-RDI-NOM-EST          TO R2D1-STA-NAME.               297400      
002770     MOVE WS-RDI-CTA-DES          TO WS-PARTE-CTADES.             297600      
002771     MOVE WS-PARTE-SUC            TO WS-SUC-CTADES.               297800      
002772     MOVE WS-PARTE-CTA            TO WS-CTA-CTADES.               298000      
002773     MOVE WS-EDIT-CTADES          TO R2D1-CTA-DES.                298200      
002774     MOVE WS-RDI-IMP-TRN          TO IMPORTE-ENTERO.              298400      
002775     IF   RDI-COD-SER-CARGO      OR RDI-COD-SER-ABONO             298600      
002776     OR   RDI-COD-SER-ELIMCARGO  OR RDI-COD-SER-ELIMABONO         298800      
002777        MOVE TAB-DNC(WS-RDI-COD-SER)                              299000      
002778                                  TO R2D1-TIPO-MOV                299200      
002779     ELSE                                                         299400      
002780        MOVE WS-RDI-COD-SER       TO R2D1-TIPO-MOV.               299600      
002781     MOVE IMPORTE-ENTERO          TO R2D1-IMPORTE.                299800      
002782     MOVE WS-RDI-STA-TRN          TO R2D1-STATUS.                 300000      
002783     MOVE WS-RDI-CVE-AUT          TO R2D1-N-AUTOR.                300200      
002784     MOVE WS-RDI-MON-TRN          TO R2D1-MONEDA.                 300400      
002785     MOVE WS-RDI-FEC-CON          TO R2D1-FEC-CON.                300600      
002786     MOVE WS-RDI-HOR-GEN-HH       TO R2D1-HORA-HH.                300800      
002787     MOVE WS-RDI-HOR-GEN-MM       TO R2D1-HORA-MM.                300900      
002788     MOVE WS-RDI-FEC-GEN          TO R2D1-FEC-GEN.                301000      
002789     MOVE WS-RDI-CTA-ACC          TO R2D2-CTA-ACC.                301200      
002790     MOVE WS-RDI-REF-OPE          TO R2D2-REF-OPE.                301400      
002791     MOVE WS-RDI-SUB-SER          TO R2D1-SUB-SER.                301600      
002792     WRITE LDNC FROM REP2-DET1    BEFORE 1.                       301800      
002793     WRITE LDNC FROM REP2-DET2    BEFORE 2.                       302000      
002794     ADD 3                       TO CONTLIN2.                     302200      
002795     MOVE WS-REG-DET-INFOICA-TEMP TO WS-REG-DET-INFOICA.          302400      
002796*                                                                 302600      
002797 2582-ENCABEZADO-DIFNOCONT.                                       302800      
002798     MOVE ZEROS                      TO CONTLIN2.                 303000      
002799     MOVE SPACES                     TO LDNC.                     303200      
002800     ADD  1                          TO NUM-HOJA-LG.              303400      
002801     MOVE NUM-HOJA-LG                TO TIT-NDIF1-PAGE.           303600      
002802     WRITE LDNC                      BEFORE PAGE.                 303800      
002803     WRITE LDNC FROM TIT-NDIF1       BEFORE 1.                    304000      
002804     WRITE LDNC FROM TIT-NDIF2       BEFORE 1.                    304200      
002805     WRITE LDNC FROM TIT-NDIF3       BEFORE 1.                    304400      
002806     WRITE LDNC FROM TIT-NDIF4       BEFORE 2.                    304600      
002807     WRITE LDNC FROM SUBTIT-1        BEFORE 1.                    304800      
002808     WRITE LDNC FROM SUBTIT-2        BEFORE 1.                    305000      
002809     WRITE LDNC FROM SUBTIT-3        BEFORE 2.                    305200      
002810     MOVE 9                          TO CONTLIN2.                 305400      
002811*                                                                 305600      
002812/                                                                 305800      
002813 3000-LEE-TEMP-FILE               SECTION.                        306000      
002814 3000-LEE-TEMP-FILE-RUT.                                          306200      
002815*                                                                 306400      
002816     OPEN INPUT TEMPFILE.                                         306600      
002817     MOVE 0                       TO IND-FIN-TEMP.                306800      
002818     PERFORM 3020-LEE-TEMPORAL.                                   307000      
002819     PERFORM 3010-LIBERA-LOGS-SORT UNTIL IND-FIN-TEMP = 1.        307200      
002820     CLOSE TEMPFILE WITH PURGE.                                   307400      
002821     GO TO FIN-LEE-TEMP-SECCION.                                  307600      
002822*                                                                 307800      
002823 3010-LIBERA-LOGS-SORT.                                           308000      
002824     MOVE SPACES                  TO REG-SORT-LOG                 308200      
002825     IF RDI-STA-TRN-OPERADO                                       308400      
002826        NEXT SENTENCE                                             308600      
002827     ELSE                                                         308800      
002828        MOVE WS-RDI-CSI-ORI       TO WS-CSI-ORI                   309000      
002829        MOVE WS-RDI-CSI-DES       TO WS-RDI-CSI-ORI               309200      
002830        MOVE WS-CSI-ORI           TO WS-RDI-CSI-DES.              309400      
002831     IF WS-RDI-CSI-ORI = 0  OR WS-RDI-CSI-DES = 0                 309600      
002832        NEXT SENTENCE                                             309800      
002833     ELSE                                                         310000      
002834        MOVE WS-RDI-CSI-ORI       TO SLOG-CSI-ORI                 310200      
002835        MOVE WS-RDI-CSI-DES       TO SLOG-CSI-DES                 310400      
002836        MOVE WS-RDI-APL-ORI       TO SLOG-APL-ORI                 310600      
002837        MOVE WS-RDI-APL-DES       TO SLOG-APL-DES                 310800      
002838        MOVE WS-RDI-FEC-CON       TO SLOG-FEC-CON                 311000      
002839        MOVE WS-RDI-CTA-DES       TO SLOG-CTA-DES                 311200      
002840        MOVE WS-RDI-MON-TRN       TO SLOG-MONEDA                  311400      
002841        MOVE WS-RDI-COD-SER       TO SLOG-CVE-MOV                 311600      
002842        MOVE WS-RDI-IMP-TRN       TO SLOG-IMPORTE                 311800      
002843        MOVE WS-RDI-STA-TRN       TO SLOG-STATUS                  312000      
002844        MOVE WS-REG-DET-INFOICA   TO SLOG-RESTO                   312200      
002845        RELEASE REG-SORT-LOG.                                     312400      
002846*                                                                 312600      
002847     PERFORM 3020-LEE-TEMPORAL.                                   312800      
002848*                                                                 313000      
002849 3020-LEE-TEMPORAL.                                               313200      
002850     READ TEMPFILE              INTO WS-REG-DET-INFOICA           313400      
002851      AT END                                                      313600      
002852          MOVE  1                 TO IND-FIN-TEMP.                313800      
002853*                                                                 314000      
002854***************************************************************** 314200      
002855 FIN-LEE-TEMP-SECCION.   EXIT.                                    314400      
002856/                                                                 314600      
002857***************************************************************** 314800      
002858 3500-REPORTA-LOGS             SECTION.                           315000      
002859 3500-REPORTA-LOGS-RUT.                                           315200      
002860     MOVE LOW-VALUES              TO WS-REG-HIST-DIF.             315400      
002861     MOVE 0                       TO IND-FIN-SORT.                315600      
002862     PERFORM 3513-LEE-SORT.                                       315800      
002863     MOVE ZEROS                   TO W-CAMBIO.                    316000      
002864     MOVE W-MONEDA                TO WS-MONEDA.                   316200      
002865     MOVE W-APL-ORI               TO WS-APL-ORI.                  316400      
002866     MOVE W-CSI-ORI               TO WS-CSI-ORI.                  316600      
002867     MOVE W-FEC-CON               TO WS-FEC-CON.                  316800      
002868     MOVE LOW-VALUES              TO TOTALIZADORES.               317000      
002869     MOVE W-APL-ORI               TO WS-APL-ORI-PTE.              317200      
002870     PERFORM 3590-BUSCASIST.                                      317400      
002871*                                                                 317600      
002872     IF IND-FIN-SORT = 1                                          317800      
002873        MOVE 20                   TO W-CSI-ORI                    318000      
002874        MOVE 20                   TO W-APL-ORI                    318200      
002875        MOVE 20                   TO W-DESTINO                    318400      
002876        GENERATE DET-DIF-VACIO                                    318600      
002877     ELSE                                                         318800      
002878        GENERATE DET-MONEDA                                       319000      
002879        GENERATE DET-FECHA                                        319200      
002880        GENERATE DET-SISTEMA                                      319400      
002881        PERFORM 3510-LISTA-LOG UNTIL IND-FIN-SORT = 1             319600      
002882        PERFORM 3520-TOTAL-GENERAL.                               319800      
002883     GO TO FIN-SECCION-2.                                         320000      
002884*                                                                 320200      
002885/                                                                 320400      
002886 3510-LISTA-LOG.                                                  320600      
002887     IF W-CSI-ORI NOT = WS-CSI-ORI                                320800      
002888        PERFORM 3530-CORTE-X-CSI                                  321000      
002889        GENERATE DET-MONEDA                                       321200      
002890        GENERATE DET-FECHA                                        321400      
002891        GENERATE DET-SISTEMA                                      321600      
002892     ELSE                                                         321800      
002893     IF W-MONEDA NOT = WS-MONEDA                                  322000      
002894        PERFORM 3540-CORTE-X-MONEDA                               322200      
002895        GENERATE DET-MONEDA                                       322400      
002896        GENERATE DET-FECHA                                        322600      
002897        GENERATE DET-SISTEMA                                      322800      
002898     ELSE                                                         323000      
002899     IF W-FEC-CON NOT = WS-FEC-CON                                323200      
002900        PERFORM 3550-CORTE-X-FECHA                                323400      
002901        GENERATE DET-FECHA                                        323600      
002902        GENERATE DET-SISTEMA                                      323800      
002903     ELSE                                                         324000      
002904     IF W-APL-ORI NOT = WS-APL-ORI                                324200      
002905        PERFORM 3560-CORTE-X-SISTEMA                              324400      
002906        GENERATE DET-SISTEMA.                                     324600      
002907*                                                                 324800      
002908     PERFORM 3511-DETALLE.                                        325000      
002909*                                                                 325200      
002910     IF IND-OP = 1 OR IND-OP = 3                                  325400      
002911        MOVE 1                    TO OP-APL                       325600      
002912     ELSE                                                         325800      
002913        MOVE 2                    TO OP-APL.                      326000      
002914*                                                                 326200      
002915     PERFORM 3512-ACUMULA VARYING WS-PTER FROM 1 BY 1             326400      
002916                            UNTIL WS-PTER > 5.                    326600      
002917     PERFORM 3513-LEE-SORT.                                       326800      
002918/                                                                 327000      
002919 3511-DETALLE.                                                    327200      
002920     MOVE SPACES                  TO CVE-DRCR-1 CVE-DRCR-2.       327400      
002921     MOVE 0                       TO WS-CARGOS WS-ABONOS IND-OP.  327600      
002922     IF RDI-COD-SER-CARGO                                         327800      
002923        IF RDI-STA-TRN-OPERADO                                    328000      
002924           MOVE "DR"              TO CVE-DRCR-1                   328200      
002925           MULTIPLY -1 BY WS-RDI-IMP-TRN GIVING WS-CARGOS         328400      
002926           ADD WS-RDI-IMP-TRN     TO WS-RHD-IMP(2,1)              328600      
002927           ADD 1                  TO WS-RHD-NUM(2,1)              328800      
002928           MOVE  1                TO IND-OP                       329000      
002929        ELSE                                                      329200      
002930           MOVE "DR"              TO CVE-DRCR-2                   329400      
002931           MOVE WS-RDI-IMP-TRN    TO WS-ABONOS                    329600      
002932           ADD  WS-RDI-IMP-TRN    TO WS-RHD-IMP(1,1)              329800      
002933           ADD 1                  TO WS-RHD-NUM(1,1)              330000      
002934           MOVE  2                TO IND-OP                       330200      
002935     ELSE                                                         330400      
002936     IF RDI-COD-SER-ABONO                                         330600      
002937        IF RDI-STA-TRN-OPERADO                                    330800      
002938           MOVE "CR"              TO CVE-DRCR-2                   331000      
002939           MOVE WS-RDI-IMP-TRN    TO WS-ABONOS                    331200      
002940           ADD WS-RDI-IMP-TRN     TO WS-RHD-IMP(2,2)              331400      
002941           ADD 1                  TO WS-RHD-NUM(2,2)              331600      
002942           MOVE  1                TO IND-OP                       331800      
002943        ELSE                                                      332000      
002944           MULTIPLY -1 BY WS-RDI-IMP-TRN GIVING WS-CARGOS         332200      
002945           MOVE "CR"              TO CVE-DRCR-1                   332400      
002946           ADD WS-RDI-IMP-TRN     TO WS-RHD-IMP(1,2)              332600      
002947           ADD 1                  TO WS-RHD-NUM(1,2)              332800      
002948           MOVE  2                TO IND-OP                       333000      
002949     ELSE                                                         333200      
002950     IF RDI-COD-SER-ELIMCARGO                                     333400      
002951        IF RDI-STA-TRN-OPERADO                                    333600      
002952           MOVE "DR"              TO CVE-DRCR-2                   333800      
002953           MOVE WS-RDI-IMP-TRN    TO WS-ABONOS                    334000      
002954           ADD WS-RDI-IMP-TRN     TO WS-RHD-IMP(2,3)              334200      
002955           ADD 1                  TO WS-RHD-NUM(2,3)              334400      
002956           MOVE  3                TO IND-OP                       334600      
002957        ELSE                                                      334800      
002958           MOVE "DR"              TO CVE-DRCR-1                   335000      
002959           MULTIPLY -1 BY WS-RDI-IMP-TRN GIVING WS-CARGOS         335200      
002960           ADD WS-RDI-IMP-TRN     TO WS-RHD-IMP(1,3)              335400      
002961           ADD 1                  TO WS-RHD-NUM(1,3)              335600      
002962           MOVE  4                TO IND-OP                       335800      
002963     ELSE                                                         336000      
002964     IF RDI-COD-SER-ELIMABONO                                     336200      
002965        IF RDI-STA-TRN-OPERADO                                    336400      
002966           MOVE "CR"              TO CVE-DRCR-1                   336600      
002967           MULTIPLY -1 BY WS-RDI-IMP-TRN GIVING WS-CARGOS         336800      
002968           ADD WS-RDI-IMP-TRN     TO WS-RHD-IMP(2,4)              337000      
002969           ADD 1                  TO WS-RHD-NUM(2,4)              337200      
002970           MOVE  3                TO IND-OP                       337400      
002971        ELSE                                                      337600      
002972           MOVE "CR"              TO CVE-DRCR-2                   337800      
002973           MOVE WS-RDI-IMP-TRN    TO WS-ABONOS                    338000      
002974           ADD WS-RDI-IMP-TRN     TO WS-RHD-IMP(1,4)              338200      
002975           ADD 1                  TO WS-RHD-NUM(1,4)              338400      
002976           MOVE  4                TO IND-OP.                      338600      
002977/                                                                 338800      
002978     MOVE WS-RDI-CTA-DES          TO WS-PARTE-CTADES.             339000      
002979     MOVE WS-RDI-NOM-EST          TO WS-STA-NAME.                 339200      
002980*                                                                 339400      
002981     IF IND-OP > 0 AND < 9                                        339600      
002982        GENERATE DET-DIFER                                        339800      
002983     ELSE                                                         340000      
002984        MOVE 9                    TO IND-OP.                      340200      
002985*                                                                 340400      
002986 3512-ACUMULA.                                                    340600      
002987*                                                                 340800      
002988     ADD WS-CARGOS                TO TOT-CAR(WS-PTER,OP-APL)      341000      
002989     ADD WS-ABONOS                TO TOT-ABO(WS-PTER,OP-APL).     341200      
002990*                                                                 341400      
002991 3513-LEE-SORT.                                                   341600      
002992*                                                                 341800      
002993     RETURN SORT-LOG                                              342000      
002994      AT END                                                      342200      
002995            MOVE 1                TO IND-FIN-SORT.                342400      
002996     IF IND-FIN-SORT = 0                                          342600      
002997        MOVE SLOG-RESTO           TO WS-REG-DET-INFOICA           342800      
002998        MOVE WS-RDI-CSI-ORI       TO W-CSI-ORI                    343000      
002999        MOVE WS-RDI-APL-ORI       TO W-APL-ORI                    343200      
003000        MOVE WS-RDI-FEC-CON       TO W-FEC-CON                    343400      
003001        MOVE WS-RDI-CSI-DES       TO W-DESTINO                    343600      
003002        MOVE WS-RDI-MON-TRN       TO W-MONEDA.                    343800      
003003*                                                                 344000      
003004/                                                                 344200      
003005 3520-TOTAL-GENERAL.                                              344400      
003006     PERFORM 3530-CORTE-X-CSI.                                    344600      
003007     MOVE 5                       TO WS-PTER.                     344800      
003008     PERFORM 3570-IMPRIME-TOTAL.                                  345000      
003009     MOVE LOW-VALUES              TO TOTALIZADORES.               345200      
003010*                                                                 345400      
003011 3530-CORTE-X-CSI.                                                345600      
003012     PERFORM 3540-CORTE-X-MONEDA.                                 345800      
003013     MOVE 4                       TO WS-PTER.                     346000      
003014     PERFORM 3570-IMPRIME-TOTAL.                                  346200      
003015     MOVE W-CSI-ORI               TO WS-CSI-ORI.                  346400      
003016     ADD  1                       TO W-CAMBIO.                    346600      
003017*                                                                 346800      
003018 3540-CORTE-X-MONEDA.                                             347000      
003019     PERFORM 3550-CORTE-X-FECHA.                                  347200      
003020     MOVE 3                       TO WS-PTER.                     347400      
003021     PERFORM 3570-IMPRIME-TOTAL.                                  347600      
003022     MOVE W-MONEDA                TO WS-MONEDA.                   347800      
003023*                                                                 348000      
003024 3550-CORTE-X-FECHA.                                              348200      
003025     PERFORM 3560-CORTE-X-SISTEMA.                                348400      
003026     MOVE 2                       TO WS-PTER.                     348600      
003027     PERFORM 3570-IMPRIME-TOTAL.                                  348800      
003028     MOVE W-FEC-CON               TO WS-FEC-CON.                  349000      
003029*                                                                 349200      
003030 3560-CORTE-X-SISTEMA.                                            349400      
003031     MOVE 1                       TO WS-PTER.                     349600      
003032     PERFORM 3570-IMPRIME-TOTAL.                                  349800      
003033     MOVE WS-APL-ORI              TO WS-RHD-SIS.                  350000      
003034     MOVE WS-FECHA-AMD            TO WS-RHD-FEC.                  350200      
003035     MOVE WS-MONEDA               TO WS-RHD-MON.                  350400      
003036     MOVE WS-CSI-ORI              TO WS-RHD-CSI.                  350600      
003037     MOVE W-APL-ORI               TO WS-APL-ORI.                  350800      
003038     MOVE W-APL-ORI               TO WS-APL-ORI-PTE.              351000      
003039     PERFORM 3590-BUSCASIST.                                      351200      
003040*                                                                 351400      
003041     WRITE REG-HIST-DIF         FROM WS-REG-HIST-DIF              351600      
003042      INVALID KEY                                                 351800      
003043*ASM          DISPLAY "010105 02  " WS-PROGRAMA,                  351900      
003044*ASM                  " ESP. INSUF. HIST DIFERENCIAS"             352000      
003045              MOVE SPACES            TO WLI-TEXTO-LJ, TEXTO-LJ    352020      
003046              MOVE "I"               TO WLI-TIPO-LJ,  TIPO-LJ     352040      
003047              MOVE 010105            TO CODIGO-LJ                 352060      
003048              MOVE "ESPACIO INSUF. EN HIST DIFERENCIAS"           352080      
003049                                     TO WLI-TEXTO-LJ, TEXTO-LJ    352100      
003050              PERFORM      000-030-IMPRIME-MENSAJE                352120      
003051              SET MYSELF(STATUS)  TO -1.                          352200      
003052     MOVE LOW-VALUES              TO WS-REG-HIST-DIF.             352400      
003053*                                                                 352600      
003054/                                                                 352800      
003055 3570-IMPRIME-TOTAL.                                              353000      
003056*                                                                 353200      
003057     MOVE ZEROS                   TO WS-CARGOS WS-ABONOS.         353400      
003058     COMPUTE TOT-DIF(WS-PTER) =   TOT-CAR(WS-PTER,1)              353600      
003059                              +   TOT-CAR(WS-PTER,2).             353800      
003060     COMPUTE WS-CARGOS        =   TOT-DIF(WS-PTER).               354000      
003061     COMPUTE TOT-DIF(WS-PTER) =   TOT-ABO(WS-PTER,1)              354200      
003062                              +   TOT-ABO(WS-PTER,2).             354400      
003063     COMPUTE WS-ABONOS        =   TOT-DIF(WS-PTER).               354600      
003064     IF WS-PTER = 1                                               354800      
003065        GENERATE TOT-SISTEMA                                      355000      
003066     ELSE                                                         355200      
003067     IF WS-PTER = 2                                               355400      
003068        GENERATE TOT-FEC                                          355600      
003069     ELSE                                                         355800      
003070     IF WS-PTER = 3                                               356000      
003071        GENERATE TOT-MON                                          356200      
003072     ELSE                                                         356400      
003073     IF WS-PTER = 4                                               356600      
003074        GENERATE TOT-CSI                                          356800      
003075     ELSE                                                         357000      
003076     IF WS-PTER = 5                                               357200      
003077        GENERATE TOT-GRAL.                                        357400      
003078*                                                                 357600      
003079     MOVE ZEROS                   TO WS-CARGOS WS-ABONOS.         357800      
003080     COMPUTE TOT-DIF(WS-PTER) =                                   358000      
003081             TOT-CAR(WS-PTER,1) + TOT-ABO(WS-PTER,1) +            358200      
003082             TOT-CAR(WS-PTER,2) + TOT-ABO(WS-PTER,2) .            358400      
003083     IF TOT-DIF(WS-PTER) < 0                                      358600      
003084        COMPUTE WS-CARGOS     =   TOT-DIF(WS-PTER)                358800      
003085     ELSE                                                         359000      
003086        COMPUTE WS-ABONOS     =   TOT-DIF(WS-PTER).               359200      
003087     GENERATE SALDO.                                              359400      
003088*                                                                 359600      
003089     MOVE LOW-VALUES              TO TOT-SIS-CSI(WS-PTER).        359800      
003090*                                                                 360000      
003091 3590-BUSCASIST.                                                  360200      
003092*                                                                 360400      
003093*ASM  MOVE ZEROS                  TO LLAVE-GUARDIAN.              360600      
003094*ASM  MOVE WS-APL-ORI-PTE         TO RG-APL.                      360800      
003095*ASM  MOVE ZEROS                  TO WS-ENCONTRE-SIST.            361000      
003096*ASM  READ GUARDIAN             INTO WS-REG-GUARDIAN              361200      
003097*ASM   INVALID KEY       MOVE 1   TO WS-ENCONTRE-SIST.            361400      
003098*                                                                 361600      
003099      MOVE SPACES                 TO WS-SISTEMA-LG.               361800      
003100      MOVE SPACES                 TO WS-SISTEMA-CR.               362000      
003101*ASM  IF ENCONTRE-SIST                                            362200      
003102         MOVE WKS-NUMCSI          TO WS-SIS-SIGLAS                362400      
003103         MOVE WKS-NOMCSI          TO WS-SISTEMA-LG.               362600      
003104*                                                                 362800      
003105*                                                                 363000      
003106 FIN-SECCION-2. EXIT.                                             363200      
003107/                                                                 363400      
003108***************************************************************** 363600      
003109 5000-ENLACE-S028-SEC          SECTION.                           363800      
003110 5000-ENLACE-S028.                                                364000      
003111*                                                                 364200      
003112     MOVE 0                       TO IND-FIN-SORT.                364400      
003113     OPEN INPUT S028MANIOBRA.                                     364600      
003114     PERFORM 5020-LEE-S028MAN.                                    364800      
003115     MOVE ZEROS                   TO W-CAMBIO.                    365000      
003116     MOVE W-MONEDA                TO WS-MONEDA.                   365200      
003117     MOVE W-FEC-CON               TO WS-FEC-CON.                  365400      
003118     MOVE W-SUC                   TO WS-SUC.                      365600      
003119     MOVE W-TREP                  TO WS-TREP.                     365800      
003120     MOVE W-APL-ORI               TO WS-APL-ORI.                  366000      
003121     MOVE W-CSI-ORI               TO WS-CSI-ORI.                  366200      
003122     MOVE LOW-VALUES              TO TOTALIZADORES.               366400      
003123     MOVE W-APL-ORI               TO WS-APL-ORI-PTE.              366600      
003124     PERFORM 5022-BUSCASIST.                                      366800      
003125*                                                                 367000      
003126     IF IND-FIN-SORT = 1                                          367200      
003127        NEXT SENTENCE                                             367400      
003128     ELSE                                                         367600      
003129        PERFORM 5013-CREA-MOVSXTERM                               367800      
003130        GENERATE DET-MONEDA-1                                     368000      
003131        GENERATE DET-FECHA-1                                      368200      
003132        GENERATE DET-SISTEMA-1                                    368400      
003133        PERFORM 5010-LISTA-S028 UNTIL IND-FIN-SORT = 1            368600      
003134        PERFORM 5012-CORTE-X-CSI.                                 368800      
003135     CLOSE S028MANIOBRA WITH PURGE.                               369000      
003136/                                                                 369200      
003137 5010-LISTA-S028.                                                 369400      
003138     IF W-CSI-ORI NOT = WS-CSI-ORI                                369600      
003139        PERFORM 5012-CORTE-X-CSI                                  369800      
003140        PERFORM 5013-CREA-MOVSXTERM                               370000      
003141        GENERATE DET-MONEDA-1                                     370200      
003142        GENERATE DET-FECHA-1                                      370400      
003143        GENERATE DET-SISTEMA-1                                    370600      
003144     ELSE                                                         370800      
003145     IF W-SUC     NOT = WS-SUC                                    371000      
003146        PERFORM 5014-CORTE-X-SUC                                  371200      
003147        GENERATE DET-MONEDA-1                                     371400      
003148        GENERATE DET-FECHA-1                                      371600      
003149        GENERATE DET-SISTEMA-1                                    371800      
003150     ELSE                                                         372000      
003151     IF W-TREP    NOT = WS-TREP                                   372200      
003152        PERFORM 5014-CORTE-X-SUC                                  372400      
003153        ADD 1 TO W-CAMBIO                                         372600      
003154        GENERATE DET-MONEDA-1                                     372800      
003155        GENERATE DET-FECHA-1                                      373000      
003156        GENERATE DET-SISTEMA-1                                    373200      
003157     ELSE                                                         373400      
003158     IF W-MONEDA  NOT = WS-MONEDA                                 373600      
003159        PERFORM 5015-CORTE-X-MONEDA                               373800      
003160        GENERATE DET-MONEDA-1                                     374000      
003161        GENERATE DET-FECHA-1                                      374200      
003162        GENERATE DET-SISTEMA-1                                    374400      
003163     ELSE                                                         374600      
003164     IF W-FEC-CON NOT = WS-FEC-CON                                374800      
003165        PERFORM 5016-CORTE-X-FECHA                                375000      
003166        GENERATE DET-FECHA-1                                      375200      
003167        GENERATE DET-SISTEMA-1                                    375400      
003168     ELSE                                                         375600      
003169     IF W-APL-ORI NOT = WS-APL-ORI                                375800      
003170        PERFORM 5017-CORTE-X-SISTEMA                              376000      
003171        GENERATE DET-SISTEMA-1.                                   376200      
003172*                                                                 376400      
003173     PERFORM 5011-DETALLE.                                        376600      
003174     IF IND-OP = 1 OR IND-OP = 3                                  376800      
003175        MOVE 1                    TO OP-APL                       377000      
003176     ELSE                                                         377200      
003177        MOVE 2                    TO OP-APL.                      377400      
003178     PERFORM 5011-ACUMULA VARYING WS-PTER FROM 1 BY 1             377600      
003179                            UNTIL WS-PTER > 5.                    377800      
003180*                                                                 378000      
003181     PERFORM 5020-LEE-S028MAN.                                    378200      
003182/                                                                 378400      
003183 5011-DETALLE.                                                    378600      
003184     MOVE SPACES                  TO CVE-DRCR-1 CVE-DRCR-2.       378800      
003185     MOVE 0                       TO WS-CARGOS WS-ABONOS IND-OP.  379000      
003186     IF RDI-COD-SER-CARGO                                         379200      
003187        IF RDI-STA-TRN-OPERADO                                    379400      
003188           MOVE "CR"              TO CVE-DRCR-1                   379600      
003189           MULTIPLY -1 BY WS-RDI-IMP-TRN GIVING WS-CARGOS         379800      
003190           ADD  WS-RDI-IMP-TRN    TO WS-R028-ICAR                 380000      
003191           ADD   1                TO WS-R028-NCAR                 380200      
003192           MOVE  1                TO IND-OP                       380400      
003193        ELSE                                                      380600      
003194           MOVE "CR"              TO CVE-DRCR-2                   380800      
003195           MOVE WS-RDI-IMP-TRN    TO WS-ABONOS                    381000      
003196           ADD  WS-RDI-IMP-TRN    TO WS-R028-IABO                 381200      
003197           ADD   1                TO WS-R028-NABO                 381400      
003198           MOVE  2                TO IND-OP                       381600      
003199     ELSE                                                         381800      
003200     IF RDI-COD-SER-ABONO                                         382000      
003201        IF RDI-STA-TRN-OPERADO                                    382200      
003202           MOVE "DR"              TO CVE-DRCR-2                   382400      
003203           MOVE WS-RDI-IMP-TRN    TO WS-ABONOS                    382600      
003204           ADD  WS-RDI-IMP-TRN    TO WS-R028-IABO                 382800      
003205           ADD   1                TO WS-R028-NABO                 383000      
003206           MOVE  1                TO IND-OP                       383200      
003207        ELSE                                                      383400      
003208           MULTIPLY -1 BY WS-RDI-IMP-TRN GIVING WS-CARGOS         383600      
003209           MOVE "DR"              TO CVE-DRCR-1                   383800      
003210           ADD  WS-RDI-IMP-TRN    TO WS-R028-ICAR                 384000      
003211           ADD   1                TO WS-R028-NCAR                 384200      
003212           MOVE  2                TO IND-OP                       384400      
003213     ELSE                                                         384600      
003214     IF RDI-COD-SER-ELIMCARGO                                     384800      
003215        IF RDI-STA-TRN-OPERADO                                    385000      
003216           MOVE "CR"              TO CVE-DRCR-2                   385200      
003217           MOVE WS-RDI-IMP-TRN    TO WS-ABONOS                    385400      
003218           ADD  WS-RDI-IMP-TRN    TO WS-R028-IABO                 385600      
003219           ADD   1                TO WS-R028-NABO                 385800      
003220           MOVE  3                TO IND-OP                       386000      
003221        ELSE                                                      386200      
003222           MOVE "CR"              TO CVE-DRCR-1                   386400      
003223           MULTIPLY -1 BY WS-RDI-IMP-TRN GIVING WS-CARGOS         386600      
003224           ADD  WS-RDI-IMP-TRN    TO WS-R028-ICAR                 386800      
003225           ADD   1                TO WS-R028-NCAR                 387000      
003226           MOVE  4                TO IND-OP                       387200      
003227     ELSE                                                         387400      
003228     IF RDI-COD-SER-ELIMABONO                                     387600      
003229        IF RDI-STA-TRN-OPERADO                                    387800      
003230           MOVE "DR"              TO CVE-DRCR-1                   388000      
003231           MULTIPLY -1 BY WS-RDI-IMP-TRN GIVING WS-CARGOS         388200      
003232           ADD  WS-RDI-IMP-TRN    TO WS-R028-ICAR                 388400      
003233           ADD   1                TO WS-R028-NCAR                 388600      
003234           MOVE  3                TO IND-OP                       388800      
003235        ELSE                                                      389000      
003236           MOVE "DR"              TO CVE-DRCR-2                   389200      
003237           MOVE WS-RDI-IMP-TRN    TO WS-ABONOS                    389400      
003238           ADD  WS-RDI-IMP-TRN    TO WS-R028-IABO                 389600      
003239           ADD   1                TO WS-R028-NABO                 389800      
003240           MOVE  4                TO IND-OP.                      390000      
003241/                                                                 390200      
003242     MOVE WS-RDI-CTA-DES          TO WS-PARTE-CTADES.             390400      
003243     MOVE WS-RDI-NOM-EST          TO WS-STA-NAME.                 390600      
003244*                                                                 390800      
003245     IF IND-OP > 0 AND < 9                                        391000      
003246        GENERATE DET-DIFER-1                                      391200      
003247     ELSE                                                         391400      
003248        MOVE 9                    TO IND-OP.                      391600      
003249*                                                                 391800      
003250 5011-ACUMULA.                                                    392000      
003251*                                                                 392200      
003252     ADD WS-CARGOS                TO TOT-CAR(WS-PTER,OP-APL).     392400      
003253     ADD WS-ABONOS                TO TOT-ABO(WS-PTER,OP-APL).     392600      
003254*                                                                 392800      
003255 5012-CORTE-X-CSI.                                                393000      
003256     PERFORM 5014-CORTE-X-SUC.                                    393200      
003257     MOVE 5                       TO WS-PTER.                     393400      
003258*    PERFORM 5018-IMPRIME-TOTAL.                                  393600      
003259*    ADD 1                        TO W-CAMBIO.                    393800      
003260     MOVE LOW-VALUES              TO TOTALIZADORES.               394000      
003261     MOVE W-CSI-ORI               TO WS-CSI-ORI.                  394200      
003262*                                                                 394400      
003263*    WRITE REG-MOVSXTERM        FROM WS-REG-TRA-S028              394600      
003264*     INVALID KEY                                                 394800      
003265*          DISPLAY "010105 02  " WS-PROGRAMA,                     394900      
003266*                  "ESP. INSUF. REG. TRAILER DEL "                395000      
003267*                   WS-NOMB-S028                                  395200      
003268*          SET MYSELF(STATUS)     TO -1.                          395400      
003269*    CLOSE MOVSXTERM WITH SAVE.                                   395600      
003270     MOVE LOW-VALUES              TO WS-REG-TRA-S028.             395800      
003271     MOVE "TR"                    TO WS-R028-CTRA.                396000      
003272*                                                                 396200      
003273 5013-CREA-MOVSXTERM.                                             396400      
003274     MOVE ABR-CSI-TC  (W-CSI-ORI) TO WS-NS028-CSI.                396600      
003275     CHANGE ATTRIBUTE TITLE OF MOVSXTERM TO WS-NOMB-S028.         396800      
003276*    OPEN OUTPUT MOVSXTERM.                                       397000      
003277*    WRITE REG-MOVSXTERM        FROM WS-REG-CTL-S028              397200      
003278*     INVALID KEY                                                 397400      
003279*          DISPLAY "010105 02  " WS-PROGRAMA,                     397500      
003280*                  " ESP. INSUF. REG. CTL DEL "                   397600      
003281*                   WS-NOMB-S028                                  397800      
003282*          SET MYSELF(STATUS)     TO -1.                          398000      
003283*                                                                 398200      
003284/                                                                 398400      
003285 5014-CORTE-X-SUC.                                                398600      
003286     PERFORM 5015-CORTE-X-MONEDA.                                 398800      
003287     MOVE 4                       TO WS-PTER.                     399000      
003288     PERFORM 5018-IMPRIME-TOTAL.                                  399200      
003289     MOVE W-SUC                   TO WS-SUC.                      399400      
003290     MOVE W-TREP                  TO WS-TREP.                     399600      
003291*                                                                 399800      
003292 5015-CORTE-X-MONEDA.                                             400000      
003293     PERFORM 5016-CORTE-X-FECHA.                                  400200      
003294     MOVE 3                       TO WS-PTER.                     400400      
003295     PERFORM 5018-IMPRIME-TOTAL.                                  400600      
003296     MOVE W-MONEDA                TO WS-MONEDA.                   400800      
003297*                                                                 401000      
003298 5016-CORTE-X-FECHA.                                              401200      
003299     PERFORM 5017-CORTE-X-SISTEMA.                                401400      
003300     MOVE 2                       TO WS-PTER.                     401600      
003301     PERFORM 5018-IMPRIME-TOTAL.                                  401800      
003302     MOVE W-FEC-CON               TO WS-FEC-CON.                  402000      
003303*                                                                 402200      
003304 5017-CORTE-X-SISTEMA.                                            402400      
003305     MOVE 1                       TO WS-PTER.                     402600      
003306     PERFORM 5018-IMPRIME-TOTAL.                                  402800      
003307     MOVE WS-SUC                  TO WS-R028-SUC.                 403000      
003308     MOVE WS-SIS-SIGLAS           TO WS-R028-TERM.                403200      
003309     MOVE WS-MONEDA               TO WS-R028-MON.                 403400      
003310     MOVE "DIF COMPENSACION"      TO WS-R028-LEY.                 403600      
003311     MOVE W-APL-ORI               TO WS-APL-ORI.                  403800      
003312     MOVE W-APL-ORI               TO WS-APL-ORI-PTE.              404000      
003313     PERFORM 5022-BUSCASIST.                                      404200      
003314*                                                                 404400      
003315*    IF WS-TREP = 1                                               404600      
003316*       WRITE REG-MOVSXTERM     FROM WS-REG-MOV-S028              404800      
003317*        INVALID KEY                                              405000      
003318*             DISPLAY "010105 02  " WS-PROGRAMA,                  405100      
003319*                     " ESP. INSUF. MOVSXTERM"                    405200      
003320*             SET MYSELF(STATUS)  TO -1.                          405400      
003321*                                                                 405600      
003322     IF WS-TREP = 1                                               405800      
003323        ADD  1                    TO WS-R028-TREG                 406000      
003324        ADD WS-R028-ICAR          TO WS-R028-TCAR                 406200      
003325        ADD WS-R028-IABO          TO WS-R028-TABO.                406400      
003326     MOVE LOW-VALUES              TO WS-REG-MOV-S028.             406600      
003327*                                                                 406800      
003328/                                                                 407000      
003329 5018-IMPRIME-TOTAL.                                              407200      
003330*                                                                 407400      
003331     MOVE ZEROS                   TO WS-CARGOS WS-ABONOS.         407600      
003332     COMPUTE TOT-DIF(WS-PTER) =   TOT-CAR(WS-PTER,1)              407800      
003333                              +   TOT-CAR(WS-PTER,2).             408000      
003334     COMPUTE WS-CARGOS        =   TOT-DIF(WS-PTER).               408200      
003335     COMPUTE TOT-DIF(WS-PTER) =   TOT-ABO(WS-PTER,1)              408400      
003336                              +   TOT-ABO(WS-PTER,2).             408600      
003337     COMPUTE WS-ABONOS        =   TOT-DIF(WS-PTER).               408800      
003338     IF WS-PTER = 1                                               409000      
003339        GENERATE TOT-SISTEMA-1                                    409200      
003340     ELSE                                                         409400      
003341     IF WS-PTER = 2                                               409600      
003342        GENERATE TOT-FECHA-1                                      409800      
003343     ELSE                                                         410000      
003344     IF WS-PTER = 3                                               410200      
003345        GENERATE TOT-MONEDA-1                                     410400      
003346     ELSE                                                         410600      
003347     IF WS-PTER = 4                                               410800      
003348        GENERATE TOT-SUCURSAL-1                                   411000      
003349     ELSE                                                         411200      
003350     IF WS-PTER = 5                                               411400      
003351        GENERATE TOT-CSI-1.                                       411600      
003352*                                                                 411800      
003353     MOVE ZEROS                   TO WS-CARGOS WS-ABONOS.         412000      
003354     COMPUTE TOT-DIF(WS-PTER) =                                   412200      
003355             TOT-CAR(WS-PTER,1) + TOT-ABO(WS-PTER,1) +            412400      
003356             TOT-CAR(WS-PTER,2) + TOT-ABO(WS-PTER,2) .            412600      
003357     IF TOT-DIF(WS-PTER) < 0                                      412800      
003358        COMPUTE WS-CARGOS     =   TOT-DIF(WS-PTER)                413000      
003359     ELSE                                                         413200      
003360        COMPUTE WS-ABONOS     =   TOT-DIF(WS-PTER).               413400      
003361     GENERATE SALDO-1.                                            413600      
003362*                                                                 413800      
003363     MOVE LOW-VALUES              TO TOT-SIS-CSI(WS-PTER).        414000      
003364*                                                                 414200      
003365/                                                                 414400      
003366 5020-LEE-S028MAN.                                                414600      
003367     READ S028MANIOBRA          INTO WS-REG-SORT-S028             414800      
003368      AT END                                                      415000      
003369            MOVE 1             TO IND-FIN-SORT.                   415200      
003370     IF IND-FIN-SORT           =  0                               415400      
003371        MOVE WS-RS-RESTO       TO WS-REG-DET-INFOICA              415600      
003372        MOVE WS-RS-CSI         TO W-CSI-ORI                       415800      
003373        MOVE WS-RS-FEC-CON     TO W-FEC-CON                       416000      
003374        MOVE WS-RS-APL         TO W-APL-ORI                       416200      
003375        MOVE WS-RS-SUC         TO W-SUC                           416400      
003376        MOVE WS-RS-TREP        TO W-TREP                          416600      
003377        MOVE WS-RS-MON         TO W-MONEDA.                       416800      
003378*                                                                 417000      
003379 5022-BUSCASIST.                                                  417200      
003380*                                                                 417400      
003381*ASM  MOVE ZEROS                  TO LLAVE-GUARDIAN.              417600      
003382*ASM  MOVE WS-APL-ORI-PTE         TO RG-APL.                      417800      
003383*ASM  MOVE ZEROS                  TO WS-ENCONTRE-SIST.            418000      
003384*ASM  READ GUARDIAN             INTO WS-REG-GUARDIAN              418200      
003385*ASM   INVALID KEY       MOVE 1   TO WS-ENCONTRE-SIST.            418400      
003386*                                                                 418600      
003387      MOVE SPACES                 TO WS-SISTEMA-LG.               418800      
003388      MOVE SPACES                 TO WS-SISTEMA-CR.               419000      
003389*ASM  IF ENCONTRE-SIST                                            419200      
003390         MOVE WKS-NUMCSI          TO WS-SIS-SIGLAS                419400      
003391         MOVE WKS-NOMCSI          TO WS-SISTEMA-LG.               419600      
003392*                                                                 419800      
003393 FIN-PROGRAMA.         EXIT.                                      420000      
003394/                                                                 420200      
