000001***************************************************************** 000100      
000002**                                                             ** 000300      
000003**         @@@@@@   @@@@@@     @@@@@@@@    @@@@@@              ** 000500      
000004**         @@    @@ @ @@@@     @@   @@@    @ @@@@              ** 000700      
000005**         @@         @@@@     @@            @@@@              ** 000900      
000006**          @@@@@@    @@@@      @@@@@@@      @@@@              ** 001100      
000007**               @@   @@@@            @@     @@@@              ** 001300      
000008**        @@     @@   @@@@      @@    @@     @@@@              ** 001500      
000009**          @@@@@@   @@@@@@      @@@@@@     @@@@@@             ** 001700      
000010***************************************************************** 001900      
000011***************************************************************** 002100      
000012**        internacional de sistemas de imagen isi              ** 002300      
000013**                                                             ** 002500      
000014**       @@@@@@@@@  @@@@@@@@  @@@@@@@   @@@@@@@@               ** 002700      
000015**       @@     @@  @@@@@@@@  @  @@@@   @@@@@@@@               ** 002900      
000016**       @@     @@  @@    @@     @@@@        @@@               ** 003100      
000017**       @@@@@@@@@  @@    @@     @@@@        @@@               ** 003300      
000018**       @@         @@    @@     @@@@        @@@               ** 003500      
000019**       @@         @@    @@     @@@@        @@@               ** 003700      
000020**       @@         @@@@@@@@     @@@@        @@@               ** 003900      
000021**       @@         @@@@@@@@   @@@@@@@@      @@@               ** 004100      
000022***************************************************************** 004300      
000023**       Recepcion de mensajes del S702                        ** 004500      
000024**       RECIBIR DEL S702 LAS RESPUESTAS DE CONFIRMACION       ** 004700      
000025**       DE MOVIMIENTOS DE PROTECCION DE COBROS.               ** 004900      
000026**       (LRA)LAURA RAMOS AGUILAR ISI                          ** 005100      
000027**                                                             ** 005110      
000028** RECOMPILACION POR EL UPGRADE DEL MCP A 55                   ** 005120      
000029** 20141208 15MTP001 MJGRG                                     ** 005130      
000030***************************************************************** 005300      
000031 IDENTIFICATION DIVISION.                                         005500      
000032 PROGRAM-ID.        S151-P017.                                    005700      
000033 AUTHOR.            ISI.                                          005900      
000034 DATE-WRITTEN.      MARZO 2012.                                   006100      
000035 ENVIRONMENT DIVISION.                                            006300      
000036 INPUT-OUTPUT SECTION.                                            006500      
000037 FILE-CONTROL.                                                    006700      
000038     SELECT L02-MONITOR ASSIGN TO DISK.                           006900      
000039     SELECT L01-DISPLAY ASSIGN TO DISK.                           007100      
000040                                                                  007300      
000041 DATA DIVISION.                                                   007500      
000042 FILE SECTION.                                                    007700      
000043     FD L01-DISPLAY VALUE OF PROTECTION    IS PROTECTED,          007900      
000044                    VALUE TITLE IS WKS-RUT-L01.                   008100      
000045                                                                  008300      
000046     01 REG-DISPLAY                   PIC X(180).                 008500      
000047                                                                  008700      
000048     FD L02-MONITOR VALUE OF PROTECTION    IS PROTECTED,          008900      
000049                    VALUE TITLE IS WKS-RUT-L02.                   009100      
000050     01 REG-MONITOR.                                              009300      
000051          05 WKS-SENTIDO-MSG            PIC X(30).                009500      
000052          05 WKS-ESPACIO1               PIC X(01).                009700      
000053          05 WKS-FEC-MON                PIC 9(06).                009900      
000054          05 WKS-HRS-MON                PIC 9(08).                010100      
000055          05 WKS-ESPACIO2               PIC X(01).                010300      
000056          05 WKS-LLAVE-MSG              PIC X(10).                010500      
000057          05 WKS-ESPACIO3               PIC X(01).                010700      
000058          05 WKS-DATOS-MSJ              PIC X(1000).              010900      
000059                                                                  011100      
000060 DATA-BASE SECTION.                                               011300      
000061     DB S151BD13BIFIN.                                            011500      
000062 WORKING-STORAGE SECTION.                                         011700      
000063   01 WKS-REG-MSG                PIC X(534) WITH LOWER-BOUNDS.    011900      
000064   01 WKS-REG-MSG-R REDEFINES WKS-REG-MSG.                        012100      
000065       03 WKS-HDR-MSG.                                            012300      
000066           05 WKS-HDR-PREFIJO                       PIC X(001).   012500      
000067           05 WKS-HDR-APLDEST                       PIC X(001).   012700      
000068           05 WKS-HDR-CCRDEST                       PIC 9(002).   012900      
000069           05 WKS-HDR-LSNORGN                       PIC 9(004).   013100      
000070           05 WKS-HDR-LSNORGN-H                     REDEFINES     013300      
000071           WKS-HDR-LSNORGN                      PIC 9(08) COMP.   013500      
000072           05 WKS-HDR-STATION                       PIC X(008).   013700      
000073           05 WKS-HDR-STATION-R REDEFINES WKS-HDR-STATION.        013900      
000074               07 WKS-HDR-STA-TIPO                  PIC X(001).   014100      
000075               07 WKS-HDR-STA-SUC                   PIC 9(004).   014300      
000076               07 WKS-HDR-STA-PRIV                  PIC X(001).   014500      
000077               07 WKS-HDR-STA-CAJA                  PIC 9(002).   014700      
000078           05 WKS-HDR-CCRORGN                       PIC 9(002).   014900      
000079           05 WKS-HDR-COPORGN                       PIC 9(002).   015100      
000080           05 WKS-HDR-FACULTAD                      PIC X(002).   015300      
000081           05 WKS-HDR-APLORIG                       PIC X(001).   015500      
000082           05 WKS-HDR-RSLTDO                        PIC 9(002).   015700      
000083               88 W88-HDR-VINO-TERM             VALUE 11, 12.     015900      
000084               88 W88-HDR-VINO-APLI             VALUE 02, 04.     016100      
000085               88 W88-MSGRES-REDFOR             VALUE 12.         016300      
000086               88 W88-MSGRES-MAS                VALUE 3.          016500      
000087               88 W88-MSGRES-TER                VALUE 1.          016700      
000088               88 W88-MSGRES-ERR                VALUE 31, 32, 33. 016900      
000089           05 WKS-HDR-MASCARA                       PIC X(005).   017100      
000090           05 WKS-HDR-PASSWORD                      PIC X(006).   017300      
000091       03 WKS-MSG-TEXTO                             PIC X(498).   017500      
000092       03 WKS-MSG-TEXTO-R REDEFINES WKS-MSG-TEXTO.                017700      
000093           05 WKS-ACA.                                            017900      
000094               10 WKS-ACA-DESTINO                  PIC 9(06).     018100      
000095               10 WKS-ACA-ORIGEN                   PIC 9(06).     018300      
000096           05 WKS-SA0.                                            018500      
000097               10 WKS-SA0-TRN-DEST                 PIC 9(09).     018700      
000098               10 WKS-SA0-TRN-DEST-R REDEFINES WKS-SA0-TRN-DEST.  018900      
000099                   15 WKS-SA0-TRN-DSIS             PIC 9(04).     019100      
000100                       88 W88-SA0-TRN-DSIS-S151     VALUE 0151.   019300      
000101                   15 WKS-SA0-TRN-DCOD             PIC 9(02).     019500      
000102                   15 WKS-SA0-TRN-DSCOD            PIC 9(03).     019700      
000103               10 WKS-SA0-TRN-ORIG                 PIC 9(09).     019900      
000104               10 WKS-SA0-TRN-DEST-O REDEFINES WKS-SA0-TRN-ORIG.  020100      
000105                   15 WKS-SA0-TRN-OSIS             PIC 9(04).     020300      
000106                       88 W88-SA0-TRN-OSIS-S702     VALUE 0702.   020500      
000107                       88 W88-SA0-TRN-OSIS-C845     VALUE 0845.   020700      
000108                   15 WKS-SA0-TRN-OCOD             PIC 9(02).     020900      
000109                   15 WKS-SA0-TRN-OSCOD            PIC 9(03).     021100      
000110               10 WKS-SA0-DIRECCION                PIC 9(01).     021300      
000111                   88 W88-SA0-ALTA                 VALUE  1.      021500      
000112                   88 W88-SA0-RESP                 VALUE  2.      021700      
000113                   88 W88-SA0-BAJA                 VALUE  3.      021900      
000114                   88 W88-SA0-RES-BAJA             VALUE  4.      022100      
000115               10 WKS-SA0-LONG                     PIC 9(04).     022300      
000116               10 WKS-SA0-TIEMPO-ESPERA            PIC 9(05).     022500      
000117               10 WKS-SA0-RESPUESTA                PIC 9(02).     022700      
000118           05 WKS-SA2.                                            022900      
000119               10 WKS-SA2-ID-FMT.                                 023100      
000120                   15 WKS-SA2-IDENT-FMT             PIC 9(02).    023300      
000121                   15 WKS-SA2-RECONOC               PIC 9(01).    023500      
000122               10 WKS-SA2-VERSION                  PIC X(01).     023700      
000123               10 WKS-SA2-CLASE                    PIC 9(01).     023900      
000124               10 WKS-SA2-RESULTADO                PIC 9(01).     024100      
000125               10 WKS-SA2-MODO                     PIC 9(01).     024300      
000126               10 WKS-SA2-IDENTIFICACION.                         024500      
000127                   15 WKS-SA2-SUCURSAL             PIC 9(04).     024700      
000128                   15 WKS-SA2-IDEN-CAJA            PIC 9(03).     024900      
000129                   15 WKS-SA2-IDEN-CAJA-R                         025100      
000130                                     REDEFINES WKS-SA2-IDEN-CAJA. 025300      
000131                       20 WKS-SA2-PRIV              PIC X(01).    025500      
000132                       20 WKS-SA2-CAJA              PIC 9(02).    025700      
000133                   15 WKS-SA2-TRN-NUM              PIC 9(08).     025900      
000134                   15 WKS-SA2-FEC-HR               PIC 9(12).     026100      
000135                   15 WKS-SA2-FEC-HR-R REDEFINES  WKS-SA2-FEC-HR. 026300      
000136                       20 WKS-SA2-FECHA             PIC 9(06).    026500      
000137                       20 WKS-SA2-HORA              PIC 9(06).    026700      
000138               10 WKS-SA2-MODALIDAD                PIC 9(02).     026900      
000139               10 WKS-SA2-IEFE-NOPE                PIC X(10).     027100      
000140               10 WKS-SA2-IEFE-NOPE-R              REDEFINES      027300      
000141                   WKS-SA2-IEFE-NOPE.                             027500      
000142                   15 WKS-SA2-INDEFECTIVO          PIC X(01).     027700      
000143                   15 WKS-SA2-FILLER               PIC X(01).     027900      
000144                   15 WKS-SA2-OPERADOR             PIC X(08).     028100      
000145               10 WKS-SA2-VER-OPC                  PIC X(01).     028300      
000146           05 WKS-AREA-USUARIO                    PIC X(409).     028500      
000147                                                                  028700      
000148 01 WKS-AREA-MSG-OBL                               PIC X(409).    028900      
000149 01 WKS-AREA-MSG-OBL-SERV1 REDEFINES WKS-AREA-MSG-OBL.            029100      
000150    10 MSG-R01-CONTRATO                            PIC 9(16).     029300      
000151    10 MSG-R01-CVEMDA                              PIC 9(04).     029500      
000152    10 MSG-R01-MDA-SUC                             PIC 9(04).     029700      
000153    10 MSG-R01-MDA-CTA                             PIC 9(16).     029900      
000154    10 MSG-R01-AUTORIZA                            PIC 9(08).     030100      
000155    10 MSG-R01-REFNUM                              PIC 9(12).     030300      
000156    10 MSG-R01-AUT-S151                            PIC 9(08).     030500      
000157    10 MSG-R01-FECMOV                              PIC 9(06).     030700      
000158    10 MSG-R01-CVETRAN                             PIC 9(04).     030900      
000159    10 MSG-R01-OCCUR                               PIC 9(02).     031100      
000160    10 MSG-R01-IMPORTE                             PIC 9(14)V99.  031300      
000161    10 MSG-R01-ERROR                               PIC 9(04).     031500      
000162    10 FILLER                                      PIC X(309).    031700      
000163 01 WKS-AREA-MSG-OBL-SERV2 REDEFINES WKS-AREA-MSG-OBL.            031900      
000164    05 MSG-R02-IDRUTEO            PIC X(05).                      032100      
000165    05 MSG-R02-AUTORIZA           PIC X(15).                      032300      
000166    05 MSG-R02-LONGITUD           PIC X(05).                      032500      
000167    05 MSG-R02-IFILEID.                                           032700      
000168       10  MSG-R02-IFILEIDMX      PIC X(04).                      032900      
000169       10  MSG-R02-IFILEIDPROD    PIC X(04).                      033100      
000170       10  MSG-R02-IFILEIDA       PIC X(01).                      033300      
000171       10  MSG-R02-IFILEIDFEC     PIC X(08).                      033500      
000172       10  MSG-R02-IFILEIDHORA    PIC X(08).                      033700      
000173    05 MSG-R02-COUNTRY            PIC X(02).                      033900      
000174    05 MSG-R02-CUSTIDN.                                           034100      
000175          10 MSG-R02-CUSTID       PIC X(12).                      034300      
000176          10 MSG-R02-SPACES       PIC X(03).                      034500      
000177    05 MSG-R02-ACCNUM             PIC X(16).                      034700      
000178    05 MSG-R02-FIELDID            PIC X(05).                      034900      
000179    05 MSG-R02-FILTSR             PIC X(01).                      035100      
000180    05 MSG-R02-FILTID             PIC X(01).                      035300      
000181    05 MSG-R02-VALUE.                                             035500      
000182       10  MSG-R02-VALUESALDO     PIC X(15).                      035700      
000183    05 MSG-R02-ACCNUMH            PIC X(07).                      035900      
000184    05 MSG-R02-ACCNUMD.                                           036100      
000185       10  MSG-R02-ACCNUMD-AST    PIC X(03).                      036300      
000186       10  MSG-R02-ACCNUMD-THR    PIC 9(03).                      036500      
000187    05 MSG-R02-BEFBAL             PIC X(15).                      036700      
000188    05 MSG-R02-CURRBAL.                                           036900      
000189       10  MSG-R02-CURRBALSIGN    PIC X(01).                      037100      
000190       10  MSG-R02-CURRBALSALDO   PIC X(14).                      037300      
000191    05 MSG-R02-CUTDATE            PIC X(02).                      037500      
000192    05 MSG-R02-PAYDATE            PIC X(08).                      037700      
000193    05 MSG-R02-MINDATE            PIC X(15).                      037900      
000194    05 MSG-R02-CREDDLIM           PIC X(15).                      038100      
000195    05 MSG-R02-AVACRED            PIC X(15).                      038300      
000196    05 MSG-R02-MOVIND             PIC X(30).                      038500      
000197    05 MSG-R02-TRANDATE.                                          038700      
000198       10  MSG-R02-CC             PIC X(02).                      038900      
000199       10  MSG-R02-FECHA          PIC X(06).                      039100      
000200       10  MSG-R02-HORA           PIC X(04).                      039300      
000201    05 MSG-R02-REF                PIC X(40).                      039500      
000202    05 MSG-R02-REPID              PIC X(02).                      039700      
000203    05 MSG-R02-CVEMDA             PIC X(01).                      039900      
000204    05 MSG-R02-SHARP              PIC X(01).                      040100      
000205    05 MSG-R02-PRNAME             PIC X(33).                      040300      
000206    05 MSG-R02-CURRCODE           PIC X(02).                      040500      
000207    05 MSG-R02-TRANMEANID         PIC X(05).                      040700      
000208    05 MSG-R02-TRANMEAN           PIC X(30).                      040900      
000209    05 MSG-R02-PRODNUM            PIC X(20).                      041100      
000210    05 MSG-R02-TIMESTAMP.                                         041300      
000211       10  MSG-R02-FEC            PIC X(08).                      041500      
000212       10  MSG-R02-HOR            PIC X(06).                      041700      
000213    05 MSG-R02-SERV-NOTALERT      PIC X(04).                      041900      
000214    05 MSG-R02-FECCON             PIC X(06).                      042100      
000215    05 MSG-R02-CVETRAN            PIC X(06).                      042300      
000216***************************************************************** 042500      
000217**                VARIABLES DE TRABAJO                         ** 042700      
000218***************************************************************** 042900      
000219 01 WKS-PRIMER-VEZ                PIC 9(02).                      043100      
000220 01 WKS-LOCK-OK                   PIC 9(02).                      043300      
000221 01 WKS-STOR-OK                   PIC 9(02).                      043500      
000222                                                                  043700      
000223  77 W77-HI                 PIC 9(02) VALUE 0.                    043900      
000224     88 W88-HI-2                   VALUE 2.                       044100      
000225     88 W88-HI-3                   VALUE 3.                       044300      
000226     88 W88-HI-4                   VALUE 4,6.                     044500      
000227     88 W88-HI-6                   VALUE 6.                       044700      
000228     88 W88-HI-25                  VALUE 25.                      044900      
000229 01 CONT-REG-DISPLAY              PIC 9(06).                      045100      
000230 01  WKS-STATUS                    PIC 9(02).                     045300      
000231*VARAIBLES DE feCHA Y HORA DE PASO                                045500      
000232 01 WKS-DATO                     PIC 9(06).                       045700      
000233 01 WKS-DATOR REDEFINES WKS-DATO.                                 045900      
000234   10 WKS-DATO-AMO              PIC 9(02).                        046100      
000235   10 WKS-DATO-MES              PIC 9(02).                        046300      
000236   10 WKS-DATO-DIA              PIC 9(02).                        046500      
000237                                                                  046700      
000238 01 WKS-HORMAQ-HMSD               PIC 9(08).                      046900      
000239 01 WKS-HORA-R    REDEFINES WKS-HORMAQ-HMSD.                      047100      
000240      10  WKS-HORA-H               PIC 9(02).                     047300      
000241      10  WKS-HORA-M               PIC 9(02).                     047500      
000242      10  WKS-HORA-S               PIC 9(02).                     047700      
000243      10  WKS-HORA-D               PIC 9(02).                     047900      
000244                                                                  048100      
000245 01 WKS-HORA-R2    REDEFINES WKS-HORMAQ-HMSD.                     048300      
000246      10  WKS-HORAR-HMS            PIC 9(06).                     048500      
000247      10  WKS-HORAR-C              PIC 9(02).                     048700      
000248                                                                  048900      
000249 01  WKS-FECHR-MAQ.                                               049100      
000250       05  WKS-FEC-MAQ-DG       PIC 9(06).                        049300      
000251       05  WKS-HR-MAQ-DG        PIC 9(08).                        049500      
000252 01  WKS-FECHR-ENV-DG      REDEFINES WKS-FECHR-MAQ.               049700      
000253       05  WKS-FEC-ENV-MQDG     PIC 9(12).                        049900      
000254       05  WKS-HR-ENV-DG        PIC 9(02).                        050100      
000255                                                                  050300      
000256 01 WKS-DIS-TEXTO                 PIC X(140) .                    050500      
000257                                                                  050700      
000258 01  REGISTRO-DIS-DETALLE.                                        050900      
000259       10 WKS-DIS-FECHA-S           PIC ZZ.                       051100      
000260       10 WKS-DIS-FECHA-A           PIC ZZ.                       051300      
000261       10 FILLER                    PIC X(01) VALUE "/".          051500      
000262       10 WKS-DIS-FECHA-M           PIC ZZ.                       051700      
000263       10 FILLER                    PIC X(01) VALUE "/".          051900      
000264       10 WKS-DIS-FECHA-D           PIC ZZ.                       052100      
000265       10 FILLER                    PIC X(05) VALUE SPACES.       052300      
000266       10 WKS-DIS-HORA              PIC 9(02).                    052500      
000267       10 FILLER                    PIC X(01) VALUE ":".          052700      
000268       10 WKS-DIS-MINUTO            PIC 9(02) .                   052900      
000269       10 FILLER                    PIC X(03) VALUE SPACES.       053100      
000270       10 FILLER                    PIC X(01) VALUE "P".          053300      
000271       10 WKS-DIS-PASO              PIC 9(03) VALUE 017.          053500      
000272       10 FILLER                    PIC X(03) VALUE SPACES.       053700      
000273       10 WKS-DIS-MENSAJE           PIC X(140).                   053900      
000274                                                                  054100      
000275*===============================================                  054300      
000276*      PARAMETROS LIBRERIA CALENDAR            =                  054500      
000277*===============================================                  054700      
000278 01 WKS-FECHA1                    PIC 9(08).                      054900      
000279 01 WKS-FECHA1-R                  REDEFINES WKS-FECHA1 PIC X(08). 055100      
000280 01 WKS-FECHA2                    PIC 9(08).                      055300      
000281 01 WKS-FECHA2-R                  REDEFINES WKS-FECHA2 PIC X(08). 055500      
000282 77 W77-FORMATO                   PIC S9(11) BINARY.              055700      
000283 77 W77-FUNCION                   PIC S9(11) BINARY.              055900      
000284                                                                  056100      
000285****************************************************************  056300      
000286*              RUTINAS PARA LIBRERIA CONCEPTOS                 *  056500      
000287****************************************************************  056700      
000288 01 WKS-CTLVER-LIBID             PIC X(12).                       056900      
000289 01 WKS-CTLVER-NOMLIB            PIC X(72).                       057100      
000290 01 W77-CTLVER-RESULT            PIC S9(11) BINARY.               057300      
000291                                                                  057500      
000292 01 W77-RESULT-B01               PIC 9(08).                       057700      
000293                                                                  057900      
000294*VARIABLE DE                                                      058100      
00029501 WKS-VAL-DIA-HAB                PIC 9(02).                      058300      
000296                                                                  058500      
000297*VARIABLE MIX                                                     058700      
000298 01 WS00-MIX      PIC 9(07) VALUE 0.                              058900      
000299                                                                  059100      
000300*variables de display                                             059300      
000301 01  REGISTRO-DIS-HEADER.                                         059500      
000302      10 FILLER                    PIC X(05) VALUE "FECHA".       059700      
000303      10 FILLER                    PIC X(10) VALUE SPACES.        059900      
000304      10 FILLER                    PIC X(04) VALUE "HORA".        060100      
000305      10 FILLER                    PIC X(04) VALUE SPACES.        060300      
000306      10 FILLER                    PIC X(05) VALUE "PASO ".       060500      
000307      10 FILLER                    PIC X(02) VALUE SPACES.        060700      
000308      10 FILLER                    PIC X(07) VALUE "MENSAJE".     060900      
000309                                                                  061100      
000310*************************************************************     061300      
000311*               ENCIENDE/APAGA MONITOR                      *     061500      
000312*************************************************************     061700      
000313 01 WKS-STATUS-MONITOR              PIC 9(02).                    061900      
000314                                                                  062100      
000315                                                                  062300      
000316******************************************************************062500      
000317*             NOMBRE DE ARCHIVO DE ERRORES                       *062700      
000318*                                                                *062900      
000319******************************************************************063100      
000320  01 WKS-RUT-L01.                                                 063300      
000321     10 FILLER                    PIC X(27) VALUE                 063500      
000322         "S151/FILE/L01/DISPLAY/P017/".                           063700      
000323     10 WKS-RUT-L01-CSI           PIC X(03).                      063900      
000324     10 FILLER                    PIC X(01) VALUE "/".            064100      
000325     10 WKS-RUT-L01-FCH           PIC 9(06).                      064300      
000326     10 FILLER                    PIC X(01) VALUE "/".            064500      
000327     10 WKS-RUT-L01-HORA          PIC 9(08)   .                   064700      
000328     10 FILLER                    PIC X(01) VALUE ".".            064900      
000329                                                                  065100      
000330******************************************************************065300      
000331*               NOMBRE DE ARCHIVO MONITOR                        *065500      
000332*                                                                *065700      
000333******************************************************************065900      
000334   01 WKS-RUT-L02.                                                066100      
000335      10 FILLER                    PIC X(27) VALUE                066300      
000336          "S151/FILE/L02/MONITOR/P017/".                          066500      
000337      10 WKS-RUT-L02-CSI           PIC X(03).                     066700      
000338      10 FILLER                    PIC X(01) VALUE "/".           066900      
000339      10 WKS-RUT-L02-FCH           PIC 9(06).                     067100      
000340      10 FILLER                    PIC X(01) VALUE "/".           067300      
000341      10 WKS-RUT-L02-HORA          PIC 9(08).                     067500      
000342      10 FILLER                    PIC X(01) VALUE ".".           067700      
000343                                                                  067900      
000344                                                                  068100      
000345***************************************************************   068300      
000346*                 FECHA DE PROCESO                            *   068500      
000347***************************************************************   068700      
000348 01 WKS-FECPRO                   PIC 9(08).                       068900      
000349 01 WKS-FECHA-PROCESO      REDEFINES WKS-FECPRO.                  069100      
000350    03 WKS-FECPRO-CC             PIC 9(02).                       069300      
000351    03 WKS-FECPRO-6D             PIC 9(06).                       069500      
000352    03 WKS-FECPRO-6D-R     REDEFINES WKS-FECPRO-6D.               069700      
000353       05 WKS-FECPRO-AA          PIC 9(02).                       069900      
000354       05 WKS-FECPRO-MM          PIC 9(02).                       070100      
000355       05 WKS-FECPRO-DD          PIC 9(02).                       070300      
000356                                                                  070500      
000357******************************************************************070700      
000358*             VARIABLES ARCHIVO TASKFILE                         *070900      
000359******************************************************************071100      
000360 01  WKS-TIT-TASKFILE.                                            071300      
000361     03 FILLER                     PIC X(30) VALUE                071500      
000362         "FILE TASKFILE (USERBACKUPNAME=".                        071700      
000363     03 FILLER                     PIC X(30) VALUE                071900      
000364         "TRUE,TITLE=S151/TASKFILE/P017/".                        072100      
000365     03 WKS-TSK-NODO               PIC 9(02).                     072300      
000366     03 WKS-TSK-SUBN               PIC 9(02) VALUE ZERO.          072500      
000367     03 FILLER                     PIC X(06) VALUE                072700      
000368         "/R000/".                                                072900      
000369     03 WKS-TSK-FECHA              PIC 9(06).                     073100      
000370     03 FILLER                     PIC X(01) VALUE "/".           073300      
000371     03 WKS-TSK-MXNB               PIC 9(07).                     073500      
000372     03 FILLER                     PIC X(01) VALUE "/".           073700      
000373     03 WKS-TSK-MNEMONICO          PIC X(14) VALUE                073900      
000374         "001TASKFILE );".                                        074100      
000375                                                                  074300      
000376 01 WKS-FECHAS.                                                   074500      
000377   03 WKS-FECHA-MAQUINA         PIC X(10) TYPE IS NUMERIC-DATE.   074700      
000378   03 WKS-FECHA-MAQUINA-R REDEFINES WKS-FECHA-MAQUINA.            074900      
000379      05 WKS-FECMAQ-MM          PIC 9(02).                        075100      
000380      05 WKS-DIAGONAL1          PIC X(01).                        075300      
000381      05 WKS-FECMAQ-DD          PIC 9(02).                        075500      
000382      05 WKS-DIAGONAL2          PIC X(01).                        075700      
000383      05 WKS-FECMAQ-AAAA        PIC 9(04).                        075900      
000384      05 WKS-FECMAQ-AAAA-R      REDEFINES WKS-FECMAQ-AAAA.        076100      
000385         07 WKS-FECMAQ-CC       PIC 9(02).                        076300      
000386         07 WKS-FECMAQ-AA       PIC 9(02).                        076500      
000387   03 WKS-FECHA-MAQ-8D.                                           076700      
000388      05 WKS-CC-MAQ             PIC 9(02).                        076900      
000389      05 WKS-FECHA-MAQ-6D.                                        077100      
000390         07 WKS-AA-MAQ          PIC 9(02).                        077300      
000391         07 WKS-MM-MAQ          PIC 9(02).                        077500      
000392         07 WKS-DD-MAQ          PIC 9(02).                        077700      
000393      05 WKS-FECHA-MAQ-6D-R REDEFINES WKS-FECHA-MAQ-6D PIC 9(06). 077900      
000394   03 WKS-FECHA-MAQ-ANT-8D.                                       078100      
000395      05 WKS-CC-MAQ-ANT         PIC 9(02).                        078300      
000396      05 WKS-FECHA-MAQ-ANT-6D.                                    078500      
000397         07 WKS-AA-MAQ-ANT      PIC 9(02).                        078700      
000398         07 WKS-MM-MAQ-ANT      PIC 9(02).                        078900      
000399         07 WKS-DD-MAQ-ANT      PIC 9(02).                        079100      
000400****************************************************************  079300      
000401*                       CSI COMS                               *  079500      
000402****************************************************************  079700      
000403 01 WKS-DATOS-HOST.                                               079900      
000404    03 WKS-NUMCSI-HOST           PIC 9(02).                       080100      
000405    03 WKS-NOMEQUIPO             PIC X(10).                       080300      
000406    03 WKS-NOMCSI                PIC X(26).                       080500      
000407    03 WKS-LINEA-BATCH           PIC X(05).                       080700      
000408                                                                  080900      
000409 77 W77-RESULT-COMS               PIC 9(06).                      081100      
000410 77 W77-CONTROL                  PIC 9(02) VALUE ZEROS.           081300      
000411 01 WKS-BASURA                   PIC X(10).                       081500      
000412 01 WKS-ESPERACOMS-TIPO-EVENTO   PIC 9(11).                       081700      
000413 01 WKS-COMS-IN-STATUS-KEY       PIC X(22).                       081900      
000414                                                                  082100      
000415                                                                  082300      
000416***************************************************************** 082500      
000417*                     VAR. CHECA VERSIONES                     ** 082700      
000418***************************************************************** 082900      
000419 01 WKS-CTRV-LIBRERIA              PIC X(12) VALUE "S151P017".    083100      
000420 01 WKS-CTRV-TITULO                PIC X(72) VALUE "21MTP002".    083300      
000421 01 WKS-CTRV-STATUS                PIC S9(11) BINARY.             083500      
000422 77 W77-ERROR                      PIC 9(02).                     083700      
000423                                                                  083900      
000424                                                                  084100      
000425                                                                  084300      
000426***************************************************************** 084500      
000427*        variables de trabajo                                  ** 084700      
000428***************************************************************** 084900      
000429 01 W77-FIN                      PIC 9(04).                       085100      
000430 01 WKS-RECIBI-MSG               PIC 9(02).                       085300      
000431 01 W77-INTENTO                  PIC 9(02).                       085500      
000432*variables de trabajo                                             085700      
000433 01 WKS-R01-NUM-ID                PIC 9(02).                      085900      
000434 01 WKS-R01-FECMOV                PIC 9(06).                      086100      
000435 01 WKS-CONTRATO                  PIC 9(08).                      086300      
000436 01 WKS-AUT-S151                  PIC 9(08).                      086500      
000437 01 WKS-AUT-PC                    PIC 9(08).                      086700      
000438 01 WKS-NUM-OCCURS                PIC 9(02).                      086900      
000439 01 WKS-R01-CONTRATO              PIC 9(16).                      087100      
000440 01 WKS-R01-AUT-S151              PIC 9(08).                      087300      
000441 01 WKS-R01-OCCUR                 PIC 9(02).                      087500      
000442 01 WKS-ERROR                     PIC 9(04).                      087700      
000443 01 WKS-NUM-TRANS.                                                087900      
000444    05 WKS-NUM-TRANS-OCCURS       PIC 9(01).                      088100      
000445    05 WKS-NUM-TRANS-AUTS151      PIC 9(07).                      088300      
000446 01 WKS-R01-NUMCTE                PIC 9(12).                      088500      
000447 01 WKS-EOF-B07                   PIC 9(04).                      088700      
000448 01 WKS-EOF-B10                   PIC 9(04).                      088750      
000449 01 WKS-BUSQUEDA                  PIC 9(01).                      088900      
000450 01 WKS-DUPLICADO                 PIC 9(002).                     089100      
000451                                                                  089300      
000452*variables de val de fecha.                                       089500      
000453  01 WKS-FEC-NAT                   PIC 9(06).                     089700      
000454  01 WKS-HRS-ACT                   PIC 9(08).                     089900      
000455  01 WKS-HRS-ANT                   PIC 9(08).                     090100      
000456 01 WKS-SMCOMS-TRABAJO             PIC X(132).                    090300      
000457****************************************************************  090500      
000458*                    VARIABLES MANEJO DE ERROR                 *  090700      
000459****************************************************************  090900      
000460 01 WKS-DMCATEGORY                               PIC 9(04).       091100      
000461 01 WKS-DMERRORTYPE                              PIC 9(04).       091300      
000462 01 WKS-DMSTRUCTURE                              PIC 9(04).       091500      
000463 01 WKS-DMS-DSCERR                               PIC X(140).      091700      
000464                                                                  091900      
000465***************************************************************   092100      
000466*          copies                                            **   092300      
000467*  PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ   **   092500      
000468***************************************************************   092700      
000469*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000470* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           092900      
000471**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000472  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000473  01 MENSAJE-LJ.                                                  100300      
000474     02 SISTEMA-LJ     PIC X(04).                                 100400      
000475     02 FILLER         PIC X VALUE "/".                           100500      
000476     02 PASO-LJ        PIC X(04).                                 100600      
000477     02 FILLER         PIC X VALUE "/".                           100700      
000478     02 MTP-LJ         PIC 9(03).                                 100800      
000479     02 FILLER         PIC X VALUE ":".                           100900      
000480     02 TIPO-LJ        PIC X.                                     101000      
000481     02 FILLER         PIC X VALUE ">".                           101100      
000482     02 CODIGO-LJ      PIC 9(06).                                 101200      
000483     02 FILLER         PIC X VALUE "<".                           101300      
000484     02 TEXTO-LJ       PIC X(250).                                101400      
000485*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000486****************************************************************  093100      
000487*   DESCRIPCION DE FORMATOS DE LLAMADO A LIBRERIA DE CONTROL   *  093300      
000488****************************************************************  093500      
000489*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000490* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         093700      
000491*================================================================ 000100      
000492*         ENTRY-POINT CONSISDIA :                               = 000200      
000493*                                                                 000300      
000494* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000495* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000496* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000497* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000498* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000499* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000500* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000501* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000502* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000503* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000504*                                                               = 001400      
000505*================================================================ 001500      
000506                                                                  001600      
000507                                                                  001700      
000508*================================================================ 001800      
000509* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000510*                                                               = 002000      
000511* ENTRADA REQUERIDA :                                           = 002100      
000512*                                                               = 002200      
000513*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000514*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000515*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000516*================================================================ 002600      
000517 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000518    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000519    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000520    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000521    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000522    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000523    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000524    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000525    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000526    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000527    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000528    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000529    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000530    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000531    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000532    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000533    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000534    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000535    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000536    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000537    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000538       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000539       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000540       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000541       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000542*==============================================================   005200      
000543*                                                             =   005300      
000544* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000545*                                                             =   005500      
000546* CAMPOS REQUERIDOS :                                         =   005600      
000547*                                                             =   005700      
000548* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000549* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000550* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000551* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000552*==============================================================   006200      
000553 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000554    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000555    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000556    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000557    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000558                                                                  006800      
000559*==============================================================   006900      
000560*                                                             =   007000      
000561* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000562*                                                             =   007200      
000563* CAMPOS REQUERIDOS :                                         =   007300      
000564*                                                             =   007400      
000565* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000566* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000567* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000568* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000569*==============================================================   007900      
000570 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000571    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000572    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000573    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000574    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000575                                                                  008500      
000576*==============================================================   008600      
000577*                                                             =   008700      
000578* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000579*                                                             =   008900      
000580* CAMPOS REQUERIDOS :                                         =   009000      
000581*                                                             =   009100      
000582* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000583* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000584* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000585* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000586*==============================================================   009600      
000587 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000588    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000589    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000590    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000591    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000592                                                                  010200      
000593*============================================================     010300      
000594* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000595*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000596*                                                           =     010600      
000597*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000598*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000599*                                                           =     010900      
000600*  ENTRADA REQUERIDA.                                       =     011000      
000601*                                                           =     011100      
000602*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000603*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000604*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000605*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000606*============================================================     011600      
000607                                                                  011700      
000608 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000609     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000610     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000611     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000612     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000613                                                                  012300      
000614*=============================================================    012400      
000615*                                                            =    012500      
000616* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000617*             B01-SIS-FECARMOV.                              =    012700      
000618*                                                            =    012800      
000619* ENTRADA REQUERIDAD :                                       =    012900      
000620*                                                            =    013000      
000621*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000622*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000623*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000624*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000625*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000626*=============================================================    013600      
000627                                                                  013700      
000628 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000629     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000630     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000631     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000632     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000633     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000634*================================================================ 014400      
000635*                                                               = 014500      
000636* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000637*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000638*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000639*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000640*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000641*                                                               = 015100      
000642* ENTRADA REQUERIDA :                                           = 015200      
000643*                                                               = 015300      
000644* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000645* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000646* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000647* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000648* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000649*================================================================ 015900      
000650 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000651    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000652    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000653    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000654    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000655    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000656                                                                  016600      
000657*============================================================     016700      
000658*                                                           =     016800      
000659* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000660*                                                           =     017000      
000661* DATOS REQUERIDOS :                                        =     017100      
000662*                                                           =     017200      
000663* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000664* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000665* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000666* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000667* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000668*============================================================     017800      
000669                                                                  017900      
000670 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000671     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000672     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000673     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000674     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000675     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000676                                                                  018600      
000677*============================================================     018700      
000678*                                                           =     018800      
000679* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000680*                                                           =     019000      
000681* DATOS REQUERIDOS :                                        =     019100      
000682*                                                           =     019200      
000683* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000684* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000685* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000686* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000687* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000688*============================================================     019800      
000689                                                                  019900      
000690 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000691     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000692     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000693     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000694     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000695     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000696                                                                  020600      
000697*===============================================================  020700      
000698*                                                              =  020800      
000699* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000700*              MOVIMIENTOS.                                    =  021000      
000701* DATOS REQUERIDOS :                                           =  021100      
000702*                                                              =  021200      
000703* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000704* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000705* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000706* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000707* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000708* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000709*==============================================================   021900      
000710                                                                  022000      
000711 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000712     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000713     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000714     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000715     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000716     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000717     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000718*==============================================================   022800      
000719*                                                             =   022900      
000720* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000721*                                                             =   023100      
000722* CAMPOS REQUERIDOS :                                         =   023200      
000723*                                                             =   023300      
000724* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000725* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000726* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000727* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000728*==============================================================   023800      
000729 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000730    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000731    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000732    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000733    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000734                                                                  024304      
000735*=================================================================024306      
000736*                ENTRY POINT CONSISB01                           =024308      
000737*                                                                =024310      
000738*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000739*                                                                =024314      
000740*  FUNCIONES DISPONIBLES :                                       =024316      
000741*                                                                =024318      
000742*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000743*                                                                =024322      
000744*  PARAMETROS REQUERIDOS                                         =024324      
000745*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000746*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000747*=================================================================024330      
000748                                                                  024332      
000749 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000750     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000751     03 WKS-CON-CSI                PIC 9(02).                     024336      
000752     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000753     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000754        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000755        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000756        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000757        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000758        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000759                                                                  024400      
000760*=================================================================024500      
000761*                ENTRY POINT B02ARCINTER                         =024600      
000762*                                                                =024700      
000763*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000764*                                                                =024900      
000765*  FUNCIONES DISPONIBLES :                                       =025000      
000766*                                                                =025100      
000767*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000768* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000769* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000770* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000771*                                                                =025600      
000772*  PARAMETROS REQUERIDOS                                         =025700      
000773*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000774*                                                                =025900      
000775*=================================================================026000      
000776 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000777     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000778     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000779     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000780     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000781     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000782     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000783     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000784     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000785     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000786     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000787     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000788     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000789     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000790     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000791     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000792     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000793     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000794     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000795     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000796     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000797     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000798     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000799     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000800     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000801     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000802     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000803     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000804     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000805                                                                  029000      
000806*=================================================================029100      
000807*                ENTRY POINT B04SISTEMA                          =029200      
000808*                                                                =029300      
000809*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000810*                                                                =029500      
000811*  FUNCIONES DISPONIBLES :                                       =029600      
000812*                                                                =029700      
000813*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000814*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000815*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000816*                                                                =030100      
000817*  PARAMETROS REQUERIDOS                                         =030200      
000818*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000819*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000820*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000821*                                                                =030600      
000822*=================================================================030700      
000823 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000824     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000825     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000826     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000827     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000828     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000829     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000830     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000831                                                                  031600      
000832*================================================================ 031700      
000833*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000834*                                                               = 031900      
000835*  FUNCION                                                      = 032000      
000836*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000837*   19       ALTAS.                                             = 032200      
000838*   22       BAJAS                                              = 032300      
000839*   37       CAMBIOS.                                           = 032400      
000840*                                                               = 032500      
000841*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000842*                      FECHA DE PROCESO                         = 032700      
000843*                      NUMERO DE PROCESO                        = 032800      
000844*                      FECHA INICIO                             = 032900      
000845*                      REGISTRO INICIAL                         = 033000      
000846*================================================================ 033100      
000847                                                                  033200      
000848 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000849     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000850     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000851     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000852     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000853     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000854     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000855     03 WKS-B05-MIX                PIC 9(08).                     034000      
000856     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000857     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000858     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000859     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000860     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000861     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000862                                                                  034700      
000863                                                                  034800      
000864*================================================================ 034900      
000865*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000866*                                                               = 035100      
000867*  FUNCION                                                      = 035200      
000868*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000869*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000870*                                                               = 035500      
000871*================================================================ 035600      
000872                                                                  035700      
000873 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000874     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000875     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000876     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000877     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000878     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000879     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000880                                                                  036500      
000881*===============================================================  036600      
000882*                                                              =  036700      
000883*         ENTRY-POINT CONSISMEN                                =  036800      
000884*                                                              =  036900      
000885*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000886*                      SISTEMA                                 =  037100      
000887*                                                              =  037200      
000888*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000889*                                                              =  037400      
000890*===============================================================  037500      
000891 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000892     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000893     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000894     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000895     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000896     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000897     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000898     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000899     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000900     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000901     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000902     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000903     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000904     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000905     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000906     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000907        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000908        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000909        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000910        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000911        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000912        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000913        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000914                                                                  039900      
000915*=====================================================            040000      
000916*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000917*=====================================================            040200      
000918 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000919     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000920     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000921     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000922                                                                  040700      
000923*=====================================================            040800      
000924*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000925*=====================================================            041000      
000926 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000927     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000928     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000929     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000930                                                                  041500      
000931*=====================================================            041600      
000932*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000933*=====================================================            041800      
000934 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000935     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000936     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000937     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000938*=====================================================            042300      
000939*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000940*=====================================================            042500      
000941 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000942     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000943     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000944     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000945                                                                  043000      
000946*=====================================================            043100      
000947*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000948*=====================================================            043300      
000949 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000950     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000951     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000952     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000953                                                                  043800      
000954*=====================================================            043900      
000955*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000956*=====================================================            044100      
000957 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000958     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000959     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000960     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000961                                                                  044600      
000962*=====================================================            044700      
000963*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000964*=====================================================            044900      
000965 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000966     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000967     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000968     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000969                                                                  045400      
000970*=====================================================            045500      
000971*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000972*=====================================================            045700      
000973 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000974     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000975     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000976     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000977                                                                  046200      
000978*=====================================================            046300      
000979*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000980*=====================================================            046500      
000981 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000982     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000983     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000984     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000985                                                                  047000      
000986*=====================================================            047100      
000987*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000988*=====================================================            047300      
000989 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000990     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000991     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000992     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000993                                                                  047800      
000994*=====================================================            047900      
000995*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000996*=====================================================            048100      
000997 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000998     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000999     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001000     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001001                                                                  048600      
001002*=====================================================            048700      
001003*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001004*=====================================================            048900      
001005 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001006     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001007     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001008     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001009                                                                  049400      
001010*=====================================================            049500      
001011*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001012*=====================================================            049700      
001013 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001014     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001015     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001016     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001017     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001018     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001019     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001020     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001021     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001022     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001023     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001024                                                                  050900      
001025*=====================================================            051000      
001026*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001027*=====================================================            051200      
001028 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001029     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001030     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001031     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001032     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001033                                                                  051800      
001034*=====================================================            051900      
001035*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001036*=====================================================            052100      
001037 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001038     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001039     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001040     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001041     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001042                                                                  052700      
001043*=====================================================            052800      
001044*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001045*=====================================================            053000      
001046 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001047     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001048     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001049     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001050     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001051                                                                  053600      
001052*=====================================================            053700      
001053*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001054*=====================================================            053900      
001055 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001056     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001057     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001058     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001059     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001060                                                                  054500      
001061*=====================================================            054600      
001062*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001063*=====================================================            054800      
001064 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001065     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001066     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001067     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001068     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001069                                                                  055400      
001070*=====================================================            055500      
001071*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001072*=====================================================            055700      
001073 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001074     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001075     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001076     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001077     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001078                                                                  056300      
001079*=====================================================            056400      
001080*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001081*=====================================================            056600      
001082 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001083     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001084     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001085     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001086     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001087                                                                  057200      
001088 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001089*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001090                                                                  093900      
001091 LINKAGE SECTION.                                                 094100      
001092     01 WKS-COMS-MY-PROGRAM-NAME     PIC X(0018).                 094300      
001093     77 W77-COMS-MY-PROGRAM-DESG     REAL.                        094500      
001094                                                                  094700      
001095     77 W77-COMS-AG-SALIDA-DESG      REAL.                        094900      
001096                                                                  095100      
001097     77 W77-COMS-DEFSTATION-DESG     REAL.                        095300      
001098                                                                  095500      
001099     01 WKS-COMS-DEFSTATION-NAME     PIC X(18).                   095700      
001100                                                                  095900      
001101     01 WKS-COMS-AG-SALIDA-NAME      PIC X(50).                   096100      
001102                                                                  096300      
001103     77 W77-COMS-RESULT              PIC S9(011) BINARY.          096500      
001104        88 W88-COMS-OK               VALUE 0.                     096700      
001105                                                                  096900      
001106     01 WKS-SMCOMS-COMANDO.                                       097100      
001107        03 WKS-SMCOMS-STRING1        PIC X(20).                   097300      
001108        03 WKS-SMCOMS-STRING2        PIC X(20).                   097500      
001109                                                                  097700      
001110     77 W77-SMCOMS-RESULT            PIC S9(11) BINARY.           097900      
001111        88 W88-SMCOMS-OK             VALUE 0.                     098100      
001112                                                                  098300      
001113    77 W77-ACEPTA-MSG               PIC S9(11) BINARY.            098500      
001114        88 W88-ACEPTA-MSG            VALUE 1.                     098700      
001115                                                                  098900      
001116    77 W77-ESPERACOMS-TIPO-EVENTO   PIC S9(11) BINARY.            099100      
001117       88 W88-POR-MSG               VALUE  1.                     099300      
001118       88 W88-POR-ACCEPT            VALUE  2.                     099500      
001119       88 W88-POR-HI                VALUE  3.                     099700      
001120       88 W88-POR-TIMEOUT           VALUE  4.                     099900      
001121       88 W88-POR-EVENTO            VALUE  5.                     100100      
001122                                                                  100300      
001123 77 W77-ESPERACOMS-TIEMPO        PIC S9(11) BINARY VALUE 20.      100500      
001124                                                                  100700      
001125***************************************************************** 100900      
001126*         SECCION DE COMUNICACION                              ** 101100      
001127***************************************************************** 101300      
001128                                                                  101500      
001129 COMMUNICATION SECTION.                                           101700      
001130 INPUT  HEADER COMS-IN;                                           101900      
001131        PROGRAMDESG              IS CS-COMS-IN-PROGRAM;           102100      
001132        FUNCTIONSTATUS           IS CS-COMS-IN-FUNCTION-STATUS;   102300      
001133        FUNCTIONINDEX            IS CS-COMS-IN-FUNCTION-INDEX;    102500      
001134        USERCODE                 IS CS-COMS-IN-USERCODE;          102700      
001135        SECURITYDESG             IS CS-COMS-IN-SECURITY-DESG;     102900      
001136        TRANSPARENT              IS CS-COMS-IN-TRANSPARENT;       103100      
001137        VTFLAG                   IS CS-COMS-IN-VT-FLAG;           103300      
001138        TIMESTAMP                IS CS-COMS-IN-TIMESTAMP;         103500      
001139        STATION                  IS CS-COMS-IN-STATION;           103700      
001140        TEXTLENGTH               IS CS-COMS-IN-TEXT-LENGTH;       103900      
001141        STATUSVALUE              IS CS-COMS-IN-STATUS-KEY;        104100      
001142        MESSAGECOUNT             IS CS-COMS-IN-MSG-COUNT;         104300      
001143        RESTART                  IS CS-COMS-IN-RST-LOC;           104500      
001144        AGENDA                   IS CS-COMS-IN-AGENDA.            104700      
001145 OUTPUT HEADER COMS-OUT;                                          104900      
001146        DESTCOUNT              IS CS-COMS-OUT-COUNT;              105100      
001147        TEXTLENGTH             IS CS-COMS-OUT-TEXT-LENGTH;        105300      
001148        STATUSVALUE            IS CS-COMS-OUT-STATUS-KEY;         105500      
001149        TRANSPARENT            IS CS-COMS-OUT-TRANSPARENT;        105700      
001150        VTFLAG                 IS CS-COMS-OUT-VT-FLAG;            105900      
001151        CONFIRMFLAG            IS CS-COMS-OUT-CONFIRM-FLAG;       106100      
001152        CONFIRMKEY             IS CS-COMS-OUT-CONFIRM-KEY;        106300      
001153        DESTINATIONDESG        IS CS-COMS-OUT-DESTINATION;        106500      
001154        NEXTINPUTAGENDA        IS CS-COMS-OUT-NEXT-INPUT-AGENDA;  106700      
001155        SETNEXTINPUTAGENDA     IS CS-COMS-OUT-SNEXT-INPUT-AGENDA; 106900      
001156        RETAINTRANSACTIONMODE  IS CS-COMS-OUT-SAVE-TRANS-MODE;    107100      
001157        AGENDA                 IS CS-COMS-OUT-AGENDA.             107300      
001158 PROCEDURE DIVISION.                                              107500      
001159 DECLARATIVES.                                                    107700      
001160 INTERRUPT-BY-HI2 SECTION.                                        107900      
001161          USE AS INTERRUPT PROCEDURE.                             108100      
001162 000A-BEGIN-INTERRUPT.                                            108300      
001163*===========                                                      108500      
001164     DISALLOW INTERRUPT.                                          108700      
001165     MOVE "I"                           TO TIPO-LJ.               108900      
001166     MOVE 050104                        TO CODIGO-LJ.             109100      
001167     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-HI.                109300      
001168                                                                  109500      
001169     IF W88-HI-4                                                  109700      
001170        MOVE SPACES                     TO TEXTO-LJ               109900      
001171        PERFORM 800100-HI-SALIDA                                  110100      
001172     ELSE                                                         110300      
001173     IF W88-HI-3                                                  110500      
001174          MOVE "  SE APAGA MONITOR " TO TEXTO-LJ WKS-DIS-TEXTO    110700      
001175          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ     110900      
001176          PERFORM 060700-DISPLAY                                  111100      
001177          PERFORM 060900-APAGA-MONITOR                            111300      
001178     ELSE                                                         111500      
001179     IF W88-HI-2                                                  111700      
001180          MOVE "  SE ENCIENDE MONITOR " TO TEXTO-LJ WKS-DIS-TEXTO 111900      
001181          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ     112100      
001182          PERFORM 060700-DISPLAY                                  112300      
001183          PERFORM 060800-ENCIENDE-MONITOR.                        112500      
001184                                                                  112700      
001185*     ELSE                                                        112900      
001186*     IF W88-HI-25                                                113100      
001187*          MOVE "  SE ACTIVO CAMBIO DE DIA "                      113300      
001188*                        TO TEXTO-LJ WKS-DIS-TEXTO                113500      
001189*          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.   113700      
001190     ALLOW INTERRUPT.                                             113900      
001191 0000A-END.                                                       114100      
001192 END DECLARATIVES.                                                114300      
001193                                                                  114500      
001194***************************************************************   114700      
001195**                INICIA RUTINA PRINCIPAL                    **   114900      
001196***************************************************************   115100      
001197                                                                  115300      
001198 000000-PRINCIPAL SECTION.                                        115500      
001199*==========================                                       115700      
001200 000000-PROCESO-GLOBAL.                                           115900      
001201     PERFORM 100000-INICIO.                                       116100      
001202     PERFORM 200000-PROCESO UNTIL W77-FIN = 1.                    116300      
001203     PERFORM 800010-CIERRA-BD.                                    116500      
001204     STOP RUN.                                                    116700      
001205 100000-INICIO.                                                   116900      
001206                                                                  117100      
001207     PERFORM 020200-TASKFILE                                      117300      
001208     PERFORM 020500-COMS                                          117500      
001209     PERFORM 020400-LIBRERIAS                                     117700      
001210     PERFORM 020650-OPN-TSKFILE                                   117900      
001211     PERFORM 020600-DISPLAY                                       118100      
001212     PERFORM 100400-CHECA-VERS                                    118300      
001213     MOVE 1 TO W77-FIN                                            118500      
001214     ALLOW INTERRUPT                                              118700      
001215     ATTACH INTERRUPT-BY-HI2 TO ATTRIBUTE EXCEPTIONEVENT OF MYSELF118900      
001216                                                                  119100      
001217     PERFORM 700100-ABRE-BD UNTIL W77-FIN = 0 OR W77-INTENTO > 6. 119300      
001218     IF W77-FIN = 1                                               119500      
001219        MOVE "ERROR AL ABRIR BASE S151BD13BIFIN" TO WKS-DMS-DSCERR119700      
001220        PERFORM 8000000-DMTERMINATE.                              119900      
001221     MOVE 0 TO W77-FIN.                                           120100      
001222                                                                  120300      
001223 020200-TASKFILE.                                                 120500      
001224*================                                                 120700      
001225     MOVE ZERO                          TO W77-FIN                120900      
001226     MOVE "/"                           TO WKS-DIAGONAL1          121100      
001227                                           WKS-DIAGONAL2          121300      
001228     ACCEPT WKS-FECHA-MAQUINA           FROM TODAYS-DATE          121500      
001229     MOVE WKS-FECMAQ-CC                 TO WKS-CC-MAQ             121700      
001230     MOVE WKS-FECMAQ-AA                 TO WKS-AA-MAQ             121900      
001231     MOVE WKS-FECMAQ-MM                 TO WKS-MM-MAQ             122100      
001232     MOVE WKS-FECMAQ-DD                 TO WKS-DD-MAQ             122300      
001233     MOVE WKS-FECHA-MAQ-8D         TO WKS-FECHA-MAQ-ANT-8D.       122500      
001234                                                                  122700      
001235 020500-COMS.                                                     122900      
001236*============                                                     123100      
001237    CHANGE ATTRIBUTE MAXWAIT           OF MYSELF                  123150      
001238                                       TO 10.                     123200      
001239    CHANGE ATTRIBUTE LIBACCESS         OF "SOPORTECOMS"           123300      
001240                                       TO BYFUNCTION.             123500      
001241    CHANGE ATTRIBUTE FUNCTIONNAME      OF "SOPORTECOMS"           123700      
001242                                       TO "SOPORTECOMS".          123900      
001243                                                                  124100      
001244    CHANGE ATTRIBUTE LIBACCESS         OF "DCILIBRARY"            124300      
001245                                       TO  BYFUNCTION.            124500      
001246    CHANGE ATTRIBUTE FUNCTIONNAME      OF "DCILIBRARY"            124700      
001247                                       TO "COMSSUPPORT".          124900      
001248     ENABLE INPUT COMS-IN    KEY "ONLINE".                        125100      
001249                                                                  125300      
001250*=============== VALIDACION DE AGENDA DE SALIDA ================= 125500      
001251     MOVE "OUTPUT OF LINEA"           TO WKS-COMS-AG-SALIDA-NAME. 125700      
001252     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               125900      
001253           USING  WKS-COMS-AG-SALIDA-NAME                         126100      
001254                  VALUE AGENDA                                    126300      
001255                  W77-COMS-AG-SALIDA-DESG                         126500      
001256           GIVING W77-COMS-RESULT.                                126700      
001257     IF W88-COMS-OK                                               126900      
001258        NEXT SENTENCE                                             127100      
001259     ELSE                                                         127300      
001260        PERFORM 900000-FIN-MAL.                                   127500      
001261                                                                  127700      
001262     MOVE CS-COMS-IN-PROGRAM          TO W77-COMS-MY-PROGRAM-DESG.127900      
001263     CALL "GET-NAME-USING-DESIGNATOR OF DCILIBRARY"               128100      
001264           USING  W77-COMS-MY-PROGRAM-DESG                        128300      
001265                  WKS-COMS-MY-PROGRAM-NAME                        128500      
001266           GIVING W77-COMS-RESULT.                                128700      
001267     IF W88-COMS-OK                                               128900      
001268        NEXT SENTENCE                                             129100      
001269     ELSE                                                         129300      
001270        PERFORM 900000-FIN-MAL.                                   129500      
001271*=============== DESIGNACION DE ESTACION DEFAULT  =============   129700      
001272     MOVE "DEFAULTSTATION"            TO WKS-COMS-DEFSTATION-NAME 129900      
001273     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               130100      
001274           USING  WKS-COMS-DEFSTATION-NAME                        130300      
001275           VALUE  STATION                                         130500      
001276                  W77-COMS-DEFSTATION-DESG                        130700      
001277           GIVING W77-COMS-RESULT.                                130900      
001278     IF W88-COMS-OK                                               131100      
001279        NEXT SENTENCE                                             131300      
001280     ELSE                                                         131500      
001281        PERFORM 900000-FIN-MAL.                                   131700      
001282                                                                  131900      
001283                                                                  132100      
001284     CALL "CSIID OF SOPORTECOMS"       USING WKS-DATOS-HOST.      132300      
001285                                                                  132500      
001286 020400-LIBRERIAS.                                                132700      
001287*=================                                                132900      
001288    CHANGE ATTRIBUTE LIBACCESS         OF "CTRLVERS"              133100      
001289                                       TO BYFUNCTION.             133300      
001290    CHANGE ATTRIBUTE FUNCTIONNAME      OF "CTRLVERS"              133500      
001291                                       TO "CTLVERS".              133700      
001292    CHANGE ATTRIBUTE LIBACCESS         OF "LOCSUP" TO BYFUNCTION. 133900      
001293    CHANGE ATTRIBUTE FUNCTIONNAME      OF "LOCSUP" TO "LOCSUP".   134100      
001294    CHANGE ATTRIBUTE TITLE             OF "LIB-DISP"              134300      
001295       TO "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".        134500      
001296                                                                  134700      
001297*OBTENEMOS FECHA PARA INCIAR PROCESO DE LA L001                   134900      
001298    MOVE "S151L001CTL"                 TO     WKS-CTLVER-LIBID.   135100      
001299                                                                  135300      
001300    CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID    135500      
001301                                              WKS-CTLVER-NOMLIB   135700      
001302                                       GIVING W77-CTLVER-RESULT.  135900      
001303     IF W77-CTLVER-RESULT = 0                                     136100      
001304        CHANGE ATTRIBUTE TITLE         OF "S151-L001"             136300      
001305                                       TO WKS-CTLVER-NOMLIB       136500      
001306     ELSE                                                         136700      
001307        CHANGE ATTRIBUTE TITLE         OF "S151-L001" TO          136900      
001308               "(S151)S151/OBJECT/L001/CONTROL ON CMEMP.".        137100      
001309                                                                  137300      
001310     MOVE 500                          TO WKS-B01-SISTEMA         137500      
001311     MOVE 01                           TO WKS-B01-FUNCION.        137700      
001312     CALL "CONSISDIA IN S151-L001"     USING  WKS-S151B01SISDIA   137900      
001313                                       GIVING W77-RESULT-B01.     138100      
001314                                                                  138300      
001315     IF W77-RESULT-B01 > 0                                        138500      
001316        MOVE W77-RESULT-B01            TO W77-ERROR               138700      
001317        STRING "NO PUEDO OBTENER FECHA DE PROCESO "               138900      
001318               " ERROR EN S151-L001 S500, ERR #" W77-ERROR        139100      
001319        DELIMITED BY SIZE INTO TEXTO-LJ                           139300      
001320        MOVE "O"                       TO TIPO-LJ                 139500      
001321        MOVE 020901                    TO CODIGO-LJ               139700      
001322        CALL "LJ IN LIB-DISP"          USING CONTADOR-LJ,         139900      
001323                                             MENSAJE-LJ           140100      
001324        SET MYSELF(STATUS) TO -1                                  140300      
001325     ELSE                                                         140500      
001326        MOVE WKS-B01-FECCON            TO WKS-FECHA-PROCESO.      140700      
001327                                                                  140900      
001328  020650-OPN-TSKFILE.                                             141100      
001329                                                                  141300      
001330     ACCEPT  WKS-FEC-MAQ-DG              FROM DATE                141500      
001331     MOVE WKS-FEC-MAQ-DG                 TO WKS-TSK-FECHA         141700      
001332     MOVE WKS-NUMCSI-HOST                TO WKS-TSK-NODO          141900      
001333     MOVE ATTRIBUTE MIXNUMBER OF MYSELF  TO WKS-TSK-MXNB          142100      
001334     SET MYSELF (OPTION)                 TO 1926                  142300      
001335     SET MYSELF (FILECARDS)              TO WKS-TIT-TASKFILE.     142500      
001336                                                                  142700      
001337 020600-DISPLAY.                                                  142900      
001338   MOVE WKS-FECPRO-6D TO WKS-RUT-L01-FCH                          143100      
001339   ACCEPT WKS-HRS-ACT FROM TIME                                   143300      
001340   MOVE WKS-HRS-ACT TO WKS-RUT-L01-HORA                           143500      
001341                       WKS-RUT-L02-HORA.                          143700      
001342   MOVE 0           TO WKS-HRS-ACT.                               143900      
001343    MOVE "VDM"                         TO WKS-RUT-L01-CSI         144100      
001344                                          WKS-RUT-L02-CSI.        144300      
001345    IF WKS-NUMCSI-HOST = 04                                       144500      
001346          MOVE "MTY"                      TO WKS-RUT-L01-CSI      144700      
001347                                             WKS-RUT-L02-CSI.     144900      
001348                                                                  145100      
001349    CHANGE ATTRIBUTE TITLE             OF L01-DISPLAY             145300      
001350                                       TO WKS-RUT-L01.            145500      
001351                                                                  145700      
001352    IF  ATTRIBUTE RESIDENT  OF L01-DISPLAY  = VALUE TRUE          145900      
001353          OPEN EXTEND L01-DISPLAY                                 146100      
001354    ELSE                                                          146300      
001355          OPEN OUTPUT L01-DISPLAY                                 146500      
001356          ADD   1  TO  CONT-REG-DISPLAY                           146700      
001357          WRITE REG-DISPLAY       FROM REGISTRO-DIS-HEADER.       146900      
001358                                                                  147100      
001359  100400-CHECA-VERS.                                              147300      
001360*==================                                               147500      
001361                                                                  147700      
001362*LIGA LIBRERIA DE VERSIONES                                       147900      
001363***************************                                       148100      
001364      CHANGE ATTRIBUTE LIBACCESS              OF "VERLIB"         148300      
001365                                              TO BYFUNCTION.      148500      
001366      CHANGE ATTRIBUTE FUNCTIONNAME           OF "VERLIB"         148700      
001367                                              TO "CTLVERS".       148900      
001368                                                                  149100      
001369*CHECA VERSIONES                                                  149300      
001370      CALL   "CHECAME IN VERLIB"     USING  WKS-CTRV-LIBRERIA,    149500      
001371                                            WKS-CTRV-TITULO       149700      
001372                                     GIVING WKS-CTRV-STATUS.      149900      
001373                                                                  150100      
001374      IF  WKS-CTRV-STATUS             <      0                    150300      
001375                                                                  150500      
001376          MOVE 1                           TO W77-FIN             150700      
001377          MOVE "ERROR AL LLAMAR VERSIONES" TO TEXTO-LJ            150900      
001378          PERFORM 060700-DISPLAY                                  151100      
001379          CHANGE ATTRIBUTE STATUS OF MYSELF   TO -1.              151300      
001380                                                                  151500      
001381 800100-HI-SALIDA.                                                151700      
001382*=================                                                151900      
001383      MOVE  020201                      TO CODIGO-LJ.             152100      
001384      MOVE  "I"                         TO TIPO-LJ.               152300      
001385                                                                  152500      
001386      IF W88-HI-4                                                 152700      
001387         MOVE "TERMINACION NORMAL"      TO TEXTO-LJ               152900      
001388      ELSE                                                        153100      
001389      IF W88-HI-6                                                 153300      
001390         MOVE "TERMINACION DE EMERGENCIA" TO TEXTO-LJ.            153500      
001391         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                 153700      
001392                                         MENSAJE-LJ.              153900      
001393 060700-DISPLAY.                                                  154100      
001394      IF CONT-REG-DISPLAY = 6500                                  154300      
001395          CLOSE  L01-DISPLAY       WITH SAVE                      154500      
001396          ACCEPT WKS-HORMAQ-HMSD   FROM  TIME                     154700      
001397          MOVE   WKS-HORMAQ-HMSD   TO WKS-RUT-L01-HORA            154900      
001398          CHANGE ATTRIBUTE TITLE   OF L01-DISPLAY                 155100      
001399                                   TO WKS-RUT-L01                 155300      
001400          OPEN  OUTPUT  L01-DISPLAY                               155500      
001401          MOVE    1                TO  CONT-REG-DISPLAY           155700      
001402          WRITE REG-DISPLAY        FROM REGISTRO-DIS-HEADER.      155900      
001403                                                                  156100      
001404       ADD    1                    TO  CONT-REG-DISPLAY           156300      
001405       ACCEPT WKS-HORMAQ-HMSD      FROM  TIME                     156500      
001406       ACCEPT WKS-DATO             FROM DATE                      156700      
001407       MOVE   20                   TO WKS-DIS-FECHA-S             156900      
001408       MOVE   WKS-DATO-AMO         TO WKS-DIS-FECHA-A             157100      
001409       MOVE   WKS-DATO-MES         TO WKS-DIS-FECHA-M             157300      
001410       MOVE   WKS-DATO-DIA         TO WKS-DIS-FECHA-D             157500      
001411       MOVE   WKS-HORA-H           TO WKS-DIS-HORA                157700      
001412       MOVE   WKS-HORA-M           TO WKS-DIS-MINUTO              157900      
001413       MOVE   WKS-DIS-TEXTO        TO WKS-DIS-MENSAJE             158100      
001414       WRITE  REG-DISPLAY          FROM  REGISTRO-DIS-DETALLE.    158300      
001415 060900-APAGA-MONITOR.                                            158500      
001416*=======================                                          158700      
001417    IF  WKS-STATUS-MONITOR = 1                                    158900      
001418        CLOSE L02-MONITOR WITH SAVE.                              159100      
001419    MOVE 0                        TO WKS-STATUS-MONITOR.          159300      
001420                                                                  159500      
001421 060800-ENCIENDE-MONITOR.                                         159700      
001422*========================                                         159900      
001423     ACCEPT  WKS-FEC-NAT              FROM DATE                   160000      
001424     MOVE WKS-FEC-NAT                TO WKS-RUT-L02-FCH           160100      
001425     ACCEPT WKS-HORMAQ-HMSD          FROM  TIME                   160300      
001426     MOVE   WKS-HORMAQ-HMSD          TO WKS-RUT-L02-HORA          160500      
001427     IF WKS-STATUS-MONITOR = 1                                    160700      
001428        CLOSE  L02-MONITOR           WITH SAVE.                   160900      
001429     CHANGE ATTRIBUTE TITLE          OF L02-MONITOR               161100      
001430                                     TO WKS-RUT-L02.              161300      
001431     OPEN OUTPUT L02-MONITOR.                                     161500      
001432     MOVE  1                         TO  WKS-STATUS-MONITOR.      161700      
001433                                                                  161900      
001434  200000-PROCESO.                                                 162100      
001435                                                                  162300      
001436      MOVE ZERO TO WKS-RECIBI-MSG.                                162500      
001437      PERFORM 200600-COMS-RECEIVE.                                162700      
001438      PERFORM 201000-PROCESA-MSG-PC.                              162900      
001439                                                                  163100      
001440 200600-COMS-RECEIVE.                                             163300      
001441*======================                                           163500      
001442    MOVE ZERO                TO W77-ACEPTA-MSG                    163700      
001443                                WKS-HDR-RSLTDO                    163900      
001444                                W77-ESPERACOMS-TIPO-EVENTO        164100      
001445                                W77-CONTROL.                      164300      
001446    CALL "ESPERACOMS OF SOPORTECOMS"                              164500      
001447         USING  W77-ESPERACOMS-TIEMPO                             164700      
001448         GIVING W77-ESPERACOMS-TIPO-EVENTO.                       164900      
001449    IF W88-POR-MSG  OR W88-POR-EVENTO                             165100      
001450       NEXT SENTENCE                                              165300      
001451    ELSE                                                          165500      
001452    IF W88-POR-TIMEOUT                                            165700      
001453          PERFORM 202000-VALIDA-FEC-ACTUAL                        165900      
001454          MOVE 1     TO W77-CONTROL                               166100      
001455    ELSE                                                          166300      
001456    IF W88-POR-ACCEPT                                             166500      
001457       MOVE 1     TO W77-CONTROL                                  166700      
001458       ACCEPT WKS-BASURA                                          166900      
001459    ELSE                                                          167100      
001460    IF W88-POR-HI                                                 167300      
001461       IF W88-HI-4 OR W88-HI-6                                    167500      
001462          STRING "TERMINA POR HI" W77-HI                          167700      
001463          DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                   167900      
001464          PERFORM 060700-DISPLAY                                  168100      
001465          MOVE    1        TO W77-CONTROL                         168300      
001466          PERFORM 999999-FIN                                      168500      
001467        ELSE                                                      168700      
001468                MOVE ZERO  TO W77-HI                              168900      
001469                MOVE 1     TO W77-CONTROL                         169100      
001470                                                                  169300      
001471    ELSE                                                          169500      
001472       MOVE W77-ESPERACOMS-TIPO-EVENTO TO                         169700      
001473            WKS-ESPERACOMS-TIPO-EVENTO                            169900      
001474       STRING "EVENTO DESCONOCIDO " WKS-ESPERACOMS-TIPO-EVENTO    170100      
001475       DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                      170300      
001476       PERFORM 060700-DISPLAY                                     170500      
001477       MOVE 1        TO W77-CONTROL.                              170700      
001478                                                                  170900      
001479                                                                  171100      
001480     IF  W77-CONTROL = ZEROS                                      171300      
001481         MOVE  SPACES                 TO  WKS-AREA-MSG-OBL        171500      
001482         RECEIVE  COMS-IN  MESSAGE  INTO  WKS-REG-MSG             171700      
001483               NO DATA NEXT SENTENCE.                             171900      
001484     IF  W77-CONTROL = ZEROS                                      172100      
001485         MOVE "RECEPCION MENSAJE"  TO WKS-SENTIDO-MSG             172300      
001486         MOVE WKS-AREA-USUARIO     TO WKS-AREA-MSG-OBL            172500      
001487         MOVE 1                    TO WKS-RECIBI-MSG              172700      
001488         IF W88-POR-MSG                                           172900      
001489           PERFORM 060950-ESCRIBE-MONITOR.                        173100      
001490                                                                  173300      
001491     MOVE CS-COMS-IN-STATUS-KEY TO WKS-COMS-IN-STATUS-KEY         173500      
001492     IF W77-CONTROL = ZERO                                        173700      
001493        IF  CS-COMS-IN-STATUS-KEY  =  99                          173900      
001494            MOVE ZERO            TO CS-COMS-IN-STATUS-KEY         174100      
001495            STRING "FIN DE PROGRAMA X ESTATUS  "                  174300      
001496                    WKS-COMS-IN-STATUS-KEY                        174500      
001497            DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                 174700      
001498            PERFORM 060700-DISPLAY                                174900      
001499            MOVE  1              TO W77-FIN                       175100      
001500        ELSE                                                      175300      
001501        IF  CS-COMS-IN-STATUS-KEY  =  0 OR 89 OR 91 OR 92 OR 93   175500      
001502            NEXT SENTENCE                                         175700      
001503        ELSE                                                      175900      
001504           MOVE " >> ERROR RECEIVE MSG >>> " TO WKS-DIS-TEXTO     176100      
001505           PERFORM 060700-DISPLAY                                 176300      
001506           STRING "CS-COMS-IN-STATUS-KEY = "                      176500      
001507                  WKS-COMS-IN-STATUS-KEY                          176700      
001508           DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                  176900      
001509           PERFORM 060700-DISPLAY                                 177100      
001510           STRING "HEADER " WKS-HDR-MSG " ACA " WKS-ACA           177300      
001511                  " SA0 " WKS-SA0 " SA2 " WKS-SA2                 177500      
001512           DELIMITED BY SIZE INTO WKS-DIS-TEXTO                   177700      
001513           PERFORM 060700-DISPLAY.                                177900      
001514                                                                  178100      
001515 700020-DS.                                                       178120      
001516*==========                                                       178140      
001517    CHANGE ATTRIBUTE STATUS           OF MYSELF                   178160      
001518                                      TO -1.                      178180      
001519                                                                  178200      
001520 999999-FIN.                                                      178300      
001521*===========                                                      178500      
001522     IF W88-HI-6                                                  178700      
001523        MOVE "DISABLE NOW PROGRAM "   TO WKS-SMCOMS-STRING1       178900      
001524     ELSE                                                         179100      
001525        MOVE "DISABLE PROGRAM "       TO WKS-SMCOMS-STRING1.      179300      
001526     MOVE WKS-COMS-MY-PROGRAM-NAME    TO WKS-SMCOMS-STRING2       179500      
001527     CALL "SMCOMS OF SOPORTECOMS"                                 179700      
001528           USING  WKS-SMCOMS-COMANDO                              179900      
001529                  WKS-SMCOMS-TRABAJO                              180100      
001530           GIVING W77-SMCOMS-RESULT.                              180300      
001531     IF W88-SMCOMS-OK                                             180500      
001532        NEXT SENTENCE                                             180700      
001533     ELSE                                                         180900      
001534        MOVE SPACES                   TO TEXTO-LJ                 181100      
001535        MOVE W77-SMCOMS-RESULT        TO W77-RESULT-COMS          181300      
001536        STRING                                                    181500      
001537             " ERROR DISABLE RESULTS "                            181700      
001538             W77-RESULT-COMS                                      181900      
001539        DELIMITED BY SIZE                                         182100      
001540        INTO TEXTO-LJ                                             182300      
001541        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      182500      
001542                                                                  182700      
001543 060950-ESCRIBE-MONITOR.                                          182900      
001544*=======================                                          183100      
001545 IF WKS-STATUS-MONITOR = 1                                        183300      
001546    MOVE WKS-FEC-NAT   TO WKS-FEC-MON                             183500      
001547    ACCEPT WKS-HRS-MON FROM TIME                                  183700      
001548    MOVE SPACES        TO WKS-ESPACIO1 WKS-ESPACIO2               183900      
001549    MOVE WKS-REG-MSG   TO WKS-DATOS-MSJ                           184100      
001550                                                                  184300      
001551    STRING  MSG-R01-AUT-S151 DELIMITED BY SIZE,                   184500      
001552            MSG-R01-OCCUR    DELIMITED BY SIZE,                   184700      
001553    INTO    WKS-LLAVE-MSG                                         184900      
001554    WRITE REG-MONITOR.                                            185100      
001555                                                                  185300      
001556 202000-VALIDA-FEC-ACTUAL.                                        185500      
001557      IF WKS-PRIMER-VEZ NOT = 0                                   185700      
001558            MOVE WKS-HRS-ACT TO WKS-HRS-ANT                       185900      
001559            ACCEPT WKS-HRS-ACT FROM TIME                          186100      
001560      ELSE                                                        186300      
001561            MOVE 1 TO WKS-PRIMER-VEZ                              186500      
001562            ACCEPT WKS-HRS-ACT FROM TIME                          186700      
001563            MOVE WKS-HRS-ACT TO WKS-HRS-ANT.                      186900      
001564                                                                  187100      
001565     IF WKS-HRS-ACT   <   WKS-HRS-ANT                             187300      
001566        ACCEPT  WKS-FEC-NAT FROM DATE                             187500      
001567                                                                  187700      
001568        STRING "FECHA CONTABLE: "                                 187900      
001569        WKS-FEC-NAT       DELIMITED BY SIZE                       188100      
001570        INTO WKS-DIS-TEXTO                                        188300      
001571                                                                  188500      
001572        PERFORM 060700-DISPLAY                                    188700      
001573        PERFORM 020700-CLOSE-DISPLAY                              188900      
001574        PERFORM 060900-APAGA-MONITOR.                             189100      
001575                                                                  189300      
001576 201000-PROCESA-MSG-PC.                                           189500      
001577*===================                                              189700      
001578   IF NOT W88-POR-MSG OR NOT W88-SA0-TRN-DSIS-S151                189900      
001579       EXIT PERFORM.                                              190100      
001580                                                                  190300      
001581                                                                  190500      
001582    MOVE 0 TO WKS-EOF-B07                                         190700      
001583    IF WKS-SA0-TRN-DSCOD = 001                                    190900      
001584          MOVE  1                     TO WKS-R01-NUM-ID           191100      
001585          MOVE  MSG-R01-FECMOV        TO WKS-R01-FECMOV           191300      
001586          MOVE  MSG-R01-CONTRATO      TO WKS-R01-CONTRATO         191500      
001587          MOVE  MSG-R01-AUT-S151      TO WKS-R01-AUT-S151         191700      
001588          MOVE  MSG-R01-OCCUR         TO WKS-R01-OCCUR            191900      
001589          MOVE  MSG-R01-ERROR         TO WKS-ERROR                192100      
001590          MOVE 0                      TO WKS-LOCK-OK              192300      
001591          PERFORM 700300-BUSCA-REG-B07SXFECHA                     192500      
001592    ELSE                                                          192900      
001593       IF WKS-SA0-TRN-DSCOD = 002                                 193100      
001594             MOVE  WKS-SA2-TRN-NUM       TO WKS-NUM-TRANS         193300      
001595             MOVE  MSG-R02-FECCON        TO WKS-R01-FECMOV        193500      
001596             MOVE  MSG-R02-ACCNUM        TO WKS-R01-CONTRATO      193700      
001597             MOVE  WKS-NUM-TRANS-AUTS151 TO WKS-R01-AUT-S151      193900      
001598             MOVE  WKS-NUM-TRANS-OCCURS  TO WKS-R01-OCCUR         194100      
001599             MOVE  2                     TO WKS-R01-NUM-ID        194300      
001600             MOVE  MSG-R02-CUSTID        TO WKS-R01-NUMCTE        194500      
001601             MOVE 0 TO WKS-BUSQUEDA                               194700      
001602             MOVE 0                      TO WKS-LOCK-OK           194900      
001603             PERFORM 700300-BUSCA-REG-B07SXCTE                    195100      
001604                                                                  195315      
001605          ELSE                                                    195330      
001606              IF WKS-SA0-TRN-DSCOD = 003                          195345      
001607                    MOVE  3                   TO WKS-R01-NUM-ID   195360      
001608                    MOVE  MSG-R01-FECMOV      TO WKS-R01-FECMOV   195375      
001609*                    MOVE  MSG-R01-CONTRATO    TO WKS-R01-CONTRATO195390      
001610                    MOVE  MSG-R01-AUT-S151    TO WKS-R01-AUT-S151 195405      
001611                    MOVE  MSG-R01-OCCUR       TO WKS-R01-OCCUR    195420      
001612                    MOVE  MSG-R01-ERROR       TO WKS-ERROR        195435      
001613                    MOVE 0                    TO WKS-LOCK-OK      195450      
001614                    MOVE 1                    TO WKS-EOF-B07      195455      
001615                    PERFORM 700300-BUSCA-B10SXFECAUT151           195465      
001616                    PERFORM 700301-PROCESA-DOMI                   195495      
001617              ELSE                                                195500      
001618                  MOVE 1 TO WKS-EOF-B07.                          195700      
001619                                                                  195900      
001620    IF WKS-EOF-B07 = 0                                            196100      
001621       IF (W88-SA0-RESP     AND B07-STATUS = 1) OR                196300      
001622          (W88-SA0-RES-BAJA AND B07-STATUS = 3)                   196500      
001623             PERFORM 060960-BEGIN-TRANS                           196700      
001624             PERFORM 030203-ACTUALIZA-B07-RES                     196900      
001625             PERFORM 060970-END-TRANS                             197100      
001626       ELSE                                                       197300      
001627           MOVE B07-STATUS             TO WKS-STATUS              197500      
001628           STRING "MSG RECIBIDO CON DIRECCION ERRONEA "           197700      
001629                 MSG-R01-CONTRATO       DELIMITED BY SIZE ,       197900      
001630                 MSG-R01-REFNUM         DELIMITED BY SIZE ,       198100      
001631                 MSG-R01-AUT-S151       DELIMITED BY SIZE ,       198300      
001632                 MSG-R01-OCCUR          DELIMITED BY SIZE ,       198500      
001633                 WKS-SA0-DIRECCION      DELIMITED BY SIZE ,       198700      
001634                 WKS-STATUS             DELIMITED BY SIZE         198900      
001635                                        INTO WKS-DIS-TEXTO        199100      
001636          PERFORM 060700-DISPLAY                                  199300      
001637    ELSE                                                          199500      
001638       NEXT SENTENCE.                                             199700      
001639                                                                  199900      
001640 700300-BUSCA-REG-B07SXFECHA.                                     200100      
001641*============================                                     200300      
001642   MOVE ZERO        TO WKS-EOF-B07                                200500      
001643   MOVE 1           TO WKS-LOCK-OK.                               200700      
001644   LOCK FIRST B07SXFECHA AT                                       200900      
001645       B07-NUM-ID    =  WKS-R01-NUM-ID    AND                     201100      
001646       B07-FEC-CARGO =  WKS-R01-FECMOV    AND                     201300      
001647       B07-CONTRATO  =  WKS-R01-CONTRATO  AND                     201500      
001648       B07-AUT-S151  =  WKS-R01-AUT-S151  AND                     201700      
001649       B07-NUM-OCURR =  WKS-R01-OCCUR                             201900      
001650   ON EXCEPTION                                                   202100      
001651     IF DMSTATUS(DEADLOCK)                                        202300      
001652          MOVE 0 TO WKS-LOCK-OK                                   202500      
001653          MOVE "DEADLOCK              " TO WKS-DIS-TEXTO          202700      
001654          PERFORM 060700-DISPLAY                                  202900      
001655     ELSE                                                         203100      
001656          MOVE  1    TO WKS-EOF-B07                               203300      
001657          IF DMSTATUS(NOTFOUND)                                   203500      
001658                  MOVE  1    TO WKS-EOF-B07                       203700      
001659                  STRING "MSG RECIBIDO REG NO LOCALIZADO  "       203900      
001660                  MSG-R01-CONTRATO       DELIMITED BY SIZE ,      204100      
001661                  MSG-R01-REFNUM         DELIMITED BY SIZE ,      204300      
001662                  MSG-R01-AUT-S151       DELIMITED BY SIZE ,      204500      
001663                  MSG-R01-OCCUR          DELIMITED BY SIZE ,      204700      
001664                  WKS-SA0-DIRECCION      DELIMITED BY SIZE ,      204900      
001665                                     INTO WKS-DIS-TEXTO           205100      
001666                  PERFORM 060700-DISPLAY                          205300      
001667          ELSE                                                    205500      
001668                  MOVE "ERROR LOCK FIRST B07SXFECHA"              205700      
001669                                  TO WKS-DMS-DSCERR               205900      
001670                  PERFORM 8000000-DMTERMINATE.                    206100      
001671                                                                  206300      
001672 700300-BUSCA-REG-B07SXCTE.                                       206500      
001673*============================                                     206700      
001674   MOVE ZERO        TO WKS-EOF-B07                                206900      
001675   MOVE 1 TO WKS-LOCK-OK                                          207100      
001676   LOCK FIRST B07SXCTE AT                                         207300      
001677       B07-NUM-ID    =  WKS-R01-NUM-ID    AND                     207500      
001678       B07-FEC-CARGO =  WKS-R01-FECMOV    AND                     207700      
001679       B07-NUM-CTE   =  WKS-R01-NUMCTE    AND                     207900      
001680       B07-CONTRATO  =  WKS-R01-CONTRATO  AND                     208100      
001681       B07-AUT-S151  =  WKS-R01-AUT-S151  AND                     208300      
001682       B07-NUM-OCURR =  WKS-R01-OCCUR                             208500      
001683   ON EXCEPTION                                                   208700      
001684      IF DMSTATUS(DEADLOCK)                                       208900      
001685           MOVE 0 TO WKS-LOCK-OK                                  209100      
001686           MOVE "DEADLOCK              " TO WKS-DIS-TEXTO         209300      
001687           PERFORM 060700-DISPLAY                                 209500      
001688      ELSE                                                        209700      
001689           MOVE  1    TO WKS-EOF-B07                              209900      
001690           IF DMSTATUS(NOTFOUND)                                  210100      
001691                  MOVE  1    TO WKS-EOF-B07                       210300      
001692                  PERFORM 010300-IMP-DISPLAY                      210500      
001693                  PERFORM 060700-DISPLAY                          210700      
001694           ELSE                                                   210900      
001695                  MOVE "ERROR LOCK FIRST B07SXCTE"                211100      
001696                                     TO WKS-DMS-DSCERR            211300      
001697                  PERFORM 8000000-DMTERMINATE.                    211500      
001698 060960-BEGIN-TRANS.                                              211700      
001699*=======================                                          211900      
001700     BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL                   212100      
001701     ON EXCEPTION                                                 212300      
001702        MOVE "ERROR EN BEGIN TRANS " TO WKS-DMS-DSCERR            212500      
001703        PERFORM 8000000-DMTERMINATE.                              212700      
001704                                                                  212900      
001705 060970-END-TRANS.                                                213100      
001706*=======================                                          213300      
001707      END-TRANSACTION AUDIT S151B99REINICTL                       213500      
001708      ON EXCEPTION                                                213700      
001709         MOVE "ERROR EN END TRANS "  TO WKS-DMS-DSCERR            213900      
001710         PERFORM 8000000-DMTERMINATE.                             214100      
001711                                                                  214300      
001712 8000000-DMTERMINATE.                                             214500      
001713*================================                                 214700      
001714     MOVE DMSTATUS(DMCATEGORY)     TO WKS-DMCATEGORY.             214900      
001715     MOVE DMSTATUS(DMERRORTYPE)    TO WKS-DMERRORTYPE.            215100      
001716     MOVE DMSTATUS(DMSTRUCTURE)    TO WKS-DMSTRUCTURE.            215300      
001717     STRING WKS-DMCATEGORY         DELIMITED BY SIZE,             215500      
001718     WKS-DMERRORTYPE               DELIMITED BY SIZE,             215700      
001719     WKS-DMSTRUCTURE               DELIMITED BY SIZE,             215900      
001720     "  :  "                       DELIMITED BY SIZE,             216100      
001721     WKS-DMS-DSCERR                DELIMITED BY SIZE              216300      
001722                                   INTO WKS-DIS-TEXTO.            216500      
001723     PERFORM 060700-DISPLAY                                       216700      
001724     MOVE SPACES                       TO TEXTO-LJ.               216900      
001725     STRING WKS-DMS-DSCERR DELIMITED BY SIZE                      217100      
001726                           INTO TEXTO-LJ.                         217300      
001727     CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         217500      
001728     PERFORM 8500000-ERROR-FATAL.                                 217700      
001729                                                                  217900      
001730 8500000-ERROR-FATAL.                                             218100      
001731*====================                                             218300      
001732     MOVE SPACES TO WKS-DIS-TEXTO                                 218500      
001733     IF DMSTATUS (SYSTEMERROR)                                    218700      
001734        MOVE "SYSTEM ERROR" TO WKS-DIS-TEXTO                      218900      
001735        PERFORM 060700-DISPLAY                                    219100      
001736        PERFORM 700020-DS                                         219300      
001737     ELSE                                                         219500      
001738     IF DMSTATUS (OPENERROR)                                      219700      
001739        MOVE "OPEN ERROR" TO WKS-DIS-TEXTO                        219900      
001740        PERFORM 060700-DISPLAY                                    220100      
001741        PERFORM 700020-DS                                         220300      
001742     ELSE                                                         220500      
001743     IF DMSTATUS (CLOSEERROR)                                     220700      
001744        MOVE "CLOSE ERROR" TO WKS-DIS-TEXTO                       220900      
001745        PERFORM 060700-DISPLAY                                    221100      
001746        PERFORM 700020-DS                                         221300      
001747     ELSE                                                         221500      
001748     IF DMSTATUS (AUDITERROR)                                     221700      
001749        MOVE "AUDIT ERROR" TO WKS-DIS-TEXTO                       221900      
001750        PERFORM 060700-DISPLAY                                    222100      
001751        PERFORM 700020-DS                                         222300      
001752     ELSE                                                         222500      
001753     IF DMSTATUS (VERSIONERROR)                                   222700      
001754        MOVE "VERSION ERROR" TO WKS-DIS-TEXTO                     222900      
001755        PERFORM 060700-DISPLAY                                    223100      
001756        PERFORM 700020-DS.                                        223300      
001757                                                                  223500      
001758 030203-ACTUALIZA-B07-RES.                                        223700      
001759*==========================                                       223900      
001760    MOVE WKS-SA0-DIRECCION TO B07-STATUS                          224100      
001761    MOVE WKS-ERROR         TO B07-NUM-ERROR                       224300      
001762    MOVE 0                 TO WKS-STOR-OK                         224500      
001763    PERFORM 700200-ALMACENA-REG.                                  224700      
001764    MOVE B07-CONTRATO      TO WKS-CONTRATO.                       224900      
001765    MOVE B07-AUT-PC        TO WKS-AUT-PC.                         225100      
001766    MOVE B07-AUT-S151      TO WKS-AUT-S151.                       225300      
001767    MOVE B07-NUM-OCURR     TO WKS-R01-OCCUR.                      225500      
001768 700200-ALMACENA-REG.                                             225700      
001769*=========================                                        225900      
001770   MOVE ZERO    TO  WKS-DUPLICADO                                 226100      
001771   MOVE 1       TO WKS-STOR-OK                                    226300      
001772   STORE  S151B07PROTCOB                                          226500      
001773   ON EXCEPTION                                                   226700      
001774        IF DMSTATUS (DEADLOCK)                                    226750      
001775           FREE S151B07PROTCOB ON EXCEPTION NEXT SENTENCE         226800      
001776        ELSE                                                      226850      
001777        IF DMSTATUS (DUPLICATES)                                  226900      
001778          STRING "REG DUPLICADO  "                                227100      
001779               WKS-CONTRATO DELIMITED BY SIZE,                    227300      
001780               WKS-AUT-PC   DELIMITED BY SIZE,                    227500      
001781               WKS-AUT-S151 DELIMITED BY SIZE,                    227700      
001782               WKS-R01-OCCUR DELIMITED BY SIZE,                   227900      
001783          INTO WKS-DIS-TEXTO                                      228100      
001784          PERFORM 060700-DISPLAY                                  228300      
001785          MOVE    1  TO  WKS-DUPLICADO                            228500      
001786          MOVE LOW-VALUES TO MSG-R01-CONTRATO                     228700      
001787                             MSG-R01-REFNUM                       228900      
001788                             MSG-R01-AUT-S151                     229100      
001789        ELSE                                                      229300      
001790           MOVE "ERROR STORE S151B07PROTCOB"                      229500      
001791                             TO WKS-DMS-DSCERR                    229700      
001792           PERFORM 8000000-DMTERMINATE.                           229900      
001793                                                                  230100      
001794                                                                  230900      
001795 700100-ABRE-BD.                                                  231100      
001796*==================                                               231300      
001797    MOVE ZERO  TO  W77-FIN                                        231500      
001798    OPEN UPDATE S151BD13BIFIN                                     231700      
001799    ON EXCEPTION                                                  231900      
001800       MOVE     1                               TO W77-FIN        232100      
001801       ADD      1                               TO W77-INTENTO    232300      
001802       WAIT(10).                                                  232500      
001803                                                                  232700      
001804 900000-FIN-MAL.                                                  232900      
001805*===============                                                  233100      
001806    MOVE SPACES                       TO TEXTO-LJ.                233300      
001807    STRING " ERROR EN COMS, FIN ERRONEO DE PROGRAMA "             233500      
001808           " AVISAR AL RESPONSABLE DEL SISTEMA "                  233700      
001809    DELIMITED BY SIZE                                             233900      
001810    INTO TEXTO-LJ.                                                234100      
001811    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.          234300      
001812    PERFORM 999999-FIN.                                           234500      
001813                                                                  234700      
001814 020700-CLOSE-DISPLAY.                                            234900      
001815     CLOSE  L01-DISPLAY       WITH SAVE.                          235100      
001816     MOVE WKS-FEC-NAT       TO WKS-RUT-L01-FCH                    235300      
001817     ACCEPT WKS-HRS-ACT       FROM TIME                           235500      
001818     MOVE WKS-HRS-ACT         TO WKS-RUT-L01-HORA                 235700      
001819     CHANGE ATTRIBUTE TITLE   OF L02-MONITOR                      235900      
001820                              TO WKS-RUT-L02.                     236100      
001821                                                                  236300      
001822     MOVE "VDM"               TO WKS-RUT-L01-CSI.                 236500      
001823     IF WKS-NUMCSI-HOST = 04                                      236700      
001824          MOVE "MTY"          TO WKS-RUT-L01-CSI.                 236900      
001825     OPEN OUTPUT L01-DISPLAY                                      237100      
001826     ADD   1  TO  CONT-REG-DISPLAY                                237300      
001827     WRITE REG-DISPLAY        FROM REGISTRO-DIS-HEADER.           237500      
001828  010300-IMP-DISPLAY.                                             237700      
001829*=================================                                237900      
001830  IF WKS-BUSQUEDA = 0                                             238100      
001831   STRING "MSG RECIBIDO REG NO LOCALIZADO  "                      238300      
001832       MSG-R01-CONTRATO       DELIMITED BY SIZE ,                 238500      
001833       MSG-R01-REFNUM         DELIMITED BY SIZE ,                 238700      
001834       MSG-R01-AUT-S151       DELIMITED BY SIZE ,                 238900      
001835       MSG-R01-OCCUR          DELIMITED BY SIZE ,                 239100      
001836       WKS-SA0-DIRECCION      DELIMITED BY SIZE ,                 239300      
001837                              INTO WKS-DIS-TEXTO.                 239500      
001838 800010-CIERRA-BD.                                                239700      
001839*===========================                                      239900      
001840   CLOSE S151BD13BIFIN                                            240100      
001841   ON EXCEPTION                                                   240300      
001842      MOVE "ERROR AL CERRAR BD S151BD13BIFIN"  TO WKS-DIS-TEXTO   240500      
001843      PERFORM 060700-DISPLAY.                                     240700      
001844   CLOSE L01-DISPLAY WITH SAVE                                    240900      
001845   PERFORM 060900-APAGA-MONITOR.                                  241100      
001846                                                                  241200      
001847 700301-PROCESA-DOMI.                                             241300      
001848*===========================                                      241400      
001849 IF WKS-EOF-B10 = 0                                               241500      
001850    IF (W88-SA0-RESP     AND B10-STATUS = 1) OR                   241600      
001851       (W88-SA0-RES-BAJA AND B10-STATUS = 3)                      241700      
001852          PERFORM 060960-BEGIN-TRANS                              241800      
001853          PERFORM 030203-ACTUALIZA-B10-RES                        241900      
001854          PERFORM 060970-END-TRANS                                242000      
001855    ELSE                                                          242100      
001856        MOVE B10-STATUS             TO WKS-STATUS                 242200      
001857        STRING "MSG RECIBIDO CON DIRECCION ERRONEA "              242300      
001858*              MSG-R01-CONTRATO       DELIMITED BY SIZE ,         242400      
001859              MSG-R01-REFNUM         DELIMITED BY SIZE ,          242500      
001860              MSG-R01-AUT-S151       DELIMITED BY SIZE ,          242600      
001861              MSG-R01-OCCUR          DELIMITED BY SIZE ,          242700      
001862              WKS-SA0-DIRECCION      DELIMITED BY SIZE ,          242800      
001863              WKS-STATUS             DELIMITED BY SIZE            242900      
001864                                     INTO WKS-DIS-TEXTO           243000      
001865       PERFORM 060700-DISPLAY                                     243100      
001866 ELSE                                                             243200      
001867    NEXT SENTENCE.                                                243300      
001868                                                                  243400      
001869 030203-ACTUALIZA-B10-RES.                                        243500      
001870*========================                                         243600      
001871      MOVE WKS-SA0-DIRECCION TO B10-STATUS                        243700      
001872      MOVE WKS-ERROR         TO B10-NUM-ERROR                     243800      
001873      MOVE 0                 TO WKS-STOR-OK                       243900      
001874      PERFORM 700200-ALMACENA-REG-B10.                            244000      
001875      MOVE B10-CONTRATO      TO WKS-CONTRATO.                     244100      
001876*      MOVE B10-AUT-PC        TO WKS-AUT-PC.                      244200      
001877      MOVE B10-AUT-S151      TO WKS-AUT-S151.                     244300      
001878      MOVE B10-NUM-OCURR     TO WKS-R01-OCCUR.                    244400      
001879                                                                  244500      
001880 700200-ALMACENA-REG-B10.                                         244600      
001881*=========================                                        244700      
001882   MOVE ZERO    TO  WKS-DUPLICADO                                 244800      
001883   MOVE 1       TO WKS-STOR-OK                                    244900      
001884   STORE  S151B10DOMI         ON EXCEPTION                        245000      
001885        IF DMSTATUS (DEADLOCK)                                    245020      
001886           FREE S151B10DOMI ON EXCEPTION NEXT SENTENCE            245050      
001887        ELSE                                                      245070      
001888        IF DMSTATUS (DUPLICATES)                                  245100      
001889          STRING "REG DUPLICADO  "                                245200      
001890               WKS-CONTRATO DELIMITED BY SIZE,                    245300      
001891*               WKS-AUT-PC   DELIMITED BY SIZE,                   245400      
001892               WKS-AUT-S151 DELIMITED BY SIZE,                    245500      
001893               WKS-R01-OCCUR DELIMITED BY SIZE,                   245600      
001894          INTO WKS-DIS-TEXTO                                      245700      
001895          PERFORM 060700-DISPLAY                                  245800      
001896          MOVE    1  TO  WKS-DUPLICADO                            245900      
001897          MOVE LOW-VALUES TO MSG-R01-CONTRATO                     246000      
001898                             MSG-R01-REFNUM                       246100      
001899                             MSG-R01-AUT-S151                     246200      
001900        ELSE                                                      246300      
001901           MOVE "ERROR STORE S151B10DOMI"                         246400      
001902                             TO WKS-DMS-DSCERR                    246500      
001903           PERFORM 8000000-DMTERMINATE.                           246600      
001904                                                                  246700      
001905 700300-BUSCA-B10SXFECAUT151.                                     246800      
001906*===============================                                  246900      
001907   MOVE ZERO        TO WKS-EOF-B10                                247000      
001908   MOVE 1           TO WKS-LOCK-OK.                               247100      
001909   LOCK FIRST B10SXFECAUT151 AT                                   247200      
001910       B10-NUM-ID    =  WKS-R01-NUM-ID    AND                     247300      
001911       B10-FEC-CARGO =  WKS-R01-FECMOV    AND                     247400      
001912*       B10-CONTRATO  =  WKS-R01-CONTRATO  AND                    247500      
001913       B10-AUT-S151  =  WKS-R01-AUT-S151  AND                     247600      
001914       B10-NUM-OCURR =  WKS-R01-OCCUR                             247700      
001915   ON EXCEPTION                                                   247800      
001916     IF DMSTATUS(DEADLOCK)                                        247900      
001917          MOVE 0 TO WKS-LOCK-OK                                   248000      
001918          MOVE "DEADLOCK              " TO WKS-DIS-TEXTO          248100      
001919          PERFORM 060700-DISPLAY                                  248200      
001920     ELSE                                                         248300      
001921          MOVE  1    TO WKS-EOF-B10                               248400      
001922          IF DMSTATUS(NOTFOUND)                                   248500      
001923                  MOVE  1    TO WKS-EOF-B10                       248600      
001924                  STRING "MSG RECIBIDO REG NO LOCALIZADO  "       248700      
001925*                  MSG-R01-CONTRATO       DELIMITED BY SIZE ,     248800      
001926                  MSG-R01-REFNUM         DELIMITED BY SIZE ,      248900      
001927                  MSG-R01-AUT-S151       DELIMITED BY SIZE ,      249000      
001928                  MSG-R01-OCCUR          DELIMITED BY SIZE ,      249100      
001929                  WKS-SA0-DIRECCION      DELIMITED BY SIZE ,      249200      
001930                                     INTO WKS-DIS-TEXTO           249300      
001931                  PERFORM 060700-DISPLAY                          249400      
001932          ELSE                                                    249500      
001933                  MOVE "ERROR LOCK FIRST B10SXFECAUT151"          249600      
001934                                  TO WKS-DMS-DSCERR               249700      
001935                  PERFORM 8000000-DMTERMINATE.                    249800      
