000001*$SET TADS                                                        000200      
000002$$SET XREF LIST STACK MAP LINEINFO ERRORLIMIT=50 NEWID "S151/P114"000400      
000003*$SET FEDLEVEL = 5                                                000600      
000004 IDENTIFICATION DIVISION.                                         000800      
000005*-------------------------                                        001000      
000006 PROGRAM-ID.    S151-P114-EXTRAEICA.                              001200      
000007*AUTHOR.        ING. ANSELMO SANCHEZ MARTINEZ.                    001400      
000008*INSTALLATION.  BANAMEX.                                          001600      
000009*DATE-WRITTEN.  NOVIEMBRE  1998.                                  001800      
000010 DATE-COMPILED.   TUESDAY, 06/17/86, 11:43 AM.                    002000      
000011*SECURITY.                                                        002200      
000012*                                                                 002400      
000013 ENVIRONMENT DIVISION.                                            002600      
000014*----------------------                                           002800      
000015 CONFIGURATION SECTION.                                           003000      
000016 SOURCE-COMPUTER. A19.                                            003200      
000017 OBJECT-COMPUTER. A19.                                            003400      
000018 SPECIAL-NAMES.                                                   003600      
000019 INPUT-OUTPUT SECTION.                                            004200      
000020 FILE-CONTROL.                                                    004400      
000021     SELECT INFOICA                                               005200      
000022            ASSIGN TO DISK.                                       005400      
000023*ASM SELECT SUPERVISOR                                            006000      
000024*ASM        ASSIGN TO DISK.                                       006200      
000025     SELECT SD-INFOICA                                            007000      
000026            ASSIGN TO SORT.                                       007200      
000027     SELECT CLASIFICA                                             007800      
000028            ASSIGN TO DISK.                                       008000      
000029     SELECT            V00-REPORTE2   ASSIGN TO PRINTER.          008100      
000030/                                                                 008600      
000031 DATA DIVISION.                                                   008800      
000032*---------------                                                  009000      
000033 FILE SECTION.                                                    009200      
000034                                                                  009300      
000035 FD  V00-REPORTE2                                                 009400      
000036     VALUE OF TITLE WKS-TIT-REPORTE2.                             009500      
000037                                                                  009600      
000038 01  V00-R00-REPORTE2             PIC X(132).                     009700      
000039                                                                  009800      
000040 FD INFOICA                                                       010800      
000041     BLOCK CONTAINS 30 RECORDS                                    011000      
000042     RECORD CONTAINS 160 CHARACTERS                               011200      
000043     VALUE OF AREAS IS 16 AREASIZE IS 630                         011400      
000044     SAVEFACTOR 999                                               011600      
000045             .                                                    011800      
000046 01 REG-INFOICA                      PIC X(160).                  012000      
000047******                                                            012200      
000048*ASM FD SUPERVISOR                                                012400      
000049*ASM VALUE OF TITLE "S151/FILE/SUPERVISOR"                        012600      
000050*ASM BLOCK CONTAINS 30 RECORDS                                    012800      
000051*ASM RECORD CONTAINS 84 CHARACTERS                                013000      
000052*ASM VALUE OF AREAS IS 1, AREASIZE IS 1080,                       013200      
000053*ASM DATA RECORD IS REG-GUARDIAN.                                 013400      
000054                                                                  013800      
000055                                                                  014000      
000056*ASM 01 REG-GUARDIAN.                                             014200      
000057*ASM 03 REGISTRO-GUARDIAN             PIC X(84).                  014400      
000058/                                                                 014600      
000059 SD SD-INFOICA.                                                   014800      
000060 01 SD-INFOICA-REG.                                               015000      
000061     03 SD-REGISTRO-SA2.                                          015200      
000062        05 SD-MSG-HEADER            PIC X(48).                    015400      
000063        05 SD-MSG-SA0               PIC X(30).                    015600      
000064        05 SD-MSG-SA2.                                            015800      
000065           07 SD-FILLER             PIC X(07).                    016000      
000066           07 SD-LLAVE              PIC X(27).                    016200      
000067           07 SD-MSG-SA2-RESTO      PIC X(13).                    016400      
000068        05 SD-TRAN-MON.                                           016600      
000069           07 FILLER                PIC X(108).                   016800      
000070           07 SD-EDO-ICA            PIC 9(08).                    017000      
000071           07 FILLER                PIC X(36).                    017200      
000072        05 FILLER                   PIC X(11).                    017400      
000073 FD CLASIFICA                                                     017600      
000074     BLOCK CONTAINS 20 RECORDS                                    017800      
000075     RECORD CONTAINS 288 CHARACTERS                               018000      
000076     VALUE OF AREAS IS 8   AREASIZE IS 640                        018200      
000077             .                                                    018400      
000078 01 REG-CLASIFICA                    PIC X(288).                  018600      
000079/                                                                 018800      
000080 WORKING-STORAGE SECTION.                                         019000      
000081                                                                  019050      
000082*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000083* COPY "(S151)S151/FORMATO/DISPLAY.".                             019070      
000084                                                                  000100      
000085*===============================================================* 000200      
000086*         FORMATO PARA DISPLAYS                                 * 000300      
000087*===============================================================* 000400      
000088                                                                  000500      
000089 01 WKS-TIT-REPORTE2.                                             000600      
000090    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000091    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000092    02 FILLER                       PIC X(06) VALUE               000900      
000093                                              "/LIST/".           001000      
000094    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000095    02 FILLER                       PIC X(01) VALUE "/".          001071      
000096    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000097    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000098    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000099    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000100    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000101    02 FILLER                       PIC X(11) VALUE               001600      
000102                                              "/001MSGIMP.".      001700      
000103                                                                  002100      
000104 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000105                                                                  002300      
000106***********************************************************       002400      
000107*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000108***********************************************************       002600      
000109 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000110*8D                                                               002800      
000111 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000112 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000113    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000114    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000115    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000116*8D                                                               003400      
000117 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000118 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000119    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000120    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000121    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000122                                                                  004100      
000123 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000124                                                                  004300      
000125 01 WKS-FECHA-HORA2.                                              004400      
000126    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000127    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000128       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000129       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000130    02 WKS-TIME-MAQ2.                                             004600      
000131       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
000132       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
000133          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
000134          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
000135          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
000136       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
000137    02 FILLER                             PIC X(01).              004900      
000138    02 WKS-RESTO2                         PIC X(04).              005000      
000139                                                                  005100      
000140*8D                                                               005200      
000141****************** REPORTE DE MENSAJES *********************      005300      
000142 01 WLI-ENCAB-12.                                                 005400      
000143    03 FILLER                             PIC X(05) VALUE         005500      
000144       "S151-".                                                   005600      
000145    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000146    03 FILLER                             PIC X(15) VALUE         005671      
000147       "-001IMPMENSAJES".                                         005691      
000148    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000149    03 FILLER                             PIC X(34) VALUE         005800      
000150       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000151    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000152    03 FILLER                             PIC X(26) VALUE         006100      
000153       "FECHA DE LA INFORMACION : ".                              006200      
000154    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000155    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000156       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000157       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000158       05  WKS-SLASH1                         PIC X(01).          006356      
000159       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000160       05  WKS-SLASH2                         PIC X(01).          006358      
000161       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000162 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000163 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000164    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000165    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000166    03 FILLER                          PIC X(01).                 006371      
000167    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000168    03 FILLER                          PIC X(01).                 006381      
000169    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000170*8D                                                               006400      
000171 01 WLI-ENCAB-22.                                                 006500      
000172     03 FILLER                          PIC X(11) VALUE           006600      
000173        "F.PROCESO: ".                                            006700      
000174     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000175     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000176     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
000177     03 FILLER                          PIC X(01) VALUE ":".      007020      
000178     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
000179     03 FILLER                          PIC X(01) VALUE ":".      007060      
000180     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
000181     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000182     03 FILLER                          PIC X(24) VALUE           007200      
000183              "IMPRESION MENSAJES DEL S".                         007300      
000184     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000185     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000186     03 FILLER                          PIC X(14) VALUE           007600      
000187        "TIPO PROCESO: ".                                         007700      
000188     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000189*8D                                                               007900      
000190 01 WLI-ENCAB-32.                                                 008000      
000191     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000192*       "VERSION  : ".                                            008200      
000193*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000194     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000195     03 FILLER                     PIC X(07) VALUE                008500      
000196        "HOJA : ".                                                008600      
000197     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000198                                                                  008800      
000199 01 WLI-ENCAB-42.                                                 008900      
000200     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000201     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000202     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000203                                                                  009300      
000204 01 WLI-ENCAB-52.                                                 009400      
000205    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000206    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000207    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000208    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000209                                                                  009900      
000210*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
000211 01 WLI-ENCAB-62.                                                 009910      
000212    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
000213    03 WLI-RESULT                 PIC X(04).                      009920      
000214    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
000215    03 WLI-TEXTO                  PIC X(110).                     009930      
000216                                                                  009935      
000217 01 WLI-TOT-ENVIO.                                                009940      
000218    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
000219    03 FILLER                     PIC X(37) VALUE                 009950      
000220       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
000221    03 WLI-ENV-CTD                PIC X(04).                      009960      
000222*FIN - INFOWARE                                                   009970      
000223****************************************************************  010000      
000224*                 CONTADORES DE HOJAS                          *  010100      
000225****************************************************************  010200      
000226                                                                  010300      
000227  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000228*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000229*01  WS-PROGRAMA  PIC X(19) VALUE "S151 P114 02MTP006 ".          019100      
000230 01  WS-PROGRAMA  PIC X(19) VALUE "S151 P114 25MTP001 ".          019110      
000231*    ==========                                                   022200      
000232 01  WS-REGISTRO-SA2.                                             022400      
000233*    ================                                             022600      
000234     05  MSG-HEADER.                                              022800      
000235*        ==========                     SIZE 36.                  023000      
000236         10  MSG-HDR-PREFIX             PIC  X(001).              023200      
000237         10  MSG-HDR-APPLDEST           PIC  X(001).              023400      
000238         10  MSG-HDR-CCRDEST            PIC  9(002).              023600      
000239         10  MSG-HDR-LSNORI             PIC  9(004).              023800      
000240         10  MSG-HDR-STATORI.                                     024000      
000241             15  MSG-HDR-SO-TYPE        PIC  X(001).              024200      
000242             15  MSG-HDR-SO-SOPE        PIC  9(004).              024400      
000243             15  MSG-HDR-SO-PRIV        PIC  X(001).              024600      
000244             15  MSG-HDR-SO-CAJA        PIC  9(002).              024800      
000245         10  MSG-HDR-CCRORI             PIC  9(002).              025000      
000246         10  MSG-HDR-COMPUT-ORI         PIC  9(002).              025200      
000247         10  MSG-HDR-NIVSEG             PIC  9(002).              025400      
000248         10  MSG-HDR-APPLORIG           PIC  X(001).              025600      
000249         10  MSG-HDR-ACTION             PIC  9(002).              025800      
000250         10  MSG-HDR-SCREEN             PIC  X(005).              026000      
000251         10  MSG-HDR-CAJA-SEG           PIC  9(002).              026200      
000252         10  MSG-HDR-TIME               PIC  9(004).              026400      
000253         10  FILLER                     PIC  X(006).              026600      
000254         10  FILLER                     PIC  X(006).              026800      
000255*                                                                 027000      
000256    05  MSG-SA0.                                                  027200      
000257*       =======                         SIZE 30.                  027400      
000258*                                       ACUMULADOS 66             027600      
000259        10  MSG-COD-TRAN-1.                                       027800      
000260            15  MSG-TRC1-APL            PIC  9(004).              028000      
000261            15  MSG-TRC1-COD            PIC  9(002).              028200      
000262              88 COD-SERV-VALIDO VALUE 10,11,20,21.               028400      
000263            15  MSG-TRC1-SBC            PIC  9(003).              028600      
000264        10  MSG-COD-TRAN-2.                                       028800      
000265            15  MSG-TRC2-APL            PIC  9(004).              029000      
000266            15  MSG-TRC2-COD            PIC  9(002).              029200      
000267            15  MSG-TRC2-SBC            PIC  9(003).              029400      
000268        10  MSG-DIRECCION               PIC  9(001).              029600      
000269            88  MSG-ENVIO                    VALUE 1.             029800      
000270            88  MSG-REGRESO                  VALUE 2.             030000      
000271                                                                  030200      
000272            88  MSG-REGRESO-REVOCACION       VALUE 4.             030400      
000273        10  MSG-LONG                    PIC  9(004).              030600      
000274        10  MSG-TIEMPO-ESPERA           PIC  9(005).              030800      
000275        10  MSG-COD-RESPUESTA           PIC  9(002).              031000      
000276            88  MSG-COD-SOL                  VALUE 1.             031200      
000277            88  MSG-COD-RESP                 VALUE 2.             031400      
000278            88  MSG-COD-TIMEOUT              VALUE 3.             031600      
000279            88  MSG-COD-ENTREGADO            VALUE 4.             031800      
000280            88  MSG-COD-CONF-APLI            VALUE 6.             032000      
000281            88  MSG-COD-ACEPTADO             VALUE 7.             032200      
000282            88  MSG-COD-SEGURIDAD            VALUE 8.             032400      
000283            88  MSG-COD-ERROR                VALUE 9.             032600      
000284*                                                                 032800      
000285     05  MSG-SA2.                                                 033000      
000286*        =======                        SIZE 46.                  033200      
000287*                                       ACUMULADOS 112.           033400      
000288         10  ID-MSG                     PIC  X(003).              033600      
000289             88 ID-SA2                        VALUE "000".        033800      
000290         10  SA2-VERSION                PIC  X(001).              034000      
000291             88 VERSION-SA2                   VALUE "B".          034200      
000292         10  SA2-CLASE                  PIC  9(001).              034400      
000293             88 SA2-ORIGINAL                  VALUE 0.            034600      
000294             88 SA2-REPETICION                VALUE 1.            034800      
000295         10  SA2-ESTADO                 PIC  9(001).              035000      
000296             88 SA2-NO-NECESARIO              VALUE 0.            035200      
000297             88 SA2-APLICADA                  VALUE 1.            035400      
000298             88 SA2-RECHAZADA                 VALUE 2.            035600      
000299         10  SA2-MODO                   PIC  9(001).              035800      
000300             88 SA2-INTERACTIVO               VALUE 1.            036000      
000301             88 SA2-NOTIFICACION              VALUE 2.            036200      
000302             88 SA2-CERTIFICADO               VALUE 3.            036400      
000303         10  SA2-IDENT.                                           036600      
000304             15 SA2-ENT-NUM-ORIGEN      PIC  9(004).              036800      
000305             15 SA2-CJA-COD-ORIGEN      PIC  X(003).              037000      
000306             15 SA2-TRN-NUM             PIC  9(008).              037200      
000307             15 SA2-TRN-FECHA           PIC  9(006).              037400      
000308             15 SA2-TRN-HORA            PIC  9(006).              037600      
000309         10  SA2-MODALIDAD              PIC  9(002).              037800      
000310             88  SA2-MOD-OK             VALUE 10,11,20,21.        038000      
000311         10 SA2-OPERADOR                PIC  X(010).              038200      
000312         10 SA2-VER-DAT-OP              PIC  X(01).               038400      
000313     05  TRAN-MON-SOLYREVOC.                                      038600      
000314         07 CTA-NUM                  PIC X(20).                   038800      
000315         07 TRN-IMP                  PIC 9(16)V99.                039000      
000316         07 MND-CVE                  PIC 9(03).                   039200      
000317         07 TRN-FEC-SOLICITUD        PIC 9(06).                   039400      
000318         07 TRN-CVE-DESC             PIC 9(04).                   039600      
000319* CAMPO ORIGINALMENTE NUMERICO                     9(20)          039800      
000320         07 TRN-REF-OPERACION        PIC X(20).                   040000      
000321         07 TRM-REF-LOCAL            PIC X(28).                   040200      
000322         07 FILLER                   PIC X(53).                   040400      
000323     05  TRAN-MON-RESP-APLI REDEFINES TRAN-MON-SOLYREVOC.         040600      
000324         07 TMSYR-CTA-NUM             PIC X(20).                  040800      
000325         07 TMSYR-TRN-IMP             PIC 9(16)V99.               041000      
000326         07 TMSYR-MND-CVE             PIC 9(03).                  041200      
000327         07 TMSYR-TRN-FEC-APLI-CONTAB PIC 9(06).                  041400      
000328         07 TMSYR-TRN-NUM-AUTOR       PIC 9(20).                  041600      
000329         07 TMSYR-CTA-SDO-ACTUALIZADO PIC 9(16)V99.               041800      
000330         07 TMSYR-CTA-SDO-SIGNO-A     PIC X(01).                  042000      
000331         07 TMSYR-CTA-SDO-DISPONIBLE  PIC 9(16)V99.               042200      
000332         07 TMSYR-CTA-SSD-SIGNO-B     PIC X(01).                  042400      
000333         07 FILLER                    PIC X(47).                  042600      
000334     05  TRAN-MON-RESP-RECHAZADA REDEFINES TRAN-MON-SOLYREVOC.    042800      
000335         07 TMRR-CTANUM              PIC X(20).                   043000      
000336         07 TMRR-MND-CVE             PIC 9(03).                   043200      
000337         07 TMRR-TRN-CVE-RCHZO       PIC 9(04).                   043400      
000338         07 FILLER                   PIC X(125).                  043600      
000339     05  TRAN-TRANS-FONDOS-SYR REDEFINES TRAN-MON-SOLYREVOC.      043800      
000340         07 TTF-CTA-NUM              PIC X(20).                   044000      
000341         07 TTF-TRN-IMP              PIC 9(15)V99.                044200      
000342         07 TTF-MND-CVE              PIC 9(03).                   044400      
000343         07 TTF-TRN-FEC-SOLICITUD    PIC 9(06).                   044600      
000344         07 TTF-TRN-CVE-DESC         PIC 9(04).                   044800      
000345* CAMPO ORIGINALMENTE NUMERICO                                    045000      
000346         07 TTF-TRN-REF-OPERACION    PIC X(20).                   045200      
000347         07 TTF-TRM-REF-LOCAL        PIC X(28).                   045400      
000348         07 TTF-DATOS-CARGO.                                      045600      
000349            09 TTF-DC-APL-COD        PIC 9(04).                   045800      
000350            09 TTF-DC-CTA-NUM        PIC X(20).                   046000      
000351            09 TTF-DC-MND-CVE        PIC 9(03).                   046200      
000352         07 TTF-DATOS-ABONO.                                      046400      
000353            09 TTF-DA-APL-COD        PIC 9(04).                   046600      
000354            09 TTF-DA-CTA-NUM        PIC X(20).                   046800      
000355            09 TTF-DA-MND-CVE        PIC 9(03).                   047000      
000356     05  TRAN-TRANS-FONDOS-RA  REDEFINES TRAN-MON-SOLYREVOC.      047200      
000357         07 TFRA-CTA-NUM             PIC X(20).                   047400      
000358         07 TFRA-TRN-IMP             PIC 9(15)V99.                047600      
000359         07 TFRA-MND-CVE             PIC 9(03).                   047800      
000360         07 TFRA-TRN-FEC-AUTORIZACION PIC 9(06).                  048000      
000361         07 TFRA-TRN-NUM-AUTOR       PIC 9(08).                   048200      
000362         07 FILLER                   PIC X(98).                   048400      
000363     05  TRAN-TRANS-FONDOS-RR  REDEFINES TRAN-MON-SOLYREVOC.      048600      
000364         07 TFRR-CTA-NUM             PIC X(20).                   048800      
000365         07 TFRR-MND-CVE             PIC 9(03).                   049000      
000366         07 TFRR-TRN-CVE-RCHZO       PIC 9(04).                   049200      
000367         07 FILLER                   PIC X(125).                  049400      
000368     05  CLASIF                REDEFINES TRAN-MON-SOLYREVOC.      049600      
000369         07 FILLER                   PIC X(108).                  049800      
000370         07 EDO-ICA                  PIC 9(08).                   050000      
000371            88 EDO-ICA-NINGUNO       VALUE 11.                    050200      
000372            88 EDO-ICA-FLUJO         VALUE 10.                    050400      
000373            88 EDO-ICA-ENVIADO       VALUE 09.                    050600      
000374            88 EDO-ICA-RECIBIDO      VALUE 08.                    050800      
000375            88 EDO-ICA-PROCESADO-DES VALUE 07.                    051000      
000376            88 EDO-ICA-PROCESADO-ORI VALUE 06.                    051200      
000377            88 EDO-ICA-CONFIRMADO    VALUE 05.                    051400      
000378            88 EDO-ICA-ENTREGADO     VALUE 04.                    051600      
000379            88 EDO-ICA-POR-REVOCAR   VALUE 03.                    051800      
000380            88 EDO-ICA-REVOCADO      VALUE 02.                    052000      
000381            88 EDO-ICA-SOSPECHOSO    VALUE 01.                    052200      
000382         07 FILLER                   PIC X(36).                   052400      
000383     05  FILLER                      PIC X(2200).                 052600      
000384/*** CAMPOS PARA EL MANEJO DE LAS LIBRERIA DE ICA *******         052800      
000385 77 WS-CONTROL-ICA                   PIC S9(11) BINARY.           053000      
000386 77 FECHA-ICA                        PIC S9(11) BINARY.           053200      
000387 77 WS-HOST-ICA                      PIC X(19).                   053400      
000388 77 WS-RSLT-ICA                      PIC S9(11) BINARY.           053600      
000389 77 WS-ESTADO                        PIC S9(11) BINARY.           053800      
000390 77 WS-SCRATCH                       PIC X(27360).                054000      
000391 77 WS-LLAVE                         PIC X(27).                   054200      
000392 77 WS-LLAVE2                        PIC X(288).                  054400      
000393 77 WS-WORDS                         PIC 9(08) COMP.              054450      
000394***                                                               055000      
000395 77 INDFIN                           PIC 9 VALUE 0.               055200      
000396    88 INDACABE VALUE              1.                             055400      
000397 77 CONT-NO-CALIFICADO               PIC 9(04).                   055600      
000398 77 WS-FIN-PROCESO                   PIC 9(01).                   056200      
000399    88 FIN-PROCESO VALUE             1.                           056400      
000400 77 WS-NUM-PAGINA                    PIC 9(02).                   056600      
000401 77 WS-RENGLON                       PIC 9(02).                   056800      
000402 77 WS-COLUMNA                       PIC 9(02).                   057000      
000403 77 WS-NUM-REG                       PIC 9(06).                   057200      
000404 77 WS-INDICE                        PIC 9(02).                   057400      
000405 77 WS-DIA                           PIC 9(02).                   057600      
000406 77 WS-MES                           PIC 9(02).                   057800      
000407 77 WS-YEAR                          PIC 9(02).                   058000      
000408 77 WS-NUMERO                        PIC 9(06).                   058200      
000409 77 WS-EDO-ERRONEO                   PIC 9(01) VALUE 0.           058400      
000410    88 EDO-ERRONEO                   VALUE 1.                     058600      
000411    88 EDO-MSG-OK                    VALUE 0.                     058800      
000412 77 WS-MSG-CONFIRMADO                PIC 9(01) VALUE 0.           059000      
000413    88 MSG-CONFIRMADO                VALUE 1.                     059200      
000414 77 WS-FECHA-ICA                     PIC 9(06).                   059400      
000415 77 WS-PAGINA                        PIC 9(02).                   059600      
000416 77 WS-RESPUESTA-LIB                 PIC S9(04).                  059800      
000417 77 FILES-STATUS                     PIC 9(02).                   060000      
000418 77 WS-RECHAZO-OPER                       PIC 9(01) VALUE 0.      060200      
000419    88 RECHAZO-OPER              VALUE 1.                         060400      
000420 77 W77-FECHA-PROC                   PIC 9(08).                   060500      
000421/                                                                 060600      
000422***** CAMPOS PARA LA RUTINA DE FECHAS  UNISYS                     060800      
000423 77 WS-FORMATO                       PIC S9(11) BINARY.           061000      
000424 77 WS-FUNCION                       PIC S9(11) BINARY.           061200      
000425 77 W77-STATUS                       PIC  9(04).                  061250      
000426 77 W77-VALUE                        PIC  9(08).                  061300      
000427 01 WS-FECHA1                        PIC  X(06).                  061400      
000428 01 WS-FECHA1-NUM REDEFINES WS-FECHA1 PIC 9(06).                  061600      
000429 01 WS-FECHA2                        PIC 9(06).                   061800      
000430 01 WS-FECHA-PASO                    PIC 9(08).                   061820      
000431 01 WS-FECHA-PASO-R REDEFINES WS-FECHA-PASO.                      061840      
000432    03 WS-FECHA-P-AA                 PIC 9(04).                   061860      
000433    03 WS-FECHA-P-MM                 PIC 9(02).                   061880      
000434    03 WS-FECHA-P-DD                 PIC 9(02).                   061900      
000435*                                                                 062000      
000436*                                                                 062200      
000437 01 WS-CVE-AUTORIZACION           PIC X(20).                      062400      
000438*                                                                 062600      
000439***** REGISTROS INFOICA *******                                   062800      
000440                                                                  063000      
000441 01 WS-REG-HEA-INFOICA.                                           064000      
000442     03 WS-RHI-ID                   PIC X(03) VALUE "HDR".        064200      
000443     03 WS-RHI-FEC-PRO              PIC 9(08) .                   064400      
000444     03 WS-RHI-FEC-GEN              PIC 9(08).                    064600      
000445     03 WS-RHI-HOR-GEN              PIC 9(04).                    064800      
000446     03 WS-RHI-SIS-EMI              PIC X(04) VALUE "S151".       065000      
000447     03 WS-RHI-SIS-REC              PIC X(04) VALUE "S151".       065200      
000448     03 WS-RHI-NOM-EXT              PIC X(08) VALUE "INFOICA ".   065400      
000449     03 WS-RHI-NUM-REG              PIC 9(07) .                   065600      
000450     03 WS-RHI-CSI-ORI              PIC X(03) .                   065800      
000451     03 WS-RHI-CSI-DES              PIC X(03) .                   066000      
000452     03 FILLER                      PIC X(108) VALUE SPACES.      066200      
000453 01 WS-REG-DET-INFOICA.                                           066400      
000454     03 WS-RDI-CSI-ORI              PIC 9(02).                    066600      
000455     03 WS-RDI-NOD-ORI              PIC 9(02).                    066800      
000456     03 WS-RDI-CSI-DEST             PIC 9(02).                    067000      
000457     03 WS-RDI-NOM-EST              PIC X(08).                    067200      
000458     03 WS-RDI-NOM-EST-R            REDEFINES WS-RDI-NOM-EST.     067400      
000459        05 WS-RDI-TIPO-DISP         PIC X(01).                    067600      
000460        05 WS-RDI-SUC-ORI           PIC 9(04).                    067800      
000461        05 WS-RDI-CAJA-ORI          PIC X(03).                    068000      
000462     03 WS-RDI-FEC-GEN              PIC 9(08).                    068200      
000463     03 WS-RDI-HOR-GEN              PIC 9(06).                    068400      
000464     03 WS-RDI-APL-ORI              PIC 9(04).                    068600      
000465     03 WS-RDI-APL-DES              PIC 9(04).                    068800      
000466     03 WS-RDI-STA-TRN              PIC 9(02).                    069000      
000467     03 WS-RDI-COD-SER              PIC 9(02).                    069200      
000468     03 WS-RDI-SUB-SER              PIC 9(03).                    069400      
000469     03 WS-RDI-CTA-DES              PIC X(20).                    069600      
000470     03 WS-RDI-IMP-TRN              PIC 9(16)V99.                 069800      
000471     03 WS-RDI-MON-TRN              PIC 9(03).                    070000      
000472     03 WS-RDI-FEC-CON              PIC 9(08).                    070200      
000473     03 WS-RDI-CVE-AUT              PIC X(20).                    070400      
000474     03 WS-RDI-NUM-TRN              PIC 9(08).                    070600      
000475     03 WS-RDI-CTA-ACC              PIC X(20).                    070800      
000476     03 WS-RDI-REF-OPE              PIC X(20).                    071000      
000477 01 WS-REG-TRA-INFOICA.                                           071200      
000478     03 WS-RTIID                     PIC X(03) VALUE "TLR".       071400      
000479     03 WS-RTI-REG                   PIC 9(07).                   071600      
000480     03 FILLER                       PIC X(150).                  071800      
000481*                                                                 072000      
000482 01 WS-REG-INFOICA-ANT               PIC X(160).                  072200      
000483*                                                                 072400      
000484/                                                                 072600      
000485*                                                                 072800      
000486*    ARCHIVO SUPERVISOR PARA EL CONTROL DE FECHAS DE PROCESO      073000      
000487*                                                                 073200      
000488 01  WS-REG-GUARDIAN.                                             073400      
000489     02  WS-RG-SISTEMA            PIC X(04).                      073600      
000490     02  WS-RG-CSI-NOM-CORTO      PIC X(03).                      073800      
000491     02  WS-RG-CSI-NUM            PIC 9(02).                      074000      
000492         88 WS-RG-CSI-OK              VALUE 01 THRU 20.           074200      
000493                                                                  074400      
000494     02  WS-RG-CSI-SIG            PIC X(03).                      074600      
000495     02  WS-RG-FEC-PROC-HOY       PIC 9(06).                      074800      
000496     02  WS-RG-FEC-PROC-HOYR REDEFINES                            075000      
000497         WS-RG-FEC-PROC-HOY.                                      075200      
000498         03 GUARD-PROC-HOY-DD     PIC 9(02).                      075400      
000499         03 GUARD-PROC-HOY-MM     PIC 9(02).                      075600      
000500         03 GUARD-PROC-HOY-AA     PIC 9(02).                      075800      
000501     02  WS-RG-FEC-PROC-ANT       PIC 9(06).                      076000      
000502     02  WS-RG-NUM-PROC           PIC 9(06).                      076200      
000503     02  WS-RG-FEC-PROC-SIG       PIC 9(06).                      076400      
000504     02  WS-RG-FEC-ACT            PIC 9(06).                      076600      
000505     02  WS-RG-HORA-ACT           PIC 9(06).                      076800      
000506     02  WS-RG-FEC-CRE            PIC 9(06).                      077000      
000507     02  WS-RG-HORA-CRE           PIC 9(06).                      077200      
000508     02  WS-RG-TIPO-EQUIPO        PIC 9(01).                      077400      
000509         88 ES-EQUIPO-UNISYS          VALUE 1.                    077600      
000510         88 ES-EQUIPO-TANDEM          VALUE 2.                    077800      
000511     02  WS-RG-NUM-NODO           PIC 9(02).                      078000      
000512     02  WS-RG-NOM-HOST           PIC X(15).                      078200      
000513*    TAMA%O DEL REGISTRO                66 CARACTERES.            078600      
000514/                                                                 078800      
000515 01 TABLA-INF-ARCHIVOS.                                           079000      
000516   02 INFORMACION-ARCHIVOS OCCURS 5 TIMES.                        079200      
000517       03 TB-NOMBRE               PIC X(48).                      079400      
000518       03 TB-UTILCOMO             PIC X(07).                      079600      
000519       03 TB-FECHAPRO             PIC X(08).                      079800      
000520       03 TB-FECHAREA             PIC X(08).                      080000      
000521       03 TB-HORAREAL             PIC X(08).                      080200      
000522*****                                                             080400      
000523 01 WS-FECHAS.                                                    080600      
000524    03 WS-FECHA-DMA               PIC 9(08).                      080800      
000525    03 WS-FECHA-DMA-R REDEFINES WS-FECHA-DMA.                     081000      
000526       05 WS-FE-DMA-DIA           PIC 9(02).                      081200      
000527       05 WS-FE-DMA-MES           PIC 9(02).                      081400      
000528       05 WS-FE-DMA-YEAR          PIC 9(04).                      081600      
000529    03 WS-FECHA-AMD               PIC 9(08).                      081800      
000530    03 WS-FECHA-AMD-R REDEFINES WS-FECHA-AMD.                     082000      
000531       05 WS-FE-AMD-YEAR          PIC 9(04).                      082200      
000532       05 WS-FE-AMD-MES           PIC 9(02).                      082400      
000533       05 WS-FE-AMD-DIA           PIC 9(02).                      082600      
000534    03 WS-FEMAQ-DMA               PIC 9(08).                      082800      
000535    03 WS-FEMAQ-DMA-R REDEFINES WS-FEMAQ-DMA.                     083000      
000536       05 WS-FM-DMA-DIA           PIC 9(02).                      083200      
000537       05 WS-FM-DMA-MES           PIC 9(02).                      083400      
000538       05 WS-FM-DMA-YEAR          PIC 9(04).                      083600      
000539    03 WS-FEMAQ-AMD               PIC 9(08).                      083800      
000540    03 WS-FEMAQ-AMD-R REDEFINES WS-FEMAQ-AMD.                     083820      
000541       05 WS-FM-AMD-YEAR          PIC 9(04).                      083840      
000542       05 WS-FM-AMD-MES           PIC 9(02).                      083860      
000543       05 WS-FM-AMD-DIA           PIC 9(02).                      083880      
000544    03 WS-TIME-HHMMSSSS.                                          084000      
000545       05 WS-TIME-HHMMSS          PIC 9(06).                      084200      
000546       05 WS-TIME-HHMMSS-R REDEFINES WS-TIME-HHMMSS.              084400      
000547          07 WS-TIME-HRS          PIC 9(02).                      084600      
000548          07 WS-TIME-MIN          PIC 9(02).                      084800      
000549          07 WS-TIME-SEG          PIC 9(02).                      085000      
000550       05 ES-TIME-SS              PIC 9(02).                      085200      
000551*                                                                 102400      
000552  01 TABLA-CODIGOS-SERV.                                          102600      
000553      03 ELEM-CODIG-SERV    PIC 9(05) OCCURS 100 TIMES.           102800      
000554*                                                                 103000      
000555  01 NOMBRE-ARCHIVOS.                                             103200      
000556      03 NOM-ARCH-ICA-UNISYS.                                     103400      
000557         05 FILLER          PIC X(23) VALUE                       103600      
000558                              "S151/XFER/FILE/INFOICA/".          103800      
000559         05 NOM-ARCH-NO-ORI PIC X(03).                            104000      
000560         05 NOM-ARCH-NO-DES PIC X(03).                            104200      
000561         05 FILLER          PIC X(01) VALUE "/".                  104400      
000562         05 NOM-ARCH-FECH   PIC 9(06).                            104600      
000563         05 FILLER          PIC X(01) VALUE ".".                  104800      
000564/                                                                 110400      
000565 01 WS-DATOS-DEFAULT.                                             112200      
000566    03 WS-DEF-NODO                PIC 9(02).                      112400      
000567    03 WS-DEF-SUBNODO             PIC 9(02).                      112600      
000568 01  APUNTADORES-WS               COMP .                          112800      
000569     02  PTER-CSI-WS              PIC 9(02).                      113000      
000570         88 PTER-CSIOK            VALUES ARE 1,2,4,6,10.          113200      
000571         88 PTER-CSI-CORP         VALUES ARE 12.                  113400      
000572         88 PTER-CSI-TANDEM       VALUES ARE 02.                  113600      
000573         88 PTER-CSI-ICA          VALUES ARE 1,2,4,6,10.          113800      
000574     02  WS-CSI-TANDEM            PIC 9(02) VALUE 02.             114000      
000575     02  PTER-LOG-WS              PIC 9(02).                      114200      
000576     02  PTER-SIST-WS             PIC 9(02).                      114400      
000577     02  WS-AP-OPER-APL           PIC 9(02).                      114600      
000578     02  PTER-CORTE-WS            PIC 9(02).                      114800      
000579     02  PTER-1-CSI-WS            PIC 9(02).                      115000      
000580         88 CSI-1-VALIDO          VALUES ARE 1,2,4,6,10.          115200      
000581     02  PTER-2-CSI-WS            PIC 9(02).                      115400      
000582         88 CSI-2-VALIDO          VALUES ARE 1,2,4,6,10.          115600      
000583 01  TABLA-CSIS.                                                  115800      
000584     02  FILLER                   PIC X(56) VALUE                 116000      
000585     "01HERNOROESTE   0903CONTADURIA REGIONAL HERMOSILLO  0100".  116200      
000586     02  FILLER                   PIC X(56) VALUE                 116400      
000587     "02INTINTERNAL.  0140CONTADURIA INTERNACIONAL        0200".  116600      
000588     02  FILLER                   PIC X(56) VALUE                 116800      
000589     "03   DESCONOCIDO0000-DESCONOCIDO-                   0000".  117000      
000590     02  FILLER                   PIC X(56) VALUE                 117200      
000591     "04MONNORTE      0904CONTADURIA REGIONAL MONTERREY   0400".  117400      
000592     02  FILLER                   PIC X(56) VALUE                 117600      
000593     "05GUAOCCIDENTE  0902CONTADURIA REGIONAL GUADALAJARA 0500".  117800      
000594     02  FILLER                   PIC X(56) VALUE                 118000      
000595     "06LEOCEN-BAJIO  0901CONTADURIA REGIONAL LEON        6100".  118200      
000596     02  FILLER                   PIC X(56) VALUE                 118400      
000597     "07VERSURESTE    0905CONTADURIA REGIONAL VERACRUZ    0700".  118600      
000598     02  FILLER                   PIC X(56) VALUE                 118800      
000599     "08   DESCONOCIDO0000-DESCONOCIDO-                   0800".  119000      
000600     02  FILLER                   PIC X(56) VALUE                 119200      
000601     "09CENS U R      0906CONTADURIA REGIONAL CENTRO      0900".  119400      
000602     02  FILLER                   PIC X(56) VALUE                 119600      
000603     "10VDMV.DE MEXICO0907CONTADURIA REGIONAL V. DE MEXICO1000".  119800      
000604 01  TAB-CSIS-R                   REDEFINES TABLA-CSIS.           120000      
000605     02  INFO-TAB-CSIS            OCCURS  10 TIMES.               120200      
000606         03  NUM-CSI-TC           PIC 9(02).                      120400      
000607         03  ABR-CSI-TC           PIC X(03).                      120600      
000608         03  NOM-CSI-TC           PIC X(11).                      120800      
000609         03  CONTREG-CSI-TC       PIC 9(04).                      121000      
000610         03  CONREGN-CSI-TC       PIC X(32).                      121200      
000611         03  NODO-CSI-TC          PIC 9(02).                      121400      
000612         03  SUBNODO-CSI-TC       PIC 9(02).                      121600      
000613                                                                  121602      
000614 01  WKS-CTLVERS-LIBRERIA            PIC X(12).                   121604      
000615 01  WKS-CTLVERS-TITULO              PIC X(72).                   121606      
000616 01  WKS-CTLVERS-STATUS              PIC S9(11) BINARY.           121608      
000617                                                                  121610      
000618 01  WKS-DATOS-HOST.                                              121620      
000619     03  WKS-NUMCSI                    PIC 9(02).                 121640      
000620     03  WKS-NOMEQUIPO                 PIC X(10).                 121660      
000621     03  WKS-NOMCSI                    PIC X(26).                 121680      
000622     03  WKS-LINEABATCH                PIC X(05).                 121700      
000623*                                                                 121800      
000624*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000625*  COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL".                  121900      
000626*================================================================ 000100      
000627*         ENTRY-POINT CONSISDIA :                               = 000200      
000628*                                                                 000300      
000629* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000630* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000631* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000632* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000633* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000634* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000635* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000636* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000637* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000638* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000639*                                                               = 001400      
000640*================================================================ 001500      
000641                                                                  001600      
000642                                                                  001700      
000643*================================================================ 001800      
000644* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000645*                                                               = 002000      
000646* ENTRADA REQUERIDA :                                           = 002100      
000647*                                                               = 002200      
000648*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000649*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000650*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000651*================================================================ 002600      
000652 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000653    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000654    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000655    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000656    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000657    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000658    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000659    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000660    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000661    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000662    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000663    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000664    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000665    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000666    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000667    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000668    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000669    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000670    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000671    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000672    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000673       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000674       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000675       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000676       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000677*==============================================================   005200      
000678*                                                             =   005300      
000679* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000680*                                                             =   005500      
000681* CAMPOS REQUERIDOS :                                         =   005600      
000682*                                                             =   005700      
000683* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000684* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000685* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000686* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000687*==============================================================   006200      
000688 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000689    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000690    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000691    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000692    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000693                                                                  006800      
000694*==============================================================   006900      
000695*                                                             =   007000      
000696* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000697*                                                             =   007200      
000698* CAMPOS REQUERIDOS :                                         =   007300      
000699*                                                             =   007400      
000700* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000701* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000702* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000703* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000704*==============================================================   007900      
000705 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000706    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000707    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000708    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000709    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000710                                                                  008500      
000711*==============================================================   008600      
000712*                                                             =   008700      
000713* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000714*                                                             =   008900      
000715* CAMPOS REQUERIDOS :                                         =   009000      
000716*                                                             =   009100      
000717* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000718* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000719* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000720* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000721*==============================================================   009600      
000722 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000723    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000724    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000725    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000726    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000727                                                                  010200      
000728*============================================================     010300      
000729* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000730*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000731*                                                           =     010600      
000732*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000733*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000734*                                                           =     010900      
000735*  ENTRADA REQUERIDA.                                       =     011000      
000736*                                                           =     011100      
000737*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000738*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000739*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000740*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000741*============================================================     011600      
000742                                                                  011700      
000743 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000744     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000745     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000746     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000747     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000748                                                                  012300      
000749*=============================================================    012400      
000750*                                                            =    012500      
000751* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000752*             B01-SIS-FECARMOV.                              =    012700      
000753*                                                            =    012800      
000754* ENTRADA REQUERIDAD :                                       =    012900      
000755*                                                            =    013000      
000756*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000757*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000758*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000759*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000760*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000761*=============================================================    013600      
000762                                                                  013700      
000763 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000764     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000765     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000766     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000767     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000768     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000769*================================================================ 014400      
000770*                                                               = 014500      
000771* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000772*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000773*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000774*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000775*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000776*                                                               = 015100      
000777* ENTRADA REQUERIDA :                                           = 015200      
000778*                                                               = 015300      
000779* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000780* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000781* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000782* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000783* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000784*================================================================ 015900      
000785 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000786    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000787    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000788    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000789    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000790    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000791                                                                  016600      
000792*============================================================     016700      
000793*                                                           =     016800      
000794* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000795*                                                           =     017000      
000796* DATOS REQUERIDOS :                                        =     017100      
000797*                                                           =     017200      
000798* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000799* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000800* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000801* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000802* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000803*============================================================     017800      
000804                                                                  017900      
000805 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000806     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000807     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000808     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000809     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000810     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000811                                                                  018600      
000812*============================================================     018700      
000813*                                                           =     018800      
000814* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000815*                                                           =     019000      
000816* DATOS REQUERIDOS :                                        =     019100      
000817*                                                           =     019200      
000818* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000819* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000820* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000821* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000822* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000823*============================================================     019800      
000824                                                                  019900      
000825 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000826     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000827     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000828     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000829     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000830     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000831                                                                  020600      
000832*===============================================================  020700      
000833*                                                              =  020800      
000834* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000835*              MOVIMIENTOS.                                    =  021000      
000836* DATOS REQUERIDOS :                                           =  021100      
000837*                                                              =  021200      
000838* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000839* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000840* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000841* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000842* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000843* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000844*==============================================================   021900      
000845                                                                  022000      
000846 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000847     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000848     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000849     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000850     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000851     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000852     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000853*==============================================================   022800      
000854*                                                             =   022900      
000855* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000856*                                                             =   023100      
000857* CAMPOS REQUERIDOS :                                         =   023200      
000858*                                                             =   023300      
000859* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000860* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000861* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000862* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000863*==============================================================   023800      
000864 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000865    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000866    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000867    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000868    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000869                                                                  024304      
000870*=================================================================024306      
000871*                ENTRY POINT CONSISB01                           =024308      
000872*                                                                =024310      
000873*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000874*                                                                =024314      
000875*  FUNCIONES DISPONIBLES :                                       =024316      
000876*                                                                =024318      
000877*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000878*                                                                =024322      
000879*  PARAMETROS REQUERIDOS                                         =024324      
000880*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000881*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000882*=================================================================024330      
000883                                                                  024332      
000884 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000885     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000886     03 WKS-CON-CSI                PIC 9(02).                     024336      
000887     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000888     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000889        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000890        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000891        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000892        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000893        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000894                                                                  024400      
000895*=================================================================024500      
000896*                ENTRY POINT B02ARCINTER                         =024600      
000897*                                                                =024700      
000898*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000899*                                                                =024900      
000900*  FUNCIONES DISPONIBLES :                                       =025000      
000901*                                                                =025100      
000902*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000903* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000904* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000905* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000906*                                                                =025600      
000907*  PARAMETROS REQUERIDOS                                         =025700      
000908*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000909*                                                                =025900      
000910*=================================================================026000      
000911 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000912     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000913     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000914     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000915     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000916     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000917     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000918     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000919     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000920     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000921     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000922     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000923     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000924     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000925     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000926     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000927     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000928     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000929     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000930     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000931     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000932     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000933     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000934     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000935     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000936     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000937     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000938     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000939     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000940                                                                  029000      
000941*=================================================================029100      
000942*                ENTRY POINT B04SISTEMA                          =029200      
000943*                                                                =029300      
000944*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000945*                                                                =029500      
000946*  FUNCIONES DISPONIBLES :                                       =029600      
000947*                                                                =029700      
000948*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000949*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000950*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000951*                                                                =030100      
000952*  PARAMETROS REQUERIDOS                                         =030200      
000953*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000954*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000955*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000956*                                                                =030600      
000957*=================================================================030700      
000958 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000959     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000960     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000961     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000962     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000963     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000964     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000965     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000966                                                                  031600      
000967*================================================================ 031700      
000968*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000969*                                                               = 031900      
000970*  FUNCION                                                      = 032000      
000971*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000972*   19       ALTAS.                                             = 032200      
000973*   22       BAJAS                                              = 032300      
000974*   37       CAMBIOS.                                           = 032400      
000975*                                                               = 032500      
000976*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000977*                      FECHA DE PROCESO                         = 032700      
000978*                      NUMERO DE PROCESO                        = 032800      
000979*                      FECHA INICIO                             = 032900      
000980*                      REGISTRO INICIAL                         = 033000      
000981*================================================================ 033100      
000982                                                                  033200      
000983 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000984     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000985     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000986     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000987     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000988     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000989     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000990     03 WKS-B05-MIX                PIC 9(08).                     034000      
000991     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000992     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000993     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000994     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000995     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000996     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000997                                                                  034700      
000998                                                                  034800      
000999*================================================================ 034900      
001000*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
001001*                                                               = 035100      
001002*  FUNCION                                                      = 035200      
001003*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
001004*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
001005*                                                               = 035500      
001006*================================================================ 035600      
001007                                                                  035700      
001008 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
001009     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
001010     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
001011     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
001012     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
001013     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
001014     03 WKS-B09-NOMREN             PIC X(15).                     036400      
001015                                                                  036500      
001016*===============================================================  036600      
001017*                                                              =  036700      
001018*         ENTRY-POINT CONSISMEN                                =  036800      
001019*                                                              =  036900      
001020*   DATOS REQUERIDOS : FUNCION                                 =  037000      
001021*                      SISTEMA                                 =  037100      
001022*                                                              =  037200      
001023*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
001024*                                                              =  037400      
001025*===============================================================  037500      
001026 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
001027     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
001028     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
001029     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
001030     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
001031     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
001032     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
001033     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
001034     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
001035     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
001036     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
001037     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
001038     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
001039     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
001040     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
001041     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
001042        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
001043        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
001044        05 WKS-B03-AAMM            PIC 9(06).                     039402      
001045        05 WKS-B03-SECOK           PIC 9(10).                     039500      
001046        05 WKS-B03-SECINF          PIC 9(10).                     039600      
001047        05 WKS-B03-SECERR          PIC 9(10).                     039700      
001048        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
001049                                                                  039900      
001050*=====================================================            040000      
001051*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
001052*=====================================================            040200      
001053 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
001054     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
001055     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
001056     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
001057                                                                  040700      
001058*=====================================================            040800      
001059*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
001060*=====================================================            041000      
001061 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
001062     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
001063     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
001064     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
001065                                                                  041500      
001066*=====================================================            041600      
001067*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
001068*=====================================================            041800      
001069 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
001070     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
001071     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
001072     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
001073*=====================================================            042300      
001074*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
001075*=====================================================            042500      
001076 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
001077     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
001078     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
001079     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
001080                                                                  043000      
001081*=====================================================            043100      
001082*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
001083*=====================================================            043300      
001084 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
001085     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
001086     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
001087     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
001088                                                                  043800      
001089*=====================================================            043900      
001090*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
001091*=====================================================            044100      
001092 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
001093     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
001094     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
001095     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
001096                                                                  044600      
001097*=====================================================            044700      
001098*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
001099*=====================================================            044900      
001100 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
001101     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
001102     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
001103     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
001104                                                                  045400      
001105*=====================================================            045500      
001106*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
001107*=====================================================            045700      
001108 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
001109     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
001110     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
001111     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
001112                                                                  046200      
001113*=====================================================            046300      
001114*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
001115*=====================================================            046500      
001116 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
001117     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
001118     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
001119     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
001120                                                                  047000      
001121*=====================================================            047100      
001122*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
001123*=====================================================            047300      
001124 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
001125     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
001126     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
001127     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001128                                                                  047800      
001129*=====================================================            047900      
001130*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001131*=====================================================            048100      
001132 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001133     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001134     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001135     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001136                                                                  048600      
001137*=====================================================            048700      
001138*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001139*=====================================================            048900      
001140 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001141     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001142     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001143     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001144                                                                  049400      
001145*=====================================================            049500      
001146*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001147*=====================================================            049700      
001148 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001149     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001150     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001151     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001152     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001153     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001154     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001155     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001156     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001157     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001158     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001159                                                                  050900      
001160*=====================================================            051000      
001161*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001162*=====================================================            051200      
001163 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001164     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001165     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001166     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001167     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001168                                                                  051800      
001169*=====================================================            051900      
001170*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001171*=====================================================            052100      
001172 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001173     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001174     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001175     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001176     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001177                                                                  052700      
001178*=====================================================            052800      
001179*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001180*=====================================================            053000      
001181 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001182     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001183     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001184     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001185     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001186                                                                  053600      
001187*=====================================================            053700      
001188*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001189*=====================================================            053900      
001190 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001191     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001192     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001193     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001194     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001195                                                                  054500      
001196*=====================================================            054600      
001197*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001198*=====================================================            054800      
001199 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001200     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001201     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001202     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001203     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001204                                                                  055400      
001205*=====================================================            055500      
001206*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001207*=====================================================            055700      
001208 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001209     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001210     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001211     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001212     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001213                                                                  056300      
001214*=====================================================            056400      
001215*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001216*=====================================================            056600      
001217 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001218     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001219     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001220     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001221     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001222                                                                  057200      
001223 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001224*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001225*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001226*  COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".          122000      
001227**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
001228  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
001229  01 MENSAJE-LJ.                                                  100300      
001230     02 SISTEMA-LJ     PIC X(04).                                 100400      
001231     02 FILLER         PIC X VALUE "/".                           100500      
001232     02 PASO-LJ        PIC X(04).                                 100600      
001233     02 FILLER         PIC X VALUE "/".                           100700      
001234     02 MTP-LJ         PIC 9(03).                                 100800      
001235     02 FILLER         PIC X VALUE ":".                           100900      
001236     02 TIPO-LJ        PIC X.                                     101000      
001237     02 FILLER         PIC X VALUE ">".                           101100      
001238     02 CODIGO-LJ      PIC 9(06).                                 101200      
001239     02 FILLER         PIC X VALUE "<".                           101300      
001240     02 TEXTO-LJ       PIC X(250).                                101400      
001241*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001242*INICIA CODIGO DE RENOVACION CRONOS 2000                          122050      
001243*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001244*  COPY "S151/CRONOS2K/CPY/WS".                                   122100      
001245******************************************************************000100      
001246** This copyBook defines all the additional variables that      **000200      
001247** Unisys has defined for the CRONOS2K project                  **000300      
001248** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
001249******************************************************************000500      
001250                                                                  000600      
001251******************************************************************000700      
001252** These Variables are used to Accept the system date in long   **000800      
001253** format and get the century information                       **000900      
001254** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
001255 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
001256 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
001257    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
001258    05 FILLER      PIC X(1).                                      001400      
001259    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
001260    05 FILLER      PIC X(1).                                      001600      
001261    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
001262    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
001263      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
001264      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
001265******************************************************************002100      
001266                                                                  002200      
001267******************************************************************002300      
001268** This variable defines a date in the format MMDDCCAA          **002400      
001269**                                                              **002500      
001270 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
001271 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
001272    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
001273    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
001274    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
001275    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
001276      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
001277      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
001278******************************************************************003400      
001279                                                                  003500      
001280******************************************************************003600      
001281** This variable defines a date in the format CCAAMMDD          **003700      
001282**                                                              **003800      
001283 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
001284 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
001285    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
001286    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
001287      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
001288      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
001289    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
001290    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
001291******************************************************************004700      
001292                                                                  004800      
001293******************************************************************004900      
001294** This variable defines a date in the format DDMMCCAA          **005000      
001295**                                                              **005100      
001296 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
001297 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
001298    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
001299    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
001300    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
001301    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
001302      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
001303      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
001304******************************************************************006000      
001305                                                                  006100      
001306******************************************************************006200      
001307** This variable defines a date in the Julian Format CCAADDD    **006300      
001308**                                                              **006400      
001309 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
001310 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
001311    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
001312    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
001313                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
001314      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
001315      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
001316    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
001317******************************************************************007300      
001318                                                                  007400      
001319******************************************************************007500      
001320** This variable defines a date in the format AAMMDD            **007600      
001321**                                                              **007700      
001322 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
001323 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
001324    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
001325    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
001326    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
001327******************************************************************008300      
001328                                                                  008400      
001329******************************************************************008500      
001330** This variable defines a date in the format MMDDAA            **008600      
001331**                                                              **008700      
001332 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
001333 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
001334    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
001335    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
001336    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
001337******************************************************************009300      
001338                                                                  009400      
001339******************************************************************009500      
001340** This variable defines a date in the format DDMMAA            **009600      
001341**                                                              **009700      
001342 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
001343 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
001344    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
001345    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
001346    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
001347******************************************************************010300      
001348                                                                  010400      
001349******************************************************************010500      
001350** These variables are defined to be used for CALL bridge logic **010600      
001351**                                                              **010700      
001352 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
001353 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
001354 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
001355 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
001356 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
001357 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
001358******************************************************************011400      
001359                                                                  011500      
001360******************************************************************011600      
001361** This variable is used for converting only a year field AA to **011700      
001362** CCAA and a CCAA to AA                                        **011800      
001363 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
001364 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
001365    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
001366    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
001367 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
001368 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
001369******************************************************************012300      
001370                                                                  012400      
001371******************************************************************012500      
001372** These variables are Bridge Variables for Intercambio files   **012600      
001373** para EDOCTA                                                  **012700      
001374 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
001375 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
001376 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
001377 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
001378 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
001379 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
001380 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
001381******************************************************************013500      
001382* Para MODULO                                                     013600      
001383 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
001384******************************************************************013800      
001385******************************************************************013900      
001386** Para FMOVSCHABO                                                014000      
001387 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
001388******************************************************************014200      
001389                                                                  014300      
001390******************************************************************014400      
001391***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
001392******************************************************************014600      
001393                                                                  014700      
001394 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
001395 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
001396     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
001397     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
001398     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
001399******************************************************************015300      
001400                                                                  015400      
001401******************************************************************015500      
001402***  These Variables Are Defined For Date In AAMM Format       ***015600      
001403******************************************************************015700      
001404                                                                  015800      
001405 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
001406 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
001407     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
001408     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
001409******************************************************************016300      
001410                                                                  016400      
001411                                                                  016500      
001412*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001413  01  A2K-BASE-YEAR     PIC 9(02) VALUE 50.                       122150      
001414*TERMINA CODIGO DE RENOVACION CRONOS 2000                         122200      
001415  77  W77-FRAMESIZE                PIC  9(002) COMP.              122210      
001416  77  W77-LASTRECORD               PIC  9(012) COMP.              122220      
001417  77  W77-MAXRECSIZE               PIC  9(012) COMP.              122230      
001418  77  W77-DISK-SIZE                PIC  9(018) COMP.              122240      
001419  77  W77-MEMORY-SIZE              PIC  9(018) COMP.              122250      
001420                                                                  122260      
001421   01  WS-CALC-WORD                 PIC  9(012)V99.               122270      
001422   01  WS-CALC-WORD-RED   REDEFINES WS-CALC-WORD.                 122280      
001423       02 WS-WORD-ENT               PIC  9(012).                  122290      
001424       02 WS-WORD-RES               PIC  9(002).                  122300      
001425/                                                                 122400      
001426  PROCEDURE DIVISION.                                             122600      
001427  0000-RUTINA-PRINCIPAL SECTION.                                  122800      
001428*------------------------------                                   123000      
001429  0000-INICIO.                                                    123200      
001430*                                                                 123300      
001431     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   123310      
001432      "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".            123320      
001433     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     123330      
001434     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      123340      
001435                                                                  123350      
001436     CHANGE ATTRIBUTE LIBACCESS    OF "LIBICA" TO BYFUNCTION.     123400      
001437     CHANGE ATTRIBUTE FUNCTIONNAME OF "LIBICA" TO "LIBICA.".      123800      
001438     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.123850      
001439     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            123900      
001440                                      "SOPORTECOMS".              123950      
001441     CALL "CSIID OF SOPORTECOMS" USING WKS-DATOS-HOST.            123960      
001442     MOVE WKS-NUMCSI      TO      WKS-TR-CSI2.                    123970      
001443*                                                                 124000      
001444     CHANGE ATTRIBUTE LIBACCESS    OF "CTRLVERS" TO BYFUNCTION.   124005      
001445     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".    124010      
001446                                                                  124015      
001447     MOVE "S151L001CTL"         TO WKS-CTLVERS-LIBRERIA           124020      
001448     CALL "DAME_TIT IN CTRLVERS"                                  124025      
001449          USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO          124030      
001450          GIVING WKS-CTLVERS-STATUS.                              124035      
001451                                                                  124040      
001452     IF WKS-CTLVERS-STATUS < 0                                    124045      
001453        MOVE "ERROR EN CTLVERS, USO LIBEST SIN RELEASE NI MTP"    124050      
001454                         TO TEXTO-LJ                              124055      
001455     ELSE                                                         124060      
001456        CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL" TO             124065      
001457               WKS-CTLVERS-TITULO.                                124070      
001458*                                                                 124075      
001459     MOVE "S151"                  TO SISTEMA-LJ.                  124077      
001460     MOVE "P114"                  TO WKS-PASO-BACK2               124080      
001461                                     PASO-LJ                      124085      
001462                                     WLI-RB-E1-PASO.              124086      
001463     MOVE "001"                   TO MTP-LJ.                      124087      
001464     MOVE "DIARIO"                TO WLI-RB-E2-TIPO-PROC2.        124088      
001465     MOVE "151"        TO WKS-SIS-BACK2, WLI-RB-E3-SISTEMA2.      124089      
001466                                                                  124090      
001467*ASM PERFORM 0100-FORMATO-DISPLAY.                                124100      
001468     PERFORM 1010-OBTIENE-FECHA.                                  124200      
001469     PERFORM 1000-INICIA.                                         124400      
001470     PERFORM 2000-PROCESO.                                        124600      
001471     PERFORM 9000-TERMINA.                                        124800      
001472     MOVE "DIARIO"                TO WLI-RB-E2-TIPO-PROC2.        127088      
001473*                                                                 131800      
001474 1000-INICIA.                                                     132000      
001475*------------                                                     132200      
001476*ASM OPEN I-O    SUPERVISOR.                                      133800      
001477     OPEN OUTPUT CLASIFICA.                                       134000      
001478*                                                                 134100      
001479*ASM PERFORM 1010-OBTIENE-FECHA.                                  134200      
001480     MOVE WS-FECHA-AMD                 TO NOM-ARCH-FECH.          134800      
001481     CHANGE ATTRIBUTE TITLE OF INFOICA TO NOMBRE-ARCHIVOS.        135400      
001482     OPEN OUTPUT INFOICA.                                         137600      
001483*                                                                 137700      
001484     PERFORM 1100-ABREDIAICA-UNISYS.                              138000      
001485     PERFORM 1400-LIMPIA-TABLA-COD VARYING WS-INDICE              138800      
001486             FROM 1 BY 1 UNTIL WS-INDICE = 99.                    139000      
001487     MOVE 0                         TO WS-INDICE, WS-FIN-PROCESO. 139400      
001488/                                                                 139500      
001489 0100-FORMATO-DISPLAY.                                            139510      
001490*---------------------                                            139520      
001491                                                                  139530      
001492*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001493* COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY.".                   139540      
001494                                                                  000100      
001495*===============================================================* 000200      
001496*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
001497*         PARA LLAMADO DE DISPLAY                               * 000400      
001498*===============================================================* 000500      
001499                                                                  000600      
001500     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
001501            TO BYFUNCTION.                                        000671      
001502                                                                  000691      
001503     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
001504          USING WKS-DATE-ARRAY2.                                  000800      
001505     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
001506     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
001507     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
001508     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
001509     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
001510     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
001511                                                                  001300      
001512     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
001513     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
001514     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
001515                               WKS-TIT-REPORTE2.                  001700      
001516*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
001517*                                  GIVING WKS-COMPILA2.           001900      
001518*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
001519*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
001520*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
001521*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
001522                                                                  002066      
001523*    IF WKS-AAA-VERSION2  < 50                                    002071      
001524*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
001525*    ELSE                                                         002081      
001526*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
001527                                                                  002091      
001528                                                                  002500      
001529*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
001530     OPEN OUTPUT V00-REPORTE2.                                    002700      
001531     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
001532     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
001533                                                                  003000      
001534 000-050-CHECA-SALTO-HOJA2.                                       003051      
001535*==========================                                       003071      
001536    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
001537     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
001538        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
001539     ELSE                                                         003079      
001540        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
001541     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
001542     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
001543     MOVE "/"                     TO WKS-SLASH1.                  003086      
001544     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
001545     MOVE "/"                     TO WKS-SLASH2.                  003088      
001546     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
001547     IF  WKS-NUM-LINEAS2 > 56                                     003091      
001548         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
001549         ADD 1                   TO    W77-CONT-HOJA2             003200      
001550         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
001551         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
001552         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
001553         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
001554         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
001555         MOVE SPACES             TO V00-R00-REPORTE2              003800      
001556         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
001557         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
001558                                                                  004100      
001559 000-030-IMPRIME-MENSAJE.                                         004200      
001560*========================                                         004300      
001561*LP                                                               004400      
001562     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
001563     ADD             2       TO WKS-NUM-LINEAS2                   004600      
001564     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
001565                                                                  004800      
001566*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001567/                                                                 139550      
001568 1010-OBTIENE-FECHA.                                              139600      
001569*-------------------                                              139700      
001570*ASM CALL "CSIID IN SOPORTECOMS" USING WKS-DATOS-HOST.            139800      
001571     MOVE WKS-NUMCSI                TO WKS-B01-CSI.               140000      
001572     MOVE 264                       TO WKS-B01-SISTEMA.           140200      
001573     MOVE 1                         TO WKS-B01-FUNCION.           140400      
001574     CALL "CONSISDIA IN S151LIBCONTROL" USING WKS-S151B01SISDIA   140600      
001575                                     GIVING W77-STATUS.           140610      
001576     IF W77-STATUS > 0                                            140620      
001577        MOVE "E"                    TO TIPO-LJ                    140630      
001578        MOVE 020901                 TO CODIGO-LJ                  140640      
001579        STRING "ERROR AL CONSULTAR S151LIBCONTROL :", W77-STATUS  140650      
001580        DELIMITED BY SIZE INTO TEXTO-LJ                           140660      
001581        PERFORM 999999-DESPLIEGA                                  140670      
001582        SET MYSELF(STATUS)          TO -1.                        140680      
001583     IF ATTRIBUTE VALUE OF MYSELF = 0                             140690      
001584        MOVE WKS-B01-FECPRO151      TO WS-FECHA-AMD               140700      
001585     ELSE                                                         140710      
001586        MOVE ATTRIBUTE VALUE OF MYSELF TO WS-FECHA-AMD.           140715      
001587     MOVE WS-FECHA-AMD              TO WLI-RB-E1-FECHA-INF2.      140718      
001588     PERFORM 0100-FORMATO-DISPLAY.                                140720      
001589     MOVE WKS-FEMAQ8D2              TO WS-FEMAQ-AMD.              140721      
001590     PERFORM 1012-INVIERTE-FECHAS.                                140722      
001591*ASM MOVE WS-FE-AMD-YEAR            TO WS-FE-DMA-YEAR             140723      
001592     MOVE WS-FECHA-DMA              TO W77-FECHA-PROC             140724      
001593     IF WKS-NUMCSI = 04  OR = 12                                  140725      
001594        MOVE "MON"                  TO NOM-ARCH-NO-ORI,           140730      
001595                                       NOM-ARCH-NO-DES,           140735      
001596                                       WS-RHI-CSI-ORI,            140737      
001597                                       WS-RHI-CSI-DES             140739      
001598     ELSE                                                         140740      
001599     IF WKS-NUMCSI = 10 OR = 32                                   140742      
001600        MOVE "VDM"                  TO NOM-ARCH-NO-ORI,           140745      
001601                                       NOM-ARCH-NO-DES,           140750      
001602                                       WS-RHI-CSI-ORI,            140752      
001603                                       WS-RHI-CSI-DES.            140754      
001604     MOVE W77-FECHA-PROC            TO WS-FECHA-DMA,              140755      
001605                                       WS-RHI-FEC-PRO.            140760      
001606*ASM ACCEPT WS-RHI-FEC-GEN FROM TODAYS-DATE.                      140800      
001607     MOVE WS-FEMAQ-DMA              TO WS-RHI-FEC-GEN.            141000      
001608     ACCEPT WS-TIME-HHMMSSSS FROM TIME.                           141200      
001609     MOVE   WS-TIME-HHMMSS          TO WS-RG-HORA-CRE,            141400      
001610                                       WS-RHI-HOR-GEN.            141600      
001611*ASM MOVE   WS-RG-CSI-NOM-CORTO     TO WS-RHI-CSI-ORI.            141800      
001612*ASM MOVE   WS-RG-NOM-HOST          TO WS-RHI-CSI-DES.            142000      
001613*ASM PERFORM 1012-INVIERTE-FECHA.                                 142200      
001614*ASM MOVE GUARD-PROC-HOY-DD         TO T-2-DIA, WS-D-F-DIA .      142400      
001615*ASM MOVE GUARD-PROC-HOY-MM         TO T-2-MES, WS-D-F-MES .      142600      
001616*ASM MOVE GUARD-PROC-HOY-AA         TO T-2-YEAR, WS-D-F-YEAR.     142800      
001617*                                                                 143400      
001618 1012-INVIERTE-FECHAS.                                            143600      
001619*---------------------                                            143700      
001620     MOVE WS-FE-AMD-DIA             TO WS-FE-DMA-DIA.             143800      
001621     MOVE WS-FE-AMD-MES             TO WS-FE-DMA-MES.             144000      
001622     MOVE WS-FE-AMD-YEAR            TO WS-FE-DMA-YEAR.            144200      
001623     MOVE WS-FM-AMD-DIA             TO WS-FM-DMA-DIA.             144220      
001624     MOVE WS-FM-AMD-MES             TO WS-FM-DMA-MES.             144240      
001625     MOVE WS-FM-AMD-YEAR            TO WS-FM-DMA-YEAR.            144260      
001626/                                                                 144330      
001627 1100-ABREDIAICA-UNISYS.                                          144400      
001628*-----------------------                                          144600      
001629     MOVE WS-FECHA-AMD              TO FECHA-ICA.                 144800      
001630     MOVE SPACES                    TO WS-HOST-ICA.               145000      
001631     MOVE NOM-ARCH-NO-ORI           TO WS-HOST-ICA.               145200      
001632     MOVE FECHA-ICA                 TO WS-FECHA-ICA, WS-NUMERO.   145400      
001633     DIVIDE 10000 INTO WS-FECHA-ICA GIVING WS-YEAR.               145800      
001634     DIVIDE   100 INTO WS-FECHA-ICA GIVING WS-NUMERO              146000      
001635                                    REMAINDER WS-DIA.             146200      
001636     COMPUTE WS-MES = WS-NUMERO - (WS-YEAR * 100).                146400      
001637*ASM MOVE WS-DIA                    TO T-2-DIA.                   146600      
001638*ASM MOVE WS-MES                    TO T-2-MES.                   146800      
001639*ASM MOVE WS-YEAR                   TO T-2-YEAR.                  147000      
001640     CALL "ABREDIAICA OF LIBICA"                                  147200      
001641          USING  WS-CONTROL-ICA, FECHA-ICA, WS-HOST-ICA           147400      
001642          GIVING WS-RSLT-ICA.                                     148000      
001643*ASM DISPLAY "020101 01 " WS-PROGRAMA, "INICIO PROCESO ".         148200      
001644     MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ        148220      
001645     MOVE "I"                    TO WLI-TIPO-LJ                   148240      
001646                                    TIPO-LJ                       148260      
001647     MOVE 020101                 TO CODIGO-LJ                     148280      
001648     MOVE "INICIO PROCESO"                                        148300      
001649                                 TO WLI-TEXTO-LJ                  148320      
001650                                    TEXTO-LJ                      148340      
001651     PERFORM      000-030-IMPRIME-MENSAJE                         148360      
001652     IF WS-RSLT-ICA > 0                                           148400      
001653*ASM    DISPLAY "010501 01 " WS-PROGRAMA,                         148600      
001654*ASM            "NO EXISTE ARCHIVO ICA, TERMINACION ANORMAL"      148800      
001655        MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ     148850      
001656        MOVE "I"                    TO WLI-TIPO-LJ                148900      
001657                                       TIPO-LJ                    148950      
001658        MOVE 010501                 TO CODIGO-LJ                  149000      
001659        MOVE "NO EXISTE ARCHIVO ICA, TERMINACION ANORMAL"         149050      
001660                                    TO WLI-TEXTO-LJ               149100      
001661                                       TEXTO-LJ                   149150      
001662        PERFORM      000-030-IMPRIME-MENSAJE                      149200      
001663        SET MYSELF(STATUS) TO -1.                                 149400      
001664*                                                                 149500      
001665 1400-LIMPIA-TABLA-COD.                                           153600      
001666*----------------------                                           153800      
001667     MOVE 0                         TO ELEM-CODIG-SERV(WS-INDICE).154000      
001668/                                                                 154100      
001669 2000-PROCESO.                                                    154200      
001670*-------------                                                    154400      
001671     MOVE LOW-VALUES                TO WS-REG-INFOICA-ANT.        154600      
001672     PERFORM 2100-METE-REG UNTIL INDACABE.                        154800      
001673     CALL "CIERRA-DIA-ICA OF LIBICA"                              154820      
001674           USING WS-CONTROL-ICA  GIVING WS-RSLT-ICA.              154825      
001675     CLOSE CLASIFICA.                                             155000      
001676*                                                                 155100      
001677     OPEN INPUT CLASIFICA                                         155110      
001678                                                                  155130      
001679     COMPUTE W77-FRAMESIZE        =                               155131      
001680            (ATTRIBUTE FRAMESIZE  OF CLASIFICA)                   155132      
001681     COMPUTE W77-MAXRECSIZE       =                               155133      
001682            (ATTRIBUTE MAXRECSIZE OF CLASIFICA)                   155134      
001683     COMPUTE W77-LASTRECORD       =                               155135      
001684            (ATTRIBUTE LASTRECORD OF CLASIFICA                    155136      
001685                                  +   1)                          155137      
001686     CLOSE CLASIFICA     SAVE                                     155140      
001687                                                                  155150      
001688     IF W77-FRAMESIZE             =   8                           155152      
001689        COMPUTE WS-CALC-WORD      =   W77-MAXRECSIZE              155154      
001690                                  /   6                           155156      
001691        IF WS-WORD-RES            >   ZEROS                       155158      
001692           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                 155160      
001693                                  +   1                           155162      
001694        ELSE                                                      155164      
001695           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT          .      155166      
001696                                                                  155168      
001697     COMPUTE W77-MEMORY-SIZE ROUNDED                              155170      
001698                                  =   (W77-MAXRECSIZE + 3)        155172      
001699                                  *   2000                        155174      
001700                                  +   1500                        155176      
001701                                                                  155178      
001702     COMPUTE W77-DISK-SIZE ROUNDED                                155180      
001703                                  =   W77-MAXRECSIZE              155182      
001704                                  *   W77-LASTRECORD              155184      
001705                                  *   3.5                  .      155186      
001706                                                                  155188      
001707     SORT SD-INFOICA ON ASCENDING                                 155200      
001708          KEY  SD-LLAVE,                                          155250      
001709               SD-EDO-ICA                                         155300      
001710          USING  CLASIFICA                                        155600      
001711          GIVING CLASIFICA                                        155700      
001712          MEMORY SIZE W77-DISK-SIZE   WORDS                       155800      
001713          DISK   SIZE W77-MEMORY-SIZE WORDS.                      155850      
001714                                                                  155900      
001715     OPEN INPUT CLASIFICA.                                        156000      
001716     PERFORM 2700-CREA-HEADER.                                    156100      
001717     PERFORM 2500-EXT-REG UNTIL FIN-PROCESO.                      156200      
001718*                                                                 156300      
001719 2100-METE-REG.                                                   156400      
001720*--------------                                                   156600      
001721     CALL "REGISTRO-ICA OF LIBICA"                                157000      
001722           USING  WS-CONTROL-ICA, WS-SCRATCH, WS-REGISTRO-SA2,    157200      
001723           GIVING WS-ESTADO.                                      157300      
001724*                                                                 157400      
001725     IF WS-ESTADO > 0                                             157500      
001726        PERFORM 2200-ARMA-SORT                                    157600      
001727     ELSE                                                         157900      
001728        MOVE 1                      TO INDFIN                     158100      
001729        IF WS-ESTADO < 0                                          158200      
001730*ASM       DISPLAY "010106 02 " WS-PROGRAMA,                      158300      
001731*ASM               "ERROR AL LEER LIBICA, RSLT:", WS-ESTADO.      158400      
001732           MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ  158500      
001733           MOVE "I"                    TO WLI-TIPO-LJ             158600      
001734                                          TIPO-LJ                 158700      
001735           MOVE 010106                 TO CODIGO-LJ               158800      
001736           MOVE "ERROR AL LEER LIBICA "                           158900      
001737                                       TO WLI-TEXTO-LJ            159000      
001738                                          TEXTO-LJ                159100      
001739           PERFORM      000-030-IMPRIME-MENSAJE.                  159200      
001740*                                                                 163200      
001741 2200-ARMA-SORT.                                                  163400      
001742*---------------                                                  163600      
001743     IF COD-SERV-VALIDO                                           163800      
001744        ADD 1                     TO ELEM-CODIG-SERV(MSG-TRC1-COD)164000      
001745        MOVE WS-ESTADO            TO EDO-ICA                      164200      
001746        WRITE REG-CLASIFICA       FROM WS-REGISTRO-SA2.           164400      
001747/                                                                 164600      
001748 2500-EXT-REG.                                                    164800      
001749*-------------                                                    165000      
001750     READ CLASIFICA               INTO WS-REGISTRO-SA2            165200      
001751       AT END                                                     165300      
001752          MOVE 1                    TO WS-FIN-PROCESO.            165400      
001753*                                                                 165500      
001754     IF FIN-PROCESO                                               166200      
001755        PERFORM 2800-CREA-TRAILER                                 166400      
001756     ELSE                                                         166600      
001757        PERFORM 2600-ARMA-REGISTROS.                              166800      
001758*                                                                 167000      
001759 2600-ARMA-REGISTROS.                                             167200      
001760*-------------------                                              167400      
001761     MOVE ZEROS                   TO WS-RDI-STA-TRN.              167600      
001762     IF WS-LLAVE NOT = SA2-IDENT                                  167800      
001763        MOVE 0                    TO WS-EDO-ERRONEO               168000      
001764        MOVE 0                    TO WS-MSG-CONFIRMADO.           168200      
001765*                                                                 168400      
001766     IF EDO-ICA-SOSPECHOSO OR EDO-ICA-REVOCADO OR                 168600      
001767        EDO-ICA-POR-REVOCAR                                       168800      
001768        MOVE 1                    TO WS-EDO-ERRONEO.              169000      
001769*                                                                 169200      
001770     IF EDO-ERRONEO                                               169400      
001771        NEXT SENTENCE                                             169600      
001772     ELSE                                                         169800      
001773     IF SA2-INTERACTIVO                                           170000      
001774        IF EDO-ICA-CONFIRMADO                                     170200      
001775           MOVE 1                 TO WS-MSG-CONFIRMADO            170400      
001776        ELSE                                                      170600      
001777        IF ( EDO-ICA-PROCESADO-ORI AND MSG-CONFIRMADO ) OR        170800      
001778           ( EDO-ICA-PROCESADO-DES )                              171000      
001779           IF MSG-REGRESO                                         171200      
001780              PERFORM 2610-VERIFICA-RESPUESTA.                    171400      
001781*                                                                 173200      
001782     MOVE SA2-IDENT               TO WS-LLAVE.                    173400      
001783*                                                                 173600      
001784 2610-VERIFICA-RESPUESTA.                                         173800      
001785*------------------------                                         174000      
001786     IF MSG-COD-RESP OR MSG-COD-ENTREGADO OR MSG-COD-ACEPTADO     174200      
001787        MOVE TMSYR-TRN-NUM-AUTOR  TO WS-CVE-AUTORIZACION          174400      
001788        IF SA2-APLICADA                                           174600      
001789           IF EDO-ICA-PROCESADO-ORI                               174800      
001790              MOVE 3              TO WS-RDI-STA-TRN               175000      
001791           ELSE                                                   175200      
001792              MOVE 2              TO WS-RDI-STA-TRN.              175400      
001793*                                                                 176000      
001794     IF WS-RDI-STA-TRN = 2 OR 3                                   176200      
001795        PERFORM 2630-ARMA-REG-INFOICA                             176400      
001796        PERFORM 2640-ESCRIBE-INFOICA.                             176600      
001797*                                                                 176800      
001798 2630-ARMA-REG-INFOICA.                                           177000      
001799*----------------------                                           177100      
001800      MOVE MSG-HDR-CCRORI         TO  WS-RDI-CSI-ORI              177200      
001801      MOVE MSG-HDR-COMPUT-ORI     TO  WS-RDI-NOD-ORI              177400      
001802      MOVE MSG-HDR-CCRDEST        TO  WS-RDI-CSI-DEST             177600      
001803      MOVE MSG-HDR-SO-TYPE        TO  WS-RDI-TIPO-DISP            177800      
001804      MOVE SA2-ENT-NUM-ORIGEN     TO  WS-RDI-SUC-ORI              178000      
001805      MOVE SA2-CJA-COD-ORIGEN     TO  WS-RDI-CAJA-ORI             178200      
001806*ASM  MOVE SA2-TRN-FECHA          TO  WS-RDI-FEC-GEN              178400      
001807      MOVE SA2-TRN-FECHA          TO  A2K-FEC-AMD-001.            178420      
001808      PERFORM A2K-CONV-AMD-TO-CAMD THRU A2K-CONV-AMD-TO-CAMD-EXIT.178440      
001809      MOVE A2K-FEC-CAMD-001       TO  WS-RDI-FEC-GEN.             178460      
001810*ASM                                                              178480      
001811      MOVE SA2-TRN-HORA           TO  WS-RDI-HOR-GEN              178600      
001812      MOVE MSG-TRC2-APL           TO  WS-RDI-APL-ORI              178800      
001813      MOVE MSG-TRC1-APL           TO  WS-RDI-APL-DES              179000      
001814      MOVE MSG-TRC1-COD           TO  WS-RDI-COD-SER              179200      
001815      MOVE MSG-TRC1-SBC           TO  WS-RDI-SUB-SER              179400      
001816      MOVE CTA-NUM                TO  WS-RDI-CTA-DES              179600      
001817      MOVE TRN-IMP                TO  WS-RDI-IMP-TRN              179800      
001818      MOVE MND-CVE                TO  WS-RDI-MON-TRN              180000      
001819*ASM  MOVE TRN-FEC-SOLICITUD      TO  WS-RDI-FEC-CON              180200      
001820      MOVE TRN-FEC-SOLICITUD      TO  A2K-FEC-AMD-001.            180220      
001821      PERFORM A2K-CONV-AMD-TO-CAMD THRU A2K-CONV-AMD-TO-CAMD-EXIT.180240      
001822      MOVE A2K-FEC-CAMD-001       TO  WS-RDI-FEC-CON.             180260      
001823*ASM                                                              180280      
001824      MOVE SA2-TRN-NUM            TO  WS-RDI-NUM-TRN              180400      
001825      MOVE CTA-NUM                TO  WS-RDI-CTA-ACC              180600      
001826      MOVE TRN-REF-OPERACION      TO  WS-RDI-REF-OPE              180800      
001827      MOVE WS-CVE-AUTORIZACION    TO  WS-RDI-CVE-AUT.             181000      
001828*                                                                 181200      
001829 2640-ESCRIBE-INFOICA.                                            181600      
001830*---------------------                                            181800      
001831      IF WS-REG-DET-INFOICA NOT = WS-REG-INFOICA-ANT              182000      
001832         ADD 1                    TO WS-NUM-REG                   182200      
001833         WRITE REG-INFOICA      FROM WS-REG-DET-INFOICA.          182400      
001834      MOVE WS-REG-DET-INFOICA     TO WS-REG-INFOICA-ANT.          182600      
001835*                                                                 183000      
001836 2700-CREA-HEADER.                                                183200      
001837*-----------------                                                183400      
001838      WRITE REG-INFOICA         FROM WS-REG-HEA-INFOICA.          184000      
001839*                                                                 184100      
001840 2800-CREA-TRAILER.                                               184200      
001841*-----------------                                                184400      
001842      MOVE WS-NUM-REG             TO WS-RTI-REG.                  184600      
001843      WRITE REG-INFOICA         FROM WS-REG-TRA-INFOICA.          184800      
001844      PERFORM 2900-REESCRIBE-REG-UNO.                             185000      
001845*                                                                 185100      
001846 2900-REESCRIBE-REG-UNO.                                          185200      
001847*-----------------------                                          185400      
001848      CLOSE INFOICA.                                              185600      
001849      OPEN I-O INFOICA.                                           185800      
001850      READ INFOICA              INTO WS-REG-HEA-INFOICA.          186000      
001851      MOVE WS-NUM-REG             TO WS-RHI-NUM-REG.              186200      
001852      REWRITE REG-INFOICA       FROM WS-REG-HEA-INFOICA.          186400      
001853/                                                                 186500      
001854 9000-TERMINA SECTION.                                            186600      
001855*------------------------                                         186800      
001856 9001-TERM.                                                       187000      
001857*----------                                                       187200      
001858*ASM  PERFORM 9100-ACTUALIZA-GUARDIAN.                            187600      
001859      CLOSE INFOICA    WITH LOCK.                                 188400      
001860*ASM  CLOSE SUPERVISOR WITH LOCK                                  188600      
001861      CLOSE CLASIFICA  WITH LOCK.                                 188800      
001862*ASM  DISPLAY "020201 01 " WS-PROGRAMA "FIN NORMAL".              188900      
001863      MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ       188910      
001864      MOVE "I"                    TO WLI-TIPO-LJ                  188920      
001865                                     TIPO-LJ                      188930      
001866      MOVE 020201                 TO CODIGO-LJ                    188940      
001867      MOVE "FIN NORMAL DEL PROGRAMA"                              188950      
001868                                  TO WLI-TEXTO-LJ                 188960      
001869                                     TEXTO-LJ                     188970      
001870      PERFORM      000-030-IMPRIME-MENSAJE                        188980      
001871      STOP RUN.                                                   189000      
001872*                                                                 189100      
001873*ASM 9100-ACTUALIZA-GUARDIAN.                                     189200      
001874*------------------------                                         189400      
001875*ASM MOVE 5                        TO WS-FORMATO.                 190800      
001876*ASM MOVE 13                       TO WS-FUNCION.                 191000      
001877*ASM MOVE WS-RG-FEC-PROC-HOY       TO WS-FECHA1.                  191200      
001878*ASM MOVE 1                        TO WS-FECHA2.                  191400      
001879*ASM CALL "THECALENDAR IN S006/OBJECT/LOCSUP"                     191600      
001880*ASM      USING WS-FUNCION,WS-FECHA1,WS-FECHA2,WS-FORMATO.        191800      
001881*                                                                 192000      
001882*ASM MOVE WS-RG-FEC-PROC-HOY       TO WS-RG-FEC-PROC-ANT.         193000      
001883*ASM MOVE WS-FECHA1                TO WS-RG-FEC-PROC-HOY.         193200      
001884*ASM REWRITE REG-GUARDIAN        FROM WS-REG-GUARDIAN.            193400      
001885*                                                                 193500      
001886 999999-DESPLIEGA.                                                193600      
001887*-----------------                                                193700      
001888     CALL "LJ IN LIB-DISP"                                        193800      
001889              USING CONTADOR-LJ, MENSAJE-LJ.                      193900      
001890                                                                  194000      
001891*INICIA CODIGO DE RENOVACION CRONOS 2000                          194100      
001892*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001893*   COPY "S151/CRONOS2K/CPY/PD".                                  194200      
001894** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
001895** Unisys has defined for CRONOS2K project                     ** 000200      
001896** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
001897***************************************************************** 000400      
001898***************************************************************** 000600      
001899** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
001900** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
001901** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
001902** date MMDDCCAA, which is returned into the variable          ** 001000      
001903** A2K-FEC-MDCA-001.                                           ** 001100      
001904***************************************************************** 001200      
001905                                                                  001300      
001906 A2K-ACCEPT-TODAYS-DATE.                                          001400      
001907        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
001908*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
001909        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
001910        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
001911        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
001912        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
001913        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
001914                                                                  002200      
001915 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
001916        EXIT.                                                     002240      
001917                                                                  002500      
001918****************************************************************  002600      
001919** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
001920**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
001921**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
001922**baseyear to add the century to the year part.               **  003000      
001923**INPUT is A2K-FEC-AMD-001                                    **  003100      
001924**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
001925****************************************************************  003300      
001926                                                                  003400      
001927 A2K-CONV-AMD-TO-CAMD.                                            003500      
001928         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
001929         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
001930         IF A2K-FEC-AMD-001 = 0                                   003720      
001931            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
001932         ELSE                                                     003741      
001933          IF A2K-FEC-AMD-001 = 999999                             003742      
001934             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
001935         ELSE                                                     003760      
001936         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
001937                 A2K-OBTAIN-CENTURY-EXIT                          003900      
001938         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
001939         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
001940         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
001941         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
001942                                                                  004400      
001943 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
001944         EXIT.                                                    004600      
001945                                                                  004700      
001946******************************************************************004800      
001947**A2K-CONV-MDA-TO-MDCA.                                         **004900      
001948**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
001949** an eight digit format as MMDDCCAA. It use a                  **005100      
001950** baseyear to add century to the yaer.                         **005200      
001951** INPUT is A2K-FEC-MDA-001                                     **005300      
001952** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
001953                                                                  005500      
001954 A2K-CONV-MDA-TO-MDCA.                                            005600      
001955     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
001956     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
001957     IF A2K-FEC-MDA-001 = 0                                       005820      
001958        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
001959     ELSE                                                         005845      
001960      IF A2K-FEC-MDA-001 = 999999                                 005850      
001961         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
001962     ELSE                                                         005860      
001963     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
001964             A2K-OBTAIN-CENTURY-EXIT                              006000      
001965     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
001966     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
001967     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
001968     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
001969                                                                  006500      
001970 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
001971     EXIT.                                                        006700      
001972                                                                  006800      
001973***************************************************************** 006900      
001974**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
001975**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
001976**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
001977**baseyear to add century to the year.                         ** 007300      
001978**INPUT is A2K-FEC-DMA-001                                     ** 007400      
001979**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
001980                                                                  007600      
001981 A2K-CONV-DMA-TO-DMCA.                                            007700      
001982       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
001983       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
001984       IF  A2K-FEC-DMA-001   = 0                                  007920      
001985          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
001986       ELSE                                                       007945      
001987        IF A2K-FEC-DMA-001 = 999999                               007950      
001988          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
001989       ELSE                                                       007960      
001990       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
001991               A2K-OBTAIN-CENTURY-EXIT                            008100      
001992       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
001993       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
001994       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
001995       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
001996                                                                  008600      
001997 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
001998       EXIT.                                                      008800      
001999                                                                  008900      
002000***************************************************************** 009000      
002001** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
002002** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
002003** a 6 digit format as AAMMDD.                                 ** 009300      
002004** It simply removes the century information in the output     ** 009400      
002005** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
002006** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
002007                                                                  009700      
002008 A2K-CONV-CAMD-TO-AMD.                                            009800      
002009     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
002010     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
002011     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
002012     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
002013                                                                  010300      
002014 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
002015      EXIT.                                                       010500      
002016                                                                  010600      
002017******************************************************************010700      
002018******************************************************************010800      
002019** A2K-CONV-MDCA-TO-MDA.                                        **010900      
002020** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
002021** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
002022** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
002023** INPUT is A2K-FEC-MDCA-001                                    **011300      
002024** OUTPUT is A2K-FEC-MDA-001                                    **011400      
002025                                                                  011500      
002026 A2K-CONV-MDCA-TO-MDA.                                            011600      
002027     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
002028     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
002029     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
002030     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
002031                                                                  012100      
002032 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
002033      EXIT.                                                       012300      
002034                                                                  012400      
002035******************************************************************012500      
002036***************************************************************** 012600      
002037** A2K-CONV-DMCA-TO-DMA.                                        **012700      
002038** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
002039** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
002040** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
002041** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
002042** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
002043                                                                  013300      
002044 A2K-CONV-DMCA-TO-DMA.                                            013400      
002045     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
002046     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
002047     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
002048     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
002049                                                                  013900      
002050 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
002051      EXIT.                                                       014100      
002052                                                                  014200      
002053***************************************************************** 014300      
002054 A2K-CONV-MDCA-TO-CAMD.                                           014400      
002055      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
002056      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
002057      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
002058      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
002059      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
002060 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
002061      EXIT.                                                       015100      
002062***************************************************************** 015200      
002063** This paragraph adds century to an year field which is 9(02) ** 015300      
002064** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
002065** Output is A2K-FEC-CCAA-001.                                 ** 015600      
002066***************************************************************** 015700      
002067 A2K-CONV-AA-TO-CCAA.                                             015800      
002068      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
002069      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
002070              A2K-OBTAIN-CENTURY-EXIT.                            016100      
002071      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
002072 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
002073      EXIT.                                                       016400      
002074***************************************************************** 016500      
002075** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
002076** format.                                                     ** 016700      
002077** Input is A2K-FEC-DMCA-001.                                  ** 016800      
002078** Output is A2K-FEC-CAMD-001.                                 ** 016900      
002079***************************************************************** 017000      
002080 A2K-CONV-DMCA-TO-CAMD.                                           017100      
002081      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
002082      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
002083      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
002084      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
002085      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
002086 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
002087      EXIT.                                                       017800      
002088***************************************************************** 017900      
002089** This paragraph desides the Century to be added depending    ** 018000      
002090** on the base year.                                           ** 018100      
002091** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
002092** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
002093***************************************************************** 018400      
002094 A2K-OBTAIN-CENTURY.                                              018500      
002095      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
002096          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
002097      ELSE                                                        018800      
002098          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
002099 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
002100      EXIT.                                                       019100      
002101                                                                  019200      
002102***************************************************************** 019300      
002103** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
002104**  Format                                                     ** 019500      
002105** Input Is A2K-FEC-CAMD-001                                   ** 019600      
002106** Output Is A2K-FEC-DMCA-001                                  ** 019700      
002107***************************************************************** 019800      
002108 A2K-CONV-CAMD-TO-DMCA.                                           019900      
002109      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
002110      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
002111      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
002112      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
002113      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
002114                                                                  020500      
002115 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
002116      EXIT.                                                       020700      
002117                                                                  020800      
002118******************************************************************020900      
002119******************************************************************021000      
002120 A2K-CONV-AM-TO-CAM.                                              021100      
002121      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
002122      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
002123      IF A2K-FEC-AM-001 = 0                                       021220      
002124         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
002125      ELSE                                                        021245      
002126      IF A2K-FEC-AM-001 = 9999                                    021250      
002127         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
002128      ELSE                                                        021260      
002129      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
002130      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
002131      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
002132              A2K-OBTAIN-CENTURY-EXIT                             021600      
002133      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
002134                                                                  021800      
002135 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
002136      EXIT.                                                       022000      
002137                                                                  022100      
002138******************************************************************022200      
002139******************************************************************022300      
002140 A2K-CONV-CAM-TO-AM.                                              022400      
002141      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
002142      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
002143      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
002144                                                                  022800      
002145 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
002146   EXIT.                                                          023000      
002147                                                                  023100      
002148                                                                  023200      
002149                                                                  023500      
002150*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002151 A2K-CPY-EXIT-PARA.                                               194300      
002152     EXIT.                                                        194400      
002153*TERMINA CODIGO DE RENOVACION CRONOS 2000                         194500      
