000001$SET LIST LINEINFO MAP XREF                                       000200      
000002$SET OPTIMIZE                                                     000400      
000003$SET LISTOMITTED                                                  000600      
000004                                                                  000650      
000005***********************************************************       000660      
000006* RECOMPILACION POR EL UPGRADE DEL MCP A 55               *       000662      
000007* 20141205 15MTP001 MJGRG                                 *       000664      
000008* RECOMPILACION POR EL UPGRADE DEL MCP A 60               *       000680      
000009* 20221230 23MTP001 CLLC                                  *       000700      
000010***********************************************************       000720      
000011 IDENTIFICATION DIVISION.                                         000800      
000012 PROGRAM-ID. CTASMIGCAP.                                          001000      
000013 AUTHOR. RICARDO MIRELES TOVAR.                                   001200      
000014                                                                  001400      
000015 ENVIRONMENT DIVISION.                                            001600      
000016 INPUT-OUTPUT SECTION.                                            001800      
000017 FILE-CONTROL.                                                    002000      
000018                                                                  002200      
000019     SELECT A01-MOVS500   ASSIGN       TO DISK                    002400      
000020                          ORGANIZATION IS SEQUENTIAL              002600      
000021                          ACCESS MODE  IS SEQUENTIAL              002800      
000022                          ACTUAL KEY   IS W77-NUMREG-MOV500.      003000      
000023                                                                  003200      
000024     SELECT A03-CTLMIG    ASSIGN       TO DISK                    003400      
000025                          ACCESS MODE  IS SEQUENTIAL              003600      
000026                          ACTUAL KEY   IS W77-NUMREG-ACC.         003800      
000027                                                                  004000      
000028     SELECT L01-DISPLAY   ASSIGN TO DISK.                         004200      
000029                                                                  004400      
000030     SELECT R01-TOTALES   ASSIGN       TO PRINTER.                004600      
000031                                                                  004800      
000032                                                                  005000      
000033                                                                  005200      
000034 DATA        DIVISION.                                            005400      
000035 FILE SECTION.                                                    005600      
000036 FD A01-MOVS500                                                   005800      
000037*==============                                                   006000      
000038    VALUE OF TITLE               IS WKS-RUT-MOVS500               006200      
000039    VALUE OF BUFFERS IS 1                                         006400      
000040    BLOCK  CONTAINS 144 RECORDS.                                  006600      
000041                                                                  006800      
000042    01 A01-R01-S500              PIC X(450).                      007000      
000043                                                                  007200      
000044 FD A03-CTLMIG                                                    007400      
000045*==============                                                   007600      
000046    VALUE OF TITLE               IS WKS-RUT-CTLMIG.               007800      
000047                                                                  008000      
000048 01 R01-REG-MIGRACION.                                            008200      
000049    03 R01-REG-AUTS500           PIC 9(08).                       008400      
000050    03 FILLER                    PIC X(32).                       008600      
000051                                                                  008800      
000052                                                                  009000      
000053  FD L01-DISPLAY VALUE OF PROTECTION    IS PROTECTED,             009200      
000054                 VALUE TITLE IS WKS-RUT-L01.                      009400      
000055  01 REG-DISPLAY                 PIC X(180).                      009600      
000056                                                                  009800      
000057  FD R01-TOTALES                                                  010000      
000058*================                                                 010200      
000059   DATA RECORD                                                    010400      
000060       R01-REG-TOTALES                                            010600      
000061   VALUE OF TITLE IS WKS-RUT-REP-TOTALES.                         010800      
000062 01 R01-REG-TOTALES PIC X(132).                                   011000      
000063                                                                  011200      
000064                                                                  011400      
000065 DATA-BASE SECTION .                                              011600      
000066  DB S151BD13BIFIN.                                               011800      
000067                                                                  012000      
000068 WORKING-STORAGE SECTION.                                         012200      
000069*=========================                                        012400      
000070                                                                  012600      
000071******************************************************************012800      
000072*                  ARCHIVO DE MOVIMIENTOS S500                   *013000      
000073******************************************************************013200      
000074*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000075* COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS    ON CMEMP.".          013400      
000076                                                                  000100      
000077******************************************************************000200      
000078**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
000079**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
000080**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
000081******************************************************************000600      
000082                                                                  000700      
000083 01 A00-R00-HDR-MOV .                                             000800      
000084    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
000085    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
000086    02 FILLER                          PIC  X(08).                001100      
000087    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
000088    02 FILLER                          PIC  X(430).               001300      
000089                                                                  001400      
000090 01 A00-R01-REGMOV .                                              001500      
000091    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
000092    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
000093    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
000094                                                                  001900      
000095    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
000096    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
000097                                       PIC  9(04)      COMP.      002200      
000098    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
000099                                       PIC  9(04)      COMP.      002400      
000100                                                                  002500      
000101    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000102    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
000103                                       PIC  9(02)      COMP.      002800      
000104    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
000105                                       PIC  9(02)      COMP.      003000      
000106    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
000107    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
000108                                       A00-R01-SERVICIO-ALERTA.   003060      
000109       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
000110       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
000111    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
000112    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
000113    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
000114                                       PIC  9(04)      COMP.      003420      
000115    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
000116    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
000117                                       PIC  9(04)      COMP.      003520      
000118    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
000119    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
000120    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
000121                                       PIC  9(02)      COMP.      003900      
000122                                                                  004000      
000123    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
000124    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
000125       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
000126          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
000127          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
000128          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
000129          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
000130          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
000131          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
000132          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
000133                                                                  005100      
000134    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
000135       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
000136       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
000137       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
000138       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
000139       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
000140       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
000141       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
000142                                                                  006000      
000143       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
000144       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
000145       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
000146       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
000147       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
000148       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
000149       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
000150                                                                  006800      
000151       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
000152       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
000153       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
000154       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
000155       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
000156       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
000157       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
000158                                                                  007600      
000159       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
000160       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
000161       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
000162       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
000163       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
000164       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
000165       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
000166                                                                  008400      
000167       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
000168       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
000169       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
000170       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
000171       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
000172       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
000173       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
000174                                                                  009200      
000175    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
000176    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
000177    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
000178    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
000179    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
000180    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
000181       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
000182    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
000183    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
000184    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
000185    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
000186    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
000187    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
000188    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
000189    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
000190       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
000191       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
000192    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
000193    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
000194    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
000195    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
000196    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
000197    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
000198    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
000199    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
000200    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
000201    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
000202    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
000203    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
000204    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
000205    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
000206                                       PIC X(10).                 012600      
000207    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
000208       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
000209       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
000210    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
000211    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
000212    03 A00-R01-FILIAL                  PIC  X(05).                013200      
000213    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
000214       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
000215       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
000216                                                                  013300      
000217    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
000218    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
000219                                       PIC  X(09).                013600      
000220    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
000221                                       PIC  9(18)      COMP.      013800      
000222    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
000223    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
000224                                       PIC  X(9).                 014100      
000225    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
000226    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
000227                                       PIC  X(05).                014400      
000228    03 A00-R01-NIO                     PIC  X(16).                014500      
000229    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
000230    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
000231    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
000232       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
000233    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
000234    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
000235       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
000236    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
000237    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
000238    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
000239    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
000240    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
000241    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
000242                                       PIC  X(04).                015900      
000243    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
000244    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
000245    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
000246                                       PIC  9(04)      COMP.      016300      
000247    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
000248    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
000249    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
000250    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
000251    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
000252                                                                  016900      
000253    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
000254    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
000255       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
000256    03 A00-R01-FILXAPL                 PIC X(165).                017300      
000257                                                                  017400      
000258    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
000259       05 FILLER                       PIC X(96).                 017510      
000260       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
000261       05 FILLER                       PIC X(67).                 017700      
000262                                                                  017702      
000263    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
000264       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
000265       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
000266       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
000267       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
000268       06 WKS-MOV-FILS084              PIC X(154).                017714      
000269                                                                  017800      
000270    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
000271       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
000272       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
000273       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
000274       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
000275       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
000276       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
000277       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
000278       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
000279       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018160      
000280       05 FILLER                       PIC X(62).                 018170      
000281       05 A00-R01-CTE-087              PIC X(07).                 018210      
000282       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
000283          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
000284          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
000285          07 FILLER                    PIC X(01).                 018281      
000286       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
000287       05 FILLER                       PIC X(61).                 018400      
000288                                                                  018500      
000289    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
000290       05 FILLER                       PIC  X(96).                018610      
000291       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
000292       05 FILLER                       PIC  X(65).                018630      
000293                                                                  018640      
000294    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
000295       05 A00-R01-FORMATO0             PIC  9(02).                018700      
000296       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
000297       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
000298       05 FILLER                       PIC  X(141).               018910      
000299                                                                  019100      
000300    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
000301       05 A00-R01-FORMATO1             PIC  9(02).                019300      
000302       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
000303       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
000304       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
000305       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
000306       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
000307       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
000308       05 A00-R01-ENTSAL               PIC  X(01).                020000      
000309       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
000310       05 FILLER                       PIC  X(69).                020200      
000311                                                                  020300      
000312    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
000313       05 A00-R01-FORMATO2             PIC  9(02).                020500      
000314       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
000315       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
000316       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
000317       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
000318       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
000319       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
000320       05 FILLER                       PIC  X(77).                021200      
000321                                                                  021300      
000322    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
000323       05 A00-R01-FORMATO3             PIC  9(02).                021500      
000324       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
000325       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
000326       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
000327       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
000328       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
000329       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
000330       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
000331       05 FILLER                       PIC  X(69).                022300      
000332                                                                  022400      
000333    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
000334       05 A00-R01-FORMATO4             PIC  9(02).                022600      
000335       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
000336       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
000337       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
000338       05 A00-R01-RFCFT04              PIC  X(13).                023000      
000339       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
000340       05 A00-R01-DIRECCION            PIC  X(40).                023200      
000341       05 FILLER                       PIC  X(85).                023300      
000342                                                                  023400      
000343    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
000344       05 A00-R01-COBERTURA            PIC  X(01).                023408      
000345       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
000346       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
000347       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
000348       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
000349       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
000350       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
000351       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
000352       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
000353       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
000354       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
000355       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
000356       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
000357       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
000358       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
000359       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
000360       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
000361       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
000362       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
000363       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
000364       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
000365       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
000366       05 FILLER                       PIC  X(05).                023492      
000367                                                                  023497      
000368    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
000369       05 A00-R01-4CEROS               PIC  9(04).                023600      
000370       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
000371       05 FILLER                       PIC  X(157).               023800      
000372                                                                  023900      
000373    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
000374       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
000375        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
000376       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
000377       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
000378       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
000379       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
000380       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
000381       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
000382       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
000383       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
000384       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
000385       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
000386       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
000387       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
000388       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
000389       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
000390       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
000391       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
000392       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
000393       05 A00-R01-FILLER               PIC  X(41).                025850      
000394       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
000395       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
000396       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
000397       05 A00-R01-INDPAGO              PIC  9(01).                026200      
000398       05 FILLER                       PIC  X(01).                026210      
000399       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
000400       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
000401       05 FILLER                       PIC  X(52).                026300      
000402                                                                  026400      
000403    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
000404       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
000405       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
000406       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
000407       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
000408       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
000409       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
000410       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
000411       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
000412       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
000413       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
000414       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
000415       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
000416       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
000417          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
000418          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
000419       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
000420       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
000421          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
000422       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
000423          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
000424       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
000425          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
000426       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
000427          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
000428       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
000429          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
000430       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
000431          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
000432       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
000433          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
000434       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
000435          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
000436       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
000437          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
000438       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
000439          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
000440          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
000441       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
000442       05 FILLER                       PIC X(01).                 030101      
000443       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
000444       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
000445       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
000446       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
000447       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
000448       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
000449       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
000450       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
000451          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
000452       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
000453       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
000454       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
000455       05 FILLER                       PIC X(14).                 030700      
000456                                                                  030800      
000457    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
000458       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
000459       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
000460       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
000461       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
000462       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
000463       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
000464       05 FILLER                       PIC  X(142).               031600      
000465                                                                  031700      
000466    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
000467       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
000468       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
000469       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
000470       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
000471       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
000472       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
000473       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
000474       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
000475       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
000476       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
000477          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
000478          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
000479          07 FILLER                    PIC  X(08).                032740      
000480       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
000481       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
000482       05 A00-R01-NOMORD               PIC  X(30).                033000      
000483       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
000484       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
000485       05 A00-R01-REF-CECO             PIC  X(07).                033500      
000486       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
000487       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
000488          A00-R01-NUM-ORD-PAGO.                                   033800      
000489          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
000490          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
000491                                                                  034100      
000492    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
000493       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
000494       05 A00-R01-RFC-S501             PIC  X(13).                034160      
000495       05 FILLER                       PIC  X(151).               034180      
000496                                                                  034190      
000497    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
000498       05 A00-R01-DATOS-S701           PIC X(116).                034300      
000499       05 A00-R01-PAG-SERV             REDEFINES                  034400      
000500                                       A00-R01-DATOS-S701.        034500      
000501          07 A00-R01-ID                PIC X(30).                 034600      
000502          07 A00-R01-FECREC            PIC 9(06).                 034700      
000503          07 A00-R01-REF1              PIC X(20).                 034800      
000504          07 A00-R01-REF2              PIC X(20).                 034900      
000505          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
000506          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
000507                                       A00-R01-TIPOPAGO.          035200      
000508             09 A00-R01-ESTAB          PIC 9(04).                 035300      
000509             09 A00-R01-SEQ            PIC 9(02).                 035400      
000510          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
000511          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
000512          07 A00-R01-EBPP              PIC 9(03).                 035700      
000513          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
000514          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
000515          07 FILLER                    PIC X(01).                 035728      
000516          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
000517          07 FILLER                    PIC X(18).                 035760      
000518       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
000519                                       A00-R01-DATOS-S701.        035900      
000520          07 A00-R01-RFC               PIC X(13).                 036000      
000521          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
000522          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
000523          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
000524          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
000525          07 FILLER                    PIC X(85).                 036200      
000526       05 FILLER                       PIC X(49).                 036300      
000527                                                                  036400      
000528    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
000529       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
000530       05 A00-R01-CTA-S702             PIC X(40).                 036700      
000531       05 FILLER                       PIC X(113).                036710      
000532                                                                  036720      
000533    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
000534       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
000535       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
000536       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
000537       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
000538       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
000539       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
000540       05 FILLER                       PIC X(72).                 036800      
000541                                                                  036810      
000542                                                                  036820      
000543    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
000544       05 A00-R01-TRUI-S711.                                      036915      
000545          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
000546          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
000547          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
000548           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
000549          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
000550       05 A00-R01-MICR-S711.                                      036945      
000551          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
000552          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
000553          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
000554          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
000555          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
000556          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
000557          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
000558          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
000559       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
000560       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
000561       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
000562       05 A00-R01-FIL-S711             PIC X(05).                 036965      
000563       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
000564       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
000565       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
000566                                                                  036990      
000567    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
000568       05 A00-R01-RFC-502              PIC  X(13).                037100      
000569       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
000570          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
000571          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
000572          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
000573          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
000574          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
000575          07 FILLER                    PIC  9(01) COMP.           037650      
000576       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
000577       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
000578       05 FILLER                       PIC  X(06).                038680      
000579                                                                  038682      
000580    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
000581       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
000582       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
000583       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
000584       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
000585       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
000586       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
000587       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
000588       05 FILLER                       PIC  X(81).                038750      
000589                                                                  038755      
000590    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
000591       05 A00-R01-COP                  PIC  9(13)        .        038900      
000592       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
000593       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
000594       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
000595       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
000596       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
000597       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
000598       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
000599       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
000600       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
000601       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
000602       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
000603       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
000604       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
000605       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
000606       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
000607       05 FILLER                       PIC  X(81)        .        040800      
000608                                                                  040810      
000609    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
000610       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
000611       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
000612       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
000613       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
000614       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
000615       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
000616       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
000617       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
000618       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
000619       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
000620       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
000621       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
000622       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
000623       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
000624       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
000625       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
000626       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
000627       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
000628       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
000629       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
000630       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
000631       05 FILLER                       PIC  X(18).                041040      
000632                                                                  041400      
000633    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
000634    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
000635*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000636                                                                  013600      
000637******        NOMBRE DE ARCHIVO DE MOVIMIENTOS S500         ******013800      
000638 01 WKS-RUT-MOVS500.                                              014000      
000639    02 FILLER                    PIC X(14) VALUE                  014200      
000640                               "S151/FILE/MOVS".                  014400      
000641    02 WKS-MOVS1-SIST            PIC 9(03).                       014500      
000642    02 FILLER                    PIC X(01) VALUE "/".             014600      
000643    02 WKS-MOVS1-FECHA           PIC 9(06).                       014800      
000644    02 FILLER                    PIC X(04) VALUE " ON ".          015000      
000645    02 WKS-PACK-MOVS             PIC X(17).                       015200      
000646    02 FILLER                    PIC X(01) VALUE ".".             015400      
000647                                                                  015600      
000648******            NOMBRE DEL ARCHIVO DE CONTROL             ******015800      
000649  01  WKS-RUT-CTLMIG.                                             016000      
000650      03 FILLER                  PIC X(24) VALUE                  016200      
000651         "(S151)S151/FILE/CTLP199/".                              016400      
000652      03 WKS-FECHA-MIG           PIC 9(06).                       016600      
000653      03 FILLER                  PIC X(10) VALUE                  016800      
000654         " ON CMEMP.".                                            017000      
000655                                                                  017200      
000656******            NOMBRE DEL ARCHIVO DE ERRORES             ******017400      
000657 01 WKS-RUT-L01.                                                  017600      
000658    10 FILLER                    PIC X(27) VALUE                  017800      
000659        "S151/FILE/L01/DISPLAY/P199/"        .                    018000      
000660    10 WKS-RUT-L01-CSI           PIC X(03)   .                    018200      
000661    10 FILLER                    PIC X(01) VALUE "/".             018400      
000662    10 WKS-RUT-L01-FCH           PIC 9(06).                       018600      
000663    10 FILLER                    PIC X(01) VALUE "/".             018800      
000664    10 WKS-RUT-L01-HORA          PIC 9(08)   .                    019000      
000665    10 FILLER                    PIC X(01) VALUE "." .            019200      
000666                                                                  019400      
000667 01 WKS-RUT-REP-TOTALES.                                          019600      
000668    10 FILLER                    PIC X(15) VALUE                  019800      
000669         "S151/LIST/P199/".                                       020000      
000670    10 WKS-RUT-R01-CSI-ORIGEN    PIC 9(02)  .                     020200      
000671    10 FILLER                    PIC X(08) VALUE                  020400      
000672         "00/R000/".                                              020600      
000673    10 WKS-RUT-R01-FECHA         PIC 9(06)  .                     020800      
000674    10 FILLER                    PIC X(01) VALUE                  021000      
000675        "/".                                                      021200      
000676    10 WKS-RUT-R01-MIX           PIC 9(07)   .                    021400      
000677    10 FILLER                    PIC X(12) VALUE                  021600      
000678             "/001TOTALES.".                                      021800      
000679                                                                  022000      
000680                                                                  022200      
000681******************************************************************022400      
000682*                  VARIABLES ARCHIVO DE ERRORES                  *022600      
000683******************************************************************022800      
000684 01  REGISTRO-DIS-HEADER                          .               023000      
000685     10 FILLER                   PIC X(05) VALUE "FECHA"  .       023200      
000686     10 FILLER                   PIC X(10) VALUE SPACES   .       023400      
000687     10 FILLER                   PIC X(04) VALUE "HORA"   .       023600      
000688     10 FILLER                   PIC X(04) VALUE SPACES   .       023800      
000689     10 FILLER                   PIC X(05) VALUE "PASO "  .       024000      
000690     10 FILLER                   PIC X(02) VALUE SPACES   .       024200      
000691     10 FILLER                   PIC X(07) VALUE "MENSAJE".       024400      
000692 01  REGISTRO-DIS-DETALLE.                                        024600      
000693     10 WKS-DIS-FECHA-S          PIC ZZ.                          024800      
000694     10 WKS-DIS-FECHA-A          PIC ZZ.                          025000      
000695     10 FILLER                   PIC X(01) VALUE "/".             025200      
000696     10 WKS-DIS-FECHA-M          PIC ZZ.                          025400      
000697     10 FILLER                   PIC X(01) VALUE "/".             025600      
000698     10 WKS-DIS-FECHA-D          PIC ZZ.                          025800      
000699     10 FILLER                   PIC X(05) VALUE SPACES .         026000      
000700     10 WKS-DIS-HORA             PIC 9(02) .                      026200      
000701     10 FILLER                   PIC X(01) VALUE ":" .            026400      
000702     10 WKS-DIS-MINUTO           PIC 9(02) .                      026600      
000703     10 FILLER                   PIC X(03) VALUE SPACES.          026800      
000704     10 FILLER                   PIC X(01) VALUE "P" .            027000      
000705     10 WKS-DIS-PASO             PIC 9(03) VALUE 199.             027200      
000706     10 FILLER                   PIC X(03) VALUE SPACES.          027400      
000707     10 WKS-DIS-MENSAJE          PIC X(140) .                     027600      
000708 01 WKS-DIS-TEXTO                PIC X(140) .                     027800      
000709                                                                  028000      
000710******************************************************************028200      
000711*                   VARIABLES REPORTE TOTALES                    *028400      
000712******************************************************************028600      
000713 01 WKS-R-TOTALES.                                                028800      
000714    10 WKS-R-TOT-H1.                                              029000      
000715       12  FILLER                 PIC X(17) VALUE                 029200      
000716          "FECHA DE CORRIDA:".                                    029400      
000717       12 WKS-R-FEC-CENTUR        PIC 9(02).                      029600      
000718       12 WKS-R-FEC-AMO           PIC 9(02).                      029800      
000719       12 FILLER                  PIC X(01) VALUE "/".            030000      
000720       12 WKS-R-FEC-MES           PIC 9(02)       .               030200      
000721       12 FILLER                  PIC X(01) VALUE "/".            030400      
000722       12 WKS-R-FEC-DIA           PIC 9(02)       .               030600      
000723       12 FILLER                  PIC X(10) VALUE SPACES.         030800      
000724       12  FILLER                 PIC X(50) VALUE                 031000      
000725          "           BANCO NACIONAL DE MEXICO, S.A.         ".   031200      
000726       12  FILLER                 PIC X(41) VALUE                 031400      
000727          "                       PAGINA:   ".                    031600      
000728       12 WKS-CONT-PAG-E          PIC ZZZZ.                       031800      
000729    10 WKS-R-TOT-H2.                                              032000      
000730       12  FILLER                 PIC X(05) VALUE "HORA:".        032200      
000731       12 WKS-R-HORA-HH           PIC 9(02).                      032400      
000732       12 FILLER                  PIC X(01) VALUE ":".            032600      
000733       12 WKS-R-HORA-MM           PIC 9(02)       .               032800      
000734       12 FILLER                  PIC X(01) VALUE ":".            033000      
000735       12 WKS-R-HORA-SS           PIC 9(02).                      033200      
000736       12 FILLER                  PIC X(32) VALUE SPACES.         033400      
000737       12 FILLER                  PIC X(87) VALUE                 033600      
000738          "ADMINISTRADOR DE MOVIMIENTOS CONTABLES".               033800      
000739    10 WKS-R-TOT-H3.                                              034000      
000740       12 FILLER                  PIC X(10) VALUE                 034200      
000741          "S151/P199/".                                           034400      
000742       12 WKS-R-FEC-C03           PIC 9(02) VALUE 20.             034600      
000743       12 WKS-R-FEC-03            PIC 9(06).                      034800      
000744       12 FILLER                  PIC X(38) VALUE                 035000      
000745          "/TOTALES                           TOT".               035200      
000746       12 FILLER                  PIC X(32) VALUE                 035400      
000747          "ALES POR BIN MIGRADO            ".                     035600      
000748       12 FILLER                  PIC X(26) VALUE                 035800      
000749          "        FECHA DE PROCESO: " .                          036000      
000750       12 WKS-R-FECP-C031         PIC 9(02) VALUE 20.             036200      
000751       12 WKS-R-FECP-AMO3         PIC 9(02).                      036400      
000752       12 FILLER                  PIC X(01) VALUE "/".            036600      
000753       12 WKS-R-FECP-MES3         PIC 9(02).                      036800      
000754       12 FILLER                  PIC X(01) VALUE "/" .           037000      
000755       12 WKS-R-FECP-DIA3         PIC 9(02).                      037200      
000756    10 WKS-R-D1.                                                  037400      
000757       12 FILLER                  PIC X(28) VALUE                 037600      
000758       "              BIN MIGRADO : ".                            037800      
000759       12 WKS-R-BIN               PIC 9(06).                      038000      
000760       12 FILLER                  PIC X(98) VALUE SPACES.         038200      
000761    10 WKS-R-D2.                                                  038400      
000762       12 FILLER                 PIC X(08) VALUE                  038600      
000763          " BIN:   ".                                             038800      
000764       12 FILLER                 PIC X(14) VALUE                  039000      
000765          "NUM TARJETAS  ".                                       039200      
000766       12 FILLER                 PIC X(21) VALUE                  039400      
000767          "   I M P O R T E     ".                                039600      
000768       12 FILLER                 PIC X(07) VALUE                  039800      
000769          "SALDO  ".                                              040000      
000770       12 FILLER                 PIC X(82) VALUE SPACES.          040200      
000771    10 WKS-R-D3.                                                  040400      
000772       12 WKS-RD-BIN             PIC X(06).                       040600      
000773       12 FILLER                 PIC X(04) VALUE SPACES.          040800      
000774       12 WKS-RD-NUMTAR          PIC Z(07)9.                      041000      
000775       12 FILLER                 PIC X(04) VALUE SPACES.          041200      
000776       12 WKS-RD-IMPORTE         PIC Z(15)9.99.                   041400      
000777       12 FILLER                 PIC X(02) VALUE SPACES.          041600      
000778       12 WKS-RD-SALDO           PIC X(25).                       041800      
000779       12 FILLER                 PIC X(64) VALUE SPACES.          042000      
000780    10 WKS-R-T.                                                   042200      
000781       12 FILLER                 PIC X(28) VALUE                  042400      
000782          "TOTAL DE TARJETAS PARA BIN: ".                         042600      
000783       12 WKS-RT-NUMTAR          PIC Z(08)9.                      042800      
000784       12 FILLER                 PIC X(12) VALUE                  043000      
000785          "   IMPORTE: ".                                         043200      
000786       12 WKS-RT-IMPORTE         PIC Z(16)9.99.                   043400      
000787       12 FILLER                 PIC X(63) VALUE SPACES.          043600      
000788    10 WKS-R-ESPACIOS .                                           043800      
000789       12 FILLER                 PIC X(132) VALUE SPACES.         044000      
000790    10 WKS-R-VACIO.                                               044020      
000791       12 FILLER                 PIC X(56) VALUE SPACES.          044040      
000792       12 FILLER                 PIC X(20)                        044060      
000793                                 VALUE "NO HUBO INFORMACION ".    044080      
000794       12 FILLER                 PIC X(56) VALUE SPACES.          044100      
000795 01 WKS-CTR-LIN                  PIC 9(02) VALUE 0.               044200      
000796 01 WKS-CONT-PAG                 PIC 9(04).                       044300      
000797                                                                  044400      
000798******************************************************************044600      
000799*               VARIABLES PARA CARGA DE CATALOGOS                *044800      
000800******************************************************************045000      
000801 77  W77-L710-SISTEMA            PIC S9(11) BINARY.               045200      
000802 77  W77-L710-PROGRAMA           PIC S9(11) BINARY.               045400      
000803 01  WKS-L710-ENT.                                                045600      
000804      03 WKS-EL710-CAT           PIC 9(06) COMP.                  045800      
000805      03 WKS-EL710-CLAVE         PIC 9(02) COMP.                  046000      
000806      03 WKS-EL710-BUSQUEDA      PIC 9(02) COMP.                  046200      
000807      03 WKS-EL710-REGISTROS     PIC 9(02) COMP.                  046400      
000808      03 WKS-EL710-LLAVE1        PIC 9(12).                       046600      
000809      03 WKS-EL710-LLAVE2        PIC 9(12).                       046800      
000810      03 WKS-EL710-LLAVE3        PIC 9(12).                       047000      
000811      03 WKS-EL710-LLAVE4        PIC 9(12).                       047200      
000812      03 WKS-EL710-LLAVE5        PIC 9(12).                       047400      
000813      03 WKS-EL710-LLAVE6        PIC 9(12).                       047600      
000814      03 WKS-EL710-FEC-VIG       PIC 9(06) COMP.                  047800      
000815      03 WKS-EL710-FECINI        PIC 9(06) COMP.                  048000      
000816      03 WKS-EL710-NIVINI        PIC 9(02) COMP.                  048200      
000817      03 FILLER                  PIC X(11).                       048400      
000818                                                                  048600      
000819 01  WKS-L710-SAL.                                                048800      
000820      03 WKS-SL710-NUMREG        PIC 9(02) COMP.                  049000      
000821      03 WKS-SL710-CAT           PIC 9(06) COMP.                  049200      
000822      03 WKS-SL710-FECINI        PIC 9(06) COMP.                  049400      
000823      03 WKS-SL710-NIVINI        PIC 9(02) COMP.                  049600      
000824      03 FILLER                  PIC X(22).                       049800      
000825      03 WKS-SL710-REG           OCCURS 10 TIMES.                 050000      
000826         05 WKS-SL710-DAT        PIC 9(12) OCCURS 28 TIMES.       050200      
000827         05 WKS-SL710-FECALTA    PIC 9(06) COMP.                  050400      
000828         05 WKS-SL710-FECBAJA    PIC 9(06) COMP.                  050600      
000829         05 WKS-SL710-FECMOD     PIC 9(06) COMP.                  050800      
000830         05 WKS-SL710-FECVIG     PIC 9(06) COMP.                  051000      
000831         05 FILLER               PIC X(42).                       051200      
000832 77 W77-DIAS-SIN-MOV             PIC 9(04) COMP.                  051400      
000833 77 W77-L710-RESULT              PIC S9(11) BINARY.               051600      
000834 77 W77-ERR-CAT                  PIC 9(02).                       051800      
000835 77 W77-CAT-FORMATO              PIC 9(02).                       052000      
000836 77 W77-CAT-NUMCAT               PIC 9(04).                       052200      
000837 77 W77-NUMCAT                   PIC 9(04).                       052400      
000838 77 W77-EOF                      PIC 9(02).                       052600      
000839                                                                  052800      
000840*************************************************************     053000      
000841*                CVE TRANSACCION                            *     053200      
000842*************************************************************     053400      
000843 01 CVETRAN-PC.                                                   053600      
000844    05 WKS-CVETRAN-PC   OCCURS 10000 TIMES.                       053800      
000845       10 WKS-CAT6-CVETRAN       PIC 9(06) COMP.                  054000      
000846       10 WKS-CAT6-NATC          PIC 9(01) COMP.                  054200      
000847       10 WKS-CAT6-SUMPAN        PIC 9(01) COMP.                  054400      
000848 01 WKS-NUM-CVETRANS             PIC 9(06).                       054600      
000849                                                                  054800      
000850*************************************************************     055000      
000851*                CAT MIGRACION                              *     055200      
000852*************************************************************     055400      
000853 01 FECHA-MIG.                                                    055600      
000854    05 WKS-FECHAS-MIG   OCCURS 10000 TIMES.                       055800      
000855       10 WKS-CAT1565-PRODUCT    PIC 9(06).                       056000      
000856*       10 WKS-CAT1565-FECMIG     PIC 9(08).                      056200      
000857 77 WKS-BIN                      PIC 9(06).                       056400      
000858                                                                  056600      
000859******************************************************************056800      
000860*                          VARIABLES HI                          *057000      
000861******************************************************************057200      
000862 77 W77-HI                       PIC 9(02) VALUE 0.               057400      
000863    88 W88-HI-4                  VALUE 4.                         057600      
000864    88 W88-HI-6                  VALUE 6.                         057800      
000865                                                                  058000      
000866******************************************************************058200      
000867*                     VARIABLES FECHA Y HORA                     *058400      
000868******************************************************************058600      
000869 01 WKS-FEC-MAQ-CAMD             PIC 9(08).                       058800      
000870 01 WKS-FEC-MAQ-CAMD-R           REDEFINES WKS-FEC-MAQ-CAMD.      059000      
000871    05 WKS-FEC-MAQ-CC            PIC 9(02).                       059200      
000872    05 WKS-FEC-MAQ-AMD           PIC 9(06).                       059400      
000873    05 WKS-FEC-MAQ-AMD-R         REDEFINES WKS-FEC-MAQ-AMD.       059600      
000874       10 WKS-FEC-MAQ-A          PIC 9(02).                       059800      
000875       10 WKS-FEC-MAQ-M          PIC 9(02).                       060000      
000876       10 WKS-FEC-MAQ-D          PIC 9(02).                       060200      
000877                                                                  060400      
000878 01 WKS-FEC-MIG-S500-CAMD        PIC 9(08).                       060600      
000879 01 WKS-FECHA-MIGRACION          REDEFINES WKS-FEC-MIG-S500-CAMD. 060800      
000880    03 WKS-FEC-MIG-CC            PIC 9(02).                       061000      
000881    03 WKS-FEC-MIG-AMD           PIC 9(06).                       061200      
000882    03 WKS-FEC-MIG-AMD-R         REDEFINES WKS-FEC-MIG-AMD.       061400      
000883       05 WKS-FEC-MIG-A          PIC 9(02).                       061600      
000884       05 WKS-FEC-MIG-M          PIC 9(02).                       061800      
000885       05 WKS-FEC-MIG-D          PIC 9(02).                       062000      
000886                                                                  062200      
000887 01 WKS-HOR-MAQ-HMSD             PIC 9(08).                       062400      
000888 01 WKS-HOR-MAQ-R                REDEFINES WKS-HOR-MAQ-HMSD.      062600      
000889    05 WKS-HOR-MAQ-HMS           PIC 9(06).                       062800      
000890    05 WKS-HOR-MAQ-HMS-R         REDEFINES WKS-HOR-MAQ-HMS.       063000      
000891       10 WKS-HOR-MAQ-HM         PIC 9(04).                       063200      
000892       10 WKS-HOR-MAQ-HM-R       REDEFINES WKS-HOR-MAQ-HM.        063400      
000893          15 WKS-HOR-MAQ-H       PIC 9(02).                       063600      
000894          15 WKS-HOR-MAQ-M       PIC 9(02).                       063800      
000895       10 WKS-HOR-MAQ-S          PIC 9(02).                       064000      
000896    05 WKS-HOR-MAQ-D             PIC 9(02).                       064200      
000897                                                                  064400      
000898  01 WKS-DATO                     PIC 9(06).                      064600      
000899  01 WKS-DATOR REDEFINES WKS-DATO.                                064800      
000900     10 WKS-DATO-AMO              PIC 9(02).                      065000      
000901     10 WKS-DATO-MES              PIC 9(02).                      065200      
000902     10 WKS-DATO-DIA              PIC 9(02).                      065400      
000903******************************************************************065600      
000904*                VAFRIABLES CONTROL DE VERSIONES                 *065800      
000905******************************************************************066000      
000906 01 WKS-CTLVER-LIBID             PIC X(12).                       066200      
000907 01 WKS-CTLVER-NOMLIB            PIC X(72).                       066400      
000908 01 W77-CTLVER-RESULT            PIC S9(11) BINARY.               066600      
000909                                                                  066800      
000910******************************************************************067000      
000911*                  VARIABLES MANEJO DE ERRORES                   *067200      
000912******************************************************************067400      
000913 01 WKS-DMCATEGORY               PIC 9(04).                       067600      
000914 01 WKS-DMERRORTYPE              PIC 9(04).                       067800      
000915 01 WKS-DMSTRUCTURE              PIC 9(04).                       068000      
000916 01 WKS-DMS-DSCERR               PIC X(140).                      068200      
000917                                                                  068400      
000918******************************************************************068600      
000919*   DESCRIPCION DE FORMATOS DE LLAMADO A LIBRERIA DE CONTROL     *068800      
000920******************************************************************069000      
000921*                                                                 069200      
000922*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000923* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         069400      
000924*================================================================ 000100      
000925*         ENTRY-POINT CONSISDIA :                               = 000200      
000926*                                                                 000300      
000927* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000928* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000929* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000930* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000931* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000932* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000933* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000934* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000935* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000936* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000937*                                                               = 001400      
000938*================================================================ 001500      
000939                                                                  001600      
000940                                                                  001700      
000941*================================================================ 001800      
000942* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000943*                                                               = 002000      
000944* ENTRADA REQUERIDA :                                           = 002100      
000945*                                                               = 002200      
000946*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000947*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000948*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000949*================================================================ 002600      
000950 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000951    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000952    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000953    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000954    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000955    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000956    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000957    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000958    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000959    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000960    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000961    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000962    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000963    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000964    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000965    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000966    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000967    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000968    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000969    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000970    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000971       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000972       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000973       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000974       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000975*==============================================================   005200      
000976*                                                             =   005300      
000977* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000978*                                                             =   005500      
000979* CAMPOS REQUERIDOS :                                         =   005600      
000980*                                                             =   005700      
000981* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000982* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000983* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000984* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000985*==============================================================   006200      
000986 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000987    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000988    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000989    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000990    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000991                                                                  006800      
000992*==============================================================   006900      
000993*                                                             =   007000      
000994* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000995*                                                             =   007200      
000996* CAMPOS REQUERIDOS :                                         =   007300      
000997*                                                             =   007400      
000998* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000999* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
001000* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
001001* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
001002*==============================================================   007900      
001003 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
001004    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
001005    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
001006    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
001007    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
001008                                                                  008500      
001009*==============================================================   008600      
001010*                                                             =   008700      
001011* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
001012*                                                             =   008900      
001013* CAMPOS REQUERIDOS :                                         =   009000      
001014*                                                             =   009100      
001015* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
001016* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
001017* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
001018* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
001019*==============================================================   009600      
001020 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
001021    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
001022    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
001023    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
001024    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
001025                                                                  010200      
001026*============================================================     010300      
001027* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
001028*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
001029*                                                           =     010600      
001030*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
001031*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
001032*                                                           =     010900      
001033*  ENTRADA REQUERIDA.                                       =     011000      
001034*                                                           =     011100      
001035*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
001036*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
001037*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
001038*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
001039*============================================================     011600      
001040                                                                  011700      
001041 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
001042     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
001043     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
001044     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
001045     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
001046                                                                  012300      
001047*=============================================================    012400      
001048*                                                            =    012500      
001049* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
001050*             B01-SIS-FECARMOV.                              =    012700      
001051*                                                            =    012800      
001052* ENTRADA REQUERIDAD :                                       =    012900      
001053*                                                            =    013000      
001054*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
001055*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
001056*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
001057*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
001058*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
001059*=============================================================    013600      
001060                                                                  013700      
001061 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
001062     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
001063     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
001064     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
001065     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
001066     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
001067*================================================================ 014400      
001068*                                                               = 014500      
001069* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
001070*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
001071*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
001072*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
001073*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
001074*                                                               = 015100      
001075* ENTRADA REQUERIDA :                                           = 015200      
001076*                                                               = 015300      
001077* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
001078* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
001079* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
001080* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
001081* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
001082*================================================================ 015900      
001083 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
001084    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
001085    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
001086    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
001087    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
001088    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
001089                                                                  016600      
001090*============================================================     016700      
001091*                                                           =     016800      
001092* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
001093*                                                           =     017000      
001094* DATOS REQUERIDOS :                                        =     017100      
001095*                                                           =     017200      
001096* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
001097* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
001098* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
001099* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
001100* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
001101*============================================================     017800      
001102                                                                  017900      
001103 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
001104     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
001105     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
001106     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
001107     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
001108     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
001109                                                                  018600      
001110*============================================================     018700      
001111*                                                           =     018800      
001112* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
001113*                                                           =     019000      
001114* DATOS REQUERIDOS :                                        =     019100      
001115*                                                           =     019200      
001116* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
001117* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
001118* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
001119* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
001120* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
001121*============================================================     019800      
001122                                                                  019900      
001123 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
001124     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
001125     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
001126     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
001127     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
001128     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
001129                                                                  020600      
001130*===============================================================  020700      
001131*                                                              =  020800      
001132* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
001133*              MOVIMIENTOS.                                    =  021000      
001134* DATOS REQUERIDOS :                                           =  021100      
001135*                                                              =  021200      
001136* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
001137* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
001138* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
001139* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
001140* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
001141* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
001142*==============================================================   021900      
001143                                                                  022000      
001144 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
001145     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
001146     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
001147     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
001148     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
001149     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
001150     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
001151*==============================================================   022800      
001152*                                                             =   022900      
001153* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
001154*                                                             =   023100      
001155* CAMPOS REQUERIDOS :                                         =   023200      
001156*                                                             =   023300      
001157* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
001158* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
001159* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
001160* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
001161*==============================================================   023800      
001162 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
001163    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
001164    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
001165    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
001166    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
001167                                                                  024304      
001168*=================================================================024306      
001169*                ENTRY POINT CONSISB01                           =024308      
001170*                                                                =024310      
001171*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
001172*                                                                =024314      
001173*  FUNCIONES DISPONIBLES :                                       =024316      
001174*                                                                =024318      
001175*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
001176*                                                                =024322      
001177*  PARAMETROS REQUERIDOS                                         =024324      
001178*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
001179*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
001180*=================================================================024330      
001181                                                                  024332      
001182 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
001183     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
001184     03 WKS-CON-CSI                PIC 9(02).                     024336      
001185     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
001186     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
001187        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
001188        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
001189        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
001190        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
001191        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
001192                                                                  024400      
001193*=================================================================024500      
001194*                ENTRY POINT B02ARCINTER                         =024600      
001195*                                                                =024700      
001196*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
001197*                                                                =024900      
001198*  FUNCIONES DISPONIBLES :                                       =025000      
001199*                                                                =025100      
001200*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
001201* 19.- ALTAS DE ARCHIVOS.                                        =025300      
001202* 22.- BAJAS DE ARCHIVOS.                                        =025400      
001203* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
001204*                                                                =025600      
001205*  PARAMETROS REQUERIDOS                                         =025700      
001206*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
001207*                                                                =025900      
001208*=================================================================026000      
001209 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
001210     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
001211     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
001212     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
001213     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
001214     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
001215     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
001216     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
001217     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
001218     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
001219     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
001220     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
001221     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
001222     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
001223     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
001224     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
001225     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
001226     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
001227     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
001228     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
001229     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
001230     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
001231     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
001232     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
001233     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
001234     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
001235     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
001236     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
001237     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
001238                                                                  029000      
001239*=================================================================029100      
001240*                ENTRY POINT B04SISTEMA                          =029200      
001241*                                                                =029300      
001242*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
001243*                                                                =029500      
001244*  FUNCIONES DISPONIBLES :                                       =029600      
001245*                                                                =029700      
001246*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
001247*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
001248*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
001249*                                                                =030100      
001250*  PARAMETROS REQUERIDOS                                         =030200      
001251*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
001252*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
001253*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
001254*                                                                =030600      
001255*=================================================================030700      
001256 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
001257     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
001258     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
001259     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
001260     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
001261     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
001262     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
001263     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
001264                                                                  031600      
001265*================================================================ 031700      
001266*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
001267*                                                               = 031900      
001268*  FUNCION                                                      = 032000      
001269*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
001270*   19       ALTAS.                                             = 032200      
001271*   22       BAJAS                                              = 032300      
001272*   37       CAMBIOS.                                           = 032400      
001273*                                                               = 032500      
001274*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
001275*                      FECHA DE PROCESO                         = 032700      
001276*                      NUMERO DE PROCESO                        = 032800      
001277*                      FECHA INICIO                             = 032900      
001278*                      REGISTRO INICIAL                         = 033000      
001279*================================================================ 033100      
001280                                                                  033200      
001281 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
001282     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
001283     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
001284     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
001285     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
001286     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
001287     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
001288     03 WKS-B05-MIX                PIC 9(08).                     034000      
001289     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
001290     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
001291     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
001292     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
001293     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
001294     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
001295                                                                  034700      
001296                                                                  034800      
001297*================================================================ 034900      
001298*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
001299*                                                               = 035100      
001300*  FUNCION                                                      = 035200      
001301*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
001302*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
001303*                                                               = 035500      
001304*================================================================ 035600      
001305                                                                  035700      
001306 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
001307     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
001308     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
001309     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
001310     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
001311     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
001312     03 WKS-B09-NOMREN             PIC X(15).                     036400      
001313                                                                  036500      
001314*===============================================================  036600      
001315*                                                              =  036700      
001316*         ENTRY-POINT CONSISMEN                                =  036800      
001317*                                                              =  036900      
001318*   DATOS REQUERIDOS : FUNCION                                 =  037000      
001319*                      SISTEMA                                 =  037100      
001320*                                                              =  037200      
001321*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
001322*                                                              =  037400      
001323*===============================================================  037500      
001324 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
001325     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
001326     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
001327     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
001328     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
001329     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
001330     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
001331     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
001332     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
001333     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
001334     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
001335     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
001336     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
001337     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
001338     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
001339     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
001340        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
001341        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
001342        05 WKS-B03-AAMM            PIC 9(06).                     039402      
001343        05 WKS-B03-SECOK           PIC 9(10).                     039500      
001344        05 WKS-B03-SECINF          PIC 9(10).                     039600      
001345        05 WKS-B03-SECERR          PIC 9(10).                     039700      
001346        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
001347                                                                  039900      
001348*=====================================================            040000      
001349*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
001350*=====================================================            040200      
001351 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
001352     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
001353     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
001354     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
001355                                                                  040700      
001356*=====================================================            040800      
001357*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
001358*=====================================================            041000      
001359 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
001360     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
001361     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
001362     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
001363                                                                  041500      
001364*=====================================================            041600      
001365*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
001366*=====================================================            041800      
001367 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
001368     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
001369     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
001370     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
001371*=====================================================            042300      
001372*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
001373*=====================================================            042500      
001374 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
001375     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
001376     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
001377     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
001378                                                                  043000      
001379*=====================================================            043100      
001380*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
001381*=====================================================            043300      
001382 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
001383     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
001384     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
001385     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
001386                                                                  043800      
001387*=====================================================            043900      
001388*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
001389*=====================================================            044100      
001390 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
001391     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
001392     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
001393     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
001394                                                                  044600      
001395*=====================================================            044700      
001396*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
001397*=====================================================            044900      
001398 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
001399     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
001400     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
001401     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
001402                                                                  045400      
001403*=====================================================            045500      
001404*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
001405*=====================================================            045700      
001406 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
001407     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
001408     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
001409     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
001410                                                                  046200      
001411*=====================================================            046300      
001412*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
001413*=====================================================            046500      
001414 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
001415     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
001416     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
001417     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
001418                                                                  047000      
001419*=====================================================            047100      
001420*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
001421*=====================================================            047300      
001422 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
001423     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
001424     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
001425     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001426                                                                  047800      
001427*=====================================================            047900      
001428*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001429*=====================================================            048100      
001430 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001431     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001432     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001433     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001434                                                                  048600      
001435*=====================================================            048700      
001436*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001437*=====================================================            048900      
001438 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001439     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001440     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001441     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001442                                                                  049400      
001443*=====================================================            049500      
001444*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001445*=====================================================            049700      
001446 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001447     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001448     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001449     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001450     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001451     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001452     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001453     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001454     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001455     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001456     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001457                                                                  050900      
001458*=====================================================            051000      
001459*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001460*=====================================================            051200      
001461 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001462     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001463     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001464     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001465     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001466                                                                  051800      
001467*=====================================================            051900      
001468*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001469*=====================================================            052100      
001470 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001471     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001472     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001473     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001474     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001475                                                                  052700      
001476*=====================================================            052800      
001477*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001478*=====================================================            053000      
001479 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001480     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001481     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001482     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001483     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001484                                                                  053600      
001485*=====================================================            053700      
001486*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001487*=====================================================            053900      
001488 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001489     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001490     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001491     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001492     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001493                                                                  054500      
001494*=====================================================            054600      
001495*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001496*=====================================================            054800      
001497 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001498     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001499     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001500     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001501     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001502                                                                  055400      
001503*=====================================================            055500      
001504*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001505*=====================================================            055700      
001506 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001507     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001508     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001509     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001510     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001511                                                                  056300      
001512*=====================================================            056400      
001513*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001514*=====================================================            056600      
001515 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001516     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001517     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001518     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001519     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001520                                                                  057200      
001521 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001522*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001523******************************************************************069600      
001524*                VARIABLES MENSAJES A OPERADOR LJ                *069800      
001525******************************************************************070000      
001526*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001527* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           070200      
001528**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
001529  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
001530  01 MENSAJE-LJ.                                                  100300      
001531     02 SISTEMA-LJ     PIC X(04).                                 100400      
001532     02 FILLER         PIC X VALUE "/".                           100500      
001533     02 PASO-LJ        PIC X(04).                                 100600      
001534     02 FILLER         PIC X VALUE "/".                           100700      
001535     02 MTP-LJ         PIC 9(03).                                 100800      
001536     02 FILLER         PIC X VALUE ":".                           100900      
001537     02 TIPO-LJ        PIC X.                                     101000      
001538     02 FILLER         PIC X VALUE ">".                           101100      
001539     02 CODIGO-LJ      PIC 9(06).                                 101200      
001540     02 FILLER         PIC X VALUE "<".                           101300      
001541     02 TEXTO-LJ       PIC X(250).                                101400      
001542*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001543                                                                  070400      
001544******************************************************************070600      
001545*                       VARIABLES CONTROL                        *070800      
001546******************************************************************071000      
001547 77 W77-AUT-MIGS500              PIC 9(08).                       071200      
001548 77 W77-FIN                      PIC 9(04).                       071400      
001549 77 W77-FIN-ARCHMOVS             PIC 9(04).                       071600      
001550 77 W77-NUMREG-MOV500            PIC 9(08).                       071800      
001551 77 W77-NUMREG-ACC               PIC 9(08).                       072000      
001552 77 W77-NUMREG-ACM               PIC 9(08).                       072200      
001553 77 W77-BAND-STATUS-B08          PIC 9(01).                       072400      
001554    88 W88-ALTA-B08              VALUE 0.                         072600      
001555    88 W88-ACTUALIZA-B08         VALUE 1.                         072800      
001556 77 WKS-IMPORTE-B08              PIC 9(16)V99.                    072805      
001557 77 W77-BAND-EXISTENCIA-B08      PIC 9(01).                       073000      
001558    88 W88-NO-EXISTE-B08         VALUE 1.                         073200      
001559    88 W88-EXISTE-B08            VALUE 0.                         073400      
001560 01 WKS-FIN-B08                  PIC 9(04).                       073600      
001561 01 WKS-FIN-B08A                 PIC 9(04).                       073800      
001562 01 CONT-REG-DISPLAY             PIC 9(06).                       074000      
001563 01 WKS-NUM-MIGS                 PIC 9(06).                       074200      
001564 01 WKS-NUM-OCCURS               PIC 9(02).                       074400      
001565 01 WKS-IND-MIGRACION            PIC 9(01).                       074600      
001566    88 W88-NO-MIGRACION          VALUE 0.                         074800      
001567    88 W88-MIGRACION             VALUE 1.                         075000      
001568 01 W77-INTENTO                  PIC 9(02).                       075200      
001569 01 W77-DUP-B08                  PIC 9(02).                       075300      
001570******************************************************************075400      
001571*                       VARIABLES ELIM FUNCION 21                *075600      
001572******************************************************************075800      
001573  77 W77-CANC-PROC               PIC 9(02).                       076000      
001574  77 W77-CANC-FUNCION            PIC 9(02).                       076200      
001575  77 W77-CANC-AUT-AELIM-S151     PIC 9(08).                       076400      
001576  77 W77-CAN-AUT-S151            PIC 9(08).                       076600      
001577******************************************************************076800      
001578*                            TOTALES                             *077000      
001579******************************************************************077200      
001580  01 WKS-TOT-BINES.                                               077400      
001581     03 WKS-TOTALES OCCURS 10 TIMES.                              077600      
001582        05 WKS-TOT1.                                              077800      
001583           10 WKS-ID-OCC            PIC 9(02).                    078000      
001584           10 WKS-BIN1              PIC 9(06).                    078200      
001585           10 WKS-NUM-01            PIC 9(08).                    078400      
001586           10 WKS-IMP-01            PIC 9(16)V99.                 078600      
001587           10 WKS-NUM-A1            PIC 9(08).                    078800      
001588           10 WKS-IMP-A1            PIC 9(16)V99.                 079000      
001589           10 WKS-NUM-S1            PIC 9(08).                    079200      
001590           10 WKS-IMP-S1            PIC 9(16)V99.                 079400      
001591           10 WKS-NUM-TOT           PIC 9(09).                    079600      
001592           10 WKS-IMP-TOT           PIC 9(17)V99.                 079800      
001593*     05 WKS-TOT2.                                                080000      
001594*        10 WKS-BIN2              PIC 9(06).                      080200      
001595*        10 WKS-NUM-02            PIC 9(08).                      080400      
001596*        10 WKS-IMP-02            PIC 9(16)V99.                   080600      
001597*        10 WKS-NUM-A2            PIC 9(08).                      080800      
001598*        10 WKS-IMP-A2            PIC 9(16)V99.                   081000      
001599*        10 WKS-NUM-S2            PIC 9(08).                      081200      
001600*        10 WKS-IMP-S2            PIC 9(16)V99.                   081400      
001601*     05 WKS-TOT3.                                                081600      
001602*        10 WKS-BIN3              PIC 9(06).                      081800      
001603*        10 WKS-NUM-03            PIC 9(08).                      082000      
001604*        10 WKS-IMP-03            PIC 9(16)V99.                   082200      
001605*        10 WKS-NUM-A3            PIC 9(08).                      082400      
001606*        10 WKS-IMP-A3            PIC 9(16)V99.                   082600      
001607*        10 WKS-NUM-S3            PIC 9(08).                      082800      
001608*        10 WKS-IMP-S3            PIC 9(16)V99.                   083000      
001609*     05 WKS-TOT4.                                                083200      
001610*        10 WKS-BIN4              PIC 9(06).                      083400      
001611*        10 WKS-NUM-04            PIC 9(08).                      083600      
001612*        10 WKS-IMP-04            PIC 9(16)V99.                   083800      
001613*        10 WKS-NUM-A4            PIC 9(08).                      084000      
001614*        10 WKS-IMP-A4            PIC 9(16)V99.                   084200      
001615*        10 WKS-NUM-S4            PIC 9(08).                      084400      
001616*        10 WKS-IMP-S4            PIC 9(16)V99.                   084600      
001617*     05 WKS-TOT5.                                                084800      
001618*        10 WKS-BIN5              PIC 9(06).                      085000      
001619*        10 WKS-NUM-05            PIC 9(08).                      085200      
001620*        10 WKS-IMP-05            PIC 9(16)V99.                   085400      
001621*        10 WKS-NUM-A5            PIC 9(08).                      085600      
001622*        10 WKS-IMP-A5            PIC 9(16)V99.                   085800      
001623*        10 WKS-NUM-S5            PIC 9(08).                      086000      
001624*        10 WKS-IMP-S5            PIC 9(16)V99.                   086200      
001625*     05 WKS-TOT6.                                                086400      
001626*        10 WKS-BIN6              PIC 9(06).                      086600      
001627*        10 WKS-NUM-06            PIC 9(08).                      086800      
001628*        10 WKS-IMP-06            PIC 9(16)V99.                   087000      
001629*        10 WKS-NUM-A6            PIC 9(08).                      087200      
001630*        10 WKS-IMP-A6            PIC 9(16)V99.                   087400      
001631*        10 WKS-NUM-S6            PIC 9(08).                      087600      
001632*        10 WKS-IMP-S6            PIC 9(16)V99.                   087800      
001633*     05 WKS-TOT7.                                                088000      
001634*        10 WKS-BIN7              PIC 9(06).                      088200      
001635*        10 WKS-NUM-07            PIC 9(08).                      088400      
001636*        10 WKS-IMP-07            PIC 9(16)V99.                   088600      
001637*        10 WKS-NUM-A7            PIC 9(08).                      088800      
001638*        10 WKS-IMP-A7            PIC 9(16)V99.                   089000      
001639*        10 WKS-NUM-S7            PIC 9(08).                      089200      
001640*        10 WKS-IMP-S7            PIC 9(16)V99.                   089400      
001641*     05 WKS-TOT8.                                                089600      
001642*        10 WKS-BIN8              PIC 9(06).                      089800      
001643*        10 WKS-NUM-08            PIC 9(08).                      090000      
001644*        10 WKS-IMP-08            PIC 9(16)V99.                   090200      
001645*        10 WKS-NUM-A8            PIC 9(08).                      090400      
001646*        10 WKS-IMP-A8            PIC 9(16)V99.                   090600      
001647*        10 WKS-NUM-S8            PIC 9(08).                      090800      
001648*        10 WKS-IMP-S8            PIC 9(16)V99.                   091000      
001649*     05 WKS-TOT9.                                                091200      
001650*        10 WKS-BIN9              PIC 9(06).                      091400      
001651*        10 WKS-NUM-09            PIC 9(08).                      091600      
001652*        10 WKS-IMP-09            PIC 9(16)V99.                   091800      
001653*        10 WKS-NUM-A9            PIC 9(08).                      092000      
001654*        10 WKS-IMP-A9            PIC 9(16)V99.                   092200      
001655*        10 WKS-NUM-S9            PIC 9(08).                      092400      
001656*        10 WKS-IMP-S9            PIC 9(16)V99.                   092600      
001657*     05 WKS-TOT10.                                               092800      
001658*        10 WKS-BIN10             PIC 9(06).                      093000      
001659*        10 WKS-NUM-010           PIC 9(08).                      093200      
001660*        10 WKS-IMP-010           PIC 9(16)V99.                   093400      
001661*        10 WKS-NUM-A10           PIC 9(08).                      093600      
001662*        10 WKS-IMP-A10           PIC 9(16)V99.                   093800      
001663*        10 WKS-NUM-S10           PIC 9(08).                      094000      
001664*        10 WKS-IMP-S10           PIC 9(16)V99.                   094200      
001665                                                                  094400      
001666                                                                  094600      
001667  01 WKS-TOT-BINES-RED  REDEFINES WKS-TOT-BINES.                  094800      
001668     05 WKS-CVES-BIN OCCURS 10 TIMES INDEXED BY WS-COUNT.         095000      
001669        10 WKS-ID                PIC 9(02).                       095200      
001670        10 WKS-BIN-TABLA         PIC 9(06).                       095400      
001671        10 FILLER                PIC 9(08).                       095600      
001672        10 FILLER                PIC 9(16)V99.                    095800      
001673        10 FILLER                PIC 9(08).                       096000      
001674        10 FILLER                PIC 9(16)V99.                    096200      
001675        10 FILLER                PIC 9(08).                       096400      
001676        10 FILLER                PIC 9(16)V99.                    096600      
001677        10 FILLER                PIC 9(09).                       096650      
001678        10 FILLER                PIC 9(17)V99.                    096700      
001679  01 WKS-BIN-BUSQ                PIC 9(06).                       096800      
001680  77 W77-CONT                    PIC 9(02).                       097000      
001681                                                                  097200      
001682******************************************************************097400      
001683*                                                                *097600      
001684******************************************************************097800      
001685 77 W77-ERROR                    PIC 9(02).                       098000      
001686 01 W77-RESULT-B01               PIC 9(08).                       098200      
001687 01 WKS-FECPRO-S500              PIC 9(08).                       098400      
001688 01 WKS-FECHA-PROCESO      REDEFINES WKS-FECPRO-S500.             098600      
001689    03 WKS-FECPRO-CC             PIC 9(02).                       098800      
001690    03 WKS-FECPRO-6D             PIC 9(06).                       099000      
001691    03 WKS-FECPRO-6D-R     REDEFINES WKS-FECPRO-6D.               099200      
001692       05 WKS-FECPRO-AA          PIC 9(02).                       099400      
001693       05 WKS-FECPRO-MM          PIC 9(02).                       099600      
001694       05 WKS-FECPRO-DD          PIC 9(02).                       099800      
001695 01 WKS-DATOS-HOST.                                               099850      
001696    03 WKS-NUMCSI-HOST           PIC 9(02).                       099900      
001697    03 WKS-NOMEQUIPO             PIC X(10).                       100000      
001698    03 WKS-NOMCSI                PIC X(26).                       100020      
001699    03 WKS-LINEABATCH            PIC X(05).                       100040      
001700 77 WKS-VALUE                    PIC 9(08) VALUE 0.               100100      
001701 01 WKS-NUM-OCURR                PIC 9(02).                       100200      
001702 01 WKS-MIGRACION.                                                100400      
001703    03 WKS-CAT-SUC               PIC 9(04) VALUE 342.             100600      
001704    03 WKS-CAT-CAJA              PIC 9(04) VALUE 36.              100800      
001705 01 WKS-LLAVES.                                                   101000      
001706    03 WKS-CONTRATO            PIC 9(16).                         101200      
001707    03 WKS-MDA-SUC             PIC 9(04).                         101400      
001708    03 WKS-MDA-CTA             PIC 9(16).                         101600      
001709    03 WKS-AUT-S151            PIC 9(08).                         101800      
001710 77 W77-PARAMETRO              PIC 9(03).                         101900      
001711 01 WKS-TARJETA                PIC 9(16).                         101905      
001712 01 WKS-TARJETA-R REDEFINES WKS-TARJETA.                          101906      
001713    03 WKS-TAR-BIN             PIC 9(06).                         101910      
001714    03 WKS-TAR-CTA             PIC 9(10).                         102000      
001715******************************************************************102200      
001716*                TABLA DE SECUENCIAS DE RUTINAS                  *102400      
001717*                                                                *102600      
001718*   200000ÀS INICIALIZACIONES                                    *102800      
001719*   300000ÀS                                                     *103000      
001720*   400000ÀS ACCIONES                                            *103200      
001721*   500000ÀS REPORTES                                            *103400      
001722*   600000ÀS CIERRE/TERMINACION                                  *103600      
001723*   700000ÀS BASE DE DATOS                                       *103800      
001724*   800000ÀS ERROR                                               *104000      
001725*   900000ÀS DISPLAY                                             *104200      
001726*                                                                *104400      
001727******************************************************************104600      
001728 PROCEDURE DIVISION USING W77-PARAMETRO.                          104800      
001729 DECLARATIVES.                                                    105000      
001730 INTERRUP-POR-HI SECTION.                                         105200      
001731          USE AS INTERRUPT PROCEDURE.                             105400      
001732 000I-INICIA-INTERRUPCION.                                        105600      
001733     DISALLOW INTERRUPT                                           105800      
001734     MOVE "I"                           TO TIPO-LJ.               106000      
001735     MOVE 050104                        TO CODIGO-LJ.             106200      
001736     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-HI.                106400      
001737     IF W88-HI-4 OR W88-HI-6                                      106600      
001738          MOVE SPACES                   TO TEXTO-LJ               106800      
001739          PERFORM 609000-HI-SALIDA.                               107000      
001740                                                                  107200      
001741     CHANGE ATTRIBUTE TASKVALUE OF MYSELF TO 0.                   107400      
001742     ALLOW INTERRUPT.                                             107600      
001743 000I-TERMINA-INTERRUPCION.                                       107800      
001744  END DECLARATIVES.                                               108000      
001745 100000-PROGRAMA SECTION.                                         108200      
001746 101000-INICIO-PROGRAMA.                                          108400      
001747                                                                  108600      
001748   MOVE "S151"                        TO SISTEMA-LJ               108800      
001749   MOVE "P199"                        TO PASO-LJ                  109000      
001750   MOVE  1                            TO MTP-LJ                   109200      
001751   MOVE "I"                           TO TIPO-LJ                  109400      
001752   MOVE 050104                        TO CODIGO-LJ                109600      
001753   PERFORM 200000-INICIO.                                         109800      
001754   PERFORM 400000-PROCESO.                                        110000      
001755   PERFORM 600000-FIN.                                            110200      
001756                                                                  110400      
001757                                                                  110600      
001758******************************************************************110800      
001759*                            200000ÀS                            *111000      
001760******************************************************************111200      
001761 200000-INICIO.                                                   111400      
001762   MOVE 20 TO WKS-FEC-MAQ-CC                                      111600      
001763              WKS-FEC-MIG-CC.                                     111800      
001764   PERFORM 204000-LIBRERIAS.                                      112000      
001765   MOVE WKS-FECPRO-6D                TO WKS-FEC-MIG-AMD.          112050      
001766   PERFORM 206200-CATALOGO6.                                      112200      
001767*   PERFORM 206400-CATALOGO1565.                                  112400      
001768* Si no es dia de migracion termina ejecucion de programa         112600      
001769*   IF W88-NO-MIGRACION                                           112800      
001770*      PERFORM 602000-TERMINA.                                    113000      
001771   PERFORM 208000-ARCHIVOS.                                       113200      
001772   ALLOW INTERRUPT                                                113400      
001773   ATTACH INTERRUP-POR-HI            TO ATTRIBUTE EXCEPTIONEVENT  113600      
001774                                     OF MYSELF                    113800      
001775   PERFORM 210000-ABRE-BD.                                        114000      
001776                                                                  114200      
001777 204000-LIBRERIAS.                                                114400      
001778*=================                                                114600      
001779   CHANGE ATTRIBUTE LIBACCESS         OF "CTRLVERS"               114800      
001780                                      TO BYFUNCTION.              115000      
001781   CHANGE ATTRIBUTE FUNCTIONNAME      OF "CTRLVERS"               115200      
001782                                      TO "CTLVERS".               115400      
001783   CHANGE ATTRIBUTE LIBACCESS         OF "SOPORTECOMS"            115420      
001784                                      TO BYFUNCTION.              115440      
001785   CHANGE ATTRIBUTE FUNCTIONNAME      OF "SOPORTECOMS"            115460      
001786                                      TO "SOPORTECOMS".           115480      
001787   CHANGE ATTRIBUTE TITLE             OF "LIB-DISP"               115600      
001788      TO "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".         115800      
001789                                                                  116000      
001790***** *S080                                                       116200      
001791     MOVE "S080BD01CON"                 TO     WKS-CTLVER-LIBID.  116400      
001792     CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID   116600      
001793                                               WKS-CTLVER-NOMLIB  116800      
001794                                        GIVING W77-CTLVER-RESULT. 117000      
001795      IF W77-CTLVER-RESULT = 0                                    117200      
001796         CHANGE ATTRIBUTE TITLE OF "S080L710"                     117400      
001797                                       TO     WKS-CTLVER-NOMLIB.  117600      
001798                                                                  117800      
001799                                                                  118000      
001800****** OBTIENE NOMBRE DEL ARCHIVO DE MOVS500                      118200      
001801   MOVE "S151L001CTL"                 TO     WKS-CTLVER-LIBID.    118400      
001802   CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID     118600      
001803                                             WKS-CTLVER-NOMLIB    118800      
001804                                      GIVING W77-CTLVER-RESULT.   119000      
001805   IF W77-CTLVER-RESULT = 0                                       119200      
001806      CHANGE ATTRIBUTE TITLE         OF "S151-L001"               119400      
001807                                     TO WKS-CTLVER-NOMLIB         119600      
001808   ELSE                                                           119800      
001809      CHANGE ATTRIBUTE TITLE         OF "S151-L001" TO            120000      
001810             "(S151)S151/OBJECT/L001/CONTROL ON CMEMP.".          120200      
001811                                                                  120400      
001812   MOVE W77-PARAMETRO                TO WKS-B01-SISTEMA           120600      
001813   MOVE 01                           TO WKS-B01-FUNCION.          120800      
001814   CALL "CONSISDIA IN S151-L001"     USING  WKS-S151B01SISDIA     121000      
001815                                     GIVING W77-RESULT-B01.       121200      
001816                                                                  121400      
001817   IF W77-RESULT-B01 > 0                                          121600      
001818      MOVE W77-RESULT-B01            TO W77-ERROR                 121800      
001819      STRING "NO PUEDO OBTENER FECHA DE PROCESO "                 122000      
001820             " ERROR EN S151-L001 S500, ERR #" W77-ERROR          122200      
001821      DELIMITED BY SIZE INTO TEXTO-LJ                             122400      
001822      MOVE "O"                       TO TIPO-LJ                   122600      
001823      MOVE 020901                    TO CODIGO-LJ                 122800      
001824      CALL "LJ IN LIB-DISP"          USING CONTADOR-LJ,           123000      
001825                                           MENSAJE-LJ             123200      
001826      SET MYSELF(STATUS)          TO -1                           123400      
001827   ELSE                                                           123600      
001828      MOVE WKS-B01-NOMPACMOV         TO WKS-PACK-MOVS.            123800      
001829      MOVE WKS-B01-FECPRO            TO WKS-FECHA-PROCESO.        124000      
001830                                                                  124020      
001831   MOVE ATTRIBUTE TASKVALUE          OF MYSELF TO WKS-VALUE.      124040      
001832                                                                  124060      
001833   IF WKS-VALUE > 0                                               124080      
001834      MOVE WKS-VALUE                 TO WKS-FECHA-PROCESO.        124100      
001835                                                                  124200      
001836 206200-CATALOGO6.                                                124400      
001837*=================                                                124600      
001838   MOVE 151                         TO W77-L710-SISTEMA.          124800      
001839   MOVE 199                         TO W77-L710-PROGRAMA.         125000      
001840   MOVE 6                           TO WKS-EL710-CAT.             125200      
001841   MOVE 20                          TO WKS-EL710-CLAVE.           125400      
001842   MOVE 10                          TO WKS-EL710-REGISTROS.       125600      
001843* Asi buscaria solo los del S500.                                 125800      
001844*     MOVE 1                           TO WKS-EL710-BUSQUEDA.     126000      
001845*     MOVE 2300                        TO WKS-EL710-LLAVE1.       126200      
001846*     MOVE 500                         TO WKS-EL710-LLAVE2.       126400      
001847* Si no importa el sistema                                        126600      
001848   MOVE 2                           TO WKS-EL710-BUSQUEDA.        126800      
001849   MOVE ZERO                        TO WKS-EL710-LLAVE1.          127000      
001850   MOVE 500                         TO WKS-EL710-LLAVE2.          127200      
001851   MOVE ZERO                        TO WKS-EL710-LLAVE3           127400      
001852                                       WKS-EL710-LLAVE4           127600      
001853                                       WKS-EL710-LLAVE5           127800      
001854                                       WKS-EL710-LLAVE6           128000      
001855                                       WKS-EL710-FECINI           128200      
001856                                       WKS-EL710-NIVINI           128400      
001857                                       WKS-EL710-FEC-VIG.         128600      
001858   MOVE 0                           TO WKS-NUM-CVETRANS.          128800      
001859   MOVE ZERO                        TO W77-EOF                    129000      
001860   PERFORM 206200-CLAVES-TRAN       UNTIL W77-EOF = 1.            129200      
001861                                                                  129400      
001862 206200-CLAVES-TRAN.                                              129600      
001863*===================                                              129800      
001864     CALL "L710_CONSUL_DETALLE IN S080L710"                       130000      
001865          USING  W77-L710-SISTEMA,                                130200      
001866                 W77-L710-PROGRAMA,                               130400      
001867                 WKS-L710-ENT,                                    130600      
001868                 WKS-L710-SAL,                                    130800      
001869          GIVING W77-L710-RESULT.                                 131000      
001870                                                                  131200      
001871     IF W77-L710-RESULT = 0 OR 1                                  131400      
001872        PERFORM 260220-LLENA-CATALOGO6                            131600      
001873                VARYING WKS-NUM-OCCURS FROM 1 BY 1                131800      
001874                UNTIL WKS-NUM-OCCURS > WKS-SL710-NUMREG           132000      
001875        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,1) TO WKS-EL710-LLAVE1132200      
001876        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,2) TO WKS-EL710-LLAVE2132400      
001877        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,3) TO WKS-EL710-LLAVE3132600      
001878        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,4) TO WKS-EL710-LLAVE4132800      
001879        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,5) TO WKS-EL710-LLAVE5133000      
001880        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,6) TO WKS-EL710-LLAVE6133200      
001881        MOVE WKS-SL710-NIVINI                  TO WKS-EL710-NIVINI133400      
001882        MOVE WKS-SL710-FECINI                  TO WKS-EL710-FECINI133600      
001883     ELSE                                                         133800      
001884        MOVE 1                                 TO W77-EOF         134000      
001885        MOVE W77-L710-RESULT                   TO W77-ERR-CAT     134200      
001886        IF W77-ERR-CAT = 20                                       134400      
001887           IF WKS-NUM-CVETRANS = 0                                134600      
001888             MOVE  1                           TO W77-FIN         134800      
001889             MOVE  "EN CAT 6 NO EXISTEN REG DESEADOS"             135000      
001890                                               TO TEXTO-LJ        135200      
001891              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 135400      
001892*                                                                 135600      
001893*                                                                 135800      
001894*                                                                 136000      
001895*                                                                 136200      
001896           ELSE                                                   136400      
001897              NEXT SENTENCE                                       136600      
001898        ELSE                                                      136800      
001899           MOVE  1                    TO W77-FIN                  137000      
001900           MOVE "I"                   TO TIPO-LJ                  137200      
001901           MOVE 020901                TO CODIGO-LJ                137400      
001902           STRING "ERROR AL LLAMAR S080BD01CON, RESULT = "        137600      
001903                  W77-ERR-CAT                                     137800      
001904           DELIMITED BY SIZE                                      138000      
001905           INTO TEXTO-LJ                                          138200      
001906           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.   138400      
001907*                                                                 138600      
001908*                                                                 138800      
001909*                                                                 139000      
001910*                                                                 139200      
001911*                                                                 139400      
001912                                                                  139600      
001913 260220-LLENA-CATALOGO6.                                          139800      
001914*========================                                         140000      
001915  MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,1) TO WKS-NUM-CVETRANS        140200      
001916  IF WKS-SL710-DAT(WKS-NUM-OCCURS,14) = 5                         140400      
001917     MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,11)                        140600      
001918                  TO WKS-CAT6-NATC(WKS-NUM-CVETRANS)              140800      
001919     MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,15)                        141000      
001920                  TO WKS-CAT6-SUMPAN(WKS-NUM-CVETRANS)            141200      
001921     MOVE WKS-NUM-CVETRANS                                        141400      
001922                  TO WKS-CAT6-CVETRAN(WKS-NUM-CVETRANS)           141600      
001923                                                                  141800      
001924  ELSE                                                            142000      
001925    IF WKS-SL710-DAT(WKS-NUM-OCCURS,14) = 6                       142200      
001926       MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,11)                      142400      
001927                    TO WKS-CAT6-NATC(WKS-NUM-CVETRANS)            142600      
001928       MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,15)                      142800      
001929                    TO WKS-CAT6-SUMPAN(WKS-NUM-CVETRANS)          143000      
001930       MOVE WKS-NUM-CVETRANS                                      143200      
001931                    TO WKS-CAT6-CVETRAN(WKS-NUM-CVETRANS)         143400      
001932                                                                  143600      
001933    ELSE                                                          143800      
001934      IF WKS-SL710-DAT(WKS-NUM-OCCURS,14) = 4                     144000      
001935         MOVE WKS-NUM-CVETRANS                                    144200      
001936                      TO WKS-CAT6-CVETRAN(WKS-NUM-CVETRANS)       144400      
001937         MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,15)                    144600      
001938                      TO WKS-CAT6-SUMPAN(WKS-NUM-CVETRANS)        144800      
001939         MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,11)                    145000      
001940                      TO WKS-CAT6-NATC(WKS-NUM-CVETRANS).         145200      
001941                                                                  145400      
001942 206400-CATALOGO1565.                                             145600      
001943*=====================                                            145800      
001944   MOVE 151                         TO W77-L710-SISTEMA.          146000      
001945   MOVE 199                         TO W77-L710-PROGRAMA.         146200      
001946   MOVE 1565                        TO WKS-EL710-CAT.             146400      
001947   MOVE 20                          TO WKS-EL710-CLAVE.           146600      
001948   MOVE 10                          TO WKS-EL710-REGISTROS.       146800      
001949* Asi buscaria solo los del S500.                                 147000      
001950*     MOVE 1                           TO WKS-EL710-BUSQUEDA.     147200      
001951*     MOVE 2300                        TO WKS-EL710-LLAVE1.       147400      
001952*     MOVE 500                         TO WKS-EL710-LLAVE2.       147600      
001953* Si no importa el sistema                                        147800      
001954   MOVE 1                           TO WKS-EL710-BUSQUEDA.        148000      
001955   MOVE 111                         TO WKS-EL710-LLAVE1.          148200      
001956   MOVE ZERO                        TO WKS-EL710-LLAVE2.          148400      
001957   MOVE ZERO                        TO WKS-EL710-LLAVE3           148600      
001958                                       WKS-EL710-LLAVE4           148800      
001959                                       WKS-EL710-LLAVE5           149000      
001960                                       WKS-EL710-LLAVE6           149200      
001961                                       WKS-EL710-FECINI           149400      
001962                                       WKS-EL710-NIVINI           149600      
001963                                       WKS-EL710-FEC-VIG.         149800      
001964   MOVE 0                           TO WKS-NUM-CVETRANS.          150000      
001965   MOVE ZERO                        TO W77-EOF                    150200      
001966   PERFORM 206400-FEC-MIG           UNTIL W77-EOF = 1.            150600      
001967                                                                  150800      
001968 206400-FEC-MIG.                                                  151000      
001969*===================                                              151200      
001970     CALL "L710_CONSUL_DETALLE IN S080L710"                       151400      
001971          USING  W77-L710-SISTEMA,                                151600      
001972                 W77-L710-PROGRAMA,                               151800      
001973                 WKS-L710-ENT,                                    152000      
001974                 WKS-L710-SAL,                                    152200      
001975          GIVING W77-L710-RESULT.                                 152400      
001976                                                                  152600      
001977     IF W77-L710-RESULT = 0 OR 1                                  152800      
001978        PERFORM 260220-LLENA-CATALOGO1565                         153000      
001979                VARYING WKS-NUM-OCCURS FROM 1 BY 1                153200      
001980                UNTIL WKS-NUM-OCCURS > WKS-SL710-NUMREG           153400      
001981        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,1) TO WKS-EL710-LLAVE1153600      
001982        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,2) TO WKS-EL710-LLAVE2153800      
001983        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,3) TO WKS-EL710-LLAVE3154000      
001984        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,4) TO WKS-EL710-LLAVE4154200      
001985        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,5) TO WKS-EL710-LLAVE5154400      
001986        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,6) TO WKS-EL710-LLAVE6154600      
001987        MOVE WKS-SL710-NIVINI                  TO WKS-EL710-NIVINI154800      
001988        MOVE WKS-SL710-FECINI                  TO WKS-EL710-FECINI155000      
001989     ELSE                                                         155200      
001990        MOVE 0                                TO WKS-IND-MIGRACION155400      
001991        MOVE 1                                TO W77-EOF          155600      
001992        MOVE W77-L710-RESULT                  TO W77-ERR-CAT      155800      
001993        IF W77-ERR-CAT = 20                                       156000      
001994           IF WKS-NUM-CVETRANS = 0                                156200      
001995             MOVE  1                           TO W77-FIN         156400      
001996             MOVE  "EN CAT 1565 NO EXISTEN REG MIGRACION"         156600      
001997                                               TO TEXTO-LJ        156800      
001998              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 157000      
001999*                                                                 157200      
002000*                                                                 157400      
002001*                                                                 157600      
002002*                                                                 157800      
002003           ELSE                                                   158000      
002004              NEXT SENTENCE                                       158200      
002005        ELSE                                                      158400      
002006           MOVE  1                    TO W77-FIN                  158600      
002007           MOVE "I"                   TO TIPO-LJ                  158800      
002008           MOVE 020901                TO CODIGO-LJ                159000      
002009           STRING "ERROR AL LLAMAR S080BD01CON, RESULT = "        159200      
002010                  W77-ERR-CAT                                     159400      
002011           DELIMITED BY SIZE                                      159600      
002012           INTO TEXTO-LJ                                          159800      
002013           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.   160000      
002014*                                                                 160200      
002015*                                                                 160400      
002016*                                                                 160600      
002017*                                                                 160800      
002018*                                                                 161000      
002019                                                                  161200      
002020 260220-LLENA-CATALOGO1565.                                       161400      
002021*==========================                                       161600      
002022  MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,1) TO WKS-BIN                 161800      
002023  IF WKS-SL710-DAT(WKS-NUM-OCCURS,2) = WKS-FECPRO-6D              162000      
002024     MOVE 1                           TO WKS-IND-MIGRACION        162200      
002025     COMPUTE WKS-NUM-OCCURS = WKS-SL710-NUMREG + 1                162400      
002026     EXIT PERFORM.                                                162600      
002027                                                                  162800      
002028 208000-ARCHIVOS.                                                 163000      
002029*================                                                 163200      
002030   ACCEPT WKS-FEC-MAQ-AMD             FROM DATE.                  163400      
002031                                                                  163410      
002032                                                                  163420      
002033                                                                  163430      
002034   MOVE   W77-PARAMETRO               TO WKS-MOVS1-SIST.          163530      
002035   MOVE   WKS-FECPRO-6D               TO WKS-MOVS1-FECHA          163600      
002036                                         WKS-RUT-L01-FCH          163800      
002037                                         WKS-RUT-R01-FECHA        164000      
002038                                         WKS-FECHA-MIG.           164200      
002039   ACCEPT WKS-HOR-MAQ-HMSD            FROM  TIME.                 164400      
002040   MOVE   WKS-HOR-MAQ-HMSD            TO WKS-RUT-L01-HORA.        164600      
002041                                                                  164800      
002042   CALL "CSIID OF SOPORTECOMS" USING WKS-DATOS-HOST.              164900      
002043   MOVE "VDM"                         TO WKS-RUT-L01-CSI          165000      
002044   MOVE WKS-NUMCSI-HOST               TO WKS-RUT-R01-CSI-ORIGEN.  165200      
002045   IF WKS-NUMCSI-HOST = 04                                        165400      
002046      MOVE "MTY"                      TO WKS-RUT-L01-CSI.         165600      
002047                                                                  165800      
002048   CHANGE ATTRIBUTE TITLE             OF A01-MOVS500              166000      
002049                                      TO WKS-RUT-MOVS500.         166200      
002050   CHANGE ATTRIBUTE TITLE             OF A03-CTLMIG               166400      
002051                                      TO WKS-RUT-CTLMIG.          166600      
002052   CHANGE ATTRIBUTE NEWFILE           OF L01-DISPLAY              166800      
002053                                      TO VALUE FALSE.             167000      
002054   CHANGE ATTRIBUTE TITLE             OF L01-DISPLAY              167200      
002055                                      TO WKS-RUT-L01.             167400      
002056                                                                  167600      
002057   MOVE ZEROS                          TO WKS-RUT-R01-MIX.        167800      
002058   MOVE ATTRIBUTE MIXNUMBER OF  MYSELF TO WKS-RUT-R01-MIX.        168000      
002059   CHANGE ATTRIBUTE USERBACKUPNAME  OF R01-TOTALES TO 1.          168200      
002060                                                                  168400      
002061                                                                  168600      
002062   IF ATTRIBUTE RESIDENT              OF A03-CTLMIG = VALUE TRUE  168800      
002063      NEXT SENTENCE                                               169000      
002064   ELSE                                                           169200      
002065      OPEN OUTPUT A03-CTLMIG                                      169400      
002066      MOVE 1                          TO R01-REG-AUTS500          169600      
002067                                         W77-AUT-MIGS500          169800      
002068      WRITE R01-REG-MIGRACION                                     170000      
002069      CLOSE A03-CTLMIG                WITH SAVE.                  170200      
002070                                                                  170400      
002071   IF  ATTRIBUTE RESIDENT  OF L01-DISPLAY  = VALUE TRUE           170600      
002072       OPEN EXTEND L01-DISPLAY                                    170800      
002073   ELSE                                                           171000      
002074       OPEN OUTPUT L01-DISPLAY                                    171200      
002075       ADD   1  TO  CONT-REG-DISPLAY                              171400      
002076       WRITE REG-DISPLAY       FROM REGISTRO-DIS-HEADER.          171600      
002077                                                                  171800      
002078   OPEN OUTPUT        R01-TOTALES.                                172000      
002079                                                                  172200      
002080                                                                  172400      
002081 210000-ABRE-BD.                                                  172600      
002082*================                                                 172800      
002083   MOVE    1              TO    W77-FIN                           173000      
002084   PERFORM 701000-OPEN-DB UNTIL W77-FIN = 0 OR W77-INTENTO > 6.   173200      
002085   IF W77-FIN = 1                                                 173400      
002086      MOVE "ERROR AL ABRIR BASE S151BD13BIFIN" TO WKS-DMS-DSCERR  173600      
002087      PERFORM 801000-DMTERMINATE.                                 173800      
002088                                                                  174000      
002089                                                                  174200      
002090******************************************************************174400      
002091*                            400000ÀS                            *174600      
002092******************************************************************174800      
002093                                                                  175000      
002094 400000-PROCESO.                                                  175200      
002095*===============                                                  175400      
002096   PERFORM 420000-LEE-ARCH-CONTROL.                               175600      
002097   MOVE ZERO                            TO W77-FIN-ARCHMOVS       175800      
002098   MOVE W77-AUT-MIGS500                 TO W77-NUMREG-MOV500      176000      
002099   ADD  1                               TO W77-NUMREG-MOV500      176200      
002100   OPEN  INPUT A01-MOVS500                                        176400      
002101   SEEK A01-MOVS500 RECORD.                                       176600      
002102   MOVE ZERO TO WKS-NUM-MIGS.                                     176800      
002103   PERFORM 440000-LEE-ARCH-S500.                                  177000      
002104   PERFORM 709300-BEGIN-TRANS.                                    177200      
002105   PERFORM 460000-SELECCIONA-MOVS-MIG UNTIL W77-FIN-ARCHMOVS = 1. 177400      
002106   PERFORM 709600-END-TRANS.                                      177600      
002107   MOVE 0                               TO WKS-CONT-PAG-E.        177800      
002108   PERFORM 480000-GUARDA-TOTALES.                                 178000      
002109                                                                  178200      
002110 420000-LEE-ARCH-CONTROL.                                         178400      
002111*========================                                         178600      
002112   OPEN  I-O A03-CTLMIG                                           178800      
002113   READ  A03-CTLMIG                                               179000      
002114   MOVE  R01-REG-AUTS500        TO W77-AUT-MIGS500                179200      
002115   CLOSE A03-CTLMIG WITH SAVE.                                    179400      
002116                                                                  179600      
002117 422000-ACT-ARCH-CONTROL.                                         179800      
002118*========================                                         180000      
002119   OPEN I-O A03-CTLMIG.                                           180200      
002120   MOVE 1                             TO W77-NUMREG-ACC.          180400      
002121   SEEK A03-CTLMIG RECORD.                                        180600      
002122   READ A03-CTLMIG.                                               180800      
002123   MOVE W77-AUT-MIGS500               TO R01-REG-AUTS500.         181000      
002124   REWRITE R01-REG-MIGRACION                                      181200      
002125         INVALID KEY NEXT SENTENCE.                               181400      
002126   CLOSE A03-CTLMIG WITH SAVE.                                    181600      
002127                                                                  181800      
002128 440000-LEE-ARCH-S500.                                            182000      
002129*=====================                                            182200      
002130   READ A01-MOVS500 INTO A00-R01-REGMOV                           182400      
002131        AT END MOVE 1           TO W77-FIN-ARCHMOVS.              182600      
002132                                                                  182800      
002133 460000-SELECCIONA-MOVS-MIG.                                      183000      
002134*===========================                                      183200      
002135   ADD  1                       TO W77-AUT-MIGS500.               183400      
002136   MOVE 0 TO WKS-NUM-OCURR                                        183600      
002137   MOVE 0 TO WKS-IMPORTE-B08.                                     183650      
002138   PERFORM 461000-VALIDA-END-TRANS.                               183800      
002139                                                                  184000      
002140   IF (A00-R01-FUNCION = 21 OR 22)                                184200      
002141*      A00-R01-SUCTRAN  = WKS-CAT-SUC AND                         184220      
002142*      A00-R01-CAJATRAN = WKS-CAT-CAJA                            184240      
002143      MOVE A00-R01-FUNCION        TO W77-CANC-FUNCION             184400      
002144      MOVE A00-R01-TIPO-PROC      TO W77-CANC-PROC                184600      
002145      MOVE A00-R01-AUT-AELIM-S151 TO W77-CANC-AUT-AELIM-S151      184800      
002146      MOVE A00-R01-AUT-S151       TO W77-CAN-AUT-S151             185000      
002147      PERFORM 464000-CANCELA                                      185200      
002148   ELSE                                                           185400      
002149*JDPG SE REALIZA VALIDACION DE FUNCION 2                          185405      
002150      IF  A00-R01-FUNCION = 2                                     185410      
002151          MOVE A00-R01-AUT-AELIM-S151 TO WKS-AUT-S151             185430      
002152          PERFORM 705000-FIND-B08SXFECTAR-F2                      185440      
002153          IF W88-EXISTE-B08                                       185441      
002154             MOVE 1                      TO W77-BAND-STATUS-B08   185443      
002155             PERFORM 462200-CREA-ACTUALIZA-B08                    185444      
002156             ADD  1                      TO WKS-NUM-MIGS          185445      
002157           ELSE                                                   185446      
002158               NEXT SENTENCE                                      185447      
002159       ELSE                                                       185450      
002160          PERFORM 462000-VALIDA-MIG                               185600      
002161                  VARYING WKS-NUM-OCURR FROM 1 BY 1               185800      
002162                  UNTIL   WKS-NUM-OCURR > 5.                      186000      
002163   PERFORM 440000-LEE-ARCH-S500.                                  186200      
002164                                                                  186400      
002165 461000-VALIDA-END-TRANS.                                         186600      
002166   IF WKS-NUM-MIGS > 20000                                        186800      
002167      PERFORM 709600-END-TRANS                                    187000      
002168      PERFORM 422000-ACT-ARCH-CONTROL                             187200      
002169      MOVE 0                    TO WKS-NUM-MIGS                   187400      
002170      PERFORM 709300-BEGIN-TRANS.                                 187600      
002171                                                                  187800      
002172 462000-VALIDA-MIG.                                               188000      
002173*==================                                               188200      
002174*JDPG SE MUEVE VALIDACION DE FUNCION DOS FUERA DE RUTINA          188250      
002175   MOVE 0                         TO W77-BAND-STATUS-B08.         188400      
002176     IF A00-R01-CVETRAN(WKS-NUM-OCURR) = 0 OR                     189600      
002177        A00-R01-SUCTRAN NOT = WKS-CAT-SUC OR                      189800      
002178        A00-R01-CAJATRAN NOT = WKS-CAT-CAJA                       190000      
002179        MOVE 6 TO WKS-NUM-OCURR                                   190015      
002180        EXIT PERFORM                                              190030      
002181     ELSE                                                         190033      
002182        MOVE A00-R01-CONTRATO TO WKS-CONTRATO                     190045      
002183        MOVE A00-R01-MDA-SUC  TO WKS-MDA-SUC                      190046      
002184        MOVE A00-R01-MDA-CTA  TO WKS-TARJETA                      190060      
002185        MOVE A00-R01-AUT-S151 TO WKS-AUT-S151                     190075      
002186        PERFORM 705000-FIND-B08SXFECTAR.                          190090      
002187      MOVE A00-R01-CVETRAN(WKS-NUM-OCURR) TO WKS-NUM-CVETRANS     191600      
002188      IF A00-R01-FUNCION = 1 AND                                  191800      
002189         W88-NO-EXISTE-B08   AND                                  192000      
002190         WKS-CAT6-CVETRAN(WKS-NUM-CVETRANS) NOT = 0               192200      
002191         PERFORM 462200-CREA-ACTUALIZA-B08                        192400      
002192         ADD  1                   TO WKS-NUM-MIGS.                192600      
002193                                                                  192800      
002194 462200-CREA-ACTUALIZA-B08.                                       193000      
002195*==========================                                       193200      
002196   IF W88-ALTA-B08                                                193400      
002197      PERFORM 462250-ARMA-REG-B08MIG                              193600      
002198      MOVE B08-TAR-BIN TO WKS-BIN-BUSQ                            193800      
002199      PERFORM 703000-STORE-B08                                    194000      
002200      IF W77-DUP-B08 = 0                                          194100      
002201         PERFORM 462255-SUMARIZA                                  194200      
002202      ELSE                                                        194300      
002203         NEXT SENTENCE                                            194350      
002204   ELSE                                                           194400      
002205      PERFORM 705050-LOCK-B08SXFECTAR                             194450      
002206      PERFORM 462300-PROCESA-FN-FUNCION2 UNTIL WKS-FIN-B08A = 1.  194800      
002207 462250-ARMA-REG-B08MIG.                                          195000      
002208*=======================                                          195200      
002209   PERFORM 702000-CREATE-B08.                                     195400      
002210   MOVE WKS-FEC-MIG-S500-CAMD             TO B08-FEC-MIG          195600      
002211   MOVE A00-R01-MDA-SUC                   TO B08-MDA-SUC          195800      
002212   MOVE A00-R01-MDA-CTA                   TO B08-MDA-TARJETA      196000      
002213   MOVE A00-R01-AUT-S151                  TO B08-AUT-S151         196200      
002214   MOVE A00-R01-SUCPROM                   TO B08-SUC-PROM         196400      
002215   MOVE A00-R01-CONTRATO                  TO B08-CONTRATO         196600      
002216   MOVE A00-R01-IMPORTE(WKS-NUM-OCURR)    TO B08-IMPORTE          196800      
002217*       AC . ACTIVO                                               197000      
002218*       CA . CANCELADO                                            197200      
002219   MOVE "AC"                              TO B08-STATUS           197400      
002220   MOVE A00-R01-CVETRAN(WKS-NUM-OCURR)    TO B08-CVE-TRANS        197600      
002221   MOVE WKS-NUM-OCURR                     TO B08-NUMOCURRS        197800      
002222   MOVE A00-R01-TIPO-PROC                 TO B08-NUM-PRO.         198000      
002223                                                                  198200      
002224 462255-SUMARIZA.                                                 198400      
002225*=================                                                198600      
002226   IF WKS-BIN-BUSQ > 0                                            198700      
002227   SET WS-COUNT TO 1                                              198800      
002228   SEARCH WKS-CVES-BIN VARYING WS-COUNT                           199000      
002229       AT END                                                     199200      
002230          PERFORM 462256-AGREGA-BIN-A-TAB                         199400      
002231       WHEN WKS-BIN-TABLA(WS-COUNT) = WKS-BIN-BUSQ                199600      
002232            MOVE WKS-ID(WS-COUNT) TO W77-CONT                     199800      
002233            PERFORM 462258-SUMARIZA-A-SDO.                        200000      
002234                                                                  200010      
002235 462255-RESTA.                                                    200020      
002236*==============                                                   200030      
002237   IF WKS-BIN-BUSQ > 0                                            200040      
002238   SET WS-COUNT TO 1                                              200050      
002239   SEARCH WKS-CVES-BIN VARYING WS-COUNT                           200060      
002240       AT END                                                     200070      
002241          NEXT SENTENCE                                           200080      
002242       WHEN WKS-BIN-TABLA(WS-COUNT) = WKS-BIN-BUSQ                200090      
002243            MOVE WKS-ID(WS-COUNT) TO W77-CONT                     200100      
002244            PERFORM 462258-RESTA-A-SDO.                           200110      
002245                                                                  200120      
002246 462258-RESTA-A-SDO.                                              200130      
002247*===================                                              200140      
002248*JDPG SE CAMBIA VALIDACION DE IMPORTE                             200141      
002249   IF WKS-IMPORTE-B08 = 0                                         200142      
002250      COMPUTE WKS-NUM-01(W77-CONT) = WKS-NUM-01(W77-CONT) - 1     200144      
002251      COMPUTE WKS-NUM-TOT(W77-CONT) = WKS-NUM-TOT(W77-CONT) - 1   200146      
002252   ELSE                                                           200148      
002253     IF WKS-CAT6-NATC(WKS-NUM-CVETRANS) = 9                       200150      
002254        COMPUTE WKS-NUM-S1(W77-CONT) = WKS-NUM-S1(W77-CONT) - 1   200152      
002255        COMPUTE WKS-IMP-S1(W77-CONT) = WKS-IMP-S1(W77-CONT) -     200154      
002256                WKS-IMPORTE-B08                                   200156      
002257        COMPUTE WKS-IMP-TOT(W77-CONT) = WKS-IMP-TOT(W77-CONT) -   200158      
002258                WKS-IMPORTE-B08                                   200160      
002259        COMPUTE WKS-NUM-TOT(W77-CONT) =                           200162      
002260                WKS-NUM-TOT(W77-CONT) - 1                         200164      
002261     ELSE                                                         200166      
002262        COMPUTE WKS-NUM-A1(W77-CONT) = WKS-NUM-A1(W77-CONT) - 1   200168      
002263        COMPUTE WKS-IMP-A1(W77-CONT) =  WKS-IMP-A1(W77-CONT) -    200170      
002264                WKS-IMPORTE-B08                                   200172      
002265        COMPUTE WKS-IMP-TOT(W77-CONT) =  WKS-IMP-TOT(W77-CONT) -  200174      
002266                WKS-IMPORTE-B08                                   200176      
002267        COMPUTE WKS-NUM-TOT(W77-CONT) =                           200178      
002268                WKS-NUM-TOT(W77-CONT) - 1.                        200180      
002269                                                                  200200      
002270 462256-AGREGA-BIN-A-TAB.                                         200400      
002271*==========================                                       200600      
002272   PERFORM 462257-LOOP-AGREGA VARYING W77-CONT FROM 1 BY 1        200800      
002273                              UNTIL W77-CONT > 10.                201000      
002274                                                                  201200      
002275 462257-LOOP-AGREGA.                                              201400      
002276*====================                                             201600      
002277   IF WKS-BIN1(W77-CONT) = 0                                      201800      
002278      MOVE W77-CONT     TO  WKS-ID-OCC(W77-CONT)                  202000      
002279      MOVE WKS-BIN-BUSQ TO WKS-BIN1(W77-CONT)                     202200      
002280      PERFORM 462258-SUMARIZA-A-SDO                               202300      
002281      MOVE 11 TO W77-CONT.                                        202400      
002282                                                                  202600      
002283 462258-SUMARIZA-A-SDO.                                           202800      
002284*========================                                         203000      
002285   IF A00-R01-IMPORTE(WKS-NUM-OCURR) = 0                          203200      
002286      ADD 1 TO WKS-NUM-01(W77-CONT)                               203400      
002287      ADD 1 TO WKS-NUM-TOT(W77-CONT)                              203600      
002288   ELSE                                                           203800      
002289     IF WKS-CAT6-NATC(WKS-NUM-CVETRANS) = 9                       204000      
002290        ADD 1 TO WKS-NUM-S1(W77-CONT)                             204200      
002291        ADD A00-R01-IMPORTE(WKS-NUM-OCURR)                        204400      
002292                           TO  WKS-IMP-S1(W77-CONT)               204600      
002293                               WKS-IMP-TOT(W77-CONT)              204800      
002294        ADD 1 TO WKS-NUM-TOT(W77-CONT)                            205000      
002295     ELSE                                                         205200      
002296        ADD 1 TO WKS-NUM-A1(W77-CONT)                             205400      
002297        ADD A00-R01-IMPORTE(WKS-NUM-OCURR)                        205600      
002298                           TO  WKS-IMP-A1(W77-CONT)               205800      
002299                               WKS-IMP-TOT(W77-CONT)              206000      
002300        ADD 1 TO WKS-NUM-TOT(W77-CONT).                           206200      
002301                                                                  206400      
002302 462260-ACT-B08MIG.                                               206600      
002303*==================                                               206800      
002304   PERFORM 705050-LOCK-B08SXFECTAR.                               207000      
002305   IF WKS-FIN-B08A = ZEROS                                        207200      
002306      MOVE "CA"    TO B08-STATUS                                  207400      
002307      PERFORM 703000-STORE-B08.                                   207600      
002308                                                                  207800      
002309 464000-CANCELA.                                                  208000      
002310*================                                                 208200      
002311   IF W77-CANC-FUNCION = 21                                       208400      
002312      PERFORM 706010-LOCKF-B08SXFECNUMPRO                         208600      
002313      PERFORM 464100-CANC-F21 UNTIL WKS-FIN-B08A = 1              208800      
002314   ELSE                                                           209000      
002315      COMPUTE  W77-NUMREG-MOV500   = W77-CANC-AUT-AELIM-S151  + 1 209200      
002316      COMPUTE  W77-CANC-AUT-AELIM-S151   =                        209400      
002317               W77-CANC-AUT-AELIM-S151  - 1                       209600      
002318      PERFORM 706030-LOCKFIRST-B08SXFECAUT                        209800      
002319      PERFORM 464200-CANC-F22 UNTIL WKS-FIN-B08A = 1.             210000      
002320                                                                  210200      
002321 464100-CANC-F21.                                                 210400      
002322*=================                                                210600      
002323   MOVE B08-TAR-BIN TO WKS-BIN-BUSQ                               210700      
002324   MOVE B08-IMPORTE TO WKS-IMPORTE-B08                            210750      
002325   MOVE "CA" TO B08-STATUS.                                       210800      
002326   PERFORM 703000-STORE-B08.                                      211000      
002327   PERFORM 462255-RESTA.                                          211100      
002328   ADD 1   TO WKS-NUM-MIGS.                                       211200      
002329   PERFORM 461000-VALIDA-END-TRANS.                               211400      
002330   PERFORM 706010-LOCKNEXT-B08SXFECNUMPRO.                        211600      
002331                                                                  211800      
002332 464200-CANC-F22.                                                 212000      
002333*=================                                                212200      
002334   MOVE B08-TAR-BIN TO WKS-BIN-BUSQ                               212300      
002335   MOVE B08-IMPORTE TO WKS-IMPORTE-B08                            212350      
002336   MOVE "CA" TO B08-STATUS.                                       212400      
002337   PERFORM 703000-STORE-B08.                                      212600      
002338   PERFORM 462255-RESTA.                                          212700      
002339   ADD 1   TO WKS-NUM-MIGS.                                       212800      
002340   PERFORM 461000-VALIDA-END-TRANS.                               213000      
002341   PERFORM 706030-LOCKNEXT-B08SXFECAUT.                           213200      
002342                                                                  213400      
002343 480000-GUARDA-TOTALES.                                           213600      
002344*========================                                         213800      
002345   ACCEPT WKS-HOR-MAQ-HMSD FROM  TIME.                            214000      
002346   ACCEPT WKS-FEC-MAQ-AMD  FROM DATE.                             214200      
002347   PERFORM 480100-ESC-HEADER.                                     214400      
002348   PERFORM 480200-AREA-DETALLE VARYING W77-CONT FROM 1 BY 1       214600      
002349                               UNTIL W77-CONT > 10.               214800      
002350                                                                  215000      
002351 480100-ESC-HEADER.                                               215200      
002352*===================                                              215400      
002353   ADD 1                   TO WKS-CONT-PAG.                       215405      
002354   MOVE WKS-CONT-PAG       TO WKS-CONT-PAG-E.                     215407      
002355   MOVE 20                 TO WKS-R-FEC-CENTUR.                   215410      
002356   MOVE WKS-FEC-MAQ-A      TO WKS-R-FEC-AMO                       215420      
002357   MOVE WKS-FEC-MAQ-M      TO WKS-R-FEC-MES                       215430      
002358   MOVE WKS-FEC-MAQ-D      TO WKS-R-FEC-DIA.                      215440      
002359   WRITE R01-REG-TOTALES   FROM WKS-R-TOT-H1                      215600      
002360         AFTER PAGE.                                              215800      
002361   MOVE WKS-HOR-MAQ-H      TO WKS-R-HORA-HH.                      216000      
002362   MOVE WKS-HOR-MAQ-M      TO WKS-R-HORA-MM.                      216200      
002363   MOVE WKS-HOR-MAQ-S      TO WKS-R-HORA-SS.                      216400      
002364   WRITE R01-REG-TOTALES   FROM WKS-R-TOT-H2                      216600      
002365         AFTER ADVANCING 1 LINES.                                 216800      
002366   MOVE WKS-FEC-MAQ-AMD    TO WKS-R-FEC-03.                       217000      
002367   MOVE WKS-FEC-MIG-A      TO WKS-R-FECP-AMO3.                    217200      
002368   MOVE WKS-FEC-MIG-M      TO WKS-R-FECP-MES3.                    217400      
002369   MOVE WKS-FEC-MIG-D      TO WKS-R-FECP-DIA3.                    217600      
002370   WRITE R01-REG-TOTALES   FROM WKS-R-TOT-H3                      217800      
002371         AFTER ADVANCING 1 LINES.                                 218000      
002372   ADD 2                   TO WKS-CTR-LIN.                        218200      
002373                                                                  218400      
002374 480200-AREA-DETALLE.                                             218600      
002375*=====================                                            218800      
002376   MOVE  0                        TO WKS-R-BIN.                   219000      
002377   MOVE  WKS-BIN1(W77-CONT)       TO WKS-R-BIN.                   219200      
002378                                                                  219400      
002379   IF WKS-R-BIN > 0                                               219600      
002380      WRITE R01-REG-TOTALES       FROM WKS-R-D1                   219800      
002381            AFTER ADVANCING 2     LINES                           220000      
002382      WRITE R01-REG-TOTALES       FROM WKS-R-D2                   220200      
002383            AFTER ADVANCING 2     LINES                           220400      
002384      ADD 4                       TO WKS-CTR-LIN                  220600      
002385      PERFORM 480250-GUARDA-DETALLE                               220800      
002386*     TOTAL DE CUENTAS DE BIN, IMPORTE DE BIN                     221000      
002387      MOVE  WKS-NUM-TOT(W77-CONT) TO WKS-RT-NUMTAR                221200      
002388      MOVE  WKS-IMP-TOT(W77-CONT) TO WKS-RT-IMPORTE               221400      
002389      WRITE R01-REG-TOTALES       FROM WKS-R-T                    221600      
002390            AFTER ADVANCING 2     LINES                           221800      
002391      WRITE R01-REG-TOTALES       FROM WKS-R-ESPACIOS             222000      
002392            AFTER ADVANCING 1     LINES                           222200      
002393      ADD 3                       TO WKS-CTR-LIN                  222400      
002394      IF WKS-CTR-LIN > 58                                         222600      
002395         MOVE ZERO                TO WKS-CTR-LIN                  222800      
002396         PERFORM 480100-ESC-HEADER                                223000      
002397      ELSE                                                        223200      
002398         NEXT SENTENCE                                            223400      
002399   ELSE                                                           223600      
002400     IF W77-CONT = 1                                              223620      
002401        WRITE R01-REG-TOTALES FROM WKS-R-VACIO                    223640      
002402              AFTER ADVANCING 2    LINES                          223660      
002403        MOVE 11                TO W77-CONT                        223680      
002404    ELSE                                                          223700      
002405      MOVE  11                 TO W77-CONT.                       223800      
002406                                                                  224000      
002407 480250-GUARDA-DETALLE.                                           224200      
002408*=======================                                          224400      
002409   MOVE WKS-BIN1(W77-CONT)          TO WKS-RD-BIN                 224600      
002410   MOVE WKS-NUM-01(W77-CONT)        TO WKS-RD-NUMTAR              224800      
002411   MOVE WKS-IMP-01(W77-CONT)        TO WKS-RD-IMPORTE             225000      
002412   MOVE "CEROS                    " TO WKS-RD-SALDO               225200      
002413   WRITE R01-REG-TOTALES    FROM WKS-R-D3                         225400      
002414         AFTER ADVANCING 1  LINES                                 225600      
002415   MOVE WKS-BIN1(W77-CONT)          TO WKS-RD-BIN                 225800      
002416   MOVE WKS-NUM-A1(W77-CONT)        TO WKS-RD-NUMTAR              226000      
002417   MOVE WKS-IMP-A1(W77-CONT)        TO WKS-RD-IMPORTE             226200      
002418   MOVE "CON ABONO                " TO WKS-RD-SALDO               226400      
002419   WRITE R01-REG-TOTALES    FROM WKS-R-D3                         226600      
002420         AFTER ADVANCING 1  LINES                                 226800      
002421   MOVE WKS-BIN1(W77-CONT)          TO WKS-RD-BIN                 227000      
002422   MOVE WKS-NUM-S1(W77-CONT)        TO WKS-RD-NUMTAR              227200      
002423   MOVE WKS-IMP-S1(W77-CONT)        TO WKS-RD-IMPORTE             227400      
002424   MOVE "SOBREGIRO                " TO WKS-RD-SALDO               227600      
002425   WRITE R01-REG-TOTALES    FROM WKS-R-D3                         227800      
002426         AFTER ADVANCING 1  LINES.                                228000      
002427   ADD 3                            TO WKS-CTR-LIN.               228200      
002428                                                                  228400      
002429                                                                  228600      
002430******************************************************************228800      
002431*                            600000ÀS                            *229000      
002432******************************************************************229200      
002433                                                                  229400      
002434 600000-FIN.                                                      229600      
002435*============                                                     229800      
002436   PERFORM 790000-CLOSE-DB.                                       230000      
002437   PERFORM 601000-CIERRA-ARCHS.                                   230200      
002438   PERFORM 602000-TERMINA.                                        230400      
002439                                                                  230600      
002440 601000-CIERRA-ARCHS.                                             230800      
002441*====================                                             231000      
002442   CLOSE A01-MOVS500                  WITH RELEASE.               231200      
002443   CLOSE L01-DISPLAY                  WITH SAVE.                  231400      
002444   CLOSE R01-TOTALES                  WITH SAVE.                  231600      
002445                                                                  231800      
002446 602000-TERMINA.                                                  232000      
002447*================                                                 232200      
002448   STOP RUN.                                                      232400      
002449                                                                  232600      
002450 609000-HI-SALIDA.                                                232800      
002451*=================                                                233000      
002452   MOVE  020201                      TO CODIGO-LJ.                233200      
002453   MOVE  "I"                         TO TIPO-LJ.                  233400      
002454   IF W88-HI-4                                                    233600      
002455      MOVE "TERMINACION NORMAL"      TO TEXTO-LJ                  233800      
002456   ELSE                                                           234000      
002457     IF W88-HI-6                                                  234200      
002458        MOVE "TERMINACION DE EMERGENCIA" TO TEXTO-LJ.             234400      
002459   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                       234600      
002460                               MENSAJE-LJ.                        234800      
002461   IF W88-HI-4                                                    235000      
002462      PERFORM 422000-ACT-ARCH-CONTROL                             235200      
002463      PERFORM 600000-FIN.                                         235400      
002464   IF W88-HI-6                                                    235600      
002465      PERFORM 602000-TERMINA.                                     235800      
002466                                                                  236000      
002467                                                                  236200      
002468******************************************************************236400      
002469*                            700000ÀS                            *236600      
002470******************************************************************236800      
002471                                                                  237000      
002472 701000-OPEN-DB.                                                  237200      
002473*===============                                                  237400      
002474   MOVE ZERO  TO  W77-FIN                                         237600      
002475   OPEN UPDATE S151BD13BIFIN                                      237800      
002476   ON EXCEPTION                                                   238000      
002477      MOVE     1                               TO W77-FIN         238200      
002478      ADD      1                               TO W77-INTENTO     238400      
002479      WAIT(10).                                                   238600      
002480                                                                  238800      
002481 702000-CREATE-B08.                                               239000      
002482*==================                                               239200      
002483   CREATE S151B08TDMIGCAP                                         239400      
002484   ON EXCEPTION                                                   239600      
002485      MOVE "ERROR AL CREAR B08" TO WKS-DMS-DSCERR                 239800      
002486      PERFORM 801000-DMTERMINATE.                                 240000      
002487                                                                  240200      
002488 703000-STORE-B08.                                                240400      
002489*=================                                                240600      
002490   MOVE 0 TO W77-DUP-B08.                                         240700      
002491   STORE  S151B08TDMIGCAP                                         240800      
002492        ON EXCEPTION                                              241000      
002493        IF DMSTATUS (DUPLICATES)                                  241200      
002494           MOVE 1 TO W77-DUP-B08                                  241300      
002495           STRING "REG DUPLICADO B08 "                            241400      
002496               " ,CTO=" WKS-CONTRATO DELIMITED BY SIZE ,          241600      
002497               " ,SUC=" WKS-MDA-SUC  DELIMITED BY SIZE ,          241800      
002498               " ,CTA=" WKS-MDA-CTA  DELIMITED BY SIZE ,          242000      
002499               " ,AUT=" WKS-AUT-S151 DELIMITED BY SIZE ,          242200      
002500               " ,OCC=" WKS-NUM-OCURR    DELIMITED BY SIZE ,      242400      
002501                                         INTO WKS-DIS-TEXTO       242600      
002502          PERFORM 901000-DISPLAY                                  242800      
002503        ELSE                                                      243000      
002504           MOVE "ERROR STORE S151B08TDMIGCAP" TO WKS-DMS-DSCERR   243200      
002505           PERFORM 801000-DMTERMINATE.                            243400      
002506                                                                  243600      
002507 704000-DELETE-B08.                                               243800      
002508*==================                                               244000      
002509   DELETE S151B08TDMIGCAP                                         244200      
002510   ON EXCEPTION                                                   244400      
002511      MOVE "ERROR AL CREAR B08" TO WKS-DMS-DSCERR                 244600      
002512      PERFORM 801000-DMTERMINATE.                                 244800      
002513                                                                  245000      
002514 705000-FIND-B08SXFECTAR.                                         245200      
002515*========================                                         245400      
002516   MOVE ZERO        TO WKS-FIN-B08                                245600      
002517   MOVE 0           TO W77-BAND-EXISTENCIA-B08                    245800      
002518*JDPG <INI> SE CAMBIA EL SET DE BUSQUEDA                          245801      
002519   FIND FIRST B08SXFECTAR AT                                      246000      
002520       B08-FEC-MIG     = WKS-FEC-MIG-S500-CAMD   AND              246200      
002521       B08-TAR-BIN     = WKS-TAR-BIN             AND              246400      
002522       B08-TAR-CTA     = WKS-TAR-CTA             AND              246401      
002523       B08-AUT-S151    = WKS-AUT-S151            AND              246600      
002524       B08-NUMOCURRS   = WKS-NUM-OCURR                            246800      
002525*JDPG <FIN> SE CAMBIA EL SET DE BUSQUEDA                          247000      
002526   ON EXCEPTION                                                   247200      
002527       MOVE  1    TO WKS-FIN-B08                                  247400      
002528       IF DMSTATUS(NOTFOUND)                                      247600      
002529          MOVE  1    TO W77-BAND-EXISTENCIA-B08                   247800      
002530          MOVE  1    TO WKS-FIN-B08                               248000      
002531       ELSE                                                       248200      
002532          MOVE "ERROR LOCK FIRST B08SXFECMIG" TO WKS-DMS-DSCERR   248400      
002533          PERFORM 801000-DMTERMINATE.                             248600      
002534                                                                  248800      
002535 705050-LOCK-B08SXFECTAR.                                         249000      
002536*========================                                         249200      
002537   MOVE ZERO        TO WKS-FIN-B08A                               249400      
002538   MOVE 0           TO W77-BAND-EXISTENCIA-B08                    249600      
002539   LOCK FIRST B08SXFECTAR AT                                      249800      
002540*JDPG <INI> SE CAMBIA EL SET DE BUSQUEDA PARA FUNCION 2           249805      
002541       B08-FEC-MIG     = WKS-FEC-MIG-S500-CAMD AND                249806      
002542       B08-AUT-S151    = WKS-AUT-S151                             249807      
002543*JDPG <FIN> SE CAMBIA EL SET DE BUSQUEDA PARA FUNCION 2           250800      
002544   ON EXCEPTION                                                   251000      
002545       MOVE  1    TO WKS-FIN-B08A                                 251200      
002546       IF DMSTATUS(NOTFOUND)                                      251400      
002547          MOVE  1    TO WKS-FIN-B08A                              251600      
002548       ELSE                                                       251800      
002549          MOVE "ERROR LOCK FIRST B08SXFECMIG" TO WKS-DMS-DSCERR   252000      
002550          PERFORM 801000-DMTERMINATE.                             252200      
002551                                                                  252400      
002552 706010-LOCKF-B08SXFECNUMPRO.                                     252600      
002553*=================================                                252800      
002554   MOVE ZERO        TO WKS-FIN-B08A                               253000      
002555   LOCK FIRST B08SXFECNUMPRO AT                                   253200      
002556       B08-FEC-MIG =  WKS-FEC-MIG-S500-CAMD     AND               253400      
002557       B08-NUM-PRO =  W77-CANC-PROC                               253600      
002558   ON EXCEPTION                                                   253800      
002559      MOVE  1    TO WKS-FIN-B08A                                  254000      
002560      IF DMSTATUS(NOTFOUND)                                       254200      
002561         MOVE  1    TO WKS-FIN-B08A                               254400      
002562      ELSE                                                        254600      
002563         MOVE "ERROR LOCK FIRST B08SXFECNUMPROC" TO WKS-DMS-DSCERR254800      
002564         PERFORM 801000-DMTERMINATE.                              255000      
002565                                                                  255200      
002566 706010-LOCKNEXT-B08SXFECNUMPRO.                                  255400      
002567*=================================                                255600      
002568   MOVE ZERO        TO WKS-FIN-B08A                               255800      
002569   LOCK NEXT B08SXFECNUMPRO AT                                    256000      
002570       B08-FEC-MIG =  WKS-FEC-MIG-S500-CAMD     AND               256200      
002571       B08-NUM-PRO =  W77-CANC-PROC                               256400      
002572   ON EXCEPTION                                                   256600      
002573      MOVE  1    TO WKS-FIN-B08A                                  256800      
002574      IF DMSTATUS(NOTFOUND)                                       257000      
002575         MOVE  1    TO WKS-FIN-B08A                               257200      
002576      ELSE                                                        257400      
002577         MOVE "ERROR LOCK FIRST B08SXFECNUMPROC" TO WKS-DMS-DSCERR257600      
002578         PERFORM 801000-DMTERMINATE.                              257800      
002579                                                                  258000      
002580 706030-LOCKFIRST-B08SXFECAUT.                                    258200      
002581*===============================                                  258400      
002582   MOVE ZERO        TO WKS-FIN-B08A                               258600      
002583   LOCK FIRST B08SXFECAUT AT                                      258800      
002584       B08-FEC-MIG  =  WKS-FEC-MIG-S500-CAMD     AND              259000      
002585       B08-AUT-S151 >  W77-CANC-AUT-AELIM-S151   AND              259200      
002586       B08-NUM-PRO  =  W77-CANC-PROC                              259400      
002587   ON EXCEPTION                                                   259600      
002588       MOVE  1    TO WKS-FIN-B08A                                 259800      
002589       IF DMSTATUS(NOTFOUND)                                      260000      
002590          MOVE  1    TO WKS-FIN-B08A                              260200      
002591       ELSE                                                       260400      
002592          MOVE "ERROR LOCK FIRST B08SXFECAUT" TO WKS-DMS-DSCERR   260600      
002593          PERFORM 801000-DMTERMINATE.                             260800      
002594                                                                  261000      
002595 706030-LOCKNEXT-B08SXFECAUT.                                     261200      
002596*===============================                                  261400      
002597   MOVE ZERO        TO WKS-FIN-B08A                               261600      
002598   LOCK NEXT B08SXFECAUT AT                                       261800      
002599       B08-FEC-MIG  =  WKS-FEC-MIG-S500-CAMD     AND              262000      
002600       B08-AUT-S151 >  W77-CANC-AUT-AELIM-S151   AND              262200      
002601       B08-NUM-PRO  =  W77-CANC-PROC                              262400      
002602   ON EXCEPTION                                                   262600      
002603       MOVE  1    TO WKS-FIN-B08A                                 262800      
002604       IF DMSTATUS(NOTFOUND)                                      263000      
002605          MOVE  1    TO WKS-FIN-B08A                              263200      
002606       ELSE                                                       263400      
002607          MOVE "ERROR LOCK FIRST B08SXFECAUT" TO WKS-DMS-DSCERR   263600      
002608          PERFORM 801000-DMTERMINATE.                             263800      
002609                                                                  264000      
002610 709300-BEGIN-TRANS.                                              264200      
002611*===================                                              264400      
002612   BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL                     264600      
002613   ON EXCEPTION                                                   264800      
002614      MOVE "ERROR EN BEGIN TRANS " TO WKS-DMS-DSCERR              265000      
002615      PERFORM 801000-DMTERMINATE.                                 265200      
002616                                                                  265400      
002617 709600-END-TRANS.                                                265600      
002618*=================                                                265800      
002619   END-TRANSACTION AUDIT S151B99REINICTL                          266000      
002620   ON EXCEPTION                                                   266200      
002621      MOVE "ERROR EN END TRANS "  TO WKS-DMS-DSCERR               266400      
002622      PERFORM 801000-DMTERMINATE.                                 266600      
002623                                                                  266800      
002624 790000-CLOSE-DB.                                                 267000      
002625*================                                                 267200      
002626   CLOSE S151BD13BIFIN                                            267400      
002627   ON EXCEPTION                                                   267600      
002628      MOVE "ERROR AL CERRAR BD S151BD13BIFIN"  TO WKS-DIS-TEXTO   267800      
002629      PERFORM 901000-DISPLAY.                                     268000      
002630                                                                  268200      
002631                                                                  268400      
002632******************************************************************268600      
002633*                            800000ÀS                            *268800      
002634******************************************************************269000      
002635                                                                  269200      
002636 801000-DMTERMINATE.                                              269400      
002637*===================                                              269600      
002638   MOVE DMSTATUS(DMCATEGORY)     TO WKS-DMCATEGORY.               269800      
002639   MOVE DMSTATUS(DMERRORTYPE)    TO WKS-DMERRORTYPE.              270000      
002640   MOVE DMSTATUS(DMSTRUCTURE)    TO WKS-DMSTRUCTURE.              270200      
002641   STRING WKS-DMCATEGORY         DELIMITED BY SIZE,               270400      
002642   WKS-DMERRORTYPE               DELIMITED BY SIZE,               270600      
002643   WKS-DMSTRUCTURE               DELIMITED BY SIZE,               270800      
002644   "  :  "                       DELIMITED BY SIZE,               271000      
002645   WKS-DMS-DSCERR                DELIMITED BY SIZE                271200      
002646                                 INTO WKS-DIS-TEXTO.              271400      
002647   PERFORM 901000-DISPLAY                                         271600      
002648   MOVE SPACES                   TO TEXTO-LJ.                     271800      
002649   STRING WKS-DMS-DSCERR DELIMITED BY SIZE                        272000      
002650                         INTO TEXTO-LJ.                           272200      
002651   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.           272400      
002652   PERFORM 805000-ERROR-FATAL.                                    272600      
002653                                                                  272800      
002654 805000-ERROR-FATAL.                                              273000      
002655*=====================                                            273200      
002656   MOVE SPACES TO WKS-DIS-TEXTO                                   273400      
002657   IF DMSTATUS (SYSTEMERROR)                                      273600      
002658      MOVE "SYSTEM ERROR" TO WKS-DIS-TEXTO                        273800      
002659      PERFORM 901000-DISPLAY                                      274000      
002660      PERFORM 602000-TERMINA                                      274200      
002661   ELSE                                                           274400      
002662   IF DMSTATUS (OPENERROR)                                        274600      
002663      MOVE "OPEN ERROR" TO WKS-DIS-TEXTO                          274800      
002664      PERFORM 901000-DISPLAY                                      275000      
002665      PERFORM 602000-TERMINA                                      275200      
002666   ELSE                                                           275400      
002667   IF DMSTATUS (CLOSEERROR)                                       275600      
002668      MOVE "CLOSE ERROR" TO WKS-DIS-TEXTO                         275800      
002669      PERFORM 901000-DISPLAY                                      276000      
002670      PERFORM 602000-TERMINA                                      276200      
002671   ELSE                                                           276400      
002672   IF DMSTATUS (AUDITERROR)                                       276600      
002673      MOVE "AUDIT ERROR" TO WKS-DIS-TEXTO                         276800      
002674      PERFORM 901000-DISPLAY                                      277000      
002675      PERFORM 602000-TERMINA                                      277200      
002676   ELSE                                                           277400      
002677   IF DMSTATUS (VERSIONERROR)                                     277600      
002678      MOVE "VERSION ERROR" TO WKS-DIS-TEXTO                       277800      
002679      PERFORM 901000-DISPLAY                                      278000      
002680      PERFORM 602000-TERMINA.                                     278200      
002681                                                                  278400      
002682                                                                  278600      
002683******************************************************************278800      
002684*                            900000ÀS                            *279000      
002685******************************************************************279200      
002686                                                                  279400      
002687 901000-DISPLAY.                                                  279600      
002688   IF CONT-REG-DISPLAY = 6500                                     279800      
002689      CLOSE  L01-DISPLAY        WITH SAVE                         280000      
002690      ACCEPT WKS-HOR-MAQ-HMSD   FROM  TIME                        280200      
002691      MOVE   WKS-HOR-MAQ-HMSD   TO WKS-RUT-L01-HORA               280400      
002692      CHANGE ATTRIBUTE TITLE    OF L01-DISPLAY                    280600      
002693                                TO WKS-RUT-L01                    280800      
002694      OPEN  OUTPUT  L01-DISPLAY                                   281000      
002695      MOVE    1                 TO  CONT-REG-DISPLAY              281200      
002696      WRITE REG-DISPLAY         FROM REGISTRO-DIS-HEADER.         281400      
002697                                                                  281600      
002698   ADD    1                     TO  CONT-REG-DISPLAY              281800      
002699   ACCEPT WKS-HOR-MAQ-HMSD      FROM  TIME                        282000      
002700   ACCEPT WKS-DATO              FROM DATE                         282200      
002701   MOVE   20                    TO WKS-DIS-FECHA-S                282400      
002702   MOVE   WKS-DATO-AMO          TO WKS-DIS-FECHA-A                282600      
002703   MOVE   WKS-DATO-MES          TO WKS-DIS-FECHA-M                282800      
002704   MOVE   WKS-DATO-DIA          TO WKS-DIS-FECHA-D                283000      
002705   MOVE   WKS-HOR-MAQ-H         TO WKS-DIS-HORA                   283200      
002706   MOVE   WKS-HOR-MAQ-M         TO WKS-DIS-MINUTO                 283400      
002707   MOVE   WKS-DIS-TEXTO         TO WKS-DIS-MENSAJE                283600      
002708   WRITE  REG-DISPLAY FROM  REGISTRO-DIS-DETALLE.                 283800      
002709                                                                  284000      
002710*JDPG <INI> SE AGREGA RUTINA PARA BUSQUEDA DE FUNCION 2           284100      
002711 705000-FIND-B08SXFECTAR-F2.                                      284200      
002712*========================                                         284300      
002713   MOVE ZERO        TO WKS-FIN-B08                                284400      
002714   MOVE 0           TO W77-BAND-EXISTENCIA-B08                    284500      
002715   FIND FIRST B08SXFECTAR AT                                      284600      
002716       B08-FEC-MIG     = WKS-FEC-MIG-S500-CAMD AND                284605      
002717       B08-AUT-S151    = WKS-AUT-S151                             284700      
002718   ON EXCEPTION                                                   284800      
002719       MOVE  1    TO WKS-FIN-B08                                  284900      
002720       IF DMSTATUS(NOTFOUND)                                      285000      
002721          MOVE  1    TO W77-BAND-EXISTENCIA-B08                   285100      
002722          MOVE  1    TO WKS-FIN-B08                               285200      
002723       ELSE                                                       285300      
002724          MOVE "ERROR LOCK FIRST B08SXFECMIG" TO WKS-DMS-DSCERR   285400      
002725          PERFORM 801000-DMTERMINATE.                             285500      
002726                                                                  285600      
002727*JDPG <INI> SE AGREGA RUTINA PARA BUSQUEDA DE FUNCION 2           285700      
002728                                                                  285800      
002729 462300-PROCESA-FN-FUNCION2.                                      285900      
002730*===========================                                      286000      
002731 IF WKS-FIN-B08A = ZEROS                                          286100      
002732    MOVE B08-IMPORTE            TO WKS-IMPORTE-B08                286200      
002733    MOVE B08-TAR-BIN TO WKS-BIN-BUSQ                              286300      
002734    MOVE "CA"    TO B08-STATUS                                    286400      
002735    PERFORM 703000-STORE-B08                                      286500      
002736    PERFORM 462255-RESTA.                                         286600      
002737    PERFORM 705060-LOCK-NETX-B08SXFECTAR.                         286700      
002738                                                                  286800      
002739 705060-LOCK-NETX-B08SXFECTAR.                                    286900      
002740*=============================                                    287000      
002741   MOVE ZERO        TO WKS-FIN-B08A                               287100      
002742   MOVE 0           TO W77-BAND-EXISTENCIA-B08                    287200      
002743   LOCK NEXT B08SXFECTAR AT                                       287300      
002744       B08-FEC-MIG     = WKS-FEC-MIG-S500-CAMD AND                287400      
002745       B08-AUT-S151    = WKS-AUT-S151                             287500      
002746   ON EXCEPTION                                                   287600      
002747       MOVE  1    TO WKS-FIN-B08A                                 287700      
002748       IF DMSTATUS(NOTFOUND)                                      287800      
002749          MOVE  1    TO WKS-FIN-B08A                              287900      
002750       ELSE                                                       288000      
002751          MOVE "ERROR LOCK FIRST B08SXFECMIG" TO WKS-DMS-DSCERR   288100      
002752          PERFORM 801000-DMTERMINATE.                             288200      
