000001$SET LINEINFO OPTIMIZE LIST                                       000200      
000002*$SET TADS                                                        000250      
000003 IDENTIFICATION DIVISION.                                         000300      
000004*=================================================================000500      
000005*         PROGRAMA EJEMPLO DE LLAMADO A LA LIB. DE CONTROL       =000600      
000006*=================================================================000700      
000007                                                                  000800      
000008 PROGRAM-ID.             CALLLIBCTL.                              000900      
000009 ENVIRONMENT DIVISION.                                            001000      
000010                                                                  001100      
000011 DATA        DIVISION.                                            001200      
000012                                                                  001300      
000013 WORKING-STORAGE SECTION.                                         001400      
000014                                                                  001500      
000015*================================================================ 001600      
000016*         COPY A LOS FORMATOS DE LLAMADO PARA LIB. DE CONTROL   = 001700      
000017*================================================================ 001800      
000018                                                                  001900      
000019*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000020* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL.".                  002000      
000021*================================================================ 000100      
000022*         ENTRY-POINT CONSISDIA :                               = 000200      
000023*                                                                 000300      
000024* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000025* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000026* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000027* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000028* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000029* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000030* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000031* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000032* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000033* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000034*                                                               = 001400      
000035*================================================================ 001500      
000036                                                                  001600      
000037                                                                  001700      
000038*================================================================ 001800      
000039* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000040*                                                               = 002000      
000041* ENTRADA REQUERIDA :                                           = 002100      
000042*                                                               = 002200      
000043*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000044*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000045*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000046*================================================================ 002600      
000047 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000048    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000049    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000050    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000051    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000052    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000053    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000054    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000055    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000056    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000057    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000058    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000059    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000060    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000061    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000062    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000063    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000064    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000065    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000066    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000067    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000068       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000069       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000070       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000071       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000072*==============================================================   005200      
000073*                                                             =   005300      
000074* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000075*                                                             =   005500      
000076* CAMPOS REQUERIDOS :                                         =   005600      
000077*                                                             =   005700      
000078* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000079* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000080* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000081* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000082*==============================================================   006200      
000083 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000084    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000085    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000086    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000087    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000088                                                                  006800      
000089*==============================================================   006900      
000090*                                                             =   007000      
000091* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000092*                                                             =   007200      
000093* CAMPOS REQUERIDOS :                                         =   007300      
000094*                                                             =   007400      
000095* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000096* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000097* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000098* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000099*==============================================================   007900      
000100 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000101    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000102    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000103    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000104    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000105                                                                  008500      
000106*==============================================================   008600      
000107*                                                             =   008700      
000108* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000109*                                                             =   008900      
000110* CAMPOS REQUERIDOS :                                         =   009000      
000111*                                                             =   009100      
000112* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000113* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000114* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000115* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000116*==============================================================   009600      
000117 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000118    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000119    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000120    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000121    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000122                                                                  010200      
000123*============================================================     010300      
000124* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000125*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000126*                                                           =     010600      
000127*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000128*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000129*                                                           =     010900      
000130*  ENTRADA REQUERIDA.                                       =     011000      
000131*                                                           =     011100      
000132*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000133*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000134*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000135*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000136*============================================================     011600      
000137                                                                  011700      
000138 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000139     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000140     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000141     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000142     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000143                                                                  012300      
000144*=============================================================    012400      
000145*                                                            =    012500      
000146* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000147*             B01-SIS-FECARMOV.                              =    012700      
000148*                                                            =    012800      
000149* ENTRADA REQUERIDAD :                                       =    012900      
000150*                                                            =    013000      
000151*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000152*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000153*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000154*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000155*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000156*=============================================================    013600      
000157                                                                  013700      
000158 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000159     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000160     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000161     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000162     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000163     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000164*================================================================ 014400      
000165*                                                               = 014500      
000166* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000167*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000168*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000169*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000170*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000171*                                                               = 015100      
000172* ENTRADA REQUERIDA :                                           = 015200      
000173*                                                               = 015300      
000174* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000175* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000176* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000177* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000178* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000179*================================================================ 015900      
000180 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000181    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000182    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000183    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000184    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000185    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000186                                                                  016600      
000187*============================================================     016700      
000188*                                                           =     016800      
000189* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000190*                                                           =     017000      
000191* DATOS REQUERIDOS :                                        =     017100      
000192*                                                           =     017200      
000193* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000194* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000195* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000196* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000197* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000198*============================================================     017800      
000199                                                                  017900      
000200 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000201     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000202     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000203     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000204     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000205     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000206                                                                  018600      
000207*============================================================     018700      
000208*                                                           =     018800      
000209* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000210*                                                           =     019000      
000211* DATOS REQUERIDOS :                                        =     019100      
000212*                                                           =     019200      
000213* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000214* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000215* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000216* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000217* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000218*============================================================     019800      
000219                                                                  019900      
000220 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000221     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000222     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000223     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000224     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000225     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000226                                                                  020600      
000227*===============================================================  020700      
000228*                                                              =  020800      
000229* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000230*              MOVIMIENTOS.                                    =  021000      
000231* DATOS REQUERIDOS :                                           =  021100      
000232*                                                              =  021200      
000233* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000234* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000235* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000236* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000237* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000238* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000239*==============================================================   021900      
000240                                                                  022000      
000241 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000242     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000243     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000244     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000245     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000246     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000247     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000248*==============================================================   022800      
000249*                                                             =   022900      
000250* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000251*                                                             =   023100      
000252* CAMPOS REQUERIDOS :                                         =   023200      
000253*                                                             =   023300      
000254* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000255* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000256* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000257* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000258*==============================================================   023800      
000259 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000260    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000261    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000262    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000263    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000264                                                                  024304      
000265*=================================================================024306      
000266*                ENTRY POINT CONSISB01                           =024308      
000267*                                                                =024310      
000268*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000269*                                                                =024314      
000270*  FUNCIONES DISPONIBLES :                                       =024316      
000271*                                                                =024318      
000272*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000273*                                                                =024322      
000274*  PARAMETROS REQUERIDOS                                         =024324      
000275*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000276*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000277*=================================================================024330      
000278                                                                  024332      
000279 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000280     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000281     03 WKS-CON-CSI                PIC 9(02).                     024336      
000282     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000283     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000284        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000285        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000286        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000287        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000288        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000289                                                                  024400      
000290*=================================================================024500      
000291*                ENTRY POINT B02ARCINTER                         =024600      
000292*                                                                =024700      
000293*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000294*                                                                =024900      
000295*  FUNCIONES DISPONIBLES :                                       =025000      
000296*                                                                =025100      
000297*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000298* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000299* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000300* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000301*                                                                =025600      
000302*  PARAMETROS REQUERIDOS                                         =025700      
000303*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000304*                                                                =025900      
000305*=================================================================026000      
000306 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000307     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000308     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000309     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000310     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000311     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000312     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000313     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000314     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000315     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000316     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000317     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000318     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000319     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000320     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000321     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000322     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000323     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000324     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000325     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000326     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000327     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000328     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000329     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000330     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000331     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000332     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000333     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000334     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000335                                                                  029000      
000336*=================================================================029100      
000337*                ENTRY POINT B04SISTEMA                          =029200      
000338*                                                                =029300      
000339*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000340*                                                                =029500      
000341*  FUNCIONES DISPONIBLES :                                       =029600      
000342*                                                                =029700      
000343*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000344*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000345*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000346*                                                                =030100      
000347*  PARAMETROS REQUERIDOS                                         =030200      
000348*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000349*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000350*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000351*                                                                =030600      
000352*=================================================================030700      
000353 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000354     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000355     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000356     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000357     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000358     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000359     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000360     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000361                                                                  031600      
000362*================================================================ 031700      
000363*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000364*                                                               = 031900      
000365*  FUNCION                                                      = 032000      
000366*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000367*   19       ALTAS.                                             = 032200      
000368*   22       BAJAS                                              = 032300      
000369*   37       CAMBIOS.                                           = 032400      
000370*                                                               = 032500      
000371*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000372*                      FECHA DE PROCESO                         = 032700      
000373*                      NUMERO DE PROCESO                        = 032800      
000374*                      FECHA INICIO                             = 032900      
000375*                      REGISTRO INICIAL                         = 033000      
000376*================================================================ 033100      
000377                                                                  033200      
000378 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000379     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000380     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000381     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000382     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000383     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000384     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000385     03 WKS-B05-MIX                PIC 9(08).                     034000      
000386     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000387     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000388     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000389     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000390     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000391     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000392                                                                  034700      
000393                                                                  034800      
000394*================================================================ 034900      
000395*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000396*                                                               = 035100      
000397*  FUNCION                                                      = 035200      
000398*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000399*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000400*                                                               = 035500      
000401*================================================================ 035600      
000402                                                                  035700      
000403 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000404     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000405     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000406     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000407     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000408     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000409     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000410                                                                  036500      
000411*===============================================================  036600      
000412*                                                              =  036700      
000413*         ENTRY-POINT CONSISMEN                                =  036800      
000414*                                                              =  036900      
000415*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000416*                      SISTEMA                                 =  037100      
000417*                                                              =  037200      
000418*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000419*                                                              =  037400      
000420*===============================================================  037500      
000421 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000422     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000423     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000424     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000425     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000426     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000427     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000428     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000429     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000430     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000431     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000432     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000433     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000434     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000435     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000436     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000437        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000438        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000439        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000440        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000441        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000442        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000443        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000444                                                                  039900      
000445*=====================================================            040000      
000446*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000447*=====================================================            040200      
000448 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000449     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000450     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000451     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000452                                                                  040700      
000453*=====================================================            040800      
000454*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000455*=====================================================            041000      
000456 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000457     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000458     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000459     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000460                                                                  041500      
000461*=====================================================            041600      
000462*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000463*=====================================================            041800      
000464 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000465     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000466     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000467     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000468*=====================================================            042300      
000469*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000470*=====================================================            042500      
000471 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000472     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000473     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000474     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000475                                                                  043000      
000476*=====================================================            043100      
000477*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000478*=====================================================            043300      
000479 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000480     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000481     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000482     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000483                                                                  043800      
000484*=====================================================            043900      
000485*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000486*=====================================================            044100      
000487 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000488     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000489     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000490     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000491                                                                  044600      
000492*=====================================================            044700      
000493*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000494*=====================================================            044900      
000495 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000496     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000497     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000498     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000499                                                                  045400      
000500*=====================================================            045500      
000501*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000502*=====================================================            045700      
000503 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000504     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000505     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000506     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000507                                                                  046200      
000508*=====================================================            046300      
000509*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000510*=====================================================            046500      
000511 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000512     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000513     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000514     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000515                                                                  047000      
000516*=====================================================            047100      
000517*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000518*=====================================================            047300      
000519 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000520     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000521     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000522     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000523                                                                  047800      
000524*=====================================================            047900      
000525*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000526*=====================================================            048100      
000527 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000528     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000529     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000530     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000531                                                                  048600      
000532*=====================================================            048700      
000533*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000534*=====================================================            048900      
000535 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000536     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000537     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000538     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000539                                                                  049400      
000540*=====================================================            049500      
000541*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000542*=====================================================            049700      
000543 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000544     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000545     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000546     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000547     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000548     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000549     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000550     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000551     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000552     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000553     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000554                                                                  050900      
000555*=====================================================            051000      
000556*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000557*=====================================================            051200      
000558 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000559     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000560     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000561     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000562     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000563                                                                  051800      
000564*=====================================================            051900      
000565*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000566*=====================================================            052100      
000567 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000568     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000569     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000570     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000571     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000572                                                                  052700      
000573*=====================================================            052800      
000574*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000575*=====================================================            053000      
000576 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000577     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000578     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000579     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000580     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
000581                                                                  053600      
000582*=====================================================            053700      
000583*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
000584*=====================================================            053900      
000585 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
000586     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
000587     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
000588     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
000589     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
000590                                                                  054500      
000591*=====================================================            054600      
000592*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
000593*=====================================================            054800      
000594 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
000595     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
000596     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
000597     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
000598     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
000599                                                                  055400      
000600*=====================================================            055500      
000601*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
000602*=====================================================            055700      
000603 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
000604     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
000605     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
000606     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
000607     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
000608                                                                  056300      
000609*=====================================================            056400      
000610*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
000611*=====================================================            056600      
000612 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
000613     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
000614     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
000615     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
000616     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
000617                                                                  057200      
000618 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
000619*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000620                                                                  002100      
000621*================================================================ 002200      
000622*         VARIABLE PARA LIBRERIA SOPORTECOMS                    = 002300      
000623*================================================================ 002400      
000624                                                                  002500      
000625 01 WKS-TABLA-FECHAS.                                             002510      
000626    03 WKS-TAB-FECHAS OCCURS 50 TIMES.                            002520      
000627       05 WKS-TAB-SISTEMA          PIC 9(03).                     002525      
000628       05 WKS-TAB-FECCON           PIC 9(08).                     002530      
000629       05 WKS-TAB-FECPRO           PIC 9(08).                     002540      
000630       05 WKS-TAB-FEC151           PIC 9(08).                     002550      
000631       05 WKS-TAB-FECL002          PIC 9(08).                     002560      
000632       05 WKS-TAB-RECIBIDOS        PIC 9(08).                     002563      
000633 01 WKS-FECHA-LIBS.                                               002565      
000634       05 WKS-TAB-FECL012          PIC 9(08).                     002566      
000635       05 WKS-TAB-ENVL012          PIC 9(08).                     002567      
000636       05 WKS-TAB-CONFL012         PIC 9(08).                     002568      
000637       05 WKS-TAB-FECL009          PIC 9(08).                     002569      
000638       05 WKS-TAB-ENVL009          PIC 9(08).                     002570      
000639       05 WKS-TAB-CONFL009         PIC 9(08).                     002580      
000640                                                                  002590      
000641 01  WKS-HOST.                                                    002600      
000642     03 WKS-NUMCSI                 PIC 9(02).                     002700      
000643     03 WKS-NOM-HOST               PIC X(10).                     002800      
000644     03 WKS-NOM-CSI                PIC X(26).                     002900      
000645     03 WKS-LINEA-BATCH            PIC X(05).                     003000      
000646 01  WKS-LIBID                     PIC X(12).                     003100      
000647 01  WKS-NOMLIB                    PIC X(72).                     003200      
000648 01  WKS-ERROR                     PIC X(04).                     003250      
000649 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             003300      
000650 77  W77-IND                       PIC 9(02).                     003400      
000651 77  W77-IND2                      PIC 9(02).                     003420      
000652 77  W77-FIN                       PIC 9(02).                     003450      
000653 01  WKS-PARAM-FECHA               PIC 9(08).                     003470      
000654 01  WKS-LIBID-L002.                                              003472      
000655     03 FILLER                     PIC X(09) VALUE "S151L002R".   003473      
000656     03 WKS-SIS-L002               PIC 9(03).                     003474      
000657 01  WKS-TOTALES.                                                 003475      
000658     03 WKS-TOT-RECIBIDOS          PIC 9(08).                     003476      
000659     03 WKS-TOT-ENV-L012           PIC 9(08).                     003477      
000660     03 WKS-TOT-CONF-L012          PIC 9(08).                     003478      
000661     03 WKS-TOT-ENV-L009           PIC 9(08).                     003479      
000662     03 WKS-TOT-CONF-L009          PIC 9(08).                     003480      
000663 01  WKS-S151-DATOS WITH LOWER-BOUNDS.                            003481      
000664     03 WKS-DEL-FUNCION            PIC 9(04).                     003482      
000665     03 WKS-DEL-INDICE             PIC 9(02).                     003484      
000666     03 WKS-DEL-FEC-LINEA          PIC 9(08).                     003486      
000667     03 WKS-DEL-RECIBIDOS          PIC 9(08).                     003488      
000668     03 WKS-DEL-ENVIADOS           PIC 9(08).                     003490      
000669     03 WKS-DEL-CONFIRMADOS        PIC 9(08).                     003491      
000670 01  WKS-FECHA-L002                PIC 9(06).                     003492      
000671 01  WKS-S151-L009 WITH LOWER-BOUNDS.                             003493      
000672     03 WKS-L009-FUNCION            PIC 9(02).                    003494      
000673     03 WKS-L009-FECHA              PIC 9(08).                    003495      
000674     03 WKS-L009-ENVIADOS           PIC 9(08).                    003496      
000675     03 WKS-L009-CONFIRMADOS        PIC 9(08).                    003497      
000676                                                                  004000      
000677*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000678* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           005000      
000679**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000680  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000681  01 MENSAJE-LJ.                                                  100300      
000682     02 SISTEMA-LJ     PIC X(04).                                 100400      
000683     02 FILLER         PIC X VALUE "/".                           100500      
000684     02 PASO-LJ        PIC X(04).                                 100600      
000685     02 FILLER         PIC X VALUE "/".                           100700      
000686     02 MTP-LJ         PIC 9(03).                                 100800      
000687     02 FILLER         PIC X VALUE ":".                           100900      
000688     02 TIPO-LJ        PIC X.                                     101000      
000689     02 FILLER         PIC X VALUE ">".                           101100      
000690     02 CODIGO-LJ      PIC 9(06).                                 101200      
000691     02 FILLER         PIC X VALUE "<".                           101300      
000692     02 TEXTO-LJ       PIC X(250).                                101400      
000693*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000694                                                                  006000      
000695                                                                  007000      
000696*************************************************************     008000      
000697******      INICIA PROCEDURE DIVISION.                 ******     009000      
000698*************************************************************     010000      
000699 PROCEDURE DIVISION.                                              011000      
000700 000100-INICIO.                                                   012000      
000701     IF ATTRIBUTE VALUE OF MYSELF = 0                             013000      
000702        NEXT SENTENCE                                             014000      
000703     ELSE                                                         015000      
000704        MOVE ATTRIBUTE VALUE OF MYSELF TO WKS-PARAM-FECHA.        016000      
000705                                                                  017000      
000706     PERFORM 000200-LIBRERIAS.                                    018000      
000707     MOVE "S151" TO SISTEMA-LJ.                                   019000      
000708     MOVE "P600" TO PASO-LJ.                                      020000      
000709     MOVE  005   TO MTP-LJ.                                       021000      
000710     MOVE "I"    TO TIPO-LJ.                                      022000      
000711     MOVE 020201 TO CODIGO-LJ.                                    023000      
000712     MOVE 1                      TO WKS-CON-FUNCION.              024000      
000713     MOVE ZERO                   TO WKS-CON-CSI.                  025000      
000714     MOVE LOW-VALUES             TO WKS-B04SISTEMA .              026000      
000715     PERFORM 000300-LLAMA-LIBCTL.                                 027000      
000716     PERFORM 000500-DSP-FECHAS   VARYING W77-IND2 FROM 1 BY 1     028000      
000717                                 UNTIL W77-IND2 > W77-IND.        029000      
000718     PERFORM 000500-DSP-LIBRERIAS .                               030000      
000719     CANCEL "LIBCTL".                                             031000      
000720     STOP RUN.                                                    032000      
000721                                                                  033000      
000722 000200-LIBRERIAS.                                                034000      
000723*=================                                                035000      
000724     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     036000      
000725     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      037000      
000726     CHANGE ATTRIBUTE LIBACCESS OF "SOPORTECOMS" TO BYFUNCTION.   038000      
000727     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS"               039000      
000728                                   TO "SOPORTECOMS".              040000      
000729     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"  TO                     041000      
000730            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".      042000      
000731     CALL "CSIID OF SOPORTECOMS" USING WKS-HOST.                  043000      
000732     CANCEL "SOPORTECOMS".                                        044000      
000733     IF WKS-NUMCSI = 32                                           045000      
000734        MOVE 10                    TO WKS-NUMCSI.                 046000      
000735     MOVE "S151L001CTL"            TO WKS-LIBID.                  047000      
000736     CALL "DAME_TIT IN CTLVER" USING WKS-LIBID, WKS-NOMLIB        048000      
000737                               GIVING W77-ERR-CTLVER.             049000      
000738     IF W77-ERR-CTLVER = 0                                        050000      
000739        CHANGE ATTRIBUTE TITLE OF "LIBCTL" TO WKS-NOMLIB          051000      
000740     ELSE                                                         052000      
000741        CHANGE ATTRIBUTE TITLE OF "LIBCTL" TO                     053000      
000742        "(S151)S151/OBJECT/L001/CONTROL  ON CMEMP".               054000      
000743                                                                  055000      
000744     CANCEL "SOPORTECOMS".                                        056000      
000745     CANCEL "CTLVER".                                             057000      
000746                                                                  058000      
000747 000300-LLAMA-LIBCTL.                                             059000      
000748*====================                                             060000      
000749*=================================================================061000      
000750*         SE ESTABLECEN LOS VALORES Y FUNCION A EFECTUAR         =062000      
000751*=================================================================063000      
000752     MOVE 0                        TO W77-RESULT-LIBCON           064000      
000753     MOVE LOW-VALUES               TO WKS-B04SISTEMA.             065000      
000754     MOVE ZEROS                    TO WKS-B04-SISTEMA             066000      
000755                                      WKS-B04-PRODUCTO            067000      
000756                                      WKS-B04-INSTRUM.            068000      
000757     MOVE 02                       TO WKS-B04-FUNCION.            069000      
000758     CALL "B04SISTEM IN LIBCTL"       USING  WKS-B04SISTEMA       070000      
000759                                      GIVING W77-RESULT-LIBCON.   071000      
000760                                                                  072000      
000761     PERFORM 000310-CALL-L001 UNTIL W77-FIN = 1.                  073000      
000762*=================================================================074000      
000763*         SE LLAMA A LA LIBRERIA DE CONTROL                      =075000      
000764*=================================================================076000      
000765                                                                  077000      
000766 000310-CALL-L001.                                                078000      
000767*===================                                              079000      
000768    MOVE WKS-B04-SISTEMA          TO WKS-B03-SISTEMA              080000      
000769                                     WKS-B01-SISTEMA.             081000      
000770    MOVE 01                       TO WKS-B03-FUNCION.             082000      
000771    CALL "CONSISMEN IN LIBCTL     " USING  WKS-S151B03SISMEN      083000      
000772                                    GIVING W77-RESULT-LIBCON.     084000      
000773    IF W77-RESULT-LIBCON = 0                                      085000      
000774       MOVE 01                       TO WKS-B01-FUNCION           086000      
000775       CALL "CONSISDIA IN LIBCTL  " USING  WKS-S151B01SISDIA      087000      
000776                                    GIVING W77-RESULT-LIBCON      088000      
000777       IF W77-RESULT-LIBCON = 0 AND                               089000      
000778         (WKS-B04-ESTATUS   = 3 OR 5) AND                         090000      
000779         (WKS-B03-RESCSI    = WKS-NUMCSI  OR                      091000      
000780          WKS-B03-MODSIS    =  0)                                 092000      
000781          ADD 1                  TO W77-IND                       093000      
000782          PERFORM 000400-LLAMA-L002                               094000      
000783          MOVE WKS-B01-SISTEMA   TO WKS-TAB-SISTEMA(W77-IND)      095000      
000784          MOVE WKS-B01-FECCON    TO WKS-TAB-FECCON (W77-IND)      096000      
000785          MOVE WKS-B01-FECPRO    TO WKS-TAB-FECPRO (W77-IND)      097000      
000786          MOVE WKS-B01-FECPRO151 TO WKS-TAB-FEC151 (W77-IND).     098000      
000787                                                                  099000      
000788    MOVE ZERO                     TO W77-RESULT-LIBCON.           100000      
000789    MOVE 02                       TO WKS-B04-FUNCION.             101000      
000790    MOVE ZERO                     TO WKS-B04-PRODUCTO             102000      
000791                                     WKS-B04-INSTRUM.             103000      
000792    CALL "B04SISTEM   IN LIBCTL" USING  WKS-B04SISTEMA            104000      
000793                                 GIVING W77-RESULT-LIBCON.        105000      
000794    IF W77-RESULT-LIBCON > 0                                      106000      
000795       MOVE 1                    TO W77-FIN.                      107000      
000796                                                                  108000      
000797  000400-LLAMA-L002.                                              109000      
000798*===================                                              110000      
000799     MOVE WKS-B01-SISTEMA          TO WKS-SIS-L002.               111000      
000800     MOVE WKS-LIBID-L002           TO WKS-LIBID.                  112000      
000801     CALL "DAME_TIT IN CTLVER"     USING  WKS-LIBID,              113000      
000802                                          WKS-NOMLIB              114000      
000803                                   GIVING W77-ERR-CTLVER.         115000      
000804     IF W77-ERR-CTLVER = 0                                        116000      
000805        CHANGE ATTRIBUTE TITLE  OF "LIB-L002" TO WKS-NOMLIB       117000      
000806     ELSE                                                         118000      
000807        CHANGE ATTRIBUTE TITLE  OF "LIB-L002" TO                  119000      
000808        "(S151)S151/OBJECT/L002/REGISTRA ON CMEMP".               120000      
000809    MOVE 5                       TO WKS-DEL-FUNCION.              121000      
000810    CALL "CONTROLES IN LIB-L002" USING  WKS-S151-DATOS            122000      
000811                                 GIVING W77-RESULT-LIBCON.        123000      
000812    IF W77-RESULT-LIBCON = 0                                      124000      
000813       MOVE WKS-DEL-FEC-LINEA     TO WKS-TAB-FECL002(W77-IND)     125000      
000814       MOVE WKS-DEL-RECIBIDOS     TO WKS-TAB-RECIBIDOS(W77-IND).  126000      
000815                                                                  127000      
000816                                                                  128000      
000817    IF WKS-B01-SISTEMA = 500                                      129000      
000818       MOVE 1                       TO WKS-DEL-FUNCION            129200      
000819       CALL "CONTROLES IN LIB-L002" USING  WKS-S151-DATOS         129400      
000820                                 GIVING W77-RESULT-LIBCON         129600      
000821       PERFORM 000420-LLAMA-L009                                  130000      
000822       PERFORM 000440-LLAMA-L012.                                 131000      
000823   CANCEL "LIB-L002".                                             131500      
000824                                                                  132000      
000825 000420-LLAMA-L009.                                               133000      
000826*==================                                               134000      
000827    MOVE "S151L009"               TO WKS-LIBID.                   135000      
000828    CALL "DAME_TIT IN CTLVER"     USING  WKS-LIBID,               136000      
000829                                         WKS-NOMLIB               137000      
000830                                  GIVING W77-ERR-CTLVER.          138000      
000831    IF W77-ERR-CTLVER = 0                                         139000      
000832       CHANGE ATTRIBUTE TITLE       OF "LIB-L009" TO WKS-NOMLIB   140000      
000833       MOVE 5                       TO WKS-L009-FUNCION           141000      
000834       CALL "FUNCIONES IN LIB-L009" USING  WKS-S151-L009          142000      
000835                                    GIVING W77-RESULT-LIBCON      143000      
000836       IF W77-RESULT-LIBCON = 0                                   144000      
000837          MOVE WKS-L009-FECHA       TO WKS-TAB-FECL009            145000      
000838          MOVE WKS-L009-ENVIADOS    TO WKS-TAB-ENVL009            146000      
000839          MOVE WKS-L009-CONFIRMADOS TO WKS-TAB-CONFL009.          147000      
000840                                                                  147100      
000841*    IF W77-ERR-CTLVER = 0                                        147200      
000842*       CHANGE ATTRIBUTE TITLE       OF "LIB-L009" TO WKS-NOMLIB  147300      
000843*       MOVE 1                       TO WKS-L009-FUNCION          147400      
000844*       CALL "FUNCIONES IN LIB-L009" USING  WKS-S151-L009         147500      
000845*                                    GIVING W77-RESULT-LIBCON.    147600      
000846                                                                  147700      
000847    CANCEL "LIB-L009".                                            148000      
000848  000440-LLAMA-L012.                                              149000      
000849*==================                                               150000      
000850    MOVE "S151L012"                 TO WKS-LIBID.                 151000      
000851    CALL "DAME_TIT IN CTLVER"       USING  WKS-LIBID,             152000      
000852                                           WKS-NOMLIB             153000      
000853                                    GIVING W77-ERR-CTLVER.        154000      
000854    IF W77-ERR-CTLVER = 0                                         155000      
000855       CHANGE ATTRIBUTE TITLE       OF "LIB-L012" TO WKS-NOMLIB   156000      
000856       MOVE 5                       TO WKS-L009-FUNCION           157000      
000857       CALL "FUNCIONL12 IN LIB-L012" USING  WKS-S151-L009         158000      
000858                                     GIVING W77-RESULT-LIBCON     159000      
000859       IF W77-RESULT-LIBCON = 0                                   160000      
000860          MOVE WKS-L009-FECHA       TO WKS-TAB-FECL012            161000      
000861          MOVE WKS-L009-ENVIADOS    TO WKS-TAB-ENVL012            162000      
000862          MOVE WKS-L009-CONFIRMADOS TO WKS-TAB-CONFL012.          163000      
000863                                                                  163100      
000864    IF W77-ERR-CTLVER = 0                                         163200      
000865       CHANGE ATTRIBUTE TITLE       OF "LIB-L012" TO WKS-NOMLIB   163300      
000866       MOVE 1                       TO WKS-L009-FUNCION           163400      
000867       CALL "FUNCIONL12 IN LIB-L012" USING  WKS-S151-L009         163500      
000868                                     GIVING W77-RESULT-LIBCON.    163600      
000869    CANCEL "LIB-L012".                                            164000      
000870                                                                  165000      
000871 000500-DSP-FECHAS.                                               166000      
000872*==================                                               167000      
000873    STRING "S"   WKS-TAB-SISTEMA(W77-IND2)                        168000      
000874            " Linea "  WKS-TAB-FECCON (W77-IND2)                  169000      
000875            " Batch "  WKS-TAB-FECPRO (W77-IND2)                  170000      
000876            " S151 "   WKS-TAB-FEC151 (W77-IND2)                  171000      
000877            " L002 "    WKS-TAB-FECL002(W77-IND2)                 172000      
000878            " REG. "    WKS-TAB-RECIBIDOS(W77-IND2)               173000      
000879    DELIMITED BY SIZE                                             174000      
000880    INTO TEXTO-LJ.                                                175000      
000881    PERFORM 800000-DISPLAY.                                       176000      
000882 000500-DSP-LIBRERIAS.                                            177000      
000883       STRING "L009"                                              178000      
000884               " FEC "  WKS-TAB-FECL009                           179000      
000885               " ENV "  WKS-TAB-ENVL009                           180000      
000886               " CONF " WKS-TAB-CONFL009                          181000      
000887       DELIMITED BY SIZE                                          182000      
000888       INTO TEXTO-LJ.                                             183000      
000889       PERFORM 800000-DISPLAY.                                    184000      
000890       STRING "L012"                                              185000      
000891               " FEC "  WKS-TAB-FECL012                           186000      
000892               " ENV "  WKS-TAB-ENVL012                           187000      
000893               " CONF " WKS-TAB-CONFL012                          188000      
000894       DELIMITED BY SIZE                                          189000      
000895       INTO TEXTO-LJ.                                             190000      
000896       PERFORM 800000-DISPLAY.                                    191000      
000897                                                                  192000      
000898*=================================================================193000      
000899*==               DISPLAY DE MENSAJES                          ===194000      
000900*=================================================================195000      
000901                                                                  198000      
000902 800000-DISPLAY.                                                  199000      
000903     CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         201000      
