000100$SET SHARING = SHAREDBYALL TEMPORARY FEDLEVEL=5                               
000200$SET LIST LINEINFO MAP                                                        
000210$$SET LIBRARYLOCK                                                             
000220$$SHARING=PRIVATE                                                             
000250%***************************************************************              
000252% RECO PILACION POR EL UPGRADE DEL MCP A 55                    *              
000254% 20141205 15MTP001 MJGRG                                      *              
000256%***************************************************************              
000300 IDENTIFICATION DIVISION.                                                     
000400 PROGRAM-ID. S151L014.                                                        
000500 AUTHOR. VMLM.                                                                
000600 ENVIRONMENT DIVISION.                                                        
000610 CONFIGURATION SECTION.                                                       
000620 SOURCE-COMPUTER. B6800.                                                      
000630 OBJECT-COMPUTER. B6800.                                                      
000640 SPECIAL-NAMES.                                                               
000700 INPUT-OUTPUT SECTION.                                                        
000800 FILE-CONTROL.                                                                
000900 DATA DIVISION.                                                               
001000 FILE SECTION.                                                                
001100                                                                              
001200 DATA-BASE SECTION.                                                           
001300 DB  S151BD13BIFIN.                                                           
001400 01 S151B07PROTCOB.                                                           
001410*<INICIO RMT> NUEVA ESTRUCTURA PARA PANTALLA 29                               
001450 01 S151B08TDMIGCAP.                                                          
001590*<FIN>                                                                        
001600                                                                              
001610*<INI LBM> NUEVA ESTRUCTURA PARA PANTALLA 30                                  
001650 01 S151B10DOMI.                                                              
001690*<FIN LBM> NUEVA ESTRUCTURA PARA PANTALLA 30                                  
001700 WORKING-STORAGE SECTION.                                                     
001800                                                                              
001900 77 SW-PRIMER-CALL                      PIC 9(02) VALUE 0.                    
002000 77 WS-VECES                            PIC 9(02) VALUE 0.                    
002100 77 WS-BANDERA                          PIC 9(02) VALUE 0.                    
002200 77 WS-FIN                              PIC 9     VALUE 0.                    
002300                                                                              
002400 77 WS-OK                               PIC 9     VALUE 0.                    
002500 77 WS-MISMA-CONS                       PIC 9     VALUE 0.                    
002600 77 WS-CONT                             PIC 9(02) VALUE 0.                    
002700 77 WS-CASO                             PIC 9     VALUE 0.                    
002720*<INI LBM> BANDERA PARA IDENTIFICAR FIN DE BUSQUEDA EN ESTRUCTURA B10 DOM     
002725 77 END-BD10                            PIC 9     VALUE 0.                    
002730*<FIN LBM> SE IDENTIFICA CRITERIO DE BUSQUEDA                                 
002800 77 WS-TERMINA                          PIC 9     VALUE 0.                    
003100                                                                              
003200******************************************************************            
003300*         REGISTROS PARA LA RUTINA DE FECHAS (CALENDAR)          *            
003400******************************************************************            
003500 77 WKS-CAL-FUNCION               PIC S9(11) BINARY.                          
003600 77 WKS-CAL-FORMATO               PIC S9(11) BINARY.                          
003700                                                                              
003800 01 WKS-CAL-FECHA1                PIC  9(08).                                 
003900                                                                              
004000 01 WKS-CAL-FECHA1-RED            REDEFINES                                   
004100    WKS-CAL-FECHA1.                                                           
004200    03 WKS-CAL-ANO1-RED           PIC  9(04).                                 
004300    03 WKS-CAL-MES1-RED           PIC  9(02).                                 
004400    03 WKS-CAL-DIA1-RED           PIC  9(02).                                 
004500                                                                              
004600 01 WKS-CAL-FECHA2                PIC  9(08).                                 
004700                                                                              
004800 01 WKS-CAL-FECHA2-RED            REDEFINES                                   
004900    WKS-CAL-FECHA2.                                                           
005000    03 WKS-CAL-ANO2-RED           PIC  9(04).                                 
005100    03 WKS-CAL-MES2-RED           PIC  9(02).                                 
005200    03 WKS-CAL-DIA2-RED           PIC  9(02).                                 
005400                                                                              
005404*<INI LBM> BARIABLES PANTALLA 30                                              
005405 01 WKS-FECHAI-30-CONS            PIC 9(08).                                  
005406 01 WKS-FEC-30-CONS-R REDEFINES WKS-FECHAI-30-CONS.                           
005407    02 WKS-FECHAI-30-CONS-AA      PIC 9(02).                                  
005408    02 WKS-FECHAI-30-CONS-AAMMDD  PIC 9(06).                                  
005412 01 WKS-FECHAF-30-CONS            PIC 9(08).                                  
005416 01 WKS-FEC-30-CONF-R REDEFINES WKS-FECHAF-30-CONS.                           
005418    02 WKS-FECHAF-30-CONS-AA      PIC 9(02).                                  
005420    02 WKS-FECHAF-30-CONS-AAMMDD  PIC 9(06).                                  
005422 01 WKS-SUC-30-CONS               PIC 9(04).                                  
005424 01 WKS-CTA-30-CONS               PIC 9(16).                                  
005426 01 WKS-AUTS151-30-CONS           PIC 9(08).                                  
005428 01 WKS-AUTAPL-30-CONS            PIC 9(08).                                  
005432 01 WKS-CONTRATO-30-CONS          PIC 9(16).                                  
005436 01 WKS-NUMOCUR-30-CONS           PIC 9(02).                                  
005438 01 WKS-NUMSUC-CTA-CONS           PIC 9(20).                                  
005446 01 WKS-FECHAR-30-FORM            PIC 9(08).                                  
005448 01 WKS-FEC-30-REP-R REDEFINES WKS-FECHAR-30-FORM.                            
005450    02 WKS-FECHAR-30-FORM-AA      PIC 9(02).                                  
005452    02 WKS-FECHAR-30-FORM-AAMMDD  PIC 9(06).                                  
005454 01 WKS-PERIODO-30                PIC 9(01).                                  
005464*<FIN LBM> BARIABLES PANTALLA 30                                              
005500**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ                  
005600 77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                               
005700                                                                              
005800 01 MENSAJE-LJ.                                                               
005900     02 SISTEMA-LJ     PIC X(04).                                             
006000     02 FILLER         PIC X VALUE "/".                                       
006100     02 PASO-LJ        PIC X(04).                                             
006200     02 FILLER         PIC X VALUE "/".                                       
006300     02 MTP-LJ         PIC 9(03).                                             
006400     02 FILLER         PIC X VALUE ":".                                       
006500     02 TIPO-LJ        PIC X.                                                 
006600     02 FILLER         PIC X VALUE ">".                                       
006700     02 CODIGO-LJ      PIC 9(06).                                             
006800     02 FILLER         PIC X VALUE "<".                                       
006900     02 TEXTO-LJ       PIC X(250).                                            
007000                                                                              
007100 01 WKS-FECHA-CONS                PIC 9(06).                                  
007160*<INICIO JMLT>VARIABLE DEL NUMERO DE CLIENTE                                  
007220 01 WKS-NUMCTE-CONS               PIC 9(12).                                  
007280*<FIN JMLT>VARIABLE DEL NUMERO DE CLIENTE                                     
007300 01 WKS-CONTRATO-CONS             PIC 9(16).                                  
007400 01 WKS-AUTORIZA-CONS             PIC 9(08).                                  
007410 01 WKS-OCCURS-CONS               PIC 9(02).                                  
007500 01 WKS-SAL-ERRLEY                PIC X(50).                                  
007505*<INICIO JMLT>VARIABLE PARA NUMERO DE SERVICIO Y DATOS GENERALES              
007510 01 WKS-SERVICIO                  PIC 9(02).                                  
007515 01 WKS-DATGEN.                                                               
007520          03 WKS-PROD             PIC 9(04).                                  
007525          03 WKS-INST             PIC 9(02).                                  
007530          03 WKS-MDE              PIC 9(02).                                  
007535          03 WKS-SUC              PIC 9(04).                                  
007540          03 WKS-CAJA             PIC 9(04).                                  
007545          03 WKS-IMP              PIC 9(16)V99.                               
007550          03 WKS-SDOF             PIC S9(15)V99.                              
007555          03 WKS-HORADG           PIC 9(06).                                  
007556          03 WKS-NAT              PIC 9(02).                                  
007558* INI ISI VMR REDEFINICION PARA OBTENER FECHAS                                
007560          03 FILLER               PIC X(13).                                  
007562          03 WKS-FECHA-NATURAL.                                               
007564            05 WKS-FECNAT-AA      PIC 9(02).                                  
007566            05 WKS-FECNAT-MM      PIC 9(02).                                  
007568            05 WKS-FECNAT-DD      PIC 9(02).                                  
007570          03 WKS-HRS-MAQ.                                                     
007572            05 WKS-HRS-MAQHH      PIC 9(02).                                  
007574            05 WKS-HRS-MAQMM      PIC 9(02).                                  
007576            05 WKS-HRS-MAQSS      PIC 9(02).                                  
007578          03 WKS-FEC-NAT-CAN.                                                 
007580            05 WKS-FNCAN-AA       PIC 9(02).                                  
007582            05 WKS-FNCAN-MM       PIC 9(02).                                  
007584            05 WKS-FNCAN-DD       PIC 9(02).                                  
007586          03 WKS-HRS-CAN.                                                     
007588            05 WKS-HRS-CANHH      PIC 9(02).                                  
007590            05 WKS-HRS-CANMM      PIC 9(02).                                  
007592            05 WKS-HRS-CANSS      PIC 9(02).                                  
007594          03 FILLER               PIC X(50).                                  
007596*         03 FILLER               PIC X(90).                                  
007598* FIN ISI VMR                                                                 
007600*<FIN JMLT>VARIABLE PARA NUMERO DE SERVICIO                                   
007602                                                                              
007605 01 WKS-HORA          PIC X(06).                                              
007607 01 WKS-HORA-R        REDEFINES  WKS-HORA.                                    
007610     02 WKS-HH        PIC 9(02).                                              
007615     02 WKS-MM        PIC 9(02).                                              
007620     02 WKS-SS        PIC 9(02).                                              
007625                                                                              
007630 01 WKS-HORA-SAL.                                                             
007635     02 WKS-HH-SAL    PIC 9(02).                                              
007640     02 FILLER        PIC X VALUE ":".                                        
007645     02 WKS-MM-SAL    PIC 9(02).                                              
007650                                                                              
007652*<INICIO RMT> VARIABLES PANTALLA 29                                           
007654 77 W77-OPC-BUS-MIG           PIC 9(01).                                      
007656    88 W88-X-FEC              VALUE 1.                                        
007658    88 W88-X-FEC-SUC-CTO      VALUE 2.                                        
007660    88 W88-X-FEC-SUC-CTA      VALUE 3.                                        
007662    88 W88-X-FEC-TAR          VALUE 4.                                        
007664    88 W88-X-FEC-BIN          VALUE 5.                                        
007666    88 W88-X-BIN              VALUE 6.                                        
007668 77 WKS-B08                   PIC 9(01).                                      
007670 01 WKS-CONS-FEC              PIC 9(08).                                      
007672 01 WKS-CONS-AUT151           PIC 9(08).                                      
007674 01 WKS-CONS-CVETRAN          PIC 9(04).                                      
007676 01 WKS-CONS-IMPORTE          PIC 9(07)V99.                                   
007677 01 WKS-CONS-SUC              PIC 9(04).                                      
007678 01 WKS-CONS-CTOCTA           PIC 9(16).                                      
007679 01 WKS-CONS-CTOCTA-R REDEFINES WKS-CONS-CTOCTA.                              
007680    03 WKS-CONS-CTOCTA-6      PIC 9(06).                                      
007681    03 WKS-CONS-CTOCTA-10     PIC 9(10).                                      
007682 01 WKS-CONS-SUCMDA           PIC 9(04).                                      
007683 01 WKS-CONS-TAR              PIC 9(16).                                      
007684 01 WKS-CONS-TAR-R REDEFINES WKS-CONS-TAR.                                    
007685    03 WKS-CONS-TAR-BIN       PIC 9(06).                                      
007686    03 WKS-CONS-TAR-CTA       PIC 9(10).                                      
007687 01 WKS-CONS-BIN              PIC 9(06).                                      
007688 01 WKS-CONS-SM               PIC X(02).                                      
007690 01 WKS-CONS-NUMOCC           PIC 9(02).                                      
007692 01 WKS-CONS-MAS              PIC 9(01).                                      
007693 77 WKS-MISMA-CONSULTA        PIC 9(01).                                      
007694*<FIN RMT> VARIABLES PANTALLA 29                                              
007700 LINKAGE SECTION.                                                             
007800                                                                              
007900******************************************************************            
008000*             AREA PARA LA CONSULTA DE MOVIMIENTOS PC            *            
008100******************************************************************            
008200                                                                              
008250*<INICIA JMLT> COMENTAR VARIABLES ANTERIORES                                  
008300* 01  WKS-PANTALLAS-ENT.                                                      
008400*    03 WKS-ENT-SIS           PIC 9(03).                                      
008500*    03 WKS-ENT-NUMPAN        PIC 9(02).                                      
008510*    03 WKS-ENT-FECHA-ANT     PIC 9(08).                                      
008520*    03 WKS-ENT-CONTRATO-ANT  PIC 9(16).                                      
008540*    03 WKS-ENT-AUTORIZA-ANT  PIC 9(08).                                      
008545*    03 FILLER                PIC X(31).                                      
008600*    03 WKS-ENT-FECHA         PIC 9(08).                                      
008700*    03 WKS-ENT-FECHA-A       REDEFINES                                       
008800*       WKS-ENT-FECHA         PIC X(08).                                      
008810*    03 WKS-ENT-CONTRATO      PIC 9(16).                                      
008820*    03 WKS-ENT-CONTRATO-A    REDEFINES                                       
008830*       WKS-ENT-CONTRATO      PIC X(16).                                      
009500*    03 WKS-ENT-AUTORIZA      PIC 9(08).                                      
009600*    03 WKS-ENT-AUTORIZA-A    REDEFINES                                       
009700*       WKS-ENT-AUTORIZA      PIC X(08).                                      
009705*    03 FILLER                PIC X(48).                                      
009800*    03 WKS-ENT-FECHA-ULT     PIC 9(08).                                      
009810*    03 WKS-ENT-CONTRATO-ULT  PIC 9(16).                                      
010100*    03 WKS-ENT-AUTORIZA-ULT  PIC 9(08).                                      
010200*    03 WKS-ENT-OCCURS-ULT    PIC 9(02).                                      
010600*    03 WKS-ENT-MAS-MOVS      PIC 9(01).                                      
010615*    03 FILLER                PIC X(45).                                      
010700*    03 FILLER                PIC X(1644).                                    
010710*                                                                             
010800* 01  WKS-PANTALLAS-SAL.                                                      
010900*    03 WKS-SAL-SIS           PIC 9(03).                                      
011000*    03 WKS-SAL-NUMPAN        PIC 9(02).                                      
011100*    03 WKS-SAL-TEXTO         PIC X(1867).                                    
011200*    03 WKS-SAL-TEXTO-R       REDEFINES WKS-SAL-TEXTO.                        
011210*       05 FILLER                PIC X(04).                                   
011220*       05 WKS-SAL-FECHA-ANT     PIC 9(08).                                   
011230*       05 WKS-SAL-CONTRATO-ANT  PIC Z(16).                                   
011240*       05 WKS-SAL-AUTORIZA-ANT  PIC Z(08).                                   
011260*                                                                             
011300*       05 FILLER                PIC X(04).                                   
011350*       05 FILLER                PIC X(04).                                   
011400*       05 WKS-SAL-FECHA         PIC 9(08).                                   
011500*       05 WKS-SAL-CONTRATO      PIC 9(16).                                   
011700*       05 WKS-SAL-AUTORIZA      PIC 9(08).                                   
011710*                                                                             
011715*       05 FILLER                PIC X(04).                                   
011720*       05 WKS-SAL-FECHA-ULT     PIC 9(08).                                   
011730*       05 WKS-SAL-CONTRATO-ULT  PIC 9(16).                                   
011750*       05 WKS-SAL-AUTORIZA-ULT  PIC 9(08).                                   
011755*       05 WKS-SAL-OCCURS-ULT    PIC 9(02).                                   
011760*       05 WKS-SAL-MAS-MOVS      PIC 9(01).                                   
011800*       05 FILLER                PIC 9(04).                                   
011900*       05 WKS-SAL-DAT           OCCURS 14 TIMES.                             
011910*          07 FILLER             PIC X(01).                                   
012000*          07 WKS-SAL-CLAVE      PIC 9(04).                                   
012100*          07 FILLER             PIC X(01).                                   
012200*          07 WKS-SAL-IMPORTE    PIC Z,ZZZ,ZZ9.99.                            
012300*          07 FILLER             PIC X(01).                                   
012400*          07 WKS-SAL-ESTATUS    PIC 9(02).                                   
012500*          07 FILLER             PIC X(01).                                   
012600*          07 WKS-SAL-HORA       PIC X(05).                                   
012700*          07 FILLER             PIC X(01).                                   
012800*          07 WKS-SAL-TIPOMOV    PIC 9(02).                                   
012900*          07 FILLER             PIC X(01).                                   
013000*          07 WKS-SAL-CTO        PIC Z(15)9(01).                              
013300*          07 FILLER             PIC X(01).                                   
013400*          07 WKS-SAL-AUT-S151   PIC Z(07)9(01).                              
013500*          07 FILLER             PIC X(01).                                   
013600*          07 WKS-SAL-AUT-PC     PIC Z(11)9(01).                              
013700*          07 FILLER             PIC X(01).                                   
013710*          07 WKS-SAL-OCCURS     PIC 9(02).                                   
013720*          07 FILLER             PIC X(01).                                   
013800*          07 WKS-SAL-NUM-ENV    PIC 9(03).                                   
013810*          07 FILLER             PIC X(01).                                   
013820*          07 WKS-SAL-CVE-ERR    PIC 9(02).                                   
013830*          07 FILLER             PIC X(01).                                   
013900*       05 FILLER                PIC X(04).                                   
014000*       05 WKS-SAL-LEY           PIC X(65).                                   
014100*       05 WKS-SAL-PRODATOS      PIC X(04).                                   
014200*       05 FILLER                PIC X(555).                                  
014205* 77 W77-RES-LIBCON              PIC S9(11) BINARY.                           
014210*<INICIA JMLT> DECLARAR NUEVOS LAYOUT DE ENTRADA Y SALIDA                     
014215 01 WKS-PANTALLAS-ENT      PIC X(1872).                                       
014220*01 WKS-PANTALLAS-SAL      PIC X(1872).                                       
014225 01 WKS-PANTALLA-ENT REDEFINES WKS-PANTALLAS-ENT.                             
014230    03 WKS-ENT-SIS          PIC 9(03).                                        
014235    03 WKS-ENT-NUMPAN       PIC 9(02).                                        
014240    03 WKS-ENT-TEXTO        PIC X(1867).                                      
014244*Layout de Protecciÿn de cobros, Numero de Servicio 1                         
014246    03 WKS-ENT-SERV1 REDEFINES WKS-ENT-TEXTO.                                 
014248       05 WKS-ENT-FECHA-ANT     PIC 9(08).                                    
014250       05 WKS-ENT-CONTRATO-ANT  PIC 9(16).                                    
014252       05 WKS-ENT-AUTORIZA-ANT  PIC 9(08).                                    
014254       05 FILLER                PIC X(31).                                    
014256       05 WKS-ENT-FECHA         PIC 9(08).                                    
014258       05 WKS-ENT-FECHA-A       REDEFINES                                     
014260          WKS-ENT-FECHA         PIC X(08).                                    
014262       05 WKS-ENT-CONTRATO      PIC 9(16).                                    
014264       05 WKS-ENT-CONTRATO-A    REDEFINES                                     
014266          WKS-ENT-CONTRATO      PIC X(16).                                    
014268       05 WKS-ENT-AUTORIZA      PIC 9(08).                                    
014270       05 WKS-ENT-AUTORIZA-A    REDEFINES                                     
014272          WKS-ENT-AUTORIZA      PIC X(08).                                    
014274       05 FILLER                PIC X(48).                                    
014276       05 WKS-ENT-FECHA-ULT     PIC 9(08).                                    
014278       05 WKS-ENT-CONTRATO-ULT  PIC 9(16).                                    
014280       05 WKS-ENT-AUTORIZA-ULT  PIC 9(08).                                    
014282       05 WKS-ENT-OCCURS-ULT    PIC 9(02).                                    
014284       05 WKS-ENT-MAS-MOVS      PIC 9(01).                                    
014286       05 FILLER                PIC X(45).                                    
014288       05 FILLER                PIC X(1644).                                  
014290*Layout de Notificaciÿn de Alertas, Numero de Servicio 2                      
014292    03 WKS-ENT-SERV2 REDEFINES WKS-ENT-TEXTO.                                 
014294       05 WKS-ENT-SERV2-SERVICIO-ANT           PIC 9(02).                     
014296       05 WKS-ENT-SERV2-FECHA-ANT              PIC 9(08).                     
014298       05 WKS-ENT-SERV2-OPCION-ANT             PIC 9(01).                     
014300       05 WKS-ENT-SERV2-CONTCTE-ANT            PIC 9(16).                     
014302       05 WKS-ENT-SERV2-AUTORIZA-ANT           PIC 9(08).                     
014304       05 FILLER                               PIC X(28).                     
014306       05 WKS-ENT-SERV2-SERVICIO               PIC 9(02).                     
014308       05 WKS-ENT-SERV2-SERVICIO-R REDEFINES                                  
014310          WKS-ENT-SERV2-SERVICIO               PIC X(02).                     
014312       05 WKS-ENT-SERV2-FECHA                  PIC 9(08).                     
014314       05 WKS-ENT-SERV2-FECHA-R REDEFINES                                     
014316          WKS-ENT-SERV2-FECHA                  PIC X(08).                     
014318       05 WKS-ENT-SERV2-OPCION                 PIC 9(01).                     
014320       05 WKS-ENT-SERV2-OPCION-R REDEFINES                                    
014322          WKS-ENT-SERV2-OPCION                 PIC X(01).                     
014324       05 WKS-ENT-SERV2-CONTCTE                PIC 9(16).                     
014326       05 WKS-ENT-SERV2-CONTCTE-R REDEFINES                                   
014328          WKS-ENT-SERV2-CONTCTE                PIC X(16).                     
014330       05 WKS-ENT-SERV2-AUTORIZA               PIC 9(08).                     
014332       05 WKS-ENT-SERV2-AUTORIZA-R REDEFINES                                  
014334          WKS-ENT-SERV2-AUTORIZA               PIC X(08).                     
014336       05 FILLER                               PIC X(45).                     
014338       05 WKS-ENT-SERV2-FECHA-ULT              PIC 9(08).                     
014340       05 WKS-ENT-SERV2-NUMCTE-ULT             PIC 9(12).                     
014342       05 WKS-ENT-SERV2-CONTRATO-ULT           PIC 9(16).                     
014344       05 WKS-ENT-SERV2-AUTORIZA-ULT           PIC 9(08).                     
014346       05 WKS-ENT-SERV2-OCCURS-ULT             PIC 9(02).                     
014348       05 WKS-ENT-SERV2-MAS-MOVS               PIC 9(01).                     
014350       05 FILLER                               PIC X(33).                     
014352       05 FILLER                               PIC X(1644).                   
014354*<FIN JMLT> LAYOUT DE ENTRADA DE SERVICIO 1 Y SERVICIO 2                      
014356*<INICIO RMT> LAYOUT DE ENTRADA CONSULTA DE CTAS MIGRADAS                     
014358    03 WKS-ENT-MIG REDEFINES WKS-ENT-TEXTO.                                   
014360       05 WKS-ENT-MIG-MDA-ANT                  PIC 9(01).                     
014362       05 WKS-ENT-MIG-FEC-ANT                  PIC 9(08).                     
014364       05 WKS-ENT-MIG-SUC-ANT                  PIC 9(04).                     
014366       05 WKS-ENT-MIG-CTOCTA-ANT               PIC 9(16).                     
014368       05 WKS-ENT-MIG-TAR-ANT                  PIC 9(16).                     
014370       05 WKS-ENT-MIG-BIN-ANT                  PIC 9(06).                     
014372       05 FILLER                               PIC X(12).                     
014374       05 WKS-ENT-MIG-MDA                      PIC 9(01).                     
014376       05 WKS-ENT-MIG-MDA-A          REDEFINES                                
014378          WKS-ENT-MIG-MDA                      PIC X(01).                     
014380       05 WKS-ENT-MIG-FEC                      PIC 9(08).                     
014382       05 WKS-ENT-MIG-FEC-A          REDEFINES                                
014384          WKS-ENT-MIG-FEC                      PIC X(08).                     
014386       05 WKS-ENT-MIG-SUC                      PIC 9(04).                     
014388       05 WKS-ENT-MIG-SUC-A          REDEFINES                                
014390          WKS-ENT-MIG-SUC                      PIC X(04).                     
014392       05 WKS-ENT-MIG-CTOCTA                   PIC 9(16).                     
014394       05 WKS-ENT-MIG-CTOCTA-A       REDEFINES                                
014396          WKS-ENT-MIG-CTOCTA                   PIC X(16).                     
014398       05 WKS-ENT-MIG-TAR                      PIC 9(16).                     
014400       05 WKS-ENT-MIG-TAR-A          REDEFINES                                
014402          WKS-ENT-MIG-TAR                      PIC X(16).                     
014404       05 WKS-ENT-MIG-BIN                      PIC 9(06).                     
014406       05 WKS-ENT-MIG-BIN-A          REDEFINES                                
014408          WKS-ENT-MIG-BIN                      PIC X(06).                     
014410       05 FILLER                               PIC X(29).                     
014412       05 WKS-ENT-MIG-FEC-ULT                  PIC 9(08).                     
014414       05 WKS-ENT-MIG-SUC-ULT                  PIC 9(04).                     
014416       05 WKS-ENT-MIG-CTOCTA-ULT               PIC 9(16).                     
014418       05 WKS-ENT-MIG-AUT151-ULT               PIC 9(08).                     
014420       05 WKS-ENT-MIG-NUMOCC-ULT               PIC 9(02).                     
014422       05 WKS-ENT-MIG-TAR-ULT                  PIC 9(16).                     
014424       05 WKS-ENT-MIG-BIN-ULT                  PIC 9(06).                     
014426       05 WKS-ENT-MIG-MAS-MOVS                 PIC 9(01).                     
014428       05 FILLER                               PIC X(19).                     
014430       05 FILLER                               PIC X(1644).                   
014432*<FIN RMT> LAYOUT DE ENTRADA CONSULTA DE CTAS MIGRADAS                        
014433*<INI LBM> LAYOUT DE ENTRADA DE PANTALLA 30                                   
014434    03 WKS-ENT-P30 REDEFINES WKS-ENT-TEXTO.                                   
014436*<LBM> DATOS CONSULTA ANTERIOR                                                
014438       05 WKS-ENT-P30FEC-INI-A                 PIC 9(08).                     
014440       05 WKS-ENT-P30FEC-FIN-A                 PIC 9(08).                     
014442       05 WKS-ENT-P30SUC-A                     PIC 9(04).                     
014444       05 WKS-ENT-P30CTA-A                     PIC 9(16).                     
014446       05 WKS-ENT-P30A151-A                    PIC 9(08).                     
014448       05 WKS-ENT-P30AAP-A                     PIC 9(08).                     
014450*<LBM> DATOS CAMPOS EDITABLES                                                 
014452       05 WKS-ENT-P30FEC-INI                   PIC 9(08).                     
014454       05 WKS-ENT-P30FEC-FIN                   PIC 9(08).                     
014456       05 WKS-ENT-P30SUC                       PIC 9(04).                     
014458       05 WKS-ENT-P30CTA                       PIC 9(16).                     
014460       05 WKS-ENT-P30A151                      PIC 9(08).                     
014462       05 WKS-ENT-P30AAP                       PIC 9(08).                     
014463       05 WKS-ENT-P30CTO                       PIC 9(16).                     
014464*<LBM> DATOS ULTIMA CONSULTA                                                  
014465       05 WKS-ENT-P30FEC-U                     PIC 9(08).                     
014466       05 WKS-ENT-P30OCU-U                     PIC 9(02).                     
014469       05 WKS-ENT-P30A151-U                    PIC 9(08).                     
014472       05 WKS-ENT-P30MMOVS                     PIC 9(01).                     
014473*       05 FILLER                               PIC X(1744).                  
014474       05 FILLER                               PIC X(1728).                   
014475*<FIN LBM> LAYOUT DE ENTRADA DE PANTALLA 30                                   
014476*<INICIA JMLT> LAYOUT DE SALIDA DE SERVICIO 1 Y SERVICIO 2                    
014477 01 WKS-PANTALLAS-SAL        PIC X(1872).                                     
014480 01 WKS-PANTALLA-SAL REDEFINES WKS-PANTALLAS-SAL.                             
014485    03 WKS-SAL-SIS           PIC 9(03).                                       
014490    03 WKS-SAL-NUMPAN        PIC 9(02).                                       
014495    03 WKS-SAL-TEXTO         PIC X(1867).                                     
014500*Layout de Salida de Protecciÿn de cobros, Numero de Servicio 1               
014505    03 WKS-SAL-TEXTO-R       REDEFINES WKS-SAL-TEXTO.                         
014510       05 FILLER                PIC X(04).                                    
014515       05 WKS-SAL-FECHA-ANT     PIC 9(08).                                    
014520       05 WKS-SAL-CONTRATO-ANT  PIC Z(16).                                    
014525       05 WKS-SAL-AUTORIZA-ANT  PIC Z(08).                                    
014530       05 FILLER                PIC X(04).                                    
014535       05 FILLER                PIC X(04).                                    
014540       05 WKS-SAL-FECHA         PIC 9(08).                                    
014545       05 WKS-SAL-CONTRATO      PIC 9(16).                                    
014550       05 WKS-SAL-AUTORIZA      PIC 9(08).                                    
014555       05 FILLER                PIC X(04).                                    
014560       05 WKS-SAL-FECHA-ULT     PIC 9(08).                                    
014565       05 WKS-SAL-CONTRATO-ULT  PIC 9(16).                                    
014570       05 WKS-SAL-AUTORIZA-ULT  PIC 9(08).                                    
014575       05 WKS-SAL-OCCURS-ULT    PIC 9(02).                                    
014580       05 WKS-SAL-MAS-MOVS      PIC 9(01).                                    
014585       05 FILLER                PIC 9(04).                                    
014590       05 WKS-SAL-DAT           OCCURS 14 TIMES.                              
014595          07 FILLER             PIC X(01).                                    
014600          07 WKS-SAL-CLAVE      PIC 9(04).                                    
014605          07 FILLER             PIC X(01).                                    
014610          07 WKS-SAL-IMPORTE    PIC Z,ZZZ,ZZ9.99.                             
014615          07 FILLER             PIC X(01).                                    
014620          07 WKS-SAL-ESTATUS    PIC 9(02).                                    
014625          07 FILLER             PIC X(01).                                    
014630          07 WKS-SAL-HORA       PIC X(05).                                    
014635          07 FILLER             PIC X(01).                                    
014640          07 WKS-SAL-TIPOMOV    PIC 9(02).                                    
014645          07 FILLER             PIC X(01).                                    
014650          07 WKS-SAL-CTO        PIC Z(15)9(01).                               
014655          07 FILLER             PIC X(01).                                    
014660          07 WKS-SAL-AUT-S151   PIC Z(07)9(01).                               
014665          07 FILLER             PIC X(01).                                    
014670          07 WKS-SAL-AUT-PC     PIC Z(11)9(01).                               
014675          07 FILLER             PIC X(01).                                    
014680          07 WKS-SAL-OCCURS     PIC 9(02).                                    
014685          07 FILLER             PIC X(01).                                    
014690          07 WKS-SAL-NUM-ENV    PIC 9(03).                                    
014695          07 FILLER             PIC X(01).                                    
014700          07 WKS-SAL-CVE-ERR    PIC 9(02).                                    
014705          07 FILLER             PIC X(01).                                    
014710       05 FILLER                PIC X(04).                                    
014715       05 WKS-SAL-LEY           PIC X(65).                                    
014720       05 WKS-SAL-PRODATOS      PIC X(04).                                    
014725       05 FILLER                PIC X(555).                                   
014730*Layout de Salida de Notificaciÿn de Alertas, Numero de Servicio 2            
014735    03 WKS-SAL-SERV2       REDEFINES WKS-SAL-TEXTO.                           
014740       05 FILLER                       PIC X(04).                             
014745       05 WKS-SAL-SERV2-SERVICIO       PIC Z(02).                             
014750       05 WKS-SAL-SERV2-FECHA          PIC 9(08).                             
014755       05 WKS-SAL-SERV2-OPCION         PIC Z(01).                             
014760       05 WKS-SAL-SERV2-CONTCTE        PIC Z(16).                             
014765       05 WKS-SAL-SERV2-AUTORIZA       PIC Z(08).                             
014770       05 FILLER                       PIC X(04).                             
014775       05 FILLER                       PIC X(04).                             
014780       05 WKS-SAL-SERV2-SERVICIO-ANT   PIC 9(02).                             
014785       05 WKS-SAL-SERV2-FECHA-ANT      PIC 9(08).                             
014790       05 WKS-SAL-SERV2-OPCION-ANT     PIC 9(01).                             
014795       05 WKS-SAL-SERV2-CONTCTE-ANT    PIC 9(16).                             
014800       05 WKS-SAL-SERV2-AUTORIZA-ANT   PIC 9(08).                             
014805       05 FILLER                       PIC X(04).                             
014810       05 WKS-SAL-SERV2-FECHA-ULT      PIC 9(08).                             
014815       05 WKS-SAL-SERV2-NUMCTE-ULT     PIC 9(12).                             
014820       05 WKS-SAL-SERV2-CONTRATO-ULT   PIC 9(16).                             
014825       05 WKS-SAL-SERV2-AUTORIZA-ULT   PIC 9(08).                             
014830       05 WKS-SAL-SERV2-OCCURS-ULT     PIC 9(02).                             
014835       05 WKS-SAL-SERV2-MAS-MOVS       PIC 9(01).                             
014840       05 FILLER                       PIC X(04).                             
014845       05 FILLER                       PIC X(39).                             
014850       05 FILLER                       PIC X(31).                             
014855       05 FILLER                       PIC X(04).                             
014860       05 FILLER                       PIC X(42).                             
014865       05 FILLER                       PIC X(31).                             
014866* INI ISI VMR AGREGA TITULO 3 PANTALLA 28                                     
014867       05 FILLER                       PIC X(04).                             
014868       05 FILLER                       PIC X(44).                             
014869       05 FILLER                       PIC X(36).                             
014870* FIN ISI VMR                                                                 
014871       05 FILLER                       PIC X(04).                             
014872* INI ISI VMR AGREGA DETALLE FECHAS PANTALLA 28                               
014873*       05 WKS-SAL-DAT-SERV2 OCCURS 7 TIMES.                                  
014874        05 WKS-SAL-DAT-SERV2 OCCURS 4 TIMES.                                  
014875* FIN ISI VMR                                                                 
014884          07 FILLER                       PIC X(04).                          
014885          07 WKS-SAL-SERV2-AUT151         PIC Z(07)9(01).                     
014890          07 FILLER                       PIC X(01).                          
014895          07 WKS-SAL-SERV2-NUMCTE         PIC Z(11)9(01).                     
014900          07 FILLER                       PIC X(01).                          
014905          07 WKS-SAL-SERV2-CONTRATO       PIC Z(15)9(01).                     
014910          07 FILLER                       PIC X(01).                          
014915          07 WKS-SAL-SERV2-PROD           PIC 9(04).                          
014920          07 FILLER                       PIC X(02).                          
014925          07 WKS-SAL-SERV2-INST           PIC 9(02).                          
014930          07 FILLER                       PIC X(01).                          
014935          07 WKS-SAL-SERV2-IMP            PIC                                 
014940                  Z,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
014945          07 FILLER                       PIC X(04).                          
014950          07 FILLER                       PIC X(05).                          
014955          07 WKS-SAL-SERV2-SDOFIN         PIC                                 
014960                   -ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
014965          07 FILLER                       PIC X(02).                          
014970          07 WKS-SAL-SERV2-CVETRAN        PIC Z(05)9(01).                     
014971          07 FILLER                       PIC X(02).                          
014972          07 WKS-SAL-SERV2-OC             PIC 9(02).                          
014973          07 FILLER                       PIC X(01).                          
014974          07 WKS-SAL-SERV2-SUC            PIC Z(03)9(01).                     
014975          07 FILLER                       PIC X(01).                          
014976          07 WKS-SAL-SERV2-CAJ            PIC Z(03)9(01).                     
014977          07 FILLER                       PIC X(01).                          
014978          07 WKS-SAL-SERV2-STATUS         PIC 9(02).                          
014979          07 FILLER                       PIC X(02).                          
014980          07 WKS-SAL-SERV2-TIPOMOV        PIC 9(02).                          
014981          07 FILLER                       PIC X(02).                          
014982          07 WKS-SAL-SERV2-ERROR          PIC 9(04).                          
014983          07 FILLER                       PIC X(01).                          
014984          07 WKS-SAL-SERV2-ENV            PIC 9(04).                          
014985          07 FILLER                       PIC X(03).                          
014986          07 WKS-SAL-SERV2-NAT            PIC 9(02).                          
014987          07 FILLER                       PIC X(07).                          
014992* INI ISI VMR - AGREGAMOS FECHAS AL MENSAJE DE SALIDA                         
014997          07 FILLER                       PIC X(03).                          
015002          07 WKS-SAL-SERV2-FECARR         PIC X(19).                          
015067          07 FILLER                       PIC X(08).                          
015072          07 WKS-SAL-SERV2-FECENV.                                            
015077            09 WKS-SAL-S2-FECEN           PIC 9(02).                          
015082            09 WKS-SAL-S2-FEAA            PIC 9(02).                          
015087            09 WKS-SAL-S2-FEG1            PIC X.                              
015092            09 WKS-SAL-S2-FEMM            PIC 9(02).                          
015097            09 WKS-SAL-S2-FEG2            PIC X.                              
015102            09 WKS-SAL-S2-FEDD            PIC 9(02).                          
015107            09 WKS-SAL-S2-FEDI            PIC X.                              
015112            09 WKS-SAL-S2-FEHH            PIC 9(02).                          
015117            09 WKS-SAL-S2-FE2P            PIC X.                              
015122            09 WKS-SAL-S2-FEMI            PIC 9(02).                          
015127            09 WKS-SAL-S2-FE2P2           PIC X.                              
015132            09 WKS-SAL-S2-FESS            PIC 9(02).                          
015137          07 FILLER                       PIC X(07).                          
015142          07 WKS-SAL-SERV2-FECCAN.                                            
015147            09 WKS-SAL-S2-FCCEN           PIC 9(02).                          
015152            09 WKS-SAL-S2-FCAA            PIC 9(02).                          
015157            09 WKS-SAL-S2-FCG1            PIC X.                              
015162            09 WKS-SAL-S2-FCMM            PIC 9(02).                          
015167            09 WKS-SAL-S2-FCG2            PIC X.                              
015172            09 WKS-SAL-S2-FCDD            PIC 9(02).                          
015177            09 WKS-SAL-S2-FCDI            PIC X.                              
015182            09 WKS-SAL-S2-FCHH            PIC 9(02).                          
015187            09 WKS-SAL-S2-FC2P            PIC X.                              
015192            09 WKS-SAL-S2-FCMI            PIC 9(02).                          
015197            09 WKS-SAL-S2-FC2P2           PIC X.                              
015202            09 WKS-SAL-S2-FCSS            PIC 9(02).                          
015207          07 FILLER                       PIC X(05).                          
015212       05 FILLER                       PIC X(80).                             
015217* FIN ISI VMR                                                                 
015222       05 FILLER                       PIC X(04).                             
015227       05 WKS-SAL-SERV2-LEY            PIC X(65).                             
015232       05 WKS-SAL-SERV2-PRODATOS       PIC X(04).                             
015237       05 FILLER                       PIC X(382).                            
015238                                                                              
015239*<INICIO RMT> LAYOUT DE SALIDA PANTALLA 29                                    
015241    03 WKS-SAL-MIG REDEFINES WKS-SAL-TEXTO.                                   
015243       05 FILLER                               PIC X(04).                     
015245       05 WKS-SAL-MIG-MDA-ANT                  PIC 9(01).                     
015247       05 WKS-SAL-MIG-FEC-ANT                  PIC Z(08).                     
015249       05 WKS-SAL-MIG-SUC-ANT                  PIC Z(04).                     
015251       05 WKS-SAL-MIG-CTOCTA-ANT               PIC Z(16).                     
015253       05 WKS-SAL-MIG-TAR-ANT                  PIC Z(16).                     
015255       05 WKS-SAL-MIG-BIN-ANT                  PIC Z(06).                     
015257       05 FILLER                               PIC X(08).                     
015259       05 WKS-SAL-MIG-MDA                      PIC 9(01).                     
015261       05 WKS-SAL-MIG-FEC                      PIC 9(08).                     
015263       05 WKS-SAL-MIG-SUC                      PIC 9(04).                     
015265       05 WKS-SAL-MIG-CTOCTA                   PIC 9(16).                     
015267       05 WKS-SAL-MIG-TAR                      PIC 9(16).                     
015269       05 WKS-SAL-MIG-BIN                      PIC 9(06).                     
015271       05 FILLER                               PIC X(04).                     
015273       05 WKS-SAL-MIG-FEC-ULT                  PIC 9(08).                     
015275       05 WKS-SAL-MIG-SUC-ULT                  PIC 9(04).                     
015277       05 WKS-SAL-MIG-CTOCTA-ULT               PIC 9(16).                     
015279       05 WKS-SAL-MIG-CTOCTA-ULT-R                                            
015281          REDEFINES WKS-SAL-MIG-CTOCTA-ULT.                                   
015283          07 WKS-SAL-MIG-CTOCTA-6-ULT          PIC 9(06).                     
015285          07 WKS-SAL-MIG-CTOCTA-10-ULT         PIC 9(10).                     
015287       05 WKS-SAL-MIG-AUT151-ULT               PIC 9(08).                     
015289       05 WKS-SAL-MIG-NUMOCC-ULT               PIC 9(02).                     
015291       05 WKS-SAL-MIG-TAR-ULT                  PIC 9(16).                     
015293       05 WKS-SAL-MIG-TAR-ULT-R REDEFINES WKS-SAL-MIG-TAR-ULT.                
015295          07 WKS-SAL-MIG-TAR-BIN-ULT           PIC 9(06).                     
015297          07 WKS-SAL-MIG-TAR-CTA-ULT           PIC 9(10).                     
015299       05 WKS-SAL-MIG-BIN-ULT                  PIC 9(06).                     
015301       05 WKS-SAL-MIG-MAS-MOVS                 PIC 9(01).                     
015303       05 FILLER                               PIC X(04).                     
015305       05 WKS-SAL-MIG-DAT                      OCCURS 11 TIMES.               
015307          07 FILLER                            PIC X(01).                     
015309          07 WKS-SAL-MIG-DAT-AUT151            PIC Z(07)9(01).                
015311          07 FILLER                            PIC X(01).                     
015313          07 WKS-SAL-MIG-DAT-CVETRAN           PIC 9(06).                     
015315          07 FILLER                            PIC X(01).                     
015317          07 WKS-SAL-MIG-DAT-IMPORTE           PIC Z,ZZZ,ZZ9.99.              
015319          07 FILLER                            PIC X(01).                     
015321          07 WKS-SAL-MIG-DAT-SUC               PIC 9(04).                     
015323          07 FILLER                            PIC X(01).                     
015325          07 WKS-SAL-MIG-DAT-CTOCTA            PIC Z(15)9(01).                
015327          07 FILLER                            PIC X(02).                     
015329          07 WKS-SAL-MIG-DAT-SUCMDA            PIC 9(04).                     
015331          07 FILLER                            PIC X(02).                     
015333          07 WKS-SAL-MIG-DAT-TAR               PIC Z(15)9(01).                
015335          07 WKS-SAL-MIG-DAT-TAR-R  REDEFINES WKS-SAL-MIG-DAT-TAR.            
015337             09 WKS-SAL-MIG-DAT-TAR-BIN        PIC Z(06).                     
015339             09 WKS-SAL-MIG-DAT-TAR-CTA        PIC 9(10).                     
015341          07 FILLER                            PIC X(01).                     
015343          07 WKS-SAL-MIG-DAT-SM                PIC X(02).                     
015345          07 FILLER                            PIC X(02).                     
015347       05 FILLER                               PIC X(04).                     
015349       05 WKS-SAL-MIG-LEY                      PIC X(65).                     
015351       05 FILLER                               PIC X(04).                     
015353       05 FILLER                               PIC X(731).                    
015355                                                                              
015357*<FIN RMT> LAYOUT DE SALIDA PANTALLA 29                                       
015359*<INI LBM> LAYOUT DE SALIDA DE PANTALLA 30                                    
015361       03 WKS-SAL-P30 REDEFINES WKS-SAL-TEXTO.                                
015363          05 FILLER                            PIC X(04).                     
015365          05 WKS-SAL-FECHAI-30                 PIC 9(08).                     
015368          05 WKS-SAL-FECHAF-30                 PIC 9(08).                     
015369          05 WKS-SAL-SUC-30                    PIC Z(04).                     
015371          05 WKS-SAL-CTA-30                    PIC Z(16).                     
015373          05 WKS-SAL-AUTS151-30                PIC Z(08).                     
015375          05 WKS-SAL-AUT-APL-30                PIC Z(08).                     
015376          05 WKS-SAL-CTO-30                    PIC Z(16).                     
015377          05 FILLER                            PIC X(04).                     
015379          05 FILLER                            PIC X(04).                     
015381          05 WKS-SAL-FECHAI-ANT-30             PIC 9(08).                     
015383          05 WKS-SAL-FECHAF-ANT-30             PIC 9(08).                     
015385          05 WKS-SAL-SUC-ANT-30                PIC Z(04).                     
015387          05 WKS-SAL-CTA-ANT-30                PIC Z(16).                     
015389          05 WKS-SAL-AUTS151-ANT-30            PIC Z(08).                     
015391          05 WKS-SAL-AUTAPL-ANT-30             PIC Z(08).                     
015393          05 FILLER                            PIC X(04).                     
015395          05 WKS-SAL-P30FEC-INI-U              PIC 9(08).                     
015397          05 WKS-SAL-P30NUM-OCUR-U             PIC 9(02).                     
015403          05 WKS-SAL-P30A151-U                 PIC Z(08).                     
015406          05 WKS-SAL-P30MMOVS-U                PIC Z(01).                     
015407          05 FILLER                            PIC X(04).                     
015409*          05 WKS-SAL-DAT-30 OCCURS 7 TIMES.                                  
015410          05 WKS-SAL-DAT-30 OCCURS 6 TIMES.                                   
015411             07 WKS-SAL-CLAVE-30               PIC 9(04).                     
015413             07 FILLER                         PIC X(02).                     
015415             07 WKS-SAL-IMPORTE-30             PIC Z,ZZZ,ZZ9.99.              
015417             07 FILLER                         PIC X(02).                     
015419             07 WKS-SAL-ESTATUS-30             PIC 9(02).                     
015421             07 FILLER                         PIC X(01).                     
015423             07 WKS-SAL-HORA-30                PIC X(05).                     
015425             07 FILLER                         PIC X(01).                     
015427             07 WKS-SAL-TIPOMOV-30             PIC 9(02).                     
015429             07 FILLER                         PIC X(01).                     
015431             07 WKS-SAL-SUCURSAL-30            PIC 9(04).                     
015433             07 FILLER                         PIC X(01).                     
015435             07 WKS-SAL-CUENTA-30              PIC Z(15)9(01).                
015437             07 FILLER                         PIC X(01).                     
015439             07 WKS-SAL-AUT151-30              PIC Z(07)9(01).                
015441             07 FILLER                         PIC X(02).                     
015443             07 WKS-SAL-FECHA-30               PIC 9(08).                     
015445             07 FILLER                         PIC X(08).                     
015447             07 WKS-SAL-AUTAPL-30              PIC Z(07)9(01).                
015449             07 FILLER                         PIC X(03).                     
015451             07 WKS-SAL-OCURRENCIA-30          PIC 9(02).                     
015453             07 FILLER                         PIC X(01).                     
015455             07 WKS-SAL-ENVIO-30               PIC Z(02)9(01).                
015457             07 FILLER                         PIC X(01).                     
015459             07 WKS-SAL-ERROR-30               PIC 9(02).                     
015460             07 FILLER                         PIC X(04).                     
015461             07 WKS-SAL-SUC-PROM-30            PIC 9(04).                     
015462             07 FILLER                         PIC X(03).                     
015463             07 WKS-SAL-CONTRATO-30            PIC Z(15)9(01).                
015464*             07 FILLER                         PIC X(60).                    
015465             07 FILLER                         PIC X(33).                     
015466          05 FILLER                            PIC X(04).                     
015467          05 WKS-SAL-LEY-30                    PIC X(65).                     
015468          05 FILLER                            PIC X(04).                     
015469*          05 FILLER                            PIC X(531).                   
015470          05 FILLER                            PIC X(675).                    
015471*<FIN LBM> LAYOUT DE SALIDA DE PANTALLA 30                                    
015542 77 W77-RES-LIBCON                             PIC S9(11) BINARY.             
015547*<FIN JMLT> LAYOUT DE SALIDA DE SERVICIO 1 Y SERVICIO 2                       
015600                                                                              
015607* INI ISI VMR FECHA DE ARRIBO                                                 
015614  01 WKS-FECHA-ARRIBO        PIC 9(06).                                       
015616  01 WKS-FECHA-ARRIBO-R REDEFINES WKS-FECHA-ARRIBO.                           
015621     03 WKS-FARR-AA          PIC 9(02).                                       
015628     03 WKS-FARR-MM          PIC 9(02).                                       
015635     03 WKS-FARR-DD          PIC 9(02).                                       
015642  01 WKS-HRS-MAQARR          PIC 9(06).                                       
015645  01 WKS-HRS-MAQARR-R REDEFINES WKS-HRS-MAQARR.                               
015649     03 WKS-HRS-ARRHH        PIC 9(02).                                       
015656     03 WKS-HRS-ARRMM        PIC 9(02).                                       
015663     03 WKS-HRS-ARRSS        PIC 9(02).                                       
015670                                                                              
015677  01 WKS-FECHR-CARGO.                                                         
015678     03 WKS-FECHR-FACEN      PIC 9(02) VALUE 20.                              
015679     03 WKS-FECHR-FAAA       PIC 9(02).                                       
015680     03 WKS-FECHR-FAG1       PIC X VALUE "-".                                 
015681     03 WKS-FECHR-FAMM       PIC 9(02).                                       
015682     03 WKS-FECHR-FAG2       PIC X VALUE "-".                                 
015683     03 WKS-FECHR-FADD       PIC 9(02).                                       
015684     03 WKS-FECHR-FADI       PIC X VALUE "/".                                 
015685     03 WKS-FECHR-FAHH       PIC 9(02).                                       
015686     03 WKS-FECHR-FA2P       PIC X VALUE ":".                                 
015687     03 WKS-FECHR-FAMI       PIC 9(02).                                       
015688     03 WKS-FECHR-FA2P2      PIC X VALUE ":".                                 
015689     03 WKS-FECHR-FASS       PIC 9(02).                                       
015690                                                                              
015691* FIN ISI VMR                                                                 
015700 PROCEDURE DIVISION USING WKS-PANTALLAS-ENT,                                  
015703                          WKS-PANTALLAS-SAL,                                  
015705                          W77-RES-LIBCON.                                     
015800 010-CONTROL SECTION.                                                         
015900 010-0100-CHECA-OPCION.                                                       
016000     IF SW-PRIMER-CALL           =   ZEROES                                   
016100        PERFORM  010-0200-INICIA-LIBRERIA                                     
016200        IF W77-RES-LIBCON = 0                                                 
016300           PERFORM 010-0300-VALIDA                                            
016400        ELSE                                                                  
016500           NEXT SENTENCE                                                      
016600     ELSE                                                                     
016700        PERFORM 010-0300-VALIDA.                                              
016800                                                                              
016900     EXIT PROGRAM.                                                            
017000                                                                              
017100 010-0200-INICIA-LIBRERIA.                                                    
017200*-------------------------                                                    
017300     MOVE  01                     TO SW-PRIMER-CALL.                          
017400     MOVE "S151"                  TO SISTEMA-LJ                               
017500     MOVE "L014"                  TO PASO-LJ                                  
017600     MOVE 002                     TO MTP-LJ                                   
017700     MOVE "L"                     TO TIPO-LJ                                  
017800     MOVE 010101                  TO CODIGO-LJ                                
017900     CHANGE ATTRIBUTE TITLE    OF "LIBLJ"  TO                                 
018000          "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK"                      
018100                                                                              
018200     CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION                  
018300     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP"                    
018400                                                                              
018500     MOVE 0                       TO WS-VECES                                 
018600     PERFORM 090-ABRE-BASE UNTIL WS-BANDERA > 0                               
018700                              OR WS-VECES   > 5                               
018800     IF WS-BANDERA = 0                                                        
018900        MOVE "BASE DE DATOS NO SE ABRIO"                                      
019000                                  TO TEXTO-LJ                                 
019100        MOVE 79                   TO W77-RES-LIBCON                           
019200        CALL "LJ IN LIBLJ"                                                    
019300                  USING CONTADOR-LJ,MENSAJE-LJ.                               
019400                                                                              
019500 010-0300-VALIDA.                                                             
019600*----------------                                                             
019700     MOVE 0 TO W77-RES-LIBCON.                                                
019710*<INICIO RMT>  SE OMITE VALIDACION DE FECHA PARA CONSULTA POR BIN             
019720   IF WKS-ENT-NUMPAN  = 29 AND WKS-ENT-MIG-BIN > 0 AND                        
019730      WKS-ENT-MIG-FEC = 0                                                     
019740      NEXT SENTENCE                                                           
019750   ELSE                                                                       
019760*<FIN RMT>                                                                    
019800     PERFORM  010-0300-VALIDA-FECHA                                           
019900     IF W77-RES-LIBCON > ZEROS                                                
019925**INICIA JMLT MODIFICACION                                                    
019950        PERFORM 010-0500-LIMPIA-ULT-DAT                                       
019975        PERFORM 010-0500-ACT-DAT-INI                                          
019976*<INICIO RMT> ERROR EN FECHA PANTALLA 29                                      
019979        PERFORM 010-2900-LIMPIA-ULT-DAT                                       
019982        PERFORM 010-2900-ACT-DAT-INI                                          
019985*<FIN RMT> ERROR EN FECHA PANTALLA 29                                         
019987*                                                                             
019989*<INI LBM> ERROR EN FECHA PANTALLA 30                                         
019991        PERFORM 010-0030-LIMPIA-ULT-DAT                                       
019993        PERFORM 010-0030-ACT-DAT-INI                                          
019995*<FIN LBM> ERROR EN FECHA PANTALLA 30                                         
020000*              EXIT PERFORM                                                   
020030               EXIT PERFORM.                                                  
020060*<FIN JMLT> QUITAR PUNTO AL FINAL DE LA LINEA 020000                          
020100                                                                              
020150*<INICIA JMLT> COMENTAR LINEA 020200                                          
020200*     ELSE                                                                    
020220*<FIN JMLT> LINEA COMENTADA                                                   
020240*<INICIA JMLT> IF PARA VALIDAR NUMERO DE PANTALLA Y SERVICIO                  
020260     IF WKS-ENT-NUMPAN = 27                                                   
020280          MOVE 1 TO WKS-SERVICIO                                              
020300          PERFORM 010-0300-PANTALLA27                                         
020320     ELSE                                                                     
020340        IF WKS-ENT-NUMPAN = 28                                                
020360           IF WKS-ENT-SERV2-SERVICIO > 1                                      
020380              MOVE WKS-ENT-SERV2-SERVICIO TO WKS-SERVICIO                     
020400              PERFORM 010-0500-PANTALLA28SERV1                                
020420           ELSE                                                               
020440              MOVE "NUMERO DE SERVICIO INVALIDO"                              
020460                   TO WKS-SAL-ERRLEY                                          
020480        ELSE                                                                  
020482*<INICIO RMT> AGREGA PANTALLA 29 A VALIDACION                                 
020486          IF WKS-ENT-NUMPAN = 29                                              
020490             PERFORM 010-2900-PANTALLA29                                      
020492*<INI LBM> SI ES PANTALLA 30 SE ATIENDE LA CONSULTA                           
020493          ELSE                                                                
020494            IF WKS-ENT-NUMPAN = 30                                            
020496                MOVE 20 TO WKS-FECHAI-30-CONS-AA                              
020497                MOVE 20 TO WKS-FECHAF-30-CONS-AA                              
020498                MOVE 20 TO WKS-FECHAR-30-FORM-AA                              
020499                PERFORM 010-0030-PANTALLA30                                   
020500*<FIN LBM> SI ES PANTALLA 30 SE ATIENDE LA CONSULTA                           
020502            ELSE                                                              
020505*<FIN RMT> AGREGA PANTALLA 29 A VALIDACION                                    
020510             MOVE "NUMERO DE PANTALLA INVALIDA" TO WKS-SAL-ERRLEY.            
020520*<FIN JMLT> IF PARA VALIDAR NUMERO DE PANTALLA Y SERVICIO                     
020540*<INICIA JMLT> DECLARACION RUTINA PARA PANTALLA 27 NUMERO DE                  
020550* SERVICIO 1                                                                  
020560 010-0300-PANTALLA27.                                                         
020580*<FIN JMLT> DECLARACION RUTINA PARA PANTALLA 27 NUMERO DE                     
020645* SERVICIO 1                                                                  
020710     IF NOT(WKS-ENT-CONTRATO > ZEROS OR WKS-ENT-CONTRATO = ZEROS)             
020800               MOVE 46 TO W77-RES-LIBCON                                      
020900               MOVE "CONTRATO INVALIDO" TO WKS-SAL-ERRLEY                     
021000     ELSE                                                                     
021100     IF NOT(WKS-ENT-AUTORIZA > ZEROS OR WKS-ENT-AUTORIZA = ZEROS)             
021200                MOVE 68 TO W77-RES-LIBCON                                     
021300                MOVE "AUTORIZACION INVALIDA" TO WKS-SAL-ERRLEY.               
021400                                                                              
021500     IF W77-RES-LIBCON = 0                                                    
021600          PERFORM 010-0400-VALIDA-COND.                                       
021700                                                                              
021800 010-0300-VALIDA-FECHA.                                                       
021900*----------------------                                                       
021910*<INICIA JMLT>VALIDACION PARA FECHA DE ENTRADA                                
021920 IF WKS-ENT-NUMPAN = 27                                                       
021930    MOVE WKS-ENT-FECHA   TO  WKS-CAL-FECHA1                                   
021940 ELSE                                                                         
021950    IF WKS-ENT-NUMPAN = 28                                                    
021960       IF WKS-ENT-SERV2-SERVICIO > 1                                          
021965*<INICIO RMT> VALIDACION FECHA PANTALLA 29                                    
021970*          MOVE WKS-ENT-SERV2-FECHA TO WKS-CAL-FECHA1.                        
021971          MOVE WKS-ENT-SERV2-FECHA TO WKS-CAL-FECHA1                          
021972       ELSE                                                                   
021973          NEXT SENTENCE                                                       
021974    ELSE                                                                      
021975       IF WKS-ENT-NUMPAN = 29                                                 
021977          MOVE WKS-ENT-MIG-FEC     TO WKS-CAL-FECHA1                          
021978                                                                              
021979*<INI LBM> FECHA INICIAL VALIDA DE PANTALLA 30                                
021980       ELSE                                                                   
021981          IF WKS-ENT-NUMPAN = 30                                              
021982             MOVE WKS-ENT-P30FEC-INI     TO WKS-CAL-FECHA1.                   
021985*<FIN LBM> FECHA INICIAL VALIDA DE PANTALLA 30                                
021986                                                                              
021987*<FIN RMT> VALIDACION FECHA PANTALLA 30                                       
021988*<FIN JMLT>VALIDACION PARA FECHA DE ENTRADA                                   
021990*<INICIA JMLT>COMENTAR LA LINEA 022000                                        
022000*     MOVE WKS-ENT-FECHA   TO  WKS-CAL-FECHA1.                                
022050*<FIN JMLT>COMENTAR LA LINEA 022000                                           
022060                                                                              
022070*<INI LBM> TERMINACION DE IFS ANIDADOS HASTA EXIT PERFORM                     
022080 MOVE 20 TO  WKS-CAL-FUNCION.                                                 
022090 PERFORM 010-0300-CALL-THECALENDAR.                                           
022120*<FIN LBM> TERMINACION DE IFS ANIDADOS HASTA EXIT PERFORM                     
022201 IF WKS-CAL-FUNCION = 0                                                       
022202  IF WKS-ENT-NUMPAN NOT = 30                                                  
022203*<INICIO RMT> VALIDACION FECHA PANTALLA 29                                    
022205   IF WKS-ENT-NUMPAN = 29                                                     
022207      NEXT SENTENCE                                                           
022208   ELSE                                                                       
022209*<FIN RMT> VALIDACION FECHA PANTALLA 29                                       
022210     IF WKS-ENT-NUMPAN = 27                                                   
022211        MOVE WKS-ENT-FECHA TO WKS-CAL-FECHA1                                  
022212     ELSE                                                                     
022213*<INI LBM> SE QUITA COMENTARIO LINEA 022214 Y 022217                          
022214*    IF WKS-ENT-NUMPAN = 28                                                   
022215        MOVE WKS-ENT-SERV2-FECHA TO WKS-CAL-FECHA1                            
022217*    ELSE                                                                     
022219*       NEXT SENTENCE                                                         
022220*          MOVE WKS-ENT-FECHA   TO  WKS-CAL-FECHA1                            
022230     MOVE 18 TO WKS-CAL-FUNCION                                               
022240     PERFORM 010-0300-CALL-THECALENDAR                                        
022250     IF WKS-CAL-FECHA1 = 0                                                    
022260        MOVE 76 TO W77-RES-LIBCON                                             
022270        MOVE "FECHA INHABIL" TO WKS-SAL-ERRLEY                                
022280     ELSE                                                                     
022290           NEXT SENTENCE                                                      
022291  ELSE                                                                        
022292    MOVE WKS-ENT-P30FEC-INI     TO WKS-CAL-FECHA1                             
022293    MOVE 18 TO WKS-CAL-FUNCION                                                
022294    PERFORM 010-0300-CALL-THECALENDAR                                         
022295    IF WKS-CAL-FECHA1 = 0                                                     
022296       MOVE 76 TO W77-RES-LIBCON                                              
022297       MOVE "FECHA INHABIL" TO WKS-SAL-ERRLEY                                 
022298    ELSE                                                                      
022299       PERFORM 010-0030-VALIDA-FECHA-FIN                                      
022300 ELSE                                                                         
022310    MOVE 19 TO W77-RES-LIBCON                                                 
022320    MOVE "FECHA INVALIDA" TO WKS-SAL-ERRLEY.                                  
022322*<INI LBM> VALIDA FECHAS PANTALLA 30                                          
022346*<FIN LBM> VALIDA FECHAS PANTALLA 30                                          
022400                                                                              
022500 010-0300-CALL-THECALENDAR.                                                   
022600*--------------------------                                                   
022610     MOVE ZEROS                    TO  WKS-CAL-FECHA2.                        
022700     MOVE 13                       TO WKS-CAL-FORMATO.                        
022800     CALL "THECALENDAR OF LOCSUP"                                             
022900                          USING WKS-CAL-FUNCION,                              
023000                                WKS-CAL-FECHA1,                               
023100                                WKS-CAL-FECHA2,                               
023200                                WKS-CAL-FORMATO.                              
023300                                                                              
023400 010-0400-VALIDA-COND.                                                        
023500*---------------------                                                        
023700     IF WKS-ENT-CONTRATO > 0 AND                                              
023800        WKS-ENT-AUTORIZA > 0                                                  
023900           MOVE 1 TO WS-CASO                                                  
024100     ELSE                                                                     
024300     IF WKS-ENT-CONTRATO > 0 AND                                              
024310        (WKS-ENT-AUTORIZA = 0 OR WKS-ENT-AUTORIZA = " ")                      
024400           MOVE 2 TO WS-CASO                                                  
024600     ELSE                                                                     
024800     IF (WKS-ENT-CONTRATO = 0 OR WKS-ENT-CONTRATO = " ") AND                  
024810        (WKS-ENT-AUTORIZA = 0 OR WKS-ENT-AUTORIZA = " ")                      
024900           MOVE 3 TO WS-CASO                                                  
025100     ELSE                                                                     
025300     IF (WKS-ENT-CONTRATO = 0 OR WKS-ENT-CONTRATO = " ") AND                  
025400        WKS-ENT-AUTORIZA > 0                                                  
025500           MOVE 4 TO WS-CASO                                                  
025700     ELSE                                                                     
026300           MOVE 77 TO W77-RES-LIBCON                                          
026400           MOVE "CONSULTA NO VALIDA" TO WKS-SAL-ERRLEY.                       
026510                                                                              
026600     IF W77-RES-LIBCON > 0                                                    
026700       PERFORM 010-0400-LIMPIA-ULT-DAT                                        
026800       PERFORM 010-0400-ACT-DAT-INI                                           
026900     ELSE                                                                     
027000       PERFORM 010-0400-CASOS-VALIDOS.                                        
029100                                                                              
029200 010-0400-CASOS-VALIDOS.                                                      
029300*---------------------------                                                  
029400     PERFORM 010-0400-VALIDA-MISMA-CONS.                                      
029500     IF WS-MISMA-CONS = 0  AND WKS-ENT-MAS-MOVS > 0                           
030200           PERFORM 010-0400-CARGA-ULT-CONS                                    
030300     ELSE                                                                     
030400        PERFORM 010-0400-CARGA-DAT-CONS.                                      
030500*Busca 1er registro                                                           
030600     IF W77-RES-LIBCON = 0                                                    
030610        IF WS-CASO = 1                                                        
030620           PERFORM 010-BUSCA-PRIMERO-CASO-1                                   
030630        ELSE                                                                  
030700          IF WS-CASO = 2                                                      
030800             PERFORM 010-BUSCA-PRIMERO-CASO-2                                 
030900          ELSE                                                                
031000            IF WS-CASO = 3                                                    
031100               PERFORM 010-BUSCA-PRIMERO-CASO-3                               
031200            ELSE                                                              
031300              IF WS-CASO = 4                                                  
031400                 PERFORM 010-BUSCA-PRIMERO-CASO-4                             
031630     ELSE                                                                     
031640         EXIT PERFORM.                                                        
031700                                                                              
031800     IF WS-OK = 1                                                             
031900        MOVE 78 TO W77-RES-LIBCON                                             
032000        MOVE "NO EXISTE INFORMACION" TO WKS-SAL-ERRLEY                        
032100        PERFORM 010-0400-LIMPIA-ULT-DAT                                       
032200        PERFORM 010-0400-ACT-DAT-INI                                          
032300     ELSE                                                                     
032400        MOVE 1  TO WS-CONT                                                    
032500        MOVE ZERO TO WS-TERMINA                                               
032600        PERFORM 010-0400-RUTINA-COMUN UNTIL WS-TERMINA = 1                    
032700        MOVE WKS-ENT-SIS    TO WKS-SAL-SIS                                    
032800        MOVE WKS-ENT-NUMPAN TO WKS-SAL-NUMPAN.                                
032900                                                                              
033000 010-0400-RUTINA-COMUN.                                                       
033100*----------------------                                                       
033200   IF WS-CONT > 14                                                            
033300      MOVE 1 TO WS-TERMINA                                                    
033400      MOVE 1 TO WKS-SAL-MAS-MOVS                                              
033500      MOVE "HAY MAS INFORMACION" TO WKS-SAL-LEY                               
033600      PERFORM 010-0400-ACT-DAT-INI                                            
033700   ELSE                                                                       
033800      PERFORM 010-0400-GUARDA-ULT-CONS                                        
033900      PERFORM 010-0400-ARMA-MENSAJE                                           
033910      IF WS-CASO = 1                                                          
033920         PERFORM 010-BUSCA-SIGUIENTE-CASO-1                                   
033930      ELSE                                                                    
034000        IF WS-CASO = 2                                                        
034100           PERFORM 010-BUSCA-SIGUIENTE-CASO-2                                 
034200        ELSE                                                                  
034300          IF WS-CASO = 3                                                      
034400             PERFORM 010-BUSCA-SIGUIENTE-CASO-3                               
034500          ELSE                                                                
034600            IF WS-CASO = 4                                                    
034700               PERFORM 010-BUSCA-SIGUIENTE-CASO-4.                            
035000                                                                              
035020   IF WS-CONT > 14                                                            
035040      IF WS-CASO = 2 OR WS-CASO = 3                                           
035060         PERFORM 010-0400-GUARDA-ULT-CONS.                                    
035080                                                                              
035100   IF WKS-SAL-MAS-MOVS = 0                                                    
035200      IF WS-OK = 1                                                            
035210         MOVE 0 TO WKS-SAL-MAS-MOVS                                           
035300         MOVE 1 TO WS-TERMINA                                                 
035400         MOVE "NO HAY MAS INFORMACION" TO WKS-SAL-LEY                         
035500         PERFORM 010-0400-ACT-DAT-INI                                         
035600      ELSE                                                                    
035800         ADD 1  TO WS-CONT.                                                   
035900                                                                              
036000 010-0400-ARMA-MENSAJE.                                                       
036100*----------------------                                                       
036120   MOVE B07-HR-CARGO  TO WKS-HORA.                                            
036140   MOVE WKS-HH        TO WKS-HH-SAL.                                          
036160   MOVE WKS-MM        TO WKS-MM-SAL.                                          
036200   MOVE B07-CVE-TRANS TO WKS-SAL-CLAVE(WS-CONT).                              
036300   MOVE B07-IMPORTE   TO WKS-SAL-IMPORTE(WS-CONT).                            
036400   MOVE B07-STATUS    TO WKS-SAL-ESTATUS(WS-CONT).                            
036450   MOVE WKS-HORA-SAL  TO WKS-SAL-HORA(WS-CONT).                               
036600   MOVE B07-TIPO-MOV  TO WKS-SAL-TIPOMOV(WS-CONT).                            
036700   MOVE B07-CONTRATO  TO WKS-SAL-CTO(WS-CONT).                                
036900   MOVE B07-AUT-S151  TO WKS-SAL-AUT-S151(WS-CONT).                           
037000   MOVE B07-AUT-PC    TO WKS-SAL-AUT-PC(WS-CONT).                             
037100   MOVE B07-NUM-ENV   TO WKS-SAL-NUM-ENV(WS-CONT).                            
037110   MOVE B07-NUM-ERROR TO WKS-SAL-CVE-ERR(WS-CONT).                            
037120   MOVE B07-NUM-OCURR TO WKS-SAL-OCCURS(WS-CONT).                             
037200                                                                              
037300 010-0400-VALIDA-MISMA-CONS.                                                  
037400*---------------------------                                                  
037500     IF WKS-ENT-FECHA-ANT    = WKS-ENT-FECHA    AND                           
037700        WKS-ENT-CONTRATO-ANT = WKS-ENT-CONTRATO AND                           
037800        WKS-ENT-AUTORIZA-ANT = WKS-ENT-AUTORIZA                               
037900        MOVE ZERO TO WS-MISMA-CONS                                            
038000     ELSE                                                                     
038050        MOVE 0 TO WKS-ENT-MAS-MOVS                                            
038100        MOVE 1 TO WS-MISMA-CONS.                                              
038200                                                                              
038300 010-0400-LIMPIA-ULT-DAT.                                                     
038400*------------------------                                                     
038500     MOVE ZERO TO WKS-SAL-FECHA-ULT.                                          
038700     MOVE ZERO TO WKS-SAL-CONTRATO-ULT.                                       
038800     MOVE ZERO TO WKS-SAL-AUTORIZA-ULT.                                       
038810     MOVE ZERO TO WKS-SAL-OCCURS-ULT.                                         
038900                                                                              
039000 010-0400-ACT-DAT-INI.                                                        
039100*---------------------                                                        
039200     MOVE WKS-ENT-FECHA    TO WKS-SAL-FECHA-ANT                               
039210                              WKS-SAL-FECHA.                                  
039400     MOVE WKS-ENT-CONTRATO TO WKS-SAL-CONTRATO-ANT                            
039410                              WKS-SAL-CONTRATO.                               
039500     MOVE WKS-ENT-AUTORIZA TO WKS-SAL-AUTORIZA-ANT                            
039510                              WKS-SAL-AUTORIZA.                               
039600                                                                              
039700 010-0400-CARGA-DAT-CONS.                                                     
039800*------------------------                                                     
039900     MOVE WKS-ENT-FECHA    TO WKS-FECHA-CONS.                                 
040100     MOVE WKS-ENT-CONTRATO TO WKS-CONTRATO-CONS.                              
040200     MOVE WKS-ENT-AUTORIZA TO WKS-AUTORIZA-CONS.                              
040300                                                                              
040400 010-0400-CARGA-ULT-CONS.                                                     
040500*------------------------                                                     
040600     MOVE WKS-ENT-FECHA-ULT    TO WKS-FECHA-CONS.                             
040800     MOVE WKS-ENT-CONTRATO-ULT TO WKS-CONTRATO-CONS.                          
040900     MOVE WKS-ENT-AUTORIZA-ULT TO WKS-AUTORIZA-CONS.                          
040910     MOVE WKS-ENT-OCCURS-ULT   TO WKS-OCCURS-CONS.                            
041000                                                                              
041100 010-0400-GUARDA-ULT-CONS.                                                    
041200*-------------------------                                                    
041300     MOVE B07-FEC-CARGO TO WKS-SAL-FECHA-ULT.                                 
041400     ADD  20000000      TO WKS-SAL-FECHA-ULT.                                 
041500     MOVE B07-CONTRATO  TO WKS-SAL-CONTRATO-ULT.                              
041600     MOVE B07-AUT-S151  TO WKS-SAL-AUTORIZA-ULT.                              
041602     MOVE B07-NUM-OCURR TO WKS-SAL-OCCURS-ULT.                                
041610                                                                              
041620 010-BUSCA-PRIMERO-CASO-1.                                                    
041630*--------------------------                                                   
041640         PERFORM 010-0400-PRIMER-CASO-1.                                      
041650                                                                              
041660 010-BUSCA-SIGUIENTE-CASO-1.                                                  
041670*-----------------------------                                                
041680         PERFORM 010-0400-SIGUIENTE-CASO-1.                                   
041690                                                                              
041700 010-BUSCA-PRIMERO-CASO-2.                                                    
041710*--------------------------                                                   
041720     IF WKS-ENT-MAS-MOVS > 0                                                  
041730         PERFORM 010-0400-PRIMER-CASO-2-REC                                   
041740     ELSE                                                                     
041750         PERFORM 010-0400-PRIMER-CASO-2.                                      
041760                                                                              
041770 010-BUSCA-SIGUIENTE-CASO-2.                                                  
041780*-----------------------------                                                
041790*     IF WKS-ENT-MAS-MOVS > 0                                                 
041800*         PERFORM 010-0400-SIGUIENTE-CASO-2-REC                               
041810*     ELSE                                                                    
041820         PERFORM 010-0400-SIGUIENTE-CASO-2.                                   
041830                                                                              
041840 010-BUSCA-PRIMERO-CASO-3.                                                    
041850*--------------------------                                                   
041860     IF WKS-ENT-MAS-MOVS > 0                                                  
041870         PERFORM 010-0400-PRIMER-CASO-3-REC                                   
041880     ELSE                                                                     
041890         PERFORM 010-0400-PRIMER-CASO-3.                                      
041900                                                                              
041910 010-BUSCA-SIGUIENTE-CASO-3.                                                  
041920*-----------------------------                                                
041930*     IF WKS-ENT-MAS-MOVS > 0                                                 
041940*         PERFORM 010-0400-SIGUIENTE-CASO-3-REC                               
041950*     ELSE                                                                    
041960         PERFORM 010-0400-SIGUIENTE-CASO-3.                                   
042110                                                                              
042120 010-BUSCA-PRIMERO-CASO-4.                                                    
042130*--------------------------                                                   
042140         PERFORM 010-0400-PRIMER-CASO-4.                                      
042150                                                                              
042160 010-BUSCA-SIGUIENTE-CASO-4.                                                  
042170*-----------------------------                                                
042180         PERFORM 010-0400-SIGUIENTE-CASO-4.                                   
042190                                                                              
042350 010-0400-PRIMER-CASO-1.                                                      
042360*-----------------------                                                      
042370     MOVE        ZERO TO WS-OK                                                
042380     FIND  FIRST B07SXFECHA                                                   
042390       AT B07-NUM-ID    = 1 AND                                               
042400          B07-FEC-CARGO = WKS-FECHA-CONS AND                                  
042410          B07-CONTRATO  = WKS-CONTRATO-CONS AND                               
042500          B07-AUT-S151  = WKS-AUTORIZA-CONS                                   
042600          ON EXCEPTION                                                        
042700          IF DMSTATUS(NOTFOUND)                                               
042800             MOVE 1 TO WS-OK.                                                 
042900                                                                              
042910 010-0400-SIGUIENTE-CASO-1.                                                   
042920*-----------------------                                                      
042930     MOVE        ZERO TO WS-OK                                                
042940     FIND  NEXT B07SXFECHA                                                    
042945*<INICIO JMLT> MODIFICACION                                                   
042950*       AT B07-NUM-ID    = 1 AND                                              
042954       AT B07-NUM-ID   = WKS-SERVICIO       AND                               
042958*<INICIO JMLT> MODIFICACION                                                   
042960          B07-FEC-CARGO = WKS-FECHA-CONS    AND                               
042970          B07-CONTRATO  = WKS-CONTRATO-CONS AND                               
042980          B07-AUT-S151  = WKS-AUTORIZA-CONS                                   
042990          ON EXCEPTION                                                        
043000          IF DMSTATUS(NOTFOUND)                                               
043010             MOVE 1 TO WS-OK.                                                 
043020                                                                              
043030 010-0400-PRIMER-CASO-2.                                                      
043100*-----------------------                                                      
043200     MOVE        ZERO TO WS-OK                                                
043300     FIND  FIRST B07SXFECHA                                                   
043400       AT B07-NUM-ID    = 1 AND                                               
043500          B07-FEC-CARGO = WKS-FECHA-CONS AND                                  
043600          B07-CONTRATO  = WKS-CONTRATO-CONS                                   
043700          ON EXCEPTION                                                        
043800          IF DMSTATUS(NOTFOUND)                                               
043900             MOVE 1 TO WS-OK.                                                 
043910                                                                              
043920 010-0400-PRIMER-CASO-2-REC.                                                  
043930*-----------------------                                                      
043940     MOVE        ZERO TO WS-OK                                                
043950     FIND  FIRST B07SXFECHA                                                   
043960       AT B07-NUM-ID    = 1 AND                                               
043970          B07-FEC-CARGO = WKS-FECHA-CONS AND                                  
043980          B07-CONTRATO  = WKS-CONTRATO-CONS AND                               
043990          B07-AUT-S151 = WKS-AUTORIZA-CONS AND                                
043995          B07-NUM-OCURR = WKS-OCCURS-CONS                                     
044000          ON EXCEPTION                                                        
044010          IF DMSTATUS(NOTFOUND)                                               
044020             MOVE 1 TO WS-OK.                                                 
044030                                                                              
044100 010-0400-SIGUIENTE-CASO-2.                                                   
044200*--------------------------                                                   
044300     MOVE        ZERO TO WS-OK                                                
044400     FIND  NEXT B07SXFECHA                                                    
044450*<INICIO JMLT> MODIFICACION                                                   
044500*       AT B07-NUM-ID    = 1 AND                                              
044540       AT B07-NUM-ID    = WKS-SERVICIO   AND                                  
044580*<FIN JMLT> MODIFICACION                                                      
044600          B07-FEC-CARGO = WKS-FECHA-CONS AND                                  
044700          B07-CONTRATO  = WKS-CONTRATO-CONS                                   
044800          ON EXCEPTION                                                        
044900          IF DMSTATUS(NOTFOUND)                                               
045000             MOVE 1 TO WS-OK.                                                 
045010                                                                              
045020 010-0400-SIGUIENTE-CASO-2-REC.                                               
045030*--------------------------                                                   
045040     MOVE        ZERO TO WS-OK                                                
045050     FIND  NEXT B07SXFECHA                                                    
045060       AT B07-NUM-ID    = 1 AND                                               
045070          B07-FEC-CARGO = WKS-FECHA-CONS AND                                  
045080          B07-CONTRATO  = WKS-CONTRATO-CONS AND                               
045090          B07-AUT-S151 > WKS-AUTORIZA-CONS                                    
045100          ON EXCEPTION                                                        
045110          IF DMSTATUS(NOTFOUND)                                               
045120             MOVE 1 TO WS-OK.                                                 
045130                                                                              
045200 010-0400-PRIMER-CASO-3.                                                      
045300*-----------------------                                                      
045400     MOVE        ZERO TO WS-OK                                                
045500     FIND  FIRST B07SXFECHA                                                   
045600       AT B07-NUM-ID    = 1 AND                                               
045700          B07-FEC-CARGO = WKS-FECHA-CONS                                      
045800          ON EXCEPTION                                                        
045900          IF DMSTATUS(NOTFOUND)                                               
046000             MOVE 1 TO WS-OK.                                                 
046100                                                                              
046110 010-0400-PRIMER-CASO-3-REC.                                                  
046120*-----------------------                                                      
046130     MOVE        ZERO TO WS-OK                                                
046140     FIND  FIRST B07SXFECHA                                                   
046150       AT B07-NUM-ID    = 1 AND                                               
046160          B07-FEC-CARGO = WKS-FECHA-CONS AND                                  
046162          B07-CONTRATO  = WKS-CONTRATO-CONS AND                               
046170          B07-AUT-S151 = WKS-AUTORIZA-CONS AND                                
046172          B07-NUM-OCURR = WKS-OCCURS-CONS                                     
046180          ON EXCEPTION                                                        
046190          IF DMSTATUS(NOTFOUND)                                               
046200             MOVE 1 TO WS-OK.                                                 
046210                                                                              
046220 010-0400-SIGUIENTE-CASO-3.                                                   
046300*--------------------------                                                   
046400     MOVE        ZERO TO WS-OK                                                
046500     FIND  NEXT B07SXFECHA                                                    
046550*<INICIO JMLT> MODIFICACION                                                   
046600*       AT B07-NUM-ID    = 1 AND                                              
046640       AT B07-NUM-ID    = WKS-SERVICIO  AND                                   
046680*<FIN JMLT> MODIFICACION                                                      
046700          B07-FEC-CARGO = WKS-FECHA-CONS                                      
046800          ON EXCEPTION                                                        
046900          IF DMSTATUS(NOTFOUND)                                               
047000             MOVE 1 TO WS-OK.                                                 
047100                                                                              
047110 010-0400-SIGUIENTE-CASO-3-REC.                                               
047120*--------------------------                                                   
047130     MOVE        ZERO TO WS-OK                                                
047140     FIND  NEXT B07SXFECHA                                                    
047150       AT B07-NUM-ID    = 1 AND                                               
047160          B07-FEC-CARGO = WKS-FECHA-CONS AND                                  
047165*         B07-CONTRATO  = WKS-CONTRATO-CONS AND                               
047170          B07-AUT-S151 > WKS-AUTORIZA-CONS                                    
047175*         B07-NUM-OCURR > WKS-OCCURS-CONS                                     
047180          ON EXCEPTION                                                        
047190          IF DMSTATUS(NOTFOUND)                                               
047200             MOVE 1 TO WS-OK.                                                 
048920                                                                              
049000 010-0400-PRIMER-CASO-4.                                                      
049100*-----------------------                                                      
049200     MOVE        ZERO TO WS-OK                                                
049300     FIND  FIRST B07SXFECAUT                                                  
049400       AT B07-NUM-ID    = 1 AND                                               
049410          B07-FEC-CARGO = WKS-FECHA-CONS AND                                  
049500          B07-AUT-S151  = WKS-AUTORIZA-CONS                                   
049600          ON EXCEPTION                                                        
049700          IF DMSTATUS(NOTFOUND)                                               
049800             MOVE 1 TO WS-OK.                                                 
049900                                                                              
050000 010-0400-SIGUIENTE-CASO-4.                                                   
050100*--------------------------                                                   
050200     MOVE        ZERO TO WS-OK                                                
050300     FIND  NEXT B07SXFECAUT                                                   
050400      AT B07-NUM-ID    = 1 AND                                                
050410         B07-FEC-CARGO = WKS-FECHA-CONS AND                                   
050500         B07-AUT-S151  = WKS-AUTORIZA-CONS                                    
050600          ON EXCEPTION                                                        
050700          IF DMSTATUS(NOTFOUND)                                               
050800             MOVE 1 TO WS-OK.                                                 
050900                                                                              
051330 090-ABRE-BASE.                                                               
051340*--------------                                                               
051350     MOVE 0                       TO WS-BANDERA WS-FIN                        
051360     OPEN INQUIRY S151BD13BIFIN                                               
051400          ON EXCEPTION                                                        
051500             MOVE 1               TO WS-FIN                                   
051600             MOVE "BASE NO ABIERTA,ESPERO 10 SEG"                             
051700                                  TO TEXTO-LJ                                 
051800             CALL "LJ IN LIBLJ"                                               
051900                  USING CONTADOR-LJ,MENSAJE-LJ                                
052000             ADD 1                TO WS-VECES                                 
052100             WAIT(10).                                                        
052200                                                                              
052300     IF WS-FIN = 0                                                            
052400        MOVE 1                    TO WS-BANDERA.                              
052500*<INICIA JMLT>RUTINAS PARA PANTALLA 28 SERVICIO 1                             
052600 010-0500-PANTALLA28SERV1.                                                    
052700    IF WKS-ENT-SERV2-FECHA > 0 AND WKS-ENT-SERV2-OPCION = 1 AND               
052800       WKS-ENT-SERV2-CONTCTE > 0 AND WKS-ENT-SERV2-AUTORIZA > 0               
052900         MOVE 1 TO WS-CASO                                                    
053000    ELSE                                                                      
053100    IF WKS-ENT-SERV2-FECHA > 0 AND WKS-ENT-SERV2-OPCION = 2 AND               
053200       WKS-ENT-SERV2-CONTCTE > 0 AND WKS-ENT-SERV2-AUTORIZA > 0               
053300         MOVE 2 TO WS-CASO                                                    
053400    ELSE                                                                      
053500    IF WKS-ENT-SERV2-FECHA > 0 AND WKS-ENT-SERV2-OPCION = 0 AND               
053600       WKS-ENT-SERV2-CONTCTE = 0 AND WKS-ENT-SERV2-AUTORIZA > 0               
053700         MOVE 3 TO WS-CASO                                                    
053800    ELSE                                                                      
053900    IF WKS-ENT-SERV2-FECHA > 0 AND WKS-ENT-SERV2-OPCION = 0 AND               
054000       WKS-ENT-SERV2-CONTCTE = 0 AND WKS-ENT-SERV2-AUTORIZA = 0               
054100         MOVE 4 TO WS-CASO                                                    
054200    ELSE                                                                      
054300    IF WKS-ENT-SERV2-FECHA > 0 AND WKS-ENT-SERV2-OPCION = 2 AND               
054400       WKS-ENT-SERV2-CONTCTE > 0 AND WKS-ENT-SERV2-AUTORIZA = 0               
054500         MOVE 5 TO WS-CASO                                                    
054600    ELSE                                                                      
054700    IF WKS-ENT-SERV2-FECHA > 0 AND WKS-ENT-SERV2-OPCION = 1 AND               
054800       WKS-ENT-SERV2-CONTCTE > 0 AND WKS-ENT-SERV2-AUTORIZA = 0               
054900         MOVE 6 TO WS-CASO                                                    
055000    ELSE                                                                      
055100         MOVE 77 TO W77-RES-LIBCON.                                           
055200                                                                              
055300    IF W77-RES-LIBCON > 0                                                     
055400      MOVE "CONSULTA INVALIDA" TO WKS-SAL-SERV2-LEY                           
055500      PERFORM 010-0500-LIMPIA-ULT-DAT                                         
055600      PERFORM 010-0500-ACT-DAT-INI                                            
055700    ELSE                                                                      
055800      PERFORM 010-0500-CASOS-VALIDOS.                                         
055900                                                                              
056000 010-0500-LIMPIA-ULT-DAT.                                                     
056100     MOVE ZEROS TO WKS-SAL-SERV2-FECHA-ULT.                                   
056200     MOVE ZEROS TO WKS-SAL-SERV2-NUMCTE-ULT.                                  
056300     MOVE ZEROS TO WKS-SAL-SERV2-CONTRATO-ULT.                                
056400     MOVE ZEROS TO WKS-SAL-SERV2-AUTORIZA-ULT.                                
056500     MOVE ZEROS TO WKS-SAL-SERV2-OCCURS-ULT.                                  
056600     MOVE ZEROS TO WKS-SAL-SERV2-MAS-MOVS.                                    
056700                                                                              
056800 010-0500-ACT-DAT-INI.                                                        
056900     MOVE WKS-ENT-SERV2-SERVICIO TO WKS-SAL-SERV2-SERVICIO-ANT                
057000                                    WKS-SAL-SERV2-SERVICIO.                   
057100     MOVE WKS-ENT-SERV2-FECHA    TO WKS-SAL-SERV2-FECHA-ANT                   
057200                                    WKS-SAL-SERV2-FECHA.                      
057300     MOVE WKS-ENT-SERV2-OPCION   TO WKS-SAL-SERV2-OPCION-ANT                  
057400                                    WKS-SAL-SERV2-OPCION.                     
057500     MOVE WKS-ENT-SERV2-CONTCTE  TO WKS-SAL-SERV2-CONTCTE-ANT                 
057600                                    WKS-SAL-SERV2-CONTCTE.                    
057700     MOVE WKS-ENT-SERV2-AUTORIZA TO WKS-SAL-SERV2-AUTORIZA-ANT                
057800                                    WKS-SAL-SERV2-AUTORIZA.                   
057850                                                                              
057900 010-0500-CASOS-VALIDOS.                                                      
058000     PERFORM 010-0500-VALIDA-MISMA-CONS.                                      
058050*    SUBTRACT 20000000 FROM WKS-FECHA-CONS                                    
058100     IF WS-MISMA-CONS  = 1                                                    
058200        PERFORM 010-0500-BUSCA-NVACON                                         
058300     ELSE                                                                     
058400     IF WS-CASO = 1                                                           
058450*INI ISI VMR CONSULTA X AUT APLIC                                             
058500*          PERFORM 010-0500-SETTOBEGB07SXFECHA                                
058600*          PERFORM 010-0400-SIGUIENTE-CASO-1                                  
058625           PERFORM 010-0500-SETTOBEGB07SXCNTAUTAP                             
058650           PERFORM 010-0400-SIGUIENTE-CASO-1-2                                
058675* FIN ISI VMR                                                                 
058700     ELSE                                                                     
058800     IF WS-CASO = 2                                                           
058850* INI ISI VMR CONSULTA X AUT APLIC                                            
058900*          PERFORM 010-0500-SETTOBEGB07SXCTE                                  
059000*          PERFORM 010-0500-NEXTCASO2                                         
059025           PERFORM 010-0500-SETTOBEGB07SXCTEAUTAP                             
059050           PERFORM 010-0500-NEXTCASO2-2                                       
059075* FIN ISI VMR                                     |                           
059100     ELSE                                                                     
059200     IF WS-CASO = 3                                                           
059210* INI ISI VMR CONSULTA X AUT APLIC                                            
059233*          PERFORM 010-0500-SETTOBEGB07SXFECAUT                               
059266*          PERFORM 010-0500-NEXTCASO3-2                                       
059270          PERFORM 010-0500-SETTOBEGB07SXFAUTAP                                
059280          PERFORM 010-0500-NEXTCASO3-2-3                                      
059290* FIN ISI VMR                                                                 
059300*          PERFORM 010-0500-SETTOBEGB07SXFECHA                                
059400*          PERFORM 010-0500-NEXTCASO3                                         
059500     ELSE                                                                     
059600     IF WS-CASO = 4                                                           
059700          PERFORM 010-0500-SETTOBEGB07SXCTE                                   
059800          PERFORM 010-0500-NEXTCASO4                                          
059900     ELSE                                                                     
060000     IF WS-CASO = 5                                                           
060100          PERFORM 010-0500-SETTOBEGB07SXCTE                                   
060200          PERFORM 010-0500-NEXTCASO5                                          
060300     ELSE                                                                     
060400     IF WS-CASO = 6                                                           
060420*INI ISI VMR                                                                  
060440          PERFORM 010-0500-SETTOBEGB07SXCNTAUTAP                              
060460          PERFORM 010-0400-SIGUIENTE-CASO-6.                                  
060500*          PERFORM 010-0500-SETTOBEGB07SXFECHA                                
060600*          PERFORM 010-0400-SIGUIENTE-CASO-2.                                 
060650*FIN ISI VMR                                                                  
060700                                                                              
060800     IF WS-OK = 1                                                             
060900          MOVE 78 TO W77-RES-LIBCON                                           
061000          MOVE "NO EXISTE INFORMACION" TO WKS-SAL-SERV2-LEY                   
061100          PERFORM 010-0500-LIMPIA-ULT-DAT                                     
061200          PERFORM 010-0500-ACT-DAT-INI                                        
061300     ELSE                                                                     
061400          MOVE 1  TO WS-CONT                                                  
061500          MOVE ZERO TO WS-TERMINA                                             
061600          MOVE 0 TO WKS-ENT-SERV2-MAS-MOVS                                    
061700          PERFORM 010-0500-RUTINA-COMUN UNTIL WS-TERMINA = 1                  
061800          MOVE WKS-ENT-SIS        TO WKS-SAL-SIS                              
061900          MOVE WKS-ENT-NUMPAN     TO WKS-SAL-NUMPAN.                          
062000                                                                              
062100                                                                              
062200 010-0500-VALIDA-MISMA-CONS.                                                  
062300     IF WKS-ENT-SERV2-SERVICIO     = WKS-ENT-SERV2-SERVICIO-ANT               
062400        AND WKS-ENT-SERV2-FECHA    = WKS-ENT-SERV2-FECHA-ANT                  
062500        AND WKS-ENT-SERV2-OPCION   = WKS-ENT-SERV2-OPCION-ANT                 
062600        AND WKS-ENT-SERV2-CONTCTE  = WKS-ENT-SERV2-CONTCTE-ANT                
062700        AND WKS-ENT-SERV2-AUTORIZA = WKS-ENT-SERV2-AUTORIZA-ANT               
062800        AND WKS-ENT-SERV2-MAS-MOVS = 1                                        
062900          MOVE 1 TO WS-MISMA-CONS                                             
063000          PERFORM 010-0500-CARGA-CONANT                                       
063100     ELSE                                                                     
063200          MOVE ZERO TO WS-MISMA-CONS                                          
063300          PERFORM 010-0500-CARGA-NVACON.                                      
063400                                                                              
063500 010-0500-CARGA-NVACON.                                                       
063600     IF WKS-ENT-SERV2-OPCION = 1                                              
063700          MOVE WKS-ENT-SERV2-FECHA        TO WKS-FECHA-CONS                   
063800          MOVE 0                          TO WKS-NUMCTE-CONS                  
063900          MOVE WKS-ENT-SERV2-CONTCTE      TO WKS-CONTRATO-CONS                
064000          MOVE WKS-ENT-SERV2-AUTORIZA     TO WKS-AUTORIZA-CONS                
064100          MOVE 0                          TO WKS-OCCURS-CONS                  
064200     ELSE                                                                     
064300          MOVE WKS-ENT-SERV2-FECHA        TO WKS-FECHA-CONS                   
064400          MOVE WKS-ENT-SERV2-CONTCTE      TO WKS-NUMCTE-CONS                  
064500          MOVE 0                          TO WKS-CONTRATO-CONS                
064600          MOVE WKS-ENT-SERV2-AUTORIZA     TO WKS-AUTORIZA-CONS                
064700          MOVE 0                          TO WKS-OCCURS-CONS.                 
064800                                                                              
064900                                                                              
065000 010-0500-CARGA-CONANT.                                                       
065100     MOVE WKS-ENT-SERV2-FECHA-ULT    TO WKS-FECHA-CONS.                       
065200     MOVE WKS-ENT-SERV2-NUMCTE-ULT   TO WKS-NUMCTE-CONS.                      
065300     MOVE WKS-ENT-SERV2-CONTRATO-ULT TO WKS-CONTRATO-CONS.                    
065400     MOVE WKS-ENT-SERV2-AUTORIZA-ULT TO WKS-AUTORIZA-CONS.                    
065500     MOVE WKS-ENT-SERV2-OCCURS-ULT   TO WKS-OCCURS-CONS.                      
065600                                                                              
065700 010-0500-BUSCA-NVACON.                                                       
065705* INI ISI VMR CONSULTA CASO 1, 2 Y 3                                          
065710  IF WS-CASO = 1 OR 2 OR 3                                                    
065715   MOVE WKS-ENT-SERV2-AUTORIZA-ANT TO WKS-AUTORIZA-CONS                       
065720    IF WS-CASO = 1                                                            
065725      PERFORM 010-0510-PRIMER-CASO-1                                          
065730    ELSE                                                                      
065735      IF WS-CASO = 2                                                          
065740        PERFORM 010-510-PRIMER-CASO-2                                         
065745      ELSE                                                                    
065750       IF WS-CASO = 3                                                         
065755         PERFORM 010-510-PRIMER-CASO-3                                        
065760       ELSE                                                                   
065765        NEXT SENTENCE                                                         
065770  ELSE                                                                        
065775     IF WS-CASO = 6                                                           
065780          PERFORM 010-0510-PRIMER-CASO-1                                      
065785     ELSE                                                                     
065790* FIN ISI VMR                                                                 
065800     MOVE  ZERO TO WS-OK                                                      
065900     FIND  FIRST B07SXCTE                                                     
066000       AT B07-NUM-ID    = WKS-ENT-SERV2-SERVICIO AND                          
066100          B07-FEC-CARGO = WKS-FECHA-CONS AND                                  
066200          B07-NUM-CTE   = WKS-NUMCTE-CONS AND                                 
066300          B07-CONTRATO  = WKS-CONTRATO-CONS AND                               
066400          B07-AUT-S151  = WKS-AUTORIZA-CONS AND                               
066500          B07-NUM-OCURR = WKS-OCCURS-CONS                                     
066600          ON EXCEPTION                                                        
066700          IF DMSTATUS(NOTFOUND)                                               
066800             MOVE 1 TO WS-OK.                                                 
066850                                                                              
066900                                                                              
067000 010-0500-NEXTCASO2.                                                          
067100     MOVE  ZERO TO WS-OK                                                      
067200     FIND  NEXT B07SXCTE                                                      
067300       AT B07-NUM-ID    = WKS-SERVICIO            AND                         
067400          B07-FEC-CARGO = WKS-FECHA-CONS          AND                         
067500          B07-NUM-CTE   = WKS-NUMCTE-CONS         AND                         
067600          B07-AUT-S151  = WKS-AUTORIZA-CONS                                   
067700          ON EXCEPTION                                                        
067800          IF DMSTATUS(NOTFOUND)                                               
067900             MOVE 1 TO WS-OK.                                                 
068000                                                                              
068100 010-0500-NEXTCASO3.                                                          
068200     MOVE  ZERO TO WS-OK                                                      
068300     FIND  NEXT B07SXFECHA                                                    
068400       AT B07-NUM-ID    = WKS-SERVICIO            AND                         
068500          B07-FEC-CARGO = WKS-FECHA-CONS          AND                         
068600          B07-AUT-S151  = WKS-AUTORIZA-CONS                                   
068700          ON EXCEPTION                                                        
068800          IF DMSTATUS(NOTFOUND)                                               
068900             MOVE 1 TO WS-OK.                                                 
069000                                                                              
069100 010-0500-NEXTCASO5.                                                          
069200     MOVE  ZERO TO WS-OK                                                      
069300     FIND  NEXT B07SXCTE                                                      
069400       AT B07-NUM-ID    = WKS-SERVICIO            AND                         
069500          B07-FEC-CARGO = WKS-FECHA-CONS          AND                         
069600          B07-NUM-CTE   = WKS-NUMCTE-CONS                                     
069700          ON EXCEPTION                                                        
069800          IF DMSTATUS(NOTFOUND)                                               
069900             MOVE 1 TO WS-OK.                                                 
070000                                                                              
070100 010-0500-SETTOBEGB07SXFECHA.                                                 
070200     SET B07SXFECHA TO BEGINNING.                                             
070300                                                                              
070400 010-0500-RUTINA-COMUN.                                                       
070450* INI ISI VMR                                                                 
070500*     IF WS-CONT > 7                                                          
070533      IF WS-CONT > 4                                                          
070566* FIN ISI VMR                                                                 
070600          MOVE 1 TO WS-TERMINA                                                
070700          MOVE 1 TO WKS-SAL-SERV2-MAS-MOVS                                    
070800          MOVE "HAY MAS INFORMACION" TO WKS-SAL-SERV2-LEY                     
070900          PERFORM 010-0500-ACT-DAT-INI                                        
071000          PERFORM 010-0500-GUARDA-ULT-CONS                                    
071100     ELSE                                                                     
071200          PERFORM 010-0500-ARMA-MENSAJE                                       
071300          PERFORM 010-0500-GUARDA-ULT-CONS                                    
071400                                                                              
071500          IF WS-CASO = 1                                                      
071550* INI ISI VMR CONSULTA X AUT APLIC CASO 1                                     
071600*          PERFORM 010-0400-SIGUIENTE-CASO-1                                  
071630                                                                              
071633           PERFORM 010-0400-SIGUIENTE-CASO-1-2                                
071666* FIN ISI VMR                                                                 
071700          ELSE                                                                
071800          IF WS-CASO = 2                                                      
071850* INI ISI VMR CONSULTA X AUT APLIC CASO 2                                     
071900*          PERFORM 010-0500-NEXTCASO2                                         
071930                                                                              
071933           PERFORM 010-0500-NEXTCASO2-2                                       
071966* FIN ISI VMR                                                                 
072000          ELSE                                                                
072100          IF WS-CASO = 3                                                      
072200*          PERFORM 010-0500-NEXTCASO3                                         
072225* INI ISI VMR CONSULTA X AUT APLIC CASO 3                                     
072250*          PERFORM 010-0500-NEXTCASO3-2                                       
072255                                                                              
072266          PERFORM 010-0500-NEXTCASO3-2-3                                      
072282* FIN ISI VMR                                                                 
072300          ELSE                                                                
072400          IF WS-CASO = 4                                                      
072500          PERFORM 010-0500-NEXTCASO4                                          
072600          ELSE                                                                
072700          IF WS-CASO = 5                                                      
072800          PERFORM 010-0500-NEXTCASO5                                          
072900          ELSE                                                                
073000          IF WS-CASO = 6                                                      
073050*INI ISI VMR                                                                  
073100*          PERFORM 010-0400-SIGUIENTE-CASO-2.                                 
073130           PERFORM 010-0400-SIGUIENTE-CASO-6.                                 
073160*FIN ISI VMR                                                                  
073200                                                                              
073300     IF WKS-SAL-SERV2-MAS-MOVS = 0                                            
073400          IF WS-OK = 1                                                        
073500             MOVE 1 TO WS-TERMINA                                             
073550             MOVE 0 TO WKS-SAL-SERV2-MAS-MOVS                                 
073600             MOVE "NO HAY MAS INFORMACION" TO WKS-SAL-SERV2-LEY               
073700             PERFORM 010-0500-ACT-DAT-INI                                     
073800             PERFORM 010-0500-LIMPIA-ULT-DAT                                  
073900          ELSE                                                                
074000             ADD 1 TO WS-CONT.                                                
074100                                                                              
074200 010-0500-GUARDA-ULT-CONS.                                                    
074300    MOVE B07-FEC-CARGO      TO WKS-SAL-SERV2-FECHA-ULT.                       
074400    ADD 20000000            TO WKS-SAL-SERV2-FECHA-ULT.                       
074500    MOVE B07-NUM-CTE        TO WKS-SAL-SERV2-NUMCTE-ULT.                      
074600    MOVE B07-CONTRATO       TO WKS-SAL-SERV2-CONTRATO-ULT.                    
074615*INI ISI VMR                                                                  
074630    IF WS-CASO = 6                                                            
074645       MOVE B07-AUT-APLIC   TO WKS-SAL-SERV2-AUTORIZA-ULT                     
074660    ELSE                                                                      
074675*FIN ISI VMR                                                                  
074700    MOVE B07-AUT-S151       TO WKS-SAL-SERV2-AUTORIZA-ULT.                    
074800    MOVE B07-NUM-OCURR      TO WKS-SAL-SERV2-OCCURS-ULT.                      
074900                                                                              
075000 010-0500-ARMA-MENSAJE.                                                       
075100    MOVE B07-DAT-GEN        TO WKS-DATGEN.                                    
075150* INI ISI VMR MOSTRAMOS AUTORIZACION APLICACION                               
075200*    MOVE B07-AUT-S151       TO WKS-SAL-SERV2-AUT151(WS-CONT).                
075210    MOVE B07-AUT-APLIC      TO WKS-SAL-SERV2-AUT151(WS-CONT).                 
075220* FIN ISIS VMR                                                                
075300    MOVE B07-NUM-CTE        TO WKS-SAL-SERV2-NUMCTE(WS-CONT).                 
075400    MOVE B07-CONTRATO       TO WKS-SAL-SERV2-CONTRATO(WS-CONT).               
075500    MOVE WKS-PROD           TO WKS-SAL-SERV2-PROD(WS-CONT).                   
075600    MOVE WKS-INST           TO WKS-SAL-SERV2-INST(WS-CONT).                   
075700    MOVE WKS-IMP            TO WKS-SAL-SERV2-IMP(WS-CONT).                    
075800    MOVE WKS-SDOF           TO WKS-SAL-SERV2-SDOFIN(WS-CONT).                 
075900    MOVE B07-CVE-TRANS      TO WKS-SAL-SERV2-CVETRAN(WS-CONT).                
076000    MOVE WKS-SUC            TO WKS-SAL-SERV2-SUC(WS-CONT).                    
076100    MOVE WKS-CAJA           TO WKS-SAL-SERV2-CAJ(WS-CONT).                    
076200    MOVE B07-STATUS         TO WKS-SAL-SERV2-STATUS(WS-CONT).                 
076300    MOVE B07-TIPO-MOV       TO WKS-SAL-SERV2-TIPOMOV(WS-CONT).                
076400    MOVE B07-NUM-ERROR      TO WKS-SAL-SERV2-ERROR(WS-CONT).                  
076433    MOVE B07-NUM-OCURR      TO WKS-SAL-SERV2-OC(WS-CONT).                     
076466    MOVE B07-NUM-ENV        TO WKS-SAL-SERV2-ENV(WS-CONT).                    
076481    MOVE WKS-NAT            TO WKS-SAL-SERV2-NAT(WS-CONT).                    
076490* INI ISI VMR AGREGAMOS FECHAS AL MSG DE SALIDA                               
076496    MOVE B07-FEC-CARGO      TO WKS-FECHA-ARRIBO.                              
076500    MOVE B07-HR-CARGO       TO WKS-HRS-MAQARR.                                
076510    MOVE "-"                TO WKS-SAL-S2-FEG1(WS-CONT)                       
076511            WKS-SAL-S2-FEG2(WS-CONT) WKS-SAL-S2-FCG1(WS-CONT)                 
076512            WKS-SAL-S2-FCG2(WS-CONT).                                         
076513    MOVE "/"                TO WKS-SAL-S2-FEDI(WS-CONT)                       
076514                               WKS-SAL-S2-FCDI(WS-CONT).                      
076515    IF WKS-FECNAT-AA = ZEROS                                                  
076516       MOVE 0 TO WKS-SAL-S2-FECEN(WS-CONT)                                    
076520    ELSE                                                                      
076530       MOVE 20 TO WKS-SAL-S2-FECEN(WS-CONT).                                  
076540    IF WKS-FNCAN-AA = ZEROS                                                   
076550       MOVE 0 TO WKS-SAL-S2-FCCEN(WS-CONT)                                    
076560    ELSE                                                                      
076570       MOVE 20 TO WKS-SAL-S2-FCCEN(WS-CONT).                                  
076580    MOVE ":"               TO WKS-SAL-S2-FE2P(WS-CONT)                        
076590         WKS-SAL-S2-FE2P2(WS-CONT) WKS-SAL-S2-FC2P(WS-CONT)                   
076591         WKS-SAL-S2-FC2P2(WS-CONT).                                           
076592                                                                              
076593    MOVE WKS-FARR-AA        TO WKS-FECHR-FAAA.                                
076594    MOVE WKS-FARR-MM        TO WKS-FECHR-FAMM.                                
076600    MOVE WKS-FARR-DD        TO WKS-FECHR-FADD.                                
076605    MOVE WKS-HRS-ARRHH      TO WKS-FECHR-FAHH.                                
076610    MOVE WKS-HRS-ARRMM      TO WKS-FECHR-FAMI.                                
076615    MOVE WKS-HRS-ARRSS      TO WKS-FECHR-FASS.                                
076620    MOVE WKS-FECHR-CARGO    TO WKS-SAL-SERV2-FECARR(WS-CONT).                 
076625    MOVE WKS-FECNAT-AA      TO WKS-SAL-S2-FEAA(WS-CONT).                      
076630    MOVE WKS-FECNAT-MM      TO WKS-SAL-S2-FEMM(WS-CONT).                      
076635    MOVE WKS-FECNAT-DD      TO WKS-SAL-S2-FEDD(WS-CONT).                      
076640    MOVE WKS-HRS-MAQHH      TO WKS-SAL-S2-FEHH(WS-CONT).                      
076645    MOVE WKS-HRS-MAQMM      TO WKS-SAL-S2-FEMI(WS-CONT).                      
076650    MOVE WKS-HRS-MAQSS      TO WKS-SAL-S2-FESS(WS-CONT).                      
076655    MOVE WKS-FNCAN-AA       TO WKS-SAL-S2-FCAA(WS-CONT).                      
076660    MOVE WKS-FNCAN-MM       TO WKS-SAL-S2-FCMM(WS-CONT).                      
076665    MOVE WKS-FNCAN-DD       TO WKS-SAL-S2-FCDD(WS-CONT).                      
076670    MOVE WKS-HRS-CANHH      TO WKS-SAL-S2-FCHH(WS-CONT).                      
076675    MOVE WKS-HRS-CANMM      TO WKS-SAL-S2-FCMI(WS-CONT).                      
076680    MOVE WKS-HRS-CANSS      TO WKS-SAL-S2-FCSS(WS-CONT).                      
076685                                                                              
076690* FIN ISI VMR                                                                 
076695                                                                              
076700 010-0500-NEXTCASO4.                                                          
076800*--------------------------                                                   
076900     MOVE        ZERO TO WS-OK                                                
077000     FIND  NEXT B07SXCTE                                                      
077100       AT B07-NUM-ID    = WKS-SERVICIO  AND                                   
077200          B07-FEC-CARGO = WKS-FECHA-CONS                                      
077300          ON EXCEPTION                                                        
077400          IF DMSTATUS(NOTFOUND)                                               
077500             MOVE 1 TO WS-OK.                                                 
077600                                                                              
077700                                                                              
077800 010-0500-SETTOBEGB07SXCTE.                                                   
077900*--------------------------------                                             
078000     SET B07SXCTE TO BEGINNING.                                               
078100                                                                              
078200*<FIN JMLT>RUTINAS PARA PANTALLA 28 SERVICIO 1                                
078300                                                                              
078400*<INICIO RMT> PANTALLA 29                                                     
078500 010-2900-PANTALLA29.                                                         
078600*----------------------                                                       
078650   MOVE 0 TO W77-OPC-BUS-MIG.                                                 
078700   IF WKS-ENT-MIG-FEC >  0  AND WKS-ENT-MIG-MDA = 0    AND                    
078800      WKS-ENT-MIG-SUC =  0  AND WKS-ENT-MIG-CTOCTA = 0 AND                    
078900      WKS-ENT-MIG-TAR =  0  AND WKS-ENT-MIG-BIN    = 0                        
079000*            BUSQUEDA POR FECHA                                               
079100      MOVE 1 TO W77-OPC-BUS-MIG                                               
079200   ELSE                                                                       
079300     IF  WKS-ENT-MIG-FEC >  0  AND                                            
079400        (WKS-ENT-MIG-MDA =  0  OR  WKS-ENT-MIG-MDA    = 1) AND                
079500         WKS-ENT-MIG-SUC >  0  AND WKS-ENT-MIG-CTOCTA > 0  AND                
079600         WKS-ENT-MIG-TAR =  0  AND WKS-ENT-MIG-BIN    = 0                     
079700        IF WKS-ENT-MIG-MDA = 0                                                
079800*            BUSQUEDA POR FECHA-SUCURSALPROM-CONTRATO                         
079900           MOVE 2 TO W77-OPC-BUS-MIG                                          
080000        ELSE                                                                  
080100*            BUSQUEDA POR FECHA-SUCURSAL-CTA CHEQUES                          
080200           MOVE 3 TO W77-OPC-BUS-MIG                                          
080300     ELSE                                                                     
080400       IF WKS-ENT-MIG-FEC    >  0  AND WKS-ENT-MIG-MDA = 2 AND                
080500          WKS-ENT-MIG-TAR    >  0  AND WKS-ENT-MIG-SUC = 0 AND                
080600          WKS-ENT-MIG-CTOCTA =  0  AND WKS-ENT-MIG-BIN = 0                    
080700*            BUSQUEDA POR FECHA-TARJETA                                       
080800             MOVE 4 TO W77-OPC-BUS-MIG                                        
080900       ELSE                                                                   
081000         IF WKS-ENT-MIG-BIN    >  0 AND WKS-ENT-MIG-MDA = 0 AND               
081050            WKS-ENT-MIG-SUC    =  0 AND                                       
081100            WKS-ENT-MIG-CTOCTA =  0 AND WKS-ENT-MIG-TAR = 0                   
081110            IF WKS-ENT-MIG-FEC > 0                                            
081120               IF WKS-ENT-MIG-FEC-ANT = 0 AND                                 
081130                  WKS-ENT-MIG-MAS-MOVS = 1                                    
081140                  MOVE 0 TO WKS-ENT-MIG-FEC                                   
081150*                 BUSQUEDA POR BIN                                            
081160                  MOVE 6 TO W77-OPC-BUS-MIG                                   
081170               ELSE                                                           
081180*                 BUSQUEDA POR FECHA-BIN                                      
081400                  MOVE 5 TO W77-OPC-BUS-MIG                                   
081500            ELSE                                                              
081600*              BUSQUEDA POR BIN                                               
081700               MOVE 6 TO W77-OPC-BUS-MIG                                      
081800         ELSE                                                                 
081900*            CONSULTA INVALIDA                                                
082000            MOVE 77 TO W77-RES-LIBCON.                                        
082100                                                                              
082200   IF W77-RES-LIBCON > 0                                                      
082300     MOVE "CONSULTA INVALIDA" TO WKS-SAL-MIG-LEY                              
082400     PERFORM 010-2900-LIMPIA-ULT-DAT                                          
082500     PERFORM 010-2900-ACT-DAT-INI                                             
082600   ELSE                                                                       
082700     PERFORM 010-2900-BUSQUEDA-CASOS.                                         
082800                                                                              
082900 010-2900-LIMPIA-ULT-DAT.                                                     
083000*-------------------------                                                    
083100   MOVE ZEROS TO WKS-ENT-MIG-FEC-ULT.                                         
083200   MOVE ZEROS TO WKS-ENT-MIG-AUT151-ULT.                                      
083500   MOVE ZEROS TO WKS-ENT-MIG-SUC-ULT.                                         
083600   MOVE ZEROS TO WKS-ENT-MIG-CTOCTA-ULT.                                      
083800   MOVE ZEROS TO WKS-ENT-MIG-TAR-ULT.                                         
084000   MOVE ZEROS TO WKS-ENT-MIG-NUMOCC-ULT.                                      
084100                                                                              
084200 010-2900-ACT-DAT-INI.                                                        
084300*----------------------                                                       
084400   MOVE WKS-ENT-MIG-MDA    TO WKS-SAL-MIG-MDA-ANT                             
084500                              WKS-SAL-MIG-MDA.                                
084510   IF W88-X-BIN                                                               
084520      MOVE WKS-ENT-MIG-FEC TO WKS-SAL-MIG-FEC-ANT                             
084530      MOVE ZEROS           TO WKS-SAL-MIG-FEC                                 
084540   ELSE                                                                       
084550      MOVE WKS-ENT-MIG-FEC TO WKS-SAL-MIG-FEC-ANT                             
084700                              WKS-SAL-MIG-FEC.                                
084800   MOVE WKS-ENT-MIG-SUC    TO WKS-SAL-MIG-SUC-ANT                             
084900                              WKS-SAL-MIG-SUC.                                
085000   MOVE WKS-ENT-MIG-CTOCTA TO WKS-SAL-MIG-CTOCTA-ANT                          
085100                              WKS-SAL-MIG-CTOCTA.                             
085200   MOVE WKS-ENT-MIG-TAR    TO WKS-SAL-MIG-TAR-ANT                             
085300                              WKS-SAL-MIG-TAR.                                
085400   MOVE WKS-ENT-MIG-BIN    TO WKS-SAL-MIG-BIN-ANT                             
085500                              WKS-SAL-MIG-BIN.                                
085600                                                                              
085700 010-2900-BUSQUEDA-CASOS.                                                     
085800*-------------------------                                                    
085900   PERFORM 010-2900-VALIDA-MISMA-CONS.                                        
086000                                                                              
086100   IF WKS-MISMA-CONSULTA = 1                                                  
086200      PERFORM 010-2900-BUSCA-NVACON                                           
086300   ELSE                                                                       
086400      IF W88-X-FEC                                                            
086500         PERFORM 010-2900-STB-B08SXFECTAR                                     
086600         PERFORM 010-2900-NEXT-B08SXFECTAR0                                   
086700      ELSE                                                                    
086800         IF W88-X-FEC-SUC-CTO                                                 
086900            PERFORM 010-2900-STB-B08SXFECSUCCTO                               
087000            PERFORM 010-2900-NEXT-B08SXFECSUCCTO                              
087100         ELSE                                                                 
087200            IF W88-X-FEC-SUC-CTA                                              
087300               PERFORM 010-2900-STB-B08SXFECSUCTAR                            
087400               PERFORM 010-2900-NEXT-B08SXFECSUCTAR                           
087500            ELSE                                                              
087600               IF W88-X-FEC-TAR                                               
087700                  PERFORM 010-2900-STB-B08SXFECTAR                            
087800                  PERFORM 010-2900-NEXT-B08SXFECTAR                           
087900               ELSE                                                           
088000                  IF W88-X-FEC-BIN                                            
088100                     PERFORM 010-2900-STB-B08SXFECBIN                         
088200                     PERFORM 010-2900-NEXT-B08SXFECBIN                        
088300                  ELSE                                                        
088400                     IF W88-X-BIN                                             
088500                        PERFORM 010-2900-STB-B08SXBINFEC                      
088600                        PERFORM 010-2900-NEXT-B08SXBINFEC.                    
088650   IF W88-X-BIN                                                               
088700      PERFORM 010-2900-OBT-FECHA.                                             
088750                                                                              
088800   IF WKS-B08 = 1                                                             
088900      MOVE 78 TO W77-RES-LIBCON                                               
089000      MOVE "NO EXISTE INFORMACION" TO WKS-SAL-MIG-LEY                         
089100      PERFORM 010-2900-LIMPIA-ULT-DAT                                         
089200      PERFORM 010-2900-ACT-DAT-INI                                            
089300   ELSE                                                                       
089400      MOVE 1  TO WS-CONT                                                      
089500      MOVE ZERO TO WS-TERMINA                                                 
089600      MOVE 0 TO WKS-ENT-MIG-MAS-MOVS                                          
089700      PERFORM 010-2900-RUTINA-COMUN UNTIL WS-TERMINA = 1                      
089800      MOVE WKS-ENT-SIS        TO WKS-SAL-SIS                                  
089900      MOVE WKS-ENT-NUMPAN     TO WKS-SAL-NUMPAN.                              
089910                                                                              
089920 010-2900-OBT-FECHA.                                                          
089930*---------------------                                                        
089940   IF WKS-B08 = 0                                                             
089950      MOVE B08-FEC-MIG TO WKS-ENT-MIG-FEC.                                    
089960                                                                              
090100 010-2900-VALIDA-MISMA-CONS.                                                  
090200*----------------------------                                                 
090210  MOVE 0 TO WKS-MISMA-CONSULTA.                                               
090300  IF WKS-ENT-MIG-MDA      = WKS-ENT-MIG-MDA-ANT     AND                       
090400     WKS-ENT-MIG-FEC      = WKS-ENT-MIG-FEC-ANT     AND                       
090500     WKS-ENT-MIG-SUC      = WKS-ENT-MIG-SUC-ANT     AND                       
090600     WKS-ENT-MIG-CTOCTA   = WKS-ENT-MIG-CTOCTA-ANT  AND                       
090700     WKS-ENT-MIG-TAR      = WKS-ENT-MIG-TAR-ANT     AND                       
090800     WKS-ENT-MIG-BIN      = WKS-ENT-MIG-BIN-ANT     AND                       
090900     WKS-ENT-MIG-MAS-MOVS = 1                                                 
091000     MOVE 1 TO WKS-MISMA-CONSULTA                                             
091100     PERFORM 010-2900-CARGA-CONS-ANTERIOR                                     
091200  ELSE                                                                        
091300     MOVE ZERO TO WKS-MISMA-CONSULTA                                          
091400     PERFORM 010-2900-CARGA-NVA-CONSULTA.                                     
091500                                                                              
091600 010-2900-CARGA-CONS-ANTERIOR.                                                
091700*------------------------------                                               
091800   MOVE WKS-ENT-MIG-FEC-ULT     TO WKS-CONS-FEC                               
091900   MOVE WKS-ENT-MIG-AUT151-ULT  TO WKS-CONS-AUT151                            
092200   MOVE WKS-ENT-MIG-SUC-ULT     TO WKS-CONS-SUC                               
092300   MOVE WKS-ENT-MIG-CTOCTA-ULT  TO WKS-CONS-CTOCTA                            
092500   MOVE WKS-ENT-MIG-TAR-ULT     TO WKS-CONS-TAR                               
092700   MOVE WKS-ENT-MIG-NUMOCC-ULT  TO WKS-CONS-NUMOCC.                           
092800                                                                              
092900 010-2900-CARGA-NVA-CONSULTA.                                                 
093000*------------------------------                                               
093100   MOVE 0 TO WKS-CONS-FEC                                                     
093200   MOVE 0 TO WKS-CONS-SUC                                                     
093300   MOVE 0 TO WKS-CONS-CTOCTA                                                  
093400   MOVE 0 TO WKS-CONS-TAR                                                     
093500   MOVE 0 TO WKS-CONS-BIN.                                                    
093600                                                                              
093700   IF W88-X-FEC                                                               
093800      MOVE WKS-ENT-MIG-FEC TO WKS-CONS-FEC                                    
093900   ELSE                                                                       
094000      IF W88-X-FEC-SUC-CTO                                                    
094100         MOVE WKS-ENT-MIG-FEC    TO WKS-CONS-FEC                              
094200         MOVE WKS-ENT-MIG-SUC    TO WKS-CONS-SUC                              
094300         MOVE WKS-ENT-MIG-CTOCTA TO WKS-CONS-CTOCTA                           
094400      ELSE                                                                    
094500         IF W88-X-FEC-SUC-CTA                                                 
094600            MOVE WKS-ENT-MIG-FEC    TO WKS-CONS-FEC                           
094700            MOVE WKS-ENT-MIG-SUC    TO WKS-CONS-SUC                           
094800            MOVE WKS-ENT-MIG-CTOCTA TO WKS-CONS-CTOCTA                        
094900         ELSE                                                                 
095000            IF W88-X-FEC-TAR                                                  
095100               MOVE WKS-ENT-MIG-FEC TO WKS-CONS-FEC                           
095200               MOVE WKS-ENT-MIG-TAR TO WKS-CONS-TAR                           
095300            ELSE                                                              
095400               IF W88-X-FEC-BIN                                               
095500                  MOVE WKS-ENT-MIG-FEC TO WKS-CONS-FEC                        
095600                  MOVE WKS-ENT-MIG-BIN TO WKS-CONS-BIN                        
095700               ELSE                                                           
095800                  IF W88-X-BIN                                                
095900                     MOVE WKS-ENT-MIG-BIN TO WKS-CONS-BIN.                    
096000                                                                              
096100 010-2900-BUSCA-NVACON.                                                       
096200*-----------------------                                                      
096300   PERFORM 010-2900-FIRST-B08SXFECTAR.                                        
096400                                                                              
096500 010-2900-STB-B08SXBINFEC.                                                    
096600*--------------------------                                                   
096700   SET B08SXBINFEC TO BEGINNING.                                              
096800                                                                              
096900 010-2900-STB-B08SXFECBIN.                                                    
097000*--------------------------                                                   
097100   SET B08SXFECBIN TO BEGINNING.                                              
097200                                                                              
097300 010-2900-STB-B08SXFECSUCCTO.                                                 
097400*-----------------------------                                                
097500   SET B08SXFECSUCCTO TO BEGINNING.                                           
097600                                                                              
097700                                                                              
097800 010-2900-STB-B08SXFECSUCTAR.                                                 
097900*--------------------------                                                   
098000   SET B08SXFECSUCTAR TO BEGINNING.                                           
098100                                                                              
098200 010-2900-STB-B08SXFECTAR.                                                    
098300*--------------------------                                                   
098400   SET B08SXFECTAR TO BEGINNING.                                              
098500                                                                              
098600 010-2900-NEXT-B08SXFECTAR0.                                                  
098700*------------------------------                                               
098800   MOVE        ZERO TO WKS-B08                                                
098900   FIND  NEXT B08SXFECTAR                                                     
099000     AT B08-FEC-MIG  = WKS-CONS-FEC                                           
099100        ON EXCEPTION                                                          
099200        IF DMSTATUS(NOTFOUND)                                                 
099300           MOVE 1 TO WKS-B08.                                                 
099400                                                                              
099500 010-2900-NEXT-B08SXFECSUCCTO.                                                
099600*----------------------------                                                 
099700   MOVE        ZERO TO WKS-B08                                                
099800   FIND  NEXT B08SXFECSUCCTO                                                  
099900     AT B08-FEC-MIG   = WKS-CONS-FEC    AND                                   
100000        B08-SUC-PROM  = WKS-CONS-SUC    AND                                   
100100        B08-CONTRATO  = WKS-CONS-CTOCTA                                       
100200        ON EXCEPTION                                                          
100300        IF DMSTATUS(NOTFOUND)                                                 
100400           MOVE 1 TO WKS-B08.                                                 
100500                                                                              
100600 010-2900-NEXT-B08SXFECSUCTAR.                                                
100700*----------------------------                                                 
100800   MOVE        ZERO TO WKS-B08                                                
100900   FIND  NEXT B08SXFECSUCTAR                                                  
101000     AT B08-FEC-MIG = WKS-CONS-FEC    AND                                     
101100        B08-MDA-SUC = WKS-CONS-SUC    AND                                     
101150        B08-TAR-BIN = WKS-CONS-CTOCTA-6 AND                                   
101200        B08-TAR-CTA = WKS-CONS-CTOCTA-10                                      
101300        ON EXCEPTION                                                          
101400        IF DMSTATUS(NOTFOUND)                                                 
101500           MOVE 1 TO WKS-B08.                                                 
101600                                                                              
101700 010-2900-NEXT-B08SXFECTAR.                                                   
101800*----------------------------                                                 
101900   MOVE        ZERO TO WKS-B08                                                
102000   FIND  NEXT B08SXFECTAR                                                     
102100     AT B08-FEC-MIG     = WKS-CONS-FEC AND                                    
102200        B08-TAR-BIN = WKS-CONS-TAR-BIN AND                                    
102250        B08-TAR-CTA = WKS-CONS-TAR-CTA                                        
102300        ON EXCEPTION                                                          
102400        IF DMSTATUS(NOTFOUND)                                                 
102500           MOVE 1 TO WKS-B08.                                                 
102600                                                                              
102700 010-2900-NEXT-B08SXFECBIN.                                                   
102800*----------------------------                                                 
102900   MOVE        ZERO TO WKS-B08                                                
103000   FIND  NEXT B08SXFECBIN                                                     
103100     AT B08-FEC-MIG = WKS-CONS-FEC AND                                        
103200        B08-TAR-BIN = WKS-CONS-BIN                                            
103300        ON EXCEPTION                                                          
103400        IF DMSTATUS(NOTFOUND)                                                 
103500           MOVE 1 TO WKS-B08.                                                 
103600                                                                              
103700 010-2900-NEXT-B08SXBINFEC.                                                   
103800*----------------------------                                                 
103900   MOVE        ZERO TO WKS-B08                                                
104000   FIND  NEXT B08SXBINFEC                                                     
104100     AT B08-TAR-BIN = WKS-CONS-BIN                                            
104200        ON EXCEPTION                                                          
104300        IF DMSTATUS(NOTFOUND)                                                 
104400           MOVE 1 TO WKS-B08.                                                 
104500                                                                              
104600                                                                              
104700**************************************************************************    
104800 010-2900-FIRST-B08SXFECTAR.                                                  
104900*------------------------------                                               
105000   MOVE        ZERO TO WKS-B08                                                
105100   FIND  FIRST B08SXFECTAR                                                    
105200     AT B08-FEC-MIG      = WKS-CONS-FEC     AND                               
105300        B08-TAR-BIN      = WKS-CONS-TAR-BIN AND                               
105350        B08-TAR-CTA      = WKS-CONS-TAR-CTA AND                               
105380        B08-AUT-S151     = WKS-CONS-AUT151  AND                               
105400        B08-NUMOCURRS    = WKS-CONS-NUMOCC                                    
105500        ON EXCEPTION                                                          
105600        IF DMSTATUS(NOTFOUND)                                                 
105700           MOVE 1 TO WKS-B08.                                                 
105800                                                                              
105900 010-2900-RUTINA-COMUN.                                                       
106000*------------------------                                                     
106100   IF WS-CONT > 11                                                            
106200      MOVE 1 TO WS-TERMINA                                                    
106300      MOVE 1 TO WKS-SAL-MIG-MAS-MOVS                                          
106400      MOVE "HAY MAS INFORMACION" TO WKS-SAL-MIG-LEY                           
106500      PERFORM 010-2900-ACT-DAT-INI                                            
106600      PERFORM 010-2900-GUARDA-ULT-CONS                                        
106700   ELSE                                                                       
106800      PERFORM 010-2900-ARMA-MENSAJE                                           
106900      PERFORM 010-2900-GUARDA-ULT-CONS                                        
107000                                                                              
107100      IF W88-X-FEC                                                            
107200         PERFORM 010-2900-NEXT-B08SXFECTAR0                                   
107300      ELSE                                                                    
107400         IF W88-X-FEC-SUC-CTO                                                 
107500            PERFORM 010-2900-NEXT-B08SXFECSUCCTO                              
107600         ELSE                                                                 
107700            IF W88-X-FEC-SUC-CTA                                              
107800               PERFORM 010-2900-NEXT-B08SXFECSUCTAR                           
107900            ELSE                                                              
108000               IF W88-X-FEC-TAR                                               
108100                  PERFORM 010-2900-NEXT-B08SXFECTAR                           
108200               ELSE                                                           
108300                  IF W88-X-FEC-BIN                                            
108400                     PERFORM 010-2900-NEXT-B08SXFECBIN                        
108500                  ELSE                                                        
108600                     IF W88-X-BIN                                             
108700                        PERFORM 010-2900-NEXT-B08SXBINFEC.                    
108800                                                                              
108900   IF WKS-SAL-MIG-MAS-MOVS = 0                                                
109000        IF WKS-B08 = 1                                                        
109100           MOVE 1 TO WS-TERMINA                                               
109200           MOVE 0 TO WKS-SAL-MIG-MAS-MOVS                                     
109300           MOVE "NO HAY MAS INFORMACION" TO WKS-SAL-MIG-LEY                   
109400           PERFORM 010-2900-ACT-DAT-INI                                       
109500           PERFORM 010-2900-LIMPIA-ULT-DAT                                    
109600        ELSE                                                                  
109700           ADD 1 TO WS-CONT.                                                  
109800                                                                              
109900 010-2900-GUARDA-ULT-CONS.                                                    
110000*----------------------------                                                 
110100   MOVE B08-FEC-MIG     TO WKS-SAL-MIG-FEC-ULT                                
110200   MOVE B08-AUT-S151    TO WKS-SAL-MIG-AUT151-ULT                             
110250   IF W88-X-FEC-SUC-CTO                                                       
110300      MOVE B08-SUC-PROM    TO WKS-SAL-MIG-SUC-ULT                             
110350      MOVE B08-CONTRATO    TO WKS-SAL-MIG-CTOCTA-ULT                          
110400   ELSE                                                                       
110450      MOVE B08-MDA-SUC     TO WKS-SAL-MIG-SUC-ULT                             
110460      MOVE B08-TAR-BIN     TO WKS-SAL-MIG-CTOCTA-6-ULT                        
110500      MOVE B08-TAR-CTA     TO WKS-SAL-MIG-CTOCTA-10-ULT.                      
110800   MOVE B08-TAR-BIN     TO WKS-SAL-MIG-TAR-BIN-ULT                            
110900   MOVE B08-TAR-CTA     TO WKS-SAL-MIG-TAR-CTA-ULT                            
111000   MOVE B08-NUMOCURRS   TO WKS-SAL-MIG-NUMOCC-ULT.                            
111100                                                                              
111200 010-2900-ARMA-MENSAJE.                                                       
111300*------------------------                                                     
111400   MOVE B08-AUT-S151    TO WKS-SAL-MIG-DAT-AUT151(WS-CONT).                   
111500   MOVE B08-CVE-TRANS   TO WKS-SAL-MIG-DAT-CVETRAN(WS-CONT).                  
111600   MOVE B08-IMPORTE     TO WKS-SAL-MIG-DAT-IMPORTE(WS-CONT).                  
111800   MOVE B08-SUC-PROM    TO WKS-SAL-MIG-DAT-SUC(WS-CONT)                       
111900   MOVE B08-CONTRATO    TO WKS-SAL-MIG-DAT-CTOCTA(WS-CONT)                    
112300   MOVE B08-MDA-SUC     TO WKS-SAL-MIG-DAT-SUCMDA(WS-CONT).                   
112400   MOVE B08-TAR-BIN     TO WKS-SAL-MIG-DAT-TAR-BIN(WS-CONT).                  
112450   MOVE B08-TAR-CTA     TO WKS-SAL-MIG-DAT-TAR-CTA(WS-CONT).                  
112500   MOVE B08-STATUS      TO WKS-SAL-MIG-DAT-SM(WS-CONT).                       
112600                                                                              
112700*<FIN RMT> PANTALLA 29                                                        
112800                                                                              
112900 010-0500-SETTOBEGB07SXFECAUT.                                                
113000*--------------------------------                                             
113100     SET B07SXFECAUT TO BEGINNING.                                            
113200                                                                              
113300 010-0500-NEXTCASO3-2.                                                        
113400*--------------------------                                                   
113500     MOVE        ZERO TO WS-OK                                                
113600     FIND  NEXT B07SXFECAUT AT                                                
113700           B07-NUM-ID    = WKS-SERVICIO AND                                   
113800           B07-FEC-CARGO = WKS-FECHA-CONS AND                                 
113900           B07-AUT-S151  = WKS-AUTORIZA-CONS                                  
114000     ON EXCEPTION                                                             
114100     IF DMSTATUS(NOTFOUND)                                                    
114200       MOVE 1 TO WS-OK.                                                       
114300                                                                              
114400* INI ISI VMR CONSUTAS X AUT APIC                                             
114500 010-0500-SETTOBEGB07SXCNTAUTAP.                                              
114600*===============================                                              
114700   SET B07SXCNTAUTAP TO BEGINNING.                                            
114800                                                                              
114900 010-0500-SETTOBEGB07SXCTEAUTAP.                                              
115000*===============================                                              
115100   SET B07SXCTEAUTAP TO BEGINNING.                                            
115200                                                                              
115300 010-0500-SETTOBEGB07SXFAUTAP.                                                
115400*===============================                                              
115500   SET B07SXFAUTAP TO BEGINNING.                                              
115600                                                                              
115700 010-0400-SIGUIENTE-CASO-1-2.                                                 
115800*============================                                                 
115900   MOVE        ZERO TO WS-OK                                                  
116000   FIND  NEXT B07SXCNTAUTAP                                                   
116100        AT B07-NUM-ID    = WKS-SERVICIO      AND                              
116200           B07-FEC-CARGO = WKS-FECHA-CONS    AND                              
116300           B07-CONTRATO  = WKS-CONTRATO-CONS AND                              
116400           B07-AUT-APLIC = WKS-AUTORIZA-CONS                                  
116500                                                                              
116600           ON EXCEPTION                                                       
116700           IF DMSTATUS(NOTFOUND)                                              
116800              MOVE 1 TO WS-OK.                                                
116900                                                                              
117000 010-0500-NEXTCASO2-2.                                                        
117100*============================                                                 
117200   MOVE  ZERO TO WS-OK                                                        
117300   FIND  NEXT B07SXCTEAUTAP                                                   
117400       AT B07-NUM-ID    = WKS-SERVICIO       AND                              
117500          B07-FEC-CARGO = WKS-FECHA-CONS     AND                              
117600          B07-NUM-CTE   = WKS-NUMCTE-CONS    AND                              
117700          B07-AUT-APLIC = WKS-AUTORIZA-CONS                                   
117800                                                                              
117900          ON EXCEPTION                                                        
118000          IF DMSTATUS(NOTFOUND)                                               
118100             MOVE 1 TO WS-OK.                                                 
118200                                                                              
118300 010-0500-NEXTCASO3-2-3.                                                      
118400*=======================                                                      
118500   MOVE        ZERO TO WS-OK.                                                 
118600   FIND  NEXT B07SXFAUTAP AT                                                  
118700         B07-NUM-ID    = WKS-SERVICIO      AND                                
118800         B07-FEC-CARGO = WKS-FECHA-CONS    AND                                
118900         B07-AUT-APLIC = WKS-AUTORIZA-CONS                                    
119000                                                                              
119100   ON EXCEPTION                                                               
119200   IF DMSTATUS(NOTFOUND)                                                      
119300       MOVE 1 TO WS-OK.                                                       
119400                                                                              
119500 010-0510-PRIMER-CASO-1.                                                      
119600*========================                                                     
119700   MOVE  ZERO TO WS-OK                                                        
119800   FIND  FIRST B07SXCNTAUTAP                                                  
119900     AT B07-NUM-ID    = WKS-ENT-SERV2-SERVICIO AND                            
120000        B07-FEC-CARGO = WKS-FECHA-CONS         AND                            
120100        B07-CONTRATO  = WKS-CONTRATO-CONS      AND                            
120200        B07-AUT-APLIC = WKS-AUTORIZA-CONS      AND                            
120300        B07-NUM-OCURR = WKS-OCCURS-CONS                                       
120400        ON EXCEPTION                                                          
120500        IF DMSTATUS(NOTFOUND)                                                 
120600           MOVE 1 TO WS-OK.                                                   
120700                                                                              
120800 010-510-PRIMER-CASO-2.                                                       
120900*=========================                                                    
121000    MOVE  ZERO TO WS-OK                                                       
121100   FIND  FIRST B07SXCTEAUTAP                                                  
121200      AT B07-NUM-ID    = WKS-SERVICIO       AND                               
121300         B07-FEC-CARGO = WKS-FECHA-CONS     AND                               
121400         B07-NUM-CTE   = WKS-NUMCTE-CONS    AND                               
121500         B07-AUT-APLIC = WKS-AUTORIZA-CONS  AND                               
121600         B07-NUM-OCURR = WKS-OCCURS-CONS                                      
121700         ON EXCEPTION                                                         
121800         IF DMSTATUS(NOTFOUND)                                                
121900             MOVE 1 TO WS-OK.                                                 
122000                                                                              
122100 010-510-PRIMER-CASO-3.                                                       
122200*========================                                                     
122300   MOVE        ZERO TO WS-OK.                                                 
122400   FIND  FIRST B07SXFAUTAP AT                                                 
122500        B07-NUM-ID    = WKS-SERVICIO   AND                                    
122600        B07-FEC-CARGO = WKS-FECHA-CONS AND                                    
122700        B07-AUT-APLIC = WKS-AUTORIZA-CONS AND                                 
122800        B07-NUM-OCURR = WKS-OCCURS-CONS                                       
122900        ON EXCEPTION                                                          
123000        IF DMSTATUS(NOTFOUND)                                                 
123100           MOVE 1 TO WS-OK.                                                   
123200                                                                              
123300 010-0400-SIGUIENTE-CASO-6.                                                   
123400*============================                                                 
123500   MOVE        ZERO TO WS-OK                                                  
123600   FIND  NEXT B07SXCNTAUTAP                                                   
123700        AT B07-NUM-ID    = WKS-SERVICIO      AND                              
123800           B07-FEC-CARGO = WKS-FECHA-CONS    AND                              
123900           B07-CONTRATO  = WKS-CONTRATO-CONS                                  
124000           ON EXCEPTION                                                       
124100           IF DMSTATUS(NOTFOUND)                                              
124200              MOVE 1 TO WS-OK.                                                
124300* FIN ISI VMR                                                                 
124400                                                                              
124500*<INI LBM> FECHA FINAL HABIL Y VALIDA DE PANTALLA 30                          
124600 010-0030-VALIDA-FECHA-FIN.                                                   
124700   MOVE WKS-ENT-P30FEC-FIN     TO WKS-CAL-FECHA1                              
124800   MOVE 20 TO  WKS-CAL-FUNCION.                                               
124900   PERFORM 010-0300-CALL-THECALENDAR.                                         
125000   IF WKS-CAL-FUNCION = 0                                                     
125100      MOVE WKS-ENT-P30FEC-FIN     TO WKS-CAL-FECHA1                           
125200      MOVE 18 TO  WKS-CAL-FUNCION                                             
125300      PERFORM 010-0300-CALL-THECALENDAR                                       
125400      IF WKS-CAL-FECHA1 = 0                                                   
125500         MOVE 76 TO W77-RES-LIBCON                                            
125600         MOVE "FECHA INHABIL" TO WKS-SAL-ERRLEY                               
125700      ELSE                                                                    
125800         IF WKS-ENT-P30FEC-INI > WKS-ENT-P30FEC-FIN                           
125900            MOVE 97 TO W77-RES-LIBCON                                         
126000            MOVE "RANGO DE FECHA INVALIDO" TO WKS-SAL-ERRLEY                  
126100         ELSE                                                                 
126200            NEXT SENTENCE                                                     
126300   ELSE                                                                       
126400      MOVE 19 TO W77-RES-LIBCON                                               
126500      MOVE "FECHA INVALIDA" TO WKS-SAL-ERRLEY.                                
126600*<FIN LBM> FECHA FINAL HABIL Y VALIDA DE PANTALLA 30                          
126700                                                                              
126800*<INI LBM> SE RECIBE CONSULTA DE PANTALLA 30                                  
126900 010-0030-PANTALLA30.                                                         
127000   PERFORM 010-0030-CASO-BUSQUEDA.                                            
127100   IF W77-RES-LIBCON              >  0                                        
127200      MOVE "CONSULTA INVALIDA"    TO WKS-SAL-LEY-30                           
127300      PERFORM 010-0030-LIMPIA-ULT-DAT                                         
127400      PERFORM 010-0030-ACT-DAT-INI                                            
127500   ELSE                                                                       
127600      PERFORM 010-0030-CASOS-VALIDOS.                                         
127700*<FIN LBM> SE RECIBE CONSULTA DE PANTALLA 30                                  
127800                                                                              
127900*<INI LBM> IDENTIFICA CASO PARA LA CONSULTA                                   
128000 010-0030-CASO-BUSQUEDA.                                                      
128100   MOVE 0                         TO WS-CASO                                  
128200   IF WKS-ENT-P30SUC         =  0  AND  WKS-ENT-P30CTA  =  0  AND             
128300    WKS-ENT-P30A151          =  0  AND  WKS-ENT-P30AAP  =  0  AND             
128350    WKS-ENT-P30CTO           =  0                                             
128400      MOVE 1                         TO WS-CASO                               
128500   ELSE                                                                       
128600      IF WKS-ENT-P30SUC      >  0  AND  WKS-ENT-P30CTA  >  0  AND             
128700       WKS-ENT-P30A151       =  0  AND  WKS-ENT-P30AAP  =  0  AND             
128750       WKS-ENT-P30CTO        =  0                                             
128800         MOVE 2                   TO WS-CASO                                  
128900      ELSE                                                                    
129000         IF WKS-ENT-P30SUC   =  0  AND  WKS-ENT-P30CTA  >  0  AND             
129100          WKS-ENT-P30A151    =  0  AND  WKS-ENT-P30AAP  =  0  AND             
129150          WKS-ENT-P30CTO     =  0                                             
129200            MOVE 3                TO WS-CASO                                  
129300         ELSE                                                                 
129400            IF WKS-ENT-P30SUC  = 0  AND WKS-ENT-P30CTA  =  0  AND             
129500             WKS-ENT-P30A151   > 0  AND WKS-ENT-P30AAP  =  0  AND             
129550             WKS-ENT-P30CTO    = 0                                            
129600               MOVE 4             TO WS-CASO                                  
129700            ELSE                                                              
129800               IF WKS-ENT-P30SUC = 0 AND WKS-ENT-P30CTA =  0  AND             
129900                WKS-ENT-P30A151  = 0 AND WKS-ENT-P30AAP >  0  AND             
129950                WKS-ENT-P30CTO   = 0                                          
130000                  MOVE 5          TO WS-CASO                                  
130100               ELSE                                                           
130110                 IF WKS-ENT-P30SUC > 0 AND WKS-ENT-P30CTA = 0 AND             
130120                  WKS-ENT-P30A151 = 0  AND WKS-ENT-P30AAP = 0 AND             
130130                  WKS-ENT-P30CTO > 0                                          
130140                    MOVE 6          TO WS-CASO                                
130150                 ELSE                                                         
130200                    MOVE 77         TO W77-RES-LIBCON.                        
130300*<FIN LBM> IDENTIFICA CASO PARA LA CONSULTA                                   
130400                                                                              
130500*<INI LBM> SE IDENTIFICA CRITERIO DE BUSQUEDA                                 
130600 010-0030-CASOS-VALIDOS.                                                      
130700   MOVE 0 TO WS-OK.                                                           
130800   PERFORM 010-0030-VALIDA-MISMA-CONS.                                        
130900   IF  WS-CASO = 3                                                            
131000      MOVE ZEROS TO WKS-SUC-30-CONS.                                          
131100   IF WS-MISMA-CONS                =  1                                       
131200      PERFORM 010-0030-FFIRST-SCROLL                                          
131300   ELSE                                                                       
131400      PERFORM 010-0030-FFIRST-NVACONS.                                        
131500   IF WS-OK                             =  1                                  
131600      IF WS-MISMA-CONS                  =  1                                  
131700         MOVE 77                        TO W77-RES-LIBCON                     
131800         MOVE "CONSULTA INVALIDA"       TO WKS-SAL-LEY-30                     
131900         PERFORM 010-0030-LIMPIA-ULT-DAT                                      
132000         PERFORM 010-0030-ACT-DAT-INI                                         
132100      ELSE                                                                    
132200         MOVE 78 TO W77-RES-LIBCON                                            
132300         MOVE "NO EXISTE INFORMACION"   TO WKS-SAL-LEY-30                     
132400         PERFORM 010-0030-LIMPIA-ULT-DAT                                      
132500         PERFORM 010-0030-ACT-DAT-INI                                         
132600   ELSE                                                                       
132700          MOVE 1                        TO WS-CONT                            
132800          MOVE 0                        TO END-BD10                           
132900          MOVE 0                        TO WKS-ENT-P30MMOVS                   
133000          PERFORM 010-0030-RUTINA-MAXREGS UNTIL                               
133100*               WS-CONT > 8 OR END-BD10 = 1                                   
133150               WS-CONT > 7 OR END-BD10 = 1                                    
133200          MOVE WKS-ENT-SIS        TO WKS-SAL-SIS                              
133300          MOVE WKS-ENT-NUMPAN     TO WKS-SAL-NUMPAN.                          
133400*<FIN LBM> SE IDENTIFICA CRITERIO DE BUSQUEDA                                 
133500                                                                              
133600*<INI LBM> SE CONSULTA COMO MAXIMO 7 REGISTROS                                
133700 010-0030-RUTINA-MAXREGS.                                                     
133800*   IF WS-CONT                   =  8                                         
133850   IF WS-CONT                   =  7                                          
133900      MOVE "HAY MAS INFORMACION" TO WKS-SAL-LEY-30                            
134000      PERFORM 010-0030-ACT-DAT-INI                                            
134100      PERFORM 010-0030-GUARDA-ULT-CONS                                        
134200      MOVE 1                     TO  END-BD10                                 
134300      MOVE 1                     TO  WKS-SAL-P30MMOVS-U                       
134400   ELSE                                                                       
134500      PERFORM 010-0030-ARMA-MENSAJE                                           
134700      ADD  1                     TO  WS-CONT                                  
134800      PERFORM 010-0030-RUTINA-COMUN.                                          
134900*<FIN LBM> SE CONSULTA COMO MAXIMO 7 REGISTROS                                
135000                                                                              
135100*<INI LBM> BUSQUEDA DEL SIGUIENTE REGISTRO                                    
135200 010-0030-RUTINA-COMUN.                                                       
135300   PERFORM 010-0030-NEXT-REGISTRO                                             
135400   IF WS-OK                      =  0                                         
135450      NEXT SENTENCE                                                           
135600   ELSE                                                                       
135700      MOVE 1                     TO  END-BD10.                                
135800*<FIN LBM> BUSQUEDA DEL SIGUIENTE REGISTRO                                    
135900                                                                              
136000*<INI LBM> BUSQUEDA DEL SIGUIENTE REGISTRO SEGUN CRITERIO                     
136100 010-0030-NEXT-REGISTRO.                                                      
136200   IF WS-CASO   =   1                                                         
136300      PERFORM 010-0030-SIGUIENTE-CASO1                                        
136400   ELSE                                                                       
136500      IF (WS-CASO   =   2 OR WS-CASO   =   3)                                 
136600         PERFORM 010-0030-SIGUIENTE-CASO2-3                                   
136700      ELSE                                                                    
136800         IF WS-CASO   =   4                                                   
136900            PERFORM 010-0030-SIGUIENTE-CASO4                                  
137000         ELSE                                                                 
137100            IF WS-CASO   =   5                                                
137200               PERFORM 010-0030-SIGUIENTE-CASO5                               
137210            ELSE                                                              
137220               IF WS-CASO  = 6                                                
137230                  PERFORM 010-0030-SIGUIENTE-CASO6.                           
137300   IF WS-OK = 1                                                               
137400      MOVE   4                      TO W77-RES-LIBCON                         
137600      PERFORM 010-0030-LIMPIA-ULT-DAT                                         
137700      PERFORM 010-0030-ACT-DAT-INI.                                           
137800*<FIN LBM> BUSQUEDA DEL SIGUIENTE REGISTRO SEGUN CRITERIO                     
137900                                                                              
140200*<INI LBM> VALIDA SI ES ULTIMA CONSULTA PARA SCROLL                           
140300 010-0030-VALIDA-MISMA-CONS.                                                  
140400  IF WKS-ENT-P30FEC-INI          =   WKS-ENT-P30FEC-INI-A AND                 
140500    WKS-ENT-P30FEC-FIN           =   WKS-ENT-P30FEC-FIN-A AND                 
140600    WKS-ENT-P30SUC               =   WKS-ENT-P30SUC-A     AND                 
140700    (WKS-ENT-P30CTA              =   WKS-ENT-P30CTA-A     OR                  
140750    WKS-ENT-P30CTO               =   WKS-ENT-P30CTA-A)    AND                 
140800    WKS-ENT-P30A151              =   WKS-ENT-P30A151-A    AND                 
140900    WKS-ENT-P30AAP               =   WKS-ENT-P30AAP-A     AND                 
141000    WKS-ENT-P30MMOVS             =   1                                        
141100    MOVE 1                      TO  WS-MISMA-CONS                             
141200    MOVE WKS-ENT-P30FEC-U       TO  WKS-FECHAI-30-CONS                        
141300    MOVE WKS-ENT-P30SUC         TO  WKS-SUC-30-CONS                           
141400    MOVE WKS-ENT-P30CTA         TO  WKS-CTA-30-CONS                           
141500    MOVE WKS-ENT-P30A151-U      TO  WKS-AUTS151-30-CONS                       
141600    MOVE WKS-ENT-P30AAP         TO  WKS-AUTAPL-30-CONS                        
141650    MOVE WKS-ENT-P30CTO         TO  WKS-CONTRATO-30-CONS                      
141700    MOVE WKS-ENT-P30OCU-U       TO  WKS-NUMOCUR-30-CONS                       
141800  ELSE                                                                        
141900     MOVE 0                      TO  WS-MISMA-CONS                            
142000     MOVE WKS-ENT-P30FEC-INI     TO  WKS-FECHAI-30-CONS                       
142100     MOVE WKS-ENT-P30FEC-FIN     TO  WKS-FECHAF-30-CONS                       
142200     MOVE WKS-ENT-P30SUC         TO  WKS-SUC-30-CONS                          
142300     MOVE WKS-ENT-P30CTA         TO  WKS-CTA-30-CONS                          
142600     MOVE WKS-ENT-P30A151        TO  WKS-AUTS151-30-CONS                      
142700     MOVE WKS-ENT-P30AAP         TO  WKS-AUTAPL-30-CONS                       
142800     MOVE WKS-ENT-P30CTO         TO  WKS-CONTRATO-30-CONS.                    
142900*<FIN LBM> VALIDA SI ES ULTIMA CONSULTA PARA SCROLL                           
143000                                                                              
143100*<INI LBM> PRIMER REGISTRO SCROLL POR CASO                                    
143200 010-0030-FFIRST-SCROLL.                                                      
143300     IF WS-CASO   =  1                                                        
143400        PERFORM 010-0030-1FIRST-SCROLL.                                       
143500     IF (WS-CASO   =  2) OR (WS-CASO   =  3)                                  
143600        PERFORM 010-0030-2Y3FIRST-SCROLL.                                     
143700     IF WS-CASO   =  4                                                        
143800        PERFORM 010-0030-4FIRST-SCROLL.                                       
143900     IF WS-CASO   =  5                                                        
144000        PERFORM 010-0030-5FIRST-SCROLL.                                       
144020     IF WS-CASO   =  6                                                        
144040        PERFORM 010-0030-6FIRST-SCROLL.                                       
144100*<FIN LBM> PRIMER REGISTRO SCROLL POR CASO                                    
144200                                                                              
144300*<INI LBM> PRIMER REGISTRO DEL SCROLL                                         
144400 010-0030-1FIRST-SCROLL.                                                      
144500    FIND FIRST B10SXFECAUT151                                                 
144600         AT B10-NUM-ID           =  3                          AND            
144700            B10-FEC-CARGO        =  WKS-FECHAI-30-CONS-AAMMDD  AND            
144800            B10-AUT-S151         =  WKS-AUTS151-30-CONS        AND            
144900            B10-NUM-OCURR        =  WKS-NUMOCUR-30-CONS                       
145000            ON EXCEPTION                                                      
145100            IF DMSTATUS(NOTFOUND)                                             
145200               MOVE 1 TO WS-OK.                                               
145300                                                                              
145400 010-0030-2Y3FIRST-SCROLL.                                                    
145500    FIND FIRST B10SXSUCFECHA                                                  
145600         AT B10-NUM-ID           =  3                          AND            
145700            B10-MDA-PREF         =  WKS-SUC-30-CONS            AND            
145800            B10-MDA-CUENTA       =  WKS-CTA-30-CONS            AND            
145900            B10-FEC-CARGO        =  WKS-FECHAI-30-CONS-AAMMDD  AND            
146000            B10-AUT-S151         =  WKS-AUTS151-30-CONS        AND            
146100            B10-NUM-OCURR        =  WKS-NUMOCUR-30-CONS                       
146200            ON EXCEPTION                                                      
146300            IF DMSTATUS(NOTFOUND)                                             
146400               MOVE 1 TO WS-OK.                                               
146500                                                                              
146600 010-0030-4FIRST-SCROLL.                                                      
146700    FIND FIRST B10SXAUTFEC                                                    
146800         AT B10-NUM-ID           =  3                   AND                   
146900            B10-AUT-S151         =  WKS-AUTS151-30-CONS AND                   
147000            B10-NUM-OCURR        =  WKS-NUMOCUR-30-CONS AND                   
147100            B10-FEC-CARGO        =  WKS-FECHAI-30-CONS-AAMMDD                 
147200            ON EXCEPTION                                                      
147300            IF DMSTATUS(NOTFOUND)                                             
147400               MOVE 1 TO WS-OK.                                               
147500                                                                              
147600                                                                              
147700 010-0030-5FIRST-SCROLL.                                                      
147800    FIND FIRST B10SXFAUTAP702                                                 
147900         AT B10-NUM-ID           =  3                          AND            
148000            B10-AUTD-AUT702      =  WKS-AUTAPL-30-CONS         AND            
148100            B10-FEC-CARGO        =  WKS-FECHAI-30-CONS-AAMMDD  AND            
148200            B10-AUT-S151         =  WKS-AUTS151-30-CONS        AND            
148300            B10-NUM-OCURR        =  WKS-NUMOCUR-30-CONS                       
148400          ON EXCEPTION                                                        
148500             IF DMSTATUS(NOTFOUND)                                            
148600               MOVE 1 TO WS-OK.                                               
148605                                                                              
148610 010-0030-6FIRST-SCROLL.                                                      
148615    FIND FIRST B10SXCONTRA                                                    
148620         AT B10-NUM-ID           =  3                          AND            
148625            B10-FEC-CARGO        =  WKS-FECHAI-30-CONS-AAMMDD  AND            
148630            B10-CONTRATO         =  WKS-CONTRATO-30-CONS       AND            
148635            B10-SUC-PROM         =  WKS-SUC-30-CONS            AND            
148640            B10-AUT-S151         =  WKS-AUTS151-30-CONS        AND            
148645            B10-NUM-OCURR        =  WKS-NUMOCUR-30-CONS                       
148650         ON EXCEPTION                                                         
148655            IF DMSTATUS(NOTFOUND)                                             
148660               MOVE 1 TO WS-OK.                                               
148700                                                                              
148800*<FIN LBM> PRIMER REGISTRO DEL SCROLL                                         
148900                                                                              
149000*<INI LBM> PRIMER REGISTRO NVA CONSULTA                                       
149100 010-0030-FFIRST-NVACONS.                                                     
149150  SET S151B10DOMI TO BEGINNING.                                               
149200  IF WS-CASO   =  1                                                           
149300     PERFORM 010-0030-NVACONS-CASO1.                                          
149400  IF (WS-CASO   =  2 OR WS-CASO   =  3)                                       
149500     PERFORM 010-0030-NVACONS-CASO2Y3.                                        
149600  IF WS-CASO   =  4                                                           
149700     PERFORM 010-0030-NVACONS-CASO4.                                          
149800  IF WS-CASO   =  5                                                           
149900     PERFORM 010-0030-NVACONS-CASO5.                                          
149920  IF WS-CASO   =  6                                                           
149940     PERFORM 010-0030-NVACONS-CASO6.                                          
150000  IF WS-OK = 0 AND B10-FEC-CARGO > WKS-FECHAF-30-CONS-AAMMDD                  
150100     MOVE 1 TO WS-OK.                                                         
150200*<FIN LBM> PRIMER REGISTRO NVA CONSULTA                                       
150300                                                                              
150400*<INI LBM> FIND FIRST NUEVA CONSULTA                                          
150500                                                                              
150600 010-0030-NVACONS-CASO1.                                                      
150700  FIND FIRST B10SXFECAUT151                                                   
150800       AT B10-NUM-ID        =  3 AND                                          
150900          B10-FEC-CARGO     NOT<  WKS-FECHAI-30-CONS-AAMMDD                   
151000          ON EXCEPTION                                                        
151100          IF DMSTATUS(NOTFOUND)                                               
151200             MOVE 1 TO WS-OK.                                                 
151300                                                                              
151400                                                                              
151500 010-0030-NVACONS-CASO2Y3.                                                    
151600  FIND FIRST B10SXSUCFECHA                                                    
151700       AT B10-NUM-ID           =  3               AND                         
151800          B10-MDA-PREF         =  WKS-SUC-30-CONS AND                         
151900          B10-MDA-CUENTA       =  WKS-CTA-30-CONS AND                         
152000          B10-FEC-CARGO        NOT<  WKS-FECHAI-30-CONS-AAMMDD                
152100          ON EXCEPTION                                                        
152200          IF DMSTATUS(NOTFOUND)                                               
152300             MOVE 1 TO WS-OK.                                                 
152400                                                                              
152500 010-0030-NVACONS-CASO4.                                                      
152600  FIND FIRST B10SXAUTFEC                                                      
152700       AT B10-NUM-ID           =  3                   AND                     
152800          B10-AUT-S151         =  WKS-AUTS151-30-CONS AND                     
152900          B10-FEC-CARGO        NOT<  WKS-FECHAI-30-CONS-AAMMDD                
153000          ON EXCEPTION                                                        
153100          IF DMSTATUS(NOTFOUND)                                               
153200             MOVE 1 TO WS-OK.                                                 
153300                                                                              
153400 010-0030-NVACONS-CASO5.                                                      
153500  FIND FIRST B10SXFAUTAP702                                                   
153600       AT B10-NUM-ID           =  3                   AND                     
153700          B10-AUTD-AUT702      =  WKS-AUTAPL-30-CONS AND                      
153800          B10-FEC-CARGO        NOT<  WKS-FECHAI-30-CONS-AAMMDD                
153900          ON EXCEPTION                                                        
154000          IF DMSTATUS(NOTFOUND)                                               
154100             MOVE 1 TO WS-OK.                                                 
154105                                                                              
154110 010-0030-NVACONS-CASO6.                                                      
154115  FIND FIRST B10SXCONTRA                                                      
154120       AT B10-NUM-ID        =  3  AND                                         
154125          B10-FEC-CARGO     NOT<  WKS-FECHAI-30-CONS-AAMMDD AND               
154130          B10-SUC-PROM         =  WKS-SUC-30-CONS           AND               
154135          B10-CONTRATO         =   WKS-CONTRATO-30-CONS                       
154140          ON EXCEPTION                                                        
154145          IF DMSTATUS(NOTFOUND)                                               
154150             MOVE 1 TO WS-OK.                                                 
154200                                                                              
154300*<INI LBM> FIND FIRST NUEVA CONSULTA                                          
154400                                                                              
154500*<INI LBM> REGISTRO DE ULTIMA CONSULTA SE INICIALIZA EN CERO                  
154600 010-0030-LIMPIA-ULT-DAT.                                                     
154650  IF WKS-ENT-NUMPAN = 30                                                      
154700     MOVE ZEROS                     TO  WKS-SAL-P30FEC-INI-U                  
154800     MOVE ZEROS                     TO  WKS-SAL-P30NUM-OCUR-U                 
155100     MOVE ZEROS                     TO  WKS-SAL-P30A151-U.                    
155400*<FIN LBM> REGISTRO DE ULTIMA CONSULTA SE INICIALIZA EN CERO                  
155500                                                                              
155600*<INI LBM> REGISTRO CONSULTA ANTERIOR ACTUALIZA DATOS DE ENTRADA              
155700 010-0030-ACT-DAT-INI.                                                        
155750  IF WKS-ENT-NUMPAN = 30                                                      
155800     MOVE WKS-ENT-P30FEC-INI        TO  WKS-SAL-FECHAI-ANT-30                 
155900                                        WKS-SAL-FECHAI-30                     
156000     MOVE WKS-ENT-P30FEC-FIN        TO  WKS-SAL-FECHAF-ANT-30                 
156100                                        WKS-SAL-FECHAF-30                     
156200     MOVE WKS-ENT-P30SUC            TO  WKS-SAL-SUC-ANT-30                    
156300                                        WKS-SAL-SUC-30                        
156400     MOVE WKS-ENT-P30CTA            TO  WKS-SAL-CTA-ANT-30                    
156500                                        WKS-SAL-CTA-30                        
156600     MOVE WKS-ENT-P30A151           TO  WKS-SAL-AUTS151-ANT-30                
156700                                        WKS-SAL-AUTS151-30                    
156800     MOVE WKS-ENT-P30AAP            TO  WKS-SAL-AUTAPL-ANT-30                 
156900                                     WKS-SAL-AUT-APL-30                       
156905     MOVE WKS-ENT-P30CTO            TO  WKS-SAL-CTO-30                        
156910     IF WKS-ENT-P30CTO > 0 AND WKS-ENT-P30CTA = 0                             
156920        MOVE WKS-ENT-P30CTO         TO  WKS-SAL-CTA-ANT-30.                   
157000*<FIN LBM> REGISTRO CONSULTA ANTERIOR ACTUALIZA DATOS DE ENTRADA              
157100                                                                              
157200*<INI LBM> SE GUARDA EL ULTIMO REGISTRO ENCONTRADO                            
157300 010-0030-GUARDA-ULT-CONS.                                                    
157400  MOVE B10-FEC-CARGO             TO  WKS-SAL-P30FEC-INI-U.                    
157500  MOVE B10-NUM-OCURR             TO  WKS-SAL-P30NUM-OCUR-U.                   
157800  MOVE B10-AUT-S151              TO  WKS-SAL-P30A151-U.                       
158100*<FIN LBM> SE GUARDA EL ULTIMO REGISTRO ENCONTRADO                            
158200                                                                              
158300*<INI LBM> LLENA ARAREGLO DE SALIDA CON 7 REGISTROS                           
158400 010-0030-ARMA-MENSAJE.                                                       
158500  MOVE B10-CVE-TRANS        TO  WKS-SAL-CLAVE-30      (WS-CONT).              
158600  MOVE B10-IMPORTE          TO  WKS-SAL-IMPORTE-30    (WS-CONT).              
158700  MOVE B10-STATUS           TO  WKS-SAL-ESTATUS-30    (WS-CONT).              
158800*  MOVE B10-HR-CARGO         TO  WKS-SAL-HORA-30       (WS-CONT).             
158810  MOVE B10-HR-CARGO         TO  WKS-HORA.                                     
158820  MOVE WKS-HH               TO  WKS-HH-SAL.                                   
158830  MOVE WKS-MM               TO  WKS-MM-SAL.                                   
158840  MOVE WKS-HORA-SAL         TO  WKS-SAL-HORA-30       (WS-CONT).              
158900  MOVE B10-TIPO-MOV         TO  WKS-SAL-TIPOMOV-30    (WS-CONT).              
159000  MOVE B10-MDA-PREF         TO  WKS-SAL-SUCURSAL-30   (WS-CONT).              
159100  MOVE B10-MDA-CUENTA       TO  WKS-SAL-CUENTA-30     (WS-CONT).              
159200  MOVE B10-AUT-S151         TO  WKS-SAL-AUT151-30     (WS-CONT).              
159300  MOVE B10-FEC-CARGO        TO  WKS-FECHAR-30-FORM-AAMMDD.                    
159400  MOVE WKS-FEC-30-REP-R     TO  WKS-SAL-FECHA-30      (WS-CONT).              
159500  MOVE B10-AUTD-AUT702      TO  WKS-SAL-AUTAPL-30     (WS-CONT).              
159600  MOVE B10-NUM-OCURR        TO  WKS-SAL-OCURRENCIA-30 (WS-CONT).              
159700  MOVE B10-NUM-ENV          TO  WKS-SAL-ENVIO-30      (WS-CONT).              
159800  MOVE B10-NUM-ERROR        TO  WKS-SAL-ERROR-30      (WS-CONT).              
159810  MOVE B10-SUC-PROM         TO  WKS-SAL-SUC-PROM-30   (WS-CONT).              
159820  MOVE B10-CONTRATO         TO  WKS-SAL-CONTRATO-30   (WS-CONT).              
159900*<FIN LBM> LLENA ARAREGLO DE SALIDA CON 7 REGISTROS                           
160000                                                                              
160100*<INI LBM> BUSCA SIGUIENTE REGISTRO                                           
160200 010-0030-SIGUIENTE-CASO1.                                                    
160300  FIND  NEXT B10SXFECAUT151                                                   
160400     ON EXCEPTION                                                             
160500     IF DMSTATUS(NOTFOUND)                                                    
160600        MOVE    1   TO  WS-OK.                                                
160700     IF WS-OK = 0                                                             
160800        IF (B10-FEC-CARGO        <  WKS-FECHAI-30-CONS-AAMMDD OR              
160900            B10-FEC-CARGO        >  WKS-FECHAF-30-CONS-AAMMDD)                
161000               MOVE    1   TO  WS-OK.                                         
161100                                                                              
161200 010-0030-SIGUIENTE-CASO2-3.                                                  
161300  FIND  NEXT B10SXSUCFECHA                                                    
161400     ON EXCEPTION                                                             
161500     IF DMSTATUS(NOTFOUND)                                                    
161600        MOVE    1   TO  WS-OK.                                                
161700     IF WS-OK = 0                                                             
161800        IF (B10-FEC-CARGO     <    WKS-FECHAI-30-CONS-AAMMDD OR               
161900            B10-FEC-CARGO     >    WKS-FECHAF-30-CONS-AAMMDD) OR              
162000            B10-MDA-PREF      NOT= WKS-SUC-30-CONS OR                         
162100            B10-MDA-CUENTA    NOT= WKS-CTA-30-CONS                            
162200               MOVE    1   TO  WS-OK.                                         
162300                                                                              
162400 010-0030-SIGUIENTE-CASO4.                                                    
162500  FIND  NEXT B10SXAUTFEC                                                      
162600     ON EXCEPTION                                                             
162700     IF DMSTATUS(NOTFOUND)                                                    
162800        MOVE    1   TO  WS-OK.                                                
162900     IF WS-OK = 0                                                             
163000        IF (B10-FEC-CARGO  <     WKS-FECHAI-30-CONS-AAMMDD OR                 
163100            B10-FEC-CARGO  >     WKS-FECHAF-30-CONS-AAMMDD) OR                
163200            B10-AUT-S151   NOT=  WKS-AUTS151-30-CONS                          
163300               MOVE    1   TO  WS-OK.                                         
163400                                                                              
163500 010-0030-SIGUIENTE-CASO5.                                                    
163600  FIND  NEXT B10SXFAUTAP702                                                   
163700     ON EXCEPTION                                                             
163800     IF DMSTATUS(NOTFOUND)                                                    
163900        MOVE    1   TO  WS-OK.                                                
164000     IF WS-OK = 0                                                             
164100        IF (B10-FEC-CARGO   <     WKS-FECHAI-30-CONS-AAMMDD OR                
164200            B10-FEC-CARGO   >     WKS-FECHAF-30-CONS-AAMMDD) OR               
164300            B10-AUTD-AUT702        NOT=  WKS-AUTAPL-30-CONS                   
164400               MOVE    1   TO  WS-OK.                                         
164500*<FIN LBM> BUSCA SIGUIENTE REGISTRO                                           
164600                                                                              
164700 010-0030-SIGUIENTE-CASO6.                                                    
164800  FIND  NEXT B10SXCONTRA                                                      
164900     ON EXCEPTION                                                             
165000     IF DMSTATUS(NOTFOUND)                                                    
165100        MOVE    1   TO  WS-OK.                                                
165200     IF WS-OK = 0                                                             
165300        IF (B10-FEC-CARGO   <     WKS-FECHAI-30-CONS-AAMMDD OR                
165400           B10-FEC-CARGO   >     WKS-FECHAF-30-CONS-AAMMDD) OR                
165500           B10-SUC-PROM        NOT=  WKS-SUC-30-CONS        OR                
165600           B10-CONTRATO        NOT=  WKS-CONTRATO-30-CONS                     
165700               MOVE    1   TO  WS-OK.                                         
