000001$SET LIST XREF MAP LINEINFO ERRORLIMIT = 100                      000100      
000002*$SET TADS                                                        000200      
000003*$SET OPTIMIZE                                                    000300      
000004 IDENTIFICATION DIVISION.                                         000400      
000005 AUTHOR. ING. LINO HECTOR TORRES CORONADO.                        000500      
000006******************************************************************000600      
000007*                                                                *000700      
000008*    ESTE PROGRAMA PROYECTA LA FECHA DE PROCESO DEL S151 EN      *000800      
000009*    EL CSI CORPORATIVO, VERIFICA LA FECHA DE EJECUCION DE LOS   *000900      
000010*    SISTEMAS: S084,S087,S408 ,S500 Y S701. Y GENERA UN REPORTE  *001000      
000011*    DANDO EL ESTATUS DE CADA SISTEMA.                           *001100      
000012*                                                                *001500      
000013*    RECOMPILACION POR EL UPGRADE DEL  MCP A 55                  *001510      
000014*    20141208 15MTP001 MJGRG                                     *001520      
000015*                                                                *001600      
000016******************************************************************001700      
000017 ENVIRONMENT DIVISION.                                            001800      
000018 INPUT-OUTPUT SECTION.                                            001900      
000019 FILE-CONTROL.                                                    002000      
000020                                                                  002100      
000021      SELECT A01-CONTROL    ASSIGN TO DISK                        002200      
000022                            ORGANIZATION IS SEQUENTIAL.           002300      
000023      SELECT V01-REPORTE        ASSIGN TO PRINTER.                002350      
000024                                                                  002370      
000025      SELECT V00-REPORTE2       ASSIGN TO PRINTER.                002390      
000026/                                                                 002400      
000027 DATA DIVISION.                                                   002500      
000028 FILE SECTION.                                                    002600      
000029*                                                                 002700      
000030 FD A01-CONTROL                                                   002800      
000031    VALUE OF TITLE IS "(S151)S151/FILE/CONTROL/CORP."             002900      
000032    VALUE OF DEPENDENTSPECS IS TRUE.                              003000      
000033                                                                  003100      
000034 01 A01-REG-CONTROL               PIC X(90).                      003200      
000035                                                                  003210      
000036 FD V01-REPORTE                                                   003220      
000037    VALUE OF TITLE IS WKS-TIT-REPORTE.                            003240      
000038 01 REG-REPORTE                   PIC X(132).                     003260      
000039                                                                  003300      
000040 FD V00-REPORTE2                                                  003320      
000041     VALUE OF TITLE IS WKS-TIT-REPORTE2.                          003340      
000042                                                                  003360      
000043 01 V00-R00-REPORTE2              PIC X(132).                     003370      
000044                                                                  003380      
000045 WORKING-STORAGE SECTION.                                         003400      
000046                                                                  003420      
000047*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000048* COPY "(S151)S151/FORMATO/DISPLAY.".                             003440      
000049                                                                  000100      
000050*===============================================================* 000200      
000051*         FORMATO PARA DISPLAYS                                 * 000300      
000052*===============================================================* 000400      
000053                                                                  000500      
000054 01 WKS-TIT-REPORTE2.                                             000600      
000055    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000056    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000057    02 FILLER                       PIC X(06) VALUE               000900      
000058                                              "/LIST/".           001000      
000059    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000060    02 FILLER                       PIC X(01) VALUE "/".          001071      
000061    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000062    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000063    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000064    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000065    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000066    02 FILLER                       PIC X(11) VALUE               001600      
000067                                              "/001MSGIMP.".      001700      
000068                                                                  002100      
000069 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000070                                                                  002300      
000071***********************************************************       002400      
000072*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000073***********************************************************       002600      
000074 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000075*8D                                                               002800      
000076 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000077 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000078    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000079    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000080    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000081*8D                                                               003400      
000082 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000083 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000084    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000085    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000086    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000087                                                                  004100      
000088 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000089                                                                  004300      
000090 01 WKS-FECHA-HORA2.                                              004400      
000091    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000092    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000093       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000094       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000095    02 WKS-TIME-MAQ2.                                             004600      
000096       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
000097       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
000098          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
000099          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
000100          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
000101       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
000102    02 FILLER                             PIC X(01).              004900      
000103    02 WKS-RESTO2                         PIC X(04).              005000      
000104                                                                  005100      
000105*8D                                                               005200      
000106****************** REPORTE DE MENSAJES *********************      005300      
000107 01 WLI-ENCAB-12.                                                 005400      
000108    03 FILLER                             PIC X(05) VALUE         005500      
000109       "S151-".                                                   005600      
000110    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000111    03 FILLER                             PIC X(15) VALUE         005671      
000112       "-001IMPMENSAJES".                                         005691      
000113    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000114    03 FILLER                             PIC X(34) VALUE         005800      
000115       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000116    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000117    03 FILLER                             PIC X(26) VALUE         006100      
000118       "FECHA DE LA INFORMACION : ".                              006200      
000119    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000120    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000121       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000122       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000123       05  WKS-SLASH1                         PIC X(01).          006356      
000124       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000125       05  WKS-SLASH2                         PIC X(01).          006358      
000126       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000127 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000128 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000129    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000130    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000131    03 FILLER                          PIC X(01).                 006371      
000132    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000133    03 FILLER                          PIC X(01).                 006381      
000134    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000135*8D                                                               006400      
000136 01 WLI-ENCAB-22.                                                 006500      
000137     03 FILLER                          PIC X(11) VALUE           006600      
000138        "F.PROCESO: ".                                            006700      
000139     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000140     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000141     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
000142     03 FILLER                          PIC X(01) VALUE ":".      007020      
000143     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
000144     03 FILLER                          PIC X(01) VALUE ":".      007060      
000145     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
000146     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000147     03 FILLER                          PIC X(24) VALUE           007200      
000148              "IMPRESION MENSAJES DEL S".                         007300      
000149     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000150     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000151     03 FILLER                          PIC X(14) VALUE           007600      
000152        "TIPO PROCESO: ".                                         007700      
000153     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000154*8D                                                               007900      
000155 01 WLI-ENCAB-32.                                                 008000      
000156     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000157*       "VERSION  : ".                                            008200      
000158*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000159     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000160     03 FILLER                     PIC X(07) VALUE                008500      
000161        "HOJA : ".                                                008600      
000162     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000163                                                                  008800      
000164 01 WLI-ENCAB-42.                                                 008900      
000165     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000166     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000167     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000168                                                                  009300      
000169 01 WLI-ENCAB-52.                                                 009400      
000170    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000171    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000172    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000173    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000174                                                                  009900      
000175*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
000176 01 WLI-ENCAB-62.                                                 009910      
000177    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
000178    03 WLI-RESULT                 PIC X(04).                      009920      
000179    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
000180    03 WLI-TEXTO                  PIC X(110).                     009930      
000181                                                                  009935      
000182 01 WLI-TOT-ENVIO.                                                009940      
000183    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
000184    03 FILLER                     PIC X(37) VALUE                 009950      
000185       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
000186    03 WLI-ENV-CTD                PIC X(04).                      009960      
000187*FIN - INFOWARE                                                   009970      
000188****************************************************************  010000      
000189*                 CONTADORES DE HOJAS                          *  010100      
000190****************************************************************  010200      
000191                                                                  010300      
000192  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000193*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000194                                                                  003500      
000195 01  WKS-REG-HD-CONTROL.                                          003600      
000196     03  WKS-HD-CSI                    PIC 9(02).                 003700      
000197     03  WKS-HD-FECPRO                 PIC 9(08).                 003800      
000198     03  FILLER                        PIC X(80).                 003900      
000199                                                                  004000      
000200 01  WKS-REG-DET-CONTROL.                                         004100      
000201     03  WKS-DET-SIST                  PIC 9(03).                 004200      
000202     03  WKS-DET-FECPRO                PIC 9(08).                 004300      
000203                                                                  004400      
000204***********************************************************       004500      
000205*         PARAMETROS PARA LAMAR AL CALLENDAR              *       004600      
000206***********************************************************       004700      
000207 77  W77-FORMATO                       PIC S9(11) BINARY.         004800      
000208 77  W77-FUNCION                       PIC S9(11) BINARY.         004900      
000209 01  WKS-FECHA1                        PIC X(08).                 005000      
000210 01  WKS-FECHA1-NUM REDEFINES WKS-FECHA1  PIC 9(08).              005100      
000211 01  WKS-FECHA2                        PIC 9(08).                 005200      
000212*                                                                 005300      
000213 01  WKS-FECHA8D                    PIC 9(08).                    005400      
000214 01  WKS-FECHA8D-R REDEFINES WKS-FECHA8D .                        005500      
000215     03 WKS-AA-2D                   PIC 9(02).                    005600      
000216     03 WKS-FEC-6D                  PIC 9(06).                    005700      
000217 01  WKS-FECHA-MAQ                  PIC 9(06).                    005705      
000218 01  WKS-FECHA-MAQ-R REDEFINES WKS-FECHA-MAQ.                     005706      
000219     03 WKS-FM-AMO                 PIC 9(2).                      005707      
000220     03 WKS-FM-MES                 PIC 9(2).                      005708      
000221     03 WKS-FM-DIA                 PIC 9(2).                      005709      
000222                                                                  005711      
000223 01  WKS-HORA-MAQ                   PIC 9(08).                    005712      
000224 01  WKS-HORA-MAQ-R REDEFINES WKS-HORA-MAQ.                       005713      
000225     03 WKS-HORA-HHMMSS             PIC 9(06).                    005714      
000226     03 WKS-HORA-HHMMSS-R REDEFINES WKS-HORA-HHMMSS.              005716      
000227        05 WKS-HORA-HH              PIC 9(02).                    005718      
000228        05 WKS-HORA-MM              PIC 9(02).                    005720      
000229        05 WKS-HORA-SS              PIC 9(02).                    005722      
000230     03 FILLER                      PIC 9(02).                    005730      
000231*                                                                 005800      
000232 77  W77-FECHA-PROCESO                 PIC 9(08).                 005900      
000233 77  W77-FECHA-PROFUT                  PIC 9(08).                 006000      
000234 77  W77-FIN                           PIC 9(01) VALUE 0.         006100      
000235 77  W77-PARAMETRO                     PIC 9(02).                 006200      
000236 77  W77-VALUE                         PIC 9(06).                 006300      
000237*****************************************                         006351      
000238*          NOMBRES  DE  BACKUPS         *                         006352      
000239*****************************************                         006353      
000240  01 WKS-TIT-REPORTE.                                             006354      
000241     02 FILLER                     PIC X(04) VALUE "S151".        006355      
000242     02 FILLER                     PIC X(11) VALUE "/LIST/P103/". 006357      
000243     02 FILLER                     PIC X(10) VALUE "1000/C000/".  006358      
000244     02 WKS-FECBACK                PIC 9(06).                     006359      
000245     02 FILLER                     PIC X(1)  VALUE "/".           006360      
000246     02 WKS-MIX-BACK               PIC 9(07) VALUE 0.             006361      
000247     02 FILLER                     PIC X(16) VALUE                006362      
000248                                         "/001S151CONTROL.".      006363      
000249*                                                                 006400      
000250*****************************************                         006402      
000251*         ENCABEZADO DEL V01-REPORTE        *                     006403      
000252*****************************************                         006404      
000253                                                                  006405      
000254 01  WLI-TIT1-RESUM.                                              006406      
000255     03 FILLER                     PIC X(22) VALUE                006407      
000256        "S151-P103-001CONTROL ".                                  006408      
000257     03 FILLER                     PIC X(08) VALUE SPACES.        006409      
000258     03 FILLER                     PIC X(42) VALUE                006410      
000259              "ADMINISTRACION  DE  SALDOS  Y  MOVIMIENTOS".       006411      
000260     03 FILLER                     PIC X(07) VALUE SPACES.        006412      
000261     03 FILLER                     PIC X(26) VALUE                006413      
000262                              "FECHA DE LA INFORMACION : ".       006414      
000263     03 WLI-RP-E1-FECHA-INF        PIC 9999/99/99.                006415      
000264 01  WLI-TIT2-RESUM.                                              006417      
000265     03 FILLER                     PIC X(11) VALUE                006418      
000266                  "F.PROCESO: ".                                  006419      
000267     03 WLI-RP-E2-FECHA-PROC       PIC 99/99/99.                  006420      
000268     03 FILLER                     PIC X      VALUE SPACE.        006421      
000269     03 WLI-RP-E2-HH-TIT           PIC 99.                        006422      
000270     03 FILLER                     PIC X(01) VALUE ":".           006427      
000271     03 WLI-RP-E2-MM-TIT           PIC 99.                        006432      
000272     03 FILLER                     PIC X(01) VALUE ":".           006437      
000273     03 WLI-RP-E2-SS-TIT           PIC 99.                        006442      
000274     03 FILLER                     PIC X(07) VALUE SPACES.        006450      
000275     03 FILLER                     PIC X(34) VALUE                006452      
000276                  "ESTATUS DE PROCESO DE LOS SISTEMAS".           006454      
000277     03 FILLER                     PIC X(10) VALUE SPACES.        006456      
000278     03 FILLER                     PIC X(20) VALUE                006458      
000279        "TIPO PROCESO: DIARIO".                                   006460      
000280 01  WLI-TITULO-RESUM.                                            006462      
000281     03 FILLER      PIC X(17) VALUE "          SISTEMA".          006464      
000282     03 FILLER      PIC X(13) VALUE SPACES.                       006466      
000283     03 FILLER      PIC X(06) VALUE "STATUS".                     006468      
000284     03 FILLER      PIC X(20) VALUE SPACES.                       006470      
000285     03 FILLER      PIC X(05) VALUE "FECHA".                      006472      
000286     03 FILLER      PIC X(71) VALUE SPACES.                       006474      
000287 01 WLI-TOT-SISTEMA.                                              006476      
000288     03 FILLER                 PIC X(12) VALUE SPACES.            006478      
000289     03 WLI-SIS-NUM            PIC X(03).                         006480      
000290     03 FILLER                 PIC X(06) VALUE SPACES.            006482      
000291     03 WLI-SIS-MSG            PIC X(30).                         006484      
000292     03 FILLER                 PIC X(03) VALUE SPACES.            006486      
000293     03 WLI-SIS-FEC            PIC 9999/99/99.                    006488      
000294*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000295*    COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".        006590      
000296**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000297  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000298  01 MENSAJE-LJ.                                                  100300      
000299     02 SISTEMA-LJ     PIC X(04).                                 100400      
000300     02 FILLER         PIC X VALUE "/".                           100500      
000301     02 PASO-LJ        PIC X(04).                                 100600      
000302     02 FILLER         PIC X VALUE "/".                           100700      
000303     02 MTP-LJ         PIC 9(03).                                 100800      
000304     02 FILLER         PIC X VALUE ":".                           100900      
000305     02 TIPO-LJ        PIC X.                                     101000      
000306     02 FILLER         PIC X VALUE ">".                           101100      
000307     02 CODIGO-LJ      PIC 9(06).                                 101200      
000308     02 FILLER         PIC X VALUE "<".                           101300      
000309     02 TEXTO-LJ       PIC X(250).                                101400      
000310*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000311/**************************************************************** 006600      
000312*             P R O C E D U R E     D I V I S I O N             * 006700      
000313***************************************************************** 006800      
000314 PROCEDURE DIVISION USING W77-PARAMETRO.                          006900      
000315 000000-PROGRAMA.                                                 007000      
000316*================                                                 007100      
000317     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   007200      
000318        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          007300      
000319                                                                  007350      
000320     CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION.     007400      
000321     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP".       007420      
000322                                                                  007440      
000323     IF W77-PARAMETRO = 01                                        007500      
000324        PERFORM 000050-CONSULTA                                   007600      
000325     ELSE                                                         007700      
000326     IF W77-PARAMETRO = 02                                        007800      
000327        PERFORM 000080-PROYECTA.                                  007900      
000328                                                                  008000      
000329     STOP RUN.                                                    008100      
000330                                                                  008200      
000331 000050-DISPLAY.                                                  008210      
000332*===============                                                  008220      
000333                                                                  008230      
000334*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000335*     COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY.".               008240      
000336                                                                  000100      
000337*===============================================================* 000200      
000338*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
000339*         PARA LLAMADO DE DISPLAY                               * 000400      
000340*===============================================================* 000500      
000341                                                                  000600      
000342     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
000343            TO BYFUNCTION.                                        000671      
000344                                                                  000691      
000345     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
000346          USING WKS-DATE-ARRAY2.                                  000800      
000347     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
000348     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
000349     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
000350     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
000351     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
000352     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
000353                                                                  001300      
000354     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
000355     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
000356     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
000357                               WKS-TIT-REPORTE2.                  001700      
000358*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
000359*                                  GIVING WKS-COMPILA2.           001900      
000360*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
000361*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
000362*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
000363*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
000364                                                                  002066      
000365*    IF WKS-AAA-VERSION2  < 50                                    002071      
000366*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
000367*    ELSE                                                         002081      
000368*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
000369                                                                  002091      
000370                                                                  002500      
000371*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
000372     OPEN OUTPUT V00-REPORTE2.                                    002700      
000373     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
000374     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
000375                                                                  003000      
000376 000-050-CHECA-SALTO-HOJA2.                                       003051      
000377*==========================                                       003071      
000378    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
000379     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
000380        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
000381     ELSE                                                         003079      
000382        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
000383     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
000384     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
000385     MOVE "/"                     TO WKS-SLASH1.                  003086      
000386     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
000387     MOVE "/"                     TO WKS-SLASH2.                  003088      
000388     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
000389     IF  WKS-NUM-LINEAS2 > 56                                     003091      
000390         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
000391         ADD 1                   TO    W77-CONT-HOJA2             003200      
000392         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
000393         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
000394         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
000395         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
000396         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
000397         MOVE SPACES             TO V00-R00-REPORTE2              003800      
000398         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
000399         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
000400                                                                  004100      
000401 000-030-IMPRIME-MENSAJE.                                         004200      
000402*========================                                         004300      
000403*LP                                                               004400      
000404     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
000405     ADD             2       TO WKS-NUM-LINEAS2                   004600      
000406     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
000407                                                                  004800      
000408*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000409                                                                  008250      
000410 000050-CONSULTA.                                                 008300      
000411*================                                                 008400      
000412                                                                  008500      
000413     OPEN INPUT A01-CONTROL                                       008600      
000414     READ A01-CONTROL INTO WKS-REG-HD-CONTROL.                    008700      
000415                                                                  008751      
000416     MOVE  WKS-HD-CSI     TO      WKS-TR-CSI2.                    008771      
000417                                                                  008800      
000418     MOVE WKS-HD-FECPRO   TO      W77-FECHA-PROCESO               008900      
000419                                  WLI-RB-E1-FECHA-INF2            008951      
000420     MOVE "S151"          TO      SISTEMA-LJ                      009000      
000421                                  WKS-SIS-BACK2                   009051      
000422                                  WLI-RB-E3-SISTEMA2              009071      
000423     MOVE "P103"          TO      PASO-LJ                         009100      
000424                                  WKS-PASO-BACK2                  009151      
000425                                  WLI-RB-E1-PASO                  009171      
000426     MOVE "DIARIO"        TO      WLI-RB-E2-TIPO-PROC2            009191      
000427                                                                  009193      
000428     PERFORM 000050-DISPLAY.                                      009195      
000429                                                                  009197      
000430     MOVE "001"           TO      MTP-LJ                          009200      
000431     MOVE SPACES          TO      WLI-ENCAB-52, TEXTO-LJ          009251      
000432     MOVE "I"             TO      TIPO-LJ , WLI-TIPO-LJ           009300      
000433     MOVE 020101          TO      CODIGO-LJ                       009400      
000434     STRING "INICIO PROCESO PARA CONSULTA DE FECHA DE PROCESO : " 009500      
000435            ,W77-FECHA-PROCESO                                    009600      
000436     DELIMITED BY SIZE INTO TEXTO-LJ.                             009700      
000437     MOVE TEXTO-LJ        TO       WLI-TEXTO-LJ                   009751      
000438     PERFORM      000-030-IMPRIME-MENSAJE.                        009771      
000439                                                                  009791      
000440*    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         009800      
000441                                                                  009900      
000442     MOVE WKS-HD-FECPRO   TO      WKS-FECHA8D                     010000      
000443     CHANGE ATTRIBUTE VALUE OF MYSELF   TO WKS-FEC-6D.            010100      
000444     CLOSE A01-CONTROL WITH SAVE.                                 010200      
000445                                                                  010300      
000446 000080-PROYECTA.                                                 010400      
000447*================                                                 010500      
000448     OPEN INPUT A01-CONTROL                                       010600      
000449     READ A01-CONTROL INTO WKS-REG-HD-CONTROL.                    010700      
000450                                                                  010751      
000451     MOVE  WKS-HD-CSI     TO      WKS-TR-CSI2.                    010771      
000452                                                                  010800      
000453     MOVE WKS-HD-FECPRO   TO      W77-FECHA-PROCESO               010900      
000454                                  WLI-RB-E1-FECHA-INF2            010951      
000455     MOVE "S151"          TO      SISTEMA-LJ                      011000      
000456                                  WKS-SIS-BACK2                   011051      
000457                                  WLI-RB-E3-SISTEMA2              011071      
000458                                                                  011091      
000459     MOVE "P103"          TO      PASO-LJ                         011100      
000460                                  WKS-PASO-BACK2                  011151      
000461                                  WLI-RB-E1-PASO                  011161      
000462     MOVE "DIARIO"        TO      WLI-RB-E2-TIPO-PROC2            011171      
000463                                                                  011181      
000464     PERFORM 000050-DISPLAY.                                      011186      
000465                                                                  011191      
000466     MOVE "001"           TO      MTP-LJ                          011200      
000467     MOVE SPACES          TO      WLI-ENCAB-52, TEXTO-LJ          011251      
000468     MOVE "I"             TO      TIPO-LJ , WLI-TIPO-LJ           011300      
000469     MOVE 020101          TO      CODIGO-LJ                       011400      
000470     STRING "INICIO PROCESO PARA PROYECCION DE FECHAS FECHA: ",   011500      
000471            W77-FECHA-PROCESO                                     011600      
000472     DELIMITED BY SIZE INTO TEXTO-LJ.                             011700      
000473     MOVE TEXTO-LJ        TO      WLI-TEXTO-LJ                    011751      
000474     PERFORM      000-030-IMPRIME-MENSAJE.                        011771      
000475                                                                  011791      
000476*    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         011800      
000477                                                                  011900      
000478     MOVE WKS-HD-FECPRO   TO      WKS-FECHA1, WKS-FECBACK.        012000      
000479     MOVE 12              TO      W77-FORMATO                     012100      
000480     MOVE 13              TO      W77-FUNCION                     012200      
000481     MOVE "00000001"      TO      WKS-FECHA2                      012300      
000482     CALL "THECALENDAR IN LOCSUP" USING                           012400      
000483          W77-FUNCION,WKS-FECHA1,WKS-FECHA2,W77-FORMATO           012500      
000484                                                                  012600      
000485     IF W77-FUNCION > 0                                           012700      
000486        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          012751      
000487        MOVE "E"          TO      TIPO-LJ,  WLI-TIPO-LJ           012800      
000488        MOVE 010105       TO      CODIGO-LJ                       012900      
000489        STRING "ERROR AL PROYECTAR PROXIMA FECHA DE PROCESO",     013000      
000490               ", NECESARIA PARA ACTUALIZAR ARCHIVO ",            013100      
000491               " S151/FILE/CONTROL/CORP  "                        013200      
000492                 DELIMITED BY SIZE INTO TEXTO-LJ                  013300      
000493        MOVE TEXTO-LJ     TO      WLI-TEXTO-LJ                    013351      
000494        PERFORM      000-030-IMPRIME-MENSAJE                      013371      
000495                                                                  013391      
000496        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ        013400      
000497        SET MYSELF(STATUS)  TO  -1                                013500      
000498     ELSE                                                         013600      
000499        MOVE WKS-FECHA1   TO      W77-FECHA-PROFUT.               013700      
000500     CANCEL "LOCSUP".                                             013800      
000501     MOVE  ATTRIBUTE STACKNO OF MYSELF  TO  WKS-MIX-BACK.         013810      
000502     SET V01-REPORTE(USERBACKUPNAME) TO VALUE TRUE.               013812      
000503     CHANGE ATTRIBUTE TITLE  OF V01-REPORTE TO  WKS-TIT-REPORTE.  013815      
000504     OPEN OUTPUT V01-REPORTE.                                     013820      
000505     ACCEPT WKS-FECHA-MAQ   FROM TODAYS-DATE.                     013821      
000506     MOVE   WKS-FECHA-MAQ   TO   WLI-RP-E2-FECHA-PROC             013822      
000507     ACCEPT WKS-HORA-MAQ    FROM TIME.                            013823      
000508     MOVE   WKS-HORA-HH     TO   WLI-RP-E2-HH-TIT.                013824      
000509     MOVE   WKS-HORA-MM     TO   WLI-RP-E2-MM-TIT.                013829      
000510     MOVE   WKS-HORA-SS     TO   WLI-RP-E2-SS-TIT.                013834      
000511     MOVE W77-FECHA-PROCESO TO WLI-RP-E1-FECHA-INF.               013835      
000512     WRITE REG-REPORTE FROM WLI-TIT1-RESUM AFTER 1.               013840      
000513     WRITE REG-REPORTE FROM WLI-TIT2-RESUM AFTER 1.               013860      
000514     WRITE REG-REPORTE FROM WLI-TITULO-RESUM AFTER 3.             013880      
000515     MOVE ZEROS           TO  W77-FIN.                            013900      
000516     PERFORM 000100-CHECA-STATUS UNTIL W77-FIN = 1.               014000      
000517     CLOSE A01-CONTROL WITH SAVE  V01-REPORTE WITH SAVE.          014100      
000518                                                                  014200      
000519     OPEN I-O A01-CONTROL                                         014300      
000520     READ A01-CONTROL INTO WKS-REG-HD-CONTROL.                    014400      
000521     MOVE W77-FECHA-PROFUT        TO      WKS-HD-FECPRO           014500      
000522     REWRITE A01-REG-CONTROL FROM WKS-REG-HD-CONTROL              014600      
000523          INVALID KEY                                             014700      
000524          MOVE SPACES  TO      WLI-ENCAB-52, TEXTO-LJ             014751      
000525          MOVE "E"     TO      TIPO-LJ, WLI-TIPO-LJ               014800      
000526          MOVE 020202  TO      CODIGO-LJ                          014900      
000527          MOVE  "ERROR AL ACTUALIZAR FECHA DE PROXIMO PROCESO "   015000      
000528                       TO      TEXTO-LJ, WLI-TEXTO-LJ             015100      
000529          PERFORM      000-030-IMPRIME-MENSAJE                    015120      
000530                                                                  015140      
000531          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                015200      
000532                                      MENSAJE-LJ                  015300      
000533          SET MYSELF(STATUS)  TO -1.                              015400      
000534                                                                  015500      
000535     CLOSE A01-CONTROL WITH SAVE.                                 015800      
000536                                                                  015900      
000537     MOVE SPACES          TO      WLI-ENCAB-52, TEXTO-LJ          015951      
000538     MOVE "I"             TO      TIPO-LJ, WLI-TIPO-LJ            016000      
000539     MOVE 020101          TO      CODIGO-LJ                       016100      
000540     MOVE "FIN DE PROCESO PROYECCION DE FECHA Y STATUS"           016200      
000541                          TO      TEXTO-LJ, WLI-TEXTO-LJ          016300      
000542     PERFORM      000-030-IMPRIME-MENSAJE.                        016351      
000543                                                                  016371      
000544*    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         016400      
000545                                                                  016500      
000546*                                                                 016600      
000547 000100-CHECA-STATUS.                                             016700      
000548*====================                                             016800      
000549     READ A01-CONTROL INTO WKS-REG-DET-CONTROL                    016900      
000550          AT END MOVE 1 TO W77-FIN.                               017000      
000551                                                                  017100      
000552     IF WKS-DET-SIST = 999                                        017200      
000553        MOVE 1 TO W77-FIN                                         017300      
000554     ELSE                                                         017400      
000555        MOVE WKS-DET-SIST   TO WLI-SIS-NUM                        017420      
000556        MOVE WKS-DET-FECPRO TO WLI-SIS-FEC                        017450      
000557        IF WKS-DET-FECPRO = WKS-HD-FECPRO                         017500      
000558           MOVE "SE EJECUTO CORRECTAMENTE     " TO WLI-SIS-MSG    017600      
000559        ELSE                                                      017700      
000560           MOVE "NO HA SIDO PROCESADO DESDE   " TO WLI-SIS-MSG.   017800      
000561     IF W77-FIN = 0                                               017900      
000562        WRITE REG-REPORTE FROM WLI-TOT-SISTEMA AFTER 1.           018000      
