000001$SET LIST ERRORLIMIT = 100 XREF LINEINFO                          000100      
000002$SET OLDCODE                                                      000200      
000003*$SET TADS                                                        000600      
000004 IDENTIFICATION DIVISION.                                         000700      
000005 AUTHOR. ING FRANCISCO JAVIER HERNANDEZ GONZALEZ.                 000800      
000006******************************************************************000900      
000007*  FUNCIONES: GENERAR UN ARCHIVO CON SALDOS DE CONTRATOS         *001000      
000008*  DEL SISTEMA S500, POR PRODUCTO 001 (CHEQUES) Y 066 (CUENTA    *001100      
000009*  MAESTRA .                                                     *001200      
000010*                                                                *001300      
000011*     ENTRADAS.-                                                  001400      
000012*       1.-   ARCHIVO SDOS DEL SISTEMA S151 CON REGISTROS DE     *001500      
000013*             DE SALDOS DE CHEQUES Y CTA. MAE.                   *001600      
000014*                                                                *001700      
000015*     SALIDAS.-                                                  *001800      
000016*       1.-   ARCHIVOS SDO0001 Y SD00066 (CHEQUES Y CTA. MAESTRA)*001900      
000017*             PARA EL SISTEMA S050 (ESTADOS DE CUENTA)           *002000      
000018*             PARA GENERACION DE ESTADO DE CUENTA.               *002100      
000019*       2.-   ARCHIVO DE SALDOS PARA CITI (ACC CITD).            *002200      
000020*                                                                *002300      
000021******************************************************************002400      
000022 ENVIRONMENT DIVISION.                                            002500      
000023 INPUT-OUTPUT SECTION.                                            002600      
000024 FILE-CONTROL.                                                    002700      
000025      SELECT A01-SDOENT      ASSIGN TO DISK.                      002800      
000026      SELECT A04-SDOSCITD-T  ASSIGN TO DISK.                      003100      
000027      SELECT A05-SDOSCITD    ASSIGN TO DISK.                      003200      
000028      SELECT A06-MONITOR     ASSIGN TO DISK.                      003300      
000029      SELECT V00-REPORTE2    ASSIGN TO PRINTER.                   003500      
000030      SELECT A04-SDOSBNE-T   ASSIGN TO DISK.                      003520      
000031      SELECT A05-SDOSBNE     ASSIGN TO DISK.                      003540      
000032      SELECT A06-MONITOR-BNE ASSIGN TO DISK.                      003590      
000033*                                                                 003600      
000034/                                                                 003700      
000035 DATA DIVISION.                                                   003800      
000036 FILE SECTION.                                                    003900      
000037 FD  A01-SDOENT                                                   004000      
000038     BLOCK CONTAINS 168 RECORDS                                   004100      
000039     VALUE OF TITLE        IS WKS-TIT-SDOENT.                     004200      
000040                                                                  004300      
000041 01  R01-SDOENT                   PIC X(390).                     004400      
000042                                                                  004500      
000043 FD  A04-SDOSCITD-T                                               006400      
000044     VALUE OF TITLE        IS WKS-TIT-SDOSCITD-T                  006500      
000045              AREAS        IS 1000                                006600      
000046              AREASIZE     IS 6000                                006700      
000047              SECURITYTYPE IS PUBLIC.                             006800      
000048                                                                  006900      
000049 01  R04-SDOSCITD-T.                                              007000      
000050  02 ACCI-INT-REC-T.                                              007100      
000051      05 ACCI-RECORD-TYPE-T          PIC  X(03).                  007200      
000052      05 ACCI-KEY-GRP-T.                                          007300      
000053         10 ACCI-BRCH-NBR-T          PIC 9(03).                   007400      
000054         10 ACCI-GEN-CUST-T          PIC 9(12).                   007500      
000055         10 ACCI-CCY-CODE-T          PIC 9(03).                   007600      
000056         10 ACCI-ACCT-NBR-T.                                      007700      
000057            15 ACCI-ACCT-NBR-T1      PIC 9(12).                   007720      
000058            15 ACCI-ACCT-NBR-T2      PIC 9(23).                   007740      
000059         10 ACCI-LIA-NBR-T           PIC 9(11).                   007800      
000060      05 ACCI-SWIFT-CCY-CODE-T       PIC X(04).                   007900      
000061      05 ACCI-SHORT-NAME-TEXT-T      PIC X(32).                   008000      
000062      05 ACCI-ACCT-STAT-IND-T        PIC X(01).                   008100      
000063      05 ACCI-CAT-CODE-T             PIC 9(07).                   008200      
000064      05 ACCI-LAST-TXN-DATE-T        PIC 9(07).                   008300      
000065      05 ACCI-ACCT-BAL-AMT-T         PIC 9(15)V99.                008400      
000066      05 ACCI-ACCT-BAL-AMT-SIGN-T    PIC X(01).                   008500      
000067      05 ACCI-LCY-ACCT-BAL-AMT-T     PIC 9(15)V99.                008600      
000068      05 ACCI-LCY-BAL-AMT-SIGN-T     PIC X(01).                   008700      
000069      05 ACCI-DISP-VAL-BAL-AMT-T     PIC 9(15)V99.                008800      
000070      05 ACCI-DISP-BAL-AMT-SIGN-T    PIC X(01).                   008900      
000071      05 ACCI-BANK-NON-BANK-T        PIC X(03).                   009000      
000072      05 ACCI-MAIL-T                 PIC X(04).                   009100      
000073      05 ACCI-MAIL-TO-COLLECT-T      PIC X(01).                   009200      
000074      05 ACCI-MAIL-RULEOFF-T         PIC X(02).                   009300      
000075      05 ACCI-LANGUAGE-CODE-T        PIC 9(02).                   009400      
000076      05 ACCI-FILLER-T               PIC X(25).                   009500      
000077      05 ACCI-CUSTOMER-NAME-T        PIC X(35).                   009600      
000078      05 ACCI-CBR-ADDRESS-1-T        PIC X(35).                   009700      
000079      05 ACCI-CBR-ADDRESS-2-T        PIC X(35).                   009800      
000080      05 ACCI-CBR-ADDRESS-3-T        PIC X(35).                   009900      
000081      05 ACCI-CBR-ADDRESS-4-T        PIC X(35).                   010000      
000082      05 ACCI-PRIME-DELIMETER-T      PIC X(01).                   010100      
000083  02 ACCI-RESTO-REG-T.                                            010200      
000084      05 ACCI-CONTRATO-T             PIC 9(16).                   010300      
000085      05 FILLER                      PIC X(02).                   010400      
000086                                                                  010500      
000087 FD  A05-SDOSCITD                                                 010600      
000088     BLOCK CONTAINS 5 RECORDS                                     010700      
000089     VALUE OF TITLE        IS WKS-TIT-SDOSCITD                    010800      
000090              AREAS        IS 1000                                010900      
000091              AREASIZE     IS 6000                                011000      
000092              SECURITYTYPE IS PUBLIC.                             011100      
000093                                                                  011200      
000094 01  R05-SDOSCITD              PIC X(385).                        011300      
000095                                                                  011400      
000096 FD  V00-REPORTE2                                                 012000      
000097     VALUE OF TITLE        IS WKS-TIT-REPORTE2.                   012100      
000098                                                                  012200      
000099 01  V00-R00-REPORTE2              PIC X(132).                    012300      
000100                                                                  012400      
000101 FD  A06-MONITOR                                                  012500      
000102     BLOCK CONTAINS 5 RECORDS                                     012600      
000103     VALUE OF TITLE        IS WKS-TIT-MONITOR                     012700      
000104              SECURITYTYPE IS PUBLIC.                             012800      
000105                                                                  012900      
000106 01  R06-MONITOR               PIC X(108).                        013000      
000107***************************************************************** 013001      
000108*                     ARCHIVOS BNE                              * 013002      
000109***************************************************************** 013003      
000110FD A06-MONITOR-BNE                                                013004      
000111     BLOCK CONTAINS 5 RECORDS                                     013006      
000112     VALUE OF TITLE        IS WKS-TIT-MONITOR-BNE                 013008      
000113              SECURITYTYPE IS PUBLIC.                             013010      
000114                                                                  013012      
000115 01  R06-MONITOR-BNE              PIC X(108).                     013014      
000116                                                                  013016      
000117FD  A04-SDOSBNE-T                                                 013018      
000118*     VALUE OF TITLE        IS WKS-TIT-SDOSCITD-T                 013020      
000119      VALUE OF TITLE        IS WKS-TIT-SDOSBNE-T                  013022      
000120              AREAS        IS 1000                                013024      
000121              AREASIZE     IS 6000                                013026      
000122              SECURITYTYPE IS PUBLIC.                             013028      
000123                                                                  013030      
000124 01  R04-SDOSBNE-T.                                               013032      
000125  02 ACCI-INT-REC-BNE-T.                                          013034      
000126      05 ACCI-RECORD-TYPE-BNE-T          PIC  X(03).              013036      
000127      05 ACCI-KEY-GRP-BNE-T.                                      013038      
000128         10 ACCI-BRCH-NBR-BNE-T          PIC 9(03).               013040      
000129         10 ACCI-GEN-CUST-BNE-T          PIC 9(12).               013042      
000130         10 ACCI-CCY-CODE-BNE-T          PIC 9(03).               013044      
000131         10 ACCI-ACCT-NBR-BNE-T.                                  013046      
000132            15 ACCI-ACCT-NBR-BNE-T1      PIC 9(12).               013048      
000133            15 ACCI-ACCT-NBR-BNE-T2      PIC 9(23).               013050      
000134         10 ACCI-LIA-NBR-BNE-T           PIC 9(11).               013052      
000135      05 ACCI-SWIFT-CCY-CODE-BNE-T       PIC X(04).               013054      
000136      05 ACCI-SHORT-NAME-TEXT-BNE-T      PIC X(32).               013056      
000137      05 ACCI-ACCT-STAT-IND-BNE-T        PIC X(01).               013058      
000138      05 ACCI-CAT-CODE-BNE-T             PIC 9(07).               013060      
000139      05 ACCI-LAST-TXN-DATE-BNE-T        PIC 9(07).               013062      
000140      05 ACCI-ACCT-BAL-AMT-BNE-T         PIC 9(15)V99.            013064      
000141      05 ACCI-ACCT-BAL-AMT-SIGN-BNE-T    PIC X(01).               013066      
000142      05 ACCI-LCY-ACCT-BAL-AMT-BNE-T     PIC 9(15)V99.            013068      
000143      05 ACCI-LCY-BAL-AMT-SIGN-BNE-T     PIC X(01).               013070      
000144      05 ACCI-DISP-VAL-BAL-AMT-BNE-T     PIC 9(15)V99.            013072      
000145      05 ACCI-DISP-BAL-AMT-SIGN-BNE-T    PIC X(01).               013074      
000146      05 ACCI-BANK-NON-BANK-BNE-T        PIC X(03).               013076      
000147      05 ACCI-MAIL-BNE-T                 PIC X(04).               013078      
000148      05 ACCI-MAIL-TO-COLLECT-BNE-T      PIC X(01).               013080      
000149      05 ACCI-MAIL-RULEOFF-BNE-T         PIC X(02).               013082      
000150      05 ACCI-LANGUAGE-CODE-BNE-T        PIC 9(02).               013084      
000151      05 ACCI-FILLER-BNE-T               PIC X(25).               013086      
000152      05 ACCI-CUSTOMER-NAME-BNE-T        PIC X(35).               013088      
000153      05 ACCI-CBR-ADDRESS-1-BNE-T        PIC X(35).               013090      
000154      05 ACCI-CBR-ADDRESS-2-BNE-T        PIC X(35).               013092      
000155      05 ACCI-CBR-ADDRESS-3-BNE-T        PIC X(35).               013094      
000156      05 ACCI-CBR-ADDRESS-4-BNE-T        PIC X(35).               013096      
000157      05 ACCI-PRIME-DELIMETER-BNE-T      PIC X(01).               013098      
000158  02 ACCI-RESTO-REG-BNE-T.                                        013100      
000159      05 ACCI-CONTRATO-BNE-T             PIC 9(16).               013102      
000160      05 FILLER                      PIC X(02).                   013104      
000161                                                                  013106      
000162FD  A05-SDOSBNE                                                   013108      
000163     BLOCK CONTAINS 5 RECORDS                                     013110      
000164*     VALUE OF TITLE        IS WKS-TIT-SDOSCITD                   013112      
000165      VALUE OF TITLE        IS WKS-TIT-SDOSBNE                    013114      
000166              AREAS        IS 1000                                013116      
000167              AREASIZE     IS 6000                                013118      
000168              SECURITYTYPE IS PUBLIC.                             013120      
000169                                                                  013122      
000170 01  R05-SDOSBNE              PIC X(385).                         013124      
000171                                                                  013126      
000172                                                                  013200      
000173/                                                                 013300      
000174 WORKING-STORAGE SECTION.                                         013400      
000175*INICIA CODIGO DE RENOVACION CRONOS 2000                          013500      
000176*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000177*     COPY "S151/CRONOS2K/CPY/WS".                                013600      
000178******************************************************************000100      
000179** This copyBook defines all the additional variables that      **000200      
000180** Unisys has defined for the CRONOS2K project                  **000300      
000181** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000182******************************************************************000500      
000183                                                                  000600      
000184******************************************************************000700      
000185** These Variables are used to Accept the system date in long   **000800      
000186** format and get the century information                       **000900      
000187** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000188 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000189 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000190    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000191    05 FILLER      PIC X(1).                                      001400      
000192    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000193    05 FILLER      PIC X(1).                                      001600      
000194    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000195    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000196      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000197      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000198******************************************************************002100      
000199                                                                  002200      
000200******************************************************************002300      
000201** This variable defines a date in the format MMDDCCAA          **002400      
000202**                                                              **002500      
000203 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000204 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000205    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000206    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000207    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000208    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000209      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000210      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000211******************************************************************003400      
000212                                                                  003500      
000213******************************************************************003600      
000214** This variable defines a date in the format CCAAMMDD          **003700      
000215**                                                              **003800      
000216 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000217 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000218    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000219    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000220      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000221      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000222    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000223    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000224******************************************************************004700      
000225                                                                  004800      
000226******************************************************************004900      
000227** This variable defines a date in the format DDMMCCAA          **005000      
000228**                                                              **005100      
000229 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000230 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000231    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000232    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000233    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000234    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000235      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000236      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000237******************************************************************006000      
000238                                                                  006100      
000239******************************************************************006200      
000240** This variable defines a date in the Julian Format CCAADDD    **006300      
000241**                                                              **006400      
000242 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000243 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000244    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000245    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000246                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000247      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000248      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000249    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000250******************************************************************007300      
000251                                                                  007400      
000252******************************************************************007500      
000253** This variable defines a date in the format AAMMDD            **007600      
000254**                                                              **007700      
000255 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000256 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000257    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000258    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000259    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000260******************************************************************008300      
000261                                                                  008400      
000262******************************************************************008500      
000263** This variable defines a date in the format MMDDAA            **008600      
000264**                                                              **008700      
000265 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000266 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000267    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000268    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000269    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000270******************************************************************009300      
000271                                                                  009400      
000272******************************************************************009500      
000273** This variable defines a date in the format DDMMAA            **009600      
000274**                                                              **009700      
000275 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000276 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000277    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000278    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000279    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000280******************************************************************010300      
000281                                                                  010400      
000282******************************************************************010500      
000283** These variables are defined to be used for CALL bridge logic **010600      
000284**                                                              **010700      
000285 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000286 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000287 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000288 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000289 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000290 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000291******************************************************************011400      
000292                                                                  011500      
000293******************************************************************011600      
000294** This variable is used for converting only a year field AA to **011700      
000295** CCAA and a CCAA to AA                                        **011800      
000296 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000297 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000298    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000299    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000300 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000301 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000302******************************************************************012300      
000303                                                                  012400      
000304******************************************************************012500      
000305** These variables are Bridge Variables for Intercambio files   **012600      
000306** para EDOCTA                                                  **012700      
000307 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000308 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000309 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000310 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000311 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000312 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000313 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000314******************************************************************013500      
000315* Para MODULO                                                     013600      
000316 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000317******************************************************************013800      
000318******************************************************************013900      
000319** Para FMOVSCHABO                                                014000      
000320 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000321******************************************************************014200      
000322                                                                  014300      
000323******************************************************************014400      
000324***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000325******************************************************************014600      
000326                                                                  014700      
000327 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000328 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000329     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000330     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000331     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000332******************************************************************015300      
000333                                                                  015400      
000334******************************************************************015500      
000335***  These Variables Are Defined For Date In AAMM Format       ***015600      
000336******************************************************************015700      
000337                                                                  015800      
000338 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000339 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000340     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000341     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000342******************************************************************016300      
000343                                                                  016400      
000344                                                                  016500      
000345*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000346 01  A2K-BASE-YEAR     PIC 9(02) VALUE   50.                      013700      
000347*TERMINA CODIGO DE RENOVACION CRONOS 2000                         013800      
000348                                                                  013900      
000349******************************************************************014000      
000350*            NOMBRE EXTERNO DEL ARCHIVO SDOS DEL S151            *014100      
000351******************************************************************014200      
000352                                                                  014300      
000353 01  WKS-TIT-SDOENT.                                              014400      
000354     02  WKS-NOM-SDOENT                PIC X(34).                 014500      
000355     02  WKS-FEC-SDOENT                PIC 9(06).                 014600      
000356     02  FILLER                        PIC X(04) VALUE            014700      
000357                                       " ON ".                    014800      
000358     02  WKS-PK-SDOENT                 PIC X(17).                 014900      
000359     02  FILLER                        PIC X(01) VALUE ".".       015000      
000360                                                                  015100      
000361******************************************************************016900      
000362*           NOMBRE EXTERNO DE ARCHIVO SDOSCITD ACC               *017000      
000363******************************************************************017100      
000364 01  WKS-TIT-SDOSCITD.                                            017200      
000365     02  FILLER                        PIC X(30) VALUE            017300      
000366                               "(S151)S151/FILE/E01/S500ACCCD/".  017400      
000367     02  WKS-CSI-ORIGCITD              PIC 9(02).                 017500      
000368     02  FILLER                        PIC X(04) VALUE            017600      
000369                                      "/10/".                     017700      
000370     02  WKS-FEC-SDOSALCITD            PIC 9(06) VALUE 0.         017800      
000371     02  FILLER                        PIC X(10) VALUE            017900      
000372                                      " ON CMEMP.".               018000      
000373*                                                                 018100      
000374 01  WKS-TIT-SDOSCITD-T.                                          018200      
000375     02  FILLER                        PIC X(31) VALUE            018300      
000376                               "(S151)S151/FILE/E01/S500ACCCDT/". 018400      
000377     02  WKS-CSI-ORIGCITD-T            PIC 9(02).                 018500      
000378     02  FILLER                        PIC X(04) VALUE            018600      
000379                                      "/10/".                     018700      
000380     02  WKS-FEC-SDOSALCITD-T          PIC 9(06) VALUE 0.         018800      
000381     02  FILLER                        PIC X(10) VALUE            018900      
000382                                      " ON CMEMP.".               019000      
000383******************************************************************019002      
000384*           NOMBRE EXTERNO DE ARCHIVO SDOSBNE ACC               * 019004      
000385******************************************************************019006      
000386 01  WKS-TIT-SDOSBNE.                                             019008      
000387     02  FILLER                        PIC X(30) VALUE            019010      
000388                            "(S151)S151/FILE/E01/S500ACCBN/".     019012      
000389     02  WKS-CSI-ORIGBNE              PIC 9(02).                  019014      
000390     02  FILLER                        PIC X(04) VALUE            019016      
000391                                      "/10/".                     019018      
000392     02  WKS-FEC-SDOSALBNE             PIC 9(06) VALUE 0.         019020      
000393     02  FILLER                        PIC X(10) VALUE            019022      
000394                                      " ON CMEMP.".               019024      
000395*                                                                 019026      
000396 01  WKS-TIT-SDOSBNE-T.                                           019028      
000397     02  FILLER                        PIC X(31) VALUE            019030      
000398                           "(S151)S151/FILE/E01/S500ACCBNT/".     019032      
000399     02  WKS-CSI-ORIGBNE-T            PIC 9(02).                  019034      
000400     02  FILLER                        PIC X(04) VALUE            019036      
000401                                      "/10/".                     019038      
000402     02  WKS-FEC-SDOSALBNE-T          PIC 9(06) VALUE 0.          019040      
000403     02  FILLER                        PIC X(10) VALUE            019042      
000404                                      " ON CMEMP.".               019044      
000405                                                                  019046      
000406******************************************************************019100      
000407*           NOMBRE EXTERNO ARCHIVO MONITOR                       *019200      
000408******************************************************************019300      
000409 01  WKS-TIT-MONITOR.                                             019400      
000410     02  FILLER                        PIC X(29) VALUE            019500      
000411                             "(S151)S151/FILE/ACCMONITORCD/".     019600      
000412     02  WKS-CSI-MONITOR               PIC 9(02).                 019700      
000413     02  FILLER                        PIC X(01) VALUE "/".       019800      
000414     02  WKS-FEC-MONITOR               PIC 9(06) VALUE 0.         019900      
000415     02  FILLER                        PIC X(10) VALUE            020000      
000416                                      " ON CMEMP.".               020100      
000417 01 WKS-HD-MONITOR.                                               020200      
000418    03 FILLER                          PIC X(04) VALUE "S500".    020300      
000419    03 WKS-HD-FEC-MON                  PIC 9(08).                 020400      
000420    03 FILLER                          PIC X(96).                 020500      
000421                                                                  020600      
000422 01 WKS-REG-MONITOR.                                              020700      
000423    03 WKS-CTO-MON                     PIC 9(16).                 020800      
000424    03 WKS-CLIENTE-MON                 PIC 9(12).                 020900      
000425    03 WKS-SIG-SDOACT                  PIC X.                     021000      
000426    03 WKS-SDO-ACT-MON                 PIC 9(14)V99.              021100      
000427    03 WKS-SIG-SDODIS                  PIC X.                     021200      
000428    03 WKS-SDO-DIS-MON                 PIC 9(14)V99.              021300      
000429    03 WKS-SIG-LIN                     PIC X.                     021400      
000430    03 WKS-SDO-LIN-MON                 PIC 9(14)V99.              021500      
000431    03 WKS-SIG-SDOACTCAL               PIC X.                     021600      
000432    03 WKS-SDO-ACTCALC-MON             PIC 9(14)V99.              021700      
000433    03 WKS-SDO-FECHA-MON               PIC 9(08).                 021800      
000434    03 WKS-SDO-RESULT-MON              PIC 9(02).                 021900      
000435    03 FILLER                          PIC X(02).                 022000      
000436******************************************************************022005      
000437*           NOMBRE EXTERNO ARCHIVO MONITOR BNE                   *022010      
000438******************************************************************022015      
000439 01  WKS-TIT-MONITOR-BNE.                                         022020      
000440     02  FILLER                            PIC X(30) VALUE        022025      
000441                             "(S151)S151/FILE/ACCMONITORBNE/".    022030      
000442     02  WKS-CSI-MONITOR-BNE               PIC 9(02).             022035      
000443     02  FILLER                            PIC X(01) VALUE "/".   022040      
000444     02  WKS-FEC-MONITOR-BNE               PIC 9(06) VALUE 0.     022045      
000445     02  FILLER                            PIC X(10) VALUE        022050      
000446                                           " ON CMEMP.".          022055      
00044701 WKS-REG-MONITOR-BNE.                                           022056      
000448    03 WKS-CTO-MON-BNE                     PIC 9(16).             022058      
000449    03 WKS-CLIENTE-MON-BNE                 PIC 9(12).             022060      
000450    03 WKS-SIG-SDOACT-BNE                  PIC X.                 022062      
000451    03 WKS-SDO-ACT-MON-BNE                 PIC 9(14)V99.          022064      
000452    03 WKS-SIG-SDODIS-BNE                  PIC X.                 022066      
000453    03 WKS-SDO-DIS-MON-BNE                 PIC 9(14)V99.          022068      
000454    03 WKS-SIG-LIN-BNE                     PIC X.                 022070      
000455    03 WKS-SDO-LIN-MON-BNE                 PIC 9(14)V99.          022072      
000456    03 WKS-SIG-SDOACTCAL-BNE               PIC X.                 022074      
000457    03 WKS-SDO-ACTCALC-MON-BNE             PIC 9(14)V99.          022076      
000458    03 WKS-SDO-FECHA-MON-BNE               PIC 9(08).             022078      
000459    03 WKS-SDO-RESULT-MON-BNE              PIC 9(02).             022080      
000460    03 FILLER                              PIC X(02).             022082      
000461                                                                  022100      
000462******************************************************************022200      
000463*                  PARAMETROS LIBRERIA L020 DEL S500             *022300      
000464******************************************************************022400      
000465* FORMATO DE ENTRADA                                              022500      
000466                                                                  022600      
000467                                                                  024300      
000468******************************************************************028300      
000469*         P A R A M E T R O S    E S T R U C T U R A             *028400      
000470******************************************************************028500      
000471                                                                  028600      
000472 01  WKS-CODIGO                        PIC 9(6).                  028700      
000473 01  WKS-COD                 REDEFINES WKS-CODIGO.                028800      
000474     03  WKS-LLAVE-EST                 PIC 9(4).                  028900      
000475     03  WKS-CLAVE-EST                 PIC 9(2).                  029000      
000476 01  WKS-RESPUESTA                     PIC X(210).                029100      
000477 01  WKS-RESP                REDEFINES WKS-RESPUESTA.             029200      
000478     03  WKS-RESULT                    PIC 9.                     029300      
000479     03  WKS-SUC-NOMBRE                PIC X(40).                 029400      
000480     03  FILLER                        PIC X(169).                029500      
000481 01  WKS-RESP1               REDEFINES WKS-RESPUESTA.             029600      
000482     03  WKS-RESULT1                   PIC 9(01).                 029700      
000483     03  FILLER                        PIC 9(10).                 029800      
000484     03  WKS-NOD-SUBNOD                PIC 9(04).                 029900      
000485     03  WKS-NOD-SUBNOD-R REDEFINES WKS-NOD-SUBNOD.               030000      
000486         05  WKS-NODO                  PIC 9(02).                 030100      
000487         05  WKS-SUBNODO               PIC 9(02).                 030200      
000488     03  WKS-NODO-CIFRAS               PIC 9(02).                 030300      
000489     03  FILLER                        PIC X(193).                030400      
000490 01 WKS-RESP3                 REDEFINES WKS-RESPUESTA.            030500      
000491     03  WKS-RESULT3                   PIC 9(01).                 030600      
000492     03  WKS-EST-CSI                   PIC 9(02).                 030700      
000493     03  FILLER                        PIC X(207).                030800      
000494 01  WKS-RESP2                REDEFINES WKS-RESPUESTA.            030900      
000495     03  WKS-RESULT2                   PIC 9(01).                 031000      
000496     03  WKS-AREA                      PIC 9(04).                 031100      
000497     03  WKS-DIVISION                  PIC 9(04).                 031200      
000498     03  WKS-DIR-DIV                   PIC 9(04).                 031300      
000499     03  WKS-DIR-REG                   PIC 9(04).                 031400      
000500     03  WKS-GER-PLAZA                 PIC 9(04).                 031500      
000501     03  WKS-OPERACION                 PIC 9(04).                 031600      
000502     03  FILLER                        PIC X(185).                031700      
000503                                                                  031800      
000504******************************************************************031900      
000505*           DEFINICION DE REGISTRO DE ARCHIVO SDOENT.            *032000      
000506******************************************************************032100      
000507                                                                  032200      
000508*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000509*   COPY "(S151)S151/FORMATO/ARCHIVO/SALDOS2".                    032300      
000510******************************************************************000100      
000511*                                                                *000200      
000512*mgv FORMATO ARCHIVO DE SALDOS - fechas a 8 dig. para arch.entrada000300      
000513* copia modificando nombres A02 -> A22 para usar 2 copy juntos    000400      
000514******************************************************************000500      
000515                                                                  000600      
000516                                                                  000700      
000517                                                                  000800      
000518 01 A22-R00-SALDOS.                                               000900      
000519    02 A22-R00-TIPO-REG            PIC  9(02)       COMP.         001000      
000520*   02 A22-R00-FILGRAL             PIC  X(179).                   001100      
000521*INICIA CODIGO DE RENOVACION CRONOS 2000                          001101      
000522    02 A22-R00-FILGRAL             PIC  X(385).                   001102      
000523*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001103      
000524                                                                  001200      
000525    02 A22-R00-HEADER              REDEFINES A22-R00-FILGRAL.     001300      
000526       03 A22-R00-HDR-SISTEMA      PIC  9(04)       COMP.         001400      
000527       03 A22-R00-HDR-PRODUCTO     PIC  9(04)       COMP.         001500      
000528*      03 A22-R00-HDR-FECHA        PIC  9(06)       COMP.         001600      
000529*INICIA CODIGO DE RENOVACION CRONOS 2000                          001601      
000530       03 A22-R00-HDR-FECHA        PIC  9(08)       COMP.         001602      
000531*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001603      
000532*      03 FILLER                   PIC  X(172).                   001700      
000533*INICIA CODIGO DE RENOVACION CRONOS 2000                          001701      
000534       03 FILLER                   PIC  X(377).                   001702      
000535*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001703      
000536                                                                  001800      
000537    02 A22-R01-REG-SAL             REDEFINES A22-R00-FILGRAL.     001900      
000538       03 A22-R01-SIS              PIC  9(04)       COMP.         002000      
000539       03 A22-R01-PRD              PIC  9(04)       COMP.         002100      
000540       03 A22-R01-INS              PIC  9(04)       COMP.         002200      
000541       03 A22-R01-CTA              PIC  9(20)       COMP.         002300      
000542       03 A22-R01-CTA-R            REDEFINES A22-R01-CTA.         002400      
000543          05 A22-R01-SUCPRO        PIC  9(04)       COMP.         002500      
000544          05 A22-R01-CNT           PIC  9(16)       COMP.         002600      
000545       03 A22-R01-EDOCTA           PIC  9(02)       COMP.         002700      
000546*      03 A22-R01-FECPRO           PIC  9(06)       COMP.         002800      
000547*INICIA CODIGO DE RENOVACION CRONOS 2000                          002801      
000548       03 A22-R01-FECPRO           PIC  9(08)       COMP.         002802      
000549*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002803      
000550*      03 A22-R01-FECINI           PIC  9(06)       COMP.         002900      
000551*INICIA CODIGO DE RENOVACION CRONOS 2000                          002901      
000552       03 A22-R01-FECINI           PIC  9(08)       COMP.         002902      
000553*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002903      
000554*      03 A22-R01-FECFIN           PIC  9(06)       COMP.         003000      
000555*INICIA CODIGO DE RENOVACION CRONOS 2000                          003001      
000556       03 A22-R01-FECFIN           PIC  9(08)       COMP.         003002      
000557*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003003      
000558*      03 A22-R01-FECULTMOV        PIC  9(06)       COMP.         003100      
000559*INICIA CODIGO DE RENOVACION CRONOS 2000                          003101      
000560       03 A22-R01-FECULTMOV        PIC  9(08)       COMP.         003102      
000561*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003103      
000562       03 A22-R01-STATUS           PIC  9(02)       COMP.         003200      
000563       03 A22-R01-ELEM-IMP         OCCURS 30 TIMES.               003300      
000564          04 A22-R01-CVESDO        PIC  9(04)       COMP.         003400      
000565          04 A22-R01-IMPT          PIC S9(13)V99    COMP.         003500      
000566*      03 A22-R01-FILXAPL          PIC  X(19).                    003600      
000567*INICIA CODIGO DE RENOVACION CRONOS 2000                          003601      
000568       03 A22-R01-FILXAPL          PIC  X(51).                    003602      
000569*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003603      
000570                                                                  003700      
000571       03 A22-R01-S084             REDEFINES A22-R01-FILXAPL.     003800      
000572          04 A22-R01-TASNET        PIC  9(04)V9(04) COMP.         003900      
000573          04 A22-R01-TASBRU        PIC  9(04)V9(04) COMP.         004000      
000574          04 A22-R01-NETPER        PIC  9(04)V9(04) COMP.         004100      
000575          04 A22-R01-NETANU        PIC  9(04)V9(04) COMP.         004200      
000576          04 A22-R01-DIASPER       PIC  9(02)       COMP.         004300      
000577          04 A22-R01-DIASANU       PIC  9(02)       COMP.         004400      
000578          04 A22-R01-MONS084       PIC  9(02)       COMP.         004500      
000579*INICIA CODIGO DE RENOVACION CRONOS 2000                          004520      
000580          04 FILLER                PIC  X(32).                    004540      
000581*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004560      
000582                                                                  004600      
000583       03 A22-R01-S084AVB          REDEFINES A22-R01-FILXAPL.     004700      
000584          04 FILLER                PIC X(03).                     004800      
000585*         04 A22-R01-FECAPE        PIC  9(06)       COMP.         004900      
000586*INICIA CODIGO DE RENOVACION CRONOS 2000                          004901      
000587          04 A22-R01-FECAPE        PIC  9(08)       COMP.         004902      
000588*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004903      
000589*         04 A22-R01-FECSIGPAGO    PIC  9(06)       COMP.         005000      
000590*INICIA CODIGO DE RENOVACION CRONOS 2000                          005001      
000591          04 A22-R01-FECSIGPAGO    PIC  9(08)       COMP.         005002      
000592*TERMINA CODIGO DE RENOVACION CRONOS 2000                         005003      
000593          04 A22-R01-SORTEO        PIC  9(02)       COMP.         005100      
000594          04 A22-R01-RESTANTES     PIC  9(03)       COMP.         005200      
000595          04 A22-R01-ANTICIPADAS   PIC  9(03)       COMP.         005300      
000596          04 A22-R01-OPORTUNAS     PIC  9(02)       COMP.         005400      
000597          04 A22-R01-TOTALES       PIC  9(02)       COMP.         005500      
000598          04 A22-R01-ATRASOS       PIC  9(02)       COMP.         005600      
000599          04 A22-R01-BONOS         PIC  9(02)       COMP.         005700      
000600          04 A22-R01-ESQUEMA       PIC  9(02)       COMP.         005800      
000601          04 A22-R01-MOVEDAAVB     PIC  9(02)       COMP.         005900      
000602          04 FILLER                PIC  X(30).                    005950      
000603                                                                  006000      
000604       03 A22-R01-S087                REDEFINES A22-R01-FILXAPL.  006100      
000605          04 A22-R01-PLAZO            PIC  9(04)       COMP.      006200      
000606          04 A22-R01-TASS087          PIC  9(04)V9(04) COMP.      006300      
000607          04 A22-R01-INSTRUCCIONES    PIC  9(02)       COMP.      006400      
000608          04 A22-R01-TIPOPER          PIC  9(04)       COMP.      006500      
000609          04 A22-R01-MON              PIC  9(04)       COMP.      006600      
000610          04 A22-R01-FILS087          PIC  X(08).                 006700      
000611*INICIA CODIGO DE RENOVACION CRONOS 2000                          006701      
000612          04 FILLER                   PIC  X(32).                 006702      
000613*TERMINA CODIGO DE RENOVACION CRONOS 2000                         006703      
000614                                                                  006800      
000615       03 A22-R01-S500             REDEFINES A22-R01-FILXAPL.     006900      
000616          04 A22-R01-DIASCICLO     PIC  9(03)       COMP.         007000      
000617          04 A22-R01-DIASANO       PIC  9(03)       COMP.         007100      
000618          04 A22-R01-TASRENET      PIC  9(04)V9(04) COMP.         007200      
000619          04 A22-R01-TASREBRU      PIC  9(04)V9(04) COMP.         007300      
000620          04 A22-R01-TASREANO      PIC  9(04)V9(04) COMP.         007400      
000621          04 A22-R01-STATION       PIC  9(04)       COMP.         007500      
000622          04 A22-R01-CTACON        PIC  9(02)       COMP.         007600      
000623          04 A22-R01-MONEDA        PIC  9(02)       COMP.         007700      
000624          04 A22-R01-GENEDOCTA     PIC  9(01).                    007702      
000625          04 A22-R01-INDENVCTD     PIC  9(02)       COMP.         007706      
000626          04 A22-R01-INDENVCTD-R REDEFINES A22-R01-INDENVCTD.     007716      
000627             05 A22-R01-INDENVBNE  PIC 9(01)        COMP.         007726      
000628             05 A22-R01-INDENVCD   PIC 9(01)        COMP.         007736      
000629          04 A22-R01-P-CTO-ORI     PIC  9(04)       COMP.         007746      
000630          04 A22-R01-I-CTO-ORI     PIC  9(04)       COMP.         007756      
000631          04 A22-R01-M-CTO-ORI     PIC  9(02)       COMP.         007766      
000632          04 A22-R01-C-TAR-ORI     PIC  9(16)       COMP.         007776      
000633          04 A22-R01-FILS500       PIC  X(17).                    007786      
000634                                                                  007800      
000635       03 A22-R01-S408             REDEFINES A22-R01-FILXAPL.     007900      
000636*         04 A22-R01-FECVEN        PIC  9(06)       COMP.         008000      
000637*INICIA CODIGO DE RENOVACION CRONOS 2000                          008001      
000638          04 A22-R01-FECVEN        PIC  9(08)       COMP.         008002      
000639*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008003      
000640          04 A22-R01-TASINT        PIC  9(04)V9(04) COMP.         008100      
000641          04 A22-R01-DIASBG        PIC  9(04)       COMP.         008200      
000642          04 A22-R01-LINEA         PIC  9(04)       COMP.         008300      
000643          04 A22-R01-FOLIO         PIC  9(04)       COMP.         008400      
000644          04 A22-R01-FILS408       PIC  X(06).                    008500      
000645*INICIA CODIGO DE RENOVACION CRONOS 2000                          008501      
000646          04 FILLER                PIC  X(31).                    008502      
000647*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008503      
000648                                                                  008600      
000649    02 A22-R00-TRA-SAL             REDEFINES A22-R00-FILGRAL.     008700      
000650       03 A22-R02-TRA-TOTREG       PIC  9(08)       COMP.         008800      
000651       03 A22-R02-TRA-TOTCON       PIC  9(08)       COMP.         008900      
000652       03 A22-R02-TRA-IMPT         PIC S9(15)V99    COMP.         009000      
000653*      03 FILLER                   PIC  X(162).                   009100      
000654*INICIA CODIGO DE RENOVACION CRONOS 2000                          009101      
000655       03 FILLER                   PIC  X(368).                   009102      
000656*TERMINA CODIGO DE RENOVACION CRONOS 2000                         009103      
000657                                                                  009200      
000658                                                                  009300      
000659*=================================================================009400      
000660*====             DESCRIPCION DE CAMPOS                        ===009500      
000661*=================================================================009600      
000662                                                                  009700      
000663*=A22-R00-TIPO-REG     : 00 = HEADER                              009800      
000664*                        80 = INICIO                              009900      
000665*                        81 = REGISTRO DE SALDOS                  010000      
000666*                        82 = FIN                                 010100      
000667*                        99 = TRAILER                             010200      
000668                                                                  010300      
000669*=================================================================010400      
000670*===                REGISTRO HEADER                            ===010500      
000671*=================================================================010600      
000672                                                                  010700      
000673*=A22-R00-HDR-SISTEMA  : NUMERO DE SISTEMA EJ. 0500               010800      
000674*=A22-R00-HDR-PRODUCTO : NUMERO DE PRODUCTO EJ. 0066              010900      
000675*=A22-R00-HDR-FECHA    : FECHA CONTABLE DE LA APLICACION ORIGEN   011000      
000676                                                                  011100      
000677*=================================================================011200      
000678*===                   REGISTRO DE SALDOS                      ===011300      
000679*=================================================================011400      
000680                                                                  011500      
000681*=A22-R01-SIS          : NUMERO DE SISTEMA     EJ. 0500           011600      
000682*=A22-R01-PRD          : NUMERO DE PRODUCTO    EJ. 0066           011700      
000683*=A22-R01-INS          : NUMERO DE INSTRUMENTO EJ. 0006.          011800      
000684*=A22-R01-CTA          : NUMERO DE CUENTA/CONTRATO                011900      
000685*=A22-R01-EDOCTA       : 00 = NADA MAS ES REGISTRO DE SALDOS      012000      
000686*                        01 = ACTIVOS Y SE GENERA EDO. CTA.       012100      
000687*                        02 = CANCELADOS EN EL MES Y SE GENERA    012200      
000688*                             EDO CTA                             012300      
000689*                        03 = INACTIVOS Y SE GENERA EDO CTA       012400      
000690*                        04 = INACTIVOS Y NO SE GENERA EDO CTA    012500      
000691*=A22-R01-FECPRO       : FECHA CONTABLE DE LA APLICACION          012600      
000692*                        FORMATO AAMMDD                           012700      
000693*=A22-R01-FECINI       : FECHA INICIO DE CICLO PARA CORTE FORMATO 012800      
000694*                        AAMMDD (CAMPO OBLIGATORIO SI             012900      
000695*                        A22-R01-EDOCTA ES MAYOR A CERO)          013000      
000696*=A22-R01-FECFIN       : FECHA FINAL DE CICLO PARA CORTE FORMATO  013100      
000697*                        AAMMDD (CAMPO OBLIGATORIO SI             013200      
000698*                        A22-R01-EDOCTA ES MAYOR A CERO)          013300      
000699*=A22-R01-STATUS       : 00 = ULTIMO REGISTRO DE SALDOS POR       013400      
000700*                             CONTRATO                            013500      
000701*                        01 = SIGUIENTE REGISTRO PERTENECE AL     013600      
000702*                         CONTRATO DE ESTE REGISTRO.              013700      
000703*=A22-R01-CVESDO       : NUMERO DE CONCEPTO DE SALDOS             013800      
000704*                        EJ. 0002 (SALDO ACTUAL)                  013900      
000705*=A22-R01-IMPT         : IMPORTE DEL CONCEPTO DE SALDO            014000      
000706                                                                  014100      
000707*=================================================================014200      
000708*==                FILLER POR APLICACION                       ===014300      
000709*=================================================================014400      
000710                                                                  014500      
000711                                                                  014600      
000712                                                                  014700      
000713                                                                  014800      
000714*=================================================================014900      
000715*==                    SISTEMA S500                            ===015000      
000716*=================================================================015100      
000717                                                                  015200      
000718*=A22-R01-DIASCICLO    : DIAS EN EL CICLO DE CORTE                015300      
000719*=A22-R01-DIASANO      : DIAS EN EL A\O                           015400      
000720*=A22-R01-TASRENET     : TASA DE RENDIMIENTO NETA                 015500      
000721*=A22-R01-TASREBRU     : TASA DE RENDIMIENTO BRUTA                015600      
000722*=A22-R01-TASREANO     : TASA DE RENDIMIENTO NETA EN EL A\O       015700      
000723*=A22-R01-STATION      : IDENTIFICADOR PARA BANCA ELECTRONICA     015800      
000724*=A22-R01-CTACON       : 00 = SUCURSAL 870                        015900      
000725*                        01 = CUENTA CONCENTRADORA                016000      
000726*=A22-R01-MONEDA       : TIPO DE MONEDA                           016010      
000727*=A22-R01-GENEDOCTA    : VALOR PARA GENERACION ESTADO DE CTA      016020      
000728*=A22-R01-INDENVCTD    : VALOR DE INDICADOR DE ENVIO CITIDIRECT   016030      
000729*=A22-R01-INDENVBNE    : VALOR DE INDICADOR DE ENVIO BANCANET     016035      
000730*=A22-R01-P-CTO-ORI    : PROD DEL CTO ORIGINAL SE TRASP BENEF     016040      
000731*=A22-R01-I-CTO-ORI    : INST DEL CTO ORIGINAL SE TRASP BENEF     016050      
000732*=A22-R01-M-CTO-ORI    : MONE DEL CTO ORIGINAL SE TRASP BENEF     016060      
000733*=A22-R01-C-TAR-ORI    : CTO  TARJETA ORIGINAL SE TRASP BENEF     016070      
000734*=A22-R01-FILS500      : FILLER PARA USO FUTURO                   016100      
000735                                                                  016200      
000736*=================================================================016300      
000737*==                    SISTEMA S408                            ===016400      
000738*=================================================================016500      
000739                                                                  016600      
000740*=A22-R01-FECVEN       : FECHA DE VENCIMIENTO DE LA LINEA         016700      
000741*=A22-R01-TASINT       : TASA DE INTERES                          016800      
000742*=A22-R01-DIASBG       : DIAS DE SOBREGIRO                        016900      
000743*=A22-R01-LINEA        : NUMERO DE LINEA                          017000      
000744*=A22-R01-FOLIO        : NUMERO DE FOLIO                          017100      
000745*=A22-R01-FILS408      : FILLER PARA USO FUTURO                   017200      
000746                                                                  017300      
000747*=================================================================017400      
000748*==                   REGISTRO TRAILER                         ===017500      
000749*=================================================================017600      
000750                                                                  017700      
000751*=A22-R02-TRA-TOTREG : TOTAL DE REGISTROS SIN INCLUIR HEADER Y    017800      
000752*                      TRAILER.                                   017900      
000753*=A22-R02-TRA-TOTCON : TOTAL DE CONTRATOS                         018000      
000754*=A22-R02-TRA-IMPT   : SUMA DE TODOS LOS IMPORTES DE LOS CONCEPTOS018100      
000755*                      DE SALDOS.                                 018200      
000756                                                                  018300      
000757*=================================================================018400      
000758*==             NOMBRE EXTERNO DE ARCHIVO                      ===018500      
000759*=================================================================018600      
000760                                                                  018700      
000761*=  (SXXX)S151/FILE/S050/SALDOSYYY/AAMMDD                         018800      
000762                                                                  018900      
000763* XXX   = NUMERO DEL USERCODE EJ. S500                            019000      
000764* YYY   = NUMERO DEL PRODUCTO EJ. S066                            019100      
000765* AAMMDD = FECHA CONTABLE DEL SISTEMA ORIGEN                      019200      
000766*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000767                                                                  032400      
000768 01  WKS-HEADER-SDOENT.                                           032500      
000769     02  WKS-HSE-TIPOREG                PIC X(02).                032600      
000770     02  WKS-HSE-FECHA                  PIC 9(08).                032700      
000771     02  FILLER                         PIC X(176).               032800      
000772                                                                  033600      
000773******************************************************************033700      
000774*             ARCHIVO ACC CITIBANK CITD (SALDOS)                 *033800      
000775******************************************************************033900      
000776*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000777*   COPY "CITIDIRECT/S151/FORMATO/ARCHIVO/ACC".                   034000      
000778******************************************************************000100      
000779*                                                                *000200      
000780*             FORMATO DEL ARCHIVO DE SALDOS CBII ACC             *000300      
000781*                                                                *000400      
000782******************************************************************000500      
000783                                                                  000600      
000784                                                                  000700      
000785                                                                  000800      
000786 01 ACCI-INT-REC.                                                 000900      
000787    05 ACCI-RECORD-TYPE            PIC  X(03).                    001000      
000788    05 ACCI-KEY-GRP.                                              001100      
000789       10 ACCI-BRCH-NBR            PIC 9(03).                     001200      
000790       10 ACCI-GEN-CUST            PIC 9(12).                     001300      
000791       10 ACCI-CCY-CODE            PIC 9(03).                     001400      
000792       10 ACCI-ACCT-NBR.                                          001500      
000793          15 ACCI-ACCT-NBR1        PIC 9(12).                     001520      
000794          15 ACCI-ACCT-NBR2        PIC 9(23).                     001540      
000795       10 ACCI-LIA-NBR             PIC 9(11).                     001600      
000796    05 ACCI-SWIFT-CCY-CODE         PIC X(04).                     001700      
000797    05 ACCI-SHORT-NAME-TEXT        PIC X(32).                     001800      
000798    05 ACCI-ACCT-STAT-IND          PIC X(01).                     001900      
000799    05 ACCI-CAT-CODE               PIC 9(07).                     002000      
000800    05 ACCI-LAST-TXN-DATE          PIC 9(07).                     002100      
000801    05 ACCI-ACCT-BAL-AMT           PIC 9(15)V99.                  002200      
000802    05 ACCI-ACCT-BAL-AMT-SIGN      PIC X(01).                     002300      
000803    05 ACCI-LCY-ACCT-BAL-AMT       PIC 9(15)V99.                  002400      
000804    05 ACCI-LCY-BAL-AMT-SIGN       PIC X(01).                     002500      
000805    05 ACCI-DISP-VAL-BAL-AMT       PIC 9(15)V99.                  002600      
000806    05 ACCI-DISP-BAL-AMT-SIGN      PIC X(01).                     002700      
000807    05 ACCI-BANK-NON-BANK          PIC X(03).                     002800      
000808    05 ACCI-MAIL                   PIC X(04).                     002900      
000809    05 ACCI-MAIL-TO-COLLECT        PIC X(01).                     003000      
000810    05 ACCI-MAIL-RULEOFF           PIC X(02).                     003100      
000811    05 ACCI-LANGUAGE-CODE          PIC 9(02).                     003200      
000812    05 ACCI-FILLER                 PIC X(25).                     003300      
000813    05 ACCI-CUSTOMER-NAME          PIC X(35).                     003400      
000814    05 ACCI-CBR-ADDRESS-1          PIC X(35).                     003500      
000815    05 ACCI-CBR-ADDRESS-2          PIC X(35).                     003600      
000816    05 ACCI-CBR-ADDRESS-3          PIC X(35).                     003700      
000817    05 ACCI-CBR-ADDRESS-4          PIC X(35).                     003800      
000818    05 ACCI-PRIME-DELIMETER        PIC X(01).                     003900      
000819                                                                  004000      
000820 01 ACCI-TR-REC REDEFINES ACCI-INT-REC.                           004100      
000821    05 ACCI-ENDOFFILE              PIC X(11).                     004200      
000822    05 FILLER                      PIC X(374).                    004300      
000823                                                                  004400      
000824*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000825                                                                  034100      
000826******************************************************************034200      
000827*             COPYBOOK CON EL LLAMADO A CLIENTES                 *034300      
000828******************************************************************034400      
000829*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000830* COPY "(S016)S016/PARAMETROS/L422/COMISIONES2K ON CLIENTES.".    034500      
000831**********************************************************        000100      
000832***  PARAMETROS PARA ENTRY POINT S016_L422_COMXCTA (01)           000200      
000833***   CONSULTA AL B94COMISIONES COMPLETO.                         000300      
000834**********************************************************        000400      
000835  01  E422-01-CTR-ENTRADA.                                        000500      
000836     02  E422-01-CTR-NUMSIST             PIC 9(04) COMP.          000600      
000837*            NUMERO DEL SISTEMA LLAMADOR                          000700      
000838     02  E422-01-CTR-NUMPASO             PIC 9(04) COMP.          000800      
000839*            NUMERO DEL PASO LLAMADOR                             000900      
000840     02  E422-01-CTA-NUMPROD             PIC 9(04) COMP.          001000      
000841*            SEGUN CATALOGOS DE CLIENTES                          001100      
000842     02  E422-01-CTA-CVEINST             PIC 9(04) COMP.          001200      
000843*            SEGUN CATALOGO DE CLIENTES                           001300      
000844     02  E422-01-CTO-NUM.                                         001400      
000845*            NUMERO DE CUENTA DE LA CUAL SE DESEA OBTENER INF.    001500      
000846         03  E422-01-CTA-NUMPREF         PIC 9(04) COMP.          001600      
000847         03  E422-01-CTA-NUM             PIC 9(12) COMP.          001700      
000848     02  E422-01-CTR-NUMCSI              PIC 9(02) COMP.          001800      
000849     02  FILLER                          PIC X(43).               001900      
000850*  SIZE ENTRADA X(60).                                            002000      
000851  01  S422-01-CTR-SALIDA.                                         002100      
000852     02  S422-01-CTR-REGISTRO.                                    002200      
000853         03  S422-01-CTR-NUMCSI          PIC 9(02) COMP.          002300      
000854         03  S422-01-CTA-NUMPROD         PIC 9(04) COMP.          002400      
000855         03  S422-01-CTA-CVEINST         PIC 9(04) COMP.          002500      
000856         03  S422-01-CTO-NUM.                                     002600      
000857             04  S422-01-CTA-NUMPREF     PIC 9(04) COMP.          002700      
000858             04  S422-01-CTA-NUM         PIC 9(12) COMP.          002800      
000859         03  S422-01-CTR-COMISION OCCURS 10 TIMES.                002900      
000860             04  S422-01-CTR-CVECOBRO    PIC 9(02) COMP.          003000      
000861             04  S422-01-CTA-COBCOM      PIC 9(03)V9(2) COMP.     003100      
000862         03  S422-01-CTR-CVEDGA          PIC 9(02) COMP.          003200      
000863         03  S422-01-CTR-FECCADUC        PIC 9(04) COMP.          003300      
000864         03  S422-01-CTR-NUMREPTAR       PIC 9(04) COMP.          003400      
000865         03  S422-01-CTR-NUMCONEDO       PIC 9(04) COMP.          003500      
000866         03  S422-01-CTR-INDCAMB         PIC 9(02) COMP.          003600      
000867         03  S422-01-CTR-FECCADUC-2K     PIC 9(06) COMP.          003700      
000868*FECCADUC-2K  ES AAAAMM POR ESO SOLO ES PIC 9(06) COMP.           003800      
000869         03  FILLER                      PIC X(24).               003900      
000870*SIZE SALIDA X(84).                                               004000      
000871  77  R422-01-CTR-ERROR                   PIC S9(11) BINARY.      004100      
000872****************************************************************  004200      
000873* PARAMETROS PARA ENTRY POINT S016_L422_COMXNCTAS (02)            004300      
000874* CONSULTA B94COMISIONES. COMPLETO, MULTIPLE(NUM_REG E/S)         004400      
000875****************************************************************  004500      
000876  01  E422-02-CTR-ENTRADA.                                        004600      
000877     02  E422-02-CTR-NUMSIST             PIC 9(04) COMP.          004700      
000878*            NUMERO DEL SISTEMA LLAMADOR                          004800      
000879     02  E422-02-CTR-NUMPASO             PIC 9(04) COMP.          004900      
000880*            NUMERO DEL PASO LLAMADOR                             005000      
000881     02  E422-02-CTA-NUMPROD             PIC 9(04) COMP.          005100      
000882*            SEGUN CATALOGOS DE CLIENTES                          005200      
000883     02  E422-02-CTA-CVEINST             PIC 9(04) COMP.          005300      
000884*            SEGUN CATALOGO DE CLIENTES                           005400      
000885     02  E422-02-CTO-NUM.                                         005500      
000886*            NUMERO DE CUENTA DE LA CUAL SE DESEA OBTENER INF.    005600      
000887         03  E422-02-CTA-NUMPREF         PIC 9(04) COMP.          005700      
000888         03  E422-02-CTA-NUM             PIC 9(12) COMP.          005800      
000889     02  E422-02-CTR-NUMREG              PIC 9(02) COMP.          005900      
000890*        NUMERO DE REG. QUE SE DESEAN OBTENER EN EL LLAMADO       006000      
000891     02  E422-02-CTR-NUMCSI              PIC 9(02) COMP.          006100      
000892     02  FILLER                          PIC X(32).               006200      
000893* SIZE ENTRADA X(60)                                              006300      
000894  01  S422-02-CTR-SALIDA.                                         006400      
000895     02  S422-02-CTR-NUMREG              PIC 9(02) COMP.          006500      
000896*        NUMERO DE REGISTROS ENTREGADOS EN LA SALIDA              006600      
000897     02  S422-02-CTR-REGISTRO OCCURS 30 TIMES.                    006700      
000898         03  S422-02-CTR-NUMCSI          PIC 9(02) COMP.          006800      
000899         03  S422-02-CTA-NUMPROD         PIC 9(04) COMP.          006900      
000900         03  S422-02-CTA-CVEINST         PIC 9(04) COMP.          007000      
000901         03  S422-02-CTO-NUM.                                     007100      
000902             04  S422-02-CTA-NUMPREF     PIC 9(04) COMP.          007200      
000903             04  S422-02-CTA-NUM         PIC 9(12) COMP.          007300      
000904         03  S422-02-CTR-COMISION OCCURS 10 TIMES.                007400      
000905             04  S422-02-CTR-CVECOBRO    PIC 9(02) COMP.          007500      
000906             04  S422-02-CTA-COBCOM      PIC 9(03)V9(2) COMP.     007600      
000907         03  S422-02-CTR-CVEDGA          PIC 9(02) COMP.          007700      
000908         03  S422-02-CTR-FECCADUC        PIC 9(04) COMP.          007800      
000909         03  S422-02-CTR-NUMREPTAR       PIC 9(04) COMP.          007900      
000910         03  S422-02-CTR-NUMCONEDO       PIC 9(04) COMP.          008000      
000911         03  S422-02-CTR-INDCAMB         PIC 9(02) COMP.          008100      
000912         03  S422-02-CTR-FECCADUC-2K     PIC 9(06) COMP.          008200      
000913*FECCADUC-2K  ES AAAAMM POR ESO SOLO ES PIC 9(06) COMP.           008300      
000914         03  FILLER                      PIC X(25).               008400      
000915*      SIZE reg OCCURS X(84)                                      008500      
000916*  SIZE SALIDA = 1+(84*30) = 2521                                 008600      
000917   77   R422-02-CTR-ERROR                PIC S9(11) BINARY.       008700      
000918*******************************************************           008800      
000919*  PARAMETROS PARA ENTRY POINT S016_L422_CTESGRAL (03)*           008900      
000920*  CONSULTA B01CLIENTES y B05CTECTA CON OPCION.     ***           009000      
000921*******************************************************           009100      
000922  01  E422-03-CTR-ENTRADA.                                        009200      
000923     02  E422-03-CTR-NUMSIST         PIC 9(04) COMP.              009300      
000924     02  E422-03-CTR-NUMPASO         PIC 9(04) COMP.              009400      
000925     02  E422-03-CTA-NUMPROD         PIC 9(04) COMP.              009500      
000926     02  E422-03-CTA-CVEINST         PIC 9(04) COMP.              009600      
000927     02  E422-03-CTO-NUM.                                         009700      
000928         03  E422-03-CTA-NUMPREF     PIC 9(04) COMP.              009800      
000929         03  E422-03-CTA-NUM         PIC 9(12) COMP.              009900      
000930     02  E422-03-CTE-NUM             PIC 9(12) COMP.              010000      
000931     02  E422-03-OPCION              PIC 9(02) COMP.              010100      
000932     02  E422-03-CTR-NUMCSI          PIC 9(02) COMP.              010200      
000933     02  FILLER                      PIC X(36).                   010300      
000934*  SIZE ENTRADA X(60).                                            010400      
000935 01 S422-03-CTR-SALIDA.                                           010500      
000936    02 S422-03-CTR-REGISTRO.                                      010600      
000937       03 S422-03-CTE-NUM            PIC 9(12) COMP.              010700      
000938       03 S422-03-CTE-NOM            PIC X(55).                   010800      
000939       03 S422-03-CTE-DOM.                                        010900      
000940          04 S422-03-CTE-CALLENUM    PIC X(36).                   011000      
000941          04 S422-03-CTE-NOMCOL      PIC X(24).                   011100      
000942          04 S422-03-CTE-NOMPOB      PIC X(20).                   011200      
000943          04 S422-03-CTE-CVEEDO      PIC 9(02) COMP.              011300      
000944          04 S422-03-CTE-NUMCP       PIC 9(06) COMP.              011400      
000945          04 S422-03-CTE-NUMTEL      PIC 9(10) COMP.              011500      
000946          04 S422-03-CTE-NUMTELEXT   PIC 9(06) COMP.              011600      
000947          04 S422-03-CTE-CVETEL      PIC 9(02) COMP.              011700      
000948          04 S422-03-CTE-NUMTEL2     PIC 9(10) COMP.              011800      
000949          04 S422-03-CTE-NUMTELEXT2  PIC 9(06) COMP.              011900      
000950          04 S422-03-CTE-CVETEL2     PIC 9(02) COMP.              012000      
000951       03 S422-03-CTR-CVEDOM         PIC 9(02) COMP.              012100      
000952       03 S422-03-CTR-NUMDOMS        PIC 9(04) COMP.              012200      
000953       03 S422-03-CTE-CVEPERS        PIC 9(02) COMP.              012300      
000954       03 S422-03-CTE-CVETIPO        PIC 9(02) COMP.              012400      
000955       03 S422-03-CTE-NUMCLASIF      PIC 9(02) COMP.              012500      
000956       03 S422-03-CTE-CODRFC.                                     012600      
000957          04 S422-03-CTE-CODINI      PIC X(04).                   012700      
000958          04 S422-03-CTE-FECNAC      PIC 9(06) COMP.              012800      
000959          04 S422-03-CTE-CODHOM      PIC X(05).                   012900      
000960       03 S422-03-CTE-CVENACION      PIC 9(02) COMP.              013000      
000961       03 S422-03-CTE-CVESEXO        PIC 9(02) COMP.              013100      
000962       03 S422-03-CTE-CAEB           PIC 9(06) COMP.              013200      
000963       03 S422-03-CTE-CVEACTBM       PIC 9(06) COMP.              013300      
000964       03 S422-03-CTE-CVESECTOR      PIC 9(02) COMP.              013400      
000965       03 S422-03-CTE-CVEPERBCO      PIC 9(02) COMP.              013500      
000966       03 S422-03-CTE-CVESEG         PIC 9(02) COMP.              013600      
000967       03 S422-03-CTE-CVESTATUS      PIC 9(02) COMP.              013700      
000968       03 S422-03-CTE-RIEBNM         PIC X(02).                   013800      
000969       03 S422-03-CTE-DIACORTE       PIC 9(02) COMP.              013900      
000970       03 S422-03-CTE-CVEENVIO       PIC 9(04) COMP.              014000      
000971       03 S422-03-CTE-NUMOFICON      PIC 9(04) COMP.              014100      
000972*  NUMOFICON ES EQUIVALENTE A SUCURSAL PROMOTORA                  014200      
000973       03 S422-03-CTE-EDOCTACON      PIC 9(02) COMP.              014300      
000974       03 S422-03-CTE-CVEDISENT      PIC 9(02) COMP.              014400      
000975       03 S422-03-CTE-CVEDISSAL      PIC 9(02) COMP.              014500      
000976       03 S422-03-OFI-NUMCSIALT      PIC 9(02) COMP.              014600      
000977       03 S422-03-CTE-FECALTA-2K     PIC 9(08) COMP.              014700      
000978       03 S422-03-CTE-FECULTMOD-2K   PIC 9(08) COMP.              014800      
000979       03 S422-03-CTR-CVESTADOM      PIC 9(02) COMP.              014900      
000980       03 FILLER                     PIC X(27).                   015000      
000981*  SIZE SALIDA X(240).                                            015100      
000982  01  S422-03-RCTR-SALIDA REDEFINES S422-03-CTR-SALIDA.           015200      
000983     03 S422-03-CTR-ERROR                 PIC 9(004) COMP.        015300      
000984     03 S422-03-CTR-ERRORTYPE             PIC 9(004) COMP.        015400      
000985     03 S422-03-CTR-STRUCTURE             PIC 9(004) COMP.        015500      
000986     03 FILLER                            PIC X(234).             015600      
000987   77  R422-03-CTR-ERROR                 PIC S9(11) BINARY.       015700      
000988*********************************************************         015800      
000989*   PARAMETROS PARA ENTRY POINT S016_L422_CUENTAS (04)***         015900      
000990*** CONSULTA B04CUENTAS Y B17INFADICTA CON OPCION   *****         016000      
000991*********************************************************         016100      
000992  01  E422-04-CTR-ENTRADA.                                        016200      
000993     02  E422-04-CTR-NUMCSI              PIC 9(02) COMP.          016300      
000994*            NUMERO DEL CSI DEL QUE SE DESEA INF.                 016400      
000995     02  E422-04-CTR-NUMSIST             PIC 9(04) COMP.          016500      
000996*            NUMERO DEL SISTEMA LLAMADOR                          016600      
000997     02  E422-04-CTR-NUMPASO             PIC 9(04) COMP.          016700      
000998*            NUMERO DEL PASO LLAMADOR                             016800      
000999     02  E422-04-CTA-NUMPROD             PIC 9(04) COMP.          016900      
001000*            SEGUN CATALOGOS DE CLIENTES                          017000      
001001     02  E422-04-CTA-CVEINST             PIC 9(04) COMP.          017100      
001002*            SEGUN CATALOGO DE CLIENTES                           017200      
001003     02  E422-04-CTO-NUM.                                         017300      
001004*            NUMERO DE CUENTA DE LA CUAL SE DESEA OBTENER INF.    017400      
001005         03  E422-04-CTA-NUMPREF         PIC 9(04) COMP.          017500      
001006         03  E422-04-CTA-NUM             PIC 9(12) COMP.          017600      
001007     02  E422-04-OPCION                  PIC 9(02) COMP.          017700      
001008*            1 - IMPLICA INF. ADICIONAL DE LA CUENTA              017800      
001009*            0 - SOLO INF. DE LA CUENTA                           017900      
001010     02  FILLER                          PIC X(42).               018000      
001011*SIZE ENTRADA X(60).                                              018100      
001012  01  S422-04-CTR-SALIDA.                                         018200      
001013     02  S422-04-CTR-REGISTRO.                                    018300      
001014         03  S422-04-CTR-NUMCSI          PIC 9(02) COMP.          018400      
001015         03  S422-04-CTA-NUMPROD         PIC 9(04) COMP.          018500      
001016         03  S422-04-CTA-CVEINST         PIC 9(02) COMP.          018600      
001017         03  S422-04-CTA-NUMSUC          PIC 9(04) COMP.          018700      
001018         03  S422-04-CTO-NUM.                                     018800      
001019             05  S422-04-CTA-NUMPREF     PIC 9(04) COMP.          018900      
001020             05  S422-04-CTA-NUM         PIC 9(12) COMP.          019000      
001021         03  S422-04-CTE-NUM             PIC 9(12) COMP.          019100      
001022         03  S422-04-CTA-DIACORTE        PIC 9(02) COMP.          019200      
001023         03  S422-04-CTA-CVEMONEDA       PIC 9(02) COMP.          019300      
001024         03  S422-04-CTA-CVEENVIO        PIC 9(04) COMP.          019400      
001025         03  S422-04-CTA-EDIEDOCTA       PIC 9(02) COMP.          019500      
001026         03  S422-04-CTA-DISEDOCTA       PIC 9(02) COMP.          019600      
001027         03  S422-04-CTA-CVEMANEJO       PIC 9(02) COMP.          019700      
001028         03  S422-04-CTA-CVENIVRIE       PIC X(01).               019800      
001029         03  S422-04-CTA-CVESTATUS       PIC 9(02) COMP.          019900      
001030         03  S422-04-CTA-CVEUSO          PIC 9(02) COMP.          020000      
001031         03  S422-04-CTR-USOEJECTA       PIC 9(04) COMP.          020100      
001032         03  S422-04-CTR-USOSCTE         PIC 9(04) COMP.          020200      
001033         03  S422-04-CTA-FECAPER-2K      PIC 9(08) COMP.          020300      
001034         03  S422-04-CTA-FECULTMOD-2K    PIC 9(08) COMP.          020400      
001035         03  S422-04-CTA-FECCANCEL-2K    PIC 9(08) COMP.          020500      
001036         03  S422-04-CTA-FECRENOVA-2K    PIC 9(08) COMP.          020600      
001037* INFORMACION ADICIONAL DE LA CUENTA:                             020700      
001038         03  S422-04-CTA-CODAFIL         PIC X(12).               020800      
001039         03  S422-04-CTA-CODFONVIV       PIC X(12).               020900      
001040         03  S422-04-CTA-NUMEMPDEP       PIC 9(06) COMP.          021000      
001041         03  S422-04-CTA-CVEDISENT       PIC 9(02) COMP.          021100      
001042         03  S422-04-CTA-CVEDISSAL       PIC 9(02) COMP.          021200      
001043         03  S422-04-CTA-ADNIVRIE        PIC X(01).               021300      
001044         03  S422-04-CTA-FECUMODRI-2K    PIC 9(08) COMP.          021400      
001045         03  S422-04-CTA-CVEDESCRE       PIC 9(06) COMP.          021500      
001046         03  S422-04-CTA-CVEEMP          PIC X(03).               021600      
001047         03  S422-04-CTA-NUMPAGEMP       PIC X(09).               021700      
001048         03  S422-04-CTE-FECONSTIT-2K    PIC 9(08) COMP.          021800      
001049         03  S422-04-CTE-FEDICJURI-2K    PIC 9(08) COMP.          021900      
001050         03  S422-04-CTE-FEPODER-2K      PIC 9(08) COMP.          022000      
001051         03  S422-04-CTA-NUMCTOSAR       PIC 9(06) COMP.          022100      
001052         03  S422-04-CTA-FECULTIMP-2K    PIC 9(08) COMP.          022200      
001053         03  S422-04-CTR-DATHIPOTE.                               022300      
001054             05 S422-04-CTA-FECFIRMA-2K  PIC 9(08) COMP.          022400      
001055             05 S422-04-CTR-NUMDOMGAR    PIC 9(04) COMP.          022500      
001056             05 S422-04-CTA-CVEVARTAS    PIC 9(02) COMP.          022600      
001057             05 S422-04-CTA-NUMCONVE     PIC 9(04) COMP.          022700      
001058             05 S422-04-CTA-IMPPREST     PIC 9(14)V9(02) COMP.    022800      
001059             05 S422-04-CTA-CVETIPCRE    PIC 9(02) COMP.          022900      
001060             05 S422-04-CTR-NUMENCPTE    PIC 9(14) COMP.          023000      
001061         03  FILLER                      PIC X(37).               023100      
001062* SIZE SALIDA X(180).                                             023200      
001063  77  R422-04-CTR-ERROR                PIC S9(11) BINARY.         023300      
001064************************************************************      023400      
001065**** PARAMETROS PARA EL ENTRY POINT S016_L422_S500_01 (05)**      023500      
001066**** CONSULTA B08MEDIOS, B04CUENTAS, B01CLIENTES          **      023600      
001067****          Y B17INFADICTA CON OPCION = 1               **      023700      
001068************************************************************      023800      
001069  01  E422-05-CTR-ENTRADA.                                        023900      
001070     02 E422-05-CTR-NUMSIST         PIC 9(04) COMP.               024000      
001071     02 E422-05-CTR-NUMPASO         PIC 9(04) COMP.               024100      
001072     02 E422-05-CTA-NUMPROD         PIC 9(04) COMP.               024200      
001073     02 E422-05-CTA-CVEINST         PIC 9(04) COMP.               024300      
001074     02 E422-05-CTO-NUM.                                          024400      
001075        03  E422-05-CTA-NUMPREF     PIC 9(04) COMP.               024500      
001076        03  E422-05-CTA-NUM         PIC 9(12) COMP.               024600      
001077     02 E422-05-OPCION              PIC 9(02) COMP.               024700      
001078     02 E422-05-CTR-NUMCSI          PIC 9(02) COMP.               024800      
001079     02 FILLER                      PIC X(42).                    024900      
001080* SIZE ENTRADA X(60)                                              025000      
001081  01  S422-05-CTR-SALIDA.                                         025100      
001082     02 S422-05-CTR-REGISTRO.                                     025200      
001083* DEL REBISTRO B04 CUENTAS                                        025300      
001084        03 S422-05-CTA-NUMPROD         PIC 9(04) COMP.            025400      
001085        03 S422-05-CTA-CVEINST         PIC 9(04) COMP.            025500      
001086        03 S422-05-CTA-NUMSUC          PIC 9(04) COMP.            025600      
001087* DEL REGISTRO B01 CLIENTES Y B04 CUENTAS CON NOTA.               025700      
001088        03 S422-05-CTE-CVEPERS         PIC 9(02) COMP.            025800      
001089        03 S422-05-CTE-CVESECTOR       PIC 9(02) COMP.            025900      
001090        03 S422-05-CTE-CVETIPO         PIC 9(02) COMP.            026000      
001091        03 S422-05-CTE-CVEACTBNM       PIC 9(06) COMP.            026100      
001092        03 S422-05-CTA-CVEMONEDA       PIC 9(02) COMP.            026200      
001093        03 S422-05-CTE-NOMBRE          PIC X(55).                 026300      
001094        03 S422-05-CTE-CVESOCFUN       PIC 9(02) COMP.            026400      
001095        03 S422-05-CTE-CVEPERBCO       PIC 9(02) COMP.            026500      
001096*                              NOTA DEL B04.                      026600      
001097        03 S422-05-CTE-NUM             PIC 9(12) COMP.            026700      
001098*                              NOTA DEL B04.                      026800      
001099        03 S422-05-CTA-CVESTATUS       PIC 9(02) COMP.            026900      
001100        03 S422-05-CTE-CODRFC.                                    027000      
001101           04 S422-05-CTE-CODINI       PIC X(04).                 027100      
001102           04 S422-05-CTE-FECNAC       PIC 9(06) COMP.            027200      
001103           04 S422-05-CTE-CODHOM       PIC X(05).                 027300      
001104*                              NOTA DEL B04.                      027400      
001105        03 S422-05-CTA-CVEUSO          PIC 9(02) COMP.            027500      
001106*                              NOTA DEL B04.                      027600      
001107        03 S422-05-CTA-CVEMANEJO       PIC 9(02) COMP.            027700      
001108* DEL REGISTRO B17 INFADICTA                                      027800      
001109        03 S422-05-INFADICTA.                                     027900      
001110           04 S422-05-FECONSTIT-2K     PIC 9(08) COMP.            028000      
001111           04 S422-05-FEPODER-2K       PIC 9(08) COMP.            028100      
001112           04 S422-05-FEDICJURI-2K     PIC 9(08) COMP.            028200      
001113* CONTINUA LA INFORMACION DEL B01.                                028300      
001114        03 S422-05-CTR-NUMCSI          PIC 9(02) COMP.            028400      
001115        03 S422-05-CTE-CAEB            PIC 9(06) COMP.            028500      
001116        03 S422-05-CTE-CVESEXO         PIC 9(02) COMP.            028600      
001117     02    FILLER                      PIC X(24).                 028700      
001118* SIZE SALIDA X(132).                                             028800      
001119  77  R422-05-CTR-ERROR                 PIC S9(11) BINARY.        028900      
001120**********************************************************        029000      
001121***PARAMETROS PARA EL ENTRY POINT S016_L422_MEDIOS (06)***        029100      
001122*  CONSULTA B05CTECTA Y B08MEDIOS MULTIPLE (NUM_REG E/S) *        029200      
001123**********************************************************        029300      
001124  01  E422-06-CTR-ENTRADA.                                        029400      
001125     02  E422-06-CTR-NUMCSI          PIC 9(02) COMP.              029500      
001126     02  E422-06-CTR-NUMSIST         PIC 9(04) COMP.              029600      
001127     02  E422-06-CTR-NUMPASO         PIC 9(04) COMP.              029700      
001128     02  E422-06-CTR-LLAVE.                                       029800      
001129         03 E422-06-CTA-NUMPROD      PIC 9(04) COMP.              029900      
001130         03 E422-06-CTA-CVEINST      PIC 9(04) COMP.              030000      
001131         03 E422-06-CTO-NUM.                                      030100      
001132            05 E422-06-CTA-NUMPREF   PIC 9(04) COMP.              030200      
001133            05 E422-06-CTA-NUM       PIC 9(12) COMP.              030300      
001134         03 E422-06-MDA-CVETIPO      PIC 9(02) COMP.              030400      
001135         03 E422-06-MDA-CTONUM.                                   030500      
001136            05 E422-06-MDA-NUMPREF   PIC 9(04) COMP.              030600      
001137            05 E422-06-MDA-NUM       PIC 9(12) COMP.              030700      
001138     02  E422-06-CTR-NUMREG          PIC 9(02) COMP.              030800      
001139     02  E422-06-CTE-NUM             PIC 9(12) COMP.              030900      
001140     02  FILLER                      PIC X(27).                   031000      
001141* SIZE ENTRADA (60).                                              031100      
001142  01 S422-06-CTR-SALIDA.                                          031200      
001143    02 S422-06-CTR-NUMREG           PIC 9(02) COMP.               031300      
001144******                                                            031400      
001145    02 S422-06-CTR-REGISTRO OCCURS 5 TIMES.                       031500      
001146       03 S422-06-CTE-NUM                 PIC 9(12) COMP.         031600      
001147       03 S422-06-CTA-NUMPROD             PIC 9(04) COMP.         031700      
001148       03 S422-06-CTA-CVEINST             PIC 9(04) COMP.         031800      
001149       03 S422-06-CTA-NUMCTO.                                     031900      
001150          05 S422-06-CTA-NUMPREF          PIC 9(04) COMP.         032000      
001151          05 S422-06-CTA-NUM              PIC 9(12) COMP.         032100      
001152       03 S422-06-MDA-CVETIPO             PIC 9(02) COMP.         032200      
001153       03 S422-06-MDA-SUBTIPO             PIC 9(02) COMP.         032300      
001154       03 S422-06-MDA-CVETIT              PIC 9(02) COMP.         032400      
001155       03 S422-06-MDA-NUMCTO.                                     032500      
001156          05 S422-06-MDA-NUMPREF          PIC 9(04) COMP.         032600      
001157          05 S422-06-MDA-NUM              PIC 9(12) COMP.         032700      
001158       03 S422-06-MDA-ABRPROFT            PIC X(03).              032800      
001159       03 S422-06-CTR-PTRNOMT             PIC 9(04) COMP.         032900      
001160       03 S422-06-MDA-ABRPROFC            PIC X(03).              033000      
001161       03 S422-06-CTR-PTRNOMC             PIC 9(04) COMP.         033100      
001162       03 S422-06-MDA-NUMTALON            PIC 9(02) COMP.         033200      
001163       03 S422-06-MDA-CHQXTALON           PIC 9(02) COMP.         033300      
001164       03 S422-06-MDA-CVESTATUS           PIC 9(02) COMP.         033400      
001165       03 S422-06-MDA-FECALTA-2K          PIC 9(08) COMP.         033500      
001166       03 S422-06-MDA-FECULTMOD-2K        PIC 9(08) COMP.         033600      
001167       03 S422-06-MDA-FECVENC-2K          PIC 9(08) COMP.         033700      
001168       03 S422-06-MDA-FECCANCEL-2K        PIC 9(08) COMP.         033800      
001169       03 S422-06-MDA-FECPREV             PIC 9(06) COMP.         033900      
001170       03 S422-06-MDA-HHPREV              PIC 9(04) COMP.         034000      
001171       03 FILLER                          PIC X(21).              034100      
001172*      SIZE reg OCCURS X(84)                                      034200      
001173*  SIZE SALIDA = 1+(84*5) = 421                                   034300      
001174  01  S422-06-RCTR-SALIDA REDEFINES S422-06-CTR-SALIDA.           034400      
001175     03 S422-06-CTR-ERROR                 PIC 9(004) COMP.        034500      
001176     03 S422-06-CTR-ERRORTYPE             PIC 9(004) COMP.        034600      
001177     03 S422-06-CTR-STRUCTURE             PIC 9(004) COMP.        034700      
001178     03 FILLER                            PIC X(415).             034800      
001179 77  R422-06-CTR-ERROR                    PIC S9(11) BINARY.      034900      
001180********************************************************          035000      
001181*  PARAMETROS               S016_L422_CTASREL (07)   ***          035100      
001182*  CONSULTA B07CTACTA, MULTIPLE (NUMREG E/S)         ***          035200      
001183********************************************************          035300      
001184*77 WKS-NUMREG-07                   PIC 9(02) COMP.               035400      
001185*                                   VALUE 20.                     035500      
001186* El value depende de los registros deseados, ejemplo se usa 20.  035600      
001187 01 E422-07-CTR-ENTRADA.                                          035700      
001188    02 E422-07-CTR-NUMCSI           PIC 9(02) COMP.               035800      
001189    02 E422-07-CTR-NUMSIST          PIC 9(04) COMP.               035900      
001190    02 E422-07-CTR-NUMPASO          PIC 9(04) COMP.               036000      
001191    02 E422-07-CTE-NUM              PIC 9(12) COMP.               036100      
001192    02 E422-07-CTA-NUMPROD          PIC 9(04) COMP.               036200      
001193    02 E422-07-CTA-CVEINST          PIC 9(04) COMP.               036300      
001194    02 E422-07-CTO-NUM.                                           036400      
001195          05 E422-07-CTA-NUMPREF    PIC 9(04) COMP.               036500      
001196          05 E422-07-CTA-NUM        PIC 9(12) COMP.               036600      
001197    02 E422-07-CTA-NUMPRODREL       PIC 9(04) COMP.               036700      
001198    02 E422-07-CTA-CVEINSTREL       PIC 9(04) COMP.               036800      
001199    02 E422-O7-CTA-CTONUMREL.                                     036900      
001200          05 E422-07-CTA-NUMPREFREL PIC 9(04) COMP.               037000      
001201          05 E422-07-CTA-NUMREL     PIC 9(12) COMP.               037100      
001202    02 E422-07-CTR-CVERELCTA        PIC 9(02) COMP.               037200      
001203    02 E422-07-CTR-NUMREG           PIC 9(02) COMP.               037300      
001204    02 FILLER                       PIC X(18).                    037400      
001205** SIZE ENTRADA X(60)                                             037500      
001206  01 S422-07-CTR-SALIDA.                                          037600      
001207    02 S422-07-CTR-NUMREG           PIC 9(02) COMP.               037700      
001208    02 S422-07-CTR-REGISTRO  OCCURS 50 TIMES.                     037800      
001209*                              DEPENDING ON WKS-NUMREG-07.        037900      
001210       03 S422-07-CTR-NUMCSI        PIC 9(02) COMP.               038000      
001211       03 S422-07-CTE-NUM           PIC 9(12) COMP.               038100      
001212       03 S422-07-CTA-NUMPROD       PIC 9(04) COMP.               038200      
001213       03 S422-07-CTA-CVEINST       PIC 9(02) COMP.               038300      
001214       03 S422-07-CTO-NUM.                                        038400      
001215          05 S422-07-CTA-NUMPREF    PIC 9(04) COMP.               038500      
001216          05 S422-07-CTA-NUM        PIC 9(12) COMP.               038600      
001217       03 S422-07-CTR-CVERELCTA     PIC 9(02) COMP.               038700      
001218       03 S422-07-CTA-NUMPRODREL    PIC 9(04) COMP.               038800      
001219       03 S422-07-CTA-CVEINSTREL    PIC 9(02) COMP.               038900      
001220       03 S422-07-CTA-CTONUMREL.                                  039000      
001221          05 S422-07-CTA-NUMPREFREL PIC 9(04) COMP.               039100      
001222          05 S422-07-CTA-NUMREL     PIC 9(12) COMP.               039200      
001223       03 S422-07-CTA-FECALTA-2K    PIC 9(08) COMP.               039300      
001224       03 S422-07-CTA-FECULTMOD-2K  PIC 9(08) COMP.               039400      
001225       03 FILLER                    PIC X(34).                    039500      
001226*      size reg OCCURS X(72)                                      039600      
001227*      SIZE SALIDA = 1+(72*50) = 3601                             039700      
001228*                                                                 039800      
001229       77  R422-07-CTR-ERROR               PIC S9(11) BINARY.     039900      
001230*                                                                 040000      
001231******************************************************            040100      
001232**  PARAMETROS PARA ENTRY POINT S016_L422_SERV (08)  *            040200      
001233**  CONSULTA B09BCALEC                               *            040300      
001234******************************************************            040400      
001235 01  E422-08-CTR-ENTRADA.                                         040500      
001236     02  E422-08-CTR-NUMCSI              PIC 9(02) COMP.          040600      
001237*            NUMERO DEL CSI DEL QUE SE DESEA LA INFORMACION       040700      
001238*            0  = INFORMACION LOCAL                               040800      
001239*            99 = INFORMACION NACIONAL (SOLO EN VDM)              040900      
001240*            NN = INF. DEL CSI NN                                 041000      
001241     02  E422-08-CTR-NUMSIST             PIC 9(04) COMP.          041100      
001242*            NUMERO DEL SISTEMA LLAMADOR                          041200      
001243     02  E422-08-CTR-NUMPASO             PIC 9(04) COMP.          041300      
001244*            NUMERO DEL PASO LLAMADOR                             041400      
001245     02  E422-08-CTR-CLAVE.                                       041500      
001246         03  E422-08-SER-NUM             PIC 9(04) COMP.          041600      
001247*            NUMERO DEL SERVICIO A CONSULTAR                      041700      
001248         03  E422-08-SER-CVETIPO         PIC 9(02) COMP.          041800      
001249*            NUMERO DE INSTRUMENTO (CLAVE)                        041900      
001250         03  E422-08-CTE-NUM             PIC 9(12) COMP.          042000      
001251*            NUMERO DEL CLIENTE DEL QUE SE DESEA INFORMACION.     042100      
001252     02  FILLER                          PIC X(46).               042200      
001253* SIZE ENTRADA X(60).                                             042300      
001254*                                                                 042400      
001255 01  S422-08-CTR-SALIDA.                                          042500      
001256     02  S422-08-CTR-REGISTRO.                                    042600      
001257         03  S422-08-CTR-NUMCSI          PIC 9(02) COMP.          042700      
001258         03  S422-08-CTE-NUM             PIC 9(12) COMP.          042800      
001259         03  S422-08-SER-NUM             PIC 9(04) COMP.          042900      
001260         03  S422-08-SER-CVETIPO         PIC 9(02) COMP.          043000      
001261         03  S422-08-SER-CVEDISP         PIC 9(04) COMP.          043100      
001262         03  S422-08-SER-NOMESTA         PIC X(08).               043200      
001263         03  S422-08-SER-NUMSUCPRO       PIC 9(04) COMP.          043300      
001264         03  S422-08-SER-NUMCTAPRI.                               043400      
001265             05  S422-08-CTA-NUMPROD     PIC 9(04) COMP.          043500      
001266             05  S422-08-CTA-CVEINST     PIC 9(02) COMP.          043600      
001267             05  S422-08-CTA-NUMPREF     PIC 9(04) COMP.          043700      
001268             05  S422-08-CTA-NUM         PIC 9(12) COMP.          043800      
001269         03  S422-08-SER-COBCOM OCCURS 6 TIMES.                   043900      
001270             05  S422-08-COMISION        PIC 9(02) COMP.          044000      
001271         03  S422-08-SER-VERSOFT         PIC 9(04) COMP.          044100      
001272         03  S422-08-SER-PROPEQUIP       PIC 9(02) COMP.          044200      
001273         03  S422-08-CTE-PIN             PIC 9(04) COMP.          044300      
001274         03  S422-08-CTE-PINVER          PIC 9(02) COMP.          044400      
001275         03  S422-08-CTE-CVENOPIN        PIC 9(02) COMP.          044500      
001276         03  S422-08-SER-CVESTATUS       PIC 9(02) COMP.          044600      
001277         03  S422-08-CTR-CVEENVIO        PIC 9(04) COMP.          044700      
001278         03  S422-08-SER-DIACORTE        PIC 9(02) COMP.          044800      
001279         03  S422-08-SER-EDIEDOCTA       PIC 9(02) COMP.          044900      
001280         03  S422-08-SER-DISEDOCTA       PIC 9(02) COMP.          045000      
001281         03  S422-08-SER-FECONTRAT-2K    PIC 9(08) COMP.          045100      
001282         03  S422-08-SER-FECRENOVA-2K    PIC 9(08) COMP.          045200      
001283         03  S422-08-SER-FECCANCEL-2K    PIC 9(08) COMP.          045300      
001284         03  S422-08-SER-FECULTMOD-2K    PIC 9(08) COMP.          045400      
001285         03  S422-08-SER-FECMODPIN-2K    PIC 9(08) COMP.          045500      
001286         03  S422-08-SER-FECULTMOV-2K    PIC 9(08) COMP.          045600      
001287         03  FILLER                      PIC X(26).               045700      
001288* SIZE SALIDA X(102).                                             045800      
001289*                                                                 045900      
001290 77  R422-08-CTR-ERROR                   PIC S9(11) BINARY.       046000      
001291*************************************************************     046100      
001292*          PARAMETROS  S016_L422_CTESGRAL_B16 (09)         **     046200      
001293** CONSULTA B01CLIENTES y B16INFADICTE                     **     046300      
001294*************************************************************     046400      
001295 01  E422-09-CTR-ENTRADA.                                         046500      
001296     02  E422-09-CTR-NUMSIST           PIC 9(04) COMP.            046600      
001297     02  E422-09-CTR-NUMPASO           PIC 9(04) COMP.            046700      
001298     02  E422-09-CTA-NUMPROD           PIC 9(04) COMP.            046800      
001299     02  E422-09-CTA-CVEINST           PIC 9(04) COMP.            046900      
001300     02  E422-09-CTO-NUM.                                         047000      
001301         03  E422-09-CTA-NUMPREF       PIC 9(04) COMP.            047100      
001302         03  E422-09-CTA-NUM           PIC 9(12) COMP.            047200      
001303     02  E422-09-CTE-NUM               PIC 9(12) COMP.            047300      
001304     02  E422-09-CTR-NUMCSI            PIC 9(02) COMP.            047400      
001305     02  FILLER                        PIC X(37).                 047500      
001306*SIZE ENTRADA X(60).                                              047600      
001307*                                                                 047700      
001308  01 S422-09-CTR-SALIDA.                                          047800      
001309     02 S422-09-CTR-REGISTRO.                                     047900      
001310       03 S422-09-CTE-NUMCSI            PIC 9(02) COMP.           048000      
001311       03 S422-09-CTE-NUM               PIC 9(12) COMP.           048100      
001312       03 S422-09-CTE-INDAFIL           PIC 9(02) COMP.           048200      
001313       03 S422-09-CTA-NUMEMPDEP         PIC 9(06) COMP.           048300      
001314       03 S422-09-CTE-CVEFUENTE         PIC 9(02) COMP.           048400      
001315       03 S422-09-CTE-CVEPOTECO         PIC 9(02) COMP.           048500      
001316       03 S422-09-CTE-CVEINGRES         PIC 9(02) COMP.           048600      
001317       03 S422-09-CTE-CVEARRAIG         PIC 9(02) COMP.           048700      
001318       03 S422-09-CTE-CVEBCO1           PIC 9(02) COMP.           048800      
001319       03 S422-09-CTE-NUMPRDBCO1        PIC 9(04) COMP.           048900      
001320       03 S422-09-CTE-SDOPRDBCO1        PIC 9(16) COMP.           049000      
001321       03 S422-09-CTE-CVEBCO2           PIC 9(02) COMP.           049100      
001322       03 S422-09-CTE-NUMPRDBCO2        PIC 9(04) COMP.           049200      
001323       03 S422-09-CTE-SDOPRDBCO2        PIC 9(16) COMP.           049300      
001324       03 S422-09-CTE-CVEB03            PIC 9(02) COMP.           049400      
001325       03 S422-09-CTE-NUMPRDBCO3        PIC 9(04) COMP.           049500      
001326       03 S422-09-CTE-SDOPRDBCO3        PIC 9(16) COMP.           049600      
001327       03 S422-09-CTR-FECULTVIS-2K      PIC 9(08) COMP.           049700      
001328       03 S422-09-CTE-EDOCIVIL          PIC 9(02) COMP.           049800      
001329       03 S422-09-CTE-INGRESOS          PIC 9(08) COMP.           049900      
001330       03 S422-09-CTR-FEACIN-2K         PIC 9(08) COMP.           050000      
001331       03 S422-09-CTE-NUMDEPEND         PIC 9(02) COMP.           050100      
001332       03 S422-09-CTE-STACASA           PIC 9(02) COMP.           050200      
001333       03 S422-09-CTE-NUMAUTOS          PIC 9(02) COMP.           050300      
001334       03 S422-09-CTE-ESCOLAR           PIC 9(02) COMP.           050400      
001335       03 S422-09-CTE-FEULMO-2K         PIC 9(08) COMP.           050500      
001336       03 FILLER                        PIC X(33).                050600      
001337*SIZE SALIDA X(102).                                              050700      
001338*                                                                 050800      
001339**                                                                050900      
001340 01  S422-09-RCTR-SALIDA REDEFINES S422-09-CTR-SALIDA.            051000      
001341     03 S422-09-CTR-ERROR                 PIC 9(004) COMP.        051100      
001342     03 S422-09-CTR-ERRORTYPE             PIC 9(004) COMP.        051200      
001343     03 S422-09-CTR-STRUCTURE             PIC 9(004) COMP.        051300      
001344     03 FILLER                            PIC X(96).              051400      
001345 77  R422-09-CTR-ERROR                    PIC S9(11) BINARY.      051500      
001346*                                                                 051600      
001347**********************************************************        051700      
001348*  PARAMETROS        S016_L422_CTASGRAL_B17 (10)        **        051800      
001349*  CONSULTA B01CLIENTES y B17INFADICTA                  **        051900      
001350**********************************************************        052000      
001351 01  E422-10-CTR-ENTRADA.                                         052100      
001352     02  E422-10-CTR-NUMSIST           PIC 9(04) COMP.            052200      
001353     02  E422-10-CTR-NUMPASO           PIC 9(04) COMP.            052300      
001354     02  E422-10-CTA-NUMPROD           PIC 9(04) COMP.            052400      
001355     02  E422-10-CTA-CVEINST           PIC 9(04) COMP.            052500      
001356     02  E422-10-CTO-NUM.                                         052600      
001357         03  E422-10-CTA-NUMPREF       PIC 9(04) COMP.            052700      
001358         03  E422-10-CTA-NUM           PIC 9(12) COMP.            052800      
001359     02  E422-10-CTE-NUM               PIC 9(12) COMP.            052900      
001360     02  FILLER                        PIC X(01).                 053000      
001361     02  E422-10-CTR-NUMCSI            PIC 9(02) COMP.            053100      
001362     02  E422-10-CTA-NUMCSI            PIC 9(02) COMP.            053200      
001363     02  FILLER                        PIC X(35).                 053300      
001364*SIZE ENTRADA X(60).                                              053400      
001365*                                                                 053500      
001366  01 S422-10-CTR-SALIDA.                                          053600      
001367     02 S422-10-CTR-REGISTRO.                                     053700      
001368       03 S422-10-CTR-NUMCSI            PIC 9(02) COMP.           053800      
001369       03 S422-10-CTE-NUM               PIC 9(12) COMP.           053900      
001370       03 S422-10-CTA-NUMPROD           PIC 9(04) COMP.           054000      
001371       03 S422-10-CTA-CVEINST           PIC 9(04) COMP.           054100      
001372       03 S422-10-CTA-NUMPREF           PIC 9(04) COMP.           054200      
001373       03 S422-10-CTA-NUM               PIC 9(12) COMP.           054300      
001374       03 S422-10-CTA-CODAFIL           PIC X(12).                054400      
001375       03 S422-10-CTA-CODFONVIV         PIC X(12).                054500      
001376       03 S422-10-CTA-NUMEMPDEP         PIC 9(06) COMP.           054600      
001377       03 S422-10-CTA-CVEDISENT         PIC 9(02) COMP.           054700      
001378       03 S422-10-CTA-CVEDISSAL         PIC 9(02) COMP.           054800      
001379       03 S422-10-CTA-CVENIVRIE         PIC X(01).                054900      
001380       03 S422-10-CTA-FECUMODRI-2K      PIC 9(08) COMP.           055000      
001381       03 S422-10-CTA-CVEDESCRE         PIC 9(06) COMP.           055100      
001382       03 S422-10-CTA-CVEEMP            PIC X(03).                055200      
001383       03 S422-10-CTA-NUMPAGEMP         PIC X(09).                055300      
001384       03 S422-10-CTA-NUMCTOSAR         PIC 9(06) COMP.           055400      
001385       03 S422-10-CTA-FECULTIMP-2K      PIC 9(08) COMP.           055500      
001386       03 S422-10-CTA-FECFIRMA-2K       PIC 9(08) COMP.           055600      
001387       03 S422-10-CTA-NUMDOMGAR         PIC 9(04) COMP.           055700      
001388       03 S422-10-CTA-CVEVARTAS         PIC 9(02) COMP.           055800      
001389       03 S422-10-CTA-NUMCONVE          PIC 9(04) COMP.           055900      
001390       03 S422-10-CTA-IMPPREST          PIC 9(12)V9(02) COMP.     056000      
001391       03 S422-10-CTA-CVETIPCRE         PIC 9(02) COMP.           056100      
001392       03 S422-10-CTR-NUMENCPTE         PIC 9(14) COMP.           056200      
001393       03 S422-10-CTA-FECULMOM-2K       PIC 9(08) COMP.           056300      
001394       03 FILLER                        PIC X(77).                056400      
001395* SIZE SALIDA X(180).                                             056500      
001396 77  R422-10-CTR-ERROR                  PIC S9(11) BINARY.        056600      
001397*                                                                 056700      
001398************************************************************      056800      
001399*   PARAMETROS PARA ENTRY POINT S016_L422_NOMB (11)      ***      056900      
001400*   CONSULTA  B03NOMBRES                                 ***      057000      
001401************************************************************      057100      
001402 01  E422-11-CTR-ENTRADA.                                         057200      
001403     02  E422-11-CTR-NUMCSI              PIC 9(02) COMP.          057300      
001404*            NUMERO DEL CSI DEL QUE SE DESEA LA INFORMACION       057400      
001405*            0  = INFORMACION LOCAL                               057500      
001406*            99 = INFORMACION NACIONAL (SOLO EN VDM)              057600      
001407*            NN = INF. DEL CSI NN                                 057700      
001408     02  E422-11-CTR-NUMSIST             PIC 9(04) COMP.          057800      
001409*            NUMERO DEL SISTEMA LLAMADOR                          057900      
001410     02  E422-11-CTR-NUMPASO             PIC 9(04) COMP.          058000      
001411*            NUMERO DEL PASO LLAMADOR                             058100      
001412     02  E422-11-CTR-CLAVE.                                       058200      
001413         03  E422-11-CTE-NUM             PIC 9(12) COMP.          058300      
001414*            NUMERO DEL CLIENTE  A CONSULTAR                      058400      
001415         03  E422-11-CTR-NUMNOM          PIC 9(04) COMP.          058500      
001416*            NUMERO DE NOMBRE ADICIONAL                           058600      
001417         03  E422-11-CTE-CVETITCTE       PIC 9(02) COMP.          058700      
001418*            NUMERO DE RELACION CON EL CLIENTE                    058800      
001419*            13   REPRESENTANTE LEGAL                             058900      
001420*            14   REPRESENTANTE ADMINISTRATIVO                    059000      
001421         03  FILLER                      PIC X(46).               059100      
001422*SIZE ENTRADA X(60).                                              059200      
001423*                                                                 059300      
001424  01  S422-11-CTR-SALIDA.                                         059400      
001425     02  S422-11-CTR-REGISTRO.                                    059500      
001426         03  S422-11-CTR-NUMCSI          PIC 9(02) COMP.          059600      
001427         03  S422-11-CTE-NUM             PIC 9(12) COMP.          059700      
001428         03  S422-11-CTR-NUMNOM          PIC 9(04) COMP.          059800      
001429         03  S422-11-CTR-NOMUSOS         PIC 9(04) COMP.          059900      
001430         03  S422-11-CTE-NOMCORTO        PIC X(26).               060000      
001431         03  S422-11-CTE-CVETITCTE       PIC 9(02) COMP.          060100      
001432         03  S422-11-CTR-CVECONT         PIC 9(02) COMP.          060200      
001433         03  S422-11-CTR-FECALTNOM-2K    PIC 9(08) COMP.          060300      
001434         03  S422-11-CTR-FECMODNOM-2K    PIC 9(08) COMP.          060400      
001435         03  FILLER                      PIC X(25).               060500      
001436* SIZE SALIDA X(72)                                               060600      
001437*                                                                 060700      
001438 77  R422-11-CTR-ERROR                   PIC S9(11) BINARY.       060800      
001439*                                                                 060900      
001440*******************************************************           061000      
001441****    PARAMETROS    S016_L422_REPCTE (12)        ****           061100      
001442******  CONSULTA  B10REPCTE  COMPLETO (NUMREG E/S)  ***           061200      
001443*******************************************************           061300      
001444*  77 WKS-NUMREG-12                  PIC 9(02) COMP.              061400      
001445*                                     VALUE NN.                   061500      
001446   01 E422-12-CTR-ENTRADA.                                        061600      
001447      02 E422-12-CTR-NUMCSI          PIC 9(02) COMP.              061700      
001448* N³mero de CSI del que se desea la inf.                          061800      
001449      02 E422-12-CTR-NUMSIST         PIC 9(04) COMP.              061900      
001450* N³mero del sistema llamador.                                    062000      
001451      02 E422-12-CTR-NUMPASO         PIC 9(04) COMP.              062100      
001452* N³mero del programa llamador                                    062200      
001453      02 E422-12-CTE-NUM             PIC 9(12) COMP.              062300      
001454*N³mero de CLIENTE la informaciÿn, es obligatorio.                062400      
001455      02 E422-12-CTE-REPPIN          PIC X(06).                   062500      
001456*Clave secreta del representante si no se conoce dejar en blancos.062600      
001457      02 E422-12-CTR-NUMREG           PIC 9(02) COMP.             062700      
001458*N³mero de registros Solicitados                                  062800      
001459      02 FILLER                       PIC X(42).                  062900      
001460* SIZE ENTRADA X(60).                                             063000      
001461*                                                                 063100      
00146201  S422-12-CTR-SALIDA.                                           063200      
001463      02 S422-12-CTR-NUMREG         PIC 9(02) COMP.               063300      
001464      02 S422-12-CTR-REGISTRO  OCCURS 5 TIMES.                    063400      
001465*       02 S422-12-CTR-REGISTRO  OCCURS 1 TO 5 TIMES              063500      
001466*                           DEPENDING ON WKS-NUMREG-12.           063600      
001467           03 S422-12-CTR-NUMCSI          PIC 9(02) COMP.         063700      
001468* N³mero de CSI.                                                  063800      
001469           03 S422-12-CTE-NUM             PIC 9(12) COMP.         063900      
001470*N³mero de CLIENTE                                                064000      
001471           03 S422-12-CTE-REPPIN          PIC X(06).              064100      
001472*Clave secreta del representante                                  064200      
001473           03 S422-12-CTE-REPNOMB         PIC X(36).              064300      
001474*Nombre del representante                                         064400      
001475           03 S422-12-CTE-REPLIMITE       PIC 9(14) COMP.         064500      
001476*Limite para los movimientos                                      064600      
001477           03 S422-12-CTE-REPPRIVIL       PIC 9(02) COMP.         064700      
001478*Privilegio del representante                                     064800      
001479           03 S422-12-CTR-REPFEALTA       PIC 9(06) COMP.         064900      
001480*Fecha de alta del representante  AAMMDD                          065000      
001481           03 S422-12-CTR-REPFEMOD        PIC 9(06) COMP.         065100      
001482*Fecha de modificacion  AAMMDD                                    065200      
001483           03 S422-12-CTR-FEALRE-2K       PIC 9(08) COMP.         065300      
001484*Fecha de alta del representante  AAAAMMDD                        065400      
001485           03 S422-12-CTR-FEMORE-2K       PIC 9(08) COMP.         065500      
001486*Fecha de modificacion  AAAAMMDD                                  065600      
001487           03  FILLER                      PIC X(12).             065700      
001488*SIZE SALIDA X(84)                                                065800      
001489*                                                                 065900      
001490*                                                                 066000      
001491      77 R422-12-CTR-ERROR       PIC S9(11) BINARY.               066100      
001492*                                                                 066200      
001493************************************************************      066300      
001494****    PARAMETROS    S016_L422_S500_02 (15)            ****      066400      
001495**** CONSULTA B08MEDIOS, B04CUENTAS, B01CLIENTES          **      066500      
001496****          Y B17INFADICTA CON OPCION = 1               **      066600      
001497************************************************************      066700      
001498 01  E422-15-CTR-ENTRADA.                                         066800      
001499     02  E422-15-CTR-NUMSIST         PIC 9(04) COMP.              066900      
001500     02  E422-15-CTR-NUMPASO         PIC 9(04) COMP.              067000      
001501     02  E422-15-CTA-NUMPROD         PIC 9(04) COMP.              067100      
001502     02  E422-15-CTA-CVEINST         PIC 9(04) COMP.              067200      
001503     02  E422-15-CTO-NUM.                                         067300      
001504         03  E422-15-CTA-NUMPREF     PIC 9(04) COMP.              067400      
001505         03  E422-15-CTA-NUM         PIC 9(12) COMP.              067500      
001506     02  E422-15-OPCION              PIC 9(02) COMP.              067600      
001507     02  E422-15-CTR-NUMCSI          PIC 9(02) COMP.              067700      
001508     02  FILLER                      PIC X(42).                   067800      
001509* SIZE ENTRADA X(60).                                             067900      
001510 01  S422-15-CTR-SALIDA.                                          068000      
001511     02 S422-15-CTR-REGISTRO.                                     068100      
001512        03 S422-15-CTA-NUMPROD         PIC 9(04) COMP.            068200      
001513        03 S422-15-CTA-CVEINST         PIC 9(04) COMP.            068300      
001514        03 S422-15-CTA-NUMSUC          PIC 9(04) COMP.            068400      
001515        03 S422-15-CTE-CVEPERS         PIC 9(02) COMP.            068500      
001516        03 S422-15-CTE-CVESECTOR       PIC 9(02) COMP.            068600      
001517        03 S422-15-CTE-CVETIPO         PIC 9(02) COMP.            068700      
001518        03 S422-15-CTE-ACTBNM          PIC 9(06) COMP.            068800      
001519        03 S422-15-CTA-CVEMON          PIC 9(02) COMP.            068900      
001520        03 S422-15-CTE-NOMBRE          PIC X(55).                 069000      
001521        03 S422-15-CTE-CVESOCFUN       PIC 9(02) COMP.            069100      
001522        03 S422-15-CTE-CVEPERBCO       PIC 9(02) COMP.            069200      
001523        03 S422-15-CTE-NUM             PIC 9(12) COMP.            069300      
001524        03 S422-15-CTA-CVESTATUS       PIC 9(02) COMP.            069400      
001525        03 S422-15-CTE-CODRFC.                                    069500      
001526           04 S422-15-CTE-CODINI       PIC X(04).                 069600      
001527           04 S422-15-CTE-FECNAC       PIC 9(06) COMP.            069700      
001528           04 S422-15-CTE-CODHOM       PIC X(05).                 069800      
001529        03 S422-15-CTA-CVEUSO          PIC 9(02) COMP.            069900      
001530        03 S422-15-CTA-CVEMANEJO       PIC 9(02) COMP.            070000      
001531* INFORMACION ADICIONAL DE LA CUENTA                              070100      
001532        03 S422-15-INFADICTA.                                     070200      
001533           04 S422-15-FECONSTIT-2K     PIC 9(08) COMP.            070300      
001534           04 S422-15-FEPODER-2K       PIC 9(08) COMP.            070400      
001535           04 S422-15-FEDICJURI-2K     PIC 9(08) COMP.            070500      
001536* LA INFORMACION ADICIONAL DE LA CUENTA SE ENTREGARA SOLO         070600      
001537*  CUANDO EL PARAMETRO DE ENTRADA E422-15-OPCION = 1              070700      
001538* VER MANUAL DE OPERACI¿N.                                        070800      
001539        03 S422-15-CTR-NUMCSI          PIC 9(02) COMP.            070900      
001540        03 S422-15-CTA-DIACORTE        PIC 9(02) COMP.            071000      
001541        03 S422-15-CTA-CVEENVIO        PIC 9(04) COMP.            071100      
001542        03 S422-15-CTA-EDIEDOCTA       PIC 9(02) COMP.            071200      
001543        03 S422-15-CTA-DISEDOCTA       PIC 9(02) COMP.            071300      
001544        03 S422-15-CTA-CVENIVRIE       PIC X(01).                 071400      
001545        03 S422-15-CTR-USOEJECTA       PIC 9(04) COMP.            071500      
001546        03 S422-15-CTR-USOSCTE         PIC 9(04) COMP.            071600      
001547        03 S422-15-CTA-VENDNOMI        PIC 9(10) COMP.            071700      
001548        03 S422-15-CTA-VENDSUC         PIC 9(04) COMP.            071800      
001549        03 S422-15-CTA-REFENOMI        PIC 9(10) COMP.            071900      
001550        03 S422-15-CTA-REFECVE         PIC 9(02) COMP.            072000      
001551        03 S422-15-CTA-PREVNOMI        PIC 9(10) COMP.            072100      
001552        03 S422-15-CTA-PREVSUC         PIC 9(04) COMP.            072200      
001553        03 S422-15-CTA-PREVIMP         PIC 9(14) COMP.            072300      
001554        03 S422-15-CTA-RESTRIC         PIC 9(02) COMP.            072400      
001555        03 S422-15-CTA-RESTCON         PIC 9(02) COMP.            072500      
001556        03 S422-15-CTA-OPCPAGO         PIC 9(02) COMP.            072600      
001557        03 S422-15-CTA-RGOPAGO         PIC 9(02) COMP.            072700      
001558        03 S422-15-CTA-RETIMP          PIC 9(02) COMP.            072800      
001559        03 S422-15-CTA-FECPREV         PIC 9(06) COMP.            072900      
001560        03 S422-15-CTA-FECAPER-2K      PIC 9(08) COMP.            073000      
001561        03 S422-15-CTA-FECULTMOD-2K    PIC 9(08) COMP.            073100      
001562        03 S422-15-CTA-FECCANCEL-2K    PIC 9(08) COMP.            073200      
001563        03 S422-15-CTA-FECRENOVA-2K    PIC 9(08) COMP.            073300      
001564        03 S422-15-CTA-SITUACION       PIC X(04).                 073400      
001565*  CONTRATO                                                       073500      
001566        03 S422-15-CTA-NUMPREF         PIC 9(04) COMP.            073600      
001567        03 S422-15-CTA-NUM             PIC 9(12) COMP.            073700      
001568*  MEDIO DE ACCESO                                                073800      
001569        03 S422-15-MDA-CTENUM          PIC 9(12) COMP.            073900      
001570        03 S422-15-MDA-CVETIPO         PIC 9(02) COMP.            074000      
001571        03 S422-15-MDA-SUBTIPO         PIC 9(02) COMP.            074100      
001572        03 S422-15-MDA-CVETIT          PIC 9(02) COMP.            074200      
001573        03 S422-15-MDA-NUMPREF         PIC 9(04) COMP.            074300      
001574        03 S422-15-MDA-NUM             PIC 9(12) COMP.            074400      
001575        03 S422-15-MDA-ABRPROFT        PIC X(03).                 074500      
001576        03 S422-15-MDA-PTRNOMT         PIC 9(04) COMP.            074600      
001577        03 S422-15-MDA-ABRPROFC        PIC X(03).                 074700      
001578        03 S422-15-MDA-PTRNOMC         PIC 9(04) COMP.            074800      
001579        03 S422-15-MDA-NUMTALON        PIC 9(02) COMP.            074900      
001580        03 S422-15-MDA-CHQXTALON       PIC 9(02) COMP.            075000      
001581        03 S422-15-MDA-CVESTATUS       PIC 9(02) COMP.            075100      
001582        03 S422-15-MDA-FECALTA-2K      PIC 9(08) COMP.            075200      
001583        03 S422-15-MDA-FECULTMOD-2K    PIC 9(08) COMP.            075300      
001584        03 S422-15-MDA-FECULTACC-2K    PIC 9(08) COMP.            075400      
001585        03 S422-15-MDA-FECVENC-2K      PIC 9(08) COMP.            075500      
001586        03 S422-15-MDA-FECCANCEL-2K    PIC 9(08) COMP.            075600      
001587        03 S422-15-MDA-FECPREV         PIC 9(06) COMP.            075700      
001588        03 S422-15-MDA-HHPREV          PIC 9(04) COMP.            075800      
001589        03 S422-15-MDA-HHALTA          PIC 9(04) COMP.            075900      
001590        03 S422-15-MDA-HHULTMOD        PIC 9(04) COMP.            076000      
001591        03 S422-15-MDA-HHULTACC        PIC 9(04) COMP.            076100      
001592        03 S422-15-MDA-HHVENC          PIC 9(04) COMP.            076200      
001593        03 S422-15-MDA-PERIODO         PIC 9(02) COMP.            076300      
001594        03 S422-15-MDA-SITUACION       PIC X(04).                 076400      
001595* CAMPO DEL CLIENTE                                               076500      
001596        03 S422-15-CTE-CAEB            PIC 9(06) COMP.            076600      
001597        03 S422-15-CTE-CVESEXO         PIC 9(02) COMP.            076700      
001598        03 FILLER                      PIC X(33).                 076800      
001599*               SIZE SALIDA X(282).                               076900      
001600 77  R422-15-CTR-ERROR                 PIC S9(11) BINARY.         077000      
001601                                                                  077100      
001602*************************************************************     077200      
001603***PARAMETROS          S016_L422_CTRLCAM (16)         *******     077300      
001604*************************************************************     077400      
001605*                        existe en el archivo de parametros  *    077500      
001606*                        pero no existe el codigo          **     077600      
001607*                        CUENTA CON DOCUMENTACION         ***     077700      
001608*************************************************************     077800      
001609 01  E422-16-CTR-ENTRADA.                                         077900      
001610     02  E422-16-CTR-NUMSIST         PIC 9(04) COMP.              078000      
001611     02  E422-16-CTR-NUMPASO         PIC 9(04) COMP.              078100      
001612     02  E422-16-CTA-NUMPROD         PIC 9(04) COMP.              078200      
001613     02  E422-16-CTA-CVEINST         PIC 9(04) COMP.              078300      
001614     02  E422-16-CTA-NUMPREF         PIC 9(04) COMP.              078400      
001615     02  E422-16-CTA-NUM             PIC 9(12) COMP.              078500      
001616     02  E422-16-CTE-NUM             PIC 9(12) COMP.              078600      
001617     02  E422-16-CTR-NUMCSI          PIC 9(02) COMP.              078700      
001618     02  E422-16-CTR-NUMREG-IN       PIC 9(02) COMP.              078800      
001619     02  E422-16-CTR-NUMDS           PIC 9(02) COMP.              078900      
001620     02  E422-16-CTR-NUMCAMPO        PIC 9(02) COMP.              079000      
001621     02  E422-16-CTR-FECULTMOD-2K    PIC 9(08) COMP.              079100      
001622     02  E422-16-CTR-FECINI-2K       PIC 9(08) COMP.              079200      
001623     02  E422-16-CTR-FECFIN-2K       PIC 9(08) COMP.              079300      
001624****                                                              079400      
001625 01 S422-16-CTR-SALIDA.                                           079500      
001626    02 S422-16-CTR-NUMREG-OU         PIC 9(02) COMP.              079600      
001627    02 S422-16-CTR-REGISTRO OCCURS 99 TIMES.                      079700      
001628       03 S422-16-CTR-NUMCSI              PIC 9(02) COMP.         079800      
001629       03 S422-16-CTE-NUM                 PIC 9(12) COMP.         079900      
001630       03 S422-16-CTA-NUMPROD             PIC 9(04) COMP.         080000      
001631       03 S422-16-CTA-CVEINST             PIC 9(04) COMP.         080100      
001632       03 S422-16-CTA-NUMPREF             PIC 9(04) COMP.         080200      
001633       03 S422-16-CTA-NUM                 PIC 9(12) COMP.         080300      
001634       03 S422-16-CTR-NUMDS               PIC 9(02) COMP.         080400      
001635       03 S422-16-CTR-NUMCAMPO            PIC 9(02) COMP.         080500      
001636       03 S422-16-CTR-DATOANT             PIC X(15).              080600      
001637       03 S422-16-CTR-FECULTMOD-2K        PIC 9(08) COMP.         080700      
001638       03 S422-16-CTR-NUMSUC              PIC 9(04) COMP.         080800      
001639       03 S422-16-CTR-NUMNOMI             PIC 9(10) COMP.         080900      
001640*                                                                 081000      
001641 77  R422-16-CTR-ERROR                    PIC S9(11) BINARY.      081100      
001642*************************************************************     081200      
001643**** PARAMETROS         S016_L422_NUMDOM (17)              **     081300      
001644*    CONSULTA B02DOMICILIOS MULTIPE NUMREG (E/S)           **     081400      
001645*************************************************************     081500      
001646 01  E422-17-CTR-ENTRADA.                                         081600      
001647     02  E422-17-CTR-NUMCSI          PIC 9(02) COMP.              081700      
001648     02  E422-17-CTR-NUMSIST         PIC 9(04) COMP.              081800      
001649     02  E422-17-CTR-NUMPASO         PIC 9(04) COMP.              081900      
001650     02  E422-17-CTE-NUM             PIC 9(12) COMP.              082000      
001651     02  E422-17-CTR-NUMDOM          PIC 9(04) COMP.              082100      
001652     02  E422-17-CTR-NUMREG-IN       PIC 9(02) COMP.              082200      
001653     02  E422-17-CTR-OPCION          PIC 9(02) COMP.              082300      
001654     02  FILLER                      PIC X(45).                   082400      
001655* SIZE ENTRADA X(60).                                             082500      
001656 01 S422-17-CTR-SALIDA.                                           082600      
001657     02 S422-17-CTR-NUMREG-OU           PIC 9(02) COMP.           082700      
001658     02 S422-17-CTR-REGISTRO OCCURS 30 TIMES.                     082800      
001659        03 S422-17-CTR-NUMCSI              PIC 9(02) COMP.        082900      
001660        03 S422-17-CTE-NUM                 PIC 9(12) COMP.        083000      
001661        03 S422-17-CTR-NUMDOM              PIC 9(04) COMP.        083100      
001662        03 S422-17-CTR-DOMUSOS             PIC 9(04) COMP.        083200      
001663        03 S422-17-CTE-CALLENUM            PIC X(36).             083300      
001664        03 S422-17-CTE-NOMCOL              PIC X(24).             083400      
001665        03 S422-17-CTE-NOMPOB              PIC X(20).             083500      
001666        03 S422-17-CTE-CVEEDO              PIC 9(02) COMP.        083600      
001667        03 S422-17-CTE-NUMCP               PIC 9(06) COMP.        083700      
001668        03 S422-17-CTE-NUMTEL              PIC 9(10) COMP.        083800      
001669        03 S422-17-CTE-NUMTELEXT           PIC 9(06) COMP.        083900      
001670        03 S422-17-CTE-CVETEL              PIC 9(02) COMP.        084000      
001671        03 S422-17-CTE-NUMTEL2             PIC 9(10) COMP.        084100      
001672        03 S422-17-CTE-NUMTELEX2           PIC 9(06) COMP.        084200      
001673        03 S422-17-CTE-CVETEL2             PIC 9(02) COMP.        084300      
001674        03 S422-17-CTE-CVESTADOM           PIC 9(02) COMP.        084400      
001675        03 S422-17-CTE-CVEDOM              PIC 9(02) COMP.        084500      
001676        03 S422-17-CTE-CVEAGEN             PIC X(04).             084600      
001677        03 S422-17-CTE-APDO                PIC X(08).             084700      
001678        03 S422-17-CTR-NUMCSIDOM           PIC 9(02) COMP.        084800      
001679        03 S422-17-CTR-FECALTDOM-2K        PIC 9(08) COMP.        084900      
001680        03 S422-17-CTR-FECMODDOM-2K        PIC 9(08) COMP.        085000      
001681        03 FILLER                          PIC X(08).             085100      
001682*      size reg OCCURS X(144)                                     085200      
001683* size SALIDA = 1+(144*30) = 4321                                 085300      
001684*                                                                 085400      
001685 77  R422-17-CTR-ERROR                  PIC S9(11) BINARY.        085500      
001686*********************************************************         085600      
001687****PARAMETROS  S016_L422_MED_ACC_SEQ (18)           ****         085700      
001688**  CONSULTA B08MEDIOS MULTIPLE NUMREG E/S           ****         085800      
001689*********************************************************         085900      
001690 01  E422-18-CTR-ENTRADA.                                         086000      
001691     02  E422-18-CTR-NUMSIST         PIC 9(04) COMP.              086100      
001692     02  E422-18-CTR-NUMPASO         PIC 9(04) COMP.              086200      
001693     02  E422-18-MDA-NUMPREF         PIC 9(04) COMP.              086300      
001694     02  E422-18-MDA-NUM             PIC 9(12) COMP.              086400      
001695     02  E422-18-CTR-NUMREG-IN       PIC 9(02) COMP.              086500      
001696     02  FILLER                      PIC X(47).                   086600      
001697* SIZE ENTRADA X(60).                                             086700      
001698 01 S422-18-CTR-SALIDA.                                           086800      
001699     02 S422-18-CTR-NUMREG-OU           PIC 9(02) COMP.           086900      
001700     02 S422-18-CTR-REGISTRO OCCURS 30 TIMES.                     087000      
001701        03 S422-18-CTR-NUMCSI              PIC 9(02) COMP.        087100      
001702        03 S422-18-CTE-NUM                 PIC 9(12) COMP.        087200      
001703        03 S422-18-CTA-NUMPROD             PIC 9(04) COMP.        087300      
001704        03 S422-18-CTA-CVEINST             PIC 9(02) COMP.        087400      
001705        03 S422-18-CTA-NUMPREF             PIC 9(04) COMP.        087500      
001706        03 S422-18-CTA-NUM                 PIC 9(12) COMP.        087600      
001707        03 S422-18-MDA-CVETIPO             PIC 9(02) COMP.        087700      
001708        03 S422-18-MDA-SUBTIPO             PIC 9(02) COMP.        087800      
001709        03 S422-18-MDA-CVETIT              PIC 9(02) COMP.        087900      
001710        03 S422-18-MDA-NUMPREF             PIC 9(04) COMP.        088000      
001711        03 S422-18-MDA-NUM                 PIC 9(12) COMP.        088100      
001712        03 S422-18-MDA-ABRPROFT            PIC X(03).             088200      
001713        03 S422-18-CTR-PTRNOMT             PIC 9(04) COMP.        088300      
001714        03 S422-18-MDA-ABRPROFC            PIC X(03).             088400      
001715        03 S422-18-CTR-PTRNOMC             PIC 9(04) COMP.        088500      
001716        03 S422-18-MDA-NUMTALON            PIC 9(02) COMP.        088600      
001717        03 S422-18-MDA-CHQXTALON           PIC 9(02) COMP.        088700      
001718        03 S422-18-MDA-CVESTATUS           PIC 9(02) COMP.        088800      
001719        03 S422-18-MDA-FECALTA-2K          PIC 9(08) COMP.        088900      
001720        03 S422-18-MDA-FECULTMOD-2K        PIC 9(08) COMP.        089000      
001721        03 S422-18-MDA-FECVENC-2K          PIC 9(08) COMP.        089100      
001722        03 S422-18-MDA-FECCANCEL-2K        PIC 9(08) COMP.        089200      
001723        03 S422-18-MDA-FECPREV             PIC 9(06) COMP.        089300      
001724        03 S422-18-MDA-HHPREV              PIC 9(04) COMP.        089400      
001725        03 S422-18-MDA-HHALTA              PIC 9(04) COMP.        089500      
001726        03 S422-18-MDA-HHULTMOD            PIC 9(04) COMP.        089600      
001727        03 S422-18-MDA-HHULTACC            PIC 9(04) COMP.        089700      
001728        03 S422-18-MDA-HHVENC              PIC 9(04) COMP.        089800      
001729        03 S422-18-MDA-PERIODO             PIC 9(02) COMP.        089900      
001730        03 S422-18-MDA-SITUACION           PIC X(04).             090000      
001731        03 FILLER                          PIC X(08).             090100      
001732*      size reg OCCURS X(84)                                      090200      
001733*      size SALIDA = 1+(84*30) = 2521                             090300      
001734*                                                                 090400      
001735 77  R422-18-CTR-ERROR                  PIC S9(11) BINARY.        090500      
001736*********************************************************         090600      
001737***   PARAMETROS  S016_L422_EMPRESAS (19)           *****         090700      
001738***   CONSULTA B01CUENTAS, B04CUENTAS, B21EMPRESAS     **         090800      
001739**    le falta AL CODIGO llenar los datos de           **         090900      
001740***   LOS DATOS DEL CLIENTE PERTENECIENTE AL PROGRAMA  **         091000      
001741***    FINAPE B23                                      **         091100      
001742*********************************************************         091200      
001743 01  E422-19-CTR-ENTRADA.                                         091300      
001744     02  E422-19-CTR-NUMSIST         PIC 9(04) COMP.              091400      
001745     02  E422-19-CTR-NUMPASO         PIC 9(04) COMP.              091500      
001746     02  E422-19-CTA-NUMPROD         PIC 9(04) COMP.              091600      
001747     02  E422-19-CTA-CVEINST         PIC 9(04) COMP.              091700      
001748     02  E422-19-CTO-NUM.                                         091800      
001749         03  E422-19-CTA-NUMPREF     PIC 9(04) COMP.              091900      
001750         03  E422-19-CTA-NUM         PIC 9(12) COMP.              092000      
001751     02  E422-19-CTE-NUM             PIC 9(12) COMP.              092100      
001752     02  E422-19-CTE-CODINI          PIC X(04).                   092200      
001753     02  E422-19-CTE-FECNAC          PIC 9(06) COMP.              092300      
001754     02  E422-19-CTE-CODHOM          PIC X(05).                   092400      
001755     02  FILLER                      PIC X(26).                   092500      
001756* SIZE SALIDA X(60)                                               092600      
001757 01  S422-19-CTR-SALIDA.                                          092700      
001758     02 S422-19-CTR-REGISTRO.                                     092800      
001759        03 S422-19-CTA-NUMPROD         PIC 9(04) COMP.            092900      
001760        03 S422-19-CTA-CVEINST         PIC 9(04) COMP.            093000      
001761        03 S422-19-CTA-NUMSUC          PIC 9(04) COMP.            093100      
001762        03 S422-19-CTE-CVEPERS         PIC 9(02) COMP.            093200      
001763        03 S422-19-CTE-CVESECTOR       PIC 9(02) COMP.            093300      
001764        03 S422-19-CTE-CVETIPO         PIC 9(02) COMP.            093400      
001765        03 S422-19-CTE-ACTBNM          PIC 9(06) COMP.            093500      
001766        03 S422-19-CTA-CVEMON          PIC 9(02) COMP.            093600      
001767        03 S422-19-CTE-NOMBRE          PIC X(55).                 093700      
001768        03 S422-19-CTE-CVESOCFUN       PIC 9(02) COMP.            093800      
001769        03 S422-19-CTE-CVEPERBCO       PIC 9(02) COMP.            093900      
001770        03 S422-19-CTE-NUM             PIC 9(12) COMP.            094000      
001771        03 S422-19-CTA-CVESTATUS       PIC 9(02) COMP.            094100      
001772        03 S422-19-CTE-CODRFC.                                    094200      
001773           04 S422-19-CTE-CODINI       PIC X(04).                 094300      
001774           04 S422-19-CTE-FECNAC       PIC 9(06) COMP.            094400      
001775           04 S422-19-CTE-CODHOM       PIC X(05).                 094500      
001776        03 S422-19-CTA-CVEUSO          PIC 9(02) COMP.            094600      
001777        03 S422-19-CTA-CVEMANEJO       PIC 9(02) COMP.            094700      
001778        03 S422-19-INFADICTA.                                     094800      
001779           04 S422-19-FECONSTIT-2K     PIC 9(08) COMP.            094900      
001780           04 S422-19-FEPODER-2K       PIC 9(08) COMP.            095000      
001781           04 S422-19-FEDICJURI-2K     PIC 9(08) COMP.            095100      
001782        03 S422-19-CTR-NUMCSI          PIC 9(02) COMP.            095200      
001783        03 S422-19-CTA-DIACORTE        PIC 9(02) COMP.            095300      
001784        03 S422-19-CTA-CVEENVIO        PIC 9(04) COMP.            095400      
001785        03 S422-19-CTA-EDIEDOCTA       PIC 9(02) COMP.            095500      
001786        03 S422-19-CTA-DISEDOCTA       PIC 9(02) COMP.            095600      
001787        03 S422-19-CTA-CVENIVRIE       PIC X(01).                 095700      
001788        03 S422-19-CTR-USOEJECTA       PIC 9(04) COMP.            095800      
001789        03 S422-19-CTR-USOSCTE         PIC 9(04) COMP.            095900      
001790        03 S422-19-CTA-VENDNOMI        PIC 9(10) COMP.            096000      
001791        03 S422-19-CTA-VENDSUC         PIC 9(04) COMP.            096100      
001792        03 S422-19-CTA-REFENOMI        PIC 9(10) COMP.            096200      
001793        03 S422-19-CTA-REFECVE         PIC 9(02) COMP.            096300      
001794        03 S422-19-CTA-PREVNOMI        PIC 9(10) COMP.            096400      
001795        03 S422-19-CTA-PREVSUC         PIC 9(04) COMP.            096500      
001796        03 S422-19-CTA-PREVIMP         PIC 9(14) COMP.            096600      
001797        03 S422-19-CTA-RESTRIC         PIC 9(02) COMP.            096700      
001798        03 S422-19-CTA-RESTCON         PIC 9(02) COMP.            096800      
001799        03 S422-19-CTA-OPCPAGO         PIC 9(02) COMP.            096900      
001800        03 S422-19-CTA-RGOPAGO         PIC 9(02) COMP.            097000      
001801        03 S422-19-CTA-RETIMP          PIC 9(02) COMP.            097100      
001802        03 S422-19-CTA-FECPREV         PIC 9(06) COMP.            097200      
001803        03 S422-19-CTA-FECAPER-2K      PIC 9(08) COMP.            097300      
001804        03 S422-19-CTA-FECULTMOD-2K    PIC 9(08) COMP.            097400      
001805        03 S422-19-CTA-FECCANCEL-2K    PIC 9(08) COMP.            097500      
001806        03 S422-19-CTA-FECRENOVA-2K    PIC 9(08) COMP.            097600      
001807        03 S422-19-CTA-SITUACION       PIC X(04).                 097700      
001808        03 S422-19-CTA-NUMPREF         PIC 9(04) COMP.            097800      
001809        03 S422-19-CTA-NUM             PIC 9(12) COMP.            097900      
001810*LOS DATOS DEL CLIENTE PERTENECIENTE AL PROGRAMA FINAPE           098000      
001811**    le falta AL CODIGO llenar los datos de                      098100      
001812***   LOS DATOS DEL CLIENTE PERTENECIENTE AL PROGRAMA             098200      
001813***    FINAPE B23                                                 098300      
001814        03 S422-19-CTE-NUMFINAPE       PIC 9(12) COMP.            098400      
001815        03 S422-19-CTE-CODINI-FINAPE   PIC X(04).                 098500      
001816        03 S422-19-CTE-FECNAC-FINAPE   PIC 9(06) COMP.            098600      
001817        03 S422-19-CTE-CODHOM-FINAPE   PIC X(05).                 098700      
001818        03 S422-19-CTE-SWIFT           PIC X(11).                 098800      
001819        03 S422-19-CTE-TELEX           PIC X(33).                 098900      
001820        03 S422-19-CTE-NUMVENC         PIC 9(02) COMP.            099000      
001821        03 S422-19-CTE-FINAPE.                                    099100      
001822           05 S422-19-FIN-CVEDESC      PIC 9(04)V9(04) COMP.      099200      
001823           05 S422-19-FIN-CVEGOBI      PIC 9(04)V9(04) COMP.      099300      
001824           05 S422-19-FIN-CVEBANC      PIC 9(04)V9(04) COMP.      099400      
001825           05 S422-19-FIN-CVECOND      PIC 9(04)V9(04) COMP.      099500      
001826        03 S422-19-CTE-RIEBNM          PIC X(02).                 099600      
001827        03 S422-19-CTE-RIEBM           PIC X(02).                 099700      
001828        03 S422-19-CTE-VENTAS          PIC 9(14) COMP.            099800      
001829        03 S422-19-CTE-FECALTA         PIC 9(08) COMP.            099900      
001830        03 S422-19-CTE-FEULTMOD        PIC 9(08) COMP.            100000      
001831        03 S422-19-CTE-CAEB            PIC 9(06) COMP.            100100      
001832        03 S422-19-CTE-CVESEXO         PIC 9(02) COMP.            100200      
001833* HASTA AQUæ SE OBTIENE LA INFORMACION.                           100300      
001834        03 FILLER                      PIC X(51).                 100400      
001835*SIZE SALIDA X(330).                                              100500      
001836* PENDIENTE DE OBTENER SE DEJA PARA UN FUTURO:                    100600      
001837*        03 S422-19-CTE-CALIF   OCCURS  6 TIMES.                  100700      
001838*           05 S422-19-CTE-ACUM         PIC 9(04) COMP.           100800      
001839*           05 S422-19-CTE-INMED        PIC 9(04) COMP.           100900      
001840*        03 S422-19-CTE-MONVEN          PIC 9(12) COMP.           101000      
001841*        03 S422-19-CTE-SALDO-JUNIO     PIC 9(12) COMP.           101100      
001842*        03 S422-19-CTE-SALDO-JULIO     PIC 9(12) COMP.           101200      
001843*        03 S422-19-CTE-FECSUSP         PIC 9(08) COMP.           101300      
001844*        03 S422-19-CTE-STAFIN          PIC 9(02) COMP.           101400      
001845*        03 S422-19-CTE-FOPYME-TASA.                              101500      
001846*           05 S422-19-FOPT-CVEDESC     PIC 9(04)V9(04) COMP.     101600      
001847*           05 S422-19-FOPT-CVEGOBI     PIC 9(04)V9(04) COMP.     101700      
001848*           05 S422-19-FOPT-CVEBANC     PIC 9(04)V9(04) COMP.     101800      
001849*           05 S422-19-FOPT-CVECOND     PIC 9(04)V9(04) COMP.     101900      
001850*        03 S422-19-CTE-FOPYME-PAGO.                              102000      
001851*           05 S422-19-FOPP-CVEDESC     PIC 9(04)V9(04) COMP.     102100      
001852*           05 S422-19-FOPP-CVEGOBI     PIC 9(04)V9(04) COMP.     102200      
001853*           05 S422-19-FOPP-CVEBANC     PIC 9(04)V9(04) COMP.     102300      
001854*           05 S422-19-FOPP-CVECOND     PIC 9(04)V9(04) COMP.     102400      
001855*                                                                 102500      
001856*                                                                 102600      
001857   77  R422-19-CTR-ERROR                 PIC S9(11) BINARY.       102700      
001858*                                                                 102800      
001859************************************************************      102900      
001860**** PARAMETROS DEL ENTRY POINT S016_L422_CONS_XMEDIO (20)**      103000      
001861**** CONSULTA DE CUENTAS POR MEDIOS DE ACCESO             **      103100      
001862****          B08MEDIOS B04PRODS                          **      103200      
001863************************************************************      103300      
001864  01  E422-20-CTR-ENTRADA.                                        103400      
001865     02 E422-20-MDA-NUMPREF         PIC 9(04) COMP.               103500      
001866     02 E422-20-MDA-NUM             PIC 9(12) COMP.               103600      
001867* SIZE ENTRADA X(16)                                              103700      
001868  01  S422-20-CTR-SALIDA.                                         103800      
001869     02 S422-20-CTE-NUM         PIC 9(12) COMP.                   103900      
001870     02 S422-20-CTA-CVESTATUS   PIC 9(02) COMP.                   104000      
001871     02 S422-20-CTA-CVEMONEDA   PIC 9(02) COMP.                   104100      
001872     02 S422-20-MDA-CVESTATUS   PIC 9(02) COMP.                   104200      
001873     02 S422-20-CTA-NUMPROD-M   PIC 9(04) COMP.                   104300      
001874     02 S422-20-CTA-CVEINST-M   PIC 9(02) COMP.                   104400      
001875     02 S422-20-MDA-NUMPREF-M   PIC 9(04) COMP.                   104500      
001876     02 S422-20-MDA-NUM-M       PIC 9(12) COMP.                   104600      
001877     02 S422-20-CTA-NUMPROD-C   PIC 9(04) COMP.                   104700      
001878     02 S422-20-CTA-CVEINST-C   PIC 9(02) COMP.                   104800      
001879     02 S422-20-CTA-NUMPREF-C   PIC 9(04) COMP.                   104900      
001880     02 S422-20-CTA-NUM-C       PIC 9(12) COMP.                   105000      
001881* SIZE SALIDA  X(62)                                              105100      
001882                                                                  105200      
001883 77  R422-20-CTR-ERROR               PIC S9(11) BINARY.           105300      
001884******************************************************************105400      
001885*****    PARAMETROS PARA EL ENTRY POINT BUSCA CUENTA-EJE     *****105500      
001886*****    S016-L422-CTARELACIONADA (E422_60_CTR_ENTRADA,      *****105600      
001887*****    E422_60_CTR_SALIDA)                       (60)      *****105700      
001888*****    PROCEDIMIENTO DE TIPO ENTERO.                        ****105800      
001889*****    CONSULTA B04CUENTAS, B07CTACTA CON OPCION           *****105900      
001890******************************************************************106000      
001891 01  E422-60-CTR-ENTRADA.                                         106100      
001892     02  E422-60-CTA-NUMPROD         PIC 9(04) COMP.              106200      
001893     02  E422-60-CTA-CVEINST         PIC 9(04) COMP.              106300      
001894     02  E422-60-CTO-NUM.                                         106400      
001895         03  E422-60-CTA-NUMPREF     PIC 9(04) COMP.              106500      
001896         03  E422-60-CTA-NUM         PIC 9(12) COMP.              106600      
001897     02  E422-60-CTR-CVERELCTA       PIC 9(02) COMP.              106700      
001898     02  E422-60-OPCION              PIC 9(02) COMP.              106800      
001899     02  FILLER                      PIC X(46).                   106900      
001900* SIZE ENTRADA X(60).                                             107000      
001901 01  S422-60-CTR-SALIDA.                                          107100      
001902     02 S422-60-CTR-REGISTRO.                                     107200      
001903        03 S422-60-CTR-ERR.                                       107300      
001904           04 S422-60-CTR-ERROR        PIC 9(04) COMP.            107400      
001905           04 S422-60-CTR-ERRORTIPO    PIC 9(04) COMP.            107500      
001906           04 S422-60-CTR-ESTRUCTURA   PIC 9(04) COMP.            107600      
001907        03 S422-60-CTR-NUMCSI          PIC 9(02) COMP.            107700      
001908        03 S422-60-CTA-NUMPROD         PIC 9(04) COMP.            107800      
001909        03 S422-60-CTA-CVEINST         PIC 9(02) COMP.            107900      
001910        03 S422-60-CTA-NUMSUC          PIC 9(04) COMP.            108000      
001911        03 S422-60-CTA-NUMCTO.                                    108100      
001912           04 S422-60-CTA-NUMPREF      PIC 9(04) COMP.            108200      
001913           04 S422-60-CTA-NUM          PIC 9(12) COMP.            108300      
001914        03 S422-60-CTE-NUM             PIC 9(12) COMP.            108400      
001915        03 S422-60-CTA-DIACORTE        PIC 9(02) COMP.            108500      
001916        03 S422-60-CTA-CVEMONEDA       PIC 9(02) COMP.            108600      
001917        03 S422-60-CTA-CVESTATUS       PIC 9(02) COMP.            108700      
001918        03 S422-60-CTA-CVEENVIO        PIC 9(04) COMP.            108800      
001919        03 S422-60-CTA-CVEMANEJO       PIC 9(02) COMP.            108900      
001920        03 S422-60-CTA-CVEUSO          PIC 9(02) COMP.            109000      
001921        03 S422-60-CTR-USOEJECTA       PIC 9(04) COMP.            109100      
001922        03 S422-60-CTA-RESTRIC         PIC 9(02) COMP.            109200      
001923        03 S422-60-CTA-RESTCON         PIC 9(02) COMP.            109300      
001924        03 S422-60-CTA-OPCPAGO         PIC 9(02) COMP.            109400      
001925        03 S422-60-CTA-RGOPAGO         PIC 9(02) COMP.            109500      
001926        03 S422-60-CTA-RETIMP          PIC 9(02) COMP.            109600      
001927        03 S422-60-CTA-FECAPER-2K      PIC 9(08) COMP.            109700      
001928        03 S422-60-CTA-FECULTMOD-2K    PIC 9(08) COMP.            109800      
001929        03 S422-60-CTA-FECCANCEL-2K    PIC 9(08) COMP.            109900      
001930        03 FILLER                      PIC X(32).                 110000      
001931*SIZE SALIDA X(84).                                               110100      
001932   77  R422-60-CTR-ERROR               PIC S9(11) BINARY.         110200      
001933*                                                                 110300      
001934*********************************************************         110400      
001935****  PARAMETROS     S016_L422_CTAMEDIO  (61)      ******         110500      
001936****  PROCEDIMIENTO DE TIPO ENTERO                  *****         110600      
001937*****    CONSULTA B04CUENTAS, B08MEDIOS CON OPCION  *****         110700      
001938*********************************************************         110800      
001939 01  E422-61-CTR-ENTRADA.                                         110900      
001940     02  E422-61-CTA-NUMPROD         PIC 9(04) COMP.              111000      
001941     02  E422-61-CTA-CVEINST         PIC 9(04) COMP.              111100      
001942     02  E422-61-CTO-NUM.                                         111200      
001943         03  E422-61-CTA-NUMPREF     PIC 9(04) COMP.              111300      
001944         03  E422-61-CTA-NUM         PIC 9(12) COMP.              111400      
001945     02  E422-61-MDA-CVETIPO         PIC 9(02) COMP.              111500      
001946     02  E422-61-OPCION              PIC 9(02) COMP.              111600      
001947     02  E422-61-CTR-NUMCSI         PIC 9(02) COMP.               111700      
001948     02  E422-61-CTE-NUM            PIC 9(12) COMP.               111800      
001949     02  FILLER                      PIC X(39).                   111900      
001950                                                                  112000      
001951* SIZE ENTRADA X(60)                                              112100      
001952 01  S422-61-CTR-SALIDA.                                          112200      
001953     02 S422-61-CTR-REGISTRO.                                     112300      
001954        03 S422-61-CTR-ERR.                                       112400      
001955           04 S422-61-CTR-ERROR        PIC 9(04) COMP.            112500      
001956           04 S422-61-CTR-ERRORTIPO    PIC 9(04) COMP.            112600      
001957           04 S422-61-CTR-ESTRUCTURA   PIC 9(04) COMP.            112700      
001958        03 S422-61-CTR-NUMCSI          PIC 9(02) COMP.            112800      
001959        03 S422-61-CTE-NUM             PIC 9(12) COMP.            112900      
001960        03 S422-61-CTA-NUMPROD         PIC 9(04) COMP.            113000      
001961        03 S422-61-CTA-CVEINST         PIC 9(02) COMP.            113100      
001962        03 S422-61-CTA-NUMCTO.                                    113200      
001963           04 S422-61-CTA-NUMPREF      PIC 9(04) COMP.            113300      
001964           04 S422-61-CTA-NUM          PIC 9(12) COMP.            113400      
001965        03 S422-61-MDA-CVETIPO         PIC 9(02) COMP.            113500      
001966        03 S422-61-MDA-SUBTIPO         PIC 9(02) COMP.            113600      
001967        03 S422-61-MDA-CVETIT          PIC 9(02) COMP.            113700      
001968        03 S422-61-MDA-NUMCTO.                                    113800      
001969           04 S422-61-MDA-NUMPREF      PIC 9(04) COMP.            113900      
001970           04 S422-61-MDA-NUM          PIC 9(12) COMP.            114000      
001971        03 S422-61-MDA-NUMTALON        PIC 9(02) COMP.            114100      
001972        03 S422-61-MDA-CHQXTALON       PIC 9(02) COMP.            114200      
001973        03 S422-61-MDA-CVEPIN          PIC 9(06) COMP.            114300      
001974        03 S422-61-MDA-CVESTATUS       PIC 9(02) COMP.            114400      
001975        03 S422-61-MDA-FECALTA-2K      PIC 9(08) COMP.            114500      
001976        03 S422-61-MDA-FECULTMOD-2K    PIC 9(08) COMP.            114600      
001977        03 S422-61-MDA-FECCANCEL-2K    PIC 9(08) COMP.            114700      
001978        03 S422-61-MDA-FECMODPIN-2K    PIC 9(08) COMP.            114800      
001979        03 FILLER                      PIC X(27).                 114900      
001980* SIZE SALIDA X(84).                                              115000      
001981  77  R422-61-CTR-ERROR               PIC S9(11) BINARY.          115100      
001982***************************************************************   115200      
001983****  PARAMETROS        S016_L422_CTECTA    (62)           ****   115300      
001984****  PROCEDIMIENTO DE TIPO ENTERO                         ****   115400      
001985*****    CONSULTA B04CUENTAS, B05CTECTA CON OPCION        *****   115500      
001986***************************************************************   115600      
001987 01  E422-62-CTR-ENTRADA.                                         115700      
001988     02  E422-62-CTR-NUMCSI          PIC 9(02) COMP.              115800      
001989     02  E422-62-CTE-NUM             PIC 9(12) COMP.              115900      
001990     02  E422-62-CTA-NUMPROD         PIC 9(04) COMP.              116000      
001991     02  E422-62-CTA-CVEINST         PIC 9(02) COMP.              116100      
001992     02  E422-62-OPCION              PIC 9(02) COMP.              116200      
001993     02  FILLER                      PIC X(49).                   116300      
001994* SIZE ENTRADA X(60).                                             116400      
001995 01  S422-62-CTR-SALIDA.                                          116500      
001996     02 S422-62-CTR-REGISTRO.                                     116600      
001997        03 S422-62-CTR-ERR.                                       116700      
001998           04 S422-62-CTR-ERROR        PIC 9(04) COMP.            116800      
001999           04 S422-62-CTR-ERRORTIPO    PIC 9(04) COMP.            116900      
002000           04 S422-62-CTR-ESTRUCTURA   PIC 9(04) COMP.            117000      
002001        03 S422-62-CTR-NUMCSI          PIC 9(02) COMP.            117100      
002002        03 S422-62-CTE-NUM             PIC 9(12) COMP.            117200      
002003        03 S422-62-CTA-NUMPROD         PIC 9(04) COMP.            117300      
002004        03 S422-62-CTA-CVEINST         PIC 9(02) COMP.            117400      
002005        03 S422-62-CTA-NUMPREF         PIC 9(04) COMP.            117500      
002006        03 S422-62-CTA-NUM             PIC 9(12) COMP.            117600      
002007        03 S422-62-CTA-NUMSUC          PIC 9(04) COMP.            117700      
002008        03 S422-62-CTA-RELCTE          PIC 9(02) COMP.            117800      
002009        03 S422-62-CTA-USOBCAELE       PIC 9(02) COMP.            117900      
002010        03 S422-62-CTA-ASOCIADAX       PIC 9(02) COMP.            118000      
002011        03 S422-62-CTA-FEALTACTE-2K    PIC 9(08) COMP.            118100      
002012        03 S422-62-CTA-FEMODCTE-2K     PIC 9(08) COMP.            118200      
002013        03 S422-62-CTA-3DIGITOS        PIC 9(04) COMP.            118300      
002014        03 FILLER                      PIC X(27).                 118400      
002015* SIZE SALIDA X(66).                                              118500      
002016 77  R422-62-CTR-ERROR                 PIC S9(11) BINARY.         118600      
002017*NO CUENTA CON FILLER, SE AµADIERON 4 COMP.....                   118700      
002018***************************************************************   118800      
002019**** PARAMETROS  S016_L422_CONS_DOMCTA(63)                 ****   118900      
002020**** PROCEDIMIENTO DE TIPO ENTERO                          ****   119000      
002021*****CONSULTA B01CLIENTES, B02DOMICILIOS y B04CUENTAS     *****   119100      
002022***************************************************************   119200      
002023 01  E422-63-CTR-ENTRADA.                                         119300      
002024     03 E422-63-CTA-NUMPREF               PIC 9(004) COMP.        119400      
002025     03 E422-63-CTA-NUM                   PIC 9(012) COMP.        119500      
002026     03 E422-63-CTA-NUMPROD               PIC 9(004) COMP.        119600      
002027     03 E422-63-CTA-CVEINST               PIC 9(002) COMP.        119700      
002028     03 FILLER                            PIC X(049).             119800      
002029*SIZE ENTRADA X(60).                                              119900      
002030*                                                                 120000      
002031 01  S422-63-CTR-SALIDA.                                          120100      
002032     05 S422-63-CTR-ERROR                 PIC 9(004) COMP.        120200      
002033     05 S422-63-CTR-ERRORTYPE             PIC 9(004) COMP.        120300      
002034     05 S422-63-CTR-STRUCTURE             PIC 9(004) COMP.        120400      
002035     05 S422-63-CTE-CALLENUM              PIC X(036).             120500      
002036     05 S422-63-CTE-NOMCOL                PIC X(024).             120600      
002037     05 S422-63-CTE-NOMPOB                PIC X(020).             120700      
002038     05 S422-63-CTE-CVEEDO                PIC 9(002) COMP.        120800      
002039     05 S422-63-CTE-NUMCP                 PIC 9(006) COMP.        120900      
002040     05 S422-63-CTE-NUMTEL                PIC 9(010) COMP.        121000      
002041     05 S422-63-CTE-NUMTELEXT             PIC 9(006) COMP.        121100      
002042     05 S422-63-CTE-CVETEL                PIC 9(002) COMP.        121200      
002043     05 S422-63-CTE-NUMTEL2               PIC 9(010) COMP.        121300      
002044     05 S422-63-CTE-NUMTELEX2             PIC 9(006) COMP.        121400      
002045     05 S422-63-CTE-CVETEL2               PIC 9(002) COMP.        121500      
002046     05 S422-63-CTR-CVESTADOM             PIC 9(002) COMP.        121600      
002047     05 S422-63-CTR-CVEDOM                PIC 9(002) COMP.        121700      
002048     05 FILLER                            PIC X(028).             121800      
002049* SIZE SALIDA X(138).                                             121900      
002050*                                                                 122000      
002051 77  R422-63-CTR-ERROR                    PIC S9(11) BINARY.      122100      
002052***************************************************************   122200      
002053**** PARAMETROS  S016_L422_CONS_DOMGAR (64)                ****   122300      
002054**** PROCEDIMIENTO DE TIPO ENTERO                           ***   122400      
002055*****CONSULTA B01CLIENTES, B02DOMICILIOS y B17INFADICTA   *****   122500      
002056***************************************************************   122600      
002057 01  E422-64-CTR-ENTRADA.                                         122700      
002058     03 E422-64-CTA-NUMPREF               PIC 9(004) COMP.        122800      
002059     03 E422-64-CTA-NUM                   PIC 9(012) COMP.        122900      
002060     03 E422-64-CTA-NUMPROD               PIC 9(004) COMP.        123000      
002061     03 E422-64-CTA-CVEINST               PIC 9(002) COMP.        123100      
002062     03 FILLER                            PIC X(049).             123200      
002063* SIZE SALIDA X(60)                                               123300      
002064*                                                                 123400      
002065 01  S422-64-CTR-SALIDA.                                          123500      
002066        05 S422-64-CTR-ERROR              PIC 9(004) COMP.        123600      
002067        05 S422-64-CTR-ERRORTYPE          PIC 9(004) COMP.        123700      
002068        05 S422-64-CTR-STRUCTURE          PIC 9(004) COMP.        123800      
002069        05 S422-64-CTE-CALLENUM           PIC X(036).             123900      
002070        05 S422-64-CTE-NOMCOL             PIC X(024).             124000      
002071        05 S422-64-CTE-NOMPOB             PIC X(020).             124100      
002072        05 S422-64-CTE-CVEEDO             PIC 9(002) COMP.        124200      
002073        05 S422-64-CTE-NUMCP              PIC 9(006) COMP.        124300      
002074        05 S422-64-CTE-NUMTEL             PIC 9(010) COMP.        124400      
002075        05 S422-64-CTE-NUMTELEXT          PIC 9(006) COMP.        124500      
002076        05 S422-64-CTE-CVETEL             PIC 9(002) COMP.        124600      
002077        05 S422-64-CTE-NUMTEL2            PIC 9(010) COMP.        124700      
002078        05 S422-64-CTE-NUMTELEX2          PIC 9(006) COMP.        124800      
002079        05 S422-64-CTE-CVETEL2            PIC 9(002) COMP.        124900      
002080        05 S422-64-CTA-CVESTADOM          PIC 9(002) COMP.        125000      
002081        05 S422-64-CTR-CVEDOM             PIC 9(002) COMP.        125100      
002082        05 FILLER                         PIC X(28).              125200      
002083* SIZE SALIDA X(138).                                             125300      
002084*                                                                 125400      
002085 01  R422-64-CTR-ERROR                    PIC S9(11) BINARY.      125500      
002086*                                                                 125600      
002087***************************************************************   125700      
002088**** PARAMETROS S016_L422_CON_CTA_EJE (65)                 ****   125800      
002089**** PROCEDIMIENTO DE TIPO ENTERO                          ****   125900      
002090*****    CONSULTA B04CUENTAS, B07CTACTA CON OPCION        *****   126000      
002091***************************************************************   126100      
002092*                                                                 126200      
002093 01  E422-65-CTR-ENTRADA.                                         126300      
002094     03 E422-65-CTR-NUMCSI                PIC 9(002) COMP.        126400      
002095     03 E422-65-CTE-NUM                   PIC 9(012) COMP.        126500      
002096*     03 E422-65-CTA-NUMPROREL             PIC 9(004) COMP.       126600      
002097*     03 E422-65-CTA-CVEINSREL             PIC 9(002) COMP.       126700      
002098*     03 E422-65-CTA-NUMPREREL             PIC 9(004) COMP.       126800      
002099*     03 E422-65-CTA-NUMREL                PIC 9(012) COMP.       126900      
002100*                                                                 127000      
002101     03 E422-65-CTA-NUMPROD               PIC 9(004) COMP.        127100      
002102     03 E422-65-CTA-CVEINST               PIC 9(002) COMP.        127200      
002103     03 E422-65-CTA-NUMPREF               PIC 9(004) COMP.        127300      
002104     03 E422-65-CTA-NUM                   PIC 9(012) COMP.        127400      
002105     03 E422-65-CTA-CVRELCTA              PIC 9(002) COMP.        127500      
002106     03 E422-65-OPCION                    PIC 9(002) COMP.        127600      
002107     03 FILLER                            PIC X(40).              127700      
002108*  SIZE ENTRADA X(60).                                            127800      
002109*                                                                 127900      
002110 01  S422-65-CTR-SALIDA.                                          128000      
002111     03 S422-65-CTR-ERROR                 PIC 9(004) COMP.        128100      
002112     03 S422-65-CTR-ERRORTYPE             PIC 9(004) COMP.        128200      
002113     03 S422-65-CTR-STRUCTURE             PIC 9(004) COMP.        128300      
002114     03 S422-65-CTR-NUMCSI                PIC 9(002) COMP.        128400      
002115     03 S422-65-CTE-NUM                   PIC 9(012) COMP.        128500      
002116     03 S422-65-CTA-NUMPROD               PIC 9(004) COMP.        128600      
002117     03 S422-65-CTA-CVEINST               PIC 9(002) COMP.        128700      
002118     03 S422-65-CTA-NUMPREF               PIC 9(004) COMP.        128800      
002119     03 S422-65-CTA-NUM                   PIC 9(012) COMP.        128900      
002120     03 S422-65-CTR-CVERELCTA             PIC 9(002) COMP.        129000      
002121     03 S422-65-CTA-NUMPRODREL            PIC 9(004) COMP.        129100      
002122     03 S422-65-CTA-CVEINSREL             PIC 9(002) COMP.        129200      
002123     03 S422-65-CTA-NUMPREFREL            PIC 9(004) COMP.        129300      
002124     03 S422-65-CTA-NUMREL                PIC 9(012) COMP.        129400      
002125     03 S422-65-CTA-FECALTA-2K            PIC 9(008) COMP.        129500      
002126     03 S422-65-CTA-FECULTMOD-2K          PIC 9(008) COMP.        129600      
002127     03 FILLER                            PIC X(22).              129700      
002128* SIZE SALIDA X(66).                                              129800      
002129*                                                                 129900      
002130 77  R422-65-CTR-ERROR                   PIC S9(11) BINARY.       130000      
002131*                                                                 130100      
002132*********************************************************         130200      
002133**** PARAMETROS  S016_L422_CON_CTA_REL (66)           ***         130300      
002134**** PROCEDIMIENTO DE TIPO ENTERO                     ***         130400      
002135*****    CONSULTA B04CUENTAS, B07CTACTA             *****         130500      
002136*********************************************************         130600      
002137*                                                                 130700      
002138 01  E422-66-CTR-ENTRADA.                                         130800      
002139     03 E422-66-CTR-NUMCSI                PIC 9(002) COMP.        130900      
002140     03 E422-66-CTE-NUM                   PIC 9(012) COMP.        131000      
002141     03 E422-66-CTA-NUMPROD               PIC 9(004) COMP.        131100      
002142     03 E422-66-CTA-CVEINST               PIC 9(002) COMP.        131200      
002143     03 E422-66-CTA-NUMPREF               PIC 9(004) COMP.        131300      
002144     03 E422-66-CTA-NUM                   PIC 9(012) COMP.        131400      
002145     03 E422-66-CTR-CVRELCTA              PIC 9(002) COMP.        131500      
002146     03 E422-66-CTR-NUMPROREL             PIC 9(004) COMP.        131600      
002147     03 E422-66-CTR-CVEINSREL             PIC 9(002) COMP.        131700      
002148     03 FILLER                            PIC X(038).             131800      
002149* SIZE SALIDA X(60).                                              131900      
002150 01  S422-66-CTR-SALIDA.                                          132000      
002151     03 S422-66-CTR-ERROR                 PIC 9(004) COMP.        132100      
002152     03 S422-66-CTR-ERRORTYPE             PIC 9(004) COMP.        132200      
002153     03 S422-66-CTR-STRUCTURE             PIC 9(004) COMP.        132300      
002154     03 S422-66-CTR-NUMCSI                PIC 9(002) COMP.        132400      
002155     03 S422-66-CTE-NUM                   PIC 9(012) COMP.        132500      
002156     03 S422-66-CTA-NUMPROD               PIC 9(004) COMP.        132600      
002157     03 S422-66-CTA-CVEINST               PIC 9(002) COMP.        132700      
002158     03 S422-66-CTA-NUMPREF               PIC 9(004) COMP.        132800      
002159     03 S422-66-CTA-NUM                   PIC 9(012) COMP.        132900      
002160     03 S422-66-CTR-CVERELCTA             PIC 9(002) COMP.        133000      
002161     03 S422-66-CTA-NUMPRODREL            PIC 9(004) COMP.        133100      
002162     03 S422-66-CTA-CVEINSREL             PIC 9(002) COMP.        133200      
002163     03 S422-66-CTA-NUMPREFREL            PIC 9(004) COMP.        133300      
002164     03 S422-66-CTA-NUMREL                PIC 9(012) COMP.        133400      
002165     03 S422-66-CTA-FECALTA-2K            PIC 9(008) COMP.        133500      
002166     03 S422-66-CTA-FECULTMOD-2K          PIC 9(008) COMP.        133600      
002167     03 FILLER                            PIC X(22).              133700      
002168* SIZE SALIDA X(66).                                              133800      
002169 77  R422-66-CTR-ERROR                    PIC S9(11) BINARY.      133900      
002170*NO CUENTA CON FILLER SE AµADIERON 4 COMP.                        134000      
002171******************************************************************134100      
002172***     PARAMETROS    S016_L422_CON_S404 (67)              *******134200      
002173******************************************************************134300      
002174* S016_L422_CON_S404 (67)   existe en el archivo de parametros    134400      
002175*                        pero no existe el codigo                 134500      
002176*                                                                 134600      
002177 77  R422-67-CTR-ERROR                   PIC S9(11) BINARY.       134700      
002178*                                                                 134800      
002179 01  E422-67-CTR-ENTRADA.                                         134900      
002180     03 E422-67-CTA-NUMPREF               PIC 9(004) COMP.        135000      
002181     03 E422-67-CTA-NUM                   PIC 9(012) COMP.        135100      
002182     03 E422-67-CTA-NUMPROD               PIC 9(004) COMP.        135200      
002183     03 E422-67-CTA-CVEINST               PIC 9(002) COMP.        135300      
002184     03 FILLER                            PIC X(087).             135400      
002185*                                                                 135500      
002186 01  S422-67-CTR-SALIDA.                                          135600      
002187     03 S422-67-CTE-NUM           PIC 9(012) COMP.                135700      
002188*                                                                 135800      
002189     03 S422-67-CTE-NOMBRE        PIC X(055).                     135900      
002190     03 S422-67-CTE-CALLENUM      PIC X(036).                     136000      
002191     03 S422-67-CTE-NOMCOL        PIC X(024).                     136100      
002192     03 S422-67-CTE-NOMPOB        PIC X(020).                     136200      
002193     03 S422-67-CTE-CVEEDO        PIC 9(002) COMP.                136300      
002194     03 S422-67-CTE-NUMCP         PIC 9(006) COMP.                136400      
002195     03 S422-67-CTE-NUMTEL        PIC 9(010) COMP.                136500      
002196     03 S422-67-CTE-NUMTELEXT     PIC 9(006) COMP.                136600      
002197     03 S422-67-CTE-NUMTEL2       PIC 9(010) COMP.                136700      
002198     03 S422-67-CTE-NUMTELEX2     PIC 9(006) COMP.                136800      
002199     03 S422-67-CTE-CVESECTOR     PIC 9(002) COMP.                136900      
002200     03 S422-67-CTE-CVEACTBM      PIC 9(006) COMP.                137000      
002201     03 S422-67-CTE-CODINI        PIC X(004).                     137100      
002202     03 S422-67-CTE-FECNAC        PIC 9(006) COMP.                137200      
002203     03 S422-67-CTE-CODHOM        PIC X(005).                     137300      
002204     03 S422-67-CTE-CVENACION     PIC 9(002) COMP.                137400      
002205     03 S422-67-CTE-CVESEXO       PIC 9(002) COMP.                137500      
002206*                                                                 137600      
002207 01  S422-67-RCTR-SALIDA REDEFINES S422-67-CTR-SALIDA.            137700      
002208     03 S422-67-CTR-ERROR         PIC 9(004) COMP.                137800      
002209     03 S422-67-CTR-ERRORTYPE     PIC 9(004) COMP.                137900      
002210     03 S422-67-CTR-STRUCTURE     PIC 9(004) COMP.                138000      
002211     03 FILLER                    PIC X(161).                     138100      
002212*                                                                 138200      
002213***************************************************************   138300      
002214****   ENTRY POINT  S016_L422_CTE_GRALES (68)             *****   138400      
002215* INTEGER PROCEDURE S016_L422_CTE_GRALES( E422_68_CTR_ENTRADA *   138500      
002216******                                 ,S422_68_CTR_SALIDA); *    138600      
002217***************************************************************   138700      
002218**************  Sin parametros !!!                                138800      
002219****************************************************************  138900      
002220****   ENTRY POINT S016_L422_CTE_NOMCORTO (69)            ******  139000      
002221* INTEGER PROCEDURE S016_L422_CTE_NOMCORTO( E422_69_CTR_ENTRADA*  139100      
002222********                                ,S422_69_CTR_SALIDA); **  139200      
002223****************************************************************  139300      
002224**************  Sin parametros !!!                                139400      
002225*************************************************************     139500      
002226**** PARAMETROS  S016_L422_CTE_DIREC (70)              ******     139600      
002227**** PROCEDIMIENTO DE TIPO ENTERO                      ******     139700      
002228***  CONSULTA B04, B02, B05, y B09BCAELEC CON OPCION.  ******     139800      
002229***  LOCALIZA DOMICILIO. COBRANZA, ESPECIAL DIGITEL Y PEMEX *     139900      
002230*************************************************************     140000      
002231*                                                                 140100      
002232 77  R422-70-CTR-ERROR                    PIC S9(11) BINARY.      140200      
002233*                                                                 140300      
002234 01  E422-70-CTR-ENTRADA.                                         140400      
002235     03 E422-70-CTA-NUMPROD               PIC 9(004) COMP.        140500      
002236     03 E422-70-CTR-NUMCSI                PIC 9(002) COMP.        140600      
002237     03 E422-70-CTA-NUMPREF               PIC 9(004) COMP.        140700      
002238     03 E422-70-CTA-NUM                   PIC 9(012) COMP.        140800      
002239     03 E422-70-CTE-NUM                   PIC 9(012) COMP.        140900      
002240     03 E422-70-CTA-CVEINST               PIC 9(002) COMP.        141000      
002241     03 E422-70-CTA-NUMDOM                PIC 9(002) COMP.        141100      
002242*   CTE-CVEENVIO, CTA-CVEENVIO, CTR-CVEENVIO:                     141200      
002243*   1 DOM.PRINCIPAL, 2 a 998 DOM. ADICIONAL,                      141300      
002244*    999 SUC. PROMOTORA, 1000 ENVIO ESPECIAL                      141400      
002245*    CTR-CVEDOM:                                                  141500      
002246*   1 DOM. PARTICULAR, 2 DOM. OFICINA,                            141600      
002247*   3 AP. POSTAL , 4 ESPECIAL SI DIGITEL EN TEL1                  141700      
002248*    SALDOS RADIOS LOCALIZADORES, SI COBRANZA PEMEX               141800      
002249*    TEL 1 ESTACION DE GASOLINA, TEL2 EMPRESAS.                   141900      
002250     03 E422-70-OPCION                    PIC 9(002) COMP.        142000      
002251     03 FILLER                            PIC X(039).             142100      
002252*SIZE ENTRADA (60).                                               142200      
002253*                                                                 142300      
002254 01  S422-70-CTR-SALIDA.                                          142400      
002255     03 S422-70-CTE-NOM                   PIC X(055).             142500      
002256* SOLO OBTIENE CUANDO EL DOMICILIO SE CONSULTA EN B01.            142600      
002257     03 S422-70-CTE-CALLENUM              PIC X(036).             142700      
002258     03 S422-70-CTE-NOMCOL                PIC X(024).             142800      
002259     03 S422-70-CTE-NOMPOB                PIC X(020).             142900      
002260     03 S422-70-CTE-NUMCP                 PIC 9(006) COMP.        143000      
002261     03 S422-70-CTR-CVEDOM                PIC 9(002) COMP.        143100      
002262     03 S422-70-CTE-CVEEDO                PIC 9(002) COMP.        143200      
002263     03 S422-70-CTE-NUMTEL                PIC 9(010) COMP.        143300      
002264     03 S422-70-CTE-NUMTELEXT             PIC 9(006) COMP.        143400      
002265     03 S422-70-DOM-ENVCOR                PIC 9(004) COMP.        143500      
002266     03 S422-70-CTE-CVETEL                PIC 9(002) COMP.        143600      
002267     03 S422-70-CTE-NUMTEL2               PIC 9(010) COMP.        143700      
002268     03 S422-70-CTE-NUMTELEX2             PIC 9(006) COMP.        143800      
002269     03 S422-70-CTE-CVETEL2               PIC 9(002) COMP.        143900      
002270     03 S422-70-CTA-CVESTADOM             PIC 9(002) COMP.        144000      
002271     03 S422-70-CTE-CVEPERS               PIC 9(002) COMP.        144100      
002272* SOLO OBTIENE CUANDO EL DOMICILIO SE CONSULTA EN B01.            144200      
002273     03 S422-70-CTE-SITUACION             PIC X(004).             144300      
002274* SOLO OBTIENE CUANDO EL DOMICILIO SE CONSULTA EN B01.            144400      
002275     03 FILLER                            PIC X(008).             144500      
002276* SIZE SALIDA X(174)                                              144600      
002277*                                                                 144700      
002278 01  S422-70-RCTR-SALIDA REDEFINES S422-70-CTR-SALIDA.            144800      
002279     03 S422-70-CTR-ERROR                 PIC 9(004) COMP.        144900      
002280     03 S422-70-CTR-ERRORTYPE             PIC 9(004) COMP.        145000      
002281     03 S422-70-CTR-STRUCTURE             PIC 9(004) COMP.        145100      
002282     03 FILLER                            PIC X(168).             145200      
002283*                                                                 145300      
002284***********                                                       145400      
002285*                                                                 145500      
002286*************************************************************     145600      
002287**** PARAMETROS  S016_L422_CTA_PREMIA (77)             ******     145700      
002288**** PROCEDIMIENTO DE TIPO ENTERO                          **     145800      
002289**** CONSULTA B04CUENTAS y B07CTACTA                       **     145900      
002290*************************************************************     146000      
002291*                                                                 146100      
002292 77  R422-77-CTR-ERROR                    PIC S9(11) BINARY.      146200      
002293*                                                                 146300      
002294 01  E422-77-CTR-ENTRADA.                                         146400      
002295     03 E422-77-CTR-NUMCSI                PIC 9(002) COMP.        146500      
002296     03 E422-77-CTA-NUMPROREL             PIC 9(004) COMP.        146600      
002297     03 E422-77-CTA-CVEINSREL             PIC 9(002) COMP.        146700      
002298     03 E422-77-CTA-NUMPREREL             PIC 9(004) COMP.        146800      
002299     03 E422-77-CTA-NUMREL                PIC 9(012) COMP.        146900      
002300     03 E422-77-CTA-NUMPROD               PIC 9(004) COMP.        147000      
002301     03 E422-77-CTA-CVEINST               PIC 9(002) COMP.        147100      
002302     03 E422-77-CTA-NUMPREF               PIC 9(004) COMP.        147200      
002303     03 E422-77-CTA-NUM                   PIC 9(012) COMP.        147300      
002304     03 E422-77-CTR-CVERELCTA             PIC 9(002) COMP.        147400      
002305     03 FILLER                            PIC X(36).              147500      
002306* SIZE ENTRADA X(60).                                             147600      
002307*                                                                 147700      
002308  01  S422-77-CTR-SALIDA.                                         147800      
002309     03 S422-77-CTR-NUMCSI                PIC 9(002) COMP.        147900      
002310     03 S422-77-CTE-NUM                   PIC 9(012) COMP.        148000      
002311     03 S422-77-CTA-NUMPROD               PIC 9(004) COMP.        148100      
002312     03 S422-77-CTA-CVEINST               PIC 9(002) COMP.        148200      
002313     03 S422-77-CTA-NUMPREF               PIC 9(004) COMP.        148300      
002314     03 S422-77-CTA-NUM                   PIC 9(012) COMP.        148400      
002315     03 S422-77-CTR-CVERELCTA             PIC 9(002) COMP.        148500      
002316     03 S422-77-CTA-NUMPRODREL            PIC 9(004) COMP.        148600      
002317     03 S422-77-CTA-CVEINSREL             PIC 9(002) COMP.        148700      
002318     03 S422-77-CTA-NUMPREFREL            PIC 9(004) COMP.        148800      
002319     03 S422-77-CTA-NUMREL                PIC 9(012) COMP.        148900      
002320     03 S422-77-CTA-FECALTA-2K            PIC 9(008) COMP.        149000      
002321     03 S422-77-CTA-FECULTMOD-2K          PIC 9(008) COMP.        149100      
002322     03 FILLER                            PIC X(016).             149200      
002323* SIZE SALIDA X(54)                                               149300      
002324 01  S422-77-RCTR-SALIDA REDEFINES S422-77-CTR-SALIDA.            149400      
002325     03 S422-77-CTR-ERROR                 PIC 9(004) COMP.        149500      
002326     03 S422-77-CTR-ERRORTYPE             PIC 9(004) COMP.        149600      
002327     03 S422-77-CTR-STRUCTURE             PIC 9(004) COMP.        149700      
002328     03 FILLER                            PIC 9(046) COMP.        149800      
002329*                                                                 149900      
002330*********************************************************         150000      
002331***    PARAMETROS  S016_L422_CON_XMEDIO  (78)         ***         150100      
002332****   CONSULTA B08MEDIOS                              **         150200      
002333*********************************************************         150300      
002334*                                                                 150400      
002335 77  R422-78-CTR-ERROR                   PIC S9(11) BINARY.       150500      
002336*                                                                 150600      
002337  01  E422-78-CTR-ENTRADA.                                        150700      
002338     03 E422-78-MDA-NUMERO                PIC 9(016) COMP.        150800      
002339     03 E422-78-MDA-RED     REDEFINES     E422-78-MDA-NUMERO.     150900      
002340        05 E422-78-MDA-NUMPREF            PIC 9(004) COMP.        151000      
002341        05 E422-78-MDA-NUM                PIC 9(012) COMP.        151100      
002342     03 FILLER                            PIC X(052).             151200      
002343* SIZE ENTRADA (60).*                                             151300      
002344  01  S422-78-CTR-SALIDA.                                         151400      
002345     03 S422-78-CTR-NUMCSI                PIC  9(002) COMP.       151500      
002346     03 S422-78-CTE-NUM                   PIC  9(012) COMP.       151600      
002347     03 S422-78-CTA-NUMPROD               PIC  9(004) COMP.       151700      
002348     03 S422-78-CTA-CVEINST               PIC  9(002) COMP.       151800      
002349     03 S422-78-CTA-NUMPREF               PIC  9(004) COMP.       151900      
002350     03 S422-78-CTA-NUM                   PIC  9(012) COMP.       152000      
002351     03 S422-78-MDA-CVETIPO               PIC  9(002) COMP.       152100      
002352     03 S422-78-MDA-SUBTIPO               PIC  9(002) COMP.       152200      
002353     03 S422-78-MDA-CVETIT                PIC  9(002) COMP.       152300      
002354     03 S422-78-MDA-NUMPREF               PIC  9(004) COMP.       152400      
002355     03 S422-78-MDA-NUM                   PIC  9(012) COMP.       152500      
002356     03 S422-78-MDA-ABRPROFT              PIC  X(003).            152600      
002357     03 S422-78-CTR-PTRNOMT               PIC  9(004) COMP.       152700      
002358     03 S422-78-MDA-ABRPROFC              PIC  X(003).            152800      
002359     03 S422-78-CTR-PTRNOMC               PIC  9(004) COMP.       152900      
002360     03 S422-78-MDA-NUMTALON              PIC  9(002) COMP.       153000      
002361     03 S422-78-MDA-CHQXTALON             PIC  9(002) COMP.       153100      
002362     03 S422-78-MDA-CVEPIN                PIC  9(006) COMP.       153200      
002363     03 S422-78-MDA-CVESTATUS             PIC  9(002) COMP.       153300      
002364     03 S422-78-MDA-FECALTA-2K            PIC  9(008) COMP.       153400      
002365     03 S422-78-MDA-FECULTMOD-2K          PIC  9(008) COMP.       153500      
002366     03 S422-78-MDA-FECULTACC-2K          PIC  9(008) COMP.       153600      
002367     03 S422-78-MDA-FECVENC-2K            PIC  9(008) COMP.       153700      
002368     03 S422-78-MDA-FECCANCEL-2K          PIC  9(008) COMP.       153800      
002369     03 S422-78-MDA-FECPREV               PIC  9(006) COMP.       153900      
002370     03 S422-78-MDA-FECMODPIN-2K          PIC  9(008) COMP.       154000      
002371     03 S422-78-MDA-HHPREV                PIC  9(004) COMP.       154100      
002372     03 S422-78-MDA-HHALTA                PIC  9(004) COMP.       154200      
002373     03 S422-78-MDA-HHULTMOD              PIC  9(004) COMP.       154300      
002374     03 S422-78-MDA-HHULTACC              PIC  9(004) COMP.       154400      
002375     03 S422-78-MDA-HHVENC                PIC  9(004) COMP.       154500      
002376     03 S422-78-MDA-PERIODO               PIC  9(002) COMP.       154600      
002377     03 S422-78-MDA-SITUACION             PIC  X(004).            154700      
002378     03 FILLER                            PIC  X(021).            154800      
002379* SIZE SALIDA X(108).                                             154900      
002380*                                                                 155000      
002381 01  S422-78-RCTR-SALIDA REDEFINES S422-78-CTR-SALIDA.            155100      
002382*                                                                 155200      
002383     03 S422-78-CTR-ERROR                 PIC 9(004) COMP.        155300      
002384     03 S422-78-CTR-ERRORTYPE             PIC 9(004) COMP.        155400      
002385     03 S422-78-CTR-STRUCTURE             PIC 9(004) COMP.        155500      
002386     03 FILLER                            PIC 9(102) COMP.        155600      
002387*                                                                 155700      
002388***********************************************************       155800      
002389***      PARAMETROS S016_L422_FINAPE (79)               ***       155900      
002390****     CONSULTA B23FINAPE                              **       156000      
002391***********************************************************       156100      
002392*                                                                 156200      
002393 77  R422-79-CTR-ERROR                    PIC S9(11) BINARY.      156300      
002394*                                                                 156400      
002395 01  E422-79-CTR-ENTRADA.                                         156500      
002396     03 E422-79-CTE-CODINI                PIC X(004).             156600      
002397     03 E422-79-CTE-FECNAC                PIC 9(006) COMP.        156700      
002398     03 E422-79-CTE-CODHOM                PIC X(005).             156800      
002399     03 E422-79-CTE-NUM                   PIC 9(012) COMP.        156900      
002400     03 E422-79-CTA-NUMPROD               PIC 9(004) COMP.        157000      
002401     03 E422-79-CTA-CVEINST               PIC 9(004) COMP.        157100      
002402     03 E422-79-CTA-NUMPREF               PIC 9(004) COMP.        157200      
002403     03 E422-79-CTA-NUM                   PIC 9(012) COMP.        157300      
002404     03 FILLER                            PIC X(018).             157400      
002405* SIZE ENTRADA X(60).                                             157500      
002406*                                                                 157600      
002407  01  S422-79-CTR-SALIDA.                                         157700      
002408     03 S422-79-CTE-NUM                   PIC 9(012)    COMP.     157800      
002409     03 S422-79-CTE-CODINI                PIC X(004).             157900      
002410     03 S422-79-CTE-FECNAC                PIC 9(006)    COMP.     158000      
002411     03 S422-79-CTE-CODHOM                PIC X(005).             158100      
002412     03 S422-79-CTE-SWIFT                 PIC X(011).             158200      
002413     03 S422-79-CTE-TELEX                 PIC X(033).             158300      
002414     03 S422-79-CTE-NUMVENC               PIC 9(002)    COMP.     158400      
002415     03 S422-79-CTE-SECTOR                PIC 9(002)    COMP.     158500      
002416     03 S422-79-CTE-CAEB                  PIC 9(006)    COMP.     158600      
002417     03 S422-79-CTE-STAFIN                PIC 9(002)    COMP.     158700      
002418     03 S422-79-CTE-RIEBNM                PIC X(002).             158800      
002419     03 S422-79-CTE-RIEBM                 PIC X(002).             158900      
002420     03 S422-79-CTE-VENTAS                PIC 9(014)    COMP.     159000      
002421     03 S422-79-CTE-CALIF  OCCURS 6 TIMES.                        159100      
002422        05 S422-79-CTE-ACUM               PIC 9(004)    COMP.     159200      
002423        05 S422-79-CTE-INMED              PIC 9(004)    COMP.     159300      
002424     03 S422-79-CTE-MONVEN                PIC 9(012)    COMP.     159400      
002425     03 S422-79-SALDO-JUNIO               PIC 9(012)    COMP.     159500      
002426     03 S422-79-SALDO-JULIO               PIC 9(012)    COMP.     159600      
002427     03 S422-79-CTE-NUMSOC                PIC 9(006)    COMP.     159700      
002428     03 S422-79-CTE-CVEDESFIN             PIC 9(4)V9(4) COMP.     159800      
002429     03 S422-79-CTE-CVEBANFIN             PIC 9(4)V9(4) COMP.     159900      
002430     03 S422-79-CTE-CVEGOBFIN             PIC 9(4)V9(4) COMP.     160000      
002431     03 S422-79-CTE-CVECONFIN             PIC 9(4)V9(4) COMP.     160100      
002432*   DESCUENTOS FOPYME TASA                                        160200      
002433     03 S422-79-CTE-CVEDESFOP             PIC 9(4)V9(4) COMP.     160300      
002434     03 S422-79-CTE-CVEBANFOP             PIC 9(4)V9(4) COMP.     160400      
002435     03 S422-79-CTE-CVEGOBFOP             PIC 9(4)V9(4) COMP.     160500      
002436     03 S422-79-CTE-CVECONFOP             PIC 9(4)V9(4) COMP.     160600      
002437*   DESCUENTOS FOPYME PAGO                                        160700      
002438     03 S422-79-CTE-DESFOPAGO             PIC 9(4)V9(4) COMP.     160800      
002439     03 S422-79-CTE-BANFOPAGO             PIC 9(4)V9(4) COMP.     160900      
002440     03 S422-79-CTE-GOBFOPAGO             PIC 9(4)V9(4) COMP.     161000      
002441     03 S422-79-CTE-CONFOPAGO             PIC 9(4)V9(4) COMP.     161100      
002442     03 S422-79-CTE-FECSUSP               PIC 9(008)    COMP.     161200      
002443     03 S422-79-CTE-FECALTA               PIC 9(008)    COMP.     161300      
002444     03 S422-79-CTE-FECULTMOD             PIC 9(008)    COMP.     161400      
002445     03 FILLER                            PIC X(020).             161500      
002446*  SIZE SALIDA X(204).                                            161600      
002447*                                                                 161700      
002448  01  S422-79-RCTR-SALIDA REDEFINES S422-79-CTR-SALIDA.           161800      
002449     03 S422-79-CTR-ERROR                 PIC 9(004)    COMP.     161900      
002450     03 S422-79-CTR-ERRORTYPE             PIC 9(004)    COMP.     162000      
002451     03 S422-79-CTR-STRUCTURE             PIC 9(004)    COMP.     162100      
002452     03 FILLER                            PIC X(198).             162200      
002453*                                                                 162300      
002454******************************************************************162400      
002455***    PARAMETROS  S016_L422_DIACORTE(80)                      ***162500      
002456****   CONSULTA B04CUENTAS MULTIPLE NUMREG SOLO S               **162600      
002457******************************************************************162700      
002458*                                                                 162800      
002459  77  R422-80-CTR-ERROR                    PIC S9(11) BINARY.     162900      
002460*                                                                 163000      
002461  01  E422-80-CTR-ENTRADA.                                        163100      
002462     03 E422-80-CTA-DIACORTE              PIC 9(002) COMP.        163200      
002463     03 E422-80-CTA-NUMPROD               PIC 9(004) COMP.        163300      
002464     03 E422-80-CTA-CVEINST               PIC 9(002) COMP.        163400      
002465     03 E422-80-CTA-NUMPREF               PIC 9(004) COMP.        163500      
002466     03 E422-80-CTA-NUM                   PIC 9(012) COMP.        163600      
002467     03 FILLER                            PIC X(48).              163700      
002468* SIZE ENTRADA (60).                                              163800      
002469*                                                                 163900      
002470  01  S422-80-CTR-SALIDA.                                         164000      
002471     03 S422-80-CTR-NUMREG        PIC 9(002) COMP.                164100      
002472     03 S422-80-CTR-OCC OCCURS 20.                                164200      
002473        05 S422-80-CTR-NUMCSI     PIC 9(002) COMP.                164300      
002474        05 S422-80-CTA-NUMPROD    PIC 9(004) COMP.                164400      
002475        05 S422-80-CTA-CVEINST    PIC 9(002) COMP.                164500      
002476        05 S422-80-CTA-NUMSUC     PIC 9(004) COMP.                164600      
002477        05 S422-80-CTA-NUMPREF    PIC 9(004) COMP.                164700      
002478        05 S422-80-CTA-NUM        PIC 9(012) COMP.                164800      
002479        05 S422-80-CTE-NUM        PIC 9(012) COMP.                164900      
002480        05 S422-80-CTA-DIACORTE   PIC 9(002) COMP.                165000      
002481        05 S422-80-CTA-CVEMONEDA  PIC 9(002) COMP.                165100      
002482        05 S422-80-CTA-CVEENVIO   PIC 9(004) COMP.                165200      
002483        05 S422-80-CTA-EDIEDOCTA  PIC 9(002) COMP.                165300      
002484        05 S422-80-CTA-CVESTATUS  PIC 9(002) COMP.                165400      
002485        05 S422-80-CTA-CVEUSO     PIC 9(002) COMP.                165500      
002486        05 S422-80-CTA-FECAPER    PIC 9(008) COMP.                165600      
002487        05 S422-80-CTA-FECULTMOD  PIC 9(008) COMP.                165700      
002488        05 S422-80-CTA-FECCANCEL  PIC 9(008) COMP.                165800      
002489        05 S422-80-CTA-SITUACION  PIC X(004).                     165900      
002490        05 FILLER                 PIC X(011).                     166000      
002491*      SIZE reg OCCURS X(54)                                      166100      
002492* SIZE SALIDA = 1+(54*20) = 1081                                  166200      
002493*                                                                 166300      
002494  01  S422-80-RCTR-SALIDA REDEFINES S422-80-CTR-SALIDA.           166400      
002495     03 S422-80-CTR-ERROR         PIC 9(004) COMP.                166500      
002496     03 S422-80-CTR-ERRORTYPE     PIC 9(004) COMP.                166600      
002497     03 S422-80-CTR-STRUCTURE     PIC 9(004) COMP.                166700      
002498     03 FILLER                    PIC X(1075).                    166800      
002499*                                                                 166900      
002500*                                                                 167000      
002501******************************************************************167100      
002502***    PARAMETROS   S016_L422_PRODINS (81)                     ***167200      
002503****   CONSULTA B04CUENTAS MULTIPLE NUMREG SOLO S               **167300      
002504******************************************************************167400      
002505*                                                                 167500      
002506  77  R422-81-CTR-ERROR                    PIC S9(11) BINARY.     167600      
002507*                                                                 167700      
002508  01  E422-81-CTR-ENTRADA.                                        167800      
002509     03 E422-81-CTR-NUMCSI                PIC 9(002) COMP.        167900      
002510     03 E422-81-CTA-NUMPROD               PIC 9(004) COMP.        168000      
002511     03 E422-81-CTA-CVEINST               PIC 9(002) COMP.        168100      
002512     03 E422-81-CTA-NUMPREF               PIC 9(004) COMP.        168200      
002513     03 E422-81-CTA-NUM                   PIC 9(012) COMP.        168300      
002514     03 FILLER                            PIC X(48).              168400      
002515* SIZE ENTRADA X(60).                                             168500      
002516*                                                                 168600      
002517  01  S422-81-CTR-SALIDA.                                         168700      
002518     03 S422-81-CTR-NUMREG        PIC 9(002) COMP.                168800      
002519     03 S422-81-CTR-OCC OCCURS 50.                                168900      
002520        05 S422-81-CTR-NUMCSI     PIC 9(002) COMP.                169000      
002521        05 S422-81-CTA-NUMPROD    PIC 9(004) COMP.                169100      
002522        05 S422-81-CTA-CVEINST    PIC 9(002) COMP.                169200      
002523        05 S422-81-CTA-NUMSUC     PIC 9(004) COMP.                169300      
002524        05 S422-81-CTA-NUMPREF    PIC 9(004) COMP.                169400      
002525        05 S422-81-CTA-NUM        PIC 9(012) COMP.                169500      
002526        05 S422-81-CTE-NUM        PIC 9(012) COMP.                169600      
002527        05 S422-81-CTA-DIACORTE   PIC 9(002) COMP.                169700      
002528        05 S422-81-CTA-CVEMONEDA  PIC 9(002) COMP.                169800      
002529        05 S422-81-CTA-CVEMANEJO  PIC 9(002) COMP.                169900      
002530        05 S422-81-CTE-CVESTATUS  PIC 9(002) COMP.                170000      
002531        05 S422-81-CTA-CVEUSO     PIC 9(002) COMP.                170100      
002532        05 S422-81-CTA-RESTRIC    PIC 9(002) COMP.                170200      
002533        05 S422-81-CTA-RESTCON    PIC 9(002) COMP.                170300      
002534        05 S422-81-CTA-OPCPAGO    PIC 9(002) COMP.                170400      
002535        05 S422-81-CTE-RGOPAGO    PIC 9(002) COMP.                170500      
002536        05 S422-81-CTA-FECAPER    PIC 9(008) COMP.                170600      
002537        05 S422-81-CTA-FECULTMOD  PIC 9(008) COMP.                170700      
002538        05 S422-81-CTE-FECCANCEL  PIC 9(008) COMP.                170800      
002539        05 FILLER                 PIC X(007).                     170900      
002540*      SIZE reg OCCURS X(48)                                      171000      
002541* SIZE SALIDA = 1+(48*50) = 2401                                  171100      
002542*                                                                 171200      
002543  01  S422-81-RCTR-SALIDA REDEFINES S422-81-CTR-SALIDA.           171300      
002544     03 S422-81-CTR-ERROR         PIC 9(004) COMP.                171400      
002545     03 S422-81-CTR-ERRORTYPE     PIC 9(004) COMP.                171500      
002546     03 S422-81-CTR-STRUCTURE     PIC 9(004) COMP.                171600      
002547     03 FILLER                    PIC X(2395).                    171700      
002548*                                                                 171800      
002549***************************************************************** 171900      
002550***    PARAMETROS   S016_L422_XCTECTA (82)                   **** 172000      
002551****   CONSULTA B05CTECTA CON OPCION                           ** 172100      
002552***************************************************************** 172200      
002553*                                                                 172300      
002554  77  R422-82-CTR-ERROR                    PIC S9(11) BINARY.     172400      
002555*                                                                 172500      
002556  01  E422-82-CTR-ENTRADA.                                        172600      
002557     03 E422-82-CTR-NUMCSI                PIC 9(002) COMP.        172700      
002558     03 E422-82-CTE-NUM                   PIC 9(012) COMP.        172800      
002559     03 E422-82-CTA-NUMPROD               PIC 9(004) COMP.        172900      
002560     03 E422-82-CTA-CVEINST               PIC 9(004) COMP.        173000      
002561     03 E422-82-CTA-NUMPREF               PIC 9(004) COMP.        173100      
002562     03 E422-82-CTA-NUM                   PIC 9(012) COMP.        173200      
002563     03 E422-82-OPCION                    PIC 9(002) COMP.        173300      
002564     03 FILLER                            PIC X(20).              173400      
002565* SIZE ENTRADA X(60)*                                             173500      
002566  01  S422-82-CTR-SALIDA.                                         173600      
002567     03 S422-82-CTR-NUMCSI        PIC 9(002) COMP.                173700      
002568     03 S422-82-CTE-NUM           PIC 9(012) COMP.                173800      
002569     03 S422-82-CTA-NUMPROD       PIC 9(004) COMP.                173900      
002570     03 S422-82-CTA-CVEINST       PIC 9(004) COMP.                174000      
002571     03 S422-82-CTA-NUMPREF       PIC 9(004) COMP.                174100      
002572     03 S422-82-CTA-NUM           PIC 9(012) COMP.                174200      
002573     03 S422-82-CTA-NUMSUC        PIC 9(004) COMP.                174300      
002574     03 S422-82-CTA-RELCTE        PIC 9(002) COMP.                174400      
002575     03 S422-82-CTA-USOBCAELE     PIC 9(002) COMP.                174500      
002576     03 S422-82-CTA-ASOCIADAX     PIC 9(002) COMP.                174600      
002577     03 S422-82-CTA-FEALTACTE     PIC 9(008) COMP.                174700      
002578     03 S422-82-CTA-FEMODCTE      PIC 9(008) COMP.                174800      
002579     03 S422-82-CTA-3DIGITOS      PIC 9(004) COMP.                174900      
002580     03 FILLER                    PIC X(20).                      175000      
002581* SIZE SALIDA X(54)*                                              175100      
002582*                                                                 175200      
002583  01  S422-82-RCTR-SALIDA REDEFINES S422-82-CTR-SALIDA.           175300      
002584     03 S422-82-CTR-ERROR         PIC 9(004) COMP.                175400      
002585     03 S422-82-CTR-ERRORTYPE     PIC 9(004) COMP.                175500      
002586     03 S422-82-CTR-STRUCTURE     PIC 9(004) COMP.                175600      
002587     03 FILLER                    PIC X(048).                     175700      
002588*                                                                 175800      
002589******************************************************************175900      
002590***    PARAMETROS  S016_L422_B04SXCTAPRD (83)                  ***176000      
002591****   CONSULTA B04CUENTAS CON OPCION                           **176100      
002592******************************************************************176200      
002593*                                                                 176300      
002594 77  R422-83-CTR-ERROR                   PIC S9(11) BINARY.       176400      
002595*                                                                 176500      
002596 01  E422-83-CTR-ENTRADA.                                         176600      
002597     03 E422-83-CTA-NUMPREF               PIC 9(004) COMP.        176700      
002598     03 E422-83-CTA-NUM                   PIC 9(012) COMP.        176800      
002599     03 E422-83-CTA-NUMPROD               PIC 9(004) COMP.        176900      
002600     03 E422-83-CTA-CVEINST               PIC 9(004) COMP.        177000      
002601     03 E422-83-OPCION                    PIC 9(002) COMP.        177100      
002602     03 FILLER                            PIC X(047).             177200      
002603* SIZE ENTRADA X(60)*                                             177300      
002604*                                                                 177400      
002605*                                                                 177500      
002606 01  S422-83-CTR-SALIDA.                                          177600      
002607     03 S422-83-CTR-NUMCSI                PIC 9(002) COMP.        177700      
002608     03 S422-83-CTA-NUMPROD               PIC 9(004) COMP.        177800      
002609     03 S422-83-CTA-CVEINST               PIC 9(004) COMP.        177900      
002610     03 S422-83-CTA-NUMSUC                PIC 9(004) COMP.        178000      
002611     03 S422-83-CTA-NUMPREF               PIC 9(004) COMP.        178100      
002612     03 S422-83-CTA-NUM                   PIC 9(012) COMP.        178200      
002613     03 S422-83-CTE-NUM                   PIC 9(012) COMP.        178300      
002614     03 S422-83-CTA-DIACORTE              PIC 9(002) COMP.        178400      
002615     03 S422-83-CTA-CVEMONEDA             PIC 9(002) COMP.        178500      
002616     03 S422-83-CTA-CVEENVIO              PIC 9(004) COMP.        178600      
002617     03 S422-83-CTA-EDIEDOCTA             PIC 9(002) COMP.        178700      
002618     03 S422-83-CTA-CVEMANEJO             PIC 9(002) COMP.        178800      
002619     03 S422-83-CTA-CVESTATUS             PIC 9(002) COMP.        178900      
002620     03 S422-83-CTA-CVEUSO                PIC 9(002) COMP.        179000      
002621     03 S422-83-CTA-RESTRIC               PIC 9(002) COMP.        179100      
002622     03 S422-83-CTA-RESTCON               PIC 9(002) COMP.        179200      
002623     03 S422-83-CTA-OPCPAGO               PIC 9(002) COMP.        179300      
002624     03 S422-83-CTA-RGOPAGO               PIC 9(002) COMP.        179400      
002625     03 S422-83-CTA-FECAPER               PIC 9(008) COMP.        179500      
002626     03 S422-83-CTA-FECULTMOD             PIC 9(008) COMP.        179600      
002627     03 S422-83-CTA-FECCANCEL             PIC 9(008) COMP.        179700      
002628     03 S422-83-CTA-REFECVE               PIC 9(002) COMP.        179800      
002629     03 S422-83-CTA-VENDNOMI              PIC 9(010) COMP.        179900      
002630     03 S422-83-CTA-REFENOMI              PIC 9(010) COMP.        180000      
002631     03 S422-83-CTA-DISEDOCTA             PIC 9(002) COMP.        180100      
002632     03 FILLER                            PIC X(09).              180200      
002633* SIZE SALIDA X(66)*                                              180300      
002634*                                                                 180400      
002635*                                                                 180500      
002636 01  S422-83-RCTR-SALIDA REDEFINES S422-83-CTR-SALIDA.            180600      
002637     03 S422-83-CTR-ERROR                 PIC 9(004) COMP.        180700      
002638     03 S422-83-CTR-ERRORTYPE             PIC 9(004) COMP.        180800      
002639     03 S422-83-CTR-STRUCTURE             PIC 9(004) COMP.        180900      
002640     03 FILLER                            PIC X(60).              181000      
002641*                                                                 181100      
002642******************************************************************181200      
002643***    PARAMETROS  S016_L422_B01SXCTE    (84)                  ***181300      
002644****   CONSULTA B01CLIENTES y B04CUENTAS CON OPCION             **181400      
002645** INFOWARE PROYECTO SHJ AGOSTO DEL 2011 (XRFC)             SHJ **181500      
002646******************************************************************181600      
002647*                                                                 181700      
002648 77  R422-84-CTR-ERROR                   PIC S9(11) BINARY.       181800      
002649*                                                                 181900      
002650 01  E422-84-CTR-ENTRADA.                                         182000      
002651     03 E422-84-CTE-NUM                   PIC 9(012) COMP.        182100      
002652     03 E422-84-CTA-NUMPROD               PIC 9(004) COMP.        182200      
002653     03 E422-84-CTA-CVEINST               PIC 9(004) COMP.        182300      
002654     03 E422-84-CTA-NUMPREF               PIC 9(004) COMP.        182400      
002655     03 E422-84-CTA-NUM                   PIC 9(012) COMP.        182500      
002656     03 E422-84-OPCION                    PIC 9(002) COMP.        182600      
002657     03 E422-84-CTR-CSI                   PIC 9(002) COMP.        182700      
002658***** INICIO MODIFICACION XRFC *****                              182800      
002659     03 E422-84-CTE-CODINI                PIC X(004).             182900      
002660     03 E422-84-CTE-FECNAC                PIC 9(006) COMP.        183000      
002661     03 E422-84-CTE-CODHOM                PIC X(005).             183100      
002662*********************************************************         183200      
002663     03 FILLER                            PIC X(028).             183300      
002664* SIZE ENTRADA X(60)*                                             183400      
002665*                                                                 183500      
002666 01  S422-84-CTR-SALIDA.                                          183600      
002667     03 S422-84-CTE-NUM                   PIC 9(012) COMP.        183700      
002668     03 S422-84-CTE-NOM                   PIC X(055).             183800      
002669     03 S422-84-CTE-CALLENUM              PIC X(036).             183900      
002670     03 S422-84-CTE-NOMCOL                PIC X(024).             184000      
002671     03 S422-84-CTE-NOMPOB                PIC X(020).             184100      
002672     03 S422-84-CTE-CVEEDO                PIC 9(002) COMP.        184200      
002673     03 S422-84-CTE-NUMCP                 PIC 9(006) COMP.        184300      
002674     03 S422-84-CTE-NUMTEL                PIC 9(010) COMP.        184400      
002675     03 S422-84-CTE-NUMTELEXT             PIC 9(006) COMP.        184500      
002676     03 S422-84-CTE-CVETEL                PIC 9(002) COMP.        184600      
002677     03 S422-84-CTE-NUMTEL2               PIC 9(010) COMP.        184700      
002678     03 S422-84-CTE-NUMTELEX2             PIC 9(006) COMP.        184800      
002679     03 S422-84-CTE-CVETEL2               PIC 9(002) COMP.        184900      
002680     03 S422-84-CTR-CVESTADOM             PIC 9(002) COMP.        185000      
002681     03 S422-84-CTR-CVEDOM                PIC 9(002) COMP.        185100      
002682     03 S422-84-CTR-NUMDOMS               PIC 9(004) COMP.        185200      
002683     03 S422-84-CTE-CVEPERS               PIC 9(002) COMP.        185300      
002684     03 S422-84-CTE-CVETIPO               PIC 9(002) COMP.        185400      
002685     03 S422-84-CTE-NUMCLASIF             PIC 9(002) COMP.        185500      
002686     03 S422-84-CTE-CODINI                PIC X(004).             185600      
002687     03 S422-84-CTE-FECNAC                PIC 9(006) COMP.        185700      
002688     03 S422-84-CTE-CODHOM                PIC X(005).             185800      
002689     03 S422-84-CTE-CVENACION             PIC 9(002) COMP.        185900      
002690     03 S422-84-CTE-CVESEXO               PIC 9(002) COMP.        186000      
002691     03 S422-84-CTE-FECNACIM-2K           PIC 9(008) COMP.        186100      
002692     03 S422-84-CTE-CAEB                  PIC 9(006) COMP.        186200      
002693     03 S422-84-CTE-CVEACTBM              PIC 9(006) COMP.        186300      
002694     03 S422-84-CTE-EDOCTACON             PIC 9(002) COMP.        186400      
002695     03 S422-84-CTE-CVESECTOR             PIC 9(002) COMP.        186500      
002696     03 S422-84-CTE-CVEPERBCO             PIC 9(002) COMP.        186600      
002697     03 S422-84-CTE-CVESEG                PIC 9(002) COMP.        186700      
002698     03 S422-84-CTE-DIACORTE              PIC 9(002) COMP.        186800      
002699     03 S422-84-CTE-CVEENVIO              PIC 9(004) COMP.        186900      
002700     03 S422-84-CTE-NUMOFICON             PIC 9(004) COMP.        187000      
002701*  NUMOFICON ES EQUIVALENTE A SUCURSAL PROMOTORA                  187100      
002702     03 S422-84-CTE-CVESTATUS             PIC 9(002) COMP.        187200      
002703     03 S422-84-OFI-NUMCSIALT             PIC 9(002) COMP.        187300      
002704     03 S422-84-CTE-FECALTA               PIC 9(008) COMP.        187400      
002705     03 S422-84-CTE-FECULTMOD             PIC 9(008) COMP.        187500      
002706     03 S422-84-CTE-NUMUNIMER             PIC 9(004) COMP.        187600      
002707     03 S422-84-CTE-RIEBNM                PIC X(002).             187700      
002708     03 S422-84-CTE-RIEBM                 PIC X(002).             187800      
002709     03 S422-84-CTE-OCUPACION             PIC 9(002) COMP.        187900      
002710     03 S422-84-CTE-CVEPUB                PIC 9(002) COMP.        188000      
002711     03 S422-84-CTE-SITUACION             PIC X(004).             188100      
002712     03 S422-84-CTE-FECPREV               PIC 9(006) COMP.        188200      
002713     03 S422-84-CTE-RECEPSUC6             PIC 9(004) COMP.        188300      
002714     03 S422-84-CTE-HHRECEP6              PIC 9(004) COMP.        188400      
002715     03 FILLER                            PIC X(014).             188500      
002716* SIZE SALIDA X(246)*                                             188600      
002717*                                                                 188700      
002718*                                                                 188800      
002719  01  S422-84-RCTR-SALIDA REDEFINES S422-84-CTR-SALIDA.           188900      
002720     03 S422-84-CTR-ERROR                 PIC 9(004)    COMP.     189000      
002721     03 S422-84-CTR-ERRORTYPE             PIC 9(004)    COMP.     189100      
002722     03 S422-84-CTR-STRUCTURE             PIC 9(004)    COMP.     189200      
002723     03 FILLER                            PIC X(240).             189300      
002724******************************************************************189400      
002725***   PARAMETROS  S016_L422_B09SXCTESISTIP (85)                ***189500      
002726****   CONSULTA B09BCAELEC CON OPCION                           **189600      
002727******************************************************************189700      
002728*                                                                 189800      
002729   77  R422-85-CTR-ERROR                 PIC S9(11) BINARY.       189900      
002730*                                                                 190000      
002731  01  E422-85-CTR-ENTRADA.                                        190100      
002732     03 E422-85-CTR-NUMCSI                PIC 9(002) COMP.        190200      
002733     03 E422-85-CTE-NUM                   PIC 9(012) COMP.        190300      
002734     03 E422-85-SER-NUM                   PIC 9(004) COMP.        190400      
002735     03 E422-85-SER-CVETIPO               PIC 9(002) COMP.        190500      
002736     03 E422-85-OPCION                    PIC 9(002) COMP.        190600      
002737     03 FILLER                            PIC X(048).             190700      
002738* SIZE ENTRADA X(60)*                                             190800      
002739*                                                                 190900      
002740*                                                                 191000      
002741 01 S422-85-CTR-SALIDA.                                           191100      
002742      03 S422-85-CTR-NUMCSI               PIC 9(002) COMP.        191200      
002743      03 S422-85-CTE-NUM                  PIC 9(012) COMP.        191300      
002744      03 S422-85-SER-NUM                  PIC 9(004) COMP.        191400      
002745      03 S422-85-SER-CVETIPO              PIC 9(002) COMP.        191500      
002746      03 S422-85-SER-CVEDISP              PIC 9(004) COMP.        191600      
002747      03 S422-85-SER-NOMESTA              PIC X(008).             191700      
002748      03 S422-85-SER-NUMSUCPR             PIC 9(004) COMP.        191800      
002749      03 S422-85-CTA-NUMPROD              PIC 9(004) COMP.        191900      
002750      03 S422-85-CTA-CVEINST              PIC 9(004) COMP.        192000      
002751      03 S422-85-CTA-NUMPREF              PIC 9(004) COMP.        192100      
002752      03 S422-85-CTA-NUM                  PIC 9(012) COMP.        192200      
002753      03 S422-85-SER-COBCOM1              PIC 9(002) COMP.        192300      
002754      03 S422-85-SER-COBCOM2              PIC 9(002) COMP.        192400      
002755      03 S422-85-SER-COBCOM3              PIC 9(002) COMP.        192500      
002756      03 S422-85-SER-COBCOM4              PIC 9(002) COMP.        192600      
002757      03 S422-85-SER-COBCOM5              PIC 9(002) COMP.        192700      
002758      03 S422-85-SER-COBCOM6              PIC 9(002) COMP.        192800      
002759      03 S422-85-SER-VERSOFT              PIC 9(004) COMP.        192900      
002760      03 S422-85-SER-PROPEQUI             PIC 9(002) COMP.        193000      
002761      03 S422-85-CTE-PIN                  PIC 9(004) COMP.        193100      
002762      03 S422-85-CTE-PINVER               PIC 9(002) COMP.        193200      
002763      03 S422-85-CTE-CVENOPIN             PIC 9(002) COMP.        193300      
002764      03 S422-85-SER-CVESTATUS            PIC 9(002) COMP.        193400      
002765      03 S422-85-CTR-CVEENVIO             PIC 9(004) COMP.        193500      
002766      03 S422-85-SER-DIACORTE             PIC 9(002) COMP.        193600      
002767      03 S422-85-SER-EDIEDOCTA            PIC 9(002) COMP.        193700      
002768      03 S422-85-SER-DISEDOCTA            PIC 9(002) COMP.        193800      
002769      03 S422-85-SER-FECONTRAT            PIC 9(008) COMP.        193900      
002770      03 S422-85-SER-FECRENOVA            PIC 9(008) COMP.        194000      
002771      03 S422-85-SER-FECCANCEL            PIC 9(008) COMP.        194100      
002772      03 S422-85-SER-FECULTMOD            PIC 9(008) COMP.        194200      
002773      03 S422-85-SER-FECMODPIN            PIC 9(008) COMP.        194300      
002774      03 S422-85-SER-FECULTMOV            PIC 9(008) COMP.        194400      
002775      03 S422-85-SER-FECINIOPE            PIC 9(008) COMP.        194500      
002776      03 FILLER                           PIC X(015).             194600      
002777* SIZE SALIDA X(96)                                               194700      
002778*                                                                 194800      
002779 01  S422-85-RCTR-SALIDA REDEFINES S422-85-CTR-SALIDA.            194900      
002780     03 S422-85-CTR-ERROR                 PIC 9(004)    COMP.     195000      
002781     03 S422-85-CTR-ERRORTYPE             PIC 9(004)    COMP.     195100      
002782     03 S422-85-CTR-STRUCTURE             PIC 9(004)    COMP.     195200      
002783     03 FILLER                            PIC X(090).             195300      
002784*                                                                 195400      
002785******************************************************************195500      
002786****  PARAMETROS S016_L422_NOMBRES_ADICIONALES (86)           ****195600      
002787****  CONSULTA  B01CLIENTES y B03NOMBRES MULTIPLE NUMREG SOLO S **195700      
002788******************************************************************195800      
002789*                                                                 195900      
002790 77  R422-86-CTR-ERROR                    PIC S9(11) BINARY.      196000      
002791*                                                                 196100      
002792 01  E422-86-CTR-ENTRADA.                                         196200      
002793     03 E422-86-CTE-NUM                   PIC 9(012) COMP.        196300      
002794     03 E422-86-CTR-NUMNOM                PIC 9(002) COMP.        196400      
002795     03 FILLER                            PIC X(052).             196500      
002796* SIZE ENTRADA X(60)*                                             196600      
002797*                                                                 196700      
002798 01  S422-86-CTR-SALIDA.                                          196800      
002799     03 S422-86-CTR-NUMREG                PIC 9(002) COMP.        196900      
002800     03 S422-86-CTR-NUMCSI                PIC 9(002) COMP.        197000      
002801     03 S422-86-CTE-NUM                   PIC 9(012) COMP.        197100      
002802     03 S422-86-OCCURS                    OCCURS 10 TIMES.        197200      
002803        05 S422-86-CTR-NUMNOM             PIC 9(004) COMP.        197300      
002804        05 S422-86-CTR-NOMUSOS            PIC 9(004) COMP.        197400      
002805        05 S422-86-CTE-NOMCORTO           PIC X(026).             197500      
002806        05 S422-86-CTE-CVETITCTE          PIC 9(002) COMP.        197600      
002807        05 S422-86-CTR-CVECONT            PIC 9(002) COMP.        197700      
002808        05 S422-86-CTR-FECALTNOM          PIC 9(008) COMP.        197800      
002809        05 S422-86-CTR-FECMODNOM          PIC 9(008) COMP.        197900      
002810        05 FILLER                         PIC X(026).             198000      
002811*      SIZE reg OCCURS X(66)                                      198100      
002812* SIZE SALIDA = 8+(66*10) = 668                                   198200      
002813*                                                                 198300      
002814 01  S422-86-RCTR-SALIDA REDEFINES S422-86-CTR-SALIDA.            198400      
002815     03 S422-86-CTR-ERROR                 PIC 9(004)    COMP.     198500      
002816     03 S422-86-CTR-ERRORTYPE             PIC 9(004)    COMP.     198600      
002817     03 S422-86-CTR-STRUCTURE             PIC 9(004)    COMP.     198700      
002818     03 FILLER                            PIC X(662).             198800      
002819*                                                                 198900      
002820******************************************************************199000      
002821*    PARAMETROS PARA EL ENTRY-POINT S016_L422_COTITULARES (87)   *199100      
002822**  CONSULTA  B01CLIENTES y B06COTITULAR MULTIPLE NUMREG SOLO S **199200      
002823******           CON OPCION                                    ***199300      
002824******************************************************************199400      
002825*                                                                 199500      
002826 77  R422-87-CTR-ERROR                    PIC S9(11) BINARY.      199600      
002827*                                                                 199700      
002828 01  E422-87-CTR-ENTRADA.                                         199800      
002829     03 E422-87-CTE-NUM                   PIC 9(012) COMP.        199900      
002830     03 E422-87-CTA-NUMPROD               PIC 9(004) COMP.        200000      
002831     03 E422-87-CTA-CVEINST               PIC 9(004) COMP.        200100      
002832     03 E422-87-CTA-NUMPREF               PIC 9(004) COMP.        200200      
002833     03 E422-87-CTA-NUM                   PIC 9(012) COMP.        200300      
002834     03 E422-87-CTR-NUMPTRNOM             PIC 9(004) COMP.        200400      
002835     03 E422-87-OPCION                    PIC 9(002) COMP.        200500      
002836     03 FILLER                            PIC X(039).             200600      
002837* SIZE ENTRADA X(60)*                                             200700      
002838*                                                                 200800      
002839 01  S422-87-CTR-SALIDA.                                          200900      
002840     03 S422-87-CTR-NUMCSI                PIC 9(002) COMP.        201000      
002841     03 S422-87-CTE-NUM                   PIC 9(012) COMP.        201100      
002842     03 S422-87-CTR-NUMREG                PIC 9(002) COMP.        201200      
002843     03 S422-87-OCCURS                    OCCURS 10 TIMES.        201300      
002844        05 S422-87-CTR-NUMMDA             PIC 9(002) COMP.        201400      
002845        05 S422-87-CTR-NUMPROD            PIC 9(004) COMP.        201500      
002846        05 S422-87-CTE-CVEINST            PIC 9(004) COMP.        201600      
002847        05 S422-87-CTA-NUMPREF            PIC 9(004) COMP.        201700      
002848        05 S422-87-CTA-NUM                PIC 9(012) COMP.        201800      
002849        05 S422-87-CTR-NUMPTRNOM          PIC 9(004) COMP.        201900      
002850        05 S422-87-CTR-FECALTNOM          PIC 9(008) COMP.        202000      
002851        05 S422-87-CTR-FECMODNOM          PIC 9(008) COMP.        202100      
002852        05 FILLER                         PIC X(007).             202200      
002853*      SIZE reg OCCURS X(30)                                      202300      
002854* SIZE SALIDA = 8+(30*10) = 308                                   202400      
002855*                                                                 202500      
002856 01  S422-87-RCTR-SALIDA REDEFINES S422-87-CTR-SALIDA.            202600      
002857     03 S422-87-CTR-ERROR                 PIC 9(004)    COMP.     202700      
002858     03 S422-87-CTR-ERRORTYPE             PIC 9(004)    COMP.     202800      
002859     03 S422-87-CTR-STRUCTURE             PIC 9(004)    COMP.     202900      
002860     03 FILLER                            PIC X(302).             203000      
002861*                                                                 203100      
002862******************************************************************203200      
002863*                S016_L422_B07SxCtaRelCte (88)                   *203300      
002864*** CONSULTA B04CUENTAS y B07CTACTA  CON OPCION               ****203400      
002865******************************************************************203500      
002866*                                                                 203600      
002867  77  R422-88-CTR-ERROR                   PIC S9(11) BINARY.      203700      
002868*                                                                 203800      
002869  01  E422-88-CTR-ENTRADA.                                        203900      
002870     03 E422-88-CTA-NUMPROREL             PIC 9(004) COMP.        204000      
002871     03 E422-88-CTA-CVEINSREL             PIC 9(004) COMP.        204100      
002872     03 E422-88-CTA-NUMCTOREL             PIC 9(016) COMP.        204200      
002873     03 E422-88-CTA-NUMCTORELRED REDEFINES E422-88-CTA-NUMCTOREL. 204300      
002874        05 E422-88-CTA-NUMPREREL          PIC 9(004) COMP.        204400      
002875        05 E422-88-CTA-NUMREL             PIC 9(012) COMP.        204500      
002876     03 E422-88-CTR-CVERELCTA             PIC 9(002) COMP.        204600      
002877     03 E422-88-CTA-NUMPROD               PIC 9(004) COMP.        204700      
002878     03 E422-88-CTA-CVEINST               PIC 9(004) COMP.        204800      
002879     03 E422-88-CTA-NUMCTO                PIC 9(016) COMP.        204900      
002880     03 E422-88-CTA-NUMCTORED REDEFINES E422-88-CTA-NUMCTO.       205000      
002881        05 E422-88-CTA-NUMPREF            PIC 9(004) COMP.        205100      
002882        05 E422-88-CTA-NUM                PIC 9(012) COMP.        205200      
002883     03 E422-88-OPCION                    PIC 9(002) COMP.        205300      
002884     03 FILLER                            PIC X(034).             205400      
002885* SIZE ENTRADA X(60)*                                             205500      
002886*                                                                 205600      
002887 01  S422-88-CTR-SALIDA.                                          205700      
002888     03 S422-88-CTR-NUMCSI                PIC 9(002) COMP.        205800      
002889     03 S422-88-CTE-NUM                   PIC 9(012) COMP.        205900      
002890     03 S422-88-CTA-NUMPROD               PIC 9(004) COMP.        206000      
002891     03 S422-88-CTA-CVEINST               PIC 9(004) COMP.        206100      
002892     03 S422-88-CTA-NUMCTO                PIC 9(016) COMP.        206200      
002893     03 S422-88-CTA-NUMCTORED  REDEFINES  S422-88-CTA-NUMCTO.     206300      
002894        05 S422-88-CTA-NUMPREF            PIC 9(004) COMP.        206400      
002895        05 S422-88-CTA-NUM                PIC 9(012) COMP.        206500      
002896     03 S422-88-CTR-CVERELCTA             PIC 9(002) COMP.        206600      
002897     03 S422-88-CTA-NUMPROREL             PIC 9(004) COMP.        206700      
002898     03 S422-88-CTA-CVEINSREL             PIC 9(004) COMP.        206800      
002899     03 S422-88-CTA-NUMCTOREL             PIC 9(016) COMP.        206900      
002900     03 S422-88-CTA-NUMCTORELRED REDEFINES S422-88-CTA-NUMCTOREL. 207000      
002901        05 S422-88-CTA-NUMPREREL          PIC 9(004) COMP.        207100      
002902        05 S422-88-CTA-NUMREL             PIC 9(012) COMP.        207200      
002903     03 S422-88-CTA-FECALTA               PIC 9(008) COMP.        207300      
002904     03 S422-88-CTA-FECULTMOD             PIC 9(008) COMP.        207400      
002905*                                                                 207500      
002906*                                                                 207600      
002907******************************************************************207700      
002908*                S016_L422_B10SxCteRepPin (89)                   *207800      
002909****  CONSULTA  B01CLIENTES y B10SXCTEREPPIN CON OPCION         **207900      
002910******************************************************************208000      
002911*                                                                 208100      
002912 77  R422-89-CTR-ERROR                    PIC S9(11) BINARY.      208200      
002913*                                                                 208300      
002914 01  E422-89-CTR-ENTRADA.                                         208400      
002915     03 E422-89-CTE-NUM                   PIC 9(012) COMP.        208500      
002916     03 E422-89-CTE-REPPIN                PIC X(006)     .        208600      
002917     03 E422-89-OPCION                    PIC 9(002) COMP.        208700      
002918     03 FILLER                            PIC X(047).             208800      
002919* SIZE ENTRADA X(60)*                                             208900      
002920*                                                                 209000      
002921 01  S422-89-CTR-SALIDA.                                          209100      
002922     03 S422-89-CTR-NUMCSI                PIC 9(002) COMP.        209200      
002923     03 S422-89-CTE-NUM                   PIC 9(012) COMP.        209300      
002924     03 S422-89-CTE-REPPIN                PIC X(006)     .        209400      
002925     03 S422-89-CTE-REPNOMB               PIC X(036)     .        209500      
002926     03 S422-89-CTE-REPLIMITE             PIC 9(014) COMP.        209600      
002927     03 S422-89-CTE-REPPRIVILEGIO         PIC 9(002) COMP.        209700      
002928     03 S422-89-CTE-REPFECALTA            PIC 9(008) COMP.        209800      
002929     03 S422-89-CTE-REPFECULTMOD          PIC 9(008) COMP.        209900      
002930     03 FILLER                            PIC X(19).              210000      
002931* SIZE SALIDA X(84)*                                              210100      
002932*                                                                 210200      
002933*****************************************************             210300      
002934******      S016_L422_B09SXSISTIPCTE (90)************             210400      
002935******  CONSULTA AL B09BCAELEC              *********             210500      
002936*****************************************************             210600      
002937****PARAMETRO DE ENTRADA :                                        210700      
002938*                                                                 210800      
002939  01  E422-90-CTR-ENTRADA.                                        210900      
002940* OPCIONAL                                                        211000      
002941     03 E422-90-CTR-NUMCSI           PIC 9(002) COMP.             211100      
002942* NECESARIOS                                                      211200      
002943     03 E422-90-CTE-NUM              PIC 9(012) COMP.             211300      
002944     03 E422-90-SER-NUM              PIC 9(004) COMP.             211400      
002945     03 E422-90-SER-CVETIPO          PIC 9(002) COMP.             211500      
002946     03 FILLER                       PIC X(050).                  211600      
002947* SIZE ENTRADA X(60)*                                             211700      
002948*                                                                 211800      
002949*  PARAMETRO DE SALIDA                                            211900      
002950*                                                                 212000      
002951  01 S422-90-CTR-SALIDA.                                          212100      
002952     03 S422-90-CTR-NUMCSI        PIC 9(002) COMP.                212200      
002953     03 S422-90-CTE-NUM           PIC 9(012) COMP.                212300      
002954     03 S422-90-SER-NUM           PIC 9(004) COMP.                212400      
002955     03 S422-90-SER-CVETIPO       PIC 9(002) COMP.                212500      
002956     03 S422-90-SER-CVEDISP       PIC 9(004) COMP.                212600      
002957     03 S422-90-SER-NOMESTA       PIC X(008).                     212700      
002958     03 S422-90-SER-NUMSUCPR      PIC 9(004) COMP.                212800      
002959     03 S422-90-CTA-NUMPROD       PIC 9(004) COMP.                212900      
002960     03 S422-90-CTA-CVEINST       PIC 9(002) COMP.                213000      
002961     03 S422-90-CTA-NUMPREF       PIC 9(004) COMP.                213100      
002962     03 S422-90-CTA-NUM           PIC 9(012) COMP.                213200      
002963     03 S422-90-SER-COBCOM1       PIC 9(002) COMP.                213300      
002964     03 S422-90-SER-COBCOM2       PIC 9(002) COMP.                213400      
002965     03 S422-90-SER-COBCOM3       PIC 9(002) COMP.                213500      
002966     03 S422-90-SER-COBCOM4       PIC 9(002) COMP.                213600      
002967     03 S422-90-SER-COBCOM5       PIC 9(002) COMP.                213700      
002968     03 S422-90-SER-COBCOM6       PIC 9(002) COMP.                213800      
002969     03 S422-90-SER-VERSOFT       PIC 9(004) COMP.                213900      
002970     03 S422-90-SER-PROPEQUI      PIC 9(002) COMP.                214000      
002971     03 S422-90-CTE-PIN           PIC 9(004) COMP.                214100      
002972     03 S422-90-CTE-PINVER        PIC 9(002) COMP.                214200      
002973     03 S422-90-CTE-CVENOPIN      PIC 9(002) COMP.                214300      
002974     03 S422-90-SER-CVESTATUS     PIC 9(002) COMP.                214400      
002975     03 S422-90-CTR-CVEENVIO      PIC 9(004) COMP.                214500      
002976     03 S422-90-SER-DIACORTE      PIC 9(002) COMP.                214600      
002977     03 S422-90-SER-EDIEDOCTA     PIC 9(002) COMP.                214700      
002978     03 S422-90-SER-DISEDOCTA     PIC 9(002) COMP.                214800      
002979     03 S422-90-SER-FECONTRAT-2K  PIC 9(008) COMP.                214900      
002980     03 S422-90-SER-FECRENOVA-2K  PIC 9(008) COMP.                215000      
002981     03 S422-90-SER-FECCANCEL-2K  PIC 9(008) COMP.                215100      
002982     03 S422-90-SER-FECULTMOD-2K  PIC 9(008) COMP.                215200      
002983     03 S422-90-SER-FECMODPIN-2K  PIC 9(008) COMP.                215300      
002984     03 S422-90-SER-FECULTMOV-2K  PIC 9(008) COMP.                215400      
002985     03 S422-90-SER-FECINIOPE-2K  PIC 9(008) COMP.                215500      
002986     03 S422-90-SER-SITUACION     PIC X(004).                     215600      
002987     03 FILLER                    PIC X(024).                     215700      
002988* SIZE SALIDA X(108)                                              215800      
002989*                                                                 215900      
002990 01  S422-90-RCTR-SALIDA REDEFINES S422-90-CTR-SALIDA.            216000      
002991     03 S422-90-CTR-ERROR            PIC 9(004) COMP.             216100      
002992     03 S422-90-CTR-ERRORTYPE        PIC 9(004) COMP.             216200      
002993     03 S422-90-CTR-STRUCTURE        PIC 9(004) COMP.             216300      
002994     03 FILLER                       PIC X(102).                  216400      
002995                                                                  216500      
002996*  RESULTADO DE LA CONSULTA :                                     216600      
002997*                                                                 216700      
002998   77  R422-90-CTR-ERROR          PIC S9(11) BINARY.              216800      
002999*                                                                 216900      
003000*****************************************************             217000      
003001****** S016_L422_ACUM_B04XCTECTA (91)****************             217100      
003002******  CONSULTA AL B04CUENTAS              *********             217200      
003003*****************************************************             217300      
003004*                                                                 217400      
003005*  PARAMETRO DE ENTRADA :                                         217500      
003006*                                                                 217600      
003007   01  E422-91-CTR-ENTRADA.                                       217700      
003008     03 E422-91-CTR-SIST                     PIC 9(004) COMP.     217800      
003009     03 E422-91-CTE-NUM                      PIC 9(012) COMP.     217900      
003010     03 E422-91-CTA-NUMPROD                  PIC 9(004) COMP.     218000      
003011     03 E422-91-CTA-CVEINST                  PIC 9(002) COMP.     218100      
003012     03 E422-91-OPCION                       PIC 9(002) COMP.     218200      
003013     03 FILLER                               PIC X(048).          218300      
003014* SIZE ENTRADA X(60)*                                             218400      
003015**                                                                218500      
003016*                                                                 218600      
003017*  PARAMETRO DE SALIDA                                            218700      
003018**                                                                218800      
003019   01 S422-91-CTR-SALIDA.                                         218900      
003020     02 S422-91-CTECTACUANTOS   OCCURS 20 TIMES.                  219000      
003021          03 S422-91-CTA-NUMPROD          PIC 9(004) COMP.        219100      
003022          03 S422-91-CTA-CVEINST          PIC 9(004) COMP.        219200      
003023          03 S422-91-CUANTOS              PIC 9(004) COMP.        219300      
003024* EN CUANTOS APARECE EL N¥MERO DE CUENTAS PROD-INST QUE TIENE     219400      
003025*   EL CLIENTE CONSULTADO                                         219500      
003026     02 FILLER     PIC X(024).                                    219600      
003027* SIZE SALIDA X(144)*                                             219700      
003028*                                                                 219800      
003029*                                                                 219900      
003030  01  S422-91-RCTR-SALIDA REDEFINES S422-91-CTR-SALIDA.           220000      
003031        03 S422-91-CTR-ERROR         PIC 9(004) COMP.             220100      
003032        03 S422-91-CTR-ERRORTYPE     PIC 9(004) COMP.             220200      
003033        03 S422-91-CTR-STRUCTURE     PIC 9(004) COMP.             220300      
003034        03 FILLER                    PIC X(138).                  220400      
003035*                                                                 220500      
003036*RESULTADO DE LA CONSULTA :                                       220600      
003037*                                                                 220700      
003038    77  R422-91-CTR-ERROR               PIC S9(11) BINARY.        220800      
003039*                                                                 220900      
003040******************************************************************221000      
003041***    PARAMETROS  S016_L422_B01SXCTE_TODO (92)                ***221100      
003042****   CONSULTA B01CLIENTES y B04CUENTAS CON OPCION             **221200      
003043******************************************************************221300      
003044*                                                                 221400      
003045 77  R422-92-CTR-ERROR                   PIC S9(11) BINARY.       221500      
003046*                                                                 221600      
003047 01  E422-92-CTR-ENTRADA.                                         221700      
003048     03 E422-92-CTE-NUM                   PIC 9(012) COMP.        221800      
003049     03 E422-92-CTA-NUMPROD               PIC 9(004) COMP.        221900      
003050     03 E422-92-CTA-CVEINST               PIC 9(004) COMP.        222000      
003051     03 E422-92-CTA-NUMPREF               PIC 9(004) COMP.        222100      
003052     03 E422-92-CTA-NUM                   PIC 9(012) COMP.        222200      
003053     03 E422-92-OPCION                    PIC 9(002) COMP.        222300      
003054     03 FILLER                            PIC X(042).             222400      
003055* SIZE ENTRADA X(60)*                                             222500      
003056*                                                                 222600      
003057 01  S422-92-CTR-SALIDA.                                          222700      
003058     03 S422-92-CTE-NUM                   PIC 9(012) COMP.        222800      
003059     03 S422-92-CTE-NOM                   PIC X(055).             222900      
003060     03 S422-92-CTE-CALLENUM              PIC X(036).             223000      
003061     03 S422-92-CTE-NOMCOL                PIC X(024).             223100      
003062     03 S422-92-CTE-NOMPOB                PIC X(020).             223200      
003063     03 S422-92-CTE-CVEEDO                PIC 9(002) COMP.        223300      
003064     03 S422-92-CTE-NUMCP                 PIC 9(006) COMP.        223400      
003065     03 S422-92-CTE-NUMTEL                PIC 9(010) COMP.        223500      
003066     03 S422-92-CTE-NUMTELEXT             PIC 9(006) COMP.        223600      
003067     03 S422-92-CTE-CVETEL                PIC 9(002) COMP.        223700      
003068     03 S422-92-CTE-NUMTEL2               PIC 9(010) COMP.        223800      
003069     03 S422-92-CTE-NUMTELEX2             PIC 9(006) COMP.        223900      
003070     03 S422-92-CTE-CVETEL2               PIC 9(002) COMP.        224000      
003071     03 S422-92-CTR-CVESTADOM             PIC 9(002) COMP.        224100      
003072     03 S422-92-CTR-CVEDOM                PIC 9(002) COMP.        224200      
003073     03 S422-92-CTR-NUMDOMS               PIC 9(004) COMP.        224300      
003074     03 S422-92-CTE-CVEPERS               PIC 9(002) COMP.        224400      
003075     03 S422-92-CTE-CVETIPO               PIC 9(002) COMP.        224500      
003076     03 S422-92-CTE-NUMCLASIF             PIC 9(002) COMP.        224600      
003077     03 S422-92-CTE-CODINI                PIC X(004).             224700      
003078     03 S422-92-CTE-FECNAC                PIC 9(006) COMP.        224800      
003079     03 S422-92-CTE-CODHOM                PIC X(005).             224900      
003080     03 S422-92-CTE-CVENACION             PIC 9(002) COMP.        225000      
003081     03 S422-92-CTE-CVESEXO               PIC 9(002) COMP.        225100      
003082     03 S422-92-CTE-FECNACIM-2K           PIC 9(008) COMP.        225200      
003083     03 S422-92-CTE-CAEB                  PIC 9(006) COMP.        225300      
003084     03 S422-92-CTE-CVEACTBM              PIC 9(006) COMP.        225400      
003085     03 S422-92-CTE-EDOCTACON             PIC 9(002) COMP.        225500      
003086     03 S422-92-CTE-CVESECTOR             PIC 9(002) COMP.        225600      
003087     03 S422-92-CTE-CVEPERBCO             PIC 9(002) COMP.        225700      
003088     03 S422-92-CTE-CVESEG                PIC 9(002) COMP.        225800      
003089     03 S422-92-CTE-DIACORTE              PIC 9(002) COMP.        225900      
003090     03 S422-92-CTE-CVEENVIO              PIC 9(004) COMP.        226000      
003091     03 S422-92-CTE-NUMOFICON             PIC 9(004) COMP.        226100      
003092*  NUMOFICON ES EQUIVALENTE A SUCURSAL PROMOTORA                  226200      
003093     03 S422-92-CTE-CVESTATUS             PIC 9(002) COMP.        226300      
003094     03 S422-92-OFI-NUMCSIALT             PIC 9(002) COMP.        226400      
003095     03 S422-92-CTE-FECALTA               PIC 9(008) COMP.        226500      
003096     03 S422-92-CTE-FECULTMOD             PIC 9(008) COMP.        226600      
003097     03 S422-92-CTE-NUMUNIMER             PIC 9(004) COMP.        226700      
003098     03 S422-92-CTE-RIEBNM                PIC X(002).             226800      
003099     03 S422-92-CTE-RIEBM                 PIC X(002).             226900      
003100     03 S422-92-CTE-OCUPACION             PIC 9(002) COMP.        227000      
003101     03 S422-92-CTE-CVEPUB                PIC 9(002) COMP.        227100      
003102     03 S422-92-CTE-SITUACION             PIC X(004).             227200      
003103     03 S422-92-CTE-CVEDISENT             PIC 9(002) COMP.        227300      
003104     03 S422-92-CTE-CVEDISSAL             PIC 9(002) COMP.        227400      
003105     03 S422-92-CTE-RECEPDOC OCCURS 6 TIMES.                      227500      
003106         04 S422-92-CTE-RECEPSW           PIC X(001).             227600      
003107         04 S422-92-CTE-RECEPNOMI         PIC 9(010) COMP.        227700      
003108         04 S422-92-CTE-RECEPSUC          PIC 9(004) COMP.        227800      
003109         04 S422-92-CTE-HHRECEP           PIC 9(004) COMP.        227900      
003110         04 S422-92-CTE-FEREDO-2K         PIC 9(008) COMP.        228000      
003111     03 S422-92-CTE-PREVNOMI              PIC 9(010) COMP.        228100      
003112     03 S422-92-CTE-PREVSUC               PIC 9(004) COMP.        228200      
003113     03 S422-92-CTE-FEPREV-2K             PIC 9(008) COMP.        228300      
003114     03 FILLER                            PIC X(004).             228400      
003115* SIZE SALIDA X(324)*                                             228500      
003116*                                                                 228600      
003117*                                                                 228700      
003118  01  S422-92-RCTR-SALIDA REDEFINES S422-92-CTR-SALIDA.           228800      
003119     03 S422-92-CTR-ERROR                 PIC 9(004)    COMP.     228900      
003120     03 S422-92-CTR-ERRORTYPE             PIC 9(004)    COMP.     229000      
003121     03 S422-92-CTR-STRUCTURE             PIC 9(004)    COMP.     229100      
003122     03 FILLER                            PIC X(318).             229200      
003123******************************************************************229300      
003124*************************************************************     229400      
003125**** PARAMETROS S016_L422_DAMENUMDOM;          % (93)        **   229500      
003126**** VER EL ENTRY POINT S016_L422_NUMDOM (17)CONSULTA GENERAL**   229600      
003127*    CONSULTA B01 CLIENTES Y B02DOMICILIOS                   **   229700      
003128*    REGRESA  SI COINCIDE DOM ENTRADA EL NUMDOM IGUAL        **   229800      
003129*    CERO SI NO LO ENCONTRO   NOTA ES 1 SI ES IGUAL AL B01   **   229900      
003130*************************************************************     230000      
003131 01  E422-93-CTR-ENTRADA.                                         230100      
003132     02  E422-93-CTR-NUMCSI          PIC 9(02) COMP.              230200      
003133     02  E422-93-CTE-NUM             PIC 9(12) COMP.              230300      
003134     02  E422-93-CTR-NUMDOM          PIC 9(04) COMP.              230400      
003135     02  E422-93-CTE-CALLENUM           PIC X(36).                230500      
003136     02  E422-93-CTE-NOMCOL             PIC X(24).                230600      
003137     02  E422-93-CTE-NOMPOB             PIC X(20).                230700      
003138     02  E422-93-CTE-CVEEDO             PIC 9(02) COMP.           230800      
003139     02  E422-93-CTE-NUMCP              PIC 9(06) COMP.           230900      
003140     02  E422-93-CTE-NUMTEL             PIC 9(10) COMP.           231000      
003141     02  E422-93-CTE-NUMTEL2            PIC 9(10) COMP.           231100      
003142     02  E422-93-CTR-OPCION             PIC 9(02) COMP.           231200      
003143     02  FILLER                         PIC X(16).                231300      
003144* SIZE ENTRADA X(120).                                            231400      
003145 01 S422-93-CTR-SALIDA.                                           231500      
003146        03 S422-93-CTR-SALIDA-OK           PIC 9(02) COMP.        231600      
003147*DATOS DEL ULTIMO DOMICILIO SI NO OK O DEL DOM SI OK.             231700      
003148        03 S422-93-CTR-NUMCSI              PIC 9(02) COMP.        231800      
003149        03 S422-93-CTE-NUM                 PIC 9(12) COMP.        231900      
003150        03 S422-93-CTR-NUMDOM              PIC 9(04) COMP.        232000      
003151        03 S422-93-CTR-DOMUSOS             PIC 9(04) COMP.        232100      
003152        03 S422-93-CTE-CALLENUM            PIC X(36).             232200      
003153        03 S422-93-CTE-NOMCOL              PIC X(24).             232300      
003154        03 S422-93-CTE-NOMPOB              PIC X(20).             232400      
003155        03 S422-93-CTE-CVEEDO              PIC 9(02) COMP.        232500      
003156        03 S422-93-CTE-NUMCP               PIC 9(06) COMP.        232600      
003157        03 S422-93-CTE-NUMTEL              PIC 9(10) COMP.        232700      
003158        03 S422-93-CTE-NUMTELEXT           PIC 9(06) COMP.        232800      
003159        03 S422-93-CTE-CVETEL              PIC 9(02) COMP.        232900      
003160        03 S422-93-CTE-NUMTEL2             PIC 9(10) COMP.        233000      
003161        03 S422-93-CTE-NUMTELEX2           PIC 9(06) COMP.        233100      
003162        03 S422-93-CTE-CVETEL2             PIC 9(02) COMP.        233200      
003163        03 S422-93-CTE-CVESTADOM           PIC 9(02) COMP.        233300      
003164        03 S422-93-CTE-CVEDOM              PIC 9(02) COMP.        233400      
003165        03 S422-93-CTE-CVEAGEN             PIC X(04).             233500      
003166        03 S422-93-CTE-APDO                PIC X(08).             233600      
003167        03 S422-93-CTR-NUMCSIDOM           PIC 9(02) COMP.        233700      
003168        03 S422-93-CTR-FECALTDOM-2K        PIC 9(08) COMP.        233800      
003169        03 S422-93-CTR-FECMODDOM-2K        PIC 9(08) COMP.        233900      
003170        03 FILLER                          PIC X(08).             234000      
003171*                                                                 234100      
003172* size SALIDA = 1+(144) = 145                                     234200      
003173*                                                                 234300      
003174 77  R422-93-CTR-DOMOER                 PIC S9(11) BINARY.        234400      
003175*********************************************************         234500      
003176*************************************************************     234600      
003177**** PARAMETROS S016_L422_SUCXMEDIO;          % (94)       **     234700      
003178*    CONSULTA LA SUCURSAL ASOCIADA AL MEDIO DE ACCESO      **     234800      
003179*    PARA VALIDAR LA BUSQUEDA SE UTILIZA LA VARIABLE       **     234900      
003180*    RES SOLO SI ES "0" SI ENCONTRO SUCURSAL               **     235000      
003181*************************************************************     235100      
003182 77  R422-94-CTR-ERROR                   REAL.                    235200      
003183*                                                                 235300      
003184 01  E422-94-CTR-ENTRADA.                                         235400      
003185     02  E422-94-MDA-NUMPREF         PIC 9(04) COMP.              235500      
003186     02  E422-94-MDA-NUMCTA          PIC 9(12) COMP.              235600      
003187     02  FILLER                      PIC X(52).                   235700      
003188**SIZE ENTRADA (60)                                               235800      
003189                                                                  235900      
003190 01  S422-94-CTR-SALIDA.                                          236000      
003191     02  S422-94-CTR-NUMSUC          PIC 9(04) COMP.              236100      
003192     02  FILLER                      PIC X(58).                   236200      
003193*SIZE ENTRADA (60)                                                236300      
003194*************************************************************     236400      
003195* PARAMETROS PARA ENTRY POINT S016_L422_DAMENOMNUM(95) ******     236500      
003196*   CONSULTA  B03NOMBRES REGRESA NUMERO DE NOMBRE.       ****     236600      
003197*SI YA EXISTE, O EL N¥MERO DE NOMBRE DONDE DARLO DE ALTA.+1 *     236700      
003198*************************************************************     236800      
003199 01  E422-95-CTR-ENTRADA.                                         236900      
003200     02  E422-95-CTR-NUMCSI              PIC 9(02) COMP.          237000      
003201*            NUMERO DEL CSI DEL QUE SE DESEA LA INFORMACION       237100      
003202*            0  = INFORMACION LOCAL                               237200      
003203*            99 = INFORMACION NACIONAL (SOLO EN VDM)              237300      
003204*            NN = INF. DEL CSI NN                                 237400      
003205     02  E422-95-CTR-NUMSIST             PIC 9(04) COMP.          237500      
003206*            NUMERO DEL SISTEMA LLAMADOR                          237600      
003207     02  E422-95-CTR-NUMPASO             PIC 9(04) COMP.          237700      
003208*            NUMERO DEL PASO LLAMADOR                             237800      
003209     02  E422-95-CTR-CLAVE.                                       237900      
003210         03  E422-95-CTE-NUM             PIC 9(12) COMP.          238000      
003211*            NUMERO DEL CLIENTE  A CONSULTAR                      238100      
003212         03  E422-95-CTR-NUMNOM          PIC 9(04) COMP.          238200      
003213*            NUMERO DE NOMBRE ADICIONAL                           238300      
003214         03  E422-95-CTE-CVETITCTE       PIC 9(02) COMP.          238400      
003215*            NUMERO DE RELACION CON EL CLIENTE TODAS MAS:         238500      
003216*            13   REPRESENTANTE LEGAL                             238600      
003217*            14   REPRESENTANTE ADMINISTRATIVO                    238700      
003218         03  E422-95-CTE-NOMBRE       PIC X(20) .                 238800      
003219         03  E422-95-CTE-APPATERNO       PIC X(20) .              238900      
003220         03  E422-95-CTE-APMATERNO       PIC X(20) .              239000      
003221         03  E422-95-CTR-OPCION          PIC 9(02) COMP.          239100      
003222         03  E422-95-CTE-NOMBRE-S016     PIC X(52) .              239200      
003223         03  FILLER                      PIC X(5).                239300      
003224*SIZE ENTRADA X(132).22*6                                         239400      
003225*                                                                 239500      
003226  01  S422-95-CTR-SALIDA.                                         239600      
003227     02  S422-95-CTR-REGISTRO.                                    239700      
003228         03  S422-95-CTR-NUMNOMBASE       PIC 9(04) COMP.         239800      
003229         03  S422-95-CTR-ULTNUMNOM        PIC 9(04) COMP.         239900      
003230         03  S422-95-CTR-TAMNOM           PIC 9(02) COMP.         240000      
003231         03  S422-95-CTE-SECCION1         PIC X(26).              240100      
003232         03  S422-95-CTE-SECCION2         PIC X(26).              240200      
003233         03  S422-95-CTE-SECCION3         PIC X(10).              240300      
003234*DATOS DEL B03, CON CVECONT, 2 O 3 DEL CTE ENCONTRADO.            240400      
003235         03  S422-95-CTR-NUMCSI          PIC 9(02) COMP.          240500      
003236         03  S422-95-CTE-NUM             PIC 9(12) COMP.          240600      
003237         03  S422-95-CTR-NUMNOM          PIC 9(04) COMP.          240700      
003238         03  S422-95-CTR-NOMUSOS         PIC 9(04) COMP.          240800      
003239         03  S422-95-CTE-NOMCORTO        PIC X(26).               240900      
003240         03  S422-95-CTE-CVETITCTE       PIC 9(02) COMP.          241000      
003241         03  S422-95-CTR-CVECONT         PIC 9(02) COMP.          241100      
003242         03  S422-95-CTR-FECALTNOM-2K    PIC 9(08) COMP.          241200      
003243         03  S422-95-CTR-FECMODNOM-2K    PIC 9(08) COMP.          241300      
003244         03  FILLER                      PIC X(06).               241400      
003245* SIZE SALIDA X(120)                                              241500      
003246*                                                                 241600      
003247 77  R422-95-CTR-ERRNOM                  PIC S9(11) BINARY.       241700      
003248*                                                                 241800      
003249***************************************************************** 241900      
003250* PARAMETROS PARA ENTRY POINT S016_L422_B08SXCTECTATIPOTIT (96)** 242000      
003251*  AMPLIACI¿N DEL S016_L422_CTAMEDIO (61)                    **** 242100      
003252*  YA QUE UTILIZA el MDA-CVETIT UN ELEMENTO MAS EN LA LLAVE     * 242200      
003253***************************************************************** 242300      
003254*   PARAMETRO DE ENTRADA :                                        242400      
003255                                                                  242500      
003256           01    E422-96-CTR-ENTRADA.                             242600      
003257             02    E422-96-CTA-NUMPROD          PIC 9(04) COMP.   242700      
003258* N³mero de producto del que se desea la inf.                     242800      
003259             02    E422-96-CTA-CVEINST          PIC 9(04) COMP.   242900      
003260* Clave del instrumento que se desea conocer                      243000      
003261             02    E422-96-CTA-NUMPREF          PIC 9(04) COMP.   243100      
003262*Prefijo de la cuenta                                             243200      
003263             02    E422-96-CTA-NUM              PIC 9(12) COMP.   243300      
003264* Numero de la cuenta                                             243400      
003265             02    E422-96-MDA-CVETIPO          PIC 9(02) COMP.   243500      
003266* Numero de clave relativa                                        243600      
003267             02    E422-96-OPCION               PIC 9(02) COMP.   243700      
003268* Clave de opcion seleccionada                                    243800      
003269*   00  Cualquier cuenta que encuentres                           243900      
003270*   10   "  y con llave completa.                                 244000      
003271*   01  Cuenta MDA-CVESTATUS = 21                                 244100      
003272*   11   "  y con llave completa.                                 244200      
003273*   02  Cuenta MDA_CVESTATUS NEQ 21                               244300      
003274*   12   "  y con llave completa.                                 244400      
003275             02    E422-96-CTR-NUMCSI           PIC 9(02) COMP.   244500      
003276             02    E422-96-CTE-NUM              PIC 9(12) COMP.   244600      
003277             02    E422-96-MDA-CVETIT           PIC 9(02) COMP.   244700      
003278             02    FILLER                       PIC X(33).        244800      
003279                                                                  244900      
003280                                                                  245000      
003281* SIZE ENTRADA X(60)                                              245100      
003282*--------- PARAMETRO DE SALIDA                                    245200      
003283                                                                  245300      
003284   01  S422-96-CTR-SALIDA.                                        245400      
003285        02 S422-96-CTR-REGISTRO.                                  245500      
003286           03 S422-96-CTR-ERR.                                    245600      
003287              04 S422-96-CTR-ERROR        PIC 9(04) COMP.         245700      
003288              04 S422-96-CTR-ERRORTIPO    PIC 9(04) COMP.         245800      
003289              04 S422-96-CTR-ESTRUCTURA   PIC 9(04) COMP.         245900      
003290           03 S422-96-CTR-NUMCSI          PIC 9(02) COMP.         246000      
003291           03 S422-96-CTE-NUM             PIC 9(12) COMP.         246100      
003292           03 S422-96-CTA-NUMPROD         PIC 9(04) COMP.         246200      
003293           03 S422-96-CTA-CVEINST         PIC 9(02) COMP.         246300      
003294           03 S422-96-CTA-NUMCTO.                                 246400      
003295              04 S422-96-CTA-NUMPREF      PIC 9(04) COMP.         246500      
003296              04 S422-96-CTA-NUM          PIC 9(12) COMP.         246600      
003297           03 S422-96-MDA-CVETIPO         PIC 9(02) COMP.         246700      
003298           03 S422-96-MDA-SUBTIPO         PIC 9(02) COMP.         246800      
003299           03 S422-96-MDA-CVETIT          PIC 9(02) COMP.         246900      
003300           03 S422-96-MDA-NUMCTO.                                 247000      
003301              04 S422-96-MDA-NUMPREF      PIC 9(04) COMP.         247100      
003302              04 S422-96-MDA-NUM          PIC 9(12) COMP.         247200      
003303           03 S422-96-MDA-NUMTALON        PIC 9(02) COMP.         247300      
003304           03 S422-96-MDA-CHQXTALON       PIC 9(02) COMP.         247400      
003305           03 S422-96-MDA-CVEPIN          PIC 9(06) COMP.         247500      
003306           03 S422-96-MDA-CVESTATUS       PIC 9(02) COMP.         247600      
003307           03 S422-96-MDA-FECALTA-2K      PIC 9(08) COMP.         247700      
003308           03 S422-96-MDA-FECULTMOD-2K    PIC 9(08) COMP.         247800      
003309           03 S422-96-MDA-FECCANCEL-2K    PIC 9(08) COMP.         247900      
003310           03 S422-96-MDA-FECMODPIN-2K    PIC 9(08) COMP.         248000      
003311           03 FILLER                      PIC X(27).              248100      
003312* SIZE SALIDA X(84).                                              248200      
003313                                                                  248300      
003314                                                                  248400      
003315*  RESULTADO DE LA CONSULTA :                                     248500      
003316          77  R422-96-CTR-ERROR           PIC S9(11) BINARY.      248600      
003317                                                                  248700      
003318**************************************************************    248800      
003319**** PARAMETROS S016_L422_B27SXCTETIPNUMDE (97) **                248900      
003320*    CONSULTA B27 DOMELEC                                    **   249000      
003321*************************************************************     249100      
003322 01  E422-97-CTR-ENTRADA.                                         249200      
003323     02  E422-97-CTE-NUM             PIC 9(12) COMP.              249300      
003324     02  E422-97-CTR-TIPODE          PIC 9(02) COMP.              249400      
003325     02  E422-97-CTR-NUMDOME         PIC 9(04) COMP.              249500      
003326     02  E422-97-CTR-NUMCONS         PIC 9(02) COMP.              249600      
003327     02  E422-97-CTR-OPCION          PIC 9(02) COMP.              249700      
003328     02  FILLER                      PIC X(49).                   249800      
003329* SIZE ENTRADA X(60).                                             249900      
003330 01 S422-97-CTR-SALIDA.                                           250000      
003331        03 S422-97-CTR-NUMCSI              PIC 9(02) COMP.        250100      
003332        03 S422-97-CTE-NUM                 PIC 9(12) COMP.        250200      
003333        03 S422-97-CTR-TIPODE              PIC 9(02) COMP.        250300      
003334        03 S422-97-CTR-NUMDOME             PIC 9(04) COMP.        250400      
003335        03 S422-97-CTR-NUMCOMS             PIC 9(02) COMP.        250500      
003336        03 S422-97-CTR-NOMUSOSE            PIC 9(04) COMP.        250600      
003337        03 S422-97-CTR-CVEPROV             PIC 9(04) COMP.        250700      
003338        03 S422-97-CTE-DOMELEC             PIC X(26).             250800      
003339        03 S422-97-CTR-FECALTDOM-2K        PIC 9(08) COMP.        250900      
003340        03 S422-97-CTR-FECMODDOM-2K        PIC 9(08) COMP.        251000      
003341        03 FILLER                          PIC X(08).             251100      
003342*                                                                 251200      
003343* size SALIDA = x(060)                                            251300      
003344*                                                                 251400      
003345 77  R422-97-CTR-ERROR            PIC S9(11) BINARY.              251500      
003346*********************************************************         251600      
003347**************************************************************    251700      
003348**** PARAMETROS S016_L422_B28SXCTECTADE (98) **                   251800      
003349*    CONSULTA B28 CUENTASDE                                **     251900      
003350*************************************************************     252000      
003351 01  E422-98-CTR-ENTRADA.                                         252100      
003352     02  E422-98-CTE-NUM     PIC 9(12) COMP.                      252200      
003353     02  E422-98-CTA-PROD    PIC 9(04) COMP.                      252300      
003354     02  E422-98-CTA-INST    PIC 9(02) COMP.                      252400      
003355     02  E422-98-CTA-PREF    PIC 9(04) COMP.                      252500      
003356     02  E422-98-CTA-NUM     PIC 9(12) COMP.                      252600      
003357     02  E422-98-CTR-TIPODE  PIC 9(02) COMP.                      252700      
003358     02  E422-98-CTR-NUMDOME PIC 9(04) COMP.                      252800      
003359     02  E422-98-CTR-OPCION  PIC 9(02) COMP.                      252900      
003360     02  FILLER              PIC X(39).                           253000      
003361* SIZE ENTRADA X(60).                                             253100      
003362 01 S422-98-CTR-SALIDA.                                           253200      
003363        03 S422-98-CTR-NUMCSI    PIC 9(02) COMP.                  253300      
003364        03 S422-98-CTE-CTENUM    PIC 9(12) COMP.                  253400      
003365        03 S422-98-CTR-NUMPROD   PIC 9(04) COMP.                  253500      
003366        03 S422-98-CTR-CVEINST   PIC 9(02) COMP.                  253600      
003367        03 S422-98-CTR-NUMPREF   PIC 9(04) COMP.                  253700      
003368        03 S422-98-CTR-CTANUM    PIC 9(12) COMP.                  253800      
003369        03 S422-98-CTR-TIPODE    PIC 9(02) COMP.                  253900      
003370        03 S422-98-CTE-NUMDOME   PIC 9(04) COMP.                  254000      
003371        03 S422-98-CTR-FEALDE-2K PIC 9(08) COMP.                  254100      
003372        03 S422-98-CTR-FEMODE-2K PIC 9(08) COMP.                  254200      
003373        03 FILLER                PIC X(31).                       254300      
003374*                                                                 254400      
003375* size SALIDA = x(060)                                            254500      
003376*                                                                 254600      
003377 77  R422-98-CTR-ERROR            PIC S9(11) BINARY.              254700      
003378*********************************************************         254800      
003379**************************************************************    254900      
003380**** PARAMETROS S016_L422_B11TERCEROS   (99) **                   255000      
003381*    CONSULTA B11 TERCEROS                                 **     255100      
003382*************************************************************     255200      
003383 01  E422-99-CTR-ENTRADA.                                         255300      
003384     02  E422-99-CTE-NUM      PIC 9(12) COMP.                     255400      
003385     02  E422-99-CTA-PROD     PIC 9(04) COMP.                     255500      
003386     02  E422-99-CTA-INST     PIC 9(02) COMP.                     255600      
003387     02  E422-99-CTO-NUM      PIC 9(16) COMP.                     255700      
003388     02  E422-99-CTO-RED REDEFINES E422-99-CTO-NUM.               255800      
003389       03 E422-99-CTA-PREF        PIC 9(04) COMP.                 255900      
003390       03 E422-99-CTA-NUM         PIC 9(12) COMP.                 256000      
003391     02  E422-99-CTR-NUMREG   PIC 9(02) COMP.                     256100      
003392     02  E422-99-CTR-CONT     PIC 9(02) COMP.                     256200      
003393     02  E422-99-CTR-OPCION   PIC 9(02) COMP.                     256300      
003394     02  FILLER               PIC X(40).                          256400      
003395* SIZE ENTRADA X(60).                                             256500      
003396 01 S422-99-CTR-SALIDA.                                           256600      
003397     02 S422-99-CTE-NUM       PIC 9(12) COMP.                     256700      
003398     02 S422-99-CTR-NUMREG    PIC 9(02) COMP.                     256800      
003399     02 S422-99-CTR-CONT      PIC 9(02) COMP.                     256900      
003400     02 S422-99-CTR-REGISTRO  OCCURS 20 TIMES.                    257000      
003401       03 S422-99-CTA-NUMPROD   PIC 9(04) COMP.                   257100      
003402       03 S422-99-CTA-CVEINST   PIC 9(02) COMP.                   257200      
003403       03 S422-99-CTO-NUM       PIC 9(16) COMP.                   257300      
003404       03 S422-99-CTO-RED REDEFINES S422-99-CTO-NUM.              257400      
003405          05 S422-99-CTA-NUMPREF PIC 9(04) COMP.                  257500      
003406          05 S422-99-CTA-NUM     PIC 9(12) COMP.                  257600      
003407       03 S422-99-SER-LIMAXAUT  PIC 9(14) COMP.                   257700      
003408       03 S422-99-SER-PERIODLIM PIC X(01).                        257800      
003409       03 S422-99-CTA-CVEMONEDA PIC 9(02) COMP.                   257900      
003410       03 S422-99-SER-CVEUSOCTA PIC 9(02) COMP.                   258000      
003411       03 S422-99-CTA-3DIGITOS  PIC 9(04) COMP.                   258100      
003412       03 S422-99-CTR-FEALTE-2K PIC 9(08) COMP.                   258200      
003413       03 S422-99-CTR-FEMOTE-2K PIC 9(08) COMP.                   258300      
003414       03 S422-99-SER-FEFIVI-2K PIC 9(06) COMP.                   258400      
003415       03 S422-99-CTA-STATUS    PIC 9(02) COMP.                   258500      
003416       03 S422-99-CTA-SUCURSAL  PIC 9(04) COMP.                   258600      
003417       03 FILLER                PIC X(08).                        258700      
003418*                                                                 258800      
003419* SIZE REG OCC X(45).                                             258900      
003420* SIZE SALIDA = 8 + (45*20) = 908.                                259000      
003421*                                                                 259100      
003422 77  R422-99-CTR-ERROR            PIC S9(11) BINARY.              259200      
003423*********************************************************         259300      
003424*************************************************************     259400      
003425**   PARAMETROS S016_L422_B22DATOSREP   (100)              **     259500      
003426**   CONSULTA B22 DATOS DEL REPRESENTANTE                  **     259600      
003427*************************************************************     259700      
003428 01  E422-100-CTR-ENTRADA.                                        259800      
003429     02  E422-100-CTE-NUM               PIC 9(12) COMP.           259900      
003430     02  E422-100-CTR-PTRNOMR           PIC 9(04) COMP.           260000      
003431     02  E422-100-CTR-NUMREG            PIC 9(02) COMP.           260100      
003432     02  E422-100-CTR-CONT              PIC 9(02) COMP.           260200      
003433     02  E422-100-CTR-OPCION            PIC 9(02) COMP.           260300      
003434     02  FILLER                         PIC X(19).                260400      
003435* SIZE ENTRADA X(30).                                             260500      
003436 01 S422-100-CTR-SALIDA.                                          260600      
003437     02 S422-100-CTE-NUM                PIC 9(12) COMP.           260700      
003438     02 S422-100-CTR-NUMREG             PIC 9(02) COMP.           260800      
003439     02 S422-100-CTR-CONT               PIC 9(02) COMP.           260900      
003440     02 S422-100-CTR-REGISTRO  OCCURS 10 TIMES.                   261000      
003441       03 S422-100-CTR-PTRNOMR          PIC 9(04) COMP.           261100      
003442       03 S422-100-REP-FENACI-2K        PIC 9(08) COMP.           261200      
003443       03 S422-100-CTR-FEALTA-2K        PIC 9(08) COMP.           261300      
003444       03 S422-100-CTR-FEULMO-2K        PIC 9(08) COMP.           261400      
003445       03 FILLER                        PIC X(06).                261500      
003446*                                                                 261600      
003447* SIZE REG OCC X(20).                                             261700      
003448* SIZE SALIDA = 8 + (20*10) = 208.                                261800      
003449*                                                                 261900      
003450 77  R422-100-CTR-ERROR                 PIC S9(11) BINARY.        262000      
003451*********************************************************         262100      
003452* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 262200      
003453* PARAMETROS PARA LA LIBRERIA S016L422    ( 101  )              * 262300      
003454* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 262400      
003455*                                                                 262500      
003456 77  R422-101-CTR-ERROR                 PIC S9(11) BINARY.        262600      
003457 01  E422-101-CTR-ENTRADA.                                        262700      
003458     02  E422-101-CTE-NUM         PIC 9(12) COMP.                 262800      
003459     02  E422-101-CTR-TIPODOM     PIC 9(02) COMP.                 262900      
003460     02  E422-101-CTR-NUMDOM      PIC 9(04) COMP.                 263000      
003461     02  E422-101-CTR-OPCION      PIC 9(02) COMP.                 263100      
003462*                                                                 263200      
003463* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 263300      
003464* PARAMETROS DE SALIDA DE LA S016L422     ( 101 )               * 263400      
003465* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 263500      
003466*                                                                 263600      
003467 01  S422-101-CTR-SALIDA.                                         263700      
003468     02  S422-101-CTR-NUMCSI      PIC 9(02) COMP.                 263800      
003469     02  S422-101-CTE-NUM         PIC 9(12) COMP.                 263900      
003470     02  S422-101-CTR-NUMREGS     PIC 9(02) COMP.                 264000      
003471     02  S422-101-CTR-DOMSE OCCURS 5 TIMES.                       264100      
003472         03 S422-101-CTR-TIPODOM  PIC 9(02) COMP.                 264200      
003473         03 S422-101-CTR-NUMDOM   PIC 9(04) COMP.                 264300      
003474         03 S422-101-CTR-NUMUSOSE PIC 9(04) COMP.                 264400      
003475         03 S422-101-CTR-CVEPROV  PIC 9(04) COMP.                 264500      
003476         03 S422-101-CTR-DOMELEC  PIC X(78) .                     264600      
003477         03 S422-101-CTR-FEALDE   PIC 9(08) COMP.                 264700      
003478         03 S422-101-CTR-FEMODE   PIC 9(08) COMP.                 264800      
003479     02  FILLER                   PIC X(87).                      264900      
003480* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 265000      
003481* PARAMETROS PARA LA LIBRERIA S016L422            (102)         * 265100      
003482* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 265200      
003483*                                                                 265300      
003484 77  R422-102-CTR-ERROR                 PIC S9(11) BINARY.        265400      
003485 01  E422-102-CTR-ENTRADA.                                        265500      
003486     02  E422-102-CTA-NUMPROD     PIC 9(04) COMP.                 265600      
003487     02  E422-102-CTA-CVEINST     PIC 9(04) COMP.                 265700      
003488     02  E422-102-CTA-NUMPREF     PIC 9(04) COMP.                 265800      
003489     02  E422-102-CTA-NUM         PIC 9(12) COMP.                 265900      
003490     02  E422-102-CTR-TIPODE      PIC 9(02) COMP.                 266000      
003491     02  E422-102-CTR-NUMDOME     PIC 9(04) COMP.                 266100      
003492     02  E422-102-CTR-OPCION      PIC 9(02) COMP.                 266200      
003493*                                                                 266300      
003494* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 266400      
003495* PARAMETROS DE SALIDA DE LA S016L422          (102)            * 266500      
003496* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 266600      
003497 01  S422-102-CTR-SALIDA.                                         266700      
003498     02  S422-102-CTR-NUMCSI      PIC 9(02) COMP.                 266800      
003499     02  S422-102-CTE-NUM         PIC 9(12) COMP.                 266900      
003500     02  S422-102-CTR-NUMREGS     PIC 9(02) COMP.                 267000      
003501     02  S422-102-CTR-NUMPROD     PIC 9(04) COMP.                 267100      
003502     02  S422-102-CTR-CVEINST     PIC 9(02) COMP.                 267200      
003503     02  S422-102-CTA-NUMPREF     PIC 9(04) COMP.                 267300      
003504     02  S422-102-CTA-NUM         PIC 9(12) COMP.                 267400      
003505     02  S422-102-CTR-DOMSE OCCURS 5 TIMES.                       267500      
003506         03 S422-102-CTR-TIPODOM  PIC 9(02) COMP.                 267600      
003507         03 S422-102-CTR-NUMDOM   PIC 9(04) COMP.                 267700      
003508         03 S422-102-CTR-FEALDE   PIC 9(08) COMP.                 267800      
003509         03 S422-102-CTR-FEMODE   PIC 9(08) COMP.                 267900      
003510     02  FILLER                   PIC X(87).                      268000      
003511*                                                                 268100      
003512*************************************************************     268200      
003513**   PARAMETROS S016_L422_CTASINCORPO   (103)              **     268300      
003514**   CONSULTA B05 Y B08 DATOS : CONTRATO Y SU MEDIO        **     268400      
003515*************************************************************     268500      
003516 01  E422-103-CTR-ENTRADA.                                        268600      
003517     02  E422-103-CTE-NUM               PIC 9(12) COMP.           268700      
003518     02  E422-103-CTA-NUMPROD           PIC 9(04) COMP.           268800      
003519     02  E422-103-CTA-CVEINST           PIC 9(02) COMP.           268900      
003520     02  E422-103-CTA-NUMPREF           PIC 9(04) COMP.           269000      
003521     02  E422-103-CTA-NUM               PIC 9(12) COMP.           269100      
003522     02  E422-103-CTR-NUMREG            PIC 9(02) COMP.           269200      
003523     02  E422-103-CTR-OPCION            PIC 9(02) COMP.           269300      
003524     02  FILLER                         PIC X.                    269400      
003525* SIZE ENTRADA X(26).                                             269500      
003526 01 S422-103-CTR-SALIDA.                                          269600      
003527     02 S422-103-CTR-NUMCSI             PIC 9(02) COMP.           269700      
003528     02 S422-103-CTE-NUM                PIC 9(12) COMP.           269800      
003529     02 S422-103-CTR-NUMREG             PIC 9(02) COMP.           269900      
003530     02 S422-103-CTR-CONT               PIC 9(02) COMP.           270000      
003531     02 S422-103-CTR-REGISTRO  OCCURS 20 TIMES.                   270100      
003532       03 S422-103-CTA-NUMPROD          PIC 9(04) COMP.           270200      
003533       03 S422-103-CTA-CVEINST          PIC 9(02) COMP.           270300      
003534       03 S422-103-CTA-NUMPREF          PIC 9(04) COMP.           270400      
003535       03 S422-103-CTA-NUM              PIC 9(12) COMP.           270500      
003536       03 S422-103-CTA-NUMSUC           PIC 9(04) COMP.           270600      
003537       03 S422-103-CTA-CVESTATUS        PIC 9(02) COMP.           270700      
003538       03 S422-103-CTA-CVEMONEDA        PIC 9(02) COMP.           270800      
003539       03 S422-103-MDA-NUMPREF          PIC 9(04) COMP.           270900      
003540       03 S422-103-MDA-NUM              PIC 9(12) COMP.           271000      
003541       03 S422-103-MDA-CVESTATUS        PIC 9(02) COMP.           271100      
003542       03 S422-103-CTA-RELCTE           PIC 9(02) COMP.           271200      
003543       03 S422-103-CTA-USOBCAELE        PIC 9(02) COMP.           271300      
003544       03 S422-103-CTA-ASOCIADAX        PIC 9(02) COMP.           271400      
003545       03 S422-103-CTA-3DIGITOS         PIC 9(04) COMP.           271500      
003546       03 S422-103-CTA-FEALCT-2K        PIC 9(08) COMP.           271600      
003547       03 S422-103-CTA-FEMOCT-2K        PIC 9(08) COMP.           271700      
003548*                                                                 271800      
003549* SIZE REG OCC X(37).                                             271900      
003550* SIZE SALIDA = 9 + (37*20) = 749.                                272000      
003551*                                                                 272100      
003552 77  R422-103-CTR-ERROR                 PIC S9(11) BINARY.        272200      
003553*************************************************************     272300      
003554**   PARAMETROS S016_L422_B29SXCTEPIN   (104)              **     272400      
003555**   CONSULTA B05 Y B08 DATOS : CONTRATO Y SU MEDIO        **     272500      
003556*************************************************************     272600      
003557  01 E422-104-CTR-ENTRADA.                                        272700      
003558     03 E422-104-CTE-NUM                PIC 9(012) COMP.          272800      
003559     03 E422-104-SER-NUM                PIC 9(004) COMP.          272900      
003560     03 E422-104-SER-CVETIPO            PIC 9(002) COMP.          273000      
003561     03 E422-104-CTE-PINOCHO            PIC 9(008).               273100      
003562     03 E422-104-CTE-RED REDEFINES E422-104-CTE-PINOCHO.          273200      
003563        05 E422-104-CTE-PIN8ALFA        PIC X(008).               273300      
003564     03 E422-104-CTE-OPCION             PIC 9(002) COMP.          273400      
003565     03 FILLER                          PIC X(042).               273500      
003566* SIZE ENTRADA X(60).                                             273600      
003567*                                                                 273700      
003568  01 S422-104-CTR-SALIDA.                                         273800      
003569     03 S422-104-PIN-FEALTA       PIC 9(008) COMP.                273900      
003570     03 S422-104-PIN-FEREIN       PIC 9(008) COMP.                274000      
003571     03 S422-104-PIN-FEMOPI       PIC 9(008) COMP.                274100      
003572     03 S422-104-PIN-ANT          PIC 9(002) COMP.                274200      
003573     03 FILLER                    PIC X(047).                     274300      
003574* SIZE SALIDA X(79).                                              274400      
003575*                                                                 274500      
003576 77  R422-104-CTR-ERROR                 PIC S9(11) BINARY.        274600      
003577*************************************************************     274700      
003578**   PARAMETROS S016_L422_B36XREF       (105)              **     274800      
003579**   CONSULTA B36 X REFERENCE CLIENTES BANAMEX/CITIBANK    **     274900      
003580*************************************************************     275000      
003581 01  E422-105-CTR-ENTRADA.                                        275100      
003582     02  E422-105-CTE-NUM               PIC 9(16) COMP.           275200      
003583     02  E422-105-CTR-FTE               PIC 9(02) COMP.           275300      
003584     02  E422-105-CTR-NUMREG            PIC 9(02) COMP.           275400      
003585     02  E422-105-CTR-CONT              PIC 9(02) COMP.           275500      
003586     02  E422-105-CTR-OPCION            PIC 9(02) COMP.           275600      
003587     02  FILLER                         PIC X(18).                275700      
003588* SIZE ENTRADA X(30).                                             275800      
003589 01 S422-105-CTR-SALIDA.                                          275900      
003590     02 S422-105-CTE-NUM                PIC 9(16) COMP.           276000      
003591     02 S422-105-CTR-NUMREG             PIC 9(02) COMP.           276100      
003592     02 S422-105-CTR-CONT               PIC 9(02) COMP.           276200      
003593     02 S422-105-CTR-REGISTRO  OCCURS 10 TIMES.                   276300      
003594       03 S422-105-CTE-NUMSAL           PIC 9(16) COMP.           276400      
003595       03 S422-105-CTR-FTE              PIC 9(02) COMP.           276500      
003596       03 S422-105-NUMNOMI              PIC 9(10) COMP.           276600      
003597       03 S422-105-NUMDOM               PIC 9(04) COMP.           276700      
003598       03 S422-105-NUMERO1              PIC 9(12) COMP.           276800      
003599       03 S422-105-NUMERO2              PIC 9(12) COMP.           276900      
003600       03 S422-105-NUMERO3              PIC 9(12) COMP.           277000      
003601       03 S422-105-NUMERO4              PIC 9(12) COMP.           277100      
003602       03 S422-105-ALFA                 PIC X(16).                277200      
003603       03 S422-105-CTR-FEALTA           PIC 9(08) COMP.           277300      
003604*                                                                 277400      
003605* SIZE REG OCC X(60).                                             277500      
003606* SIZE SALIDA = 10 + (60*10) = 610.                               277600      
003607*                                                                 277700      
003608 77  R422-105-CTR-ERROR                 PIC S9(11) BINARY.        277800      
003609*************************************************************     277900      
003610**   PARAMETROS S016_L422_B38COSMOS     (106)              **     278000      
003611**   CONSULTA B38 CLIENTES CITI COSMOS CORPORATIVOS        **     278100      
003612*************************************************************     278200      
003613  01 E422-106-CTR-ENTRADA.                                        278300      
003614     03 E422-106-CTE-NUM                PIC 9(012) COMP.          278400      
003615     03 E422-106-CTR-NUMCSI             PIC 9(002) COMP.          278500      
003616     03 FILLER                          PIC X(003).               278600      
003617* SIZE ENTRADA X(10).                                             278700      
003618*                                                                 278800      
003619  01 S422-106-CTR-SALIDA.                                         278900      
003620     03 S422-106-CTR-NUMCSI             PIC 9(002) COMP.          279000      
003621     03 S422-106-CTE-NUM                PIC 9(012) COMP.          279100      
003622     03 S422-106-CTE-BRANCH             PIC 9(003) COMP.          279200      
003623     03 S422-106-CTE-APR                PIC 9(010) COMP.          279300      
003624     03 S422-106-CTE-LANGUAGE           PIC 9(001) COMP.          279400      
003625     03 S422-106-CTE-CNTRYDOM           PIC 9(003) COMP.          279500      
003626     03 S422-106-CTE-MXTAXDOM           PIC 9(003) COMP.          279600      
003627     03 S422-106-CTE-CITIREL            PIC 9(001) COMP.          279700      
003628     03 S422-106-CTE-GAPDOM             PIC 9(003) COMP.          279800      
003629     03 S422-106-CTE-RISKRAT            PIC 9(002) COMP.          279900      
003630     03 S422-106-CTE-RISKRATI           PIC X(001).               280000      
003631     03 S422-106-CTE-ACCOCLAS           PIC 9(001) COMP.          280100      
003632     03 S422-106-CTE-OLDSIC             PIC 9(003) COMP.          280200      
003633     03 S422-106-CTE-NEWSIC             PIC 9(004) COMP.          280300      
003634     03 S422-106-CTE-LIABILIT           PIC 9(006) COMP.          280400      
003635     03 S422-106-CTE-WCG                PIC X(001).               280500      
003636     03 S422-106-CTE-NYPARENT           PIC X(005).               280600      
003637     03 S422-106-CTE-NYLOCAL            PIC X(005).               280700      
003638     03 S422-106-CTE-HOLDING            PIC 9(006) COMP.          280800      
003639     03 S422-106-CTE-SUBHOLD            PIC 9(006) COMP.          280900      
003640     03 S422-106-CTE-ULPARENT           PIC 9(006) COMP.          281000      
003641     03 S422-106-CTE-PARADISE           PIC 9(002) COMP.          281100      
003642     03 S422-106-CTE-EXTNUM1            PIC 9(010) COMP.          281200      
003643     03 S422-106-CTE-EXTNUM2            PIC 9(010) COMP.          281300      
003644     03 S422-106-CTE-EXTALF1            PIC X(010).               281400      
003645     03 S422-106-CTE-EXTALF2            PIC X(010).               281500      
003646     03 FILLER                          PIC X(001).               281600      
003647* SIZE SALIDA X(84).                                              281700      
003648*                                                                 281800      
003649 77  R422-106-CTR-ERROR                 PIC S9(11) BINARY.        281900      
003650******************************************************************282000      
003651***   PARAMETROS  S016_L422_B09ALL          (85)               ***282100      
003652****   CONSULTA B09BCAELEC CON OPCION                           **282200      
003653******************************************************************282300      
003654*                                                                 282400      
003655   77  R422-109-CTR-ERROR                 PIC S9(11) BINARY.      282500      
003656*                                                                 282600      
003657  01  E422-109-CTR-ENTRADA.                                       282700      
003658     03 E422-109-CTR-NUMCSI                PIC 9(002) COMP.       282800      
003659     03 E422-109-CTE-NUM                   PIC 9(012) COMP.       282900      
003660     03 E422-109-SER-NUM                   PIC 9(004) COMP.       283000      
003661     03 E422-109-SER-CVETIPO               PIC 9(002) COMP.       283100      
003662     03 E422-109-OPCION                    PIC 9(002) COMP.       283200      
003663     03 FILLER                             PIC X(048).            283300      
003664* SIZE ENTRADA X(60)*                                             283400      
003665*                                                                 283500      
003666*                                                                 283600      
003667 01 S422-109-CTR-SALIDA.                                          283700      
003668    02 S422-109-NUMREG-09                 PIC 9(002) COMP.        283800      
003669    02 S422-109-CTR-REG      OCCURS 4 TIMES.                      283900      
003670      03 S422-109-CTR-NUMCSI               PIC 9(002) COMP.       284000      
003671      03 S422-109-CTE-NUM                  PIC 9(012) COMP.       284100      
003672      03 S422-109-SER-NUM                  PIC 9(004) COMP.       284200      
003673      03 S422-109-SER-CVETIPO              PIC 9(002) COMP.       284300      
003674      03 S422-109-SER-CVEDISP              PIC 9(004) COMP.       284400      
003675      03 S422-109-SER-NOMESTA              PIC X(008).            284500      
003676      03 S422-109-SER-NUMSUCPR             PIC 9(004) COMP.       284600      
003677      03 S422-109-CTA-NUMPROD              PIC 9(004) COMP.       284700      
003678      03 S422-109-CTA-CVEINST              PIC 9(004) COMP.       284800      
003679      03 S422-109-CTA-NUMPREF              PIC 9(004) COMP.       284900      
003680      03 S422-109-CTA-NUM                  PIC 9(012) COMP.       285000      
003681      03 S422-109-SER-COBCOM1              PIC 9(002) COMP.       285100      
003682      03 S422-109-SER-COBCOM2              PIC 9(002) COMP.       285200      
003683      03 S422-109-SER-COBCOM3              PIC 9(002) COMP.       285300      
003684      03 S422-109-SER-COBCOM4              PIC 9(002) COMP.       285400      
003685      03 S422-109-SER-COBCOM5              PIC 9(002) COMP.       285500      
003686      03 S422-109-SER-COBCOM6              PIC 9(002) COMP.       285600      
003687      03 S422-109-SER-VERSOFT              PIC 9(004) COMP.       285700      
003688      03 S422-109-SER-PROPEQUI             PIC 9(002) COMP.       285800      
003689      03 S422-109-CTE-PIN                  PIC 9(004) COMP.       285900      
003690      03 S422-109-CTE-PINVER               PIC 9(002) COMP.       286000      
003691      03 S422-109-CTE-CVENOPIN             PIC 9(002) COMP.       286100      
003692      03 S422-109-SER-CVESTATUS            PIC 9(002) COMP.       286200      
003693      03 S422-109-CTR-CVEENVIO             PIC 9(004) COMP.       286300      
003694      03 S422-109-SER-DIACORTE             PIC 9(002) COMP.       286400      
003695      03 S422-109-SER-EDIEDOCTA            PIC 9(002) COMP.       286500      
003696      03 S422-109-SER-DISEDOCTA            PIC 9(002) COMP.       286600      
003697      03 S422-109-SER-FECONTRAT            PIC 9(008) COMP.       286700      
003698      03 S422-109-SER-FECRENOVA            PIC 9(008) COMP.       286800      
003699      03 S422-109-SER-FECCANCEL            PIC 9(008) COMP.       286900      
003700      03 S422-109-SER-FECULTMOD            PIC 9(008) COMP.       287000      
003701      03 S422-109-SER-FECMODPIN            PIC 9(008) COMP.       287100      
003702      03 S422-109-SER-FECULTMOV            PIC 9(008) COMP.       287200      
003703      03 S422-109-SER-FECINIOPE            PIC 9(008) COMP.       287300      
003704*                                                                 287400      
003705 01  S422-109-RCTR-SALIDA REDEFINES S422-109-CTR-SALIDA.          287500      
003706     03 S422-109-CTR-ERROR                 PIC 9(004)    COMP.    287600      
003707     03 S422-109-CTR-ERRORTYPE             PIC 9(004)    COMP.    287700      
003708     03 S422-109-CTR-STRUCTURE             PIC 9(004)    COMP.    287800      
003709     03 FILLER                             PIC X(075).            287900      
003710*                                                                 288000      
003711*********************************************************         288100      
003712**   PARAMETROS S016_L422_B29SXCTEPIN_3D  (110)            **     288200      
003713**   CONSULTA PIN EN 3D                                           288300      
003714*************************************************************     288400      
003715  01 E422-110-CTR-ENTRADA.                                        288500      
003716     03 E422-110-CTE-NUM                PIC 9(012) COMP.          288600      
003717     03 E422-110-SER-NUM                PIC 9(004) COMP.          288700      
003718     03 E422-110-SER-CVETIPO            PIC 9(002) COMP.          288800      
003719     03 E422-110-CTE-PIN                PIC 9(008).               288900      
003720     03 E422-110-CTE-RED REDEFINES E422-110-CTE-PIN.              289000      
003721        05 E422-110-CTE-PIN8ALFA        PIC X(008).               289100      
003722     03 E422-110-CTE-LLAVEENCR          PIC 9(004)  COMP.         289200      
003723     03 E422-110-CTE-OPCION             PIC 9(002) COMP.          289300      
003724     03 FILLER                          PIC X(040).               289400      
003725* SIZE ENTRADA X(60).                                             289500      
003726*                                                                 289600      
003727  01 S422-110-CTR-SALIDA.                                         289700      
003728     03 S422-110-PIN-FEALTA       PIC 9(008) COMP.                289800      
003729     03 S422-110-PIN-FEREIN       PIC 9(008) COMP.                289900      
003730     03 S422-110-PIN-FEMOPI       PIC 9(008) COMP.                290000      
003731     03 S422-110-PIN-ANT          PIC 9(002) COMP.                290100      
003732     03 FILLER                    PIC X(047).                     290200      
003733* SIZE SALIDA X(79).                                              290300      
003734 77  R422-110-CTR-ERROR                 PIC S9(11) BINARY.        290400      
003735                                                                  290500      
003736*********************************************************         290600      
003737**   PARAMETROS S016_L422_B32SXCTE        (111)            **     290700      
003738**   CONSULTA DE COTITULARES                                      290800      
003739*************************************************************     290900      
003740                                                                  291000      
003741 01  E422-111-CTR-ENTRADA.                                        291100      
003742     03 E422-111-CTE-NUM                   PIC 9(012).            291200      
003743     03 E422-111-CTA-NUMPROD               PIC 9(004).            291300      
003744     03 E422-111-CTA-CVEINST               PIC 9(002).            291400      
003745     03 E422-111-CTA-NUMPREF               PIC 9(004).            291500      
003746     03 E422-111-CTA-NUM                   PIC 9(012).            291600      
003747     03 E422-111-OPCION                    PIC 9(002).            291700      
003748     03 FILLER                             PIC X(031).            291800      
003749                                                                  291900      
003750 01  S422-111-CTR-SALIDA.                                         292000      
003751     03 S422-111-COTITULARES OCCURS 10 TIMES.                     292100      
003752        05 S422-111-CTR-NUMCSI          PIC 9(02).                292200      
003753        05 S422-111-CTE-NUM             PIC 9(12).                292300      
003754        05 S422-111-CTR-NUMCSIA         PIC 9(02).                292400      
003755        05 S422-111-CTE-NUMASOC         PIC 9(12).                292500      
003756        05 S422-111-CTR-NUMNOM          PIC 9(04).                292600      
003757        05 S422-111-CTA-NUMPROD         PIC 9(04).                292700      
003758        05 S422-111-CTA-CVEINST         PIC 9(02).                292800      
003759        05 S422-111-CTA-NUMPREF         PIC 9(04).                292900      
003760        05 S422-111-CTA-NUM             PIC 9(12).                293000      
003761        05 S422-111-CTR-TIPOASOC        PIC 9(02).                293100      
003762        05 S422-111-CTE-NOM             PIC X(55).                293200      
003763     03 S422-111-RCTR-SALIDA.                                     293300      
003764        05 S422-111-CTR-ERROR         PIC 9(004).                 293400      
003765        05 S422-111-CTR-ERRORTYPE     PIC 9(004).                 293500      
003766        05 S422-111-CTR-STRUCTURE     PIC 9(004).                 293600      
003767     03 FILLER                        PIC X(080).                 293700      
003768                                                                  293800      
003769  77  R422-111-CTR-ERROR            PIC S9(11) BINARY.            293900      
003770*****************************************************             294000      
003771****** S016_L422_B04XCTECTA_PROD18 (114)****************          294100      
003772******  CONSULTA AL B04CUENTAS X PROD INST  *********             294200      
003773*****************************************************             294300      
003774*  PARAMETRO DE ENTRADA :                                         294400      
003775   01  E422-114-CTR-ENTRADA.                                      294500      
003776     03 E422-114-CTR-FILLER                   PIC 9(004) COMP.    294600      
003777     03 E422-114-CTE-NUM                      PIC 9(012) COMP.    294700      
003778     03 E422-114-CTA-NUMPROD                  PIC 9(004) COMP.    294800      
003779     03 E422-114-CTA-CVEINST                  PIC 9(002) COMP.    294900      
003780     03 E422-114-RGOPAGO                      PIC 9(002) COMP.    295000      
003781     03 FILLER                                PIC X(048).         295100      
003782*  PARAMETRO DE SALIDA                                            295200      
003783   01 S422-114-CTR-SALIDA.                                        295300      
003784     03 S422-114-CTR-FILLER                   PIC 9(004) COMP.    295400      
003785     03 S422-114-CTE-NUM                      PIC 9(012) COMP.    295500      
003786     03 S422-114-CTA-NUMPROD                  PIC 9(004) COMP.    295600      
003787     03 S422-114-CTA-CVEINST                  PIC 9(002) COMP.    295700      
003788     03 S422-114-RGOPAGO                      PIC 9(002) COMP.    295800      
003789     03 S422-114-STATUS                       PIC 9(002) COMP.    295900      
003790     03 FILLER                                PIC X(046).         296000      
003791  01  S422-114-RCTR-SALIDA REDEFINES S422-114-CTR-SALIDA.         296100      
003792        03 S422-114-CTR-ERROR         PIC 9(004) COMP.            296200      
003793        03 S422-114-CTR-ERRORTYPE     PIC 9(004) COMP.            296300      
003794        03 S422-114-CTR-STRUCTURE     PIC 9(004) COMP.            296400      
003795        03 FILLER                     PIC X(058).                 296500      
003796*RESULTADO DE LA CONSULTA :                                       296600      
003797    77  R422-114-CTR-ERROR               PIC S9(11) BINARY.       296700      
003798*                                                                 296800      
003799*****************************************************             296900      
003800****** S016_L422_B04XCTECTA_PROD18 (114)*************             297000      
003801******  CONSULTA AL B04CUENTAS X PROD INST  *********             297100      
003802****** PARA CASH-POLICY *****************************             297200      
003803*****************************************************             297300      
003804*  PARAMETRO DE ENTRADA :                                         297400      
003805  01 E422-115-CTR-ENTRADA.                                        297500      
003806     03 E422-115-CTR-FILLER                   PIC 9(004) COMP.    297600      
003807     03 E422-115-CTE-NUM                      PIC 9(012) COMP.    297700      
003808     03 E422-115-CTA-NUMPROD                  PIC 9(004) COMP.    297800      
003809     03 E422-115-CTA-CVEINST                  PIC 9(002) COMP.    297900      
003810     03 E422-115-RGOPAGO                      PIC 9(002) COMP.    298000      
003811     03 FILLER                                PIC X(048).         298100      
003812*  PARAMETRO DE SALIDA                                            298200      
003813 01  S422-115-CTR-SALIDA.                                         298300      
003814     03 S422-115-CTR-NUMCSI                PIC 9(002) COMP.       298400      
003815     03 S422-115-CTA-NUMPROD               PIC 9(004) COMP.       298500      
003816     03 S422-115-CTA-CVEINST               PIC 9(004) COMP.       298600      
003817     03 S422-115-CTA-NUMSUC                PIC 9(004) COMP.       298700      
003818     03 S422-115-CTA-NUMPREF               PIC 9(004) COMP.       298800      
003819     03 S422-115-CTA-NUM                   PIC 9(012) COMP.       298900      
003820     03 S422-115-CTE-NUM                   PIC 9(012) COMP.       299000      
003821     03 S422-115-CTA-DIACORTE              PIC 9(002) COMP.       299100      
003822     03 S422-115-CTA-CVEMONEDA             PIC 9(002) COMP.       299200      
003823     03 S422-115-CTA-CVEENVIO              PIC 9(004) COMP.       299300      
003824     03 S422-115-CTA-EDIEDOCTA             PIC 9(002) COMP.       299400      
003825     03 S422-115-CTA-CVEMANEJO             PIC 9(002) COMP.       299500      
003826     03 S422-115-CTA-CVESTATUS             PIC 9(002) COMP.       299600      
003827     03 S422-115-CTA-CVEUSO                PIC 9(002) COMP.       299700      
003828     03 S422-115-CTA-RESTRIC               PIC 9(002) COMP.       299800      
003829     03 S422-115-CTA-RESTCON               PIC 9(002) COMP.       299900      
003830     03 S422-115-CTA-OPCPAGO               PIC 9(002) COMP.       300000      
003831     03 S422-115-CTA-RGOPAGO               PIC 9(002) COMP.       300100      
003832     03 S422-115-CTA-FECAPER               PIC 9(008) COMP.       300200      
003833     03 S422-115-CTA-FECULTMOD             PIC 9(008) COMP.       300300      
003834     03 S422-115-CTA-FECCANCEL             PIC 9(008) COMP.       300400      
003835     03 S422-115-CTA-REFECVE               PIC 9(002) COMP.       300500      
003836     03 S422-115-CTA-VENDNOMI              PIC 9(010) COMP.       300600      
003837     03 S422-115-CTA-REFENOMI              PIC 9(010) COMP.       300700      
003838     03 S422-115-CTA-DISEDOCTA             PIC 9(002) COMP.       300800      
003839     03 FILLER                             PIC X(09).             300900      
003840* SIZE SALIDA X(66)*                                              301000      
003841*                                                                 301100      
003842*                                                                 301200      
003843 01  S422-115-RCTR-SALIDA REDEFINES S422-115-CTR-SALIDA.          301300      
003844     03 R422-115-CTR-ERROR                 PIC 9(004) COMP.       301400      
003845     03 R422-115-CTR-ERRORTYPE             PIC 9(004) COMP.       301500      
003846     03 R422-115-CTR-STRUCTURE             PIC 9(004) COMP.       301600      
003847     03 FILLER                             PIC X(60).             301700      
003848*                                                                 301800      
003849*************************************************************     301900      
003850**   PARAMETROS S016_L422_B48INTERC     (116)              **     302000      
003851**   CONSULTA CLAVE INTERCOMPANY POR CLIENTE               **     302100      
003852*************************************************************     302200      
003853  01 E422-116-CTR-ENTRADA.                                        302300      
003854     03 E422-116-CTE-NUM                PIC 9(012) COMP.          302400      
003855     03 FILLER                          PIC X(004).               302500      
003856* SIZE ENTRADA X(10).                                             302600      
003857*                                                                 302700      
003858  01 S422-116-CTR-SALIDA.                                         302800      
003859     03 S422-116-CTE-NUM                PIC 9(012) COMP.          302900      
003860     03 S422-116-CVE-INTERC             PIC 9(005) COMP.          303000      
003861     03 S422-116-FEC-ALTA               PIC 9(008) COMP.          303100      
003862     03 S422-116-FEC-ULTMOD             PIC 9(008) COMP.          303200      
003863     03 S422-116-CVESTATUS              PIC 9(002) COMP.          303300      
003864* SIZE SALIDA X(20).                                              303400      
003865*                                                                 303500      
003866  77  R422-116-CTR-ERROR                PIC S9(11) BINARY.        303600      
003867*************************************************************     303700      
003868**   PARAMETROS S016_L422_B48INTERC     (117)              **     303800      
003869**   CONSULTA CLAVE INTERCOMPANY POR CUENTA                **     303900      
003870*************************************************************     304000      
003871  01 E422-117-CTR-ENTRADA.                                        304100      
003872     03 E422-117-CTO-NUM                PIC 9(16) COMP.           304200      
003873     03 E422-117-CTO-NUM-R REDEFINES E422-117-CTO-NUM.            304300      
003874        04 E422-117-CTA-NUMPREF         PIC 9(004) COMP.          304400      
003875        04 E422-117-CTA-NUM             PIC 9(012) COMP.          304500      
003876     03 E422-117-CTA-NUMPROD            PIC 9(004) COMP.          304600      
003877     03 E422-117-CTA-CVEINST            PIC 9(002) COMP.          304700      
003878     03 FILLER                          PIC X(004).               304800      
003879* SIZE ENTRADA X(15).                                             304900      
003880*                                                                 305000      
003881  01 S422-117-CTR-SALIDA.                                         305100      
003882     03 S422-117-CTE-NUM                PIC 9(012) COMP.          305200      
003883     03 S422-117-CVE-INTERC             PIC 9(005) COMP.          305300      
003884     03 S422-117-FEC-ALTA               PIC 9(008) COMP.          305400      
003885     03 S422-117-FEC-ULTMOD             PIC 9(008) COMP.          305500      
003886     03 S422-117-CVESTATUS              PIC 9(002) COMP.          305600      
003887* SIZE SALIDA X(20).                                              305700      
003888*                                                                 305800      
003889  77  R422-117-CTR-ERROR                PIC S9(11) BINARY.        305900      
003890*************************************************************     306000      
003891**   PARAMETROS S016_L422_B48INTERC     (118)              **     306100      
003892**   CONSULTA CLAVE INTERCOMPANY POR MEDIO                 **     306200      
003893*************************************************************     306300      
003894  01 E422-118-CTR-ENTRADA.                                        306400      
003895     03 E422-118-CTA-NUMPREF            PIC 9(004) COMP.          306500      
003896     03 E422-118-CTA-NUM                PIC 9(012) COMP.          306600      
003897     03 FILLER                          PIC X(002).               306700      
003898* SIZE ENTRADA X(10).                                             306800      
003899*                                                                 306900      
003900  01 S422-118-CTR-SALIDA.                                         307000      
003901     03 S422-118-CTE-NUM                PIC 9(012) COMP.          307100      
003902     03 S422-118-CVE-INTERC             PIC 9(005) COMP.          307200      
003903     03 S422-118-FEC-ALTA               PIC 9(008) COMP.          307300      
003904     03 S422-118-FEC-ULTMOD             PIC 9(008) COMP.          307400      
003905     03 S422-118-CVESTATUS              PIC 9(002) COMP.          307500      
003906* SIZE SALIDA X(20).                                              307600      
003907*                                                                 307700      
003908  77  R422-118-CTR-ERROR                PIC S9(11) BINARY.        307800      
003909*EHG CONSULTA DOMICILIO FD L422                                   307900      
003910***************************************************************   308000      
003911**      S016_L422_BD56SXCTEUSU    (119)                      **   308100      
003912**      CONSULTA DE DOMICILIO FISICO DEL USUARIO             **   308200      
003913***************************************************************   308300      
003914*  PARAMETRO DE ENTRADA:                                          308400      
003915  01 E422-119-CTR-ENTRADA.                                        308500      
003916     03 E422-119-CTE-NUM              PIC 9(012) COMP.            308600      
003917     03 E422-119-MAS-DATOS            PIC X(001).                 308700      
003918     03 E422-119-USU-NUM              PIC 9(004) COMP.            308800      
003919     03 E422-119-USU-NUMPROD          PIC 9(004) COMP.            308900      
003920     03 E422-119-USU-CVEINST          PIC 9(002) COMP.            309000      
003921     03 E422-119-USU-STATUS           PIC 9(002) COMP.            309100      
003922     03 E422-119-OPCION               PIC 9(002) COMP.            309200      
003923                                                                  309300      
003924*  PARAMETRO DE SALIDA:                                           309400      
003925 01  S422-119-CTR-SALIDA.                                         309500      
003926     03 S422-119-CTE-NUM              PIC 9(012) COMP.            309600      
003927     03 S422-119-MAS-DATOS            PIC X(001).                 309700      
003928*                                                                 309800      
003929     03 S422-119-USU-DOMICILIO OCCURS 25 TIMES.                   309900      
003930        04 S422-119-USU-NUM           PIC 9(004) COMP.            310000      
003931        04 S422-119-USU-NUMPROD       PIC 9(004) COMP.            310100      
003932        04 S422-119-USU-CVEINST       PIC 9(004) COMP.            310200      
003933        04 S422-119-CTE-CSI           PIC 9(002) COMP.            310300      
003934        04 S422-119-USU-NUMNOM        PIC 9(004) COMP.            310400      
003935        04 S422-119-CTE-NOMCORTO      PIC X(026).                 310500      
003936        04 S422-119-USU-STATUS        PIC 9(002) COMP.            310600      
003937        04 S422-119-USU-CALLENUM      PIC X(036).                 310700      
003938        04 S422-119-USU-NOMCOL        PIC X(024).                 310800      
003939        04 S422-119-USU-NOMPOB        PIC X(020).                 310900      
003940        04 S422-119-USU-CVEEDO        PIC 9(002) COMP.            311000      
003941        04 S422-119-USU-CVENACION     PIC 9(002) COMP.            311100      
003942        04 S422-119-USU-NUMCP         PIC 9(006) COMP.            311200      
003943        04 S422-119-USU-NUMTEL        PIC 9(010) COMP.            311300      
003944        04 S422-119-USU-NUMTELEXT     PIC 9(006) COMP.            311400      
003945        04 S422-119-USU-NUMTEL2       PIC 9(010) COMP.            311500      
003946        04 S422-119-USU-NUMTELEXT2    PIC 9(006) COMP.            311600      
003947        04 S422-119-USU-TIPOID        PIC 9(002) COMP.            311700      
003948        04 S422-119-USU-NUMID         PIC X(025).                 311800      
003949        04 S422-119-USU-EMAIL         PIC X(078).                 311900      
003950        04 S422-119-FEC-ALT-STAT      PIC 9(008) COMP.            312000      
003951        04 S422-119-FEC-MOD-STAT      PIC 9(008) COMP.            312100      
003952        04 S422-119-FEC-ALT-GRAL      PIC 9(008) COMP.            312200      
003953        04 S422-119-FEC-MOD-GRAL      PIC 9(008) COMP.            312300      
003954        04 S422-119-FEC-MOD-MAIL      PIC 9(008) COMP.            312400      
003955     03 S422-119-USU-NUMREG           PIC 9(02)  COMP.            312500      
003956*                                                                 312600      
003957 01  S422-119-STAT-SALIDA REDEFINES S422-119-CTR-SALIDA.          312700      
003958     03 S422-119-STA-CTENUM           PIC 9(012) COMP.            312800      
003959     03 S422-119-STA-USUA             PIC 9(004) COMP.            312900      
003960     03 S422-119-STA-PROD             PIC 9(004) COMP.            313000      
003961     03 S422-119-STA-INST             PIC 9(002) COMP.            313100      
003962     03 S422-119-STA-STAT             PIC 9(002) COMP.            313200      
003963*                                                                 313300      
003964 01  S422-119-STAM-SALIDA REDEFINES S422-119-CTR-SALIDA.          313400      
003965     03 S422-119-STM-STAT             PIC 9(002) COMP.            313500      
003966     03 S422-119-STM-MAS-DATOS        PIC X(001).                 313600      
003967     03 S422-119-STM-STATUSU OCCURS 25.                           313700      
003968        05 S422-119-STM-CTENUM        PIC 9(012) COMP.            313800      
003969        05 S422-119-STM-USUA          PIC 9(004) COMP.            313900      
003970        05 S422-119-STM-PROD          PIC 9(004) COMP.            314000      
003971        05 S422-119-STM-INST          PIC 9(002) COMP.            314100      
003972        05 S422-119-STM-FECMOD        PIC 9(008) COMP.            314200      
003973     03 S422-119-STM-NUMREG           PIC 9(02)  COMP.            314300      
003974                                                                  314400      
003975 77  R422-119-CTR-ERROR               PIC S9(11) BINARY.          314500      
003976***************************************************************   314600      
003977**      S016_L422_BD56SXCTEUSU_2  (119)                      **   314700      
003978**      CONSULTA DE DOMICILIO FISICO DEL USUARIO  VERSION 2  **   314800      
003979***************************************************************   314900      
003980*  PARAMETRO DE ENTRADA:                                          315000      
003981  01 E422-119B-CTR-ENTRADA.                                       315100      
003982     03 E422-119B-CTE-NUM              PIC 9(012) COMP.           315200      
003983     03 E422-119B-MAS-DATOS            PIC X(001).                315300      
003984     03 E422-119B-USU-NUM              PIC 9(004) COMP.           315400      
003985     03 E422-119B-USU-NUMPROD          PIC 9(004) COMP.           315500      
003986     03 E422-119B-USU-CVEINST          PIC 9(002) COMP.           315600      
003987     03 E422-119B-USU-STATUS           PIC 9(002) COMP.           315700      
003988     03 E422-119B-OPCION               PIC 9(002) COMP.           315800      
003989                                                                  315900      
003990*  PARAMETRO DE SALIDA:                                           316000      
003991 01  S422-119B-CTR-SALIDA.                                        316100      
003992     03 S422-119B-CTE-NUM              PIC 9(012) COMP.           316200      
003993     03 S422-119B-MAS-DATOS            PIC X(001).                316300      
003994*                                                                 316400      
003995     03 S422-119B-USU-DOMICILIO OCCURS 25 TIMES.                  316500      
003996        04 S422-119B-USU-NUM           PIC 9(004) COMP.           316600      
003997        04 S422-119B-USU-NUMPROD       PIC 9(004) COMP.           316700      
003998        04 S422-119B-USU-CVEINST       PIC 9(004) COMP.           316800      
003999        04 S422-119B-CTE-CSI           PIC 9(002) COMP.           316900      
004000        04 S422-119B-USU-NUMNOM        PIC 9(004) COMP.           317000      
004001        04 S422-119B-CTE-NOMCORTO      PIC X(026).                317100      
004002        04 S422-119B-USU-STATUS        PIC 9(002) COMP.           317200      
004003        04 S422-119B-USU-CALLENUM      PIC X(036).                317300      
004004        04 S422-119B-USU-NOMCOL        PIC X(024).                317400      
004005        04 S422-119B-USU-NOMPOB        PIC X(020).                317500      
004006        04 S422-119B-USU-CVEEDO        PIC 9(002) COMP.           317600      
004007        04 S422-119B-USU-CVENACION     PIC 9(002) COMP.           317700      
004008        04 S422-119B-USU-NUMCP         PIC 9(006) COMP.           317800      
004009        04 S422-119B-USU-NUMTEL        PIC 9(010) COMP.           317900      
004010        04 S422-119B-USU-NUMTELEXT     PIC 9(006) COMP.           318000      
004011        04 S422-119B-USU-NUMTEL2       PIC 9(010) COMP.           318100      
004012        04 S422-119B-USU-NUMTELEXT2    PIC 9(006) COMP.           318200      
004013        04 S422-119B-USU-TIPOID        PIC 9(002) COMP.           318300      
004014        04 S422-119B-USU-NUMID         PIC X(025).                318400      
004015        04 S422-119B-USU-EMAIL         PIC X(078).                318500      
004016        04 S422-119B-FEC-ALT-STAT      PIC 9(008) COMP.           318600      
004017        04 S422-119B-FEC-MOD-STAT      PIC 9(008) COMP.           318700      
004018        04 S422-119B-FEC-ALT-GRAL      PIC 9(008) COMP.           318800      
004019        04 S422-119B-FEC-MOD-GRAL      PIC 9(008) COMP.           318900      
004020        04 S422-119B-FEC-MOD-MAIL      PIC 9(008) COMP.           319000      
004021        04 S422-119B-USU-NOTIFICA      PIC 9(002) COMP.           319100      
004022        04 S422-119B-USU-CLVCIACEL     PIC 9(002) COMP.           319200      
004023        04 S422-119B-MDA-NUMREPRES     PIC 9(008) COMP.           319300      
004024     03 S422-119B-USU-NUMREG           PIC 9(002) COMP.           319400      
004025*                                                                 319500      
004026 01  S422-119B-STAT-SALIDA REDEFINES S422-119B-CTR-SALIDA.        319600      
004027     03 S422-119B-STA-CTENUM           PIC 9(012) COMP.           319700      
004028     03 S422-119B-STA-USUA             PIC 9(004) COMP.           319800      
004029     03 S422-119B-STA-PROD             PIC 9(004) COMP.           319900      
004030     03 S422-119B-STA-INST             PIC 9(002) COMP.           320000      
004031     03 S422-119B-STA-STAT             PIC 9(002) COMP.           320100      
004032*                                                                 320200      
004033 01  S422-119B-STAM-SALIDA REDEFINES S422-119B-CTR-SALIDA.        320300      
004034     03 S422-119B-STM-STAT             PIC 9(002) COMP.           320400      
004035     03 S422-119B-STM-MAS-DATOS        PIC X(001).                320500      
004036     03 S422-119B-STM-STATUSU OCCURS 25.                          320600      
004037        05 S422-119B-STM-CTENUM        PIC 9(012) COMP.           320700      
004038        05 S422-119B-STM-USUA          PIC 9(004) COMP.           320800      
004039        05 S422-119B-STM-PROD          PIC 9(004) COMP.           320900      
004040        05 S422-119B-STM-INST          PIC 9(002) COMP.           321000      
004041        05 S422-119B-STM-FECMOD        PIC 9(008) COMP.           321100      
004042     03 S422-119B-STM-NUMREG           PIC 9(002) COMP.           321200      
004043                                                                  321300      
004044 77  R422-119B-CTR-ERROR               PIC S9(11) BINARY.         321400      
004045                                                                  321500      
004046*EHG CONSULTA ULTIMOS DIMICILIOS                                  321600      
004047*EHG CONSULTA ULTIMOS DIMICILIOS                                  321700      
004048***************************************************************   321800      
004049**      S016_L422_10ULTDOM       (120)                       **   321900      
004050**      CONSULTA ULTIMOS 10 DOMICILIOS DEL CLIENTE           **   322000      
004051***************************************************************   322100      
004052*  PARAMETRO DE ENTRADA:                                          322200      
004053  01 E422-120-CTR-ENTRADA.                                        322300      
004054     03 E422-120-CTE-NUM              PIC 9(012) COMP.            322400      
004055                                                                  322500      
004056*  PARAMETRO DE SALIDA:                                           322600      
004057 01  S422-120-CTR-SALIDA.                                         322700      
004058     03 S422-120-CTE-NUM              PIC 9(012) COMP.            322800      
004059     03 S422-120-CTE-NOM              PIC X(055).                 322900      
004060     03 S422-120-CTR-NUMCSI           PIC 9(002) COMP.            323000      
004061*                                                                 323100      
004062     03 S422-120-USU-10DOM OCCURS 10 TIMES.                       323200      
004063        04 S422-120-CTR-NUMDOM        PIC 9(004) COMP.            323300      
004064        04 S422-120-CTR-DOMUSOS       PIC 9(004) COMP.            323400      
004065        04 S422-120-CTE-CALLENUM      PIC X(036).                 323500      
004066        04 S422-120-CTE-NOMCOL        PIC X(024).                 323600      
004067        04 S422-120-USU-NOMPOB        PIC X(020).                 323700      
004068        04 S422-120-USU-CVEEDO        PIC 9(002) COMP.            323800      
004069        04 S422-120-USU-NUMCP         PIC 9(006) COMP.            323900      
004070        04 S422-120-USU-NUMTEL        PIC 9(010) COMP.            324000      
004071        04 S422-120-USU-NUMTELEXT     PIC 9(006) COMP.            324100      
004072        04 S422-120-CTE-CVETEL        PIC 9(002) COMP.            324200      
004073        04 S422-120-USU-NUMTEL2       PIC 9(010) COMP.            324300      
004074        04 S422-120-USU-NUMTELEXT2    PIC 9(006) COMP.            324400      
004075        04 S422-120-CTE-CVETEL2       PIC 9(002) COMP.            324500      
004076        04 S422-120-CTR-CVESTADOM     PIC 9(002) COMP.            324600      
004077        04 S422-120-CTR-CVEDOM        PIC 9(002) COMP.            324700      
004078        04 S422-120-CTE-CVEAGEN       PIC X(004).                 324800      
004079        04 S422-120-CTE-APDO          PIC X(008).                 324900      
004080        04 S422-120-OFI-NUMCSIDOM     PIC 9(002) COMP.            325000      
004081        04 S422-120-CTR-FECALTDOM     PIC 9(006) COMP.            325100      
004082        04 S422-120-CTR-FECMODDOM     PIC 9(006) COMP.            325200      
004083        04 S422-120-CTR-FEALDO-2K     PIC 9(008) COMP.            325300      
004084        04 S422-120-CTR-FEMODO-2K     PIC 9(008) COMP.            325400      
004085     03 S422-120-USU-NUMREG           PIC 9(02)  COMP.            325500      
004086*                                                                 325600      
004087 77  R422-120-CTR-ERROR   PIC S9(11) BINARY.                      325700      
004088*EHG CONSULTA DEL SERVICIO 274 DE BANCA ELECTRONICA               325800      
004089***************************************************************   325900      
004090**      S016_L422_SERV274BE      (121)                       **   326000      
004091**      CONSULTA UDEL SERVICIO 274 DE BANCA ELECTRONICA      **   326100      
004092***************************************************************   326200      
004093*  PARAMETRO DE ENTRADA                                           326300      
004094  01 E422-121-CTR-ENTRADA.                                        326400      
004095     03 E422-121-CTE-NUM              PIC 9(012) COMP.            326500      
004096     03 E422-121-SER-NUM              PIC 9(004) COMP.            326600      
004097     03 E422-121-SER-CVE              PIC 9(002) COMP.            326700      
004098     03 E422-121-SER-CVEDISP          PIC 9(006) COMP.            326800      
004099                                                                  326900      
004100*  PARAMETRO DE SALIDA                                            327000      
004101  01 S422-121-CTR-SALIDA.                                         327100      
004102     03 S422-121-CTE-NUM              PIC 9(012) COMP.            327200      
004103     03 S422-121-CTE-NOM              PIC X(055).                 327300      
004104     03 S422-121-SER-NUM              PIC 9(004) COMP.            327400      
004105     03 S422-121-SER-CVE              PIC 9(002) COMP.            327500      
004106     03 S422-121-SER-CVEDISP          PIC 9(006) COMP.            327600      
004107     03 S422-121-SER-SUCPRO           PIC 9(004) COMP.            327700      
004108     03 S422-121-CTA-NUMPROD          PIC 9(004) COMP.            327800      
004109     03 S422-121-CTA-CVEINST          PIC 9(004) COMP.            327900      
004110     03 S422-121-CTA-NUMCTO           PIC 9(016) COMP.            328000      
004111     03 S422-121-NOM-VEND             PIC 9(010) COMP.            328100      
004112     03 S422-121-SER-VERSOFT          PIC 9(004) COMP.            328200      
004113     03 S422-121-SER-PROPEQUIP        PIC 9(002) COMP.            328300      
004114     03 S422-121-SER-NOMESTA          PIC X(008).                 328400      
004115     03 S422-121-CTE-PINVER           PIC 9(002) COMP.            328500      
004116     03 S422-121-SER-STATUS           PIC 9(002) COMP.            328600      
004117     03 S422-121-SER-COBCOM PIC 9(002) COMP OCCURS 6.             328700      
004118     03 S422-121-CTR-CVEENVIO         PIC 9(004) COMP.            328800      
004119     03 S422-121-SER-EDIEDOCTA        PIC 9(002) COMP.            328900      
004120     03 S422-121-SER-DIACORTE         PIC 9(002) COMP.            329000      
004121     03 S422-121-SER-FECONTRAT        PIC 9(008) COMP.            329100      
004122     03 S422-121-SER-FECULTMOD        PIC 9(008) COMP.            329200      
004123     03 S422-121-SER-FECMODPIN        PIC 9(008) COMP.            329300      
004124     03 S422-121-SER-FECCANCEL        PIC 9(008) COMP.            329400      
004125     03 S422-121-SER-FECRENOVA        PIC 9(008) COMP.            329500      
004126     03 S422-121-SER-FECINIOPE        PIC 9(008) COMP.            329600      
004127*                                                                 329700      
004128 77  R422-121-CTR-ERROR           PIC S9(11) BINARY.              329800      
004129                                                                  329900      
004130**JGM*****************************************************        330000      
004131**CAMBIOS DE NOMINA SE TOMA EL MTP96 Y SE GENERA EL 97****        330100      
004132**Y SE PLANCHA EL S016/PARAMETROS/L422/COMISIONES2K CON***        330200      
004133**EL MTP 97***********************************************        330300      
004134******************************************************************330400      
004135**   PARAMETROS S016_L422_B04SXCTATEF   (122)                   **330500      
004136**   CONSULTA CONTRATOS DEL PRODUCTO TEF DE ACUERDO A LA OPCION **330600      
004137******************************************************************330700      
004138**   NOTA: OPCION 1 CONSULTA TODOS LOS PRODUCTOS TEF DEL CLIENTE  330800      
004139**         OPCION 2 CONSULTA EL ESTATUS DEL PRODUCTO TEF          330900      
004140**                                                                331000      
004141  01 E422-122-CTR-ENTRADA.                                        331100      
004142     03 E422-122-OFI-NUMCSIALT            PIC 9(02) COMP.         331200      
004143     03 E422-122-CTE-NUM                  PIC 9(12) COMP.         331300      
004144     03 E422-122-CTA-NUMPROD              PIC 9(04) COMP.         331400      
004145     03 E422-122-CTA-CVEINST              PIC 9(02) COMP.         331500      
004146     03 E422-122-CTA-NUMPREF              PIC 9(04) COMP.         331600      
004147     03 E422-122-CTA-NUM                  PIC 9(12) COMP.         331700      
004148     03 E422-122-OPCION                   PIC 9(02) COMP.         331800      
004149     03 FILLER                            PIC X(41) .             331900      
004150* SIZE ENTRADA X(60)                                              332000      
004151                                                                  332100      
004152  01 S422-122-CTR-SALIDA.                                         332200      
004153     03 S422-122-CTR-NUMCSI               PIC 9(02) COMP.         332300      
004154     03 S422-122-CTE-NUM                  PIC 9(12) COMP.         332400      
004155     03 S422-122-CTA-NUMPROD              PIC 9(04) COMP.         332500      
004156     03 S422-122-CTA-CVEINST              PIC 9(02) COMP.         332600      
004157     03 S422-122-CTR-CTOTEF        OCCURS 10 TIMES .              332700      
004158        05 S422-122-CTA-NUMPREF           PIC 9(04) COMP.         332800      
004159        05 S422-122-CTA-NUM               PIC 9(12) COMP.         332900      
004160        05 S422-122-CTA-CVESTAT           PIC 9(02) COMP.         333000      
004161     03 FILLER                            PIC X(10) .             333100      
004162* SIZE SALIDA X(110)                                              333200      
004163                                                                  333300      
004164  01 S422-122-RCTR-SALIDA       REDEFINES S422-122-CTR-SALIDA.    333400      
004165     03 S422-122-CTR-ERROR                PIC 9(04) COMP.         333500      
004166     03 S422-122-CTR-ERRORTYPE            PIC 9(04) COMP.         333600      
004167     03 S422-122-CTR-STRUCTURE            PIC 9(04) COMP.         333700      
004168     03 FILLER                            PIC X(104).             333800      
004169                                                                  333900      
004170  77  R422-122-CTR-ERROR                  PIC S9(11) BINARY.      334000      
004171*************************************************************     334100      
004172**   PARAMETROS S016_L422_CONSREGUL     (125)              **     334200      
004173**   CONSULTA B04 Y B60: CONTRATOS Y CUENTAS REGULARES     **     334300      
004174*************************************************************     334400      
004175 01  E422-125-CTR-ENTRADA.                                        334500      
004176     02  E422-125-CTE-NUM               PIC 9(12) COMP.           334600      
004177     02  E422-125-CTA-NUMPROD           PIC 9(04) COMP.           334700      
004178     02  E422-125-CTA-CVEINST           PIC 9(02) COMP.           334800      
004179     02  E422-125-CTA-NUMPREF           PIC 9(04) COMP.           334900      
004180     02  E422-125-CTA-NUM               PIC 9(12) COMP.           335000      
004181     02  E422-125-CTR-NUMREG            PIC 9(02) COMP.           335100      
004182     02  E422-125-CTR-OPCION            PIC 9(02) COMP.           335200      
004183     02  FILLER                         PIC X.                    335300      
004184* SIZE ENTRADA X(20).                                             335400      
004185 01 S422-125-CTR-SALIDA.                                          335500      
004186     02 S422-125-CTR-NUMCSI             PIC 9(02) COMP.           335600      
004187     02 S422-125-CTE-NUM                PIC 9(12) COMP.           335700      
004188     02 S422-125-CTR-NUMREG             PIC 9(02) COMP.           335800      
004189     02 S422-125-CTR-CONT               PIC 9(02) COMP.           335900      
004190     02 S422-125-CTR-REGISTRO  OCCURS 20 TIMES.                   336000      
004191       03 S422-125-CTA-NUMPROD          PIC 9(04) COMP.           336100      
004192       03 S422-125-CTA-CVEINST          PIC 9(02) COMP.           336200      
004193       03 S422-125-CTA-NUMPREF          PIC 9(04) COMP.           336300      
004194       03 S422-125-CTA-NUM              PIC 9(12) COMP.           336400      
004195       03 S422-125-CTA-NUMSUC           PIC 9(04) COMP.           336500      
004196       03 S422-125-CTA-CVESTATUS        PIC 9(02) COMP.           336600      
004197       03 S422-125-CTA-CVEMANEJO        PIC 9(02) COMP.           336700      
004198       03 S422-125-CTA-FEAPER-2K        PIC 9(08) COMP.           336800      
004199       03 S422-125-CTA-FEULMO-2K        PIC 9(08) COMP.           336900      
004200       03 S422-125-CTA-VENDNOM          PIC 9(10) COMP.           337000      
004201       03 S422-125-CTA-VENDSUC          PIC 9(04) COMP.           337100      
004202       03 S422-125-CTR-STATUSREG        PIC 9(02) COMP.           337200      
004203       03 S422-125-CTR-FECREG           PIC 9(08) COMP.           337300      
004204 77  R422-125-CTR-ERROR                 PIC S9(11) BINARY.        337400      
004205                                                                  337500      
004206******************************************************************337600      
004207**   PARAMETROS S016_L422_CTESCORE      (126)                   **337700      
004208**   CONSULTA SCORE DEL CLIENTE                                 **337800      
004209******************************************************************337900      
004210 01 E422-126-CTR-ENTRADA.                                         338000      
004211   03 E422-126-CTE-NUM           PIC 9(012) COMP.                 338100      
004212                                                                  338200      
004213                                                                  338300      
004214 01 S422-126-CTR-SALIDA.                                          338400      
004215   03  S422-126-CTE-NUM          PIC 9(12) COMP.                  338500      
004216   03  S422-126-CTE-REF          PIC 9(4)  COMP.                  338600      
004217                                                                  338700      
004218 77 R422-126-CTR-ERROR           PIC S9(11) BINARY.               338800      
004219                                                                  338900      
004220                                                                  339000      
004221******************************************************************339100      
004222**   PARAMETROS S016_L422_B07SXCTARELCREDCH (127)               **339200      
004223**   CONSULTA DE CREDICHEQUERA.                                 **339300      
004224******************************************************************339400      
004225 01 E422-127-CTR-ENTRADA.                                         339500      
004226    03 E422-127-CTA-NUMPROREL     PIC 9(004) COMP.                339600      
004227    03 E422-127-CTA-CVEINSREL     PIC 9(004) COMP.                339700      
004228    03 E422-127-CTA-NUMPREREL     PIC 9(004) COMP.                339800      
004229    03 E422-127-CTA-NUMREL        PIC 9(012) COMP.                339900      
004230    03 E422-127-OPCION            PIC 9(002) COMP.                340000      
004231    03 FILLER                     PIC X(043).                     340100      
004232                                                                  340200      
004233 01 S422-127-CTR-SALIDA.                                          340300      
004234    03 S422-127-CTR-NUMCSI        PIC 9(002) COMP.                340400      
004235    03 S422-127-CTE-NUM           PIC 9(012) COMP.                340500      
004236    03 S422-127-CTA-NUMPROD       PIC 9(004) COMP.                340600      
004237    03 S422-127-CTA-CVEINST       PIC 9(004) COMP.                340700      
004238    03 S422-127-CTA-NUMCTO        PIC 9(016) COMP.                340800      
004239    03 S422-127-CTA-NUMCTORED REDEFINES S422-127-CTA-NUMCTO.      340900      
004240       05 S422-127-CTA-NUMPREF    PIC 9(004) COMP.                341000      
004241       05 S422-127-CTA-NUM        PIC 9(012) COMP.                341100      
004242                                                                  341200      
004243 77 R422-127-CTR-ERROR            PIC S9(11) BINARY.              341300      
004244******************************************************************341400      
004245******************************************************************341500      
004246**   PARAMETROS S016_L422_B65SxCte          (128)               **341600      
004247**   Consulta de Telefonos                                      **341700      
004248**   opcion       Llave           Descripcion                   **341800      
004249**      1         cte-num         busqueda por numero de cte    **341900      
004250**      2         cte-num         continuacion                  **342000      
004251**                tel-num                                       **342100      
004252**      3         tel-num         busqueda por numero de        **342200      
004253**      4         tel-num         continuacion                  **342300      
004254**                cte-num                                       **342400      
004255**                                                              **342500      
004256** R422-128-CTR-ERROR                                           **342600      
004257**        0       no hay error                                  **342700      
004258**        11      no existe el registro ( no cte )              **342800      
004259**        12      opcion invalida                               **342900      
004260**                                                              **343000      
004261**                                                              **343100      
004262**                                                              **343200      
004263**                                          socradesh oct 2k7   **343300      
004264******************************************************************343400      
004265******************************************************************343500      
004266                                                                  343600      
004267 77  R422-128-CTR-ERROR                   PIC S9(11) BINARY.      343700      
004268                                                                  343800      
004269 01 E422-128-CTR-ENTRADA.                                         343900      
004270    03 E422-128-CTE-NUM           PIC 9(012) COMP.                344000      
004271    03 E422-128-CTE-NUMTEL        PIC 9(016) COMP.                344100      
004272    03 E422-128-OPCION            PIC 9(002) COMP.                344200      
004273    03 FILLER                     PIC X(042)     .                344300      
004274                                                                  344400      
004275 01 S422-128-CTR-SALIDA.                                          344500      
004276    02 S422-128-NUMOCC                    PIC 9(02)  COMP.        344600      
004277    02 S422-128-NUMREGS           OCCURS  20.                     344700      
004278       03 S422-128-CTE-NUM                PIC 9(012) COMP.        344800      
004279       03 S422-128-CTE-NUMTEL             PIC 9(016) COMP.        344900      
004280       03 S422-128-CTE-EXT                PIC 9(008) COMP.        345000      
004281       03 S422-128-CTA-NUMPROD            PIC 9(004) COMP.        345100      
004282       03 S422-128-CTA-CVEINST            PIC 9(002) COMP.        345200      
004283       03 S422-128-CTE-FECULTLLA          PIC 9(008) COMP.        345300      
004284       03 S422-128-CTE-DOM                PIC 9(004) COMP.        345400      
004285       03 S422-128-CTE-CVETIPO            PIC 9(002) COMP.        345500      
004286       03 S422-128-CTE-NUMLLAM            PIC 9(008) COMP.        345600      
004287       03 S422-128-CTE-NUMLLAME           PIC 9(008) COMP.        345700      
004288       03 S422-128-CTE-MEDIO              PIC 9(002) COMP.        345800      
004289       03 S422-128-CTE-FECALTA            PIC 9(008) COMP.        345900      
004290       03 S422-128-CTE-CVESTATUS          PIC 9(002) COMP.        346000      
004291       03 S422-128-CTE-ORIGEN             PIC 9(004) COMP.        346100      
004292       03 S422-128-CTE-VIGEN              PIC 9(004) COMP.        346200      
004293       03 S422-128-CTE-FECULT             PIC 9(008) COMP.        346300      
004294       03 S422-128-CTE-REPRES             PIC 9(004) COMP.        346400      
004295       03 S422-128-CTE-NOMINA             PIC 9(012) COMP.        346500      
004296       03 S422-128-CTE-COFETTEL           PIC 9(004) COMP.        346600      
004297       03 S422-128-CTE-PAIS               PIC 9(004) COMP.        346700      
004298       03 S422-128-CTE-TIPREL             PIC 9(004) COMP.        346800      
004299       03 S422-128-CTE-TIMEZO             PIC 9(004) COMP.        346900      
004300       03 S422-128-CTE-PREFCEL            PIC 9(004) COMP.        347000      
004301                                                                  347100      
004302******************************************************************347200      
004303**                                                              **347300      
004304** FD DE PARAMETROS DEL ENTRYPOINT S016_L422_CTASINCORP (129)   **347400      
004305**    - CUENTAS INCORPORADAS                                    **347500      
004306**                                            MAT. ABEL NOGUERA **347600      
004307**                                                              **347700      
004308**                                                              **347800      
004309** se añadieron 3 campos nuevos a la entrada, para recibir el   **347900      
004310** MDA y poder continuar con la busqueda de forma adecuada      **348000      
004311** se agregaron MDA-NUMPREF , MDA-NUM , FILLER                  **348100      
004312**                                                              **348200      
004313**                                Zuma-ti 10MTP304 Abr 2k15     **348300      
004314******************************************************************348400      
004315*                                                                 348500      
004316*                         Long = 60 (hex) =  30 (ebcdic)          348600      
004317 01 E422-129-CTR-ENT.                                             348700      
004318    02 E422-129-LIB-OPC                PIC 9(02) COMP.            348800      
004319    02 E422-129-CTE-NUM                PIC 9(12) COMP.            348900      
004320    02 E422-129-CTA-PROD               PIC 9(04) COMP.            349000      
004321    02 E422-129-CTA-INST               PIC 9(02) COMP.            349100      
004322    02 E422-129-CTA-PREF               PIC 9(04) COMP.            349200      
004323    02 E422-129-CTA-NUM                PIC 9(12) COMP.            349300      
004324    02 E422-129-NUM-OCR                PIC 9(02) COMP.            349400      
004325    02 E422-129-MDA-NUMCTO                           .            349500      
004326       04 E422-129-MDA-NUMPREF         PIC 9(04) COMP.            349600      
004327       04 E422-129-MDA-NUM             PIC 9(12) COMP.            349700      
004328    02 E422-129-FILLER                 PIC X(06)     .            349800      
004329                                                                  349900      
004330*                                                                 350000      
004331 01 S422-129-CTR-SAL.                                             350100      
004332    02 S422-129-CSI-NUM                PIC 9(02) COMP.            350200      
004333    02 S422-129-CTE-NUM                PIC 9(12) COMP.            350300      
004334    02 S422-129-CTE-STATUS             PIC 9(02) COMP.            350400      
004335    02 S422-129-CTE-TIPPER             PIC 9(02) COMP.            350500      
004336    02 S422-129-CTE-CLASIF             PIC 9(02) COMP.            350600      
004337    02 S422-129-NUM-OCR                PIC 9(02) COMP.            350700      
004338    02 S422-129-HAY-MAS                PIC 9(02) COMP.            350800      
004339    02 S422-129-TABLA                  OCCURS 20 TIMES.           350900      
004340       03 S422-129-CTO-PROD            PIC 9(04) COMP.            351000      
004341       03 S422-129-CTO-INST            PIC 9(02) COMP.            351100      
004342       03 S422-129-CTA-PREF            PIC 9(04) COMP.            351200      
004343       03 S422-129-CTA-NUM             PIC 9(12) COMP.            351300      
004344       03 S422-129-CTA-STATUS          PIC 9(02) COMP.            351400      
004345       03 S422-129-CTA-SUCURS          PIC 9(04) COMP.            351500      
004346       03 S422-129-CTO-MONEDA          PIC 9(02) COMP.            351600      
004347       03 S422-129-CTA-MANEJO          PIC 9(02) COMP.            351700      
004348       03 S422-129-CTE-CVEENV          PIC 9(04) COMP.            351800      
004349       03 S422-129-CTE-FECALT          PIC 9(08) COMP.            351900      
004350       03 S422-129-CTE-FECMOD          PIC 9(08) COMP.            352000      
004351       03 S422-129-CTO-RELCTE          PIC 9(02) COMP.            352100      
004352       03 S422-129-CTO-USOBEL          PIC 9(02) COMP.            352200      
004353       03 S422-129-CTO-CVEASO          PIC 9(02) COMP.            352300      
004354       03 S422-129-CTA-3DIGIT          PIC 9(04) COMP.            352400      
004355       03 S422-129-CTA-TIPCTA          PIC 9(02) COMP.            352500      
004356       03 S422-129-CTA-SUBTIP          PIC 9(02) COMP.            352600      
004357       03 S422-129-CTA-CVETIT          PIC 9(02) COMP.            352700      
004358       03 S422-129-CTO-NUMCTA          PIC 9(16) COMP.            352800      
004359       03 S422-129-CTO-MDASTA          PIC 9(02) COMP.            352900      
004360       03 S422-129-CTA-PROFTI          PIC X(03).                 353000      
004361       03 S422-129-CTA-NOMTIT          PIC 9(04) COMP.            353100      
004362       03 S422-129-CTA-PROFCO          PIC X(03).                 353200      
004363       03 S422-129-CTA-NOMCOT          PIC 9(04) COMP.            353300      
004364       03 S422-129-CTA-PRESEN          PIC 9(02) COMP.            353400      
004365       03 S422-129-CTA-FECALT          PIC 9(08) COMP.            353500      
004366       03 S422-129-CTA-FECMOD          PIC 9(08) COMP.            353600      
004367                                                                  353700      
004368  77  R422-129-CTR-ERROR               PIC S9(11) BINARY.         353800      
004369                                                                  353900      
004370******************************************************************354000      
004371**                                                              **354100      
004372** FD DE PARAMETROS DEL ENTRYPOINT S016_L422_CTEBNMXCF  (131)   **354200      
004373**    - CLIENTE BANAMEX & CLIENTE CF                            **354300      
004374**                                        JOSE GUTIERREZ MOLINA.**354400      
004375******************************************************************354500      
004376 01 E422-131-CTR-ENT.                                             354600      
004377    02 E422-131-CTE-BNM                PIC 9(12) COMP.            354700      
004378    02 E422-131-CTE-CF                 PIC 9(18) COMP.            354800      
004379*                                                                 354900      
004380 01 S422-131-CTR-SAL.                                             355000      
004381    02 S422-131-CTE-NUM                PIC 9(12) COMP.            355100      
004382    02 S422-131-CTE-CF                 PIC 9(18) COMP.            355200      
004383    02 S422-131-CTO-PREFI              PIC 9(04) COMP.            355300      
004384    02 S422-131-CTO-CF                 PIC 9(12) COMP.            355400      
004385    02 S422-131-NUMPROD                PIC 9(04) COMP.            355500      
004386    02 S422-131-CVEINST                PIC 9(04) COMP.            355600      
004387    02 S422-131-TIPOASO                PIC 9(02) COMP.            355700      
004388 77  R422-131-CTR-ERROR                PIC S9(11) BINARY.         355800      
004389*                                                                 355900      
004390* INI GCV SOFTTEK NOV2007                                         356000      
004391*************************************************************     356100      
004392**   PARAMETROS S016_L422_B35CURP       (130)              **     356200      
004393**   CONSULTA B35 CURP                                     **     356300      
004394**                                                         **     356400      
004395**   R422-130-CTR-ERROR                                    **     356500      
004396**         0 = EXISTE CURP PARA EL CLIENTE                 **     356600      
004397**        10 = EL CLIENTE NO TIENE CURP                    **     356700      
004398**        99 = ERROR EN BD                                 **     356800      
004399**                                    GCV-SOFTTEK-NOV2007  **     356900      
004400*************************************************************     357000      
004401  01 E422-130-CTR-ENTRADA.                                        357100      
004402     03 E422-130-CTE-NUM                PIC 9(012) COMP.          357200      
004403     03 FILLER                          PIC X(054).               357300      
004404* SIZE ENTRADA X(60).                                             357400      
004405*                                                                 357500      
004406  01 S422-130-CTR-SALIDA.                                         357600      
004407     03 S422-130-CTE-NUM                PIC 9(012) COMP.          357700      
004408     03 S422-130-CTE-CURP               PIC X(021).               357800      
004409     03 FILLER                          PIC X(057).               357900      
004410* SIZE SALIDA X(84).                                              358000      
004411*                                                                 358100      
004412 77  R422-130-CTR-ERROR                 PIC S9(11) BINARY.        358200      
004413* FIN GCV SOFTTEK NOV2007                                         358300      
004414******************************************************************358400      
004415** PARAMETROS          S016_L422_CONS_TERS  (132)               **358500      
004416** Dialogo para consulta de cuentas y montos operables Terceros **358600      
004417** Banamex                                                      **358700      
004418******************************************************************358800      
004419*                                                                 358900      
004420 77 R422-132-CTR-ERROR                PIC S9(11) BINARY.          359000      
004421*                                                                 359100      
004422 01 E422-132-CTR-ENTRADA.                                         359200      
004423    02 E422-132-CTR-NUMCSI            PIC 9(02) COMP.             359300      
004424    02 E422-132-CTE-NUM               PIC 9(12) COMP.             359400      
004425    02 E422-132-CTO-NUM.                                          359500      
004426       03 E422-132-CTA-NUMPREF        PIC 9(04) COMP.             359600      
004427       03 E422-132-CTA-NUM            PIC 9(12) COMP.             359700      
004428    02 E422-132-CTA-OPCION            PIC 9(02) COMP.             359800      
004429    02 FILLER                         PIC X(44).                  359900      
004430*SIZE ENTRADA X(60).                                              360000      
004431*                                                                 360100      
004432  01 S422-132-CTR-SALIDA.                                         360200      
004433     02 S422-132-SER-LIMAXAUT         PIC 9(14) COMP.             360300      
004434     02 S422-132-SER-PERIODLIM        PIC X(01).                  360400      
004435     02 S422-132-CTE-NOM              PIC X(55).                  360500      
004436     02 S422-132-CTA-NOMBRE           PIC X(20).                  360600      
004437     02 S422-132-CTR-FEMOTE-2K        PIC 9(08) COMP.             360700      
004438     02 S422-132-CTR-STATUS           PIC 9(02) COMP.             360800      
004439     02 FILLER                        PIC X(06).                  360900      
004440* SIZE SALIDA X(90).                                              361000      
004441*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-**361100      
004442******************************************************************361200      
004443** PARAMETROS          S016_L422_CONS_INTER (133)               **361300      
004444** Dialogo para consulta de cuentas y montos operables          **361400      
004445** interbancarios                                               **361500      
004446******************************************************************361600      
004447*                                                                 361700      
004448 77 R422-133-CTR-ERROR                PIC S9(11) BINARY.          361800      
004449*                                                                 361900      
004450 01 E422-133-CTR-ENTRADA.                                         362000      
004451    02 E422-133-CTE-NUM               PIC 9(12) COMP.             362100      
004452    02 E422-133-CTA-CLABE-TARJ        PIC 9(20) COMP.             362200      
004453    02 E422-133-CTA-CLAVE-TARJ-R      REDEFINES                   362300      
004454                                      E422-133-CTA-CLABE-TARJ.    362400      
004455       03 E422-133-CTA-CLABE          PIC 9(04) COMP.             362500      
004456       03 E422-133-CTA-NUMPREF        PIC 9(04) COMP.             362600      
004457       03 E422-133-CTA-NUM            PIC 9(12) COMP.             362700      
004458    02 E422-133-CTE-NOMBENEF          PIC X(55).                  362800      
004459    02 E422-133-CTA-OPCION            PIC 9(02) COMP.             362900      
004460    02 E422-133-TIPO-CTA              PIC 9(02) COMP.             363000      
004461* JRR     STK     INI     ENE/09                                  363100      
004462    02 E422-133-ESTABL                PIC 9(06) COMP.             363200      
004463*   02 FILLER                         PIC X(23).                  363300      
004464    02 FILLER                         PIC X(20).                  363400      
004465* JRR     STK     FIN     ENE/09                                  363500      
004466*SIZE ENTRADA X(96).                                              363600      
004467*                                                                 363700      
004468  01 S422-133-CTR-SALIDA.                                         363800      
004469     02 S422-133-SER-LIMAXAUT         PIC 9(14) COMP.             363900      
004470     02 S422-133-SER-PERIODLIM        PIC X(01).                  364000      
004471*   SE DA COMO CONFIRMACION DEL NOMBRE DEL BENEF. ENCONTRADO      364100      
004472     02 S422-133-CTE-NOMBENEF         PIC X(55).                  364200      
004473     02 S422-133-CTA-NOMBRE           PIC X(20).                  364300      
004474     02 S422-133-CTR-FEMOTE-2K        PIC 9(08) COMP.             364400      
004475     02 S422-133-CTA-BCO              PIC 9(04) COMP.             364500      
004476     02 S422-133-CTR-STATUS           PIC 9(02) COMP.             364600      
004477     02 FILLER                        PIC X(06).                  364700      
004478* SIZE SALIDA X(96).                                              364800      
004479                                                                  364900      
004480                                                                  365000      
004481******************************************************************365100      
004482** PARAMETROS          S016_L422_CONS_EMAIL    (135)            **365200      
004483** Consulta del email  de un cliente                            **365300      
004484**                                recosntruido por zuma dic 2k9 **365400      
004485******************************************************************365500      
004486*                                                                 365600      
004487 01 E422-135-CTR-ENTRADA.                                         365700      
004488     03  E422-135-CTE-NUM                PIC 9(12) COMP.          365800      
004489     03  E422-135-CTA-NUMPROD            PIC 9(04) COMP.          365900      
004490     03  E422-135-CTA-CVEINST            PIC 9(02) COMP.          366000      
004491     03  E422-135-CTA-NUMPREF            PIC 9(04) COMP.          366100      
004492     03  E422-135-CTA-NUM                PIC 9(12) COMP.          366200      
004493     03  E422-135-CTR-TIPODE             PIC 9(02) COMP.          366300      
004494     03  E422-135-CTR-NUMDOME            PIC 9(04) COMP.          366400      
004495     03  FILLER                          PIC X(40).               366500      
004496                                                                  366600      
004497* SIZE ENTRADA X(60).                                             366700      
004498*                                                                 366800      
004499                                                                  366900      
004500 01 S422-135-CTR-SALIDA.                                          367000      
004501     03  S422-135-CTE-EMAIL              PIC X(78).               367100      
004502     03  FILLER                          PIC X(42).               367200      
004503                                                                  367300      
004504* SIZE SALIDA X(120).                                             367400      
004505                                                                  367500      
004506  77  R422-135-CTR-ERROR                  PIC S9(11) BINARY.      367600      
004507                                                                  367700      
004508                                                                  367800      
004509                                                                  367900      
004510******************************************************************368000      
004511**                S016_L422_CONSMARCASCTE (137)                 **368100      
004512**            Consulta de  b74, Marcas del cliente              **368200      
004513**                                                              **368300      
004514******************************************************************368400      
004515*                                                                 368500      
004516 01 E422-137-CTR-ENTRADA.                                         368600      
004517     02  E422-137-CTE-NUM                PIC 9(12) .              368700      
004518*      NUMERO DE CLIENTE                                          368800      
004519     02  E422-137-CTR-SERVICIO           PIC 9(04) .              368900      
004520*      NUMERO DE SERVICIO                                         369000      
004521     02  E422-137-CTR-TIPO               PIC 9(02) .              369100      
004522*      TIPO DE SERVICIO                                           369200      
004523     02  E422-137-CTR-CONCEPTO           PIC 9(08) .              369300      
004524*      TIPO DE CONCEPTO                                           369400      
004525          02  E422-137-CTR-OPCION        PIC 9(02) .              369500      
004526*      OPCION 1 = CONSULTA                                        369600      
004527     02  FILLER                          PIC X(50).               369700      
004528                                                                  369800      
004529* SIZE ENTRADA X(70).                                             369900      
004530*                                                                 370000      
004531                                                                  370100      
004532 01 S422-137-CTR-SALIDA.                                          370200      
004533          02  S422-137-CTE-NUM            PIC 9(12).              370300      
004534          02  S422-137-CTR-SERVICIO       PIC 9(04).              370400      
004535          02  S422-137-CTR-TIPO           PIC 9(02).              370500      
004536          02  S422-137-CTR-VALCON         PIC 9(08).              370600      
004537*         VALOR DEL CONCEPTO                                      370700      
004538          02  S422-137-CTR-RESULT         PIC 9(02).              370800      
004539          02  FILLER                      PIC X(50).              370900      
004540                                                                  371000      
004541* SIZE SALIDA X(74).                                              371100      
004542                                                                  371200      
004543  77  R422-137-CTR-ERROR                  PIC S9(11) BINARY.      371300      
004544                                                                  371400      
004545******************************************************************371500      
004546**                  S016_L422_ CTASINCCOBRA    (138)            **371600      
004547** Consulta de cuentas incorporadas para cobranza universal     **371700      
004548**                                                              **371800      
004549******************************************************************371900      
004550*                                                                 372000      
004551 01 E422-138-CTR-ENTRADA.                                         372100      
004552    02 E422-138-LIB-OPC                   PIC 9(02) COMP.         372200      
004553*         OPCION                                                  372300      
004554    02 E422-138-CTE-NUM                   PIC 9(12) COMP.         372400      
004555*         NUMERO DE CLIENTE                                       372500      
004556    02 E422-138-CTA-PROD                  PIC 9(04) COMP.         372600      
004557*         PRODUCTO                                                372700      
004558    02 E422-138-CTA-INST                  PIC 9(02) COMP.         372800      
004559*         INSTRUMENTO                                             372900      
004560    02 E422-138-CTA-PREF                  PIC 9(04) COMP.         373000      
004561*         PREFIJO DE LA CUENTA                                    373100      
004562    02 E422-138-CTA-NUM                   PIC 9(12) COMP.         373200      
004563*         NUMERO DE CUENTA                                        373300      
004564    02 E422-138-MDA-CVETIPO               PIC 9(02) COMP.         373400      
004565*         tipo de medio de acceso                                 373500      
004566    02 E422-138-MDA-CVETIT                PIC 9(02) COMP.         373600      
004567*         titularidad de medio de acceso                          373700      
004568    02 E422-138-MDA-NUM                   PIC 9(12) COMP.         373800      
004569*         N³mero de medio de acceso                               373900      
004570    02 E422-138-NUM-OCR                   PIC 9(02) COMP.         374000      
004571*         OCURRENCIAS                                             374100      
004572    02 FILLER                             PIC X(11).              374200      
004573                                                                  374300      
004574* SIZE ENTRADA X(30).                                             374400      
004575*                                                                 374500      
004576 01 S422-138-CTR-SALIDA.                                          374600      
004577    02 S422-138-CSI-NUM                   PIC 9(02) COMP.         374700      
004578    02 S422-138-CTE-NUM                   PIC 9(12) COMP.         374800      
004579    02 S422-138-CTE-STATUS                PIC 9(02) COMP.         374900      
004580    02 S422-138-CTE-TIPPER                PIC 9(02) COMP.         375000      
004581    02 S422-138-CTE-CLASIF                PIC 9(02) COMP.         375100      
004582    02 S422-138-NUM-OCR                   PIC 9(02) COMP.         375200      
004583    02 S422-138-HAY-MAS                   PIC 9(02) COMP.         375300      
004584    02 S422-138-TABLA                   OCCURS 15 TIMES.          375400      
004585*      datos cuenta B04                                           375500      
004586       03 S422-138-CTA-PROD               PIC 9(04) COMP.         375600      
004587       03 S422-138-CTA-INST               PIC 9(02) COMP.         375700      
004588       03 S422-138-CTA-PREF               PIC 9(04) COMP.         375800      
004589       03 S422-138-CTA-NUM                PIC 9(12) COMP.         375900      
004590       03 S422-138-CTA-STATUS             PIC 9(02) COMP.         376000      
004591       03 S422-138-CTA-SUCURS             PIC 9(04) COMP.         376100      
004592       03 S422-138-CTA-MONEDA             PIC 9(02) COMP.         376200      
004593       03 S422-138-CTA-MANEJO             PIC 9(02) COMP.         376300      
004594       03 S422-138-CTA-CVEENV             PIC 9(04) COMP.         376400      
004595       03 S422-138-CTA-FECALT             PIC 9(08) COMP.         376500      
004596       03 S422-138-CTA-FECMOD             PIC 9(08) COMP.         376600      
004597*  La libreria no manda nada aqui                                 376700      
004598       03 S422-138-CTO-CVEREQ             PIC 9(02) COMP.         376800      
004599       03 S422-138-CTE-NOMCORTO           PIC X(26) .             376900      
004600*      datos cta incorporada B05                                  377000      
004601       03 S422-138-CTA-RELCTE             PIC 9(02) COMP.         377100      
004602       03 S422-138-CTA-USOBEL             PIC 9(02) COMP.         377200      
004603       03 S422-138-CTA-CVEASO             PIC 9(02) COMP.         377300      
004604       03 S422-138-CTA-3DIGIT             PIC 9(04) COMP.         377400      
004605*      medio de acceso B08                                        377500      
004606       03 S422-138-MDA-TIPCTA             PIC 9(02) COMP.         377600      
004607       03 S422-138-MDA-SUBTIP             PIC 9(02) COMP.         377700      
004608       03 S422-138-MDA-CVETIT             PIC 9(02) COMP.         377800      
004609       03 S422-138-MDA-CTAPREV            PIC 9(04) COMP.         377900      
004610       03 S422-138-MDA-CTANUM             PIC 9(12) COMP.         378000      
004611       03 S422-138-MDA-MDASTA             PIC 9(02) COMP.         378100      
004612       03 S422-138-MDA-PROFTI             PIC X(03) .             378200      
004613       03 S422-138-MDA-NOMTIT             PIC 9(04) COMP.         378300      
004614       03 S422-138-MDA-PROFCO             PIC X(03) .             378400      
004615       03 S422-138-MDA-NOMCOT             PIC 9(04) COMP.         378500      
004616       03 S422-138-MDA-PRESEN             PIC 9(02) COMP.         378600      
004617       03 S422-138-MDA-FECALT             PIC 9(08) COMP.         378700      
004618       03 S422-138-MDA-FECMOD             PIC 9(08) COMP.         378800      
004619  02 FILLER                               PIC X(114).             378900      
004620                                                                  379000      
004621* SIZE SALIDA X(1272).                                            379100      
004622                                                                  379200      
004623  77  R422-138-CTR-ERROR                  PIC S9(11) BINARY.      379300      
004624                                                                  379400      
004625******************************************************************379500      
004626**                  S016_L422_ B13SXCTA        (139)            **379600      
004627**        Consulta del dataset S016b13requerimientos            **379700      
004628**                                                              **379800      
004629******************************************************************379900      
004630*                                                                 380000      
004631  01 E422-139-CTR-ENTRADA.                                        380100      
004632     02 E422-139-LIB-OPC                PIC 9(02) COMP.           380200      
004633*         OPCION                                                  380300      
004634     02 E422-139-CTR-CSI                PIC 9(02) COMP.           380400      
004635*         NUMERO DE CSI                                           380500      
004636     02 E422-139-CTA-PROD               PIC 9(04) COMP.           380600      
004637*         PRODUCTO                                                380700      
004638     02 E422-139-CTA-INST               PIC 9(02) COMP.           380800      
004639*         INSTRUMENTO                                             380900      
004640     02 E422-139-CTA-PREF               PIC 9(04) COMP.           381000      
004641*         PREFIJO DE LA CUENTA                                    381100      
004642     02 E422-139-CTA-NUM                PIC 9(12) COMP.           381200      
004643*         NUMERO DE CUENTA                                        381300      
004644     02 FILLER                          PIC X(04).                381400      
004645                                                                  381500      
004646* SIZE ENTRADA X(17).                                             381600      
004647*                                                                 381700      
004648* datos de salida                                                 381800      
004649                                                                  381900      
004650  01 S422-139-CTR-SALIDA.                                         382000      
004651     02 S422-139-CSI-NUM                PIC 9(02) COMP.           382100      
004652     02 S422-139-CTA-CVEREQ             PIC 9(02) COMP.           382200      
004653     02 S422-139-CTA-NUMPROD            PIC 9(04) COMP.           382300      
004654     02 S422-139-CTA-CVEINST            PIC 9(02) COMP.           382400      
004655     02 S422-139-CTA-NUMCTO                           .           382500      
004656         03 S422-139-CTA-PREF           PIC 9(04) COMP.           382600      
004657         03 S422-139-CTA-NUM            PIC 9(12) COMP.           382700      
004658     02 S422-139-CTA-FECULTMOD          PIC 9(06) COMP.           382800      
004659     02 S422-139-CTA-FECULMO-2K         PIC 9(08) COMP.           382900      
004660     02 FILLER                          PIC X(40).                383000      
004661                                                                  383100      
004662* SIZE SALIDA X(60).                                              383200      
004663                                                                  383300      
004664  77  R422-139-CTR-ERROR                  PIC S9(11) BINARY.      383400      
004665                                                                  383500      
004666                                                                  383600      
004667                                                                  383700      
004668**********************************************************        383800      
004669***  PARAMETROS PARA ENTRY POINT S016_L422_COMXCTA (140)          383900      
004670***   CONSULTA AL S016B69EXTERNAS COMPLETO.                       384000      
004671**********************************************************        384100      
004672 01 E422-140-CTR-ENTRADA.                                         384200      
004673*     opcion                                                      384300      
004674    02 E422-140-CTR-OPC                          PIC 9(0002) COMP.384400      
004675*     numero de cliente                                           384500      
004676    02 E422-140-B69-CTE-NUM                      PIC 9(0012) COMP.384600      
004677*     banco                                                       384700      
004678    02 E422-140-B69-CTA-BANCO                    PIC 9(0004) COMP.384800      
004679*     cuenta, clabe o tarjeta                                     384900      
004680    02 E422-140-B69-CTA-CLABE-TAR                PIC 9(0020) COMP.385000      
004681*     espacio disponible                                          385100      
004682    02 E422-140-FILLER                           PIC X(0040).     385200      
004683                                                                  385300      
004684 01 S422-140-CTR-SALIDA.                                          385400      
004685*     numero de cliente                                           385500      
004686    02 S422-140-B69-CTE-NUM                      PIC 9(0012) COMP.385600      
004687*     numero de ocurrencias devueltas                             385700      
004688    02 S422-140-CTR-NUMOC                        PIC 9(0002) COMP.385800      
004689*     indicardor existen mas registros                            385900      
004690    02 S422-140-CTR-HAYMAS                       PIC 9(0002) COMP.386000      
004691    02 S422-140-TABLA OCCURS 015 TIMES.                           386100      
004692*        cuenta, clabe o tarjeta                                  386200      
004693       03 S422-140-B69-CTA-CLABE-TAR             PIC 9(0020) COMP.386300      
004694*        banco                                                    386400      
004695       03 S422-140-B69-CTA-BANCO                 PIC 9(0004) COMP.386500      
004696*        sucursal                                                 386600      
004697       03 S422-140-B69-CTA-SUC                   PIC 9(0004) COMP.386700      
004698*        numero de prospecto                                      386800      
004699       03 S422-140-B69-CTE-NUMPROS               PIC 9(0012) COMP.386900      
004700*        tipo de cuenta                                           387000      
004701       03 S422-140-B69-CTA-CUENTIP               PIC 9(0002) COMP.387100      
004702*        tipo de moneda                                           387200      
004703       03 S422-140-B69-CTA-CVEMONEDA             PIC 9(0002) COMP.387300      
004704*        codigo swift                                             387400      
004705       03 S422-140-B69-CTR-CODSWIFT              PIC X(0012).     387500      
004706*        codigo aba                                               387600      
004707       03 S422-140-B69-CTR-CODABA                PIC X(0010).     387700      
004708*        medio alta de la cuenta                                  387800      
004709       03 S422-140-B69-CTA-MEDALTA               PIC 9(0004) COMP.387900      
004710*        gerencia de cuenta                                       388000      
004711       03 S422-140-B69-CTR-GERCTA                PIC 9(0002) COMP.388100      
004712*        tipo de persona                                          388200      
004713       03 S422-140-B69-CTE-CVEPERS               PIC 9(0002) COMP.388300      
004714*        alias                                                    388400      
004715       03 S422-140-B69-CTA-ALIAS                 PIC X(0020).     388500      
004716*        sector economico                                         388600      
004717       03 S422-140-B69-CTE-CVESECTOR             PIC 9(0002) COMP.388700      
004718*        limite maximo a pagar                                    388800      
004719       03 S422-140-B69-CTR-LIMAXUT               PIC 9(0014) COMP.388900      
004720*        periodicidad del limite                                  389000      
004721       03 S422-140-B69-SER-PERIODLIM             PIC X(0001).     389100      
004722*        cve unica registro pobl                                  389200      
004723       03 S422-140-B69-CTE-CURP                  PIC X(0018).     389300      
004724*        numero de establecimiento                                389400      
004725       03 S422-140-B69-CTR-NUMESTABL             PIC 9(0006) COMP.389500      
004726*        referencia                                               389600      
004727       03 S422-140-B69-CTR-REFE                  PIC X(0030).     389700      
004728*        fecha de alta                                            389800      
004729       03 S422-140-B69-CTR-FEALTA-2K             PIC 9(0008) COMP.389900      
004730*        fecha de modificacion                                    390000      
004731       03 S422-140-B69-CTR-FECMOD-2K             PIC 9(0008) COMP.390100      
004732*        fecha ultima consulta                                    390200      
004733       03 S422-140-B69-CTA-FULCON-2K             PIC 9(0008) COMP.390300      
004734*        fecha de baja                                            390400      
004735       03 S422-140-B69-CTR-FBAJA-2K              PIC 9(0008) COMP.390500      
004736*     espacio disponible                                          390600      
004737    02 S422-140-FILLER                           PIC X(0040).     390700      
004738                                                                  390800      
004739                                                                  390900      
004740  77  R422-140-CTR-ERROR                  PIC S9(11) BINARY.      391000      
004741                                                                  391100      
004742**********************************************************        391200      
004743***  PARAMETROS PARA ENTRY POINT S016_L422_PROSP   (141)          391300      
004744***   CONSULTA AL S016B63PROSCTE.                                 391400      
004745**********************************************************        391500      
004746 01 E422-141-CTR-ENTRADA.                                         391600      
004747*     opcion                                                      391700      
004748    02 E422-141-CTR-OPC                          PIC 9(0002).     391800      
004749*     numero de cliente                                           391900      
004750    02 E422-141-B63-CTENUM                       PIC 9(0012).     392000      
004751*     numero de prospecto                                         392100      
004752    02 E422-141-B63-CTE-NUMPROS                  PIC 9(0012).     392200      
004753*     espacio disponible                                          392300      
004754    02 E422-141-FILLER                           PIC X(0040).     392400      
004755                                                                  392500      
004756 01 S422-141-CTR-SALIDA.                                          392600      
004757*     numero de cliente                                           392700      
004758    02 S422-141-B63-CTENUM                       PIC 9(0012) COMP.392800      
004759*     numero de ocurrencias devueltas                             392900      
004760    02 S422-141-CTR-NUMOC                        PIC 9(0002) COMP.393000      
004761*     indicardor existen mas registros                            393100      
004762    02 S422-141-CTR-HAYMAS                       PIC 9(0002) COMP.393200      
004763   02 S422-141-TABLA OCCURS 015 TIMES.                            393300      
004764*        numero de producto                                       393400      
004765       03 S422-141-B63-CTA-NUMPROD               PIC 9(0004) COMP.393500      
004766*        numero de instrumento                                    393600      
004767       03 S422-141-B63-CTA-CVEINST               PIC 9(0002) COMP.393700      
004768*        prefijo                                                  393800      
004769       03 S422-141-B63-CTA-NUMPREF               PIC 9(0004) COMP.393900      
004770*        numero de cuenta                                         394000      
004771       03 S422-141-B63-CTA-NUM                   PIC 9(0012) COMP.394100      
004772*        numero de prospecto                                      394200      
004773       03 S422-141-B63-CTE-NUMPROS               PIC 9(0012) COMP.394300      
004774*        tipo de prospecto                                        394400      
004775       03 S422-141-B63-CTE-TIPPROS               PIC 9(0004) COMP.394500      
004776*        sucursal que lleva la cuenta                             394600      
004777       03 S422-141-B63-CTA-NUMSUC                PIC 9(0004) COMP.394700      
004778*        tipo de parentesco                                       394800      
004779       03 S422-141-B63-CTR-CVETITCTE             PIC 9(0004) COMP.394900      
004780*        nombre del prospecto                                     395000      
004781       03 S422-141-B63-CTE-NOM                   PIC X(0100).     395100      
004782*        calle y numero                                           395200      
004783       03 S422-141-B63-CTE-CALLENUM              PIC X(0036).     395300      
004784*        colonia                                                  395400      
004785       03 S422-141-B63-CTE-NOMCOL                PIC X(0024).     395500      
004786*        poblacion                                                395600      
004787       03 S422-141-B63-CTE-NOMPOB                PIC X(0020).     395700      
004788*        estado                                                   395800      
004789       03 S422-141-B63-CTE-CVEEDO                PIC 9(0002) COMP.395900      
004790*        codigo postal                                            396000      
004791       03 S422-141-B63-CTE-NUMCP                 PIC 9(0006) COMP.396100      
004792*        numero telefonico                                        396200      
004793       03 S422-141-B63-CTE-NUMTEL                PIC 9(0010) COMP.396300      
004794*        extension telefonica                                     396400      
004795       03 S422-141-B63-CTE-NUMTELEXT             PIC 9(0006) COMP.396500      
004796*        cve telefono,casa,oficina,fax                            396600      
004797       03 S422-141-B63-CTE-CVETEL                PIC 9(0002) COMP.396700      
004798*        numero telefono 2                                        396800      
004799       03 S422-141-B63-CTE-NUMTEL2               PIC 9(0010) COMP.396900      
004800*        numero extencion 2                                       397000      
004801       03 S422-141-B63-CTE-NUMTELEX2             PIC 9(0006) COMP.397100      
004802*        cve telefono2,casa,ofi.,fax                              397200      
004803       03 S422-141-B63-CTE-CVETEL2               PIC 9(0002) COMP.397300      
004804*        status del domicilio                                     397400      
004805       03 S422-141-B63-CTR-CVESTADOM             PIC 9(0002) COMP.397500      
004806*        clave del domicilio                                      397600      
004807       03 S422-141-B63-CTR-CVEDOM                PIC 9(0002) COMP.397700      
004808*        estado civil del prospecto                               397800      
004809       03 S422-141-B63-CTE-EDOCIVIL              PIC 9(0002) COMP.397900      
004810*        iniciales del rfc                                        398000      
004811       03 S422-141-B63-CTE-CODINI                PIC X(0004).     398100      
004812*        fecha del rfc aammdd                                     398200      
004813       03 S422-141-B63-CTE-FECNAC                PIC 9(0006) COMP.398300      
004814*        homonimia del rfc                                        398400      
004815       03 S422-141-B63-CTE-CODHOM                PIC X(0005).     398500      
004816*        persona fisica = 1, moral = 2                            398600      
004817       03 S422-141-B63-CTE-CVEPERS               PIC 9(0002) COMP.398700      
004818*        sexo masculino = 1, femenino = 2                         398800      
004819       03 S422-141-B63-CTE-CVESEXO               PIC 9(0002) COMP.398900      
004820*        nacionalidad del prospecto                               399000      
004821       03 S422-141-B63-CTE-CVENACION             PIC 9(0002) COMP.399100      
004822*        pais de origen del prospecto                             399200      
004823       03 S422-141-B63-CTE-PAIS                  PIC 9(0004) COMP.399300      
004824*        fecha de nacimiento del benef                            399400      
004825       03 S422-141-B63-CTE-FECNACIM              PIC 9(0008) COMP.399500      
004826*        fecha de alta del benef aaaammdd                         399600      
004827       03 S422-141-B63-CTE-FEALTA-2K             PIC 9(0008) COMP.399700      
004828*        fecha ultima modificacion aaaammdd                       399800      
004829       03 S422-141-B63-CTE-FEULMO-2K             PIC 9(0008) COMP.399900      
004830*        estatus del prospecto                                    400000      
004831       03 S422-141-B63-CTE-CVESTATUS             PIC 9(0002) COMP.400100      
004832*        correo electronico                                       400200      
004833       03 S422-141-B63-CTE-EMAIL                 PIC X(0078).     400300      
004834*     espacio disponible                                          400400      
004835    02 S422-141-FILLER                           PIC X(0040).     400500      
004836                                                                  400600      
004837 77 R422-141-CTR-ERROR                  PIC S9(11) BINARY.        400700      
004838                                                                  400800      
004839**********************************************************        400900      
004840***  PARAMETROS PARA ENTRY POINT S016_L422_MDAVIRTUAL (142)       401000      
004841***   CONSULTA AL S016B73MDAVIRTUAL.                              401100      
004842**********************************************************        401200      
004843 01 E422-142-CTR-ENTRADA.                                         401300      
004844*     opcion                                                      401400      
004845    02 E422-142-OPC                              PIC 9(0002) COMP.401500      
004846*     numero de cliente                                           401600      
004847    02 E422-142-CTE-NUM                          PIC 9(0012) COMP.401700      
004848*     numero de producto                                          401800      
004849    02 E422-142-CTA-PROD                         PIC 9(0004) COMP.401900      
004850*     numero de instrumento                                       402000      
004851    02 E422-142-CTA-INST                         PIC 9(0002) COMP.402100      
004852*     numero de prefijo                                           402200      
004853    02 E422-142-CTA-PREF                         PIC 9(0004) COMP.402300      
004854*     numero de cuenta                                            402400      
004855    02 E422-142-CTA-NUM                          PIC 9(0012) COMP.402500      
004856*     Alias                                                       402600      
004857    02 E422-142-ALIAS                            PIC X(0026).     402700      
004858*     tipo de medio de acceso                                     402800      
004859    02 E422-142-MDA-CVETIPO                      PIC 9(0002) COMP.402900      
004860*     titularidad                                                 403000      
004861    02 E422-142-MDA-NUMPREF                      PIC 9(0004) COMP.403100      
004862*     prefijo del medio de acceso                                 403200      
004863    02 E422-142-MDA-NUM                          PIC 9(0012) COMP.403300      
004864*     numero de cuenta del medio                                  403400      
004865    02 FILLER                                    PIC X(0200).     403500      
004866                                                                  403600      
004867 01 S422-142-CTR-SALIDA.                                          403700      
004868*   numero de cliente                                             403800      
004869    02 S422-142-CTE-NUM                       PIC 9(0012) COMP.   403900      
004870*   numero de producto                                            404000      
004871    02 S422-142-CTA-NUMPROD                   PIC 9(0004) COMP.   404100      
004872*   numero de instrumento                                         404200      
004873    02 S422-142-CTA-CVEINST                   PIC 9(0002) COMP.   404300      
004874*   prefijo del medio de acceso                                   404400      
004875    02 S422-142-CTA-NUMPREF                   PIC 9(0004) COMP.   404500      
004876*   numero de cuenta del medio                                    404600      
004877    02 S422-142-CTA-NUM                       PIC 9(0012) COMP.   404700      
004878*   numero de ocurrencias devueltas                               404800      
004879    02 S422-142-CTR-NUMOC                     PIC 9(0002) COMP.   404900      
004880*   indicardor existen mas registros                              405000      
004881    02 S422-142-CTR-HAYMAS                    PIC 9(0002) COMP.   405100      
004882                                                                  405200      
004883    02 S422-142-TABLA OCCURS 010 TIMES.                           405300      
004884*      Cvetipo de medio de acceso                                 405400      
004885       03 S422-142-MDA-CVETIPO                   PIC 9(0002) COMP.405500      
004886*      subtipo de medio de acceso                                 405600      
004887       03 S422-142-MDA-SUBTIPO                   PIC 9(0002) COMP.405700      
004888*      titularidad                                                405800      
004889       03 S422-142-MDA-CVETIT                    PIC 9(0002) COMP.405900      
004890*      prefijo del medio de acceso                                406000      
004891       03 S422-142-MDA-NUMPREF                   PIC 9(0004) COMP.406100      
004892*      numero de cuenta del medio                                 406200      
004893       03 S422-142-MDA-NUM                       PIC 9(0012) COMP.406300      
004894*      titulo prof. para nonbre tit                               406400      
004895       03 S422-142-MDA-ABRPROFT                  PIC X(0003).     406500      
004896*      alias del cliente                                          406600      
004897       03 S422-142-CTE-ALIAS                     PIC X(0026).     406700      
004898*      titulo prof. para nombre cot.                              406800      
004899       03 S422-142-MDA-ABRPROFC                  PIC X(0003).     406900      
004900*      numero de talonarios en dotacion                           407000      
004901       03 S422-142-MDA-NUMTALON                  PIC 9(0002) COMP.407100      
004902*      numero de cheques por talonario                            407200      
004903       03 S422-142-MDA-CHQXTALON                 PIC 9(0002) COMP.407300      
004904*      clave secreta para BCAELEC                                 407400      
004905       03 S422-142-MDA-CVEPIN                    PIC 9(0006) COMP.407500      
004906*      estatus del medio                                          407600      
004907       03 S422-142-MDA-CVESTATUS                 PIC 9(0002) COMP.407700      
004908*      periodo del vencimiento                                    407800      
004909       03 S422-142-MDA-PERIODO                   PIC 9(0002) COMP.407900      
004910*      situacion del medio                                        408000      
004911       03 S422-142-MDA-SITUACION                 PIC X(0004).     408100      
004912*      envio de correspondencia                                   408200      
004913       03 S422-142-MDA-CVEENVIO                  PIC 9(0002) COMP.408300      
004914*      fecha de alta del medio AAAAMMDD                           408400      
004915       03 S422-142-MDA-FECALTA                   PIC 9(0008) COMP.408500      
004916*      fec ultima modificacion AAAAMMDD                           408600      
004917       03 S422-142-MDA-FEULMO                    PIC 9(0008) COMP.408700      
004918*      fecha del ultimo acceso AAAAMMDD                           408800      
004919       03 S422-142-MDA-FEULAC                    PIC 9(0008) COMP.408900      
004920*      fecha de vencimiento    AAAAMMDD                           409000      
004921       03 S422-142-MDA-FEVENC                    PIC 9(0008) COMP.409100      
004922*      fecha de cancelacion    AAAAMMDD                           409200      
004923       03 S422-142-MDA-FECANC                    PIC 9(0008) COMP.409300      
004924*      fecha de modificacion del PIN                              409400      
004925       03 S422-142-MDA-FEMOPI                    PIC 9(0008) COMP.409500      
004926*      hora de prevencion     HHMM                                409600      
004927       03 S422-142-MDA-HHPREV                    PIC 9(0004) COMP.409700      
004928*      hora de alta           HHMM                                409800      
004929       03 S422-142-MDA-HHALTA                    PIC 9(0004) COMP.409900      
004930*      hora de ultima modificacion HHMM                           410000      
004931       03 S422-142-MDA-HHULTMOD                  PIC 9(0004) COMP.410100      
004932*      hora de ultimo acceso       HHMM                           410200      
004933       03 S422-142-MDA-HHULTACC                  PIC 9(0004) COMP.410300      
004934*      hora de vencimiento         HHMM                           410400      
004935       03 S422-142-MDA-HHVENC                    PIC 9(0004) COMP.410500      
004936                                                                  410600      
004937*     espacio disponible                                          410700      
004938    02 S422-142-FILLER                           PIC X(0050).     410800      
004939                                                                  410900      
004940 77  R422-142-CTR-ERROR                  PIC S9(11) BINARY.       411000      
004941                                                                  411100      
004942******************************************************************411200      
004943***    PARAMETROS  S016_L422_EXTERNAS    (144)                 ***411300      
004944****   CONSULTA S016B69EXTERNAS                                 **411400      
004945******************************************************************411500      
004946*                                                                 411600      
004947 77  R422-144-CTR-ERROR                   PIC S9(11) BINARY.      411700      
004948*                                                                 411800      
004949 01  E422-144-CTR-ENTRADA.                                        411900      
004950     03 E422-144-CTE-NUM                  PIC 9(012) COMP.        412000      
004951     03 E422-144-CTA-CLABE-TAR            PIC 9(020) COMP.        412100      
004952     03 E422-144-CTA-BANCO                PIC 9(004) COMP.        412200      
004953     03 E422-144-CTE-NUMPROSP             PIC 9(012) COMP.        412300      
004954     03 E422-144-CTA-CUENTIP              PIC 9(002) COMP.        412400      
004955     03 E422-144-CTR-NUMESTABL            PIC 9(006) COMP.        412500      
004956     03 E422-144-CTR-OPCION               PIC 9(002) COMP.        412600      
004957     03 FILLER                            PIC X(002).             412700      
004958* SIZE ENTRADA X(60)*                                             412800      
004959*                                                                 412900      
004960 01  S422-144-CTR-SALIDA.                                         413000      
004961     03 S422-144-CTE-NUM                PIC 9(012) COMP.          413100      
004962     03 S422-144-CTA-CLABE-TAR          PIC 9(020) COMP.          413200      
004963     03 S422-144-CTA-BANCO              PIC 9(004) COMP.          413300      
004964     03 S422-144-CTA-SUC                PIC 9(004) COMP.          413400      
004965     03 S422-144-CTE-NUMPROS            PIC 9(012) COMP.          413500      
004966     03 S422-144-CTA-CUENTIP            PIC 9(002) COMP.          413600      
004967     03 S422-144-CTA-CVEMONEDA          PIC 9(002) COMP.          413700      
004968     03 S422-144-CTR-CODSWIFT           PIC X(012).               413800      
004969     03 S422-144-CTR-CODABA             PIC X(010).               413900      
004970     03 S422-144-CTA-MEDALTA            PIC 9(004) COMP.          414000      
004971     03 S422-144-CTR-GERCTA             PIC 9(002) COMP.          414100      
004972     03 S422-144-CTE-CVEPERS            PIC 9(002) COMP.          414200      
004973     03 S422-144-CTA-ALIAS              PIC X(020).               414300      
004974     03 S422-144-CTE-CVESECTOR          PIC 9(002) COMP.          414400      
004975     03 S422-144-CTR-LIMAXUT            PIC 9(014) COMP.          414500      
004976     03 S422-144-SER-PERIODLIM          PIC X(001).               414600      
004977     03 S422-144-CTE-CURP               PIC X(018).               414700      
004978     03 S422-144-CTR-NUMESTABL          PIC 9(006) COMP.          414800      
004979     03 S422-144-CTR-REFE               PIC X(030).               414900      
004980     03 S422-144-CTR-FEALTA-2K          PIC 9(008) COMP.          415000      
004981     03 S422-144-CTR-FECMOD-2K          PIC 9(008) COMP.          415100      
004982     03 S422-144-CTA-FULCON-2K          PIC 9(008) COMP.          415200      
004983     03 S422-144-CTR-FBAJA-2K           PIC 9(008) COMP.          415300      
004984     03 S422-144-CTE-SERVNUM            PIC 9(004) COMP.          415400      
004985     03 S422-144-CTR-HORALTA            PIC 9(008) COMP.          415500      
004986                                                                  415600      
004987                                                                  415700      
004988                                                                  415800      
004989  01  S422-144-RCTR-SALIDA REDEFINES S422-144-CTR-SALIDA.         415900      
004990     03 S422-144-CTR-ERROR                 PIC 9(004)    COMP.    416000      
004991     03 S422-144-CTR-ERRORTYPE             PIC 9(004)    COMP.    416100      
004992     03 S422-144-CTR-STRUCTURE             PIC 9(004)    COMP.    416200      
004993     03 FILLER                            PIC X(140).             416300      
004994******************************************************************416400      
004995******************************************************************416500      
004996***    PARAMETROS  S016_L422_TERCEROS_HH    (145)              ***416600      
004997****   CONSULTA S016B11TERCEROS CON HH                          **416700      
004998******************************************************************416800      
004999*                                                                 416900      
005000 77  R422-145-CTR-ERROR                   PIC S9(11) BINARY.      417000      
005001*                                                                 417100      
005002 01  E422-145-CTR-ENTRADA.                                        417200      
005003     03 E422-145-CTE-NUM                PIC 9(012) COMP.          417300      
005004     03 E422-145-CTA-NUMPROD            PIC 9(004) COMP.          417400      
005005     03 E422-145-CTA-CVEINST            PIC 9(002) COMP.          417500      
005006     03 E422-145-CTA-NUMPREF            PIC 9(004) COMP.          417600      
005007     03 E422-145-CTA-NUM                PIC 9(012) COMP.          417700      
005008     03 E422-145-SER-CVEUSOCTA          PIC 9(002) COMP.          417800      
005009     03 E422-145-CTA-3DIGITOS           PIC 9(004) COMP.          417900      
005010     03 E422-145-CTR-OPCION             PIC 9(002) COMP.          418000      
005011     03 FILLER                          PIC X(018).               418100      
005012* SIZE ENTRADA X(60)*                                             418200      
005013*                                                                 418300      
005014 01  S422-145-CTR-SALIDA.                                         418400      
005015     03 S422-145-CTR-NUMCSI         PIC 9(002) COMP.              418500      
005016     03 S422-145-CTE-NUM            PIC 9(012) COMP.              418600      
005017     03 S422-145-CTA-NUMPROD        PIC 9(004) COMP.              418700      
005018     03 S422-145-CTA-CVEINST        PIC 9(002) COMP.              418800      
005019     03 S422-145-CTA-NUMPREF        PIC 9(004) COMP.              418900      
005020     03 S422-145-CTA-NUM            PIC 9(012) COMP.              419000      
005021     03 S422-145-SER-LIMAXAUT       PIC 9(014) COMP.              419100      
005022     03 S422-145-SER-PERIODLIM      PIC X(001).                   419200      
005023     03 S422-145-CTA-CVEMONEDA      PIC 9(002) COMP.              419300      
005024     03 S422-145-SER-CVEUSOCTA      PIC 9(002) COMP.              419400      
005025     03 S422-145-CTR-FECALTTER      PIC 9(006) COMP.              419500      
005026     03 S422-145-CTR-FECMODTER      PIC 9(006) COMP.              419600      
005027     03 S422-145-SER-FECFINVIG      PIC 9(004) COMP.              419700      
005028     03 S422-145-CTA-3DIGITOS       PIC 9(004) COMP.              419800      
005029     03 S422-145-CTR-FEALTE-2K      PIC 9(008) COMP.              419900      
005030     03 S422-145-CTR-FEMOTE-2K      PIC 9(008) COMP.              420000      
005031     03 S422-145-SER-FEFIVI-2K      PIC 9(006) COMP.              420100      
005032     03 S422-145-CTR-FBAJA-2K       PIC 9(008) COMP.              420200      
005033     03 S422-145-CTA-FULCON-2K      PIC 9(008) COMP.              420300      
005034     03 S422-145-CTA-ALIAS          PIC X(020) .                  420400      
005035     03 S422-145-CTA-MEDALTA        PIC 9(004) COMP.              420500      
005036     03 S422-145-CTR-GERCTA         PIC 9(002) COMP.              420600      
005037     03 S422-145-CTR-HORALTA        PIC 9(008) COMP.              420700      
005038                                                                  420800      
005039                                                                  420900      
005040                                                                  421000      
005041  01  S422-145-RCTR-SALIDA REDEFINES S422-145-CTR-SALIDA.         421100      
005042     03 S422-145-CTR-ERROR                 PIC 9(004)    COMP.    421200      
005043     03 S422-145-CTR-ERRORTYPE             PIC 9(004)    COMP.    421300      
005044     03 S422-145-CTR-STRUCTURE             PIC 9(004)    COMP.    421400      
005045     03 FILLER                             PIC X(078).            421500      
005046                                                                  421600      
005047******************************************************************421700      
005048** INFOWARE PROYECTO JFP MARZO 2010                         JRS **421800      
005049** FD DE PARAMETROS DEL ENTRYPOINT S016_L422_CTASINCORP2(143)   **421900      
005050******************************************************************422000      
005051 01 E422-143-CTR-ENT.                                             422100      
005052    02 E422-143-LIB-OPC                PIC 9(02) COMP.            422200      
005053    02 E422-143-CTE-NUM                PIC 9(12) COMP.            422300      
005054    02 E422-143-CTA-PROD               PIC 9(04) COMP.            422400      
005055    02 E422-143-CTA-INST               PIC 9(02) COMP.            422500      
005056    02 E422-143-CTA-PREF               PIC 9(04) COMP.            422600      
005057    02 E422-143-CTA-NUM                PIC 9(12) COMP.            422700      
005058    02 E422-143-NUM-OCR                PIC 9(02) COMP.            422800      
005059*** INICIO CAMBIOS MACV INFOWARE-IBM AGOSTO 2016                  422900      
005060    02 E422-143-MDA-NUMCTO                           .            423000      
005061       04 E422-143-MDA-NUMPREF         PIC 9(04) COMP.            423100      
005062       04 E422-143-MDA-NUM             PIC 9(12) COMP.            423200      
005063***  FIN   CAMBIOS MACV INFOWARE-IBM AGOSTO 2016                  423300      
005064 01 S422-143-CTR-SAL.                                             423400      
005065    02 S422-143-CSI-NUM                PIC 9(02) COMP.            423500      
005066    02 S422-143-CTE-NUM                PIC 9(12) COMP.            423600      
005067    02 S422-143-CTE-CVESTATUS          PIC 9(02) COMP.            423700      
005068    02 S422-143-CTE-CVEPERS            PIC 9(02) COMP.            423800      
005069    02 S422-143-CTE-NUMCLASIF          PIC 9(02) COMP.            423900      
005070    02 S422-143-NUM-OCR                PIC 9(02) COMP.            424000      
005071    02 S422-143-HAY-MAS                PIC 9(02) COMP.            424100      
005072    02 S422-143-TABLA OCCURS 20 TIMES                .            424200      
005073       03 S422-143-CTA-NUMPROD         PIC 9(04) COMP.            424300      
005074       03 S422-143-CTA-CVEINST         PIC 9(02) COMP.            424400      
005075       03 S422-143-CTA-NUMPREF         PIC 9(04) COMP.            424500      
005076       03 S422-143-CTA-NUM             PIC 9(12) COMP.            424600      
005077       03 S422-143-CTA-CVESTATUS       PIC 9(02) COMP.            424700      
005078       03 S422-143-CTA-NUMSUC          PIC 9(04) COMP.            424800      
005079       03 S422-143-CTA-CVEMONEDA       PIC 9(02) COMP.            424900      
005080       03 S422-143-CTA-CVEMANEJO       PIC 9(02) COMP.            425000      
005081       03 S422-143-CTA-CVEENVIO        PIC 9(04) COMP.            425100      
005082       03 S422-143-CTA-FEALCT-2K       PIC 9(08) COMP.            425200      
005083       03 S422-143-CTA-FEMOCT-2K       PIC 9(08) COMP.            425300      
005084       03 S422-143-CTA-RELCTE          PIC 9(02) COMP.            425400      
005085       03 S422-143-CTA-USOBCAELE       PIC 9(02) COMP.            425500      
005086       03 S422-143-CTA-ASOCIADAX       PIC 9(02) COMP.            425600      
005087       03 S422-143-CTA-3DIGITOS        PIC 9(04) COMP.            425700      
005088       03 S422-143-MDA-CVETIPO         PIC 9(02) COMP.            425800      
005089       03 S422-143-MDA-SUBTIPO         PIC 9(02) COMP.            425900      
005090       03 S422-143-MDA-CVETIT          PIC 9(02) COMP.            426000      
005091       03 S422-143-MDA-NUMCTO                        .            426100      
005092          05 S422-143-MDA-NUMPREF      PIC 9(04) COMP.            426200      
005093          05 S422-143-MDA-NUM          PIC 9(12) COMP.            426300      
005094       03 S422-143-MDA-CVESTATUS       PIC 9(02) COMP.            426400      
005095       03 S422-143-MDA-ABRPROFT        PIC X(03)     .            426500      
005096       03 S422-143-CTR-PTRNOMT         PIC 9(04) COMP.            426600      
005097       03 S422-143-MDA-ABRPROFC        PIC X(03)     .            426700      
005098       03 S422-143-CTR-PTRNOMC         PIC 9(04) COMP.            426800      
005099       03 S422-143-CTA-PRESEN          PIC 9(02) COMP.            426900      
005100       03 S422-143-MDA-FEALTA-2K       PIC 9(08) COMP.            427000      
005101       03 S422-143-MDA-FEULMO-2K       PIC 9(08) COMP.            427100      
005102                                                                  427200      
005103 77  R422-143-CTR-ERROR                PIC S9(11) BINARY.         427300      
005104                                                                  427400      
005105******************************************************************427500      
005106                                                                  427600      
005107******************************************************************427700      
005108** PARAMETROS          S016_L422_CONS_TERS_2  (146)             **427800      
005109** Dialogo para consulta de cuentas y montos operables Terceros **427900      
005110** Banamex                                                      **428000      
005111******************************************************************428100      
005112*                                                                 428200      
005113 77 R422-146-CTR-ERROR                PIC S9(11) BINARY.          428300      
005114*                                                                 428400      
005115 01 E422-146-CTR-ENTRADA.                                         428500      
005116    02 E422-146-CTR-NUMCSI            PIC 9(02) COMP.             428600      
005117    02 E422-146-CTE-NUM               PIC 9(12) COMP.             428700      
005118    02 E422-146-CTO-NUM.                                          428800      
005119       03 E422-146-CTA-NUMPREF        PIC 9(04) COMP.             428900      
005120       03 E422-146-CTA-NUM            PIC 9(12) COMP.             429000      
005121    02 E422-146-CTA-OPCION            PIC 9(02) COMP.             429100      
005122    02 FILLER                         PIC X(44).                  429200      
005123*SIZE ENTRADA X(60).                                              429300      
005124*                                                                 429400      
005125  01 S422-146-CTR-SALIDA.                                         429500      
005126     02 S422-146-SER-LIMAXAUT         PIC 9(14) COMP.             429600      
005127     02 S422-146-SER-PERIODLIM        PIC X(01).                  429700      
005128     02 S422-146-CTE-NOM              PIC X(55).                  429800      
005129     02 S422-146-CTA-NOMBRE           PIC X(20).                  429900      
005130     02 S422-146-CTR-FEMOTE-2K        PIC 9(08) COMP.             430000      
005131     02 S422-146-CTR-STATUS           PIC 9(02) COMP.             430100      
005132     02 S422-146-CTR-FECALTA          PIC 9(08) COMP.             430200      
005133     02 S422-146-CTR-HORALTA          PIC 9(08) COMP.             430300      
005134     02 FILLER                        PIC X(06).                  430400      
005135* SIZE SALIDA X(90).                                              430500      
005136*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-**430600      
005137******************************************************************430700      
005138** PARAMETROS          S016_L422_CONS_INTER_2 (147)             **430800      
005139** Dialogo para consulta de cuentas y montos operables          **430900      
005140** interbancarios                                               **431000      
005141******************************************************************431100      
005142*                                                                 431200      
005143 77 R422-147-CTR-ERROR                PIC S9(11) BINARY.          431300      
005144*                                                                 431400      
005145 01 E422-147-CTR-ENTRADA.                                         431500      
005146    02 E422-147-CTE-NUM               PIC 9(12) COMP.             431600      
005147    02 E422-147-CTA-CLABE-TARJ        PIC 9(20) COMP.             431700      
005148    02 E422-147-CTA-CLAVE-TARJ-R      REDEFINES                   431800      
005149                                      E422-147-CTA-CLABE-TARJ.    431900      
005150       03 E422-147-CTA-CLABE          PIC 9(04) COMP.             432000      
005151       03 E422-147-CTA-NUMPREF        PIC 9(04) COMP.             432100      
005152       03 E422-147-CTA-NUM            PIC 9(12) COMP.             432200      
005153    02 E422-147-CTE-NOMBENEF          PIC X(55).                  432300      
005154    02 E422-147-CTA-OPCION            PIC 9(02) COMP.             432400      
005155    02 E422-147-TIPO-CTA              PIC 9(02) COMP.             432500      
005156    02 E422-147-ESTABL                PIC 9(06) COMP.             432600      
005157    02 E422-147-CTE-SERVNUM           PIC 9(04) COMP.             432700      
005158    02 FILLER                         PIC X(24).                  432800      
005159*SIZE ENTRADA X(96).                                              432900      
005160*                                                                 433000      
005161  01 S422-147-CTR-SALIDA.                                         433100      
005162     02 S422-147-SER-LIMAXAUT         PIC 9(14) COMP.             433200      
005163     02 S422-147-SER-PERIODLIM        PIC X(01).                  433300      
005164*   SE DA COMO CONFIRMACION DEL NOMBRE DEL BENEF. ENCONTRADO      433400      
005165     02 S422-147-CTE-NOMBENEF         PIC X(55).                  433500      
005166     02 S422-147-CTA-NOMBRE           PIC X(20).                  433600      
005167     02 S422-147-CTR-FEMOTE-2K        PIC 9(08) COMP.             433700      
005168     02 S422-147-CTA-BCO              PIC 9(04) COMP.             433800      
005169     02 S422-147-CTR-STATUS           PIC 9(02) COMP.             433900      
005170     02 S422-147-CTE-SERVNUM          PIC 9(04) COMP.             434000      
005171     02 S422-147-CTR-FECALTA          PIC 9(08) COMP.             434100      
005172     02 S422-147-CTR-HORALTA          PIC 9(08) COMP.             434200      
005173     02 FILLER                        PIC X(06).                  434300      
005174* SIZE SALIDA X(96).                                              434400      
005175                                                                  434500      
005176* ZUMA-EGS INICIO MULTIEMPRESAS JUNIO 2010                        434600      
005177**********************************************************        434700      
005178**               S016_L422_B72SXEMPRCTE (146)                   * 434800      
005179**        CONSULTA DEL DATASET S016B72MULTIEMPRESAS             * 434900      
005180***************************************************************** 435000      
005181                                                                  435100      
005182* DATOS DE ENTRADA                                                435200      
005183 01 E422-148-CTR-ENTRADA.                                         435300      
005184* EMPRESA A LA QUE PERTENECE                                      435400      
005185    02 E422-148-CTE-EMPRESA PIC 9(06) COMP.                       435500      
005186* NUMERO DE CLIENTE                                               435600      
005187    02 E422-148-CTE-NUM     PIC 9(12) COMP.                       435700      
005188    02 FILLER               PIC X(06).                            435800      
005189    02 E422-148-CTR-ROLEMPR PIC 9(02).                            435900      
005190    02 FILLER               PIC X(32).                            436000      
005191* SIZE ENTRADA X(50).                                             436100      
005192                                                                  436200      
005193* DATOS DE SALIDA                                                 436300      
005194                                                                  436400      
005195 01 S422-148-CTR-SALIDA.                                          436500      
005196    02 S422-148-CTE-EMPRESA PIC 9(06) COMP.                       436600      
005197    02 S422-148-CTE-NUM     PIC 9(12) COMP.                       436700      
005198    02 S422-148-CTE-ESTATUS PIC 9(02) COMP.                       436800      
005199    02 S422-148-CTE-DOMPRIN PIC 9(04) COMP.                       436900      
005200    02 S422-148-CTE-ROLEMPR PIC 9(02) COMP.                       437000      
005201    02 S422-148-CTE-FECALTA PIC 9(08) COMP.                       437100      
005202    02 S422-148-CTE-FEULMOD PIC 9(08) COMP.                       437200      
005203    02 S422-148-CTE-FECBAJA PIC 9(08) COMP.                       437300      
005204*   02 FILLER               PIC X(10).                            437400      
005205                                                                  437500      
005206* SIZE SALIDA X(60).                                              437600      
005207                                                                  437700      
005208 77 R422-148-CTR-ERROR      PIC S9(11) BINARY.                    437800      
005209                                                                  437900      
005210* ZUMA-EGS INICIO MULTIEMPRESAS JUNIO 2010                        438000      
005211                                                                  438100      
005212******************************************************************438200      
005213** INFOWARE PROYECTO SHJ SEPTIEMBRE DEL 2010                SHJ **438300      
005214** FD DE PARAMETROS DEL ENTRYPOINT S016_L422_CTASINCORP3(149)   **438400      
005215******************************************************************438500      
005216 01 E422-149-CTR-ENT.                                             438600      
005217    02 E422-149-LIB-OPC                PIC 9(02) COMP.            438700      
005218    02 E422-149-CTE-NUM                PIC 9(12) COMP.            438800      
005219    02 E422-149-CTA-PROD               PIC 9(04) COMP.            438900      
005220    02 E422-149-CTA-INST               PIC 9(02) COMP.            439000      
005221    02 E422-149-CTA-PREF               PIC 9(04) COMP.            439100      
005222    02 E422-149-CTA-NUM                PIC 9(12) COMP.            439200      
005223    02 E422-149-NUM-OCR                PIC 9(02) COMP.            439300      
005224 01 S422-149-CTR-SAL.                                             439400      
005225    02 S422-149-CSI-NUM                PIC 9(02) COMP.            439500      
005226    02 S422-149-CTE-NUM                PIC 9(12) COMP.            439600      
005227    02 S422-149-CTE-CVESTATUS          PIC 9(02) COMP.            439700      
005228    02 S422-149-CTE-CVEPERS            PIC 9(02) COMP.            439800      
005229    02 S422-149-CTE-NUMCLASIF          PIC 9(02) COMP.            439900      
005230    02 S422-149-NUM-OCR                PIC 9(02) COMP.            440000      
005231    02 S422-149-HAY-MAS                PIC 9(02) COMP.            440100      
005232    02 S422-149-TABLA OCCURS 15 TIMES                .            440200      
005233       03 S422-149-CTA-NUMPROD         PIC 9(04) COMP.            440300      
005234       03 S422-149-CTA-CVEINST         PIC 9(02) COMP.            440400      
005235       03 S422-149-CTA-NUMPREF         PIC 9(04) COMP.            440500      
005236       03 S422-149-CTA-NUM             PIC 9(12) COMP.            440600      
005237       03 S422-149-CTA-CVESTATUS       PIC 9(02) COMP.            440700      
005238       03 S422-149-CTA-NUMSUC          PIC 9(04) COMP.            440800      
005239       03 S422-149-CTA-CVEMONEDA       PIC 9(02) COMP.            440900      
005240       03 S422-149-CTA-CVEMANEJO       PIC 9(02) COMP.            441000      
005241       03 S422-149-CTA-CVEENVIO        PIC 9(04) COMP.            441100      
005242       03 S422-149-CTA-FEALCT-2K       PIC 9(08) COMP.            441200      
005243       03 S422-149-CTA-FEMOCT-2K       PIC 9(08) COMP.            441300      
005244       03 S422-149-CTA-RELCTE          PIC 9(02) COMP.            441400      
005245       03 S422-149-CTA-USOBCAELE       PIC 9(02) COMP.            441500      
005246       03 S422-149-CTA-ASOCIADAX       PIC 9(02) COMP.            441600      
005247       03 S422-149-CTA-3DIGITOS        PIC 9(04) COMP.            441700      
005248       03 S422-149-MDA-CVETIPO         PIC 9(02) COMP.            441800      
005249       03 S422-149-MDA-SUBTIPO         PIC 9(02) COMP.            441900      
005250       03 S422-149-MDA-CVETIT          PIC 9(02) COMP.            442000      
005251       03 S422-149-MDA-NUMCTO                        .            442100      
005252          05 S422-149-MDA-NUMPREF      PIC 9(04) COMP.            442200      
005253          05 S422-149-MDA-NUM          PIC 9(12) COMP.            442300      
005254       03 S422-149-MDA-CVESTATUS       PIC 9(02) COMP.            442400      
005255       03 S422-149-MDA-ABRPROFT        PIC X(03)     .            442500      
005256       03 S422-149-CTR-PTRNOMT         PIC 9(04) COMP.            442600      
005257       03 S422-149-MDA-ABRPROFC        PIC X(03)     .            442700      
005258       03 S422-149-CTR-PTRNOMC         PIC 9(04) COMP.            442800      
005259       03 S422-149-CTA-PRESEN          PIC 9(02) COMP.            442900      
005260       03 S422-149-MDA-FEALTA-2K       PIC 9(08) COMP.            443000      
005261       03 S422-149-MDA-FEULMO-2K       PIC 9(08) COMP.            443100      
005262       03 S422-149-MDA-NOMBRECOR       PIC X(26).                 443200      
005263                                                                  443300      
005264 77  R422-149-CTR-ERROR                PIC S9(11) BINARY.         443400      
005265                                                                  443500      
005266******************************************************************443600      
005267***    PARAMETROS  S016_L422_B04XCTODUPLI (151)                ***443700      
005268****   PARA CONTRATOS DUPLICADOS CUENTA MAESTRA                 **443800      
005269******************************************************************443900      
005270*                                                                 444000      
005271 77  R422-151-CTR-ERROR                   PIC S9(11) BINARY.      444100      
005272*                                                                 444200      
005273 01  E422-151-CTR-ENTRADA.                                        444300      
005274     03 E422-151-CTA-NUMPREF              PIC 9(004) COMP.        444400      
005275     03 E422-151-CTA-NUM                  PIC 9(012) COMP.        444500      
005276     03 FILLER                            PIC X(044).             444600      
005277* SIZE ENTRADA X(60)*                                             444700      
005278*                                                                 444800      
005279*                                                                 444900      
005280 01  S422-151-CTR-SALIDA.                                         445000      
005281     03 S422-151-CTA-NUMPROD              PIC 9(004) COMP.        445100      
005282     03 S422-151-CTA-CVEINST              PIC 9(004) COMP.        445200      
005283     03 S422-151-CTA-NUMPREF              PIC 9(004) COMP.        445300      
005284     03 S422-151-CTA-NUM                  PIC 9(012) COMP.        445400      
005285     03 FILLER                            PIC X(042).             445500      
005286* SIZE SALIDA X(66)*                                              445600      
005287*                                                                 445700      
005288 01  S422-151-RCTR-SALIDA REDEFINES S422-151-CTR-SALIDA.          445800      
005289     03 S422-151-CTR-ERROR                PIC 9(004) COMP.        445900      
005290     03 S422-151-CTR-ERRORTYPE            PIC 9(004) COMP.        446000      
005291     03 S422-151-CTR-STRUCTURE            PIC 9(004) COMP.        446100      
005292     03 FILLER                            PIC X(054).             446200      
005293                                                                  446300      
005294***************************************************************** 446400      
005295***  PARAMETROS PARA ENTRY POINT S016_L422_CTAXMDAS(154)      *** 446500      
005296***  Consulta todos los medios de acceso de una cuenta.       *** 446600      
005297***  Puede filtrarse para que entregue                        *** 446700      
005298***  solo los medios activos (status = 20,21)                 *** 446800      
005299***************************************************************** 446900      
005300                                                                  447000      
005301*** PARAMETROS DE ENTRADA ***                                     447100      
005302                                                                  447200      
005303 01  E422-154-CTR-ENTRADA.                                        447300      
005304     02  E422-154-CTR-OPCION          PIC 9(02) COMP.             447400      
005305     02  E422-154-CTR-LLAVE.                                      447500      
005306         03  E422-154-CTE-NUM         PIC 9(12) COMP.             447600      
005307         03 E422-154-CTA-NUMPROD      PIC 9(04) COMP.             447700      
005308         03 E422-154-CTA-CVEINST      PIC 9(04) COMP.             447800      
005309         03 E422-154-CTO-NUM.                                     447900      
005310            05 E422-154-CTA-NUMPREF   PIC 9(04) COMP.             448000      
005311            05 E422-154-CTA-NUM       PIC 9(12) COMP.             448100      
005312         03 E422-154-MDA-CVETIPO      PIC 9(02) COMP.             448200      
005313         03 E422-154-MDA-CVETIT       PIC 9(02) COMP.             448300      
005314         03 E422-154-MDA-CTONUM.                                  448400      
005315            05 E422-154-MDA-NUMPREF   PIC 9(04) COMP.             448500      
005316            05 E422-154-MDA-NUM       PIC 9(12) COMP.             448600      
005317     02  E422-154-CTR-NUMREG          PIC 9(02) COMP.             448700      
005318     02  FILLER                       PIC X(28).                  448800      
005319                                                                  448900      
005320*** PARAMETROS DE SALIDA ***                                      449000      
005321                                                                  449100      
005322 01 S422-154-CTR-SALIDA.                                          449200      
005323    02 S422-154-CTR-NUMREG              PIC 9(02) COMP.           449300      
005324    02 S422-154-CTR-HAYMAS              PIC 9(02) COMP.           449400      
005325    02 S422-154-CTE-NUM                 PIC 9(12) COMP.           449500      
005326    02 S422-154-CTA-NUMPROD             PIC 9(04) COMP.           449600      
005327    02 S422-154-CTA-CVEINST             PIC 9(04) COMP.           449700      
005328    02 S422-154-CTA-NUMCTO.                                       449800      
005329       03 S422-154-CTA-NUMPREF          PIC 9(04) COMP.           449900      
005330       03 S422-154-CTA-NUM              PIC 9(12) COMP.           450000      
005331    02 S422-154-CTA-NUMSUC              PIC 9(04) COMP.           450100      
005332    02 S422-154-CTA-CVEMONEDA           PIC 9(02) COMP.           450200      
005333    02 S422-154-CTA-CVEMANEJO           PIC 9(02) COMP.           450300      
005334    02 S422-154-CTA-CVESTATUS           PIC 9(02) COMP.           450400      
005335    02 S422-154-CTR-REGISTRO OCCURS 20 TIMES.                     450500      
005336       03 S422-154-MDA-CVETIPO             PIC 9(02) COMP.        450600      
005337       03 S422-154-MDA-SUBTIPO             PIC 9(02) COMP.        450700      
005338       03 S422-154-MDA-CVETIT              PIC 9(02) COMP.        450800      
005339       03 S422-154-MDA-NUMCTO.                                    450900      
005340          05 S422-154-MDA-NUMPREF          PIC 9(04) COMP.        451000      
005341          05 S422-154-MDA-NUM              PIC 9(12) COMP.        451100      
005342       03 S422-154-MDA-ABRPROFT            PIC X(03).             451200      
005343       03 S422-154-CTR-PTRNOMT             PIC 9(04) COMP.        451300      
005344       03 S422-154-MDA-ABRPROFC            PIC X(03).             451400      
005345       03 S422-154-CTR-PTRNOMC             PIC 9(04) COMP.        451500      
005346       03 S422-154-MDA-NUMTALON            PIC 9(02) COMP.        451600      
005347       03 S422-154-MDA-CHQXTALON           PIC 9(02) COMP.        451700      
005348       03 S422-154-MDA-CVESTATUS           PIC 9(02) COMP.        451800      
005349       03 S422-154-MDA-FECALTA-2K          PIC 9(08) COMP.        451900      
005350       03 S422-154-MDA-FECULTMOD-2K        PIC 9(08) COMP.        452000      
005351       03 S422-154-MDA-FECVENC-2K          PIC 9(08) COMP.        452100      
005352       03 S422-154-MDA-FECCANCEL-2K        PIC 9(08) COMP.        452200      
005353       03 S422-154-MDA-FECPREV             PIC 9(06) COMP.        452300      
005354       03 S422-154-MDA-HHPREV              PIC 9(04) COMP.        452400      
005355**     03 FILLER                           PIC X(21).             452500      
005356**** SIZE reg OCCURS X(10)                                        452600      
005357**** SIZE SALIDA = 1+( *10) =                                     452700      
005358                                                                  452800      
005359 77  R422-154-CTR-ERROR                   PIC S9(11) BINARY.      452900      
005360                                                                  453000      
005361******************************************************************453100      
005362***    PARAMETROS  S016_L422_B01SXCTERFC    (155)                 453200      
005363******************************************************************453300      
005364                                                                  453400      
005365 77  R422-155-CTR-ERROR                   PIC S9(11) BINARY.      453500      
005366                                                                  453600      
005367 01  E422-155-CTR-ENTRADA.                                        453700      
005368     03 E422-155-OPCION                    PIC 9(002) COMP.       453800      
005369     03 E422-155-CTE-NUM                   PIC 9(012) COMP.       453900      
005370     03 E422-155-CTE-CODINI                PIC X(004).            454000      
005371     03 E422-155-CTE-FECNAC                PIC 9(006) COMP.       454100      
005372     03 E422-155-CTE-CODHOM                PIC X(005).            454200      
005373     03 E422-155-HAY-MAS                   PIC X(001).            454300      
005374     03 FILLER                             PIC X(040).            454400      
005375                                                                  454500      
005376* SIZE ENTRADA X(60)*                                             454600      
005377                                                                  454700      
005378 01 S422-155-CTR-SALIDA.                                          454800      
005379   02 S422-155-CTR-NUMREG                     PIC 9(002) COMP.    454900      
005380   02 S422-155-CTR-HAYMAS                     PIC 9(002) COMP.    455000      
005381   02 S422-155-CTR-OCC  OCCURS 10.                                455100      
005382     03 S422-155-CTE-NUM                   PIC 9(012) COMP.       455200      
005383     03 S422-155-CTE-NOM                   PIC X(055).            455300      
005384     03 S422-155-CTE-CALLENUM              PIC X(036).            455400      
005385     03 S422-155-CTE-NOMCOL                PIC X(024).            455500      
005386     03 S422-155-CTE-NOMPOB                PIC X(020).            455600      
005387     03 S422-155-CTE-CVEEDO                PIC 9(002) COMP.       455700      
005388     03 S422-155-CTE-NUMCP                 PIC 9(006) COMP.       455800      
005389     03 S422-155-CTE-NUMTEL                PIC 9(010) COMP.       455900      
005390     03 S422-155-CTE-NUMTELEXT             PIC 9(006) COMP.       456000      
005391     03 S422-155-CTE-CVETEL                PIC 9(002) COMP.       456100      
005392     03 S422-155-CTE-NUMTEL2               PIC 9(010) COMP.       456200      
005393     03 S422-155-CTE-NUMTELEX2             PIC 9(006) COMP.       456300      
005394     03 S422-155-CTE-CVETEL2               PIC 9(002) COMP.       456400      
005395     03 S422-155-CTR-CVESTADOM             PIC 9(002) COMP.       456500      
005396     03 S422-155-CTR-CVEDOM                PIC 9(002) COMP.       456600      
005397     03 S422-155-CTR-NUMDOMS               PIC 9(004) COMP.       456700      
005398     03 S422-155-CTE-CVEPERS               PIC 9(002) COMP.       456800      
005399     03 S422-155-CTE-CVETIPO               PIC 9(002) COMP.       456900      
005400     03 S422-155-CTE-NUMCLASIF             PIC 9(002) COMP.       457000      
005401     03 S422-155-CTE-CODINI                PIC X(004).            457100      
005402     03 S422-155-CTE-FECNAC                PIC 9(006) COMP.       457200      
005403     03 S422-155-CTE-CODHOM                PIC X(005).            457300      
005404     03 S422-155-CTE-CVENACION             PIC 9(002) COMP.       457400      
005405     03 S422-155-CTE-CVESEXO               PIC 9(002) COMP.       457500      
005406     03 S422-155-CTE-FECNACIM-2K           PIC 9(008) COMP.       457600      
005407     03 S422-155-CTE-CAEB                  PIC 9(006) COMP.       457700      
005408     03 S422-155-CTE-CVEACTBM              PIC 9(006) COMP.       457800      
005409     03 S422-155-CTE-EDOCTACON             PIC 9(002) COMP.       457900      
005410     03 S422-155-CTE-CVESECTOR             PIC 9(002) COMP.       458000      
005411     03 S422-155-CTE-CVEPERBCO             PIC 9(002) COMP.       458100      
005412     03 S422-155-CTE-CVESEG                PIC 9(002) COMP.       458200      
005413     03 S422-155-CTE-DIACORTE              PIC 9(002) COMP.       458300      
005414     03 S422-155-CTE-CVEENVIO              PIC 9(004) COMP.       458400      
005415     03 S422-155-CTE-NUMOFICON             PIC 9(004) COMP.       458500      
005416*  NUMOFICON ES EQUIVALENTE A SUCURSAL PROMOTORA                  458600      
005417     03 S422-155-CTE-CVESTATUS             PIC 9(002) COMP.       458700      
005418     03 S422-155-OFI-NUMCSIALT             PIC 9(002) COMP.       458800      
005419     03 S422-155-CTE-FECALTA               PIC 9(008) COMP.       458900      
005420     03 S422-155-CTE-FECULTMOD             PIC 9(008) COMP.       459000      
005421     03 S422-155-CTE-NUMUNIMER             PIC 9(004) COMP.       459100      
005422     03 S422-155-CTE-RIEBNM                PIC X(002).            459200      
005423     03 S422-155-CTE-RIEBM                 PIC X(002).            459300      
005424     03 S422-155-CTE-OCUPACION             PIC 9(002) COMP.       459400      
005425     03 S422-155-CTE-CVEPUB                PIC 9(002) COMP.       459500      
005426     03 S422-155-CTE-SITUACION             PIC X(004).            459600      
005427     03 S422-155-CTE-FECPREV               PIC 9(006) COMP.       459700      
005428     03 S422-155-CTE-RECEPSUC6             PIC 9(004) COMP.       459800      
005429     03 S422-155-CTE-HHRECEP6              PIC 9(004) COMP.       459900      
005430                                                                  460000      
005431  01 S422-155-RCTR-SALIDA REDEFINES S422-155-CTR-SALIDA.          460100      
005432     03 S422-155-CTR-ERROR                 PIC 9(004) COMP.       460200      
005433     03 S422-155-CTR-ERRORTYPE             PIC 9(004) COMP.       460300      
005434     03 S422-155-CTR-STRUCTURE             PIC 9(004) COMP.       460400      
005435     03 FILLER                             PIC X(240).            460500      
005436**                                                                460600      
005437******************************************************************460700      
005438******************************************************************460800      
005439***  PARAMETROS  S016_L422_TERCEROS_NM    (156)                 **460900      
005440***  CONSULTA LAS CUENTAS DE TERCEROS,LAS CUALES SERAN FILTRADAS**461000      
005441***  CON EL INDICADOR DE NO NO SER CREADAS MASIVAMENTE          **461100      
005442******************************************************************461200      
005443*                                                                 461300      
005444 77  R422-156-CTR-ERROR                   PIC S9(11) BINARY.      461400      
005445*                                                                 461500      
005446 01  E422-156-CTR-ENTRADA.                                        461600      
005447     03 E422-156-CTE-NUM                PIC 9(012) COMP.          461700      
005448     03 E422-156-CTA-NUMPROD            PIC 9(004) COMP.          461800      
005449     03 E422-156-CTA-CVEINST            PIC 9(002) COMP.          461900      
005450     03 E422-156-CTA-NUMPREF            PIC 9(004) COMP.          462000      
005451     03 E422-156-CTA-NUM                PIC 9(012) COMP.          462100      
005452     03 E422-156-SER-CVEUSOCTA          PIC 9(002) COMP.          462200      
005453     03 E422-156-CTA-3DIGITOS           PIC 9(004) COMP.          462300      
005454     03 E422-156-CTR-OPCION             PIC 9(002) COMP.          462400      
005455     03 FILLER                          PIC X(018).               462500      
005456* SIZE ENTRADA X(60)*                                             462600      
005457*                                                                 462700      
005458 01  S422-156-CTR-SALIDA.                                         462800      
005459     03 S422-156-CTR-NUMCSI         PIC 9(002) COMP.              462900      
005460     03 S422-156-CTE-NUM            PIC 9(012) COMP.              463000      
005461     03 S422-156-CTA-NUMPROD        PIC 9(004) COMP.              463100      
005462     03 S422-156-CTA-CVEINST        PIC 9(002) COMP.              463200      
005463     03 S422-156-CTA-NUMPREF        PIC 9(004) COMP.              463300      
005464     03 S422-156-CTA-NUM            PIC 9(012) COMP.              463400      
005465     03 S422-156-SER-LIMAXAUT       PIC 9(014) COMP.              463500      
005466     03 S422-156-SER-PERIODLIM      PIC X(001).                   463600      
005467     03 S422-156-CTA-CVEMONEDA      PIC 9(002) COMP.              463700      
005468     03 S422-156-SER-CVEUSOCTA      PIC 9(002) COMP.              463800      
005469     03 S422-156-CTR-FECALTTER      PIC 9(006) COMP.              463900      
005470     03 S422-156-CTR-FECMODTER      PIC 9(006) COMP.              464000      
005471     03 S422-156-SER-FECFINVIG      PIC 9(004) COMP.              464100      
005472     03 S422-156-CTA-3DIGITOS       PIC 9(004) COMP.              464200      
005473     03 S422-156-CTR-FEALTE-2K      PIC 9(008) COMP.              464300      
005474     03 S422-156-CTR-FEMOTE-2K      PIC 9(008) COMP.              464400      
005475     03 S422-156-SER-FEFIVI-2K      PIC 9(006) COMP.              464500      
005476     03 S422-156-CTR-FBAJA-2K       PIC 9(008) COMP.              464600      
005477     03 S422-156-CTA-FULCON-2K      PIC 9(008) COMP.              464700      
005478     03 S422-156-CTA-ALIAS          PIC X(020) .                  464800      
005479     03 S422-156-CTA-MEDALTA        PIC 9(004) COMP.              464900      
005480     03 S422-156-CTR-GERCTA         PIC 9(002) COMP.              465000      
005481     03 S422-156-CTR-HORALTA        PIC 9(008) COMP.              465100      
005482**                                                                465200      
005483  01  S422-156-RCTR-SALIDA REDEFINES S422-156-CTR-SALIDA.         465300      
005484     03 S422-156-CTR-ERROR                 PIC 9(004)    COMP.    465400      
005485     03 S422-156-CTR-ERRORTYPE             PIC 9(004)    COMP.    465500      
005486     03 S422-156-CTR-STRUCTURE             PIC 9(004)    COMP.    465600      
005487     03 FILLER                             PIC X(078).            465700      
005488**                                                                465800      
005489******************************************************************465900      
005490** PARAMETROS          S016_L422_CONS_INTER_3 (157)             **466000      
005491** CONSULTA DE ORDENES DE PAGO Y DE CUENTAS INTERBANCARIAS      **466100      
005492** LAS CUALES SERAN FILTRADAS CON EL INDICADOR DE NO SER        **466200      
005493** CREADAS MASIVAMENTE                                          **466300      
005494******************************************************************466400      
005495*                                                                 466500      
005496 77 R422-157-CTR-ERROR                PIC S9(11) BINARY.          466600      
005497*                                                                 466700      
005498 01 E422-157-CTR-ENTRADA.                                         466800      
005499    02 E422-157-CTE-NUM               PIC 9(12) COMP.             466900      
005500    02 E422-157-CTA-CLABE-TARJ            PIC 9(20) COMP.         467000      
005501    02 E422-157-CTA-CLAVE-TARJ-R      REDEFINES                   467100      
005502                                      E422-157-CTA-CLABE-TARJ.    467200      
005503       03 E422-157-CTA-CLABE          PIC 9(04) COMP.             467300      
005504       03 E422-157-CTA-NUMPREF        PIC 9(04) COMP.             467400      
005505       03 E422-157-CTA-NUM            PIC 9(12) COMP.             467500      
005506    02 E422-157-CTE-NOMBENEF          PIC X(55).                  467600      
005507    02 E422-157-CTA-OPCION            PIC 9(02) COMP.             467700      
005508    02 E422-157-TIPO-CTA              PIC 9(02) COMP.             467800      
005509    02 E422-157-ESTABL                PIC 9(06) COMP.             467900      
005510    02 E422-157-CTE-SERVNUM           PIC 9(04) COMP.             468000      
005511    02 FILLER                         PIC X(24).                  468100      
005512*                                                                 468200      
005513*SIZE ENTRADA X(96).                                              468300      
005514*                                                                 468400      
005515  01 S422-157-CTR-SALIDA.                                         468500      
005516     02 S422-157-CTA-BANCO      PIC 9(04) COMP.                   468600      
005517     02 S422-157-CTA-SUC        PIC 9(04) COMP.                   468700      
005518     02 S422-157-CTE-NUMPROS    PIC 9(12) COMP.                   468800      
005519     02 S422-157-CTA-CUENTIP    PIC 9(02) COMP.                   468900      
005520     02 S422-157-CTA-CVEMONEDA  PIC 9(02) COMP.                   469000      
005521     02 S422-157-CTR-CODSWIFT   PIC X(12).                        469100      
005522     02 S422-157-CTR-CODABA     PIC X(10).                        469200      
005523     02 S422-157-CTR-GERCTA     PIC 9(02) COMP.                   469300      
005524     02 S422-157-CTE-CVEPERS    PIC 9(02) COMP.                   469400      
005525     02 S422-157-CTA-ALIAS      PIC X(20) .                       469500      
005526     02 S422-157-CTE-CVESECTOR  PIC 9(02) COMP.                   469600      
005527     02 S422-157-CTR-LIMAXUT    PIC 9(14) COMP.                   469700      
005528     02 S422-157-SER-PERIODLIM  PIC X(01) .                       469800      
005529     02 S422-157-CTR-NUMESTABL  PIC 9(06) COMP.                   469900      
005530     02 S422-157-CTR-FEALTA-2K  PIC 9(08) COMP.                   470000      
005531     02 S422-157-CTA-FULCON-2K  PIC 9(08) COMP.                   470100      
005532     02 S422-157-CTE-SERVNUM    PIC 9(04) COMP.                   470200      
005533     02 S422-157-CTR-HORALTA    PIC 9(08) COMP.                   470300      
005534**      Datos complementarios                                     470400      
005535     02 S422-157-CTE-NOM        PIC X(100) .                      470500      
005536     02 S422-157-CTE-EMAIL      PIC X(078) .                      470600      
005537     02 FILLER                  PIC X(06).                        470700      
005538************************************************************      470800      
005539**** PARAMETROS DEL ENTRY POINT S016_L422_TITXADICIO(159) **      470900      
005540**** CONSULTA DEL CLIENTE TITULAR POR MEDIO DE LA         **      471000      
005541****     TARJETA ADICIONAL                                **      471100      
005542************************************************************      471200      
005543  01  E422-159-CTR-ENTRADA.                                       471300      
005544     02 E422-159-MDA-NUMPREF         PIC 9(04) COMP.              471400      
005545     02 E422-159-MDA-NUM             PIC 9(12) COMP.              471500      
005546                                                                  471600      
005547* SIZE ENTRADA (16).*                                             471700      
005548 01  S422-159-CTR-SALIDA.                                         471800      
005549     03 S422-159-CTR-NUMCSI                PIC  9(002) COMP.      471900      
005550     03 S422-159-CTE-NUM                   PIC  9(012) COMP.      472000      
005551     03 S422-159-CTA-NUMPROD               PIC  9(004) COMP.      472100      
005552     03 S422-159-CTA-CVEINST               PIC  9(002) COMP.      472200      
005553     03 S422-159-CTA-NUMPREF               PIC  9(004) COMP.      472300      
005554     03 S422-159-CTA-NUM                   PIC  9(012) COMP.      472400      
005555     03 S422-159-MDA-CVETIPO               PIC  9(002) COMP.      472500      
005556     03 S422-159-MDA-SUBTIPO               PIC  9(002) COMP.      472600      
005557     03 S422-159-MDA-CVETIT                PIC  9(002) COMP.      472700      
005558     03 S422-159-MDA-NUMPREF               PIC  9(004) COMP.      472800      
005559     03 S422-159-MDA-NUM                   PIC  9(012) COMP.      472900      
005560     03 S422-159-MDA-ABRPROFT              PIC  X(003).           473000      
005561     03 S422-159-CTR-PTRNOMT               PIC  9(004) COMP.      473100      
005562     03 S422-159-MDA-ABRPROFC              PIC  X(003).           473200      
005563     03 S422-159-CTR-PTRNOMC               PIC  9(004) COMP.      473300      
005564     03 S422-159-MDA-NUMTALON              PIC  9(002) COMP.      473400      
005565     03 S422-159-MDA-CHQXTALON             PIC  9(002) COMP.      473500      
005566     03 S422-159-MDA-CVEPIN                PIC  9(006) COMP.      473600      
005567     03 S422-159-MDA-CVESTATUS             PIC  9(002) COMP.      473700      
005568     03 S422-159-MDA-FECALTA-2K            PIC  9(008) COMP.      473800      
005569     03 S422-159-MDA-FECULTMOD-2K          PIC  9(008) COMP.      473900      
005570     03 S422-159-MDA-FECULTACC-2K          PIC  9(008) COMP.      474000      
005571     03 S422-159-MDA-FECVENC-2K            PIC  9(008) COMP.      474100      
005572     03 S422-159-MDA-FECCANCEL-2K          PIC  9(008) COMP.      474200      
005573     03 S422-159-MDA-FECPREV               PIC  9(006) COMP.      474300      
005574     03 S422-159-MDA-FECMODPIN-2K          PIC  9(008) COMP.      474400      
005575     03 S422-159-MDA-HHPREV                PIC  9(004) COMP.      474500      
005576     03 S422-159-MDA-HHALTA                PIC  9(004) COMP.      474600      
005577     03 S422-159-MDA-HHULTMOD              PIC  9(004) COMP.      474700      
005578     03 S422-159-MDA-HHULTACC              PIC  9(004) COMP.      474800      
005579     03 S422-159-MDA-HHVENC                PIC  9(004) COMP.      474900      
005580     03 S422-159-MDA-PERIODO               PIC  9(002) COMP.      475000      
005581     03 S422-159-MDA-SITUACION             PIC  X(004).           475100      
005582     03 FILLER                             PIC  X(021).           475200      
005583* SIZE SALIDA X(108).                                             475300      
005584                                                                  475400      
005585 01 S422-159-CTR-SALERR REDEFINES S422-159-CTR-SALIDA.            475500      
005586     03 S422-159-CTR-ERROR                 PIC 9(004) COMP.       475600      
005587     03 S422-159-CTR-ERRORTYPE             PIC 9(004) COMP.       475700      
005588     03 S422-159-CTR-STRUCTURE             PIC 9(004) COMP.       475800      
005589     03 FILLER                             PIC 9(102) COMP.       475900      
005590                                                                  476000      
005591*                                                                 476100      
005592 77  S422-159-RCTR-SALERR                  PIC S9(11) BINARY.     476200      
005593*                                                                 476300      
005594***                                                               476400      
005595**************************************************************    476500      
005596****  ENTRY POINT S016_L422_B76CTATEL           (160)     ****    476600      
005597****  Consulta de la estructura B76                       ****    476700      
005598****     asociacion cuenta - celular                      ****    476800      
005599**************************************************************    476900      
005600                                                                  477000      
005601 01  E422-160-CTR-ENTRADA.                                        477100      
005602     03 E422-160-CTE-NUM         PIC 9(12) COMP.                  477200      
005603     03 E422-160-CTA-CLABE-TARJ  PIC 9(20) COMP.                  477300      
005604     03 E422-160-CLABE-R  REDEFINES E422-160-CTA-CLABE-TARJ.      477400      
005605        05 E422-160-CLABE        PIC 9(20) COMP.                  477500      
005606     03 E422-160-TAR-R    REDEFINES E422-160-CTA-CLABE-TARJ.      477600      
005607        05 E422-160-FILLER1      PIC 9(04) COMP.                  477700      
005608        05 E422-160-TAR          PIC 9(16) COMP.                  477800      
005609     03 E422-160-CHQS   REDEFINES E422-160-CTA-CLABE-TARJ.        477900      
005610        05 E422-160-FILLER2      PIC 9(04) COMP.                  478000      
005611        05 E422-160-CTA-NUMPREF  PIC 9(04) COMP.                  478100      
005612        05 E422-160-CTA-NUM      PIC 9(12) COMP.                  478200      
005613     03 E422-160-CTE-CELULAR     PIC 9(10) COMP.                  478300      
005614     03 E422-160-CTA-OPCION      PIC 9(02) COMP.                  478400      
005615     03 FILLER                   PIC X(24).                       478500      
005616                                                                  478600      
005617                                                                  478700      
005618* SIZE ENTRADA (16).*                                             478800      
005619                                                                  478900      
005620 01  S422-160-CTR-SALIDA.                                         479000      
005621     03 S422-160-CTE-NUM                   PIC  9(012) COMP.      479100      
005622     03 S422-160-CTA-NUMPROD               PIC  9(004) COMP.      479200      
005623     03 S422-160-CTA-CVEINST               PIC  9(002) COMP.      479300      
005624     03 S422-160-CTA-SUCU                  PIC  9(004) COMP.      479400      
005625     03 S422-160-CTA-NUMCTO                                .      479500      
005626        05 S422-160-CTA-NUMPREF            PIC  9(004) COMP.      479600      
005627        05 S422-160-CTA-NUM                PIC  9(012) COMP.      479700      
005628     03 S422-160-CTE-CELULAR               PIC  9(010) COMP.      479800      
005629     03 S422-160-CTA-EXTERNA               PIC  9(020) COMP.      479900      
005630     03 S422-160-CTE-CVECOMP               PIC  9(004) COMP.      480000      
005631     03 S422-160-CTA-TIPCTASOC             PIC  9(002) COMP.      480100      
005632     03 S422-160-CTA-CUENTIP               PIC  9(002) COMP.      480200      
005633     03 S422-160-CVE-STATUS                PIC  9(002) COMP.      480300      
005634     03 S422-160-CTR-FEALTA-2K             PIC  9(008) COMP.      480400      
005635     03 S422-160-CTR-FEULMO-2K             PIC  9(008) COMP.      480500      
005636     03 FILLER                             PIC  X(024)     .      480600      
005637                                                                  480700      
005638  77 R422-160-CTR-ERROR                    PIC S9(11) BINARY.     480800      
005639                                                                  480900      
005640                                                                  481000      
005641                                                                  481100      
005642                                                                  481200      
005643**                                                                481300      
005644******************************************************************481400      
005645******************************************************************481500      
005646***  PARAMETROS  S016_L422_TERCEROS_4     (161)                 **481600      
005647***  CONSULTA LAS CUENTAS DE TERCEROS,USANDO LA LLAVE QUE       **481700      
005648***  NO USA PRODUCTO - INSTRUMENTO                              **481800      
005649******************************************************************481900      
005650*                                                                 482000      
005651 77  R422-161-CTR-ERROR                   PIC S9(11) BINARY.      482100      
005652*                                                                 482200      
005653 01  E422-161-CTR-ENTRADA.                                        482300      
005654     03 E422-161-CTE-NUM                PIC 9(012) COMP.          482400      
005655     03 E422-161-CTA-NUMPROD            PIC 9(004) COMP.          482500      
005656     03 E422-161-CTA-CVEINST            PIC 9(002) COMP.          482600      
005657     03 E422-161-CTA-NUMPREF            PIC 9(004) COMP.          482700      
005658     03 E422-161-CTA-NUM                PIC 9(012) COMP.          482800      
005659     03 E422-161-SER-CVEUSOCTA          PIC 9(002) COMP.          482900      
005660     03 E422-161-CTA-3DIGITOS           PIC 9(004) COMP.          483000      
005661     03 E422-161-CTR-OPCION             PIC 9(002) COMP.          483100      
005662     03 FILLER                          PIC X(018).               483200      
005663* SIZE ENTRADA X(60)*                                             483300      
005664*                                                                 483400      
005665 01  S422-161-CTR-SALIDA.                                         483500      
005666     03 S422-161-CTR-NUMCSI         PIC 9(002) COMP.              483600      
005667     03 S422-161-CTE-NUM            PIC 9(012) COMP.              483700      
005668     03 S422-161-CTA-NUMPROD        PIC 9(004) COMP.              483800      
005669     03 S422-161-CTA-CVEINST        PIC 9(002) COMP.              483900      
005670     03 S422-161-CTA-NUMPREF        PIC 9(004) COMP.              484000      
005671     03 S422-161-CTA-NUM            PIC 9(012) COMP.              484100      
005672     03 S422-161-SER-LIMAXAUT       PIC 9(014) COMP.              484200      
005673     03 S422-161-SER-PERIODLIM      PIC X(001).                   484300      
005674     03 S422-161-CTA-CVEMONEDA      PIC 9(002) COMP.              484400      
005675     03 S422-161-SER-CVEUSOCTA      PIC 9(002) COMP.              484500      
005676     03 S422-161-CTR-FECALTTER      PIC 9(006) COMP.              484600      
005677     03 S422-161-CTR-FECMODTER      PIC 9(006) COMP.              484700      
005678     03 S422-161-SER-FECFINVIG      PIC 9(004) COMP.              484800      
005679     03 S422-161-CTA-3DIGITOS       PIC 9(004) COMP.              484900      
005680     03 S422-161-CTR-FEALTE-2K      PIC 9(008) COMP.              485000      
005681     03 S422-161-CTR-FEMOTE-2K      PIC 9(008) COMP.              485100      
005682     03 S422-161-SER-FEFIVI-2K      PIC 9(006) COMP.              485200      
005683     03 S422-161-CTR-FBAJA-2K       PIC 9(008) COMP.              485300      
005684     03 S422-161-CTA-FULCON-2K      PIC 9(008) COMP.              485400      
005685     03 S422-161-CTA-ALIAS          PIC X(020) .                  485500      
005686     03 S422-161-CTA-MEDALTA        PIC 9(004) COMP.              485600      
005687     03 S422-161-CTR-GERCTA         PIC 9(002) COMP.              485700      
005688     03 S422-161-CTR-HORALTA        PIC 9(008) COMP.              485800      
005689**                                                                485900      
005690  01  S422-161-RCTR-SALIDA REDEFINES S422-161-CTR-SALIDA.         486000      
005691     03 S422-161-CTR-ERROR                 PIC 9(004)    COMP.    486100      
005692     03 S422-161-CTR-ERRORTYPE             PIC 9(004)    COMP.    486200      
005693     03 S422-161-CTR-STRUCTURE             PIC 9(004)    COMP.    486300      
005694     03 FILLER                             PIC X(078).            486400      
005695                                                                  486500      
005696**                                                                486600      
005697******************************************************************486700      
005698** PARAMETROS          S016_L422_CONS_INTER_4 (162)             **486800      
005699** CONSULTA DE ORDENES DE PAGO Y DE CUENTAS INTERBANCARIAS      **486900      
005700**                                                              **487000      
005701**                                                              **487100      
005702******************************************************************487200      
005703*                                                                 487300      
005704 77 R422-162-CTR-ERROR                PIC S9(11) BINARY.          487400      
005705*                                                                 487500      
005706 01 E422-162-CTR-ENTRADA.                                         487600      
005707    02 E422-162-CTE-NUM               PIC 9(12) COMP.             487700      
005708    02 E422-162-CTA-CLABE-TARJ            PIC 9(20) COMP.         487800      
005709    02 E422-162-CTA-CLAVE-TARJ-R      REDEFINES                   487900      
005710                                      E422-162-CTA-CLABE-TARJ.    488000      
005711       03 E422-162-CTA-CLABE          PIC 9(04) COMP.             488100      
005712       03 E422-162-CTA-NUMPREF        PIC 9(04) COMP.             488200      
005713       03 E422-162-CTA-NUM            PIC 9(12) COMP.             488300      
005714    02 E422-162-CTE-NOMBENEF          PIC X(55).                  488400      
005715    02 E422-162-CTA-OPCION            PIC 9(02) COMP.             488500      
005716    02 E422-162-TIPO-CTA              PIC 9(02) COMP.             488600      
005717    02 E422-162-ESTABL                PIC 9(06) COMP.             488700      
005718    02 E422-162-CTE-SERVNUM           PIC 9(04) COMP.             488800      
005719    02 FILLER                         PIC X(24).                  488900      
005720*                                                                 489000      
005721*SIZE ENTRADA X(96).                                              489100      
005722*                                                                 489200      
005723  01 S422-162-CTR-SALIDA.                                         489300      
005724     02 S422-162-CTA-BANCO      PIC 9(04) COMP.                   489400      
005725     02 S422-162-CTA-SUC        PIC 9(04) COMP.                   489500      
005726     02 S422-162-CTE-NUMPROS    PIC 9(12) COMP.                   489600      
005727     02 S422-162-CTA-CUENTIP    PIC 9(02) COMP.                   489700      
005728     02 S422-162-CTA-CVEMONEDA  PIC 9(02) COMP.                   489800      
005729     02 S422-162-CTR-CODSWIFT   PIC X(12).                        489900      
005730     02 S422-162-CTR-CODABA     PIC X(10).                        490000      
005731     02 S422-162-CTR-GERCTA     PIC 9(02) COMP.                   490100      
005732     02 S422-162-CTE-CVEPERS    PIC 9(02) COMP.                   490200      
005733     02 S422-162-CTA-ALIAS      PIC X(20) .                       490300      
005734     02 S422-162-CTE-CVESECTOR  PIC 9(02) COMP.                   490400      
005735     02 S422-162-CTR-LIMAXUT    PIC 9(14) COMP.                   490500      
005736     02 S422-162-SER-PERIODLIM  PIC X(01) .                       490600      
005737     02 S422-162-CTR-NUMESTABL  PIC 9(06) COMP.                   490700      
005738     02 S422-162-CTR-FEALTA-2K  PIC 9(08) COMP.                   490800      
005739     02 S422-162-CTA-FULCON-2K  PIC 9(08) COMP.                   490900      
005740     02 S422-162-CTE-SERVNUM    PIC 9(04) COMP.                   491000      
005741     02 S422-162-CTR-HORALTA    PIC 9(08) COMP.                   491100      
005742**      Datos complementarios                                     491200      
005743     02 S422-162-CTE-NOM        PIC X(100) .                      491300      
005744     02 S422-162-CTE-EMAIL      PIC X(078) .                      491400      
005745     02 FILLER                  PIC X(06).                        491500      
005746                                                                  491600      
005747                                                                  491700      
005748**************************************************************    491800      
005749**         ENTRY POINT S016_L422_B77PORTAB        (163)     **    491900      
005750**             CONSULTA DE LA ESTRUCTURA B77                      492000      
005751**                                                          **    492100      
005752**************************************************************    492200      
005753**                                                                492300      
005754 77 R422-163-CTR-ERROR          PIC S9(11) BINARY.                492400      
005755**                                                                492500      
005756***PARAMETROS DE ENTRADA.                                         492600      
005757*************************                                         492700      
005758 01 E422-163-CTR-ENTRADA.                                         492800      
005759    03 E422-163-MDA-PREF        PIC 9(004) COMP.                  492900      
005760    03 E422-163-MDA-NUM         PIC 9(012) COMP.                  493000      
005761    03 E422-163-CTR-OPCION      PIC 9(002) COMP.                  493100      
005762**                                                                493200      
005763***PARAMETROS DE SALIDA.                                          493300      
005764************************                                          493400      
005765**                                                                493500      
005766 01 S422-163-CTR-SALIDA.                                          493600      
005767    03 S422-163-CTE-NUM         PIC 9(012) COMP.                  493700      
005768    03 S422-163-MDA-NUMCTO.                                       493800      
005769       05 S422-163-MDA-NUMPREF  PIC 9(004) COMP.                  493900      
005770       05 S422-163-MDA-NUM      PIC 9(012) COMP.                  494000      
005771    03 S422-163-MDA-TIP         PIC 9(002) COMP.                  494100      
005772*ZUMA-KCT-PORTV-180417-B                                          494200      
005773    03 S422-163-CTA-BANCO       PIC 9(005) COMP.                  494300      
005774*ZUMA-KCT-PORTV-180417-E                                          494400      
005775    03 S422-163-CTA-CLABE-TAR   PIC 9(020) COMP.                  494500      
005776    03 S422-163-CTR-SOEID       PIC X(010).                       494600      
005777    03 S422-163-CTR-FOLIO       PIC 9(015) COMP.                  494700      
005778    03 S422-163-CTR-FECALTA     PIC 9(008) COMP.                  494800      
005779    03 S422-163-CTR-FPROALTA    PIC 9(008) COMP.                  494900      
005780    03 S422-163-CTR-FECULTMOD   PIC 9(008) COMP.                  495000      
005781    03 S422-163-CTR-VACIO       PIC 9(008) COMP.                  495100      
005782**                                                                495200      
005783 01 S422-163-CTR-SAL-RED REDEFINES S422-163-CTR-SALIDA.           495300      
005784    03 S422-163-CTR-ERROR       PIC 9(04) COMP.                   495400      
005785    03 S422-163-CTR-ERRORTYPE   PIC 9(04) COMP.                   495500      
005786    03 S422-163-CTR-STRUCTURE   PIC 9(04) COMP.                   495600      
005787    03 FILLER                   PIC X(99).                        495700      
005788                                                                  495800      
005789                                                                  495900      
005790**************************************************************    496000      
005791**** PARAMETROS DEL ENTRY POINT S016_L422_ORDENA_EMAIL(164) **    496100      
005792**** CONSULTA DE EMAILS DEL CLIENTE                         **    496200      
005793**************************************************************    496300      
005794  01  E422-164-CTR-ENTRADA.                                       496400      
005795     02 E422-164-CTE-NUM             PIC 9(12) COMP.              496500      
005796                                                                  496600      
005797* SIZE ENTRADA (16).*                                             496700      
005798 01  S422-164-CTR-SALIDA.                                         496800      
005799     03 S422-164-OCCURS        OCCURS 10 TIMES.                   496900      
005800        05 S422-164-NUMCSI                    PIC 9(002) COMP.    497000      
005801        05 S422-164-CTE-NUM                   PIC 9(012) COMP.    497100      
005802        05 S422-164-TIPODE                    PIC 9(002) COMP.    497200      
005803        05 S422-164-NUMDOME                   PIC 9(004) COMP.    497300      
005804        05 S422-164-CVE-USO                   PIC 9(004) COMP.    497400      
005805        05 S422-164-CVEPROV                   PIC 9(004) COMP.    497500      
005806        05 S422-164-DOMELEC                   PIC X(078).         497600      
005807        05 S422-164-FEC-ALTA                  PIC 9(008) COMP.    497700      
005808        05 S422-164-FEC-ULTMOD                PIC 9(008) COMP.    497800      
005809*                                                                 497900      
005810*77  S422-164-RCTR-SALERR                  PIC S9(11) BINARY.     498000      
005811 77  R422-164-CTR-ERROR                    PIC S9(11) BINARY.     498100      
005812                                                                  498200      
005813*                                                                 498300      
005814                                                                  498400      
005815***************************************************************   498500      
005816**** PARAMETROS DEL ENTRY POINT S016_L422_CONS_CTESXTEL(165) **   498600      
005817**** CONSULTA DE CLIENTES POR TELEFONO                       **   498700      
005818***************************************************************   498800      
005819  01  E422-165-CTR-ENTRADA.                                       498900      
005820     02 E422-165-NUMTEL                 PIC 9(10) COMP.           499000      
005821     02 E422-165-OPCION                 PIC 9(02) COMP.           499100      
005822*            01 = CONSULTA DE LOS PRIMEROS   10 CLIENTES          499200      
005823*            02 = CONSULTA DE LOS SIGUIENTES 10 CLIENTES          499300      
005824     02 E422-165-CTE-NUM-KEY            PIC 9(12) COMP.           499400      
005825*            SE USA PARA LA OPCION 2, ES EL NUMERO DE CLIENTE     499500      
005826*            CON EL QUE DEBE DE CONTINUAR LA CONSULTA             499600      
005827                                                                  499700      
005828* SIZE ENTRADA (16).*                                             499800      
005829 01  S422-165-CTR-SALIDA.                                         499900      
005830     03 S422-165-OCCURS        OCCURS 10 TIMES.                   500000      
005831        05 S422-165-CTE-NUM             PIC 9(012) COMP.          500100      
005832        05 S422-165-CTE-NOM             PIC X(055).               500200      
005833        05 S422-165-RFC-INIC            PIC X(004).               500300      
005834        05 S422-165-RFC-FECHA           PIC 9(006) COMP.          500400      
005835        05 S422-165-RFC-HOMO            PIC X(005).               500500      
005836        05 S422-165-CVETIPO             PIC 9(002) COMP.          500600      
005837        05 S422-165-CTE-CALLENUM        PIC X(036).               500700      
005838        05 S422-165-CTE-NOMCOL          PIC X(024).               500800      
005839        05 S422-165-CTE-NOMPOB          PIC X(020).               500900      
005840        05 S422-165-CTE-CVEEDO          PIC 9(002) COMP.          501000      
005841        05 S422-165-CTE-NUMCP           PIC 9(006) COMP.          501100      
005842        05 S422-165-CTR-CVESTADOM       PIC 9(002) COMP.          501200      
005843        05 S422-165-CTR-CVEDOM          PIC 9(002) COMP.          501300      
005844     03 S422-165-RESULT                 PIC 9(004) COMP.          501400      
005845*            0 = NO HAY MAS TELEFONOS                             501500      
005846*            1 = SI HAY MAS TELEFONOS                             501600      
005847*            2 = NO EXISTE ESTE TELEFONO EN LA B65                501700      
005848     03 S422-165-CTE-NUM-CONT           PIC 9(012) COMP.          501800      
005849*            SE USA PARA EL RESULT 1, ES EL NUMERO DE CLIENTE     501900      
005850*            CON EL QUE DEBE DE CONTINUAR LA SIG. CONSULTA        502000      
005851                                                                  502100      
005852*77  S422-165-RCTR-SALERR               PIC S9(11) BINARY.        502200      
005853 77  R422-165-CTR-ERROR                 PIC S9(11) BINARY.        502300      
005854                                                                  502400      
005855*                                                                 502500      
005856                                                                  502600      
005857******************************************************************502700      
005858**                                                              **502800      
005859** FD DE PARAMETROS DEL ENTRYPOINT S016_L422_CTASINCORP2 (166)  **502900      
005860**    - CUENTAS INCORPORADAS                                    **503000      
005861**                                            ILA/ZUMA FEB-2016 **503100      
005862**                                                              **503200      
005863**                                                              **503300      
005864** se a¨adieron 2 campos a la salida, CTA-FECANC y MDA-FECANC   **503400      
005865******************************************************************503500      
005866*                                                                 503600      
005867*                         Long = 60 (hex) =  30 (ebcdic)          503700      
005868 01 E422-166-CTR-ENT.                                             503800      
005869    02 E422-166-LIB-OPC                PIC 9(02) COMP.            503900      
005870    02 E422-166-CTE-NUM                PIC 9(12) COMP.            504000      
005871    02 E422-166-CTA-PROD               PIC 9(04) COMP.            504100      
005872    02 E422-166-CTA-INST               PIC 9(02) COMP.            504200      
005873    02 E422-166-CTA-PREF               PIC 9(04) COMP.            504300      
005874    02 E422-166-CTA-NUM                PIC 9(12) COMP.            504400      
005875    02 E422-166-NUM-OCR                PIC 9(02) COMP.            504500      
005876    02 E422-166-MDA-NUMCTO                           .            504600      
005877       04 E422-166-MDA-NUMPREF         PIC 9(04) COMP.            504700      
005878       04 E422-166-MDA-NUM             PIC 9(12) COMP.            504800      
005879    02 E422-166-FILLER                 PIC X(06)     .            504900      
005880*                                                                 505000      
005881 01 S422-166-CTR-SAL.                                             505100      
005882    02 S422-166-CSI-NUM                PIC 9(02) COMP.            505200      
005883    02 S422-166-CTE-NUM                PIC 9(12) COMP.            505300      
005884    02 S422-166-CTE-STATUS             PIC 9(02) COMP.            505400      
005885    02 S422-166-CTE-TIPPER             PIC 9(02) COMP.            505500      
005886    02 S422-166-CTE-CLASIF             PIC 9(02) COMP.            505600      
005887    02 S422-166-NUM-OCR                PIC 9(02) COMP.            505700      
005888    02 S422-166-HAY-MAS                PIC 9(02) COMP.            505800      
005889    02 S422-166-TABLA                  OCCURS 20 TIMES.           505900      
005890       03 S422-166-CTO-PROD            PIC 9(04) COMP.            506000      
005891       03 S422-166-CTO-INST            PIC 9(02) COMP.            506100      
005892       03 S422-166-CTA-PREF            PIC 9(04) COMP.            506200      
005893       03 S422-166-CTA-NUM             PIC 9(12) COMP.            506300      
005894       03 S422-166-CTA-STATUS          PIC 9(02) COMP.            506400      
005895       03 S422-166-CTA-SUCURS          PIC 9(04) COMP.            506500      
005896       03 S422-166-CTO-MONEDA          PIC 9(02) COMP.            506600      
005897       03 S422-166-CTA-MANEJO          PIC 9(02) COMP.            506700      
005898       03 S422-166-CTE-CVEENV          PIC 9(04) COMP.            506800      
005899       03 S422-166-CTE-FECALT          PIC 9(08) COMP.            506900      
005900       03 S422-166-CTE-FECMOD          PIC 9(08) COMP.            507000      
005901       03 S422-166-CTO-RELCTE          PIC 9(02) COMP.            507100      
005902       03 S422-166-CTO-USOBEL          PIC 9(02) COMP.            507200      
005903       03 S422-166-CTO-CVEASO          PIC 9(02) COMP.            507300      
005904       03 S422-166-CTA-3DIGIT          PIC 9(04) COMP.            507400      
005905       03 S422-166-CTA-TIPCTA          PIC 9(02) COMP.            507500      
005906       03 S422-166-CTA-SUBTIP          PIC 9(02) COMP.            507600      
005907       03 S422-166-CTA-CVETIT          PIC 9(02) COMP.            507700      
005908       03 S422-166-CTO-NUMCTA          PIC 9(16) COMP.            507800      
005909       03 S422-166-CTO-MDASTA          PIC 9(02) COMP.            507900      
005910       03 S422-166-CTA-PROFTI          PIC X(03).                 508000      
005911       03 S422-166-CTA-NOMTIT          PIC 9(04) COMP.            508100      
005912       03 S422-166-CTA-PROFCO          PIC X(03).                 508200      
005913       03 S422-166-CTA-NOMCOT          PIC 9(04) COMP.            508300      
005914       03 S422-166-CTA-PRESEN          PIC 9(02) COMP.            508400      
005915       03 S422-166-CTA-FECALT          PIC 9(08) COMP.            508500      
005916       03 S422-166-CTA-FECMOD          PIC 9(08) COMP.            508600      
005917                                                                  508700      
005918  77  R422-166-CTR-ERROR               PIC S9(11) BINARY.         508800      
005919 01 S422-166-CTR-SAL2.                                            508900      
005920    02 S422-166-TABLA2                  OCCURS 20 TIMES.          509000      
005921       03 S422-166-CTA-FECANC          PIC 9(08) COMP.            509100      
005922       03 S422-166-MDA-FECANC          PIC 9(08) COMP.            509200      
005923*-> FIN ILA/ZUMA FEB-2016                                         509300      
005924*-> INICIO MHM/ZUMA JUNIO-2016                                    509400      
005925********************************************************          509500      
005926**** PARAMETROS DEL ENTRY POINT S016_L422_PORTABNOM               509600      
005927********************************************************          509700      
005928 01 E422-167-CTR-ENTRADA.                                         509800      
005929    02 E42-167-OPCION                   PIC 9(02) COMP.           509900      
005930*    01 =  CONSULTA POR NUMERO DE CLIENTE                         510000      
005931*    02 =  PAGINACION DE LA OPCION 1                              510100      
005932*    03 =  CONSULTA POR NUMERO DE TARJETA O CHEQUERA              510200      
005933*    04 =  PAGINACION OPCION 3                                    510300      
005934*    05 =  CONSULTA POR NUMERO DE CLIENTE Y NUMERO DE TARJETA     510400      
005935    02 E422-167-CTE-NUM                 PIC 9(12) COMP.           510500      
005936    02 E422-167-MDA-NUMCTO.                                       510600      
005937       04 E422-167-MDA-NUMPREF          PIC 9(04) COMP.           510700      
005938       04 E422-167-MDA-NUM              PIC 9(12) COMP.           510800      
005939                                                                  510900      
005940 01 S422-167-CTR-SAL.                                             511000      
005941    02  S422-167-NUM-CTE                PIC 9(12) COMP.           511100      
005942    02  S422-167-CONTINUACION           PIC 9(02) COMP.           511200      
005943*        01 = SI HAY MAS REGISTROS                                511300      
005944*        00 = NO HAY MAS REGISTROS                                511400      
005945    02 S422-167-OCCURS                  OCCURS 03 TIMES.          511500      
005946       04  S422-167-MDA-NUMPREF         PIC 9(04) COMP.           511600      
005947       04  S422-167-MDA-NUM             PIC 9(12) COMP.           511700      
005948       04  S422-167-MDA-TIP             PIC 9(02) COMP.           511800      
005949       04  S422-167-CTA-BANCO           PIC 9(04) COMP.           511900      
005950       04  S422-167-CLABE-TAR           PIC 9(20) COMP.           512000      
005951       04  S422-167-CTR-SOEID           PIC X(10).                512100      
005952       04  S422-167-CTR-FOLIO.                                    512200      
005953          06 S422-167-CTR-FOLIOK        PIC 9(15) COMP.           512300      
005954          06 S422-167-CTR-CERO          PIC 9(01) COMP.           512400      
005955       04  S422-167-CTR-FECALTA         PIC 9(08) COMP.           512500      
005956       04  S422-167-CTR-FPROALTA        PIC 9(08) COMP.           512600      
005957       04  S422-167-CTR-FECULTMOD       PIC 9(08) COMP.           512700      
005958       04  S422-167-CTR-VACIO           PIC 9(08) COMP.           512800      
005959 77  R422-167-CTR-ERROR                 PIC S9(11) BINARY.        512900      
005960*->FIN MHM/ZUMA JUNIO-2016                                        513000      
005961                                                                  513100      
005962*********************************************************         513200      
005963**     PARAMETROS  S016_L422_CON_XMEDIO_DIG14  (168)   **         513300      
005964**     CONSULTA B08MEDIOS                              **         513400      
005965*********************************************************         513500      
005966                                                                  513600      
005967  77 R422-168-CTR-ERROR                    PIC S9(11) BINARY.     513700      
005968                                                                  513800      
005969  01 E422-168-CTR-ENTRADA.                                        513900      
005970     03 E422-168-MDA-NUMERO                PIC 9(016) COMP.       514000      
005971     03 E422-168-MDA-RED     REDEFINES     E422-168-MDA-NUMERO.   514100      
005972        05 E422-168-MDA-NUMPREF            PIC 9(004) COMP.       514200      
005973        05 E422-168-MDA-NUM                PIC 9(012) COMP.       514300      
005974     03 FILLER                             PIC X(052).            514400      
005975* SIZE ENTRADA (60).*                                             514500      
005976  01 S422-168-CTR-SALIDA.                                         514600      
005977     03 S422-168-CTR-NUMCSI                PIC  9(002) COMP.      514700      
005978     03 S422-168-CTE-NUM                   PIC  9(012) COMP.      514800      
005979     03 S422-168-CTA-NUMPROD               PIC  9(004) COMP.      514900      
005980     03 S422-168-CTA-CVEINST               PIC  9(002) COMP.      515000      
005981     03 S422-168-CTA-NUMPREF               PIC  9(004) COMP.      515100      
005982     03 S422-168-CTA-NUM                   PIC  9(012) COMP.      515200      
005983     03 S422-168-MDA-CVETIPO               PIC  9(002) COMP.      515300      
005984     03 S422-168-MDA-SUBTIPO               PIC  9(002) COMP.      515400      
005985     03 S422-168-MDA-CVETIT                PIC  9(002) COMP.      515500      
005986     03 S422-168-MDA-NUMPREF               PIC  9(004) COMP.      515600      
005987     03 S422-168-MDA-NUM                   PIC  9(012) COMP.      515700      
005988     03 S422-168-MDA-ABRPROFT              PIC  X(003).           515800      
005989     03 S422-168-CTR-PTRNOMT               PIC  9(004) COMP.      515900      
005990     03 S422-168-MDA-ABRPROFC              PIC  X(003).           516000      
005991     03 S422-168-CTR-PTRNOMC               PIC  9(004) COMP.      516100      
005992     03 S422-168-MDA-NUMTALON              PIC  9(002) COMP.      516200      
005993     03 S422-168-MDA-CHQXTALON             PIC  9(002) COMP.      516300      
005994     03 S422-168-MDA-CVEPIN                PIC  9(006) COMP.      516400      
005995     03 S422-168-MDA-CVESTATUS             PIC  9(002) COMP.      516500      
005996     03 S422-168-MDA-FECALTA-2K            PIC  9(008) COMP.      516600      
005997     03 S422-168-MDA-FECULTMOD-2K          PIC  9(008) COMP.      516700      
005998     03 S422-168-MDA-FECULTACC-2K          PIC  9(008) COMP.      516800      
005999     03 S422-168-MDA-FECVENC-2K            PIC  9(008) COMP.      516900      
006000     03 S422-168-MDA-FECCANCEL-2K          PIC  9(008) COMP.      517000      
006001     03 S422-168-MDA-FECPREV               PIC  9(006) COMP.      517100      
006002     03 S422-168-MDA-FECMODPIN-2K          PIC  9(008) COMP.      517200      
006003     03 S422-168-MDA-HHPREV                PIC  9(004) COMP.      517300      
006004     03 S422-168-MDA-HHALTA                PIC  9(004) COMP.      517400      
006005     03 S422-168-MDA-HHULTMOD              PIC  9(004) COMP.      517500      
006006     03 S422-168-MDA-HHULTACC              PIC  9(004) COMP.      517600      
006007     03 S422-168-MDA-HHVENC                PIC  9(004) COMP.      517700      
006008     03 S422-168-MDA-PERIODO               PIC  9(002) COMP.      517800      
006009     03 S422-168-MDA-SITUACION             PIC  X(004).           517900      
006010     03 FILLER                             PIC  X(021).           518000      
006011* SIZE SALIDA X(108).                                             518100      
006012*                                                                 518200      
006013 01 S422-168-RCTR-SALIDA REDEFINES S422-168-CTR-SALIDA.           518300      
006014*                                                                 518400      
006015    03 S422-168-CTR-ERROR                 PIC 9(004) COMP.        518500      
006016    03 S422-168-CTR-ERRORTYPE             PIC 9(004) COMP.        518600      
006017    03 S422-168-CTR-STRUCTURE             PIC 9(004) COMP.        518700      
006018    03 FILLER                             PIC 9(102) COMP.        518800      
006019                                                                  518900      
006020                                                                  519000      
006021                                                                  519100      
006022                                                                  519200      
006023*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
006024                                                                  034600      
006025 77 W77-NUM-CTE                        PIC 9(12) COMP.            034700      
006026******************************************************************034800      
006027*             PARAMETROS PARA LIBRERIA CLTVERS                   *034900      
006028******************************************************************035000      
006029*                                                                 035100      
006030 01  WKS-CTLVER-NUMREG                 PIC 9(02).                 035200      
006031 01  WKS-CTLVER-LIBID                  PIC X(12).                 035300      
006032*INI INFOWARE                                                     035310      
006033 01  WKS-CTLVERS-LIBID-R REDEFINES WKS-CTLVER-LIBID.              035320      
006034     03 WKS-LIBID-NOMB               PIC X(09).                   035330      
006035     03 WKS-LIBID-SIST               PIC X(03).                   035340      
006036*FIN INFOWARE                                                     035350      
006037 01  WKS-CTLVER-NOMLIB                 PIC X(72).                 035400      
006038 77  W77-CTLVER-RSLT                   PIC S9(11) BINARY.         035500      
006039*                                                                 035600      
006040******************************************************************035700      
006041*     LIBRERIA DEL S408 QUE PROPORCIONA LINEA DE CREDITO         *035800      
006042******************************************************************035900      
006043 01 WKS-FTO-LLAMADO-S408.                                         036000      
006044    02 WKS-FUN-S408                       PIC 9(02).              036100      
006045    02 WKS-FEC-S408                       PIC 9(08).              036200      
006046    02 WKS-CTO-S408                       PIC 9(12).              036300      
006047    02 WKS-RESPUESTA-S408.                                        036400      
006048       04 WKS-SDO-S408                    PIC 9(14)V99.           036500      
006049       04 WKS-DIS-S408                    PIC 9(14)V99.           036520      
006050       04 FILLER                          PIC X(20).              036540      
006051       04 WKS-S408-RESULT                 PIC 9(02).              036600      
006052                                                                  036700      
006053 01 WKS-CONTRATO-S408.                                            036800      
006054    03 WKS-SUC-S408                       PIC 9(04).              036900      
006055    03 WKS-CONT-S408                      PIC 9(12).              037000      
006056******************************************************************037100      
006057*              VARIABLES PARA EL MANEJO DE CORTES                *037200      
006058******************************************************************037300      
006059 77  I                                 PIC 9(4)   COMP.           037400      
006060 77  J                                 PIC 9(4)   COMP.           037500      
006061 77  K                                 PIC 9(4)   COMP.           037600      
006062 77  L                                 PIC 9(4)   COMP.           037700      
006063 77  W77-SIS-ENT                       PIC 9(4)   COMP.           037800      
006064 77  M                                 PIC 9(4)   COMP.           037900      
006065 77  X                                 PIC 9(4)   COMP.           038000      
006066 77  Y                                 PIC 9(4)   COMP.           038100      
006067 77  Z                                 PIC 9(4)   COMP.           038200      
006068                                                                  038300      
006069 77  W77-IND                           PIC 9(02).                 038400      
006070 77  W77-SDOACT                        PIC 9.                     038500      
006071     88 W88-SDOACT                     VALUE 1.                   038600      
006072 77  W77-SDOACT-TEMP                   PIC S9(16)V99.             038700      
006073 77  W77-SDOACT-TEMP-BNE               PIC S9(16)V99.             038750      
006074 77  W77-S408-OK                       PIC 9.                     038800      
006075     88 W88-S408-OK                    VALUE 1.                   038900      
006076******************************************************************039000      
006077*         VARIABLES PARA EL MANEJO DE DATOS CITI                 *039100      
006078******************************************************************039200      
006079 01 WKS-NUM-CTA-CITI.                                             039300      
006080    03 WKS-NUMPREF                    PIC 9(04).                  039400      
006081    03 WKS-CUENTA                     PIC 9(07).                  039500      
006082                                                                  039600      
006083 01 WKS-NUM-CUENTA-T                  PIC 9(11).                  039700      
006084 01 WKS-NUM-CUENTA-T-R REDEFINES WKS-NUM-CUENTA-T.                039800      
006085    03 WKS-FILLER-1                   PIC 9(02).                  039900      
006086    03 WKS-2D-NUMPREF                 PIC 9(02).                  040000      
006087    03 WKS-4D-CTA                     PIC 9(04).                  040100      
006088    03 WKS-FILLER-2                   PIC 9(03).                  040200      
006089                                                                  040300      
006090 01 WKS-BASE-NUMBER.                                              040400      
006091    03 WKS-BN-FILLER1                 PIC 9(01) VALUE 0.          040500      
006092    03 WKS-BN-2DNUMPREF               PIC 9(02).                  040600      
006093    03 WKS-BN-4DCTA                   PIC 9(04).                  040700      
006094    03 WKS-BN-FILLER2                 PIC 9(04) VALUE 0000.       040800      
006095                                                                  040900      
006096  01 WKS-NUM-CUENTA-T2                 PIC 9(11).                 041000      
006097  01 WKS-NUM-CUENTA-T2-R REDEFINES WKS-NUM-CUENTA-T2.             041100      
006098     03 WKS-1DIG-CTA                   PIC 9(01).                 041200      
006099     03 WKS-DIG-MUEVE                  PIC 9(01).                 041300      
006100     03 WKS-6DIG-CTA                   PIC 9(06).                 041400      
006101     03 WKS-3DIG-CTA                   PIC 9(03).                 041500      
006102                                                                  041600      
006103 01 WKS-CTA-FTOINT.                                               041700      
006104    03 WKS-1DIG-CTAFTOI               PIC 9(01).                  041800      
006105    03 WKS-6DIG-CTAFTOI               PIC 9(06).                  041900      
006106    03 WKS-7DIG-CTAFTOI               PIC 9(01).                  042000      
006107    03 WKS-3DIG-CTAFTOI               PIC 9(03).                  042100      
006108                                                                  042200      
006109  01 WKS-LIABILITI-NUMBER.                                        042300      
006110     03 WKS-LI-FILLER1                 PIC 9(01) VALUE 0.         042400      
006111     03 WKS-LIABILIT                   PIC 9(06).                 042500      
006112     03 WKS-LI-FILLER2                 PIC 9(04) VALUE 0000.      042600      
006113                                                                  042700      
006114******************************************************************042800      
006115*        VARIABLES PARA ALMACENAR LAS FECHAS Y TIEMPOS           *042900      
006116******************************************************************043000      
006117                                                                  043100      
006118 01  FECHAS.                                                      043200      
006119     02  WKS-FECHA-ACTUAL-AMD.                                    043300      
006120         03  WKS-AMO-ACTUAL-AMD        PIC 9(4).                  043400      
006121         03  WKS-MES-ACTUAL-AMD        PIC 9(2).                  043500      
006122         03  WKS-DIA-ACTUAL-AMD        PIC 9(2).                  043600      
006123     02  WKS-FECHA-PROCESO-DMA         PIC 9(08).                 043700      
006124                                                                  043800      
006125     02  WKS-FECHA-ACTUAL-DMA REDEFINES WKS-FECHA-PROCESO-DMA.    043900      
006126         03  WKS-DIA-ACTUAL-DMA        PIC 9(2).                  044000      
006127         03  WKS-MES-ACTUAL-DMA        PIC 9(2).                  044100      
006128         03  WKS-AMO-ACTUAL-DMA        PIC 9(4).                  044200      
006129     02  WKS-FECHA-TEMP.                                          044300      
006130         03  WKS-DIA-TEMP-DMA          PIC 9(2).                  044400      
006131         03  WKS-MES-TEMP-DMA          PIC 9(2).                  044500      
006132         03  WKS-AMO-TEMP-DMA          PIC 9(4).                  044600      
006133     02  WKS-FECHA-ACTUAL-MDA.                                    044700      
006134         03  WKS-MES-ACTUAL-MDA        PIC 9(2).                  044800      
006135         03  WKS-DIA-ACTUAL-MDA        PIC 9(2).                  044900      
006136         03  WKS-AMO-ACTUAL-MDA        PIC 9(4).                  045000      
006137                                                                  045100      
006138     02  WKS-FECCONT                   PIC 9(08).                 045200      
006139     02  WKS-FECCONT-R  REDEFINES   WKS-FECCONT.                  045300      
006140         03  WKS-FC-AA                  PIC 9(04).                045400      
006141         03  WKS-FC-MM                  PIC 9(02).                045500      
006142         03  WKS-FC-DD                  PIC 9(02).                045600      
006143                                                                  045700      
006144     02  WKS-FORMATO-FECHA.                                       045800      
006145         03  WKS-FORM-DD                PIC 9(02).                045900      
006146         03  FILLER                     PIC X(01) VALUE "/".      046000      
006147         03  WKS-FORM-MM                PIC X(03).                046100      
006148         03  FILLER                     PIC X(01) VALUE "/".      046200      
006149         03  WKS-FORM-AA                PIC 9(04).                046300      
006150*                                                                 046400      
006151 01  WKS-HORA-OPERACION                 PIC 9(6) COMP.            046500      
006152                                                                  046600      
006153 01  WKS-HORA-OPERACION-R  REDEFINES WKS-HORA-OPERACION.          046700      
006154     02  WKS-HH-OP                      PIC 9(2) COMP.            046800      
006155     02  WKS-MM-OP                      PIC 9(2) COMP.            046900      
006156     02  WKS-SS-OP                      PIC 9(2) COMP.            047000      
006157*                                                                 047100      
006158 01  WKS-HORA-HS-R.                                               047200      
006159     02  WKS-HORA-HH                    PIC 9(2) COMP.            047300      
006160     02  WKS-HORA-MM                    PIC 9(2) COMP.            047400      
006161     02  FILLER                        PIC 9(4) COMP.             047500      
006162*                                                                 047600      
006163 01  WKS-HORA-HS-RR REDEFINES WKS-HORA-HS-R.                      047700      
006164     02  WKS-HORA-HSS                  PIC 9(6) COMP.             047800      
006165     02  FILLER                        PIC 9(2) COMP.             047900      
006166*                                                                 048000      
006167 01  WKS-HORA-HSS-R REDEFINES WKS-HORA-HS-R.                      048100      
006168     02  WKS-HORA-HSS-HH               PIC 9(2) COMP.             048200      
006169     02  WKS-HORA-HSS-MM               PIC 9(2) COMP.             048300      
006170     02  WKS-HORA-HSS-SS               PIC 9(2) COMP.             048400      
006171     02  FILLER                        PIC 9(2) COMP.             048500      
006172 01  WKS-HORA-HS    REDEFINES WKS-HORA-HS-R   PIC 9(8) COMP.      048600      
006173                                                                  048700      
006174 77  W77-FECULT-ACT                    PIC 9(07).                 048800      
006175******************************************************************048900      
006176*                   CONTADORES DE HOJAS                          *049000      
006177******************************************************************049100      
006178                                                                  049200      
006179 01  CONTADORES.                                                  049300      
006180     02  WKS-NUM-HOJAS-SUC             PIC 9(3) COMP VALUE 0.     049400      
006181     02  WKS-TOTAL-HOJAS               PIC 9(4) COMP VALUE 0.     049500      
006182     02  WKS-NUM-LINEAS                PIC 9(2) COMP VALUE 0.     049600      
006183/                                                                 049700      
006184******************************************************************049800      
006185*               VARIABLES PARA LA LOCAL SUPPORT                  *049900      
006186******************************************************************050000      
006187                                                                  050100      
006188 01  WKS-CODIGO-ESTRUCT                PIC 9(6).                  050200      
006189 01  WKS-CODIGO-ESTRUCT-R  REDEFINES WKS-CODIGO-ESTRUCT.          050300      
006190     03  WKS-LLAVE-ESTRUCT             PIC 9(4).                  050400      
006191     03  WKS-CLAVE-ESTRUCT             PIC 9(2).                  050500      
006192                                                                  050600      
006193 01  WKS-RESPUESTA-ESTRUCT.                                       050700      
006194     03  WKS-RESULTADO-ESTRUCT         PIC 9(1).                  050800      
006195     03  WKS-NOMBRE-SUC-ESTRUCT        PIC X(40).                 050900      
006196     03  FILLER                        PIC X(40).                 051000      
006197                                                                  051100      
006198 01  WKS-CSI-RESP-ESTRUCT.                                        051200      
006199     03  WKS-RESULT-CSI-ESTRUCT        PIC 9(1).                  051300      
006200     03  WKS-CSI-ESTRUCT               PIC 9(2).                  051400      
006201     03  FILLER                        PIC X(78).                 051500      
006202                                                                  051600      
006203 77  W77-FUNCION                       PIC S9(11) BINARY.         051700      
006204 77  W77-FORMATO                       PIC S9(11) BINARY.         051800      
006205                                                                  051900      
006206 01  WKS-FECHA1                        PIC X(08).                 052000      
006207 01  WKS-FECHA1-RED   REDEFINES WKS-FECHA1.                       052100      
006208     05  WKS-AMO1-RED                  PIC 9(04).                 052200      
006209     05  WKS-MES1-RED                  PIC 9(02).                 052300      
006210     05  WKS-DIA1-RED                  PIC 9(02).                 052400      
006211*                                                                 052500      
006212 01  WKS-FECHA2                        PIC X(08).                 052600      
006213 01  WKS-FECHA2-RED   REDEFINES WKS-FECHA2.                       052700      
006214     05  WKS-AMO2-RED                  PIC 9(04).                 052800      
006215     05  WKS-MES2-RED                  PIC 9(02).                 052900      
006216     05  WKS-DIA2-RED                  PIC 9(02).                 053000      
006217*                                                                 053100      
006218 01  WKS-DATOS-HOST.                                              053200      
006219     03  WKS-NUMCSI                    PIC 9(02).                 053300      
006220     03  WKS-NOMEQUIPO                 PIC X(10).                 053400      
006221     03  WKS-NOMCSI                    PIC X(26).                 053500      
006222     03  WKS-LINEABATCH                PIC X(05).                 053600      
006223*                                                                 053700      
006224 01  WKS-DATOS-CTL WITH LOWER-BOUNDS.                             053800      
006225     03  WKS-CTL-FUNCION               PIC 9(02).                 053900      
006226     03  WKS-CTL-SISTEMA               PIC 9(04).                 054000      
006227     03  WKS-CTL-NUMCSI                PIC 9(02).                 054100      
006228     03  WKS-CTL-FECPROC               PIC 9(08).                 054200      
006229     03  WKS-CTL-FECCONT               PIC 9(08).                 054300      
006230     03  WKS-CTL-FECS151               PIC 9(08).                 054400      
006231     03  WKS-CTL-STAREG                PIC 9(02).                 054500      
006232     03  WKS-CTL-NOMSDO                PIC X(34).                 054600      
006233     03  WKS-CTL-PKSDO                 PIC X(17).                 054700      
006234     03  WKS-CTL-NOMMOV                PIC X(34).                 054800      
006235     03  WKS-CTL-PKMOV                 PIC X(17).                 054900      
006236     03  WKS-CTL-NOMDES                PIC X(34).                 055000      
006237     03  WKS-CTL-PKDES                 PIC X(17).                 055100      
006238     03  WKS-CTL-NOMERR                PIC X(34).                 055200      
006239     03  WKS-CTL-PKERR                 PIC X(17).                 055300      
006240     03  WKS-CTL-NOMBD                 PIC X(17).                 055400      
006241     03  WKS-CTL-STABD                 PIC 9(02).                 055500      
006242     03  WKS-CTL-NUMARC                PIC 9(02).                 055600      
006243     03  WKS-CTL-3ERNIV                PIC 9(02).                 055700      
006244     03  WKS-CTL-OCC-FECHAS      OCCURS 10 TIMES.                 055800      
006245         05  WKS-CTL-FECARCH           PIC 9(08).                 055900      
006246         05  WKS-CTL-NIVARCH           PIC 9(08).                 056000      
006247         05  WKS-CTL-NIVBDM            PIC 9(08).                 056100      
006248         05  WKS-CTL-STAARCH           PIC 9(02).                 056200      
006249*                                                                 056300      
006250******************************************************************056400      
006251*            NOMBRE DEL WFL PARA EJECUCION DEL P940              *056500      
006252*            PARA ENVIO DE ARCHIVOS A CITIBANK.                  *056600      
006253******************************************************************056700      
006254                                                                  056800      
006255  01 WKS-TIT-WFL.                                                 056900      
006256     02 FILLER                   PIC X(06) VALUE "START ".        057000      
006257     02 WKS-START-PROG           PIC X(36).                       057100      
006258     02 FILLER                   PIC X(02) VALUE " (".            057200      
006259     02 FILLER                   PIC X(01) VALUE QUOTES.          057300      
006260     02 FILLER                   PIC X(01) VALUE "S".             057400      
006261     02 WKS-START-SIS            PIC 9(03).                       057500      
006262     02 WKS-START-CCI            PIC X(01).                       057600      
006263     02 WKS-START-ARCH           PIC X(03).                       057700      
006264     02 FILLER                   PIC X(01) VALUE QUOTES.          057800      
006265     02 FILLER                   PIC X(01) VALUE ",".             057900      
006266     02 FILLER                   PIC X(01) VALUE QUOTES.          058000      
006267     02 WKS-START-FEC            PIC 9(08).                       058100      
006268     02 FILLER                   PIC X(01) VALUE QUOTES.          058200      
006269     02 FILLER                   PIC X(01) VALUE ",".             058300      
006270     02 FILLER                   PIC X(01) VALUE QUOTES.          058400      
006271     02 WKS-START-CSI            PIC 9(02).                       058500      
006272     02 FILLER                   PIC X(01) VALUE QUOTES.          058600      
006273     02 FILLER                   PIC X(01) VALUE ")".             058700      
006274/                                                                 058800      
006275******************************************************************058900      
006276*       DEFINICION DE TABLA PARA SISTEMAS QUE SE PROCESAN        *059000      
006277******************************************************************059100      
006278*                                                                 059200      
006279 01 SISTEMAS.                                                     059300      
006280     02  FILLER     PIC X(16) VALUE "001CHEQUES      ".           059400      
006281     02  FILLER     PIC X(16) VALUE "500CTA. MAESTRA ".           059500      
006282     02  FILLER     PIC X(16) VALUE "500AHORROS      ".           059600      
006283     02  FILLER     PIC X(16) VALUE "084FONDOS       ".           059700      
006284     02  FILLER     PIC X(16) VALUE "408LIN.SOBREGIRO".           059800      
006285     02  FILLER     PIC X(16) VALUE "999NO CALIFICADO".           059900      
006286 01 TABLA-SISTEMAS REDEFINES SISTEMAS.                            060000      
006287     02  TAB-SISTEMA         OCCURS    6 TIMES.                   060100      
006288         03  NUM-SISTEMA               PIC X(03).                 060200      
006289         03  SISTEMA                   PIC X(13).                 060300      
006290*                                                                 060400      
006291 01  CSI.                                                         060500      
006292     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  1   ".   060600      
006293     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  2   ".   060700      
006294     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  3   ".   060800      
006295     02  FILLER       PIC X(25) VA "MONM O N T E R R E Y     ".   060900      
006296     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  5   ".   061000      
006297     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  6   ".   061100      
006298     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  7   ".   061200      
006299     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  8   ".   061300      
006300     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  9   ".   061400      
006301     02  FILLER       PIC X(25) VA "VDMV A L L E  DE  M E X .".   061500      
006302                                                                  061600      
006303 01  TABLA-CSI REDEFINES CSI.                                     061700      
006304     02  TAB-CSI OCCURS 10 TIMES.                                 061800      
006305         03  WKS-NOMB-CSI              PIC X(03).                 061900      
006306                                                                  062000      
006307 77 W77-I                              PIC 9(02).                 062100      
006308 77 W77-SIST-PARAM                     PIC 9(03).                 062200      
006309 77 W77-FECHA-PROC                     PIC 9(08).                 062300      
006310 77 W77-VALUE                          PIC 9(08) VALUE 0.         062400      
006311 77 W77-STATUS                         PIC 9(04).                 062500      
006312 77 W77-NUMREG-001                     PIC 9(08) COMP.            062600      
006313 77 W77-NUMREG-066                     PIC 9(08) COMP.            062700      
006314 77 W77-SDOACT-001                     PIC S9(15)V99 COMP.        062800      
006315 77 W77-SDOACT-066                     PIC S9(15)V99 COMP.        062900      
006316 77 W77-NUMCTO-001                     PIC 9(08) COMP.            063000      
006317 77 W77-NUMCTO-066                     PIC 9(08) COMP.            063100      
006318 77 W77-FINLOG                         PIC 9(02).                 063200      
006319    88 W88-FINLOG                      VALUE 1.                   063300      
006320 77 W77-FILEOK                         PIC 9(02).                 063400      
006321    88 W88-FILEOK                      VALUE 1.                   063500      
006322                                                                  063600      
006323 01  WKS-NOM-ACC.                                                 063617      
006324     02 FILLER                     PIC X(06).                     063634      
006325     02 WKS-NOMBREACC              PIC X(36).                     063651      
006326     02 FILLER                     PIC X(16).                     063668      
006327                                                                  063670      
006328 01  WKS-NOM-ACC-BNE.                                             063672      
006329     02 FILLER                     PIC X(06).                     063674      
006330     02 WKS-NOMBREACC-BNE          PIC X(36).                     063676      
006331     02 FILLER                     PIC X(16).                     063678      
006332                                                                  063685      
006333 01  WKS-TABLA-ESTRUCTURA.                                        063700      
006334     03  WKS-TBL-ESTRUCTURA  OCCURS  5000 TIMES.                  063800      
006335         05  WKS-TAB-NOD-SUB           PIC 9(04) COMP.            063900      
006336         05  WKS-TAB-NOD-SUB-R REDEFINES WKS-TAB-NOD-SUB.         064000      
006337             07  WKS-TAB-NODO          PIC 9(02) COMP.            064100      
006338             07  WKS-TAB-SUBNODO       PIC 9(02) COMP.            064200      
006339                                                                  064300      
006340 01  WKS-COMPILA                       PIC 9(11) BINARY.          064400      
006341                                                                  064500      
006342 01  WKS-FECAPLI                       PIC 9(08).                 064600      
006343 01  WKS-FECAPLI-R REDEFINES WKS-FECAPLI.                         064700      
006344     03  WKS-AA-FECAPLI                PIC 9(04).                 064800      
006345     03  WKS-MM-FECAPLI                PIC 9(02).                 064900      
006346     03  WKS-DD-FECAPLI                PIC 9(02).                 065000      
006347                                                                  065008      
006348 01  WKS-COPY-L030.                                               065016      
006349    03 FILLER                 PIC X(06) VALUE "START ".           065024      
006350    03 WKS-N-WFL              PIC X(37).                          065032      
006351    03 FILLER                 PIC X(01) VALUE "(".                065040      
006352    03 FILLER                 PIC X(01) VALUE QUOTES.             065048      
006353    03 FILLER                 PIC X(20) VALUE                     065056      
006354                                      "CORRESOLO P102 S151 ".     065064      
006355    03 WKS-ARCHIVO            PIC X(36) VALUE SPACES.             065072      
006356    03 FILLER                 PIC X(12) VALUE " CMEMP CMEMP".     065080      
006357    03 FILLER                 PIC X(01) VALUE QUOTES.             065088      
006358    03 FILLER                 PIC X(01) VALUE ")".                065096      
006359                                                                  065100      
006360******************************************************************065200      
006361                                                                  065300      
006362*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
006363*    COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".        065400      
006364**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
006365  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
006366  01 MENSAJE-LJ.                                                  100300      
006367     02 SISTEMA-LJ     PIC X(04).                                 100400      
006368     02 FILLER         PIC X VALUE "/".                           100500      
006369     02 PASO-LJ        PIC X(04).                                 100600      
006370     02 FILLER         PIC X VALUE "/".                           100700      
006371     02 MTP-LJ         PIC 9(03).                                 100800      
006372     02 FILLER         PIC X VALUE ":".                           100900      
006373     02 TIPO-LJ        PIC X.                                     101000      
006374     02 FILLER         PIC X VALUE ">".                           101100      
006375     02 CODIGO-LJ      PIC 9(06).                                 101200      
006376     02 FILLER         PIC X VALUE "<".                           101300      
006377     02 TEXTO-LJ       PIC X(250).                                101400      
006378*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
006379*                                                                 065500      
006380 01  WKS-TEXTO.                                                   065600      
006381     02  FILLER    PIC X(20) VALUE "INICIO DE PROCESO : ".        065700      
006382     02  FEC-TEX   PIC X(08).                                     065800      
006383                                                                  065900      
006384*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
006385*    COPY "(S151)S151/FORMATO/DISPLAY ON CMEMP".                  066000      
006386                                                                  000100      
006387*===============================================================* 000200      
006388*         FORMATO PARA DISPLAYS                                 * 000300      
006389*===============================================================* 000400      
006390                                                                  000500      
006391 01 WKS-TIT-REPORTE2.                                             000600      
006392    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
006393    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
006394    02 FILLER                       PIC X(06) VALUE               000900      
006395                                              "/LIST/".           001000      
006396    02 WKS-PASO-BACK2               PIC X(04).                    001051      
006397    02 FILLER                       PIC X(01) VALUE "/".          001071      
006398    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
006399    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
006400    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
006401    02 FILLER                       PIC X(1)  VALUE "/".          001400      
006402    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
006403    02 FILLER                       PIC X(11) VALUE               001600      
006404                                              "/001MSGIMP.".      001700      
006405                                                                  002100      
006406 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
006407                                                                  002300      
006408***********************************************************       002400      
006409*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
006410***********************************************************       002600      
006411 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
006412*8D                                                               002800      
006413 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
006414 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
006415    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
006416    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
006417    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
006418*8D                                                               003400      
006419 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
006420 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
006421    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
006422    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
006423    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
006424                                                                  004100      
006425 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
006426                                                                  004300      
006427 01 WKS-FECHA-HORA2.                                              004400      
006428    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
006429    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
006430       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
006431       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
006432    02 WKS-TIME-MAQ2.                                             004600      
006433       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
006434       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
006435          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
006436          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
006437          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
006438       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
006439    02 FILLER                             PIC X(01).              004900      
006440    02 WKS-RESTO2                         PIC X(04).              005000      
006441                                                                  005100      
006442*8D                                                               005200      
006443****************** REPORTE DE MENSAJES *********************      005300      
006444 01 WLI-ENCAB-12.                                                 005400      
006445    03 FILLER                             PIC X(05) VALUE         005500      
006446       "S151-".                                                   005600      
006447    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
006448    03 FILLER                             PIC X(15) VALUE         005671      
006449       "-001IMPMENSAJES".                                         005691      
006450    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
006451    03 FILLER                             PIC X(34) VALUE         005800      
006452       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
006453    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
006454    03 FILLER                             PIC X(26) VALUE         006100      
006455       "FECHA DE LA INFORMACION : ".                              006200      
006456    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
006457    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
006458       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
006459       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
006460       05  WKS-SLASH1                         PIC X(01).          006356      
006461       05  WLI-RB-E1-MES                  PIC 99.                 006357      
006462       05  WKS-SLASH2                         PIC X(01).          006358      
006463       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
006464 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
006465 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
006466    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
006467    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
006468    03 FILLER                          PIC X(01).                 006371      
006469    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
006470    03 FILLER                          PIC X(01).                 006381      
006471    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
006472*8D                                                               006400      
006473 01 WLI-ENCAB-22.                                                 006500      
006474     03 FILLER                          PIC X(11) VALUE           006600      
006475        "F.PROCESO: ".                                            006700      
006476     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
006477     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
006478     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
006479     03 FILLER                          PIC X(01) VALUE ":".      007020      
006480     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
006481     03 FILLER                          PIC X(01) VALUE ":".      007060      
006482     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
006483     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
006484     03 FILLER                          PIC X(24) VALUE           007200      
006485              "IMPRESION MENSAJES DEL S".                         007300      
006486     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
006487     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
006488     03 FILLER                          PIC X(14) VALUE           007600      
006489        "TIPO PROCESO: ".                                         007700      
006490     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
006491*8D                                                               007900      
006492 01 WLI-ENCAB-32.                                                 008000      
006493     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
006494*       "VERSION  : ".                                            008200      
006495*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
006496     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
006497     03 FILLER                     PIC X(07) VALUE                008500      
006498        "HOJA : ".                                                008600      
006499     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
006500                                                                  008800      
006501 01 WLI-ENCAB-42.                                                 008900      
006502     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
006503     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
006504     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
006505                                                                  009300      
006506 01 WLI-ENCAB-52.                                                 009400      
006507    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
006508    03 WLI-TIPO-LJ                PIC X(02).                      009600      
006509    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
006510    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
006511                                                                  009900      
006512*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
006513 01 WLI-ENCAB-62.                                                 009910      
006514    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
006515    03 WLI-RESULT                 PIC X(04).                      009920      
006516    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
006517    03 WLI-TEXTO                  PIC X(110).                     009930      
006518                                                                  009935      
006519 01 WLI-TOT-ENVIO.                                                009940      
006520    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
006521    03 FILLER                     PIC X(37) VALUE                 009950      
006522       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
006523    03 WLI-ENV-CTD                PIC X(04).                      009960      
006524*FIN - INFOWARE                                                   009970      
006525****************************************************************  010000      
006526*                 CONTADORES DE HOJAS                          *  010100      
006527****************************************************************  010200      
006528                                                                  010300      
006529  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
006530*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
006531*INI - INFOWARE                                                   066005      
006532* TITULO DE LA L002                                               066010      
006533 01 WKS-TIT-REGISTRA.                                             066015      
006534    02 FILLER                     PIC X(32) VALUE                 066020      
006535       "(S151)S151/OBJECT/L002/REGISTRAS" .                       066025      
006536    02 WKS-TIT-SISREG             PIC 9(03) VALUE 0.              066030      
006537    02 FILLER                     PIC X(19) VALUE                 066035      
006538        "/03MTP044 ON CMEMP.".                                    066040      
006539 77 W77-TIPO-OPCION               PIC 9(02).                      066045      
006540* Variables para hacer el llamado a la libreria                   066050      
006541 01  WKS-151-DATOS WITH LOWER-BOUNDS.                             066055      
006542     03 WKS-DEL-FUNCION              PIC 9(04).                   066060      
006543     03 WKS-DEL-FECHA PIC 9(08).                                  066065      
006544     03 WKS-DEL-NUMLOG               PIC 9(02).                   066070      
006545     03 WKS-DEL-PRODUCTO             PIC 9(04).                   066075      
006546     03 WKS-DEL-PROCESO              PIC 9(02).                   066080      
006547*INI - INFOWARE                                                   066100      
006548 01 WKS-ERR-CTA                        PIC X(16).                 066120      
006549 01 WKS-ERR-CTE                        PIC X(12).                 066130      
006550 01 WKS-ERR-PRD                        PIC X(04).                 066140      
006551 01 WKS-ERR-INS                        PIC X(04).                 066150      
006552 01 WKS-ERR-CALL                       PIC 9(04).                 066160      
006553                                                                  066180      
006554 01 WKS-ENV-CTD                        PIC 9(04).                 066185      
006555*FIN - INFOWARE                                                   066195      
006556******************************************************************066200      
006557*                     VARIABLES HOSTNAME                          066205      
006558******************************************************************066210      
006559                                                                  066215      
006560                                                                  066240      
00656101  WKS-HOSTNAME                     PIC X(10) VALUE SPACES.      066245      
006562      88 W88-HOSTNAME         VALUE "ACYPBETA. ",                 066250      
006563                                    "VDMBETA.  ",                 066255      
006564                                    "ACYPGAMA. ",                 066260      
006565                                    "MONALFA.  ",                 066265      
006566                                    "ACYPOMEGA.",                 066270      
006567                                    "VDMKAPPA. ",                 066275      
006568                                    "VDMALFA.  ",                 066280      
006569                                    "MONBETA.  ".                 066285      
006570                                                                  066290      
006571******************************************************************066295      
006572*              P R O C E D U R E     D I V I S I O N             *066300      
006573******************************************************************066400      
006574                                                                  066500      
006575 PROCEDURE DIVISION USING W77-SIST-PARAM.                         066600      
006576 CHECA-DIA-HABIL SECTION.                                         066700      
006577 000-000-CHECA-DIA.                                               066800      
006578*    MOVE 500 TO W77-SIST-PARAM.                                  066900      
006579     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   067000      
006580        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          067100      
006581     CHANGE ATTRIBUTE LIBACCESS OF "SOPORTECOMS" TO BYFUNCTION.   067200      
006582     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            067300      
006583                                      "SOPORTECOMS".              067400      
006584     CHANGE ATTRIBUTE LIBACCESS OF "CTLVER" TO BYFUNCTION.        067500      
006585     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO                 067600      
006586                                      "CTLVERS".                  067700      
006587     MOVE 0                        TO W77-CTLVER-RSLT.            067800      
006588     MOVE "S151L001CTL"            TO WKS-CTLVER-LIBID.           067900      
006589     CALL "DAME_TIT IN CTLVER" USING  WKS-CTLVER-LIBID            068000      
006590                                      WKS-CTLVER-NOMLIB           068100      
006591                               GIVING W77-CTLVER-RSLT.            068200      
006592     IF W77-CTLVER-RSLT = 0                                       068300      
006593        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                068400      
006594                                  WKS-CTLVER-NOMLIB               068500      
006595     ELSE                                                         068600      
006596        MOVE 020101 TO CODIGO-LJ                                  068700      
006597        MOVE "ERROR EN CTLVERS, NO ENCONTRO ID DE LIB-CONTROL "   068800      
006598                    TO TEXTO-LJ                                   068900      
006599        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ        069000      
006600        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                069100      
006601            "(S151)S151/OBJECT/L001/CONTROL          ON CMEMP.".  069200      
006602                                                                  069205      
006603*VERSION DEL WFL/LOTE*                                            069210      
006604     MOVE 0                                TO W77-CTLVER-RSLT.    069215      
006605     MOVE "S151LOTE"                       TO WKS-CTLVER-LIBID    069220      
006606     CALL "DAME_TIT IN CTLVER"                                    069225      
006607          USING  WKS-CTLVER-LIBID                                 069230      
006608                 WKS-CTLVER-NOMLIB                                069235      
006609          GIVING W77-CTLVER-RSLT.                                 069240      
006610                                                                  069245      
006611     IF W77-CTLVER-RSLT < 0                                       069250      
006612        MOVE "ERROR AL OBTENER NOMBRE S151LOTE"                   069255      
006613                                           TO TEXTO-LJ            069260      
006614        MOVE "O"                           TO TIPO-LJ             069265      
006615        MOVE 020901                        TO CODIGO-LJ           069270      
006616        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       069275      
006617        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                   069280      
006618     ELSE                                                         069285      
006619        MOVE WKS-CTLVER-NOMLIB TO WKS-N-WFL.                      069290      
006620*                                                                 069295      
006621                                                                  069300      
006622     MOVE "S151" TO SISTEMA-LJ                                    069400      
006623     MOVE "P169" TO PASO-LJ                                       069500      
006624     MOVE "003"  TO MTP-LJ                                        069600      
006625     MOVE "L"    TO TIPO-LJ                                       069700      
006626     MOVE 020101 TO CODIGO-LJ                                     069800      
006627     MOVE WKS-TEXTO TO TEXTO-LJ                                   069900      
006628                                                                  070000      
006629     PERFORM 000-005-CHECA-LIBCONTROL.                            070100      
006630     MOVE "I"    TO TIPO-LJ                                       070200      
006631     MOVE 020101 TO CODIGO-LJ                                     070300      
006632     MOVE W77-FECHA-PROC TO FEC-TEX.                              070400      
006633     MOVE WKS-TEXTO TO TEXTO-LJ, WLI-TEXTO-LJ.                    070500      
006634     MOVE TIPO-LJ         TO      WLI-TIPO-LJ                     070600      
006635     PERFORM 000-030-IMPRIME-MENSAJE                              070700      
006636**   CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ.         070800      
006637                                                                  070900      
006638          PERFORM 000-010-INICIO.                                 071000      
006639*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
006640*       COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY ON CMEMP"      071100      
006641*           FROM 3051 TO 4800.                                    071200      
006642 000-050-CHECA-SALTO-HOJA2.                                       003051      
006643*==========================                                       003071      
006644    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
006645     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
006646        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
006647     ELSE                                                         003079      
006648        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
006649     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
006650     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
006651     MOVE "/"                     TO WKS-SLASH1.                  003086      
006652     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
006653     MOVE "/"                     TO WKS-SLASH2.                  003088      
006654     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
006655     IF  WKS-NUM-LINEAS2 > 56                                     003091      
006656         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
006657         ADD 1                   TO    W77-CONT-HOJA2             003200      
006658         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
006659         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
006660         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
006661         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
006662         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
006663         MOVE SPACES             TO V00-R00-REPORTE2              003800      
006664         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
006665         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
006666                                                                  004100      
006667 000-030-IMPRIME-MENSAJE.                                         004200      
006668*========================                                         004300      
006669*LP                                                               004400      
006670     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
006671     ADD             2       TO WKS-NUM-LINEAS2                   004600      
006672     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
006673                                                                  004800      
006674*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
006675                                                                  071300      
006676  000-005-CHECA-LIBCONTROL.                                       071400      
006677*==========================                                       071500      
006678                                                                  071600      
006679     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-VALUE.             071800      
006680     CALL "CSIID IN SOPORTECOMS" USING WKS-DATOS-HOST.            071900      
006681*INI - ISILOA                                                     071920      
006682     IF WKS-NUMCSI = 32                                           071940      
006683        MOVE 4           TO      WKS-NUMCSI.                      071960      
006684*FIN - ISILOA                                                     071980      
006685     MOVE W77-SIST-PARAM    TO WKS-CTL-SISTEMA.                   072000      
006686     MOVE WKS-NUMCSI        TO WKS-CTL-NUMCSI                     072100      
006687                               WKS-CSI-MONITOR                    072200      
006688                               WKS-CSI-MONITOR-BNE.               072220      
006689     MOVE WKS-NOMEQUIPO     TO WKS-HOSTNAME.                      072250      
006690     MOVE 1                 TO WKS-CTL-FUNCION.                   072300      
006691     CALL "CONSISDIA IN LIB-CONTROL" USING WKS-DATOS-CTL          072400      
006692                                    GIVING W77-STATUS.            072500      
006693                                                                  072600      
006694     MOVE W77-SIST-PARAM          TO  WKS-SIS-BACK2               072700      
006695                                      WLI-RB-E3-SISTEMA2.         072800      
006696     MOVE "P169"                  TO  WKS-PASO-BACK2              072900      
006697                                      WLI-RB-E1-PASO.             073000      
006698     MOVE "DIARIO"                TO  WLI-RB-E2-TIPO-PROC2.       073100      
006699     MOVE WKS-NUMCSI              TO  WKS-TR-CSI2.                073200      
006700     MOVE WKS-CTL-FECPROC         TO  WLI-RB-E1-FECHA-INF2.       073300      
006701                                                                  073400      
006702*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
006703*     COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY ON CMEMP"        073500      
006704*          FROM 100 TO 3000.                                      073600      
006705                                                                  000100      
006706*===============================================================* 000200      
006707*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
006708*         PARA LLAMADO DE DISPLAY                               * 000400      
006709*===============================================================* 000500      
006710                                                                  000600      
006711     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
006712            TO BYFUNCTION.                                        000671      
006713                                                                  000691      
006714     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
006715          USING WKS-DATE-ARRAY2.                                  000800      
006716     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
006717     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
006718     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
006719     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
006720     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
006721     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
006722                                                                  001300      
006723     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
006724     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
006725     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
006726                               WKS-TIT-REPORTE2.                  001700      
006727*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
006728*                                  GIVING WKS-COMPILA2.           001900      
006729*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
006730*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
006731*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
006732*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
006733                                                                  002066      
006734*    IF WKS-AAA-VERSION2  < 50                                    002071      
006735*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
006736*    ELSE                                                         002081      
006737*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
006738                                                                  002091      
006739                                                                  002500      
006740*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
006741     OPEN OUTPUT V00-REPORTE2.                                    002700      
006742     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
006743     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
006744                                                                  003000      
006745*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
006746                                                                  073700      
006747     IF W77-STATUS > 0                                            073800      
006748        MOVE "E"            TO      TIPO-LJ                       073900      
006749        MOVE 010105         TO      CODIGO-LJ                     074000      
006750        MOVE SPACES         TO      TEXTO-LJ                      074100      
006751        STRING "ERROR AL CONSULTAR LIB-CONTROL : ",               074200      
006752                         W77-STATUS                               074300      
006753               DELIMITED BY SIZE INTO TEXTO-LJ                    074400      
006754        MOVE TIPO-LJ         TO      WLI-TIPO-LJ                  074500      
006755        MOVE TEXTO-LJ        TO      WLI-TEXTO-LJ                 074600      
006756        PERFORM 000-030-IMPRIME-MENSAJE                           074700      
006757        CLOSE V00-REPORTE2 WITH SAVE                              074800      
006758**      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ        074900      
006759        SET MYSELF(STATUS)  TO  -1.                               075000      
006760     IF W77-VALUE = 0                                             075100      
006761        MOVE WKS-CTL-FECPROC   TO W77-FECHA-PROC                  075200      
006762     ELSE                                                         075300      
006763        MOVE W77-VALUE         TO W77-FECHA-PROC.                 075400      
006764                                                                  075500      
006765     MOVE W77-FECHA-PROC  TO      WKS-HD-FEC-MON,                 075600      
006766                                  WKS-FEC-MONITOR,                075700      
006767                                  WKS-FEC-MONITOR-BNE.            075750      
006768                                                                  075800      
006769 000-010-INICIO.                                                  075900      
006770*===============                                                  076000      
006771                                                                  076100      
006772     PERFORM 100-010-INICIALIZA-FECHAS.                           076200      
006773     PERFORM 100-020-INICIALIZA-HEADER.                           076300      
006774     IF W88-HOSTNAME                                              076400      
006775      PERFORM 100-020-INICIALIZA-HEADER-BNE.                      076420      
006776                                                                  076440      
006777     MOVE 0                        TO W77-CTLVER-RSLT.            076500      
006778     MOVE "S016L422"               TO WKS-CTLVER-LIBID.           076600      
006779     CALL "DAME_TIT IN CTLVER" USING  WKS-CTLVER-LIBID            076700      
006780                                      WKS-CTLVER-NOMLIB           076800      
006781                               GIVING W77-CTLVER-RSLT.            076900      
006782     IF W77-CTLVER-RSLT = 0                                       077000      
006783        CHANGE ATTRIBUTE TITLE OF "S016L422" TO                   077100      
006784                                  WKS-CTLVER-NOMLIB               077200      
006785     ELSE                                                         077300      
006786        MOVE 020101 TO CODIGO-LJ                                  077400      
006787        MOVE "ERROR EN CTLVERS, NO ENCONTRO ID DE S016L422 "      077500      
006788                    TO TEXTO-LJ                                   077600      
006789        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ        077700      
006790        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                077800      
006791            "(S016)S016/OBJECT/L422         ON CLIENTES.".        077900      
006792                                                                  078000      
006793     MOVE 0                        TO W77-CTLVER-RSLT.            078100      
006794     MOVE "S408L022SDOS"           TO WKS-CTLVER-LIBID.           078200      
006795     CALL "DAME_TIT IN CTLVER" USING  WKS-CTLVER-LIBID            078300      
006796                                      WKS-CTLVER-NOMLIB           078400      
006797                               GIVING W77-CTLVER-RSLT.            078500      
006798     IF W77-CTLVER-RSLT = 0                                       078600      
006799        CHANGE ATTRIBUTE TITLE OF "CONL022S408" TO                078700      
006800                                  WKS-CTLVER-NOMLIB               078800      
006801     ELSE                                                         078900      
006802        MOVE 020101 TO CODIGO-LJ                                  079000      
006803        MOVE "ERROR EN CTLVERS, NO ENCONTRO ID DE S408L022SDOS "  079100      
006804                    TO TEXTO-LJ                                   079200      
006805        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ        079300      
006806        CHANGE ATTRIBUTE TITLE OF "CONL022S408" TO                079400      
006807            "(S408)S408/OBJECT/L022         ON CREDITO.".         079500      
006808                                                                  079600      
006809     PERFORM 100-005-EXTRAE-REGISTROS-SDOS.                       079700      
006810     MOVE 0 TO W77-S408-OK.                                       079800      
006811     PERFORM 300-COMPLETA-SDOS.                                   079900      
006812*INI - INFOWARE                                                   079920      
006813     PERFORM 000-080-IMPRIME-TRAILER.                             079940      
006814*FIN - INFOWARE                                                   079960      
006815     MOVE "I"    TO TIPO-LJ                                       080000      
006816     MOVE 020101 TO CODIGO-LJ                                     080100      
006817     MOVE  "FIN NORMAL DE PROCESO" TO TEXTO-LJ, WLI-TEXTO-LJ      080200      
006818     MOVE TIPO-LJ         TO      WLI-TIPO-LJ                     080300      
006819     PERFORM 000-030-IMPRIME-MENSAJE                              080400      
006820     CLOSE V00-REPORTE2 WITH SAVE                                 080500      
006821**   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         080600      
006822     STOP RUN.                                                    080700      
006823/                                                                 080800      
006824 100-010-INICIALIZA-FECHAS.                                       080900      
006825*==========================                                       081000      
006826                                                                  081100      
006827     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          081200      
006828             A2K-ACCEPT-TODAYS-DATE-EXIT.                         081300      
006829     MOVE A2K-FEC-MDCA-001 TO WKS-FECHA-ACTUAL-MDA                081400      
006830     MOVE WKS-DIA-ACTUAL-MDA      TO WKS-DIA-ACTUAL-DMA           081500      
006831                                     WKS-DIA-ACTUAL-AMD           081600      
006832     MOVE WKS-MES-ACTUAL-MDA      TO WKS-MES-ACTUAL-DMA           081700      
006833                                     WKS-MES-ACTUAL-AMD           081800      
006834     MOVE WKS-AMO-ACTUAL-MDA      TO WKS-AMO-ACTUAL-DMA           081900      
006835                                     WKS-AMO-ACTUAL-AMD           082000      
006836     MOVE W77-FECHA-PROC          TO WKS-FECHA-ACTUAL-AMD.        082200      
006837     MOVE WKS-DIA-ACTUAL-AMD      TO WKS-DIA-ACTUAL-DMA.          082300      
006838     MOVE WKS-MES-ACTUAL-AMD      TO WKS-MES-ACTUAL-DMA.          082400      
006839     MOVE WKS-AMO-ACTUAL-AMD      TO WKS-AMO-ACTUAL-DMA.          082500      
006840                                                                  082700      
006841     ACCEPT   WKS-HORA-HS         FROM TIME.                      082800      
006842                                                                  083100      
006843 100-020-INICIALIZA-HEADER.                                       083200      
006844*==========================                                       083300      
006845                                                                  083400      
006846     MOVE WKS-NUMCSI          TO WKS-CSI-ORIGCITD,                083600      
006847                                 WKS-CSI-ORIGCITD-T.              083700      
006848$SET OMIT = OLDCODE                                               084200      
006849     MOVE W77-FECHA-PROC      TO WKS-HS-FECHA                     084300      
006850          WKS-FEC-SDOSALCITD WKS-FEC-SDOENT                       084400      
006851          WKS-FEC-SDOSALCITD-T.                                   084500      
006852$POP OMIT                                                         084600      
006853$SET OMIT = NOT OLDCODE                                           084700      
006854     MOVE ZEROES TO A2K-FEC-CAMD-001                              084800      
006855     MOVE W77-FECHA-PROC  TO A2K-FEC-CAMD-001                     084900      
006856     PERFORM A2K-CONV-CAMD-TO-AMD THRU                            085000      
006857             A2K-CONV-CAMD-TO-AMD-EXIT                            085100      
006858     MOVE A2K-FEC-AMD-001     TO                                  085200      
006859               WKS-FEC-SDOSALCITD WKS-FEC-SDOENT                  085300      
006860               WKS-FEC-SDOSALCITD-T.                              085400      
006861$POP OMIT                                                         085500      
006862*TERMINA CODIGO DE RENOVACION CRONOS 2000                         085600      
006863     OPEN OUTPUT A04-SDOSCITD-T.                                  085900      
006864     OPEN OUTPUT A06-MONITOR.                                     087200      
006865     WRITE R06-MONITOR FROM WKS-HD-MONITOR.                       087300      
006866                                                                  087302      
006867100-020-INICIALIZA-HEADER-BNE.                                    087304      
006868*==============================                                   087306      
006869     MOVE WKS-NUMCSI          TO WKS-CSI-ORIGBNE,                 087308      
006870                                 WKS-CSI-ORIGBNE-T.               087310      
006871$SET OMIT = OLDCODE                                               087312      
006872     MOVE W77-FECHA-PROC      TO WKS-HS-FECHA                     087314      
006873          WKS-FEC-SDOSALBNE WKS-FEC-SDOENT                        087316      
006874          WKS-FEC-SDOSALBNE-T.                                    087318      
006875$POP OMIT                                                         087320      
006876$SET OMIT = NOT OLDCODE                                           087322      
006877     MOVE ZEROES TO A2K-FEC-CAMD-001                              087324      
006878     MOVE W77-FECHA-PROC  TO A2K-FEC-CAMD-001                     087326      
006879     PERFORM A2K-CONV-CAMD-TO-AMD THRU                            087328      
006880             A2K-CONV-CAMD-TO-AMD-EXIT                            087330      
006881     MOVE A2K-FEC-AMD-001     TO                                  087332      
006882               WKS-FEC-SDOSALBNE WKS-FEC-SDOENT                   087334      
006883               WKS-FEC-SDOSALBNE-T.                               087336      
006884$POP OMIT                                                         087338      
006885*TERMINA CODIGO DE RENOVACION CRONOS 2000                         087340      
006886     OPEN OUTPUT A04-SDOSBNE-T.                                   087342      
006887     OPEN OUTPUT A06-MONITOR-BNE.                                 087344      
006888     WRITE R06-MONITOR-BNE FROM WKS-HD-MONITOR.                   087346      
006889                                                                  087400      
006890 100-005-EXTRAE-REGISTROS-SDOS.                                   087500      
006891*==============================                                   087600      
006892                                                                  087700      
006893     MOVE WKS-CTL-NOMSDO      TO WKS-NOM-SDOENT.                  087800      
006894     MOVE WKS-CTL-PKSDO       TO WKS-PK-SDOENT                    087900      
006895     MOVE 0                   TO W77-FILEOK.                      088000      
006896     MOVE 0                   TO WKS-ENV-CTD.                     088050      
006897*INI INFOWARE. LIGA L002                                          088060      
006898* PARA HABILITAR ESTE PERFORM ES NECESARIO QUE LA LIBRERIA L002   088062      
006899* ATRAPE EL EVENTO E2 PARA QUE PUEDA CERRAR EL ARCHIVO SIN RIESGOS088064      
006900*                                                                 088066      
006901*    PERFORM 100-010-CIERRA-SALDOS.                               088070      
006902*FIN INFOWARE. LIGA L002                                          088080      
006903     PERFORM 150-007-VALIDA-HEADER UNTIL W88-FILEOK OR W88-FINLOG.088100      
006904     PERFORM 150-010-LEE-PRIMER-REGISTRO UNTIL W88-FINLOG.        088200      
006905                                                                  089000      
006906     IF W88-HOSTNAME                                              089800      
006907        CLOSE A04-SDOSBNE-T WITH SAVE.                            089900      
006908                                                                  090000      
006909     CLOSE A04-SDOSCITD-T WITH SAVE.                              090100      
006910     CLOSE A01-SDOENT  WITH SAVE.                                 090200      
006911*                                                                 090300      
006912 150-007-VALIDA-HEADER.                                           090400      
006913*======================                                           090500      
006914                                                                  090600      
006915     OPEN INPUT A01-SDOENT.                                       090700      
006916     MOVE  0  TO  W77-FINLOG W77-FILEOK.                          090800      
006917                                                                  090900      
006918     READ A01-SDOENT INTO WKS-HEADER-SDOENT                       091000      
006919                          AT END MOVE 1 TO W77-FINLOG.            091100      
006920                                                                  091200      
006921     IF W88-FINLOG                                                091300      
006922                                                                  091400      
006923        MOVE "ERROR: ARCHIVO VACIO"       TO      WLI-TEXTO-LJ    091500      
006924        PERFORM 000-030-IMPRIME-MENSAJE                           091600      
006925        MOVE 1  TO  W77-FINLOG                                    091700      
006926     ELSE                                                         091800      
006927        IF WKS-HSE-TIPOREG = "HD" AND                             091900      
006928           WKS-HSE-FECHA   = W77-FECHA-PROC                       092000      
006929           MOVE 1 TO W77-FILEOK                                   092100      
006930        ELSE                                                      092200      
006931           STOP    "FECHA EN HEADER ERRONEA = " WKS-HSE-FECHA     092300      
006932                   " FECHA CORRECTA = " W77-FECHA-PROC            092400      
006933                   " FAVOR DE COPIAR ARCHIVO CORRECTO O DAR DS"   092500      
006934                   CLOSE A01-SDOENT.                              092600      
006935*                                                                 092700      
006936                                                                  092800      
006937 150-010-LEE-PRIMER-REGISTRO.                                     092900      
006938*============================                                     093000      
006939                                                                  093100      
006940     MOVE  0  TO  W77-FINLOG.                                     093200      
006941                                                                  093300      
006942     READ A01-SDOENT INTO A22-R00-SALDOS                          093400      
006943                          AT END MOVE 1 TO W77-FINLOG.            093500      
006944                                                                  093600      
006945     IF W88-FINLOG                                                093700      
006946        MOVE "ERROR: ARCHIVO VACIO"       TO      WLI-TEXTO-LJ    093800      
006947        PERFORM 000-030-IMPRIME-MENSAJE                           093900      
006948        MOVE 1  TO  W77-FINLOG.                                   094000      
006949                                                                  094100      
006950     IF NOT W88-FINLOG                                            094200      
006951        IF A22-R00-TIPO-REG = 81                                  094300      
006952           PERFORM 200-MUEVE-INFORMACION-SDOS                     094400      
006953           PERFORM 150-030-GRABA-SDOCITD.                         094800      
006954     IF NOT W88-FINLOG                                            094900      
006955        PERFORM 150-020-GRABA-DEMAS-REG UNTIL W88-FINLOG.         095000      
006956                                                                  095300      
006957 150-020-GRABA-DEMAS-REG.                                         095400      
006958*========================                                         095500      
006959                                                                  095600      
006960     MOVE  0  TO  W77-FINLOG.                                     095700      
006961                                                                  095800      
006962     READ A01-SDOENT INTO A22-R00-SALDOS                          095900      
006963                          AT END MOVE 1 TO W77-FINLOG.            096000      
006964                                                                  096100      
006965     IF NOT W88-FINLOG                                            096200      
006966        IF A22-R00-TIPO-REG = 81                                  096300      
006967           PERFORM 200-MUEVE-INFORMACION-SDOS                     096400      
006968              PERFORM 150-030-GRABA-SDOCITD.                      096800      
006969                                                                  097000      
006970 150-030-GRABA-SDOCITD.                                           097100      
006971*======================                                           097200      
006972     IF A22-R01-INDENVCD = 2 OR 3                                 098200      
006973        ADD 1 TO WKS-ENV-CTD                                      098250      
006974        PERFORM 150-050-LLAMA-CTES                                098300      
006975        WRITE R04-SDOSCITD-T.                                     098400      
006976     IF A22-R01-INDENVBNE = 1 AND W88-HOSTNAME                    098420      
006977       PERFORM 150-050-LLAMA-CTES                                 098460      
006978       MOVE R04-SDOSCITD-T TO R04-SDOSBNE-T                       098480      
006979       WRITE R04-SDOSBNE-T.                                       098500      
006980                                                                  098600      
006981 150-050-LLAMA-CTES.                                              102000      
006982*===================                                              102100      
006983     MOVE 0                      TO R422-84-CTR-ERROR.            102200      
006984     MOVE LOW-VALUES             TO S422-84-CTR-SALIDA.           102300      
006985     MOVE ZEROS                  TO E422-84-CTE-NUM.              102400      
006986     MOVE 0000                   TO E422-84-CTA-NUMPREF.          102500      
006987     MOVE A22-R01-CNT            TO E422-84-CTA-NUM,              102600      
006988                                    ACCI-CONTRATO-T               102700      
006989     MOVE A22-R01-PRD            TO E422-84-CTA-NUMPROD.          102800      
006990     MOVE A22-R01-INS            TO E422-84-CTA-CVEINST.          102900      
006991     MOVE 02                     TO E422-84-OPCION                103000      
006992*INI - INFOWARE                                                   103010      
006993     MOVE A22-R01-CNT            TO WKS-ERR-CTA.                  103020      
006994     MOVE A22-R01-PRD            TO WKS-ERR-PRD.                  103030      
006995     MOVE A22-R01-INS            TO WKS-ERR-INS.                  103040      
006996*FIN - INFOWARE                                                   103050      
006997     CALL "S016_L422_B01SXCTE IN S016L422"                        103100      
006998          USING    E422-84-CTR-ENTRADA                            103200      
006999                   S422-84-CTR-SALIDA                             103300      
007000          GIVING   R422-84-CTR-ERROR.                             103400      
007001                                                                  103500      
007002*    IF R422-103-CTR-ERROR = 0                                    103600      
007003     IF R422-84-CTR-ERROR = 0                                     103650      
007004        MOVE ZEROS                TO      ACCI-GEN-CUST-T,        103700      
007005                                          ACCI-LIA-NBR-T          103800      
007006        MOVE 01                   TO      ACCI-LANGUAGE-CODE-T    103900      
007007        MOVE S422-84-CTE-NOM      TO      ACCI-SHORT-NAME-TEXT-T, 104000      
007008                                          ACCI-CUSTOMER-NAME-T    104100      
007009        MOVE S422-84-CTE-CALLENUM TO      ACCI-CBR-ADDRESS-1-T    104200      
007010        MOVE S422-84-CTE-NOMCOL   TO      ACCI-CBR-ADDRESS-2-T    104300      
007011        MOVE S422-84-CTE-NOMPOB   TO      ACCI-CBR-ADDRESS-3-T    104400      
007012        MOVE SPACES               TO      ACCI-CBR-ADDRESS-4-T    104500      
007013        MOVE S422-84-CTE-NUM      TO      W77-NUM-CTE             104600      
007014                                          ACCI-GEN-CUST-T         104650      
007015        PERFORM 150-060-MAS-DATCTES                               104700      
007016        MOVE 2                    TO      W77-TIPO-OPCION         104750      
007017        MOVE 1                    TO      R422-61-CTR-ERROR       104770      
007018        PERFORM 150-070-MAS-DATCTES2                              104800      
007019     ELSE                                                         104900      
007020        MOVE ZEROS                TO      ACCI-GEN-CUST-T,        105000      
007021                                          ACCI-ACCT-NBR-T,        105100      
007022                                          ACCI-LIA-NBR-T,         105200      
007023        MOVE 01                   TO      ACCI-LANGUAGE-CODE-T    105300      
007024        MOVE SPACES               TO      ACCI-SHORT-NAME-TEXT-T, 105400      
007025                                          ACCI-CUSTOMER-NAME-T,   105500      
007026                                          ACCI-CBR-ADDRESS-1-T,   105600      
007027                                          ACCI-CBR-ADDRESS-2-T,   105700      
007028                                          ACCI-CBR-ADDRESS-3-T,   105800      
007029                                          ACCI-CBR-ADDRESS-4-T.   105900      
007030*INI - INFOWARE                                                   105910      
007031     IF R422-84-CTR-ERROR > 0                                     105920      
007032        MOVE SPACES             TO WLI-ENCAB-62                   105922      
007033        MOVE R422-84-CTR-ERROR  TO WKS-ERR-CALL                   105925      
007034        MOVE WKS-ERR-CALL       TO WLI-RESULT                     105930      
007035        STRING "ERROR CALL S016_L422_B01SXCTE: ",                 105940      
007036               " RES: "      DELIMITED BY SIZE,                   105942      
007037                WLI-RESULT   DELIMITED BY SIZE,                   105944      
007038               " CTA: "      DELIMITED BY SIZE,                   105946      
007039               WKS-ERR-CTA   DELIMITED BY SIZE,                   105948      
007040               " PRD: "      DELIMITED BY SIZE,                   105950      
007041               WKS-ERR-PRD   DELIMITED BY SIZE,                   105955      
007042               " INS: "      DELIMITED BY SIZE,                   105960      
007043               WKS-ERR-INS   DELIMITED BY SIZE                    105962      
007044        INTO WLI-TEXTO                                            105965      
007045        MOVE WLI-TEXTO TO TEXTO-LJ                                105970      
007046        MOVE "L"       TO TIPO-LJ                                 105972      
007047        MOVE ZERO      TO CONTADOR-LJ                             105974      
007048        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ        105975      
007049        PERFORM 000-060-IMPRIME-RESULT-S016.                      105980      
007050*FIN - INFOWARE                                                   105985      
007051                                                                  106000      
007052 150-060-MAS-DATCTES.                                             106100      
007053*=====================                                            106200      
007054     MOVE 0                      TO R422-106-CTR-ERROR.           106300      
007055     MOVE LOW-VALUES             TO S422-106-CTR-SALIDA.          106400      
007056     MOVE 0000                   TO E422-106-CTR-NUMCSI.          106500      
007057     MOVE W77-NUM-CTE            TO E422-106-CTE-NUM              106600      
007058                                    WKS-ERR-CTE.                  106650      
007059     CALL "S016_L422_B38COSMOS IN S016L422"                       106700      
007060          USING    E422-106-CTR-ENTRADA                           106800      
007061                   S422-106-CTR-SALIDA                            106900      
007062          GIVING   R422-106-CTR-ERROR.                            107000      
007063                                                                  107100      
007064     IF R422-106-CTR-ERROR = 0                                    107200      
007065        MOVE S422-106-CTE-LANGUAGE TO     ACCI-LANGUAGE-CODE-T    107300      
007066        MOVE S422-106-CTE-LIABILIT TO     WKS-LIABILIT            107400      
007067        MOVE WKS-LIABILITI-NUMBER  TO     ACCI-LIA-NBR-T          107500      
007068     ELSE                                                         107600      
007069        MOVE 01                   TO      ACCI-LANGUAGE-CODE-T    107700      
007070        MOVE ZEROS                TO      ACCI-LIA-NBR-T.         107800      
007071*INI - INFOWARE                                                   107810      
007072     IF R422-106-CTR-ERROR > 0                                    107820      
007073        MOVE SPACES              TO WLI-ENCAB-62                  107822      
007074        MOVE R422-106-CTR-ERROR  TO WKS-ERR-CALL                  107825      
007075        MOVE WKS-ERR-CALL        TO WLI-RESULT                    107830      
007076        STRING "ERROR CALL S016_L422_B38COSMOS: ",                107840      
007077                     " RES: "      DELIMITED BY SIZE,             107842      
007078                       WLI-RESULT  DELIMITED BY SIZE,             107844      
007079               "NUMERO CLIENTE: "  DELIMITED BY SIZE,             107845      
007080                WKS-ERR-CTE                                       107850      
007081        DELIMITED BY SIZE INTO WLI-TEXTO                          107860      
007082        MOVE WLI-TEXTO TO TEXTO-LJ                                107862      
007083        MOVE "L"       TO TIPO-LJ                                 107864      
007084        MOVE ZERO      TO CONTADOR-LJ                             107866      
007085        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ        107868      
007086        PERFORM 000-060-IMPRIME-RESULT-S016.                      107870      
007087*FIN - INFOWARE                                                   107880      
007088                                                                  107900      
007089 150-070-MAS-DATCTES2.                                            108000      
007090*=====================                                            108100      
007091     COMPUTE W77-TIPO-OPCION     =  W77-TIPO-OPCION - 1.          108150      
007092     MOVE 0                      TO R422-61-CTR-ERROR.            108200      
007093     MOVE LOW-VALUES             TO S422-61-CTR-SALIDA.           108300      
007094     MOVE 0000                   TO E422-61-CTA-NUMPREF.          108400      
007095     MOVE A22-R01-CNT            TO E422-61-CTA-NUM.              108500      
007096     MOVE A22-R01-PRD            TO E422-61-CTA-NUMPROD.          108600      
007097     MOVE A22-R01-INS            TO E422-61-CTA-CVEINST.          108700      
007098     MOVE 1                      TO E422-61-MDA-CVETIPO.          108800      
007099     MOVE 00                     TO E422-61-OPCION                108900      
007100*    MOVE W77-TIPO-OPCION        TO E422-61-OPCION                108905      
007101*INI - INFOWARE                                                   108910      
007102     MOVE A22-R01-CNT            TO WKS-ERR-CTA.                  108920      
007103     MOVE A22-R01-PRD            TO WKS-ERR-PRD.                  108930      
007104     MOVE A22-R01-INS            TO WKS-ERR-INS.                  108940      
007105*FIN - INFOWARE                                                   108950      
007106     CALL "S016_L422_CTAMEDIO IN S016L422"                        109000      
007107          USING    E422-61-CTR-ENTRADA                            109100      
007108                   S422-61-CTR-SALIDA                             109200      
007109          GIVING   R422-61-CTR-ERROR.                             109300      
007110                                                                  109400      
007111     IF R422-61-CTR-ERROR = 0                                     109500      
007112        MOVE S422-61-MDA-NUMPREF  TO      WKS-NUMPREF             109600      
007113        MOVE S422-61-MDA-NUM      TO      WKS-CUENTA              109700      
007114        MOVE WKS-NUM-CTA-CITI     TO      WKS-NUM-CUENTA-T2       109800      
007115                                          WKS-NUM-CUENTA-T        109900      
007116        MOVE WKS-2D-NUMPREF       TO      WKS-BN-2DNUMPREF        110000      
007117        MOVE WKS-4D-CTA           TO      WKS-BN-4DCTA            110100      
007118        MOVE W77-NUM-CTE          TO      ACCI-GEN-CUST-T         110200      
007119        MOVE ZEROS                TO      ACCI-ACCT-NBR-T1        110600      
007120        MOVE WKS-NUM-CUENTA-T2    TO      ACCI-ACCT-NBR-T2        110700      
007121        IF ACCI-LIA-NBR-T = 0                                     110800      
007122           MOVE WKS-BASE-NUMBER   TO      ACCI-LIA-NBR-T          110900      
007123        ELSE                                                      111000      
007124           NEXT SENTENCE                                          111100      
007125     ELSE                                                         111200      
007126        MOVE ZERO                 TO      ACCI-ACCT-NBR-T,        111300      
007127                                          ACCI-GEN-CUST-T.        111400      
007128*INI - INFOWARE                                                   111410      
007129     IF R422-61-CTR-ERROR > 0                                     111420      
007130        MOVE SPACES             TO WLI-ENCAB-62                   111422      
007131        MOVE R422-61-CTR-ERROR  TO WKS-ERR-CALL                   111425      
007132        MOVE WKS-ERR-CALL       TO WLI-RESULT                     111430      
007133        STRING "ERROR CALL S016_L422_CTAMEDIO: ",                 111440      
007134               " RES: "      DELIMITED BY SIZE,                   111442      
007135                WLI-RESULT   DELIMITED BY SIZE,                   111444      
007136               " CTA: "      DELIMITED BY SIZE,                   111445      
007137               WKS-ERR-CTA   DELIMITED BY SIZE,                   111450      
007138               " PRD: "      DELIMITED BY SIZE,                   111460      
007139               WKS-ERR-PRD   DELIMITED BY SIZE,                   111465      
007140               " INS: "      DELIMITED BY SIZE,                   111466      
007141               WKS-ERR-INS   DELIMITED BY SIZE                    111467      
007142        INTO WLI-TEXTO                                            111468      
007143        MOVE WLI-TEXTO TO TEXTO-LJ                                111470      
007144        MOVE "L"       TO TIPO-LJ                                 111475      
007145        MOVE ZERO      TO CONTADOR-LJ                             111476      
007146        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ        111480      
007147        PERFORM 000-060-IMPRIME-RESULT-S016.                      111485      
007148*FIN - INFOWARE                                                   111490      
007149                                                                  111500      
007150 200-MUEVE-INFORMACION-SDOS.                                      111600      
007151*===========================                                      111700      
007152                                                                  111800      
007153   MOVE "ACI"                 TO  ACCI-RECORD-TYPE-T              111900      
007154   MOVE 485                   TO  ACCI-BRCH-NBR-T                 112000      
007155   IF A22-R01-MONEDA = 5                                          112100      
007156      MOVE 126                TO  ACCI-CCY-CODE-T                 112200      
007157      MOVE "USD"              TO  ACCI-SWIFT-CCY-CODE-T           112300      
007158   ELSE                                                           112400      
007159      MOVE 000                TO  ACCI-CCY-CODE-T                 112500      
007160      MOVE "MXN"              TO  ACCI-SWIFT-CCY-CODE-T.          112600      
007161   IF A22-R01-STATUS = 0                                          112700      
007162      MOVE SPACE              TO  ACCI-ACCT-STAT-IND-T            112800      
007163   ELSE                                                           112900      
007164      IF A22-R01-STATUS = 1                                       113000      
007165         MOVE "B"             TO  ACCI-ACCT-STAT-IND-T            113100      
007166      ELSE                                                        113200      
007167         MOVE "C"             TO  ACCI-ACCT-STAT-IND-T.           113300      
007168   MOVE 1                     TO  ACCI-CAT-CODE-T.                113400      
007169   MOVE "001"                 TO  ACCI-BANK-NON-BANK-T.           113500      
007170   MOVE "1111"                TO  ACCI-MAIL-T.                    113600      
007171   MOVE "0"                   TO  ACCI-MAIL-TO-COLLECT-T.         113700      
007172   MOVE "00"                  TO  ACCI-MAIL-RULEOFF-T.            113800      
007173   MOVE SPACES                TO  ACCI-FILLER-T.                  113900      
007174   MOVE "X"                   TO  ACCI-PRIME-DELIMETER-T.         114000      
007175   MOVE A22-R01-FECPRO        TO  A2K-FEC-CAMD-001.               114700      
007176   PERFORM A2K-CONV-CAMD-TO-AMD THRU A2K-CONV-CAMD-TO-AMD-EXIT.   114800      
007177   MOVE A22-R01-FECINI        TO  A2K-FEC-CAMD-001.               115000      
007178   PERFORM A2K-CONV-CAMD-TO-AMD THRU A2K-CONV-CAMD-TO-AMD-EXIT.   115100      
007179   MOVE A22-R01-FECFIN        TO  A2K-FEC-CAMD-001.               115300      
007180   PERFORM A2K-CONV-CAMD-TO-AMD THRU A2K-CONV-CAMD-TO-AMD-EXIT.   115400      
007181   MOVE A22-R01-FECULTMOV     TO  A2K-FEC-CAMD-001,               115600      
007182                                  ACCI-LAST-TXN-DATE-T.           115700      
007183   PERFORM A2K-CONV-CAMD-TO-AMD THRU A2K-CONV-CAMD-TO-AMD-EXIT.   115800      
007184   MOVE ZEROS                 TO  ACCI-ACCT-BAL-AMT-T,            116100      
007185                                  ACCI-LCY-ACCT-BAL-AMT-T,        116200      
007186                                  ACCI-DISP-VAL-BAL-AMT-T.        116300      
007187   MOVE "+"                   TO  ACCI-DISP-BAL-AMT-SIGN-T,       116400      
007188                                  ACCI-ACCT-BAL-AMT-SIGN-T        116500      
007189                                  ACCI-LCY-BAL-AMT-SIGN-T.        116600      
007190   PERFORM 250-MUEVE-CVESDO-IMP VARYING W77-IND FROM 1 BY 1       116700      
007191*                                UNTIL   W77-IND > 13.            116800      
007192                                UNTIL   W77-IND > 30.             116820      
007193                                                                  117000      
007194 250-MUEVE-CVESDO-IMP.                                            117100      
007195*=====================                                            117200      
007196                                                                  117300      
007197   IF A22-R01-CVESDO(W77-IND) = 2                                 117700      
007198      MOVE A22-R01-IMPT(W77-IND)  TO ACCI-ACCT-BAL-AMT-T,         117800      
007199                                     ACCI-LCY-ACCT-BAL-AMT-T      117900      
007200      MOVE 1 TO W77-SDOACT                                        118000      
007201      IF A22-R01-IMPT(W77-IND) < 0                                118100      
007202         MOVE  "-"                TO ACCI-ACCT-BAL-AMT-SIGN-T,    118200      
007203                                     ACCI-LCY-BAL-AMT-SIGN-T      118300      
007204      ELSE                                                        118400      
007205         MOVE  "+"                TO ACCI-ACCT-BAL-AMT-SIGN-T,    118500      
007206                                     ACCI-LCY-BAL-AMT-SIGN-T      118600      
007207   ELSE                                                           118700      
007208   IF A22-R01-CVESDO(W77-IND) = 354                               118800      
007209      MOVE A22-R01-IMPT(W77-IND)  TO ACCI-DISP-VAL-BAL-AMT-T      118900      
007210      IF A22-R01-IMPT(W77-IND) < 0                                119000      
007211         MOVE  "-"                TO ACCI-DISP-BAL-AMT-SIGN-T     119100      
007212      ELSE                                                        119200      
007213         MOVE  "+"                TO ACCI-DISP-BAL-AMT-SIGN-T.    119300      
007214                                                                  119400      
007215 300-COMPLETA-SDOS.                                               119500      
007216*==================                                               119600      
007217     OPEN INPUT A04-SDOSCITD-T.                                   119700      
007218     OPEN OUTPUT A05-SDOSCITD.                                    119800      
007219     MOVE  0  TO  W77-FINLOG.                                     119900      
007220     READ A04-SDOSCITD-T AT END MOVE 1 TO W77-FINLOG.             120000      
007221                                                                  120100      
007222     IF NOT W88-FINLOG                                            120200      
007223        PERFORM 300-LLAMA-S408 UNTIL W88-S408-OK                  120300      
007224        PERFORM 320-LEE-CITD-T UNTIL W88-FINLOG.                  120400      
007225                                                                  120500      
007226     CLOSE A05-SDOSCITD    WITH SAVE.                             120900      
007227     CLOSE A04-SDOSCITD-T  WITH PURGE.                            121000      
007228     CLOSE A06-MONITOR     WITH SAVE.                             121100      
007229     IF W88-HOSTNAME                                              121105      
007230        OPEN INPUT A04-SDOSBNE-T                                  121110      
007231        OPEN OUTPUT A05-SDOSBNE                                   121115      
007232        MOVE 0 TO W77-FINLOG                                      121120      
007233        PERFORM 330-LEE-SDOSBNE-T                                 121130      
007234        CLOSE A05-SDOSBNE     WITH SAVE                           121135      
007235        CLOSE A04-SDOSBNE-T   WITH SAVE                           121140      
007236        CLOSE A06-MONITOR-BNE WITH SAVE.                          121145      
007237                                                                  121155      
007238     PERFORM 41230-ENVIA-ACCCD.                                   121160      
007239                                                                  121200      
007240 300-LLAMA-S408.                                                  121300      
007241*===============                                                  121400      
007242     MOVE ACCI-GEN-CUST-T          TO WKS-CLIENTE-MON.            121500      
007243     MOVE ACCI-ACCT-BAL-AMT-SIGN-T TO WKS-SIG-SDOACT,             121600      
007244                                      WKS-SIG-SDOACTCAL.          121700      
007245     MOVE ACCI-ACCT-BAL-AMT-T      TO WKS-SDO-ACT-MON             121800      
007246     MOVE ACCI-DISP-BAL-AMT-SIGN-T TO WKS-SIG-SDODIS              121900      
007247     MOVE ACCI-DISP-VAL-BAL-AMT-T  TO WKS-SDO-DIS-MON             122000      
007248     MOVE "+"             TO      WKS-SIG-LIN                     122100      
007249     MOVE WKS-SDO-ACT-MON TO      WKS-SDO-ACTCALC-MON             122200      
007250     MOVE 0               TO      W77-SDOACT-TEMP,WKS-SDO-LIN-MON 122300      
007251     MOVE LOW-VALUES      TO      WKS-FTO-LLAMADO-S408.           122400      
007252     MOVE 02              TO      WKS-FUN-S408                    122500      
007253     MOVE W77-FECHA-PROC  TO      WKS-FEC-S408,WKS-SDO-FECHA-MON  122600      
007254     MOVE ACCI-CONTRATO-T TO      WKS-CONTRATO-S408               122700      
007255     MOVE WKS-CONT-S408   TO      WKS-CTO-S408,WKS-CTO-MON        122800      
007256     CALL "SALDOSXCTO IN CONL022S408" USING WKS-FTO-LLAMADO-S408. 122900      
007257                                                                  123000      
007258     MOVE WKS-S408-RESULT TO      WKS-SDO-RESULT-MON.             123100      
007259     IF WKS-S408-RESULT = 0                                       123200      
007260        MOVE 1 TO W77-S408-OK                                     123300      
007261        ADD WKS-DIS-S408        TO   ACCI-DISP-VAL-BAL-AMT-T      123350      
007262        IF WKS-SDO-S408 > 0                                       123400      
007263           MOVE "+"             TO   WKS-SIG-LIN                  123500      
007264           MOVE WKS-SDO-S408    TO   WKS-SDO-LIN-MON              123600      
007265           COMPUTE W77-SDOACT-TEMP = ACCI-ACCT-BAL-AMT-T          123700      
007266                                     - WKS-SDO-S408               123800      
007267           MOVE W77-SDOACT-TEMP TO   ACCI-ACCT-BAL-AMT-T,         123900      
007268                                     ACCI-LCY-ACCT-BAL-AMT-T,     124000      
007269                                     WKS-SDO-ACTCALC-MON          124100      
007270           MOVE W77-FECHA-PROC  TO   ACCI-LAST-TXN-DATE-T         124200      
007271           IF W77-SDOACT-TEMP > 0                                 124300      
007272              MOVE  "+"         TO   ACCI-ACCT-BAL-AMT-SIGN-T,    124400      
007273                                     ACCI-LCY-BAL-AMT-SIGN-T,     124500      
007274                                     WKS-SIG-SDOACTCAL            124600      
007275           ELSE                                                   124700      
007276              MOVE  "-"         TO   ACCI-ACCT-BAL-AMT-SIGN-T,    124800      
007277                                     ACCI-LCY-BAL-AMT-SIGN-T,     124900      
007278                                     WKS-SIG-SDOACTCAL            125000      
007279        ELSE                                                      125100      
007280           MOVE 0               TO   WKS-SDO-LIN-MON              125200      
007281     ELSE                                                         125300      
007282     IF WKS-S408-RESULT = 96                                      125400      
007283        WAIT(300)                                                 125500      
007284     ELSE                                                         125600      
007285        MOVE 1 TO W77-S408-OK                                     125700      
007286        MOVE 020101 TO CODIGO-LJ                                  125800      
007287        MOVE "E"            TO      TIPO-LJ                       125900      
007288        MOVE 010105         TO      CODIGO-LJ                     126000      
007289        STRING "ERROR AL CONSULTAR S408 CON CTO. : ",             126100      
007290               ACCI-CONTRATO-T, "RESULT : ", WKS-S408-RESULT      126200      
007291               DELIMITED BY SIZE INTO TEXTO-LJ                    126300      
007292        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ.       126400      
007293                                                                  126410      
007294     IF ACCI-DISP-VAL-BAL-AMT-T < 0                               126420      
007295        MOVE  "-"                TO ACCI-DISP-BAL-AMT-SIGN-T      126440      
007296     ELSE                                                         126460      
007297        MOVE  "+"                TO ACCI-DISP-BAL-AMT-SIGN-T.     126480      
007298                                                                  126500      
007299 310-LLAMA-S408.                                                  126600      
007300*===============                                                  126700      
007301     MOVE ACCI-GEN-CUST-T          TO WKS-CLIENTE-MON.            126800      
007302     MOVE ACCI-ACCT-BAL-AMT-SIGN-T TO WKS-SIG-SDOACT,             126900      
007303                                      WKS-SIG-SDOACTCAL.          127000      
007304     MOVE ACCI-ACCT-BAL-AMT-T      TO WKS-SDO-ACT-MON             127100      
007305     MOVE ACCI-DISP-BAL-AMT-SIGN-T TO WKS-SIG-SDODIS              127200      
007306     MOVE ACCI-DISP-VAL-BAL-AMT-T  TO WKS-SDO-DIS-MON             127300      
007307     MOVE "+"             TO      WKS-SIG-LIN                     127400      
007308     MOVE WKS-SDO-ACT-MON TO      WKS-SDO-ACTCALC-MON             127500      
007309     MOVE 0               TO      W77-SDOACT-TEMP,WKS-SDO-LIN-MON 127600      
007310     MOVE LOW-VALUES      TO      WKS-FTO-LLAMADO-S408.           127700      
007311     MOVE 02              TO      WKS-FUN-S408                    127800      
007312     MOVE W77-FECHA-PROC  TO      WKS-FEC-S408,WKS-SDO-FECHA-MON  127900      
007313     MOVE ACCI-CONTRATO-T TO      WKS-CONTRATO-S408               128000      
007314     MOVE WKS-CONT-S408   TO      WKS-CTO-S408,WKS-CTO-MON        128100      
007315                                                                  128200      
007316     CALL "SALDOSXCTO IN CONL022S408" USING WKS-FTO-LLAMADO-S408. 128300      
007317                                                                  128400      
007318     MOVE WKS-S408-RESULT TO      WKS-SDO-RESULT-MON.             128500      
007319     IF WKS-S408-RESULT = 0                                       128600      
007320        MOVE 1 TO W77-S408-OK                                     128700      
007321        ADD WKS-DIS-S408        TO   ACCI-DISP-VAL-BAL-AMT-T      128750      
007322        IF WKS-SDO-S408 > 0                                       128800      
007323           MOVE "+"             TO   WKS-SIG-LIN                  128900      
007324           MOVE WKS-SDO-S408    TO   WKS-SDO-LIN-MON              129000      
007325           COMPUTE W77-SDOACT-TEMP = ACCI-ACCT-BAL-AMT-T          129100      
007326                                     - WKS-SDO-S408               129200      
007327           MOVE W77-SDOACT-TEMP TO   ACCI-ACCT-BAL-AMT-T,         129300      
007328                                     ACCI-LCY-ACCT-BAL-AMT-T,     129400      
007329                                     WKS-SDO-ACTCALC-MON          129500      
007330           MOVE W77-FECHA-PROC  TO   ACCI-LAST-TXN-DATE-T         129600      
007331           IF W77-SDOACT-TEMP > 0                                 129700      
007332              MOVE  "+"         TO   ACCI-ACCT-BAL-AMT-SIGN-T,    129800      
007333                                     ACCI-LCY-BAL-AMT-SIGN-T,     129900      
007334                                     WKS-SIG-SDOACTCAL            130000      
007335           ELSE                                                   130100      
007336              MOVE  "-"         TO   ACCI-ACCT-BAL-AMT-SIGN-T,    130200      
007337                                     ACCI-LCY-BAL-AMT-SIGN-T,     130300      
007338                                     WKS-SIG-SDOACTCAL            130400      
007339        ELSE                                                      130500      
007340           MOVE 0               TO   WKS-SDO-LIN-MON              130600      
007341     ELSE                                                         130700      
007342     IF WKS-S408-RESULT = 96                                      130800      
007343        WAIT(300)                                                 130900      
007344     ELSE                                                         131000      
007345     IF WKS-S408-RESULT NOT = 99                                  131100      
007346        MOVE 020101 TO CODIGO-LJ                                  131200      
007347        MOVE "E"            TO      TIPO-LJ                       131300      
007348        MOVE 010105         TO      CODIGO-LJ                     131400      
007349        STRING "ERROR AL CONSULTAR S408 CON CTO. : ",             131500      
007350               ACCI-CONTRATO-T, "RESULT : ", WKS-S408-RESULT      131600      
007351               DELIMITED BY SIZE INTO TEXTO-LJ                    131700      
007352        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ.       131800      
007353                                                                  131810      
007354     IF ACCI-DISP-VAL-BAL-AMT-T < 0                               131820      
007355        MOVE  "-"                TO ACCI-DISP-BAL-AMT-SIGN-T      131840      
007356     ELSE                                                         131860      
007357        MOVE  "+"                TO ACCI-DISP-BAL-AMT-SIGN-T.     131880      
007358                                                                  131900      
007359 320-LEE-CITD-T.                                                  132000      
007360*===============                                                  132100      
007361     MOVE ACCI-INT-REC-T TO ACCI-INT-REC.                         132200      
007362     WRITE R05-SDOSCITD FROM ACCI-INT-REC.                        132300      
007363     WRITE R06-MONITOR FROM WKS-REG-MONITOR.                      132400      
007364                                                                  132500      
007365     READ A04-SDOSCITD-T AT END MOVE 1 TO W77-FINLOG.             132600      
007366     PERFORM 310-LLAMA-S408.                                      132700      
007367                                                                  132800      
007368*                                                                 132900      
007369*INICIA  CODIGO DE RENOVACION CRONOS 2000                         133000      
007370 A2K-CPY-SECTION SECTION.                                         133100      
007371*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
007372*   COPY "S151/CRONOS2K/CPY/PD".                                  133200      
007373** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
007374** Unisys has defined for CRONOS2K project                     ** 000200      
007375** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
007376***************************************************************** 000400      
007377***************************************************************** 000600      
007378** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
007379** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
007380** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
007381** date MMDDCCAA, which is returned into the variable          ** 001000      
007382** A2K-FEC-MDCA-001.                                           ** 001100      
007383***************************************************************** 001200      
007384                                                                  001300      
007385 A2K-ACCEPT-TODAYS-DATE.                                          001400      
007386        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
007387*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
007388        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
007389        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
007390        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
007391        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
007392        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
007393                                                                  002200      
007394 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
007395        EXIT.                                                     002240      
007396                                                                  002500      
007397****************************************************************  002600      
007398** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
007399**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
007400**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
007401**baseyear to add the century to the year part.               **  003000      
007402**INPUT is A2K-FEC-AMD-001                                    **  003100      
007403**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
007404****************************************************************  003300      
007405                                                                  003400      
007406 A2K-CONV-AMD-TO-CAMD.                                            003500      
007407         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
007408         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
007409         IF A2K-FEC-AMD-001 = 0                                   003720      
007410            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
007411         ELSE                                                     003741      
007412          IF A2K-FEC-AMD-001 = 999999                             003742      
007413             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
007414         ELSE                                                     003760      
007415         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
007416                 A2K-OBTAIN-CENTURY-EXIT                          003900      
007417         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
007418         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
007419         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
007420         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
007421                                                                  004400      
007422 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
007423         EXIT.                                                    004600      
007424                                                                  004700      
007425******************************************************************004800      
007426**A2K-CONV-MDA-TO-MDCA.                                         **004900      
007427**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
007428** an eight digit format as MMDDCCAA. It use a                  **005100      
007429** baseyear to add century to the yaer.                         **005200      
007430** INPUT is A2K-FEC-MDA-001                                     **005300      
007431** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
007432                                                                  005500      
007433 A2K-CONV-MDA-TO-MDCA.                                            005600      
007434     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
007435     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
007436     IF A2K-FEC-MDA-001 = 0                                       005820      
007437        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
007438     ELSE                                                         005845      
007439      IF A2K-FEC-MDA-001 = 999999                                 005850      
007440         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
007441     ELSE                                                         005860      
007442     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
007443             A2K-OBTAIN-CENTURY-EXIT                              006000      
007444     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
007445     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
007446     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
007447     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
007448                                                                  006500      
007449 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
007450     EXIT.                                                        006700      
007451                                                                  006800      
007452***************************************************************** 006900      
007453**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
007454**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
007455**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
007456**baseyear to add century to the year.                         ** 007300      
007457**INPUT is A2K-FEC-DMA-001                                     ** 007400      
007458**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
007459                                                                  007600      
007460 A2K-CONV-DMA-TO-DMCA.                                            007700      
007461       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
007462       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
007463       IF  A2K-FEC-DMA-001   = 0                                  007920      
007464          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
007465       ELSE                                                       007945      
007466        IF A2K-FEC-DMA-001 = 999999                               007950      
007467          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
007468       ELSE                                                       007960      
007469       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
007470               A2K-OBTAIN-CENTURY-EXIT                            008100      
007471       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
007472       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
007473       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
007474       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
007475                                                                  008600      
007476 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
007477       EXIT.                                                      008800      
007478                                                                  008900      
007479***************************************************************** 009000      
007480** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
007481** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
007482** a 6 digit format as AAMMDD.                                 ** 009300      
007483** It simply removes the century information in the output     ** 009400      
007484** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
007485** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
007486                                                                  009700      
007487 A2K-CONV-CAMD-TO-AMD.                                            009800      
007488     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
007489     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
007490     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
007491     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
007492                                                                  010300      
007493 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
007494      EXIT.                                                       010500      
007495                                                                  010600      
007496******************************************************************010700      
007497******************************************************************010800      
007498** A2K-CONV-MDCA-TO-MDA.                                        **010900      
007499** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
007500** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
007501** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
007502** INPUT is A2K-FEC-MDCA-001                                    **011300      
007503** OUTPUT is A2K-FEC-MDA-001                                    **011400      
007504                                                                  011500      
007505 A2K-CONV-MDCA-TO-MDA.                                            011600      
007506     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
007507     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
007508     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
007509     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
007510                                                                  012100      
007511 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
007512      EXIT.                                                       012300      
007513                                                                  012400      
007514******************************************************************012500      
007515***************************************************************** 012600      
007516** A2K-CONV-DMCA-TO-DMA.                                        **012700      
007517** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
007518** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
007519** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
007520** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
007521** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
007522                                                                  013300      
007523 A2K-CONV-DMCA-TO-DMA.                                            013400      
007524     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
007525     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
007526     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
007527     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
007528                                                                  013900      
007529 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
007530      EXIT.                                                       014100      
007531                                                                  014200      
007532***************************************************************** 014300      
007533 A2K-CONV-MDCA-TO-CAMD.                                           014400      
007534      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
007535      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
007536      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
007537      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
007538      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
007539 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
007540      EXIT.                                                       015100      
007541***************************************************************** 015200      
007542** This paragraph adds century to an year field which is 9(02) ** 015300      
007543** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
007544** Output is A2K-FEC-CCAA-001.                                 ** 015600      
007545***************************************************************** 015700      
007546 A2K-CONV-AA-TO-CCAA.                                             015800      
007547      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
007548      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
007549              A2K-OBTAIN-CENTURY-EXIT.                            016100      
007550      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
007551 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
007552      EXIT.                                                       016400      
007553***************************************************************** 016500      
007554** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
007555** format.                                                     ** 016700      
007556** Input is A2K-FEC-DMCA-001.                                  ** 016800      
007557** Output is A2K-FEC-CAMD-001.                                 ** 016900      
007558***************************************************************** 017000      
007559 A2K-CONV-DMCA-TO-CAMD.                                           017100      
007560      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
007561      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
007562      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
007563      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
007564      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
007565 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
007566      EXIT.                                                       017800      
007567***************************************************************** 017900      
007568** This paragraph desides the Century to be added depending    ** 018000      
007569** on the base year.                                           ** 018100      
007570** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
007571** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
007572***************************************************************** 018400      
007573 A2K-OBTAIN-CENTURY.                                              018500      
007574      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
007575          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
007576      ELSE                                                        018800      
007577          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
007578 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
007579      EXIT.                                                       019100      
007580                                                                  019200      
007581***************************************************************** 019300      
007582** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
007583**  Format                                                     ** 019500      
007584** Input Is A2K-FEC-CAMD-001                                   ** 019600      
007585** Output Is A2K-FEC-DMCA-001                                  ** 019700      
007586***************************************************************** 019800      
007587 A2K-CONV-CAMD-TO-DMCA.                                           019900      
007588      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
007589      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
007590      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
007591      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
007592      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
007593                                                                  020500      
007594 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
007595      EXIT.                                                       020700      
007596                                                                  020800      
007597******************************************************************020900      
007598******************************************************************021000      
007599 A2K-CONV-AM-TO-CAM.                                              021100      
007600      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
007601      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
007602      IF A2K-FEC-AM-001 = 0                                       021220      
007603         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
007604      ELSE                                                        021245      
007605      IF A2K-FEC-AM-001 = 9999                                    021250      
007606         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
007607      ELSE                                                        021260      
007608      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
007609      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
007610      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
007611              A2K-OBTAIN-CENTURY-EXIT                             021600      
007612      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
007613                                                                  021800      
007614 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
007615      EXIT.                                                       022000      
007616                                                                  022100      
007617******************************************************************022200      
007618******************************************************************022300      
007619 A2K-CONV-CAM-TO-AM.                                              022400      
007620      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
007621      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
007622      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
007623                                                                  022800      
007624 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
007625   EXIT.                                                          023000      
007626                                                                  023100      
007627                                                                  023200      
007628                                                                  023500      
007629*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
007630 A2K-CPY-EXIT-PARA.                                               133300      
007631    EXIT.                                                         133400      
007632*TERMINA CODIGO DE RENOVACION CRONOS 2000                         133500      
007633*INI - INFOWARE (AGREGA EN REPORTE2 EL RESULT DEL S016)           133600      
007634 000-060-IMPRIME-RESULT-S016.                                     133700      
007635*============================                                     133800      
007636     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-62   AFTER 1           133900      
007637     ADD             2       TO WKS-NUM-LINEAS2                   134000      
007638     PERFORM 000-050-CHECA-SALTO-HOJA2.                           134100      
007639                                                                  134200      
007640 000-080-IMPRIME-TRAILER.                                         134300      
007641*============================                                     134400      
007642     MOVE SPACES      TO WLI-ENV-CTD.                             134500      
007643     MOVE WKS-ENV-CTD TO WLI-ENV-CTD.                             134600      
007644     WRITE V00-R00-REPORTE2 FROM WLI-TOT-ENVIO  AFTER 1.          134700      
007645                                                                  134800      
007646 100-010-CIERRA-SALDOS.                                           134900      
007647*======================                                           135000      
007648     IF WKS-CTL-FECARCH(1)  = W77-FECHA-PROC                      135200      
007649        MOVE 90   TO      WKS-DEL-FUNCION                         135300      
007650     ELSE                                                         135400      
007651     IF WKS-CTL-FECARCH(2)  = W77-FECHA-PROC                      135500      
007652        MOVE 91   TO      WKS-DEL-FUNCION                         135600      
007653     ELSE                                                         135700      
007654     IF WKS-CTL-FECARCH(3)  = W77-FECHA-PROC                      135800      
007655        MOVE 92   TO      WKS-DEL-FUNCION                         135900      
007656     ELSE                                                         136000      
007657     IF WKS-CTL-FECARCH(4)  = W77-FECHA-PROC                      136100      
007658        MOVE 93   TO      WKS-DEL-FUNCION                         136200      
007659     ELSE                                                         136300      
007660     IF WKS-CTL-FECARCH(5)  = W77-FECHA-PROC                      136400      
007661        MOVE 94   TO      WKS-DEL-FUNCION                         136500      
007662     ELSE                                                         136600      
007663     IF WKS-CTL-FECARCH(6)  = W77-FECHA-PROC                      136700      
007664        MOVE 95   TO      WKS-DEL-FUNCION                         136800      
007665     ELSE                                                         136900      
007666     IF WKS-CTL-FECARCH(7)  = W77-FECHA-PROC                      137000      
007667        MOVE 96   TO      WKS-DEL-FUNCION                         137100      
007668     ELSE                                                         137200      
007669     IF WKS-CTL-FECARCH(8)  = W77-FECHA-PROC                      137300      
007670        MOVE 97   TO      WKS-DEL-FUNCION                         137400      
007671     ELSE                                                         137500      
007672     IF WKS-CTL-FECARCH(9)  = W77-FECHA-PROC                      137600      
007673        MOVE 98   TO      WKS-DEL-FUNCION                         137700      
007674     ELSE                                                         137800      
007675     IF WKS-CTL-FECARCH(10) = W77-FECHA-PROC                      137900      
007676        MOVE 99   TO      WKS-DEL-FUNCION.                        138000      
007677                                                                  138050      
007678     MOVE 0                        TO W77-CTLVER-RSLT.            138100      
007679     MOVE "S151L002R"              TO WKS-LIBID-NOMB.             138200      
007680     MOVE W77-SIST-PARAM           TO WKS-LIBID-SIST.             138300      
007681                                                                  138400      
007682     CALL "DAME_TIT IN CTLVER" USING  WKS-CTLVER-LIBID            138500      
007683                                      WKS-CTLVER-NOMLIB           138600      
007684                               GIVING W77-CTLVER-RSLT.            138700      
007685                                                                  138800      
007686     IF W77-CTLVER-RSLT = 0                                       138900      
007687        CHANGE ATTRIBUTE TITLE OF "LIB-REG" TO WKS-CTLVER-NOMLIB  138910      
007688        MOVE ZEROS   TO    WKS-DEL-FECHA    WKS-DEL-NUMLOG        138920      
007689                           WKS-DEL-PRODUCTO WKS-DEL-PROCESO       138930      
007690                           W77-CTLVER-RSLT                        138940      
007691     CALL "CONTROLES IN LIB-REGISTRA" USING WKS-151-DATOS         138950      
007692                                     GIVING W77-CTLVER-RSLT       138960      
007693     ELSE                                                         138970      
007694        MOVE W77-SIST-PARAM TO WKS-TIT-SISREG                     139000      
007695        MOVE "I"    TO TIPO-LJ                                    139100      
007696        MOVE 020101 TO CODIGO-LJ                                  139200      
007697        STRING "ERROR EN CTLVERS, USO LIBRERIA REGISTRA SIN ",    139300      
007698               "RELEASE NI MTP." DELIMITED BY SIZE INTO TEXTO-LJ. 139400      
007699*       CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA"   TO             139500      
007700*               WKS-TIT-REGISTRA.                                 139600      
007701*FIN INFOWARE                                                     140400      
007702 41230-ENVIA-ACCCD.                                               140500      
007703*==================                                               140600      
007704*ENVIA ARCHIVO (S151)S151/FILE/E01/S500ACCCD/04/10/AAMMDD         140700      
007705     IF WKS-NUMCSI = 04                                           140800      
007706        MOVE WKS-TIT-SDOSCITD         TO WKS-NOM-ACC              140900      
007707        MOVE WKS-NOMBREACC            TO WKS-ARCHIVO              141000      
007708        CALL SYSTEM WFL USING WKS-COPY-L030.                      141100      
007709     IF WKS-NUMCSI = 04 AND W88-HOSTNAME                          141120      
007710        MOVE WKS-TIT-SDOSBNE          TO WKS-NOM-ACC-BNE          141140      
007711        MOVE WKS-NOMBREACC-BNE        TO WKS-ARCHIVO              141160      
007712        CALL SYSTEM WFL USING WKS-COPY-L030.                      141180      
007713                                                                  141200      
007714 330-LEE-SDOSBNE-T.                                               141300      
007715*===================                                              141400      
007716   READ A04-SDOSBNE-T AT END MOVE 1 TO W77-FINLOG.                141420      
007717   MOVE  0 TO W77-S408-OK.                                        141440      
007718   IF NOT W88-FINLOG                                              141500      
007719      PERFORM 300-LLAMA-S408-BNE UNTIL W88-S408-OK                141600      
007720      PERFORM 320-LEE-BNE-T UNTIL W88-FINLOG.                     141700      
007721                                                                  141800      
007722 300-LLAMA-S408-BNE.                                              141900      
007723*===================                                              142000      
007724     MOVE ACCI-GEN-CUST-BNE-T          TO WKS-CLIENTE-MON-BNE.    142100      
007725     MOVE ACCI-ACCT-BAL-AMT-SIGN-BNE-T TO WKS-SIG-SDOACT-BNE,     142200      
007726                                          WKS-SIG-SDOACTCAL-BNE.  142300      
007727     MOVE ACCI-ACCT-BAL-AMT-BNE-T      TO WKS-SDO-ACT-MON-BNE.    142400      
007728     MOVE ACCI-DISP-BAL-AMT-SIGN-BNE-T TO WKS-SIG-SDODIS-BNE      142500      
007729     MOVE ACCI-DISP-VAL-BAL-AMT-BNE-T  TO WKS-SDO-DIS-MON-BNE     142600      
007730     MOVE "+"                 TO      WKS-SIG-LIN-BNE             142700      
007731     MOVE WKS-SDO-ACT-MON-BNE TO      WKS-SDO-ACTCALC-MON-BNE     142800      
007732     MOVE 0                   TO      W77-SDOACT-TEMP-BNE,        142900      
007733                                      WKS-SDO-LIN-MON-BNE         143000      
007734     MOVE LOW-VALUES          TO      WKS-FTO-LLAMADO-S408.       143100      
007735     MOVE 02                  TO      WKS-FUN-S408                143200      
007736     MOVE W77-FECHA-PROC      TO      WKS-FEC-S408,               143300      
007737                                      WKS-SDO-FECHA-MON-BNE       143400      
007738     MOVE ACCI-CONTRATO-BNE-T TO      WKS-CONTRATO-S408           143500      
007739     MOVE WKS-CONT-S408       TO      WKS-CTO-S408,WKS-CTO-MON-BNE143600      
007740     CALL "SALDOSXCTO IN CONL022S408" USING WKS-FTO-LLAMADO-S408. 143700      
007741                                                                  143800      
007742     MOVE WKS-S408-RESULT TO      WKS-SDO-RESULT-MON-BNE.         143900      
007743     IF WKS-S408-RESULT = 0                                       144000      
007744        MOVE 1 TO W77-S408-OK                                     144100      
007745        ADD WKS-DIS-S408        TO   ACCI-DISP-VAL-BAL-AMT-BNE-T  144200      
007746        IF WKS-SDO-S408 > 0                                       144300      
007747           MOVE "+"             TO   WKS-SIG-LIN-BNE              144400      
007748           MOVE WKS-SDO-S408    TO   WKS-SDO-LIN-MON-BNE          144500      
007749           COMPUTE W77-SDOACT-TEMP-BNE = ACCI-ACCT-BAL-AMT-BNE-T  144600      
007750                                     - WKS-SDO-S408               144700      
007751           MOVE W77-SDOACT-TEMP-BNE TO   ACCI-ACCT-BAL-AMT-BNE-T, 144800      
007752                                     ACCI-LCY-ACCT-BAL-AMT-BNE-T, 144900      
007753                                     WKS-SDO-ACTCALC-MON-BNE      145000      
007754           MOVE W77-FECHA-PROC  TO   ACCI-LAST-TXN-DATE-BNE-T     145100      
007755           IF W77-SDOACT-TEMP-BNE > 0                             145200      
007756              MOVE  "+"         TO   ACCI-ACCT-BAL-AMT-SIGN-BNE-T,145300      
007757                                     ACCI-LCY-BAL-AMT-SIGN-BNE-T, 145400      
007758                                     WKS-SIG-SDOACTCAL-BNE        145500      
007759           ELSE                                                   145600      
007760              MOVE  "-"         TO   ACCI-ACCT-BAL-AMT-SIGN-BNE-T,145700      
007761                                     ACCI-LCY-BAL-AMT-SIGN-BNE-T, 145800      
007762                                     WKS-SIG-SDOACTCAL-BNE        145900      
007763        ELSE                                                      146000      
007764           MOVE 0               TO   WKS-SDO-LIN-MON-BNE          146100      
007765     ELSE                                                         146200      
007766     IF WKS-S408-RESULT = 96                                      146300      
007767        WAIT(300)                                                 146400      
007768     ELSE                                                         146500      
007769        MOVE 1 TO W77-S408-OK                                     146600      
007770        MOVE 020101 TO CODIGO-LJ                                  146700      
007771        MOVE "E"            TO      TIPO-LJ                       146800      
007772        MOVE 010105         TO      CODIGO-LJ                     146900      
007773        STRING "ERROR AL CONSULTAR S408 CON CTO. : ",             147000      
007774               ACCI-CONTRATO-BNE-T, "RESULT : ", WKS-S408-RESULT  147100      
007775               DELIMITED BY SIZE INTO TEXTO-LJ                    147200      
007776        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ.       147300      
007777                                                                  147400      
007778     IF ACCI-DISP-VAL-BAL-AMT-BNE-T < 0                           147500      
007779        MOVE  "-"                TO ACCI-DISP-BAL-AMT-SIGN-BNE-T  147600      
007780     ELSE                                                         147700      
007781        MOVE  "+"                TO ACCI-DISP-BAL-AMT-SIGN-BNE-T. 147800      
007782                                                                  147900      
007783 320-LEE-BNE-T.                                                   148000      
007784*==============                                                   148100      
007785     MOVE ACCI-INT-REC-BNE-T TO ACCI-INT-REC.                     148200      
007786     WRITE R05-SDOSBNE FROM ACCI-INT-REC.                         148300      
007787     WRITE R06-MONITOR-BNE FROM WKS-REG-MONITOR-BNE.              148400      
007788                                                                  148500      
007789     READ A04-SDOSBNE-T AT END MOVE 1 TO W77-FINLOG.              148600      
007790     PERFORM 310-LLAMA-S408-BNE.                                  148700      
007791                                                                  148800      
007792 310-LLAMA-S408-BNE.                                              148900      
007793*===================                                              149000      
007794     MOVE ACCI-GEN-CUST-BNE-T          TO WKS-CLIENTE-MON-BNE.    149100      
007795     MOVE ACCI-ACCT-BAL-AMT-SIGN-BNE-T TO WKS-SIG-SDOACT-BNE,     149200      
007796                                      WKS-SIG-SDOACTCAL-BNE.      149300      
007797     MOVE ACCI-ACCT-BAL-AMT-BNE-T      TO WKS-SDO-ACT-MON-BNE     149400      
007798     MOVE ACCI-DISP-BAL-AMT-SIGN-BNE-T TO WKS-SIG-SDODIS-BNE      149500      
007799     MOVE ACCI-DISP-VAL-BAL-AMT-BNE-T  TO WKS-SDO-DIS-MON-BNE     149600      
007800     MOVE "+"                 TO      WKS-SIG-LIN-BNE             149700      
007801     MOVE WKS-SDO-ACT-MON-BNE TO      WKS-SDO-ACTCALC-MON-BNE     149800      
007802     MOVE 0                   TO      W77-SDOACT-TEMP-BNE,        149900      
007803                                      WKS-SDO-LIN-MON-BNE         150000      
007804     MOVE LOW-VALUES          TO      WKS-FTO-LLAMADO-S408.       150100      
007805     MOVE 02                  TO      WKS-FUN-S408                150200      
007806     MOVE W77-FECHA-PROC      TO      WKS-FEC-S408,               150300      
007807                                      WKS-SDO-FECHA-MON-BNE       150400      
007808     MOVE ACCI-CONTRATO-BNE-T TO      WKS-CONTRATO-S408           150500      
007809     MOVE WKS-CONT-S408       TO      WKS-CTO-S408,WKS-CTO-MON-BNE150600      
007810                                                                  150700      
007811     CALL "SALDOSXCTO IN CONL022S408" USING WKS-FTO-LLAMADO-S408. 150800      
007812                                                                  150900      
007813     MOVE WKS-S408-RESULT     TO      WKS-SDO-RESULT-MON-BNE.     151000      
007814     IF WKS-S408-RESULT = 0                                       151100      
007815        MOVE 1 TO W77-S408-OK                                     151200      
007816        ADD WKS-DIS-S408      TO   ACCI-DISP-VAL-BAL-AMT-BNE-T    151300      
007817        IF WKS-SDO-S408 > 0                                       151400      
007818           MOVE "+"           TO   WKS-SIG-LIN-BNE                151500      
007819           MOVE WKS-SDO-S408  TO   WKS-SDO-LIN-MON-BNE            151600      
007820           COMPUTE W77-SDOACT-TEMP-BNE = ACCI-ACCT-BAL-AMT-BNE-T  151700      
007821                                     - WKS-SDO-S408               151800      
007822           MOVE W77-SDOACT-TEMP-BNE TO   ACCI-ACCT-BAL-AMT-BNE-T, 151900      
007823                                     ACCI-LCY-ACCT-BAL-AMT-BNE-T, 152000      
007824                                     WKS-SDO-ACTCALC-MON-BNE      152100      
007825           MOVE W77-FECHA-PROC  TO   ACCI-LAST-TXN-DATE-BNE-T     152200      
007826           IF W77-SDOACT-TEMP-BNE > 0                             152300      
007827              MOVE  "+"         TO   ACCI-ACCT-BAL-AMT-SIGN-BNE-T,152400      
007828                                     ACCI-LCY-BAL-AMT-SIGN-BNE-T, 152500      
007829                                     WKS-SIG-SDOACTCAL-BNE        152600      
007830           ELSE                                                   152700      
007831              MOVE  "-"         TO   ACCI-ACCT-BAL-AMT-SIGN-BNE-T,152800      
007832                                     ACCI-LCY-BAL-AMT-SIGN-BNE-T, 152900      
007833                                     WKS-SIG-SDOACTCAL-BNE        153000      
007834        ELSE                                                      153100      
007835           MOVE 0               TO   WKS-SDO-LIN-MON-BNE          153200      
007836     ELSE                                                         153300      
007837     IF WKS-S408-RESULT = 96                                      153400      
007838        WAIT(300)                                                 153500      
007839     ELSE                                                         153600      
007840     IF WKS-S408-RESULT NOT = 99                                  153700      
007841        MOVE 020101 TO CODIGO-LJ                                  153800      
007842        MOVE "E"            TO      TIPO-LJ                       153900      
007843        MOVE 010105         TO      CODIGO-LJ                     154000      
007844        STRING "ERROR AL CONSULTAR S408 CON CTO. : ",             154100      
007845               ACCI-CONTRATO-BNE-T, "RESULT : ", WKS-S408-RESULT  154200      
007846               DELIMITED BY SIZE INTO TEXTO-LJ                    154300      
007847        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ.       154400      
007848                                                                  154500      
007849     IF ACCI-DISP-VAL-BAL-AMT-BNE-T < 0                           154600      
007850        MOVE  "-"                TO ACCI-DISP-BAL-AMT-SIGN-BNE-T  154700      
007851     ELSE                                                         154800      
007852        MOVE  "+"                TO ACCI-DISP-BAL-AMT-SIGN-BNE-T. 154900      
