000001$SET LIST  LINEINFO                                               000100      
000002$SET OPTIMIZE                                                     000200      
000003                                                                  000300      
000004 IDENTIFICATION DIVISION.                                         000400      
000005******************************************************************000500      
000006*                                                                *000600      
000007* FUNCION : PROCESO DE INTEGRACION DE LAS ESTRUCTURAS B20, B21,  *000700      
000008*           B70, B71, B72 Y B80 DE LA BASE  "S151BD11SDOSXXX",   *000800      
000009*           ESTE PROCESO LEE LOS ARCHIVOS GENERADOS POR EL       *000900      
000010*           PROCESO DE EXTRACCION PASO P330 (UN ARCHIVO POR CADA *001000      
000011*           DATASET).                                            *001100      
000012*                                                                *001200      
000013*           XXX ---> SE PASA POR PARAMETRO EL NUMERO DE SISTEMA  *001300      
000014*           DE LA BASE A INTEGRAR Y ENSEGUIDA EL NOMBRE DEL PACK *001400      
000015*           DONDE QUEDARON RESIDENTES LOS ARCHIVOS PLANOS.       *001500      
000016*                                                                *001600      
000017******************************************************************001700      
000018******************************************************************001705      
000019**JNRB 251112 SE LIBERA NUEVA VERSION POR PROCESO DE             *001710      
000020**RECOMPILACION                                                  *001715      
000021*                                                                *001720      
000022*                                                                *001725      
000023*                                                                *001730      
000024*                                                                *001735      
000025*                                                                *001740      
000026*                                                                *001745      
000027*                                                                *001750      
000028*                                                                *001755      
000029*                                                                *001760      
000030*                                                                *001765      
000031*                                                                *001770      
000032******************************************************************001775      
000033                                                                  001800      
000034 ENVIRONMENT DIVISION.                                            001900      
000035 INPUT-OUTPUT SECTION.                                            002000      
000036 FILE-CONTROL.                                                    002100      
000037                                                                  002200      
000038     SELECT R20SDOMENCON  ASSIGN TO DISK.                         002300      
000039     SELECT R21SDMENCON1  ASSIGN TO DISK.                         002400      
000040     SELECT R70POSICION   ASSIGN TO DISK.                         002500      
000041     SELECT R71POSDIAAD1  ASSIGN TO DISK.                         002600      
000042     SELECT R72POSCONTA   ASSIGN TO DISK.                         002700      
000043     SELECT R80EDOCTA     ASSIGN TO DISK.                         002800      
000044                                                                  002900      
000045     SELECT A20-SORT      ASSIGN TO SORT FOR DISK.                003000      
000046     SELECT A21-SORT      ASSIGN TO SORT FOR DISK.                003100      
000047     SELECT A70-SORT      ASSIGN TO SORT FOR DISK.                003200      
000048     SELECT A71-SORT      ASSIGN TO SORT FOR DISK.                003300      
000049     SELECT A72-SORT      ASSIGN TO SORT FOR DISK.                003400      
000050     SELECT A80-SORT      ASSIGN TO SORT FOR DISK.                003500      
000051                                                                  003600      
000052     SELECT IMPRESION     ASSIGN TO PRINTER.                      003700      
000053                                                                  003800      
000054 DATA DIVISION.                                                   003900      
000055 FILE SECTION.                                                    004000      
000056                                                                  004100      
000057                                                                  004200      
000058 FD  IMPRESION                                                    004300      
000059     VALUE OF TITLE IS WS-REPORTE-INTEGRACION                     004400      
000060     DATA RECORD IS LINEA-REP-INTEGRA.                            004500      
000061                                                                  004600      
000062 01  LINEA-REP-INTEGRA             PIC X(132).                    004700      
000063                                                                  004800      
000064                                                                  004900      
000065 FD  R20SDOMENCON                                                 005000      
000066     VALUE OF TITLE IS WS-TITLE-B20SDOMENCON                      005100      
000067     BLOCK CONTAINS 30 RECORDS                                    005200      
000068     VALUE OF AREAS 1000                                          005300      
000069     VALUE OF AREASIZE IS 12000                                   005400      
000070     DATA RECORD IS REG-B20SDOMENCON.                             005500      
000071                                                                  005600      
000072 01  REG-B20SDOMENCON.                                            005700      
000073     03 R20-SDO-KEYMENCON.                                        005800      
000074        05 R20-SDO-KEYAM           PIC 9(06) COMP.                005900      
000075        05 R20-SDO-KEYCON          PIC 9(20) COMP.                006000      
000076        05 R20-SDO-KEYPRD          PIC 9(04) COMP.                006100      
000077        05 R20-SDO-KEYINS          PIC 9(04) COMP.                006200      
000078        05 R20-SDO-KEYMON          PIC 9(04) COMP.                006300      
000079     03 R20-SDO-SUCPRO             PIC 9(04) COMP.                006400      
000080     03 R20-SDO-STAMOV             PIC 9(02) COMP.                006500      
000081     03 R20-SDO-APUIMP             PIC 9(02) COMP.                006600      
000082     03 R20-SDO-FILLER             PIC X(14).                     006700      
000083     03 R20-SDO-SDO                OCCURS   10 TIMES.             006800      
000084        05 R20-SDO-CNTMOV          PIC 9(08) COMP.                006900      
000085        05 R20-SDO-SD              PIC S9(13)V9(02) COMP.         007000      
000086                                                                  007100      
000087 SD  A20-SORT                                                     007200      
000088     RECORD CONTAINS 157 CHARACTERS                               007300      
000089     BLOCK CONTAINS  36 RECORDS.                                  007400      
000090                                                                  007500      
000091 01  A20-R20-SORT.                                                007600      
000092     03 A20-R20-AM                 PIC 9(06) COMP.                007700      
000093     03 A20-R20-CON                PIC 9(20) COMP.                007800      
000094     03 A20-R20-PRD                PIC 9(04) COMP.                007900      
000095     03 A20-R20-INS                PIC 9(04) COMP.                008000      
000096     03 A20-R20-MON                PIC 9(04) COMP.                008100      
000097     03 A20-R20-SUCPRO             PIC 9(04) COMP.                008200      
000098     03 A20-R20-STAMOV             PIC 9(02) COMP.                008300      
000099     03 A20-R20-APUIMP             PIC 9(02) COMP.                008400      
000100     03 A20-R20-FILLER             PIC X(14).                     008500      
000101     03 A20-R20-SDO                OCCURS   10 TIMES.             008600      
000102        05 A20-R20-CNTMOV          PIC 9(08) COMP.                008700      
000103        05 A20-R20-SD              PIC S9(13)V9(02) COMP.         008800      
000104                                                                  008900      
000105                                                                  009000      
000106 FD  R21SDMENCON1                                                 009100      
000107     VALUE OF TITLE IS WS-TITLE-B21SDMENCON1                      009200      
000108     BLOCK CONTAINS 45 RECORDS                                    009300      
000109     VALUE OF AREAS 1000                                          009400      
000110     VALUE OF AREASIZE IS 12000                                   009500      
000111     DATA RECORD IS REG-B21SDMENCON1.                             009600      
000112                                                                  009700      
000113 01  REG-B21SDMENCON1.                                            009800      
000114     03 R21-SDO-KEYMENCON.                                        009900      
000115        05 R21-SDO-KEYAM           PIC 9(06) COMP.                010000      
000116        05 R21-SDO-KEYCON          PIC 9(20) COMP.                010100      
000117        05 R21-SDO-KEYPRD          PIC 9(04) COMP.                010200      
000118        05 R21-SDO-KEYINS          PIC 9(04) COMP.                010300      
000119        05 R21-SDO-KEYIND          PIC 9(04) COMP.                010400      
000120     03 R21-SDO-FILLER             PIC X(06).                     010500      
000121     03 R21-SDO-SDO                OCCURS   12 TIMES.             010600      
000122        05 R21-SDO-CNTMOV          PIC 9(08) COMP.                010700      
000123        05 R21-SDO-SD              PIC S9(13)V9(02) COMP.         010800      
000124                                                                  010900      
000125 SD  A21-SORT                                                     011000      
000126     RECORD CONTAINS 169 CHARACTERS                               011100      
000127     BLOCK CONTAINS  45 RECORDS.                                  011200      
000128                                                                  011300      
000129 01  A21-R21-SORT.                                                011400      
000130     03 A21-R21-AM                 PIC 9(06) COMP.                011500      
000131     03 A21-R21-CON                PIC 9(20) COMP.                011600      
000132     03 A21-R21-PRD                PIC 9(04) COMP.                011700      
000133     03 A21-R21-INS                PIC 9(04) COMP.                011800      
000134     03 A21-R21-IND                PIC 9(04) COMP.                011900      
000135     03 A21-R21-FILLER             PIC X(06).                     012000      
000136     03 A21-R21-SDO                OCCURS   12 TIMES.             012100      
000137        05 A21-R21-CNTMOV          PIC 9(08) COMP.                012200      
000138        05 A21-R21-SD              PIC S9(13)V9(02) COMP.         012300      
000139                                                                  012400      
000140                                                                  012500      
000141 FD  R70POSICION                                                  012600      
000142     VALUE OF TITLE IS WS-TITLE-B70POSICION                       012700      
000143     BLOCK CONTAINS 30 RECORDS                                    012800      
000144     VALUE OF AREAS 1000                                          012900      
000145     VALUE OF AREASIZE IS 12000                                   013000      
000146     DATA RECORD IS REG-B70POSICION.                              013100      
000147                                                                  013200      
000148 01  REG-B70POSICION.                                             013300      
000149     03 R70-SDO-KEYPOS.                                           013400      
000150        05 R70-SDO-KEYCSI          PIC 9(04) COMP.                013500      
000151        05 R70-SDO-KEYFEC          PIC 9(08) COMP.                013600      
000152        05 R70-SDO-KEYPRD          PIC 9(04) COMP.                013700      
000153        05 R70-SDO-KEYINS          PIC 9(04) COMP.                013800      
000154        05 R70-SDO-KEYMON          PIC 9(04) COMP.                013900      
000155     03 R70-SDO-APUIMP             PIC 9(02) COMP.                014000      
000156     03 R70-SDO-FILLER             PIC X(16).                     014100      
000157     03 R70-SDO-SDO                OCCURS   10 TIMES.             014200      
000158        05 R70-SDO-CNTMOV          PIC 9(10) COMP.                014300      
000159        05 R70-SDO-SD              PIC S9(15)V9(02) COMP.         014400      
000160                                                                  014500      
000161 SD  A70-SORT                                                     014600      
000162     RECORD CONTAINS 169 CHARACTERS                               014700      
000163     BLOCK CONTAINS  36 RECORDS.                                  014800      
000164                                                                  014900      
000165 01  A70-R70-SORT.                                                015000      
000166     03 A70-R70-CSI                PIC 9(04) COMP.                015100      
000167     03 A70-R70-FEC                PIC 9(08) COMP.                015200      
000168     03 A70-R70-PRD                PIC 9(04) COMP.                015300      
000169     03 A70-R70-INS                PIC 9(04) COMP.                015400      
000170     03 A70-R70-MON                PIC 9(04) COMP.                015500      
000171     03 A70-R70-APUIMP             PIC 9(02) COMP.                015600      
000172     03 A70-R70-FILLER             PIC X(16).                     015700      
000173     03 A70-R70-SDO                OCCURS   10 TIMES.             015800      
000174        05 A70-R70-CNTMOV          PIC 9(10) COMP.                015900      
000175        05 A70-R70-SD              PIC S9(15)V9(02) COMP.         016000      
000176                                                                  016100      
000177                                                                  016200      
000178 FD  R71POSDIAAD1                                                 016300      
000179     VALUE OF TITLE IS WS-TITLE-B71POSDIAAD1                      016400      
000180     BLOCK CONTAINS 30 RECORDS                                    016500      
000181     VALUE OF AREAS 1000                                          016600      
000182     VALUE OF AREASIZE IS 12000                                   016700      
000183     DATA RECORD IS REG-B71POSDIAAD1.                             016800      
000184                                                                  016900      
000185 01  REG-B71POSDIAAD1.                                            017000      
000186     03 R71-SDO-KEYPOS.                                           017100      
000187        05 R71-SDO-KEYCSI          PIC 9(02) COMP.                017200      
000188        05 R71-SDO-KEYFEC          PIC 9(08) COMP.                017300      
000189        05 R71-SDO-KEYPRD          PIC 9(04) COMP.                017400      
000190        05 R71-SDO-KEYINS          PIC 9(04) COMP.                017500      
000191        05 R71-SDO-KEYMON          PIC 9(04) COMP.                017600      
000192        05 R71-SDO-KEYIND          PIC 9(04) COMP.                017700      
000193     03 R71-SDO-SDO                OCCURS   12 TIMES.             017800      
000194        05 R71-SDO-CNTMOV          PIC 9(08) COMP.                017900      
000195        05 R71-SDO-SD              PIC S9(15)V9(02) COMP.         018000      
000196                                                                  018100      
000197 SD  A71-SORT                                                     018200      
000198     RECORD CONTAINS 169 CHARACTERS                               018300      
000199     BLOCK CONTAINS  36 RECORDS.                                  018400      
000200                                                                  018500      
000201 01  A71-R71-SORT.                                                018600      
000202     03 A71-R71-CSI                PIC 9(02) COMP.                018700      
000203     03 A71-R71-FEC                PIC 9(08) COMP.                018800      
000204     03 A71-R71-PRD                PIC 9(04) COMP.                018900      
000205     03 A71-R71-INS                PIC 9(04) COMP.                019000      
000206     03 A71-R71-MON                PIC 9(04) COMP.                019100      
000207     03 A71-R71-IND                PIC 9(04) COMP.                019200      
000208     03 A71-R71-SDO                OCCURS   12 TIMES.             019300      
000209        05 A71-R71-CNTMOV          PIC 9(08) COMP.                019400      
000210        05 A71-R71-SD              PIC S9(15)V9(02) COMP.         019500      
000211                                                                  019600      
000212                                                                  019700      
000213 FD  R72POSCONTA                                                  019800      
000214     VALUE OF TITLE IS WS-TITLE-B72POSCONTA                       019900      
000215     BLOCK CONTAINS 30 RECORDS                                    020000      
000216     VALUE OF AREAS 1000                                          020100      
000217     VALUE OF AREASIZE IS 12000                                   020200      
000218     DATA RECORD IS REG-B72POSCONTA.                              020300      
000219                                                                  020400      
000220 01  REG-B72POSCONTA.                                             020500      
000221     03 R72-SDO-KEYPOS.                                           020600      
000222        05 R72-SDO-KEYCSI          PIC 9(04) COMP.                020700      
000223        05 R72-SDO-KEYFEC          PIC 9(08) COMP.                020800      
000224        05 R72-SDO-KEYBCO          PIC 9(04) COMP.                020900      
000225        05 R72-SDO-KEYMON          PIC 9(04) COMP.                021000      
000226        05 R72-SDO-KEYFID          PIC 9(04) COMP.                021100      
000227        05 R72-SDO-KEYPRD          PIC 9(04) COMP.                021200      
000228        05 R72-SDO-KEYINS          PIC 9(04) COMP.                021300      
000229        05 R72-SDO-KEYCTA          PIC 9(12) COMP.                021400      
000230        05 R72-SDO-KEYCVEC         PIC 9(06) COMP.                021500      
000231        05 R72-SDO-KEYSEC          PIC 9(02) COMP.                021600      
000232     03 R72-SDO-NATCTA             PIC 9(02) COMP.                021700      
000233     03 R72-SDO-SDOANT             PIC S9(15)V9(02) COMP.         021800      
000234     03 R72-SDO-CARGOS             PIC S9(15)V9(02) COMP.         021900      
000235     03 R72-SDO-ABONOS             PIC S9(15)V9(02) COMP.         022000      
000236     03 R72-SDO-SDOACT             PIC S9(15)V9(02) COMP.         022100      
000237                                                                  022200      
000238 SD  A72-SORT                                                     022300      
000239     RECORD CONTAINS 63 CHARACTERS                                022400      
000240     BLOCK CONTAINS  36 RECORDS.                                  022500      
000241                                                                  022600      
000242 01  A72-R72-SORT.                                                022700      
000243     03 A72-R72-CSI                PIC 9(04) COMP.                022800      
000244     03 A72-R72-FEC                PIC 9(08) COMP.                022900      
000245     03 A72-R72-BCO                PIC 9(04) COMP.                023000      
000246     03 A72-R72-MON                PIC 9(04) COMP.                023100      
000247     03 A72-R72-FID                PIC 9(04) COMP.                023200      
000248     03 A72-R72-PRD                PIC 9(04) COMP.                023300      
000249     03 A72-R72-INS                PIC 9(04) COMP.                023400      
000250     03 A72-R72-CTA                PIC 9(12) COMP.                023500      
000251     03 A72-R72-CVEC               PIC 9(06) COMP.                023600      
000252     03 A72-R72-SEC                PIC 9(02) COMP.                023700      
000253     03 A72-R72-NATCTA             PIC 9(02) COMP.                023800      
000254     03 A72-R72-SDOANT             PIC S9(15)V9(02) COMP.         023900      
000255     03 A72-R72-CARGOS             PIC S9(15)V9(02) COMP.         024000      
000256     03 A72-R72-ABONOS             PIC S9(15)V9(02) COMP.         024100      
000257     03 A72-R72-SDOACT             PIC S9(15)V9(02) COMP.         024200      
000258                                                                  024300      
000259                                                                  024400      
000260 FD  R80EDOCTA                                                    024500      
000261     VALUE OF TITLE IS WS-TITLE-B80EDOCTA                         024600      
000262     BLOCK CONTAINS 30 RECORDS                                    024700      
000263     VALUE OF AREAS 1000                                          024800      
000264     VALUE OF AREASIZE IS 12000                                   024900      
000265     DATA RECORD IS REG-B80EDOCTA.                                025000      
000266                                                                  025100      
000267 01  REG-B80EDOCTA.                                               025200      
000268     03 R80-SDO-KEYCONT.                                          025300      
000269        05 R80-SDO-KEYCON          PIC 9(20) COMP.                025400      
000270     03 R80-SDO-FECCON             PIC 9(08) COMP.                025500      
000271     03 R80-SDO-PRD                PIC 9(04) COMP.                025600      
000272     03 R80-SDO-INS                PIC 9(02) COMP.                025700      
000273     03 R80-SDO-FCHINI             PIC 9(08) COMP.                025800      
000274     03 R80-SDO-FCHFIN             PIC 9(08) COMP.                025900      
000275     03 R80-SDO-DATOS              PIC X(146).                    026000      
000276                                                                  026100      
000277 SD  A80-SORT                                                     026200      
000278     RECORD CONTAINS 171 CHARACTERS                               026300      
000279     BLOCK CONTAINS  36 RECORDS.                                  026400      
000280                                                                  026500      
000281 01  A80-R80-SORT.                                                026600      
000282     03 A80-R80-CON                PIC 9(20) COMP.                026700      
000283     03 A80-R80-FECCON             PIC 9(08) COMP.                026800      
000284     03 A80-R80-PRD                PIC 9(04) COMP.                026900      
000285     03 A80-R80-INS                PIC 9(02) COMP.                027000      
000286     03 A80-R80-FCHINI             PIC 9(08) COMP.                027100      
000287     03 A80-R80-FCHFIN             PIC 9(08) COMP.                027200      
000288     03 A80-R80-DATOS              PIC X(146).                    027300      
000289                                                                  027400      
000290                                                                  027500      
000291 DATA-BASE SECTION.                                               027600      
000292                                                                  027700      
000293 DB  SALDOS = S151BD11SDOS151.                                    027800      
000294                                                                  027900      
000295                                                                  028000      
000296 WORKING-STORAGE SECTION.                                         028100      
000297                                                                  028200      
000298                                                                  028300      
000299*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000300* COPY "S151/CRONOS2K/CPY/WS".                                    028400      
000301******************************************************************000100      
000302** This copyBook defines all the additional variables that      **000200      
000303** Unisys has defined for the CRONOS2K project                  **000300      
000304** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000305******************************************************************000500      
000306                                                                  000600      
000307******************************************************************000700      
000308** These Variables are used to Accept the system date in long   **000800      
000309** format and get the century information                       **000900      
000310** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000311 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000312 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000313    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000314    05 FILLER      PIC X(1).                                      001400      
000315    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000316    05 FILLER      PIC X(1).                                      001600      
000317    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000318    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000319      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000320      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000321******************************************************************002100      
000322                                                                  002200      
000323******************************************************************002300      
000324** This variable defines a date in the format MMDDCCAA          **002400      
000325**                                                              **002500      
000326 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000327 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000328    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000329    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000330    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000331    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000332      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000333      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000334******************************************************************003400      
000335                                                                  003500      
000336******************************************************************003600      
000337** This variable defines a date in the format CCAAMMDD          **003700      
000338**                                                              **003800      
000339 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000340 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000341    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000342    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000343      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000344      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000345    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000346    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000347******************************************************************004700      
000348                                                                  004800      
000349******************************************************************004900      
000350** This variable defines a date in the format DDMMCCAA          **005000      
000351**                                                              **005100      
000352 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000353 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000354    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000355    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000356    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000357    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000358      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000359      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000360******************************************************************006000      
000361                                                                  006100      
000362******************************************************************006200      
000363** This variable defines a date in the Julian Format CCAADDD    **006300      
000364**                                                              **006400      
000365 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000366 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000367    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000368    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000369                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000370      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000371      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000372    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000373******************************************************************007300      
000374                                                                  007400      
000375******************************************************************007500      
000376** This variable defines a date in the format AAMMDD            **007600      
000377**                                                              **007700      
000378 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000379 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000380    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000381    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000382    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000383******************************************************************008300      
000384                                                                  008400      
000385******************************************************************008500      
000386** This variable defines a date in the format MMDDAA            **008600      
000387**                                                              **008700      
000388 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000389 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000390    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000391    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000392    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000393******************************************************************009300      
000394                                                                  009400      
000395******************************************************************009500      
000396** This variable defines a date in the format DDMMAA            **009600      
000397**                                                              **009700      
000398 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000399 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000400    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000401    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000402    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000403******************************************************************010300      
000404                                                                  010400      
000405******************************************************************010500      
000406** These variables are defined to be used for CALL bridge logic **010600      
000407**                                                              **010700      
000408 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000409 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000410 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000411 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000412 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000413 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000414******************************************************************011400      
000415                                                                  011500      
000416******************************************************************011600      
000417** This variable is used for converting only a year field AA to **011700      
000418** CCAA and a CCAA to AA                                        **011800      
000419 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000420 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000421    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000422    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000423 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000424 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000425******************************************************************012300      
000426                                                                  012400      
000427******************************************************************012500      
000428** These variables are Bridge Variables for Intercambio files   **012600      
000429** para EDOCTA                                                  **012700      
000430 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000431 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000432 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000433 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000434 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000435 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000436 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000437******************************************************************013500      
000438* Para MODULO                                                     013600      
000439 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000440******************************************************************013800      
000441******************************************************************013900      
000442** Para FMOVSCHABO                                                014000      
000443 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000444******************************************************************014200      
000445                                                                  014300      
000446******************************************************************014400      
000447***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000448******************************************************************014600      
000449                                                                  014700      
000450 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000451 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000452     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000453     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000454     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000455******************************************************************015300      
000456                                                                  015400      
000457******************************************************************015500      
000458***  These Variables Are Defined For Date In AAMM Format       ***015600      
000459******************************************************************015700      
000460                                                                  015800      
000461 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000462 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000463     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000464     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000465******************************************************************016300      
000466                                                                  016400      
000467                                                                  016500      
000468*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000469  01  A2K-BASE-YEAR     PIC 9(02) VALUE 50.                       028500      
000470                                                                  028600      
000471                                                                  028700      
000472 77  WS-EOF-B20                    PIC 9(02) COMP VALUE ZEROS.    028800      
000473 77  WS-EOF-B21                    PIC 9(02) COMP VALUE ZEROS.    028900      
000474 77  WS-EOF-B70                    PIC 9(02) COMP VALUE ZEROS.    029000      
000475 77  WS-EOF-B71                    PIC 9(02) COMP VALUE ZEROS.    029100      
000476 77  WS-EOF-B72                    PIC 9(02) COMP VALUE ZEROS.    029200      
000477 77  WS-EOF-B80                    PIC 9(02) COMP VALUE ZEROS.    029300      
000478                                                                  029400      
000479 77  WS-INTEGRADOS-B20             PIC 9(08) VALUE ZEROS.         029500      
000480 77  WS-INTEGRADOS-B21             PIC 9(08) VALUE ZEROS.         029600      
000481 77  WS-INTEGRADOS-B70             PIC 9(08) VALUE ZEROS.         029700      
000482 77  WS-INTEGRADOS-B71             PIC 9(08) VALUE ZEROS.         029800      
000483 77  WS-INTEGRADOS-B72             PIC 9(08) VALUE ZEROS.         029900      
000484 77  WS-INTEGRADOS-B80             PIC 9(08) VALUE ZEROS.         030000      
000485                                                                  030100      
000486 77  WS-TOTALB20SDOSD2             PIC 9(18)V9(02).               030200      
000487 77  WS-TOTALB21SDOSD2             PIC 9(18)V9(02).               030300      
000488 77  WS-TOTALB70SDOSD2             PIC 9(18)V9(02).               030400      
000489 77  WS-TOTALB71SDOSD2             PIC 9(18)V9(02).               030500      
000490 77  WS-TOTALB72SDOACT             PIC 9(18)V9(02).               030600      
000491                                                                  030700      
000492 77  WS-PAGINA                     PIC 9(03) VALUE ZEROS.         030800      
000493 77  WS-LINEAS                     PIC 9(02) VALUE 65.            030900      
000494 77  W77-C                         PIC 9(04) COMP VALUE ZEROS.    031000      
000495 77  W77-E                         PIC 9(04) COMP VALUE ZEROS.    031100      
000496 77  W77-I                         PIC 9(04) COMP VALUE ZEROS.    031200      
000497 77  W77-D                         PIC 9(04) COMP VALUE ZEROS.    031300      
000498                                                                  031400      
000499                                                                  031500      
000500*=======================  NOMBRE DEL LISTADO   ==================*031600      
000501                                                                  031700      
000502 01  WS-REPORTE-INTEGRACION.                                      031800      
000503     02 FILLER                     PIC X(01) VALUE "S".           031900      
000504     02 SIST-REP                   PIC 9(03).                     032000      
000505     02 FILLER                     PIC X(11) VALUE "/LIST/P360/". 032100      
000506     02 NUMCSIREP                  PIC 9(02).                     032200      
000507     02 SUBNODOREP                 PIC X(02) VALUE "00".          032300      
000508     02 FILLER                     PIC X(06) VALUE "/C000/".      032400      
000509     02 FECHAREPOR                 PIC 9(06).                     032500      
000510     02 FILLER                     PIC X(01) VALUE "/".           032600      
000511     02 NUMBERMIX                  PIC 9(07).                     032700      
000512     02 FILLER                     PIC X(01) VALUE "/".           032800      
000513     02 FILLER                     PIC X(14) VALUE                032900      
000514        "001INTEGRACION".                                         033000      
000515     02 FILLER                     PIC X(01) VALUE ".".           033100      
000516                                                                  033200      
000517                                                                  033300      
000518*======== NOMBRES DE LOS ARCHIVOS PLANOS DE LA EXTRACCION =======*033400      
000519                                                                  033500      
000520                                                                  033600      
000521 01  WS-TITLE-B20SDOMENCON.                                       033700      
000522     02 FILLER                     PIC X(01) VALUE "S".           033800      
000523     02 W77-SIS-B20                PIC 9(03).                     033900      
000524     02 FILLER                     PIC X(27) VALUE                034000      
000525        "/FILE/EXTR/B20SDOMENCON ON ".                            034100      
000526     02 WKS-B20-PACK               PIC X(12).                     034200      
000527     02 FILLER                     PIC X(01) VALUE ".".           034300      
000528                                                                  034400      
000529 01  WS-TITLE-B21SDMENCON1.                                       034500      
000530     02 FILLER                     PIC X(01) VALUE "S".           034600      
000531     02 W77-SIS-B21                PIC 9(03).                     034700      
000532     02 FILLER                     PIC X(27) VALUE                034800      
000533        "/FILE/EXTR/B21SDMENCON1 ON ".                            034900      
000534     02 WKS-B21-PACK               PIC X(12).                     035000      
000535     02 FILLER                     PIC X(01) VALUE ".".           035100      
000536                                                                  035200      
000537 01  WS-TITLE-B70POSICION.                                        035300      
000538     02 FILLER                     PIC X(01) VALUE "S".           035400      
000539     02 W77-SIS-B70                PIC 9(03).                     035500      
000540     02 FILLER                     PIC X(26) VALUE                035600      
000541        "/FILE/EXTR/B70POSICION ON ".                             035700      
000542     02 WKS-B70-PACK               PIC X(12).                     035800      
000543     02 FILLER                     PIC X(01) VALUE ".".           035900      
000544                                                                  036000      
000545 01  WS-TITLE-B71POSDIAAD1.                                       036100      
000546     02 FILLER                     PIC X(01) VALUE "S".           036200      
000547     02 W77-SIS-B71                PIC 9(03).                     036300      
000548     02 FILLER                     PIC X(27) VALUE                036400      
000549        "/FILE/EXTR/B71POSDIAAD1 ON ".                            036500      
000550     02 WKS-B71-PACK               PIC X(12).                     036600      
000551     02 FILLER                     PIC X(01) VALUE ".".           036700      
000552                                                                  036800      
000553 01  WS-TITLE-B72POSCONTA.                                        036900      
000554     02 FILLER                     PIC X(01) VALUE "S".           037000      
000555     02 W77-SIS-B72                PIC 9(03).                     037100      
000556     02 FILLER                     PIC X(26) VALUE                037200      
000557        "/FILE/EXTR/B72POSCONTA ON ".                             037300      
000558     02 WKS-B72-PACK               PIC X(12).                     037400      
000559     02 FILLER                     PIC X(01) VALUE ".".           037500      
000560                                                                  037600      
000561 01  WS-TITLE-B80EDOCTA.                                          037700      
000562     02 FILLER                     PIC X(01) VALUE "S".           037800      
000563     02 W77-SIS-B80                PIC 9(03).                     037900      
000564     02 FILLER                     PIC X(24) VALUE                038000      
000565        "/FILE/EXTR/B80EDOCTA ON ".                               038100      
000566     02 WKS-B80-PACK               PIC X(12).                     038200      
000567     02 FILLER                     PIC X(01) VALUE ".".           038300      
000568                                                                  038400      
000569                                                                  038500      
000570*================  VARIABLES LIBRERIA DE CONTROL  ===============*038600      
000571                                                                  038700      
000572                                                                  038800      
000573*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000574* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL.".                  038900      
000575*================================================================ 000100      
000576*         ENTRY-POINT CONSISDIA :                               = 000200      
000577*                                                                 000300      
000578* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000579* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000580* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000581* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000582* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000583* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000584* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000585* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000586* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000587* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000588*                                                               = 001400      
000589*================================================================ 001500      
000590                                                                  001600      
000591                                                                  001700      
000592*================================================================ 001800      
000593* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000594*                                                               = 002000      
000595* ENTRADA REQUERIDA :                                           = 002100      
000596*                                                               = 002200      
000597*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000598*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000599*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000600*================================================================ 002600      
000601 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000602    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000603    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000604    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000605    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000606    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000607    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000608    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000609    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000610    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000611    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000612    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000613    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000614    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000615    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000616    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000617    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000618    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000619    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000620    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000621    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000622       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000623       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000624       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000625       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000626*==============================================================   005200      
000627*                                                             =   005300      
000628* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000629*                                                             =   005500      
000630* CAMPOS REQUERIDOS :                                         =   005600      
000631*                                                             =   005700      
000632* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000633* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000634* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000635* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000636*==============================================================   006200      
000637 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000638    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000639    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000640    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000641    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000642                                                                  006800      
000643*==============================================================   006900      
000644*                                                             =   007000      
000645* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000646*                                                             =   007200      
000647* CAMPOS REQUERIDOS :                                         =   007300      
000648*                                                             =   007400      
000649* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000650* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000651* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000652* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000653*==============================================================   007900      
000654 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000655    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000656    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000657    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000658    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000659                                                                  008500      
000660*==============================================================   008600      
000661*                                                             =   008700      
000662* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000663*                                                             =   008900      
000664* CAMPOS REQUERIDOS :                                         =   009000      
000665*                                                             =   009100      
000666* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000667* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000668* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000669* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000670*==============================================================   009600      
000671 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000672    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000673    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000674    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000675    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000676                                                                  010200      
000677*============================================================     010300      
000678* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000679*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000680*                                                           =     010600      
000681*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000682*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000683*                                                           =     010900      
000684*  ENTRADA REQUERIDA.                                       =     011000      
000685*                                                           =     011100      
000686*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000687*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000688*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000689*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000690*============================================================     011600      
000691                                                                  011700      
000692 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000693     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000694     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000695     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000696     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000697                                                                  012300      
000698*=============================================================    012400      
000699*                                                            =    012500      
000700* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000701*             B01-SIS-FECARMOV.                              =    012700      
000702*                                                            =    012800      
000703* ENTRADA REQUERIDAD :                                       =    012900      
000704*                                                            =    013000      
000705*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000706*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000707*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000708*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000709*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000710*=============================================================    013600      
000711                                                                  013700      
000712 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000713     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000714     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000715     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000716     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000717     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000718*================================================================ 014400      
000719*                                                               = 014500      
000720* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000721*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000722*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000723*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000724*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000725*                                                               = 015100      
000726* ENTRADA REQUERIDA :                                           = 015200      
000727*                                                               = 015300      
000728* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000729* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000730* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000731* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000732* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000733*================================================================ 015900      
000734 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000735    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000736    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000737    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000738    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000739    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000740                                                                  016600      
000741*============================================================     016700      
000742*                                                           =     016800      
000743* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000744*                                                           =     017000      
000745* DATOS REQUERIDOS :                                        =     017100      
000746*                                                           =     017200      
000747* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000748* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000749* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000750* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000751* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000752*============================================================     017800      
000753                                                                  017900      
000754 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000755     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000756     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000757     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000758     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000759     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000760                                                                  018600      
000761*============================================================     018700      
000762*                                                           =     018800      
000763* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000764*                                                           =     019000      
000765* DATOS REQUERIDOS :                                        =     019100      
000766*                                                           =     019200      
000767* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000768* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000769* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000770* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000771* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000772*============================================================     019800      
000773                                                                  019900      
000774 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000775     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000776     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000777     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000778     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000779     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000780                                                                  020600      
000781*===============================================================  020700      
000782*                                                              =  020800      
000783* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000784*              MOVIMIENTOS.                                    =  021000      
000785* DATOS REQUERIDOS :                                           =  021100      
000786*                                                              =  021200      
000787* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000788* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000789* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000790* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000791* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000792* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000793*==============================================================   021900      
000794                                                                  022000      
000795 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000796     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000797     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000798     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000799     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000800     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000801     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000802*==============================================================   022800      
000803*                                                             =   022900      
000804* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000805*                                                             =   023100      
000806* CAMPOS REQUERIDOS :                                         =   023200      
000807*                                                             =   023300      
000808* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000809* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000810* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000811* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000812*==============================================================   023800      
000813 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000814    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000815    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000816    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000817    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000818                                                                  024304      
000819*=================================================================024306      
000820*                ENTRY POINT CONSISB01                           =024308      
000821*                                                                =024310      
000822*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000823*                                                                =024314      
000824*  FUNCIONES DISPONIBLES :                                       =024316      
000825*                                                                =024318      
000826*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000827*                                                                =024322      
000828*  PARAMETROS REQUERIDOS                                         =024324      
000829*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000830*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000831*=================================================================024330      
000832                                                                  024332      
000833 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000834     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000835     03 WKS-CON-CSI                PIC 9(02).                     024336      
000836     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000837     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000838        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000839        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000840        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000841        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000842        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000843                                                                  024400      
000844*=================================================================024500      
000845*                ENTRY POINT B02ARCINTER                         =024600      
000846*                                                                =024700      
000847*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000848*                                                                =024900      
000849*  FUNCIONES DISPONIBLES :                                       =025000      
000850*                                                                =025100      
000851*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000852* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000853* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000854* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000855*                                                                =025600      
000856*  PARAMETROS REQUERIDOS                                         =025700      
000857*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000858*                                                                =025900      
000859*=================================================================026000      
000860 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000861     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000862     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000863     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000864     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000865     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000866     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000867     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000868     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000869     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000870     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000871     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000872     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000873     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000874     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000875     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000876     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000877     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000878     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000879     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000880     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000881     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000882     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000883     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000884     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000885     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000886     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000887     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000888     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000889                                                                  029000      
000890*=================================================================029100      
000891*                ENTRY POINT B04SISTEMA                          =029200      
000892*                                                                =029300      
000893*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000894*                                                                =029500      
000895*  FUNCIONES DISPONIBLES :                                       =029600      
000896*                                                                =029700      
000897*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000898*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000899*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000900*                                                                =030100      
000901*  PARAMETROS REQUERIDOS                                         =030200      
000902*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000903*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000904*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000905*                                                                =030600      
000906*=================================================================030700      
000907 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000908     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000909     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000910     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000911     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000912     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000913     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000914     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000915                                                                  031600      
000916*================================================================ 031700      
000917*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000918*                                                               = 031900      
000919*  FUNCION                                                      = 032000      
000920*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000921*   19       ALTAS.                                             = 032200      
000922*   22       BAJAS                                              = 032300      
000923*   37       CAMBIOS.                                           = 032400      
000924*                                                               = 032500      
000925*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000926*                      FECHA DE PROCESO                         = 032700      
000927*                      NUMERO DE PROCESO                        = 032800      
000928*                      FECHA INICIO                             = 032900      
000929*                      REGISTRO INICIAL                         = 033000      
000930*================================================================ 033100      
000931                                                                  033200      
000932 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000933     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000934     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000935     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000936     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000937     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000938     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000939     03 WKS-B05-MIX                PIC 9(08).                     034000      
000940     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000941     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000942     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000943     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000944     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000945     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000946                                                                  034700      
000947                                                                  034800      
000948*================================================================ 034900      
000949*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000950*                                                               = 035100      
000951*  FUNCION                                                      = 035200      
000952*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000953*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000954*                                                               = 035500      
000955*================================================================ 035600      
000956                                                                  035700      
000957 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000958     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000959     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000960     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000961     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000962     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000963     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000964                                                                  036500      
000965*===============================================================  036600      
000966*                                                              =  036700      
000967*         ENTRY-POINT CONSISMEN                                =  036800      
000968*                                                              =  036900      
000969*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000970*                      SISTEMA                                 =  037100      
000971*                                                              =  037200      
000972*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000973*                                                              =  037400      
000974*===============================================================  037500      
000975 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000976     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000977     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000978     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000979     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000980     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000981     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000982     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000983     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000984     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000985     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000986     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000987     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000988     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000989     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000990     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000991        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000992        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000993        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000994        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000995        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000996        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000997        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000998                                                                  039900      
000999*=====================================================            040000      
001000*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
001001*=====================================================            040200      
001002 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
001003     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
001004     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
001005     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
001006                                                                  040700      
001007*=====================================================            040800      
001008*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
001009*=====================================================            041000      
001010 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
001011     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
001012     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
001013     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
001014                                                                  041500      
001015*=====================================================            041600      
001016*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
001017*=====================================================            041800      
001018 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
001019     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
001020     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
001021     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
001022*=====================================================            042300      
001023*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
001024*=====================================================            042500      
001025 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
001026     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
001027     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
001028     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
001029                                                                  043000      
001030*=====================================================            043100      
001031*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
001032*=====================================================            043300      
001033 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
001034     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
001035     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
001036     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
001037                                                                  043800      
001038*=====================================================            043900      
001039*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
001040*=====================================================            044100      
001041 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
001042     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
001043     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
001044     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
001045                                                                  044600      
001046*=====================================================            044700      
001047*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
001048*=====================================================            044900      
001049 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
001050     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
001051     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
001052     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
001053                                                                  045400      
001054*=====================================================            045500      
001055*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
001056*=====================================================            045700      
001057 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
001058     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
001059     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
001060     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
001061                                                                  046200      
001062*=====================================================            046300      
001063*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
001064*=====================================================            046500      
001065 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
001066     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
001067     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
001068     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
001069                                                                  047000      
001070*=====================================================            047100      
001071*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
001072*=====================================================            047300      
001073 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
001074     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
001075     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
001076     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001077                                                                  047800      
001078*=====================================================            047900      
001079*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001080*=====================================================            048100      
001081 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001082     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001083     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001084     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001085                                                                  048600      
001086*=====================================================            048700      
001087*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001088*=====================================================            048900      
001089 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001090     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001091     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001092     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001093                                                                  049400      
001094*=====================================================            049500      
001095*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001096*=====================================================            049700      
001097 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001098     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001099     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001100     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001101     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001102     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001103     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001104     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001105     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001106     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001107     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001108                                                                  050900      
001109*=====================================================            051000      
001110*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001111*=====================================================            051200      
001112 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001113     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001114     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001115     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001116     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001117                                                                  051800      
001118*=====================================================            051900      
001119*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001120*=====================================================            052100      
001121 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001122     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001123     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001124     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001125     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001126                                                                  052700      
001127*=====================================================            052800      
001128*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001129*=====================================================            053000      
001130 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001131     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001132     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001133     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001134     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001135                                                                  053600      
001136*=====================================================            053700      
001137*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001138*=====================================================            053900      
001139 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001140     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001141     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001142     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001143     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001144                                                                  054500      
001145*=====================================================            054600      
001146*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001147*=====================================================            054800      
001148 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001149     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001150     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001151     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001152     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001153                                                                  055400      
001154*=====================================================            055500      
001155*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001156*=====================================================            055700      
001157 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001158     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001159     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001160     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001161     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001162                                                                  056300      
001163*=====================================================            056400      
001164*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001165*=====================================================            056600      
001166 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001167     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001168     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001169     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001170     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001171                                                                  057200      
001172 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001173*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001174                                                                  039000      
001175                                                                  039100      
001176 01  WKS-NOMBD-SALDOS.                                            039200      
001177     03 WKS-BD-SALDOS              PIC X(17).                     039300      
001178     03 FILLER                     PIC X(01) VALUE ".".           039400      
001179                                                                  039500      
001180 01  WKS-BLANCOS                   PIC X(17) VALUE SPACES.        039600      
001181 01  WKS-NULOS                     PIC X(17).                     039700      
001182                                                                  039800      
001183                                                                  039900      
001184*================  VARIABLE PARA LA LIBRERIA LJ   ===============*040000      
001185                                                                  040100      
001186*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001187* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           040200      
001188**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
001189  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
001190  01 MENSAJE-LJ.                                                  100300      
001191     02 SISTEMA-LJ     PIC X(04).                                 100400      
001192     02 FILLER         PIC X VALUE "/".                           100500      
001193     02 PASO-LJ        PIC X(04).                                 100600      
001194     02 FILLER         PIC X VALUE "/".                           100700      
001195     02 MTP-LJ         PIC 9(03).                                 100800      
001196     02 FILLER         PIC X VALUE ":".                           100900      
001197     02 TIPO-LJ        PIC X.                                     101000      
001198     02 FILLER         PIC X VALUE ">".                           101100      
001199     02 CODIGO-LJ      PIC 9(06).                                 101200      
001200     02 FILLER         PIC X VALUE "<".                           101300      
001201     02 TEXTO-LJ       PIC X(250).                                101400      
001202*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001203                                                                  040300      
001204                                                                  040400      
001205*=========== VARIABLES PARA LIBRERIA CONTROL DE VERSIONES =======*040500      
001206                                                                  040600      
001207 01  WKS-LIBID                     PIC X(12).                     040700      
001208 01  WKS-NOMBLIB                   PIC X(72).                     040800      
001209 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             040900      
001210                                                                  041000      
001211                                                                  041100      
001212*====================  ERRORES  DE  DMSII  ======================*041200      
001213                                                                  041300      
001214*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001215* COPY "S151/FORMATO/ERROR/DMSII." FROM 1000 TO 60000.            041400      
001216                                                                  001000      
001217                                                                  002000      
001218                                                                  003000      
001219*=================================================================004000      
001220*==            FORMATO PARA MANEJO DE ERRORES DE DMSII         ===005000      
001221*=================================================================006000      
001222                                                                  007000      
001223                                                                  008000      
001224                                                                  009000      
001225 01 WKS-NOM-BDERR-DMSII            PIC  X(20).                    010000      
001226 77 WKS-ERR-DMSII                  PIC  9(02)    VALUE ZEROS.     011000      
001227 01 WKS-TAB-ERRDMSII.                                             012000      
001228    02 FILLER                      PIC X(20)     VALUE            013000      
001229    "NOTFOUND          01".                                       014000      
001230    02 FILLER                      PIC X(20)     VALUE            015000      
001231    "DUPLICATES        02".                                       016000      
001232    02 FILLER                      PIC X(20)     VALUE            017000      
001233    "DEADLOCK          03".                                       018000      
001234    02 FILLER                      PIC X(20)     VALUE            019000      
001235    "DATAERROR         04".                                       020000      
001236    02 FILLER                      PIC X(20)     VALUE            021000      
001237    "NOTLOCKED         05".                                       022000      
001238    02 FILLER                      PIC X(20)     VALUE            023000      
001239    "KEYCHANGE         06".                                       024000      
001240    02 FILLER                      PIC X(20)     VALUE            025000      
001241    "SYSTEMERROR       07".                                       026000      
001242    02 FILLER                      PIC X(20)     VALUE            027000      
001243    "READONLY          08".                                       028000      
001244    02 FILLER                      PIC X(20)     VALUE            029000      
001245    "IOERROR           09".                                       030000      
001246    02 FILLER                      PIC X(20)     VALUE            031000      
001247    "LIMITERROR        10".                                       032000      
001248    02 FILLER                      PIC X(20)     VALUE            033000      
001249    "OPENERROR         11".                                       034000      
001250    02 FILLER                      PIC X(20)     VALUE            035000      
001251    "CLOSEERROR        12".                                       036000      
001252    02 FILLER                      PIC X(20)     VALUE            037000      
001253    "NORECORD          13".                                       038000      
001254    02 FILLER                      PIC X(20)     VALUE            039000      
001255    "INUSE             14".                                       040000      
001256    02 FILLER                      PIC X(20)     VALUE            041000      
001257    "AUDITERROR        15".                                       042000      
001258    02 FILLER                      PIC X(20)     VALUE            043000      
001259    "ABORT             16".                                       044000      
001260    02 FILLER                      PIC X(20)     VALUE            045000      
001261    "SECURITYERROR     17".                                       046000      
001262    02 FILLER                      PIC X(20)     VALUE            047000      
001263    "VERSIONERROR      18".                                       048000      
001264    02 FILLER                      PIC X(20)     VALUE            049000      
001265    "FATALERROR        19".                                       050000      
001266    02 FILLER                      PIC X(20)     VALUE            051000      
001267    "INTEGRITY ERROR   20".                                       052000      
001268    02 FILLER                      PIC X(20)     VALUE            053000      
001269    "INTLIBERROR       21".                                       054000      
001270 01 WKS-TAB-ERRDMSII-R REDEFINES WKS-TAB-ERRDMSII.                055000      
001271    02 WKS-ELETAB-ERRDMSII         OCCURS 21 TIMES.               056000      
001272       03 WKS-LEY-ERR-DMSII        PIC X(18).                     057000      
001273       03 WKS-NUM-ERR-DMSII        PIC 99.                        058000      
001274                                                                  059000      
001275 01 WKS-ERR-BD                     PIC 9(04).                     059100      
001276 01 WKS-ESTRUCT-BD                 PIC X(17).                     059200      
001277                                                                  060000      
001278*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001279                                                                  041500      
001280                                                                  041600      
001281*=====================  DATOS DEL EQUIPO  =======================*041700      
001282                                                                  041800      
001283 01 WKS-HOST.                                                     041900      
001284    03 WKS-NUMCSI                  PIC 9(02).                     042000      
001285    03 WKS-NOM-HOST                PIC X(10).                     042100      
001286    03 WKS-NOM-CSI                 PIC X(26).                     042200      
001287    03 WKS-LINEA-BATCH             PIC X(05).                     042300      
001288                                                                  042400      
001289*===============  DATOS GENERALES PARA EL PROCESO  ==============*042500      
001290                                                                  042600      
001291 01  WKS-PARAMETROS.                                              042700      
001292     03 WKS-PARAM-SIS-NOMPACK.                                    042800      
001293        05 WKS-PARAM-SIS           PIC 9(03).                     042900      
001294        05 WKS-NOMBRE-PACK         PIC X(12).                     043000      
001295                                                                  043100      
001296                                                                  043200      
001297 01  WKS-FECHA-PROCESO             PIC 9(08).                     043300      
001298 01  WKS-FECHA-PROCESO-R REDEFINES WKS-FECHA-PROCESO.             043400      
001299     03 WKS-FECPRO-AAAAMM          PIC 9(06).                     043500      
001300     03 WKS-FECPRO-AAAAMM-R REDEFINES WKS-FECPRO-AAAAMM.          043600      
001301        05 WKS-FECPRO-AAAA         PIC 9(04).                     043700      
001302        05 WKS-FECPRO-MM           PIC 9(02).                     043800      
001303     03 WKS-FECPRO-DD              PIC 9(02).                     043900      
001304                                                                  044000      
001305                                                                  044100      
001306*=================  FECHA Y HORA DE EJECUCION  ==================*044200      
001307                                                                  044300      
001308 01  WKS-FECHA-EJECUCION-MDA.                                     044400      
001309     03 WKS-FECHA-EJE-MM           PIC 9(02).                     044500      
001310     03 WKS-FECHA-EJE-DD           PIC 9(02).                     044600      
001311     03 WKS-FECHA-EJE-AA           PIC 9(02).                     044700      
001312                                                                  044800      
001313 01  WKS-FECHA-EJECUCION-AMD.                                     044900      
001314     03 WKS-FECHA-EJEC-AA          PIC 9(02).                     045000      
001315     03 WKS-FECHA-EJEC-MM          PIC 9(02).                     045100      
001316     03 WKS-FECHA-EJEC-DD          PIC 9(02).                     045200      
001317                                                                  045300      
001318 01  WKS-FECHA-CORRIDA.                                           045400      
001319     03 WKS-FECHA-CORR-AAAA        PIC 9(04).                     045500      
001320     03 WKS-FECHA-CORR-MM          PIC 9(02).                     045600      
001321     03 WKS-FECHA-CORR-DD          PIC 9(02).                     045700      
001322                                                                  045800      
001323 01  WKS-HORA                      PIC X(08) TYPE NUMERIC-TIME.   045900      
001324                                                                  046000      
001325                                                                  046100      
001326* LINEAS DE IMPRESION.                                            046200      
001327*=====================                                            046300      
001328                                                                  046400      
001329 01  BLANCOS                       PIC X(132) VALUE SPACES.       046500      
001330                                                                  046600      
001331*===================  ENCABEZADOS DEL LISTADO  ==================*046700      
001332                                                                  046800      
001333 01 WLI-LINEA1.                                                   046900      
001334    02  FILLER                     PIC X(04) VALUE SPACES.        047000      
001335    02  FILLER                     PIC X(18) VALUE                047100      
001336        "R/S151-INTEGRACION".                                     047200      
001337    02  FILLER                     PIC X(19) VALUE SPACES.        047300      
001338    02  FILLER                     PIC X(54) VALUE                047400      
001339        "B A N C O  N A C I O N A L  D E  M E X I C O,  S . A .". 047500      
001340    02  FILLER                     PIC X(22) VALUE SPACES.        047600      
001341    02  FILLER                     PIC X(09) VALUE "PAGINA : ".   047700      
001342    02  WLI-PAGINA                 PIC ZZ9.                       047800      
001343    02  FILLER                     PIC X(03) VALUE SPACES.        047900      
001344                                                                  048000      
001345 01 WLI-LINEA2.                                                   048100      
001346    02  FILLER                     PIC X(04) VALUE SPACES.        048200      
001347    02  FILLER                     PIC X(19) VALUE                048300      
001348        "FECHA DE CORRIDA : ".                                    048400      
001349    02  WLI-FECHA.                                                048500      
001350        03 WLI-FECHA-DD            PIC 9(02).                     048600      
001351        03 FILLER                  PIC X(01) VALUE "/".           048700      
001352        03 WLI-FECHA-MM            PIC 9(02).                     048800      
001353        03 FILLER                  PIC X(01) VALUE "/".           048900      
001354        03 WLI-FECHA-AAAA          PIC 9(04).                     049000      
001355    02  FILLER                     PIC X(10) VALUE SPACES.        049100      
001356    02  FILLER                     PIC X(47) VALUE                049200      
001357        "PROCESO DE INTEGRACION DE LA BD11 DEL SISTEMA S".        049300      
001358    02  WLI-SISTEMA                PIC 9(03).                     049400      
001359    02  FILLER                     PIC X(07) VALUE SPACES.        049500      
001360    02  FILLER                     PIC X(19) VALUE                049600      
001361        "FECHA DE PROCESO : ".                                    049700      
001362    02  WLI-FECPRO.                                               049800      
001363        03 WLI-FECPRO-AAAA         PIC 9(04).                     049900      
001364        03 FILLER                  PIC X(01) VALUE "/".           050000      
001365        03 WLI-FECPRO-MM           PIC 9(02).                     050100      
001366        03 FILLER                  PIC X(01) VALUE "/".           050200      
001367        03 WLI-FECPRO-DD           PIC 9(02).                     050300      
001368    02  FILLER                     PIC X(03) VALUE SPACES.        050400      
001369                                                                  050500      
001370 01 WLI-LINEA3.                                                   050600      
001371    02  FILLER                     PIC X(04) VALUE SPACES.        050700      
001372    02  FILLER                     PIC X(21) VALUE                050800      
001373        "HORA DE CORRIDA  :   ".                                  050900      
001374    02  WLI-HORA                   PIC X(08).                     051000      
001375    02  FILLER                     PIC X(99) VALUE SPACES.        051100      
001376                                                                  051200      
001377 01 WLI-LINEA4.                                                   051300      
001378    02  FILLER                     PIC X(04) VALUE SPACES.        051400      
001379    02  FILLER                     PIC X(21) VALUE                051500      
001380        "PROCESO : INTEGRACION".                                  051600      
001381    02  FILLER                     PIC X(22) VALUE SPACES.        051700      
001382    02  FILLER                     PIC X(42) VALUE                051800      
001383        " ** TOTALES DEL PROCESO DE INTEGRACION ** ".             051900      
001384    02  FILLER                     PIC X(43) VALUE SPACES.        052000      
001385                                                                  052100      
001386                                                                  052200      
001387* DETALLES PARA IMPRESION.                                        052300      
001388*=========================                                        052400      
001389                                                                  052500      
001390                                                                  052600      
001391 01 REP-TITULO1.                                                  052700      
001392    02  FILLER                     PIC X(12) VALUE SPACES.        052800      
001393    02  FILLER                     PIC X(27) VALUE                052900      
001394        "TOTAL DE CONTRATOS (B20) : ".                            053000      
001395    02  TOTB20SDOMENCON            PIC Z(08).                     053100      
001396    02  FILLER                     PIC X(20) VALUE SPACES.        053200      
001397    02  FILLER                     PIC X(27) VALUE                053300      
001398        "TOTAL IMPORTE DEL SALDO  : ".                            053400      
001399    02  TOTALB20SDOSD2             PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.053500      
001400    02  FILLER                     PIC X(12) VALUE SPACES.        053600      
001401                                                                  053700      
001402 01 REP-TITULO2.                                                  053800      
001403    02  FILLER                     PIC X(12) VALUE SPACES.        053900      
001404    02  FILLER                     PIC X(27) VALUE                054000      
001405        "TOTAL DE CONTRATOS (B21) : ".                            054100      
001406    02  TOTB21SDMENCON1            PIC Z(08).                     054200      
001407    02  FILLER                     PIC X(20) VALUE SPACES.        054300      
001408    02  FILLER                     PIC X(27) VALUE                054400      
001409        "TOTAL IMPORTE DEL SALDO  : ".                            054500      
001410    02  TOTALB21SDOSD2             PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.054600      
001411    02  FILLER                     PIC X(12) VALUE SPACES.        054700      
001412                                                                  054800      
001413 01 REP-TITULO3.                                                  054900      
001414    02  FILLER                     PIC X(12) VALUE SPACES.        055000      
001415    02  FILLER                     PIC X(27) VALUE                055100      
001416        "TOTAL DE REGISTROS (B70) : ".                            055200      
001417    02  TOTB70POSICION             PIC Z(08).                     055300      
001418    02  FILLER                     PIC X(20) VALUE SPACES.        055400      
001419    02  FILLER                     PIC X(27) VALUE                055500      
001420        "TOTAL IMPORTE DEL SALDO  : ".                            055600      
001421    02  TOTALB70SDOSD2             PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.055700      
001422    02  FILLER                     PIC X(12) VALUE SPACES.        055800      
001423                                                                  055900      
001424 01 REP-TITULO4.                                                  056000      
001425    02  FILLER                     PIC X(12) VALUE SPACES.        056100      
001426    02  FILLER                     PIC X(27) VALUE                056200      
001427        "TOTAL DE REGISTROS (B71) : ".                            056300      
001428    02  TOTB71POSDIAAD1            PIC Z(08).                     056400      
001429    02  FILLER                     PIC X(20) VALUE SPACES.        056500      
001430    02  FILLER                     PIC X(27) VALUE                056600      
001431        "TOTAL IMPORTE DEL SALDO  : ".                            056700      
001432    02  TOTALB71SDOSD2             PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.056800      
001433    02  FILLER                     PIC X(12) VALUE SPACES.        056900      
001434                                                                  057000      
001435 01 REP-TITULO5.                                                  057100      
001436    02  FILLER                     PIC X(12) VALUE SPACES.        057200      
001437    02  FILLER                     PIC X(27) VALUE                057300      
001438        "TOTAL DE REGISTROS (B72) : ".                            057400      
001439    02  TOTB72POSCONTA             PIC Z(08).                     057500      
001440    02  FILLER                     PIC X(20) VALUE SPACES.        057600      
001441    02  FILLER                     PIC X(27) VALUE                057700      
001442        "TOTAL IMPORTE DEL SALDO  : ".                            057800      
001443    02  TOTALB72SDOACT             PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.057900      
001444    02  FILLER                     PIC X(12) VALUE SPACES.        058000      
001445                                                                  058100      
001446 01 REP-TITULO6.                                                  058200      
001447    02  FILLER                     PIC X(12) VALUE SPACES.        058300      
001448    02  FILLER                     PIC X(27) VALUE                058400      
001449        "TOTAL DE CONTRATOS (B80) : ".                            058500      
001450    02  TOTB80EDOCTA               PIC Z(08).                     058600      
001451    02  FILLER                     PIC X(85) VALUE SPACES.        058700      
001452                                                                  058800      
001453                                                                  058900      
001454                                                                  059000      
001455  PROCEDURE DIVISION USING WKS-PARAMETROS.                        059100      
001456*===================                                              059200      
001457                                                                  059300      
001458 00-0000-INICIO SECTION.                                          059400      
001459                                                                  059500      
001460*=========== INICIO DEL PROGRAMA                                  059600      
001461                                                                  059700      
001462 00-0100-CTL-PROCESO.                                             059800      
001463                                                                  059900      
001464                                                                  060000      
001465     MOVE WKS-NOMBRE-PACK         TO  WKS-B20-PACK, WKS-B21-PACK, 060100      
001466                                      WKS-B70-PACK, WKS-B71-PACK, 060200      
001467                                      WKS-B72-PACK, WKS-B80-PACK. 060300      
001468                                                                  060400      
001469     CHANGE ATTRIBUTE TITLE OF "LIB-DISP" TO                      060500      
001470        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          060600      
001471                                                                  060700      
001472     MOVE "S151"  TO  SISTEMA-LJ                                  060800      
001473     MOVE "P360"  TO  PASO-LJ                                     060900      
001474     MOVE "002"   TO  MTP-LJ                                      061000      
001475     MOVE "I"     TO  TIPO-LJ                                     061100      
001476     MOVE 020101  TO  CODIGO-LJ.                                  061200      
001477                                                                  061300      
001478*    MOVE "I"                      TO TIPO-LJ.                    061400      
001479*    MOVE 020101                   TO CODIGO-LJ.                  061500      
001480*    STRING "INICIO PROCESO DE INTEGRACION DE BASE S151BD11SDOS"  061600      
001481*    DELIMITED BY SIZE                                            061700      
001482*    INTO TEXTO-LJ.                                               061800      
001483*    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                     061900      
001484*                                MENSAJE-LJ.                      062000      
001485                                                                  062100      
001486     PERFORM 01-0000-VERIFICACION.                                062200      
001487     PERFORM 02-0000-PROC-STRUCTURE-B20.                          062300      
001488     PERFORM 03-0000-PROC-STRUCTURE-B21.                          062400      
001489     PERFORM 04-0000-PROC-STRUCTURE-B70.                          062500      
001490     PERFORM 05-0000-PROC-STRUCTURE-B71.                          062600      
001491     PERFORM 06-0000-PROC-STRUCTURE-B72.                          062700      
001492     PERFORM 07-0000-PROC-STRUCTURE-B80.                          062800      
001493     PERFORM 09-0000-PROC-IMPRESION.                              062900      
001494     PERFORM 10-0000-PROC-TERMINA.                                063000      
001495                                                                  063100      
001496     STOP RUN.                                                    063200      
001497                                                                  063300      
001498                                                                  063400      
001499*=================================================================063500      
001500*                       APERTURA DE BASE                         =063600      
001501*=================================================================063700      
001502                                                                  063800      
001503 01-0000-VERIFICACION SECTION.                                    063900      
001504                                                                  064000      
001505 01-0100-VERIFICA-DATOS.                                          064100      
001506*=======================                                          064200      
001507                                                                  064300      
001508     PERFORM 01-0110-LIBRERIAS.                                   064400      
001509*    MOVE "I"                      TO TIPO-LJ.                    064500      
001510*    MOVE 020101                   TO CODIGO-LJ.                  064600      
001511*    STRING "INICIO DE PROCESO FECHA : "                          064700      
001512*           WKS-FECHA-PROCESO                                     064800      
001513*    DELIMITED BY SIZE                                            064900      
001514*    INTO TEXTO-LJ.                                               065000      
001515*    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                     065100      
001516*                                MENSAJE-LJ.                      065200      
001517                                                                  065250      
001518     CANCEL "CTLVER".                                             065300      
001519     CANCEL "SOPORTECOMS".                                        065400      
001520                                                                  065500      
001521     PERFORM 01-0130-ABRE-SALDOS.                                 065600      
001522     PERFORM 01-0140-ABRE-LISTADO.                                065700      
001523                                                                  065800      
001524     GO TO 01-0900-EXIT.                                          065900      
001525                                                                  066000      
001526 01-0110-LIBRERIAS.                                               066100      
001527*==================                                               066200      
001528                                                                  066300      
001529     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.066400      
001530     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS"               066500      
001531                                   TO "SOPORTECOMS".              066600      
001532                                                                  066700      
001533     CALL "CSIID OF SOPORTECOMS" USING WKS-HOST.                  066800      
001534                                                                  066900      
001535     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     067000      
001536     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      067100      
001537                                                                  067200      
001538     MOVE "S080BD01CON"            TO WKS-LIBID.                  067300      
001539     CALL "DAME_TIT IN CTLVER" USING  WKS-LIBID, WKS-NOMBLIB      067400      
001540                               GIVING W77-ERR-CTLVER.             067500      
001541     IF W77-ERR-CTLVER = 0                                        067600      
001542        CHANGE ATTRIBUTE TITLE OF "ESTRUCTURA"   TO WKS-NOMBLIB.  067700      
001543                                                                  067800      
001544                                                                  067900      
001545     MOVE "S151L001CTL"            TO WKS-LIBID.                  068000      
001546     CALL "DAME_TIT IN CTLVER" USING  WKS-LIBID, WKS-NOMBLIB      068100      
001547                               GIVING W77-ERR-CTLVER.             068200      
001548     IF W77-ERR-CTLVER = 0                                        068300      
001549        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO WKS-NOMBLIB    068400      
001550     ELSE                                                         068500      
001551        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                068600      
001552               "(S151)S151/OBJECT/L001/CONTROL ON CMEMP".         068700      
001553                                                                  068800      
001554     MOVE WKS-PARAM-SIS            TO WKS-B01-SISTEMA.            068900      
001555                                                                  069000      
001556     MOVE 1                        TO WKS-B01-FUNCION.            069100      
001557                                                                  069200      
001558     MOVE WKS-NUMCSI               TO WKS-B01-CSI.                069300      
001559                                                                  069400      
001560     IF ATTRIBUTE VALUE OF MYSELF = 0                             069500      
001561        CALL "CONSISDIA IN LIB-CONTROL"                           069600      
001562              USING  WKS-S151B01SISDIA                            069700      
001563              GIVING W77-RESULT-LIBCON                            069800      
001564        MOVE WKS-B01-FECPRO               TO WKS-FECHA-PROCESO    069900      
001565     ELSE                                                         070000      
001566        MOVE ATTRIBUTE VALUE OF MYSELF    TO WKS-FECHA-PROCESO.   070100      
001567                                                                  070200      
001568                                                                  070300      
001569 01-0130-ABRE-SALDOS.                                             070400      
001570*====================                                             070500      
001571                                                                  070600      
001572     MOVE WKS-PARAM-SIS            TO WKS-B04-SISTEMA             070700      
001573     MOVE 1                        TO WKS-B04-FUNCION             070800      
001574     CALL "B04SISTEM IN LIB-CONTROL" USING WKS-B04SISTEMA         070900      
001575                                     GIVING W77-RESULT-LIBCON.    071000      
001576                                                                  071100      
001577     IF W77-RESULT-LIBCON = 0                                     071200      
001578      IF WKS-B04-ESTATUS = 3                                      071300      
001579                                                                  071400      
001580*============== CONSULTA EL DATA SET S151B03SISMEN ==============*071500      
001581                                                                  071600      
001582                                                                  071700      
001583       MOVE LOW-VALUES             TO WKS-NULOS                   071800      
001584       MOVE WKS-PARAM-SIS          TO WKS-B03-SISTEMA             071900      
001585       MOVE 1                      TO WKS-B03-FUNCION             072000      
001586       CALL "CONSISMEN IN  LIB-CONTROL" USING WKS-S151B03SISMEN   072100      
001587                                        GIVING W77-RESULT-LIBCON  072200      
001588       IF W77-RESULT-LIBCON = 0                                   072300      
001589         IF WKS-B03-TIPBD = 1 OR 2 OR 5 OR 6                      072400      
001590            MOVE WKS-B03-NOMBDSAL   TO WKS-BD-SALDOS              072500      
001591            IF WKS-BD-SALDOS = WKS-BLANCOS OR                     072600      
001592               WKS-BD-SALDOS = WKS-NULOS                          072700      
001593               MOVE "NO EXISTE EN NOMB. DE BD SALDOS" TO TEXTO-LJ 072800      
001594               MOVE "I"             TO TIPO-LJ                    072900      
001595               MOVE 020205          TO CODIGO-LJ                  073000      
001596               CALL "LJ IN LIB-DISP"   USING CONTADOR-LJ,         073100      
001597                                             MENSAJE-LJ           073200      
001598               CHANGE ATTRIBUTE STATUS OF MYSELF TO -1            073300      
001599            ELSE                                                  073400      
001600              CHANGE ATTRIBUTE TITLE OF SALDOS TO WKS-NOMBD-SALDOS073500      
001601              OPEN UPDATE SALDOS                                  073600      
001602                   ON EXCEPTION                                   073700      
001603                      PERFORM 900000-CHE-STA                      073800      
001604                      CHANGE ATTRIBUTE STATUS OF MYSELF TO -1     073900      
001605         ELSE                                                     074000      
001606           MOVE "I"                TO TIPO-LJ                     074100      
001607           MOVE "EL SISTEMA NO UTILIZA BASE DE SALDOS" TO TEXTO-LJ074200      
001608           MOVE 020205             TO CODIGO-LJ                   074300      
001609           CALL "LJ IN LIB-DISP"   USING CONTADOR-LJ,             074400      
001610                                         MENSAJE-LJ               074500      
001611           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                074600      
001612       ELSE                                                       074700      
001613          IF W77-RESULT-LIBCON = 1                                074800      
001614             MOVE "I"              TO TIPO-LJ                     074900      
001615             MOVE "NO EXITE EL NUMERO DE SISTEMA EN BASE MENSUAL" 075000      
001616                                   TO TEXTO-LJ                    075100      
001617             MOVE 020205           TO CODIGO-LJ                   075200      
001618             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,             075300      
001619                                         MENSAJE-LJ               075400      
001620             CHANGE ATTRIBUTE STATUS OF MYSELF TO -1              075500      
001621          ELSE                                                    075600      
001622             MOVE "I"              TO TIPO-LJ                     075700      
001623             MOVE "ERROR EN BASE DE CONTROL"                      075800      
001624                                   TO TEXTO-LJ                    075900      
001625             MOVE 020205           TO CODIGO-LJ                   076000      
001626             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,             076100      
001627                                         MENSAJE-LJ               076200      
001628             CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.             076300      
001629                                                                  076400      
001630                                                                  076500      
001631 01-0140-ABRE-LISTADO.                                            076600      
001632*=====================                                            076700      
001633                                                                  076800      
001634     ACCEPT WKS-FECHA-EJECUCION-MDA FROM TODAYS-DATE.             076900      
001635     MOVE WKS-FECHA-EJE-MM        TO      WKS-FECHA-EJEC-MM.      077000      
001636     MOVE WKS-FECHA-EJE-DD        TO      WKS-FECHA-EJEC-DD.      077100      
001637     MOVE WKS-FECHA-EJE-AA        TO      WKS-FECHA-EJEC-AA.      077200      
001638                                                                  077300      
001639     MOVE WKS-FECHA-EJECUCION-AMD  TO A2K-FEC-AMD-001.            077400      
001640     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            077500      
001641             A2K-CONV-AMD-TO-CAMD-EXIT                            077600      
001642     MOVE A2K-FEC-CAMD-001         TO WKS-FECHA-CORRIDA.          077700      
001643                                                                  077800      
001644     ACCEPT WKS-HORA               FROM TIME.                     077900      
001645     MOVE WKS-HORA                 TO WLI-HORA.                   078000      
001646     MOVE WKS-NUMCSI               TO NUMCSIREP.                  078100      
001647                                                                  078200      
001648     MOVE WKS-FECHA-CORR-DD        TO WLI-FECHA-DD.               078300      
001649     MOVE WKS-FECHA-CORR-MM        TO WLI-FECHA-MM.               078400      
001650     MOVE WKS-FECHA-CORR-AAAA      TO WLI-FECHA-AAAA.             078500      
001651                                                                  078600      
001652     MOVE ZEROS   TO A2K-FEC-CAMD-001                             078700      
001653     MOVE WKS-FECHA-PROCESO        TO A2K-FEC-CAMD-001            078800      
001654     PERFORM A2K-CONV-CAMD-TO-AMD THRU                            078900      
001655             A2K-CONV-CAMD-TO-AMD-EXIT                            079000      
001656     MOVE A2K-FEC-AMD-001          TO FECHAREPOR.                 079100      
001657                                                                  079200      
001658     MOVE WKS-PARAM-SIS            TO WLI-SISTEMA                 079300      
001659                                      W77-SIS-B20 W77-SIS-B21     079400      
001660                                      W77-SIS-B70 W77-SIS-B71     079500      
001661                                      W77-SIS-B72 W77-SIS-B80     079600      
001662                                      SIST-REP.                   079700      
001663                                                                  079800      
001664     MOVE WKS-FECPRO-AAAA          TO WLI-FECPRO-AAAA.            079900      
001665     MOVE WKS-FECPRO-MM            TO WLI-FECPRO-MM.              080000      
001666     MOVE WKS-FECPRO-DD            TO WLI-FECPRO-DD.              080100      
001667                                                                  080200      
001668     MOVE ZERO                     TO WS-PAGINA.                  080300      
001669     MOVE ATTRIBUTE STACKNO OF MYSELF TO NUMBERMIX.               080400      
001670     SET IMPRESION(USERBACKUPNAME) TO VALUE TRUE.                 080500      
001671     CHANGE ATTRIBUTE TITLE OF IMPRESION TO                       080600      
001672                                   WS-REPORTE-INTEGRACION.        080700      
001673     OPEN OUTPUT IMPRESION.                                       080800      
001674                                                                  080900      
001675                                                                  081000      
001676 01-0900-EXIT.                                                    081100      
001677*=============                                                    081200      
001678     EXIT.                                                        081300      
001679                                                                  081400      
001680                                                                  081500      
001681 02-0000-PROC-STRUCTURE-B20 SECTION.                              081600      
001682                                                                  081700      
001683 02-0100-PROCESO-B20.                                             081800      
001684*====================                                             081900      
001685                                                                  082000      
001686     SET R20SDOMENCON(TITLE) TO WS-TITLE-B20SDOMENCON.            082100      
001687                                                                  082200      
001688                                                                  082300      
001689     SORT A20-SORT ON ASCENDING KEY                               082400      
001690                        A20-R20-AM,                               082500      
001691                        A20-R20-CON                               082600      
001692                        A20-R20-PRD,                              082700      
001693                        A20-R20-INS,                              082800      
001694                        A20-R20-MON                               082900      
001695                        USING  R20SDOMENCON                       083000      
001696                        GIVING R20SDOMENCON                       083100      
001697                        MEMORY SIZE 30 MODULES                    083200      
001698                        DISK   SIZE 90 MODULES.                   083300      
001699                                                                  083400      
001700                                                                  083500      
001701     MOVE 0               TO       WS-EOF-B20.                    083600      
001702                                                                  083700      
001703     OPEN INPUT R20SDOMENCON.                                     083800      
001704                                                                  083900      
001705     READ R20SDOMENCON INTO REG-B20SDOMENCON                      084000      
001706          AT END                                                  084100      
001707             MOVE 1                TO WS-EOF-B20.                 084200      
001708                                                                  084300      
001709                                                                  084400      
001710     PERFORM 02-0150-INTEGRA-SDOMENCON UNTIL WS-EOF-B20 = 1.      084500      
001711     PERFORM 02-0500-FIN-SDOMENCON.                               084600      
001712                                                                  084700      
001713     GO TO 02-0900-EXIT.                                          084800      
001714                                                                  084900      
001715                                                                  085000      
001716 02-0150-INTEGRA-SDOMENCON.                                       085100      
001717*==========================                                       085200      
001718                                                                  085300      
001719                                                                  085400      
001720     CREATE S151B20SDOMENCON.                                     085500      
001721     MOVE R20-SDO-KEYAM            TO B20-SDO-KEYAM.              085600      
001722     MOVE R20-SDO-KEYCON           TO B20-SDO-KEYCON.             085700      
001723     MOVE R20-SDO-KEYPRD           TO B20-SDO-KEYPRD.             085800      
001724     MOVE R20-SDO-KEYINS           TO B20-SDO-KEYINS.             085900      
001725     MOVE R20-SDO-KEYMON           TO B20-SDO-KEYMON.             086000      
001726     MOVE R20-SDO-SUCPRO           TO B20-SDO-SUCPRO.             086100      
001727     MOVE R20-SDO-STAMOV           TO B20-SDO-STAMOV.             086200      
001728     MOVE R20-SDO-APUIMP           TO B20-SDO-APUIMP.             086300      
001729     PERFORM 02-0200-MUEVE-SALDO VARYING W77-C                    086400      
001730                     FROM 1 BY 1 UNTIL W77-C > 10.                086500      
001731     STORE S151B20SDOMENCON                                       086600      
001732           ON EXCEPTION                                           086700      
001733              MOVE "I"             TO TIPO-LJ                     086800      
001734              MOVE 010105          TO CODIGO-LJ                   086900      
001735              MOVE " >> ERROR AL ESCRIBIR S151B20SDOMENCON. << "  087000      
001736                                   TO TEXTO-LJ                    087100      
001737              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,            087200      
001738                                          MENSAJE-LJ              087300      
001739              CALL SYSTEM DMTERMINATE.                            087400      
001740                                                                  087500      
001741     ADD 1                         TO WS-INTEGRADOS-B20.          087600      
001742     ADD R20-SDO-SD(2)             TO WS-TOTALB20SDOSD2.          087700      
001743                                                                  087800      
001744     READ R20SDOMENCON INTO REG-B20SDOMENCON                      087900      
001745          AT END                                                  088000      
001746             MOVE 1                TO WS-EOF-B20.                 088100      
001747                                                                  088200      
001748                                                                  088300      
001749 02-0200-MUEVE-SALDO.                                             088400      
001750*====================                                             088500      
001751                                                                  088600      
001752     MOVE R20-SDO-CNTMOV(W77-C)    TO B20-SDO-CNTMOV(W77-C).      088700      
001753     MOVE R20-SDO-SD(W77-C)        TO B20-SDO-SD(W77-C).          088800      
001754                                                                  088900      
001755                                                                  089000      
001756 02-0500-FIN-SDOMENCON.                                           089100      
001757*======================                                           089200      
001758                                                                  089300      
001759     CLOSE R20SDOMENCON WITH PURGE.                               089400      
001760                                                                  089500      
001761 02-0900-EXIT.                                                    089600      
001762*=============                                                    089700      
001763     EXIT.                                                        089800      
001764                                                                  089900      
001765                                                                  090000      
001766                                                                  090100      
001767 03-0000-PROC-STRUCTURE-B21 SECTION.                              090200      
001768                                                                  090300      
001769 03-0100-PROCESO-B21.                                             090400      
001770*====================                                             090500      
001771                                                                  090600      
001772     SET R21SDMENCON1(TITLE) TO WS-TITLE-B21SDMENCON1.            090700      
001773                                                                  090800      
001774                                                                  090900      
001775     SORT A21-SORT ON ASCENDING KEY                               091000      
001776                        A21-R21-AM,                               091100      
001777                        A21-R21-CON,                              091200      
001778                        A21-R21-PRD,                              091300      
001779                        A21-R21-INS                               091400      
001780                        USING  R21SDMENCON1                       091500      
001781                        GIVING R21SDMENCON1                       091600      
001782                        MEMORY SIZE 30 MODULES                    091700      
001783                        DISK   SIZE 90 MODULES.                   091800      
001784                                                                  091900      
001785                                                                  092000      
001786     MOVE 0               TO       WS-EOF-B21.                    092100      
001787                                                                  092200      
001788     OPEN INPUT R21SDMENCON1.                                     092300      
001789                                                                  092400      
001790     READ R21SDMENCON1 INTO REG-B21SDMENCON1                      092500      
001791          AT END                                                  092600      
001792             MOVE 1                TO WS-EOF-B21.                 092700      
001793                                                                  092800      
001794                                                                  092900      
001795     PERFORM 03-0150-INTEGRA-SDMENCON1 UNTIL WS-EOF-B21 = 1.      093000      
001796     PERFORM 03-0500-FIN-SDMENCON1.                               093100      
001797                                                                  093200      
001798     GO TO 03-0900-EXIT.                                          093300      
001799                                                                  093400      
001800                                                                  093500      
001801 03-0150-INTEGRA-SDMENCON1.                                       093600      
001802*==========================                                       093700      
001803                                                                  093800      
001804                                                                  093900      
001805     CREATE S151B21SDMENCON1.                                     094000      
001806     MOVE R21-SDO-KEYAM            TO B21-SDO-KEYAM.              094100      
001807     MOVE R21-SDO-KEYCON           TO B21-SDO-KEYCON.             094200      
001808     MOVE R21-SDO-KEYPRD           TO B21-SDO-KEYPRD.             094300      
001809     MOVE R21-SDO-KEYINS           TO B21-SDO-KEYINS.             094400      
001810     MOVE R21-SDO-KEYIND           TO B21-SDO-KEYIND.             094500      
001811     PERFORM 03-0200-MUEVE-SALDO VARYING W77-E                    094600      
001812                     FROM 1 BY 1 UNTIL W77-E > 12.                094700      
001813     STORE S151B21SDMENCON1                                       094800      
001814           ON EXCEPTION                                           094900      
001815              MOVE "I"             TO TIPO-LJ                     095000      
001816              MOVE 010105          TO CODIGO-LJ                   095100      
001817              MOVE " >> ERROR AL ESCRIBIR S151B21SDMENCON1. << "  095200      
001818                                   TO TEXTO-LJ                    095300      
001819              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,            095400      
001820                                          MENSAJE-LJ              095500      
001821              CALL SYSTEM DMTERMINATE.                            095600      
001822                                                                  095700      
001823     ADD 1                         TO WS-INTEGRADOS-B21.          095800      
001824     ADD R21-SDO-SD(2)             TO WS-TOTALB21SDOSD2.          095900      
001825                                                                  096000      
001826     READ R21SDMENCON1 INTO REG-B21SDMENCON1                      096100      
001827          AT END                                                  096200      
001828             MOVE 1                TO WS-EOF-B21.                 096300      
001829                                                                  096400      
001830                                                                  096500      
001831                                                                  096600      
001832 03-0200-MUEVE-SALDO.                                             096700      
001833*====================                                             096800      
001834                                                                  096900      
001835     MOVE R21-SDO-CNTMOV(W77-E)    TO B21-SDO-CNTMOV(W77-E).      097000      
001836     MOVE R21-SDO-SD(W77-E)        TO B21-SDO-SD(W77-E).          097100      
001837                                                                  097200      
001838                                                                  097300      
001839 03-0500-FIN-SDMENCON1.                                           097400      
001840*======================                                           097500      
001841                                                                  097600      
001842     CLOSE R21SDMENCON1 WITH PURGE.                               097700      
001843                                                                  097800      
001844 03-0900-EXIT.                                                    097900      
001845*=============                                                    098000      
001846     EXIT.                                                        098100      
001847                                                                  098200      
001848                                                                  098300      
001849 04-0000-PROC-STRUCTURE-B70 SECTION.                              098400      
001850                                                                  098500      
001851 04-0100-PROCESO-B70.                                             098600      
001852*====================                                             098700      
001853                                                                  098800      
001854     SET R70POSICION(TITLE) TO WS-TITLE-B70POSICION.              098900      
001855                                                                  099000      
001856                                                                  099100      
001857     SORT A70-SORT ON ASCENDING KEY                               099200      
001858                        A70-R70-CSI,                              099300      
001859                        A70-R70-FEC,                              099400      
001860                        A70-R70-PRD,                              099500      
001861                        A70-R70-INS,                              099600      
001862                        A70-R70-MON                               099700      
001863                        USING  R70POSICION                        099800      
001864                        GIVING R70POSICION                        099900      
001865                        MEMORY SIZE 30 MODULES                    100000      
001866                        DISK   SIZE 90 MODULES.                   100100      
001867                                                                  100200      
001868                                                                  100300      
001869     MOVE 0               TO       WS-EOF-B70.                    100400      
001870                                                                  100500      
001871     OPEN INPUT R70POSICION.                                      100600      
001872                                                                  100700      
001873     READ R70POSICION INTO REG-B70POSICION                        100800      
001874          AT END                                                  100900      
001875             MOVE 1                TO WS-EOF-B70.                 101000      
001876                                                                  101100      
001877                                                                  101200      
001878     PERFORM 04-0150-INTEGRA-POSICION UNTIL WS-EOF-B70 = 1.       101300      
001879     PERFORM 04-0500-FIN-POSICION.                                101400      
001880                                                                  101500      
001881     GO TO 04-0900-EXIT.                                          101600      
001882                                                                  101700      
001883                                                                  101800      
001884 04-0150-INTEGRA-POSICION.                                        101900      
001885*=========================                                        102000      
001886                                                                  102100      
001887                                                                  102200      
001888     CREATE S151B70POSICION.                                      102300      
001889     MOVE R70-SDO-KEYCSI           TO B70-SDO-KEYCSI.             102400      
001890     MOVE R70-SDO-KEYFEC           TO B70-SDO-KEYFEC.             102500      
001891     MOVE R70-SDO-KEYPRD           TO B70-SDO-KEYPRD.             102600      
001892     MOVE R70-SDO-KEYINS           TO B70-SDO-KEYINS.             102700      
001893     MOVE R70-SDO-KEYMON           TO B70-SDO-KEYMON.             102800      
001894     MOVE R70-SDO-APUIMP           TO B70-SDO-APUIMP.             102900      
001895     PERFORM 04-0200-MUEVE-SALDO VARYING W77-I                    103000      
001896                     FROM 1 BY 1 UNTIL W77-I > 10.                103100      
001897     STORE S151B70POSICION                                        103200      
001898           ON EXCEPTION                                           103300      
001899              MOVE "I"             TO TIPO-LJ                     103400      
001900              MOVE 010105          TO CODIGO-LJ                   103500      
001901              MOVE " >> ERROR AL ESCRIBIR S151B70POSICION. << "   103600      
001902                                   TO TEXTO-LJ                    103700      
001903              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,            103800      
001904                                          MENSAJE-LJ              103900      
001905              CALL SYSTEM DMTERMINATE.                            104000      
001906                                                                  104100      
001907     ADD 1                         TO WS-INTEGRADOS-B70.          104200      
001908     ADD R70-SDO-SD(2)             TO WS-TOTALB70SDOSD2.          104300      
001909                                                                  104400      
001910     READ R70POSICION INTO REG-B70POSICION                        104500      
001911          AT END                                                  104600      
001912             MOVE 1                TO WS-EOF-B70.                 104700      
001913                                                                  104800      
001914                                                                  104900      
001915 04-0200-MUEVE-SALDO.                                             105000      
001916*====================                                             105100      
001917                                                                  105200      
001918     MOVE R70-SDO-CNTMOV(W77-I)    TO B70-SDO-CNTMOV(W77-I).      105300      
001919     MOVE R70-SDO-SD(W77-I)        TO B70-SDO-SD(W77-I).          105400      
001920                                                                  105500      
001921                                                                  105600      
001922 04-0500-FIN-POSICION.                                            105700      
001923*=====================                                            105800      
001924                                                                  105900      
001925     CLOSE R70POSICION WITH PURGE.                                106000      
001926                                                                  106100      
001927                                                                  106200      
001928 04-0900-EXIT.                                                    106300      
001929*=============                                                    106400      
001930     EXIT.                                                        106500      
001931                                                                  106600      
001932                                                                  106700      
001933 05-0000-PROC-STRUCTURE-B71 SECTION.                              106800      
001934                                                                  106900      
001935 05-0100-PROCESO-B71.                                             107000      
001936*====================                                             107100      
001937                                                                  107200      
001938     SET R71POSDIAAD1(TITLE) TO WS-TITLE-B71POSDIAAD1.            107300      
001939                                                                  107400      
001940                                                                  107500      
001941     SORT A71-SORT ON ASCENDING KEY                               107600      
001942                        A71-R71-CSI,                              107700      
001943                        A71-R71-FEC,                              107800      
001944                        A71-R71-PRD,                              107900      
001945                        A71-R71-INS,                              108000      
001946                        A71-R71-MON                               108100      
001947                        USING  R71POSDIAAD1                       108200      
001948                        GIVING R71POSDIAAD1                       108300      
001949                        MEMORY SIZE 30 MODULES                    108400      
001950                        DISK   SIZE 90 MODULES.                   108500      
001951                                                                  108600      
001952                                                                  108700      
001953     MOVE 0               TO       WS-EOF-B71.                    108800      
001954                                                                  108900      
001955     OPEN INPUT R71POSDIAAD1.                                     109000      
001956                                                                  109100      
001957     READ R71POSDIAAD1 INTO REG-B71POSDIAAD1                      109200      
001958          AT END                                                  109300      
001959             MOVE 1                TO WS-EOF-B71.                 109400      
001960                                                                  109500      
001961                                                                  109600      
001962     PERFORM 05-0150-INTEGRA-POSDIAAD1 UNTIL WS-EOF-B71 = 1.      109700      
001963     PERFORM 05-0500-FIN-POSDIAAD1.                               109800      
001964                                                                  109900      
001965     GO TO 05-0900-EXIT.                                          110000      
001966                                                                  110100      
001967                                                                  110200      
001968 05-0150-INTEGRA-POSDIAAD1.                                       110300      
001969*==========================                                       110400      
001970                                                                  110500      
001971                                                                  110600      
001972     CREATE S151B71POSDIAAD1.                                     110700      
001973     MOVE R71-SDO-KEYCSI           TO B71-SDO-KEYCSI.             110800      
001974     MOVE R71-SDO-KEYFEC           TO B71-SDO-KEYFEC.             110900      
001975     MOVE R71-SDO-KEYPRD           TO B71-SDO-KEYPRD.             111000      
001976     MOVE R71-SDO-KEYINS           TO B71-SDO-KEYINS.             111100      
001977     MOVE R71-SDO-KEYMON           TO B71-SDO-KEYMON.             111200      
001978     MOVE R71-SDO-KEYIND           TO B71-SDO-KEYIND.             111300      
001979     PERFORM 05-0200-MUEVE-SALDO VARYING W77-D                    111400      
001980          FROM 1 BY 1 UNTIL W77-D > 12.                           111500      
001981     STORE S151B71POSDIAAD1                                       111600      
001982           ON EXCEPTION                                           111700      
001983              MOVE "I"             TO TIPO-LJ                     111800      
001984              MOVE 010105          TO CODIGO-LJ                   111900      
001985              MOVE " >> ERROR AL ESCRIBIR S151B71POSDIAAD1. << "  112000      
001986                                   TO TEXTO-LJ                    112100      
001987              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,            112200      
001988                                          MENSAJE-LJ              112300      
001989              CALL SYSTEM DMTERMINATE.                            112400      
001990                                                                  112500      
001991     ADD 1                         TO WS-INTEGRADOS-B71.          112600      
001992     ADD R71-SDO-SD(2)             TO WS-TOTALB71SDOSD2.          112700      
001993                                                                  112800      
001994     READ R71POSDIAAD1 INTO REG-B71POSDIAAD1                      112900      
001995          AT END                                                  113000      
001996             MOVE 1                TO WS-EOF-B71.                 113100      
001997                                                                  113200      
001998                                                                  113300      
001999 05-0200-MUEVE-SALDO.                                             113400      
002000*====================                                             113500      
002001                                                                  113600      
002002     MOVE R71-SDO-CNTMOV(W77-D)    TO B71-SDO-CNTMOV(W77-D).      113700      
002003     MOVE R71-SDO-SD(W77-D)        TO B71-SDO-SD(W77-D).          113800      
002004                                                                  113900      
002005                                                                  114000      
002006 05-0500-FIN-POSDIAAD1.                                           114100      
002007*======================                                           114200      
002008                                                                  114300      
002009     CLOSE R71POSDIAAD1 WITH PURGE.                               114400      
002010                                                                  114500      
002011                                                                  114600      
002012 05-0900-EXIT.                                                    114700      
002013*=============                                                    114800      
002014     EXIT.                                                        114900      
002015                                                                  115000      
002016                                                                  115100      
002017 06-0000-PROC-STRUCTURE-B72 SECTION.                              115200      
002018                                                                  115300      
002019 06-0100-PROCESO-B72.                                             115400      
002020*====================                                             115500      
002021                                                                  115600      
002022     SET R72POSCONTA(TITLE) TO WS-TITLE-B72POSCONTA.              115700      
002023                                                                  115800      
002024                                                                  115900      
002025     SORT A72-SORT ON ASCENDING KEY                               116000      
002026                        A72-R72-CSI,                              116100      
002027                        A72-R72-FEC,                              116200      
002028                        A72-R72-BCO,                              116300      
002029                        A72-R72-MON,                              116400      
002030                        A72-R72-FID,                              116500      
002031                        A72-R72-PRD,                              116600      
002032                        A72-R72-INS,                              116700      
002033                        A72-R72-CTA,                              116800      
002034                        A72-R72-CVEC,                             116900      
002035                        A72-R72-SEC                               117000      
002036                        USING  R72POSCONTA                        117100      
002037                        GIVING R72POSCONTA                        117200      
002038                        MEMORY SIZE 30 MODULES                    117300      
002039                        DISK   SIZE 90 MODULES.                   117400      
002040                                                                  117500      
002041                                                                  117600      
002042     MOVE 0               TO       WS-EOF-B72.                    117700      
002043                                                                  117800      
002044     OPEN INPUT R72POSCONTA.                                      117900      
002045                                                                  118000      
002046     READ R72POSCONTA INTO REG-B72POSCONTA                        118100      
002047          AT END                                                  118200      
002048             MOVE 1                TO WS-EOF-B72.                 118300      
002049                                                                  118400      
002050                                                                  118500      
002051     PERFORM 06-0150-INTEGRA-POSCONTA UNTIL WS-EOF-B72 = 1.       118600      
002052     PERFORM 06-0500-FIN-POSCONTA.                                118700      
002053                                                                  118800      
002054     GO TO 06-0900-EXIT.                                          118900      
002055                                                                  119000      
002056                                                                  119100      
002057 06-0150-INTEGRA-POSCONTA.                                        119200      
002058*=========================                                        119300      
002059                                                                  119400      
002060                                                                  119500      
002061     CREATE S151B72POSCONTA.                                      119600      
002062     MOVE R72-SDO-KEYCSI           TO B72-SDO-KEYCSI.             119700      
002063     MOVE R72-SDO-KEYFEC           TO B72-SDO-KEYFEC.             119800      
002064     MOVE R72-SDO-KEYBCO           TO B72-SDO-KEYBCO.             119900      
002065     MOVE R72-SDO-KEYMON           TO B72-SDO-KEYMON.             120000      
002066     MOVE R72-SDO-KEYFID           TO B72-SDO-KEYFID.             120100      
002067     MOVE R72-SDO-KEYPRD           TO B72-SDO-KEYPRD.             120200      
002068     MOVE R72-SDO-KEYINS           TO B72-SDO-KEYINS.             120300      
002069     MOVE R72-SDO-KEYCTA           TO B72-SDO-KEYCTA.             120400      
002070     MOVE R72-SDO-KEYCVEC          TO B72-SDO-KEYCVEC.            120500      
002071     MOVE R72-SDO-KEYSEC           TO B72-SDO-KEYSEC.             120600      
002072     MOVE R72-SDO-NATCTA           TO B72-SDO-NATCTA.             120700      
002073     MOVE R72-SDO-SDOANT           TO B72-SDO-SDOANT.             120800      
002074     MOVE R72-SDO-CARGOS           TO B72-SDO-CARGOS.             120900      
002075     MOVE R72-SDO-ABONOS           TO B72-SDO-ABONOS.             121000      
002076     MOVE R72-SDO-SDOACT           TO B72-SDO-SDOACT.             121100      
002077     STORE S151B72POSCONTA                                        121200      
002078           ON EXCEPTION                                           121300      
002079              MOVE "I"             TO TIPO-LJ                     121400      
002080              MOVE 010105          TO CODIGO-LJ                   121500      
002081              MOVE " >> ERROR AL ESCRIBIR S151B72POSCONTA. << "   121600      
002082                                   TO TEXTO-LJ                    121700      
002083              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,            121800      
002084                                          MENSAJE-LJ              121900      
002085              CALL SYSTEM DMTERMINATE.                            122000      
002086                                                                  122100      
002087     ADD 1                         TO WS-INTEGRADOS-B72.          122200      
002088     ADD R72-SDO-SDOACT            TO WS-TOTALB72SDOACT.          122300      
002089                                                                  122400      
002090     READ R72POSCONTA INTO REG-B72POSCONTA                        122500      
002091          AT END                                                  122600      
002092             MOVE 1                TO WS-EOF-B72.                 122700      
002093                                                                  122800      
002094                                                                  122900      
002095 06-0500-FIN-POSCONTA.                                            123000      
002096*=====================                                            123100      
002097                                                                  123200      
002098     CLOSE R72POSCONTA WITH PURGE.                                123300      
002099                                                                  123400      
002100                                                                  123500      
002101 06-0900-EXIT.                                                    123600      
002102*=============                                                    123700      
002103     EXIT.                                                        123800      
002104                                                                  123900      
002105                                                                  124000      
002106 07-0000-PROC-STRUCTURE-B80 SECTION.                              124100      
002107                                                                  124200      
002108 07-0100-PROCESO-B80.                                             124300      
002109*====================                                             124400      
002110                                                                  124500      
002111     SET R80EDOCTA(TITLE) TO WS-TITLE-B80EDOCTA.                  124600      
002112                                                                  124700      
002113                                                                  124800      
002114     SORT A80-SORT ON ASCENDING KEY                               124900      
002115                        A80-R80-FECCON,                           125000      
002116                        A80-R80-CON,                              125100      
002117                        A80-R80-PRD,                              125200      
002118                        A80-R80-INS                               125300      
002119                        USING  R80EDOCTA                          125400      
002120                        GIVING R80EDOCTA                          125500      
002121                        MEMORY SIZE 30 MODULES                    125600      
002122                        DISK   SIZE 90 MODULES.                   125700      
002123                                                                  125800      
002124                                                                  125900      
002125     MOVE 0               TO       WS-EOF-B80.                    126000      
002126                                                                  126100      
002127     OPEN INPUT R80EDOCTA.                                        126200      
002128                                                                  126300      
002129     READ R80EDOCTA INTO REG-B80EDOCTA                            126400      
002130          AT END                                                  126500      
002131             MOVE 1                TO WS-EOF-B80.                 126600      
002132                                                                  126700      
002133                                                                  126800      
002134     PERFORM 07-0150-INTEGRA-EDOCTA UNTIL WS-EOF-B80 = 1.         126900      
002135     PERFORM 07-0500-FIN-EDOCTA.                                  127000      
002136                                                                  127100      
002137     GO TO 07-0900-EXIT.                                          127200      
002138                                                                  127300      
002139                                                                  127400      
002140 07-0150-INTEGRA-EDOCTA.                                          127500      
002141*=======================                                          127600      
002142                                                                  127700      
002143                                                                  127800      
002144     CREATE S151B80EDOCTA.                                        127900      
002145     MOVE R80-SDO-KEYCON           TO B80-SDO-KEYCON.             128000      
002146     MOVE R80-SDO-FECCON           TO B80-SDO-FECCON.             128100      
002147     MOVE R80-SDO-PRD              TO B80-SDO-PRD.                128200      
002148     MOVE R80-SDO-INS              TO B80-SDO-INS.                128300      
002149     MOVE R80-SDO-FCHINI           TO B80-SDO-FCHINI.             128400      
002150     MOVE R80-SDO-FCHFIN           TO B80-SDO-FCHFIN.             128500      
002151     MOVE R80-SDO-DATOS            TO B80-SDO-DATOS.              128600      
002152     STORE S151B80EDOCTA                                          128700      
002153           ON EXCEPTION                                           128800      
002154              MOVE "I"             TO TIPO-LJ                     128900      
002155              MOVE 010105          TO CODIGO-LJ                   129000      
002156              MOVE " >> ERROR AL ESCRIBIR S151B80EDOCTA. << "     129100      
002157                                   TO TEXTO-LJ                    129200      
002158              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,            129300      
002159                                          MENSAJE-LJ              129400      
002160              CALL SYSTEM DMTERMINATE.                            129500      
002161                                                                  129600      
002162     ADD 1                         TO WS-INTEGRADOS-B80.          129700      
002163                                                                  129800      
002164     READ R80EDOCTA INTO REG-B80EDOCTA                            129900      
002165          AT END                                                  130000      
002166             MOVE 1                TO WS-EOF-B80.                 130100      
002167                                                                  130200      
002168                                                                  130300      
002169 07-0500-FIN-EDOCTA.                                              130400      
002170*===================                                              130500      
002171                                                                  130600      
002172     CLOSE R80EDOCTA WITH PURGE.                                  130700      
002173                                                                  130800      
002174                                                                  130900      
002175 07-0900-EXIT.                                                    131000      
002176*=============                                                    131100      
002177     EXIT.                                                        131200      
002178                                                                  131300      
002179                                                                  131400      
002180                                                                  131500      
002181 08-0000-ERROR-DMSII SECTION.                                     131600      
002182                                                                  131700      
002183*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002184* COPY "S151/FORMATO/ERROR/DMSII." FROM 68000 TO 78000.           131800      
002185 900000-CHE-STA.                                                  068000      
002186     MOVE DMSTATUS(DMCATEGORY)            TO WKS-ERR-DMSII        069000      
002187     MOVE DMSTATUS(DMERRORTYPE)           TO WKS-ERR-BD           069100      
002188     MOVE DMSTATUS(DMSTRUCTURE)           TO WKS-ESTRUCT-BD       069200      
002189                                                                  069300      
002190     IF WKS-ERR-DMSII > ZEROS                                     070000      
002191        STRING  "BASE DATOS  " WKS-NOM-BDERR-DMSII                071000      
002192                "ERROR EN BD " WKS-LEY-ERR-DMSII(WKS-ERR-DMSII)   072000      
002193                           " " WKS-ERR-DMSII                      073000      
002194                "TIPO        " WKS-ERR-BD                         074000      
002195                "ESTRUCTURA  " WKS-ESTRUCT-BD                     075000      
002196        DELIMITED BY SIZE INTO TEXTO-LJ                           076000      
002197        CALL "LJ IN LIB-DISP" USING  CONTADOR-LJ, MENSAJE-LJ.     077000      
002198                                                                  078000      
002199*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002200                                                                  131900      
002201                                                                  132000      
002202                                                                  132100      
002203 09-0000-PROC-IMPRESION SECTION.                                  132200      
002204                                                                  132300      
002205 09-0100-PROCESO-IMPRESION.                                       132400      
002206*==========================                                       132500      
002207                                                                  132600      
002208     IF WS-LINEAS > 55                                            132700      
002209        PERFORM 09-0200-ENCABEZADOS.                              132800      
002210                                                                  132900      
002211                                                                  133000      
002212     MOVE WS-INTEGRADOS-B20        TO TOTB20SDOMENCON.            133100      
002213     MOVE WS-TOTALB20SDOSD2        TO TOTALB20SDOSD2.             133200      
002214     MOVE WS-INTEGRADOS-B21        TO TOTB21SDMENCON1.            133300      
002215     MOVE WS-TOTALB21SDOSD2        TO TOTALB21SDOSD2.             133400      
002216     MOVE WS-INTEGRADOS-B70        TO TOTB70POSICION.             133500      
002217     MOVE WS-TOTALB70SDOSD2        TO TOTALB70SDOSD2.             133600      
002218     MOVE WS-INTEGRADOS-B71        TO TOTB71POSDIAAD1.            133700      
002219     MOVE WS-TOTALB71SDOSD2        TO TOTALB71SDOSD2.             133800      
002220     MOVE WS-INTEGRADOS-B72        TO TOTB72POSCONTA.             133900      
002221     MOVE WS-TOTALB72SDOACT        TO TOTALB72SDOACT.             134000      
002222     MOVE WS-INTEGRADOS-B80        TO TOTB80EDOCTA.               134100      
002223     WRITE LINEA-REP-INTEGRA FROM REP-TITULO1  AFTER 15.          134200      
002224     WRITE LINEA-REP-INTEGRA FROM REP-TITULO2  AFTER 3.           134300      
002225     WRITE LINEA-REP-INTEGRA FROM REP-TITULO3  AFTER 3.           134400      
002226     WRITE LINEA-REP-INTEGRA FROM REP-TITULO4  AFTER 3.           134500      
002227     WRITE LINEA-REP-INTEGRA FROM REP-TITULO5  AFTER 3.           134600      
002228     WRITE LINEA-REP-INTEGRA FROM REP-TITULO6  AFTER 3.           134700      
002229     ADD 30       TO      WS-LINEAS.                              134800      
002230                                                                  134900      
002231     GO TO 09-0900-EXIT.                                          135000      
002232                                                                  135100      
002233 09-0200-ENCABEZADOS.                                             135200      
002234*====================                                             135300      
002235                                                                  135400      
002236     ADD 1                         TO WS-PAGINA.                  135500      
002237     MOVE WS-PAGINA                TO WLI-PAGINA.                 135600      
002238     WRITE LINEA-REP-INTEGRA       FROM BLANCOS AFTER CHANNEL 1.  135700      
002239     WRITE LINEA-REP-INTEGRA       FROM WLI-LINEA1 AFTER 2.       135800      
002240     WRITE LINEA-REP-INTEGRA       FROM WLI-LINEA2 AFTER 1.       135900      
002241     WRITE LINEA-REP-INTEGRA       FROM WLI-LINEA3 AFTER 1.       136000      
002242     WRITE LINEA-REP-INTEGRA       FROM WLI-LINEA4 AFTER 4.       136100      
002243     MOVE SPACES                   TO LINEA-REP-INTEGRA.          136200      
002244     WRITE LINEA-REP-INTEGRA.                                     136300      
002245     MOVE 10                       TO WS-LINEAS.                  136400      
002246                                                                  136500      
002247                                                                  136600      
002248 09-0900-EXIT.                                                    136700      
002249*=============                                                    136800      
002250     EXIT.                                                        136900      
002251                                                                  137000      
002252                                                                  137100      
002253 10-0000-PROC-TERMINA SECTION.                                    137200      
002254                                                                  137300      
002255 10-0100-PROCESO-TERMINA.                                         137400      
002256*========================                                         137500      
002257                                                                  137600      
002258     CLOSE SALDOS                                                 137700      
002259           ON EXCEPTION                                           137800      
002260              NEXT SENTENCE.                                      137900      
002261                                                                  138000      
002262     CLOSE IMPRESION.                                             138100      
002263                                                                  138200      
002264                                                                  138300      
002265     CANCEL "LIB-CONTROL".                                        138400      
002266*    MOVE "I"                      TO TIPO-LJ.                    138500      
002267*    MOVE 020201                   TO CODIGO-LJ.                  138600      
002268*    MOVE "FIN NORMAL DE PROCESO"  TO TEXTO-LJ.                   138700      
002269*    CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ,             138800      
002270*                                         MENSAJE-LJ.             138900      
002271*                                                                 139000      
002272                                                                  139100      
002273                                                                  139200      
002274*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002275*    COPY "S151/CRONOS2K/CPY/PD".                                 139300      
002276** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
002277** Unisys has defined for CRONOS2K project                     ** 000200      
002278** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
002279***************************************************************** 000400      
002280***************************************************************** 000600      
002281** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
002282** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
002283** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
002284** date MMDDCCAA, which is returned into the variable          ** 001000      
002285** A2K-FEC-MDCA-001.                                           ** 001100      
002286***************************************************************** 001200      
002287                                                                  001300      
002288 A2K-ACCEPT-TODAYS-DATE.                                          001400      
002289        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
002290*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
002291        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
002292        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
002293        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
002294        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
002295        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
002296                                                                  002200      
002297 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
002298        EXIT.                                                     002240      
002299                                                                  002500      
002300****************************************************************  002600      
002301** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
002302**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
002303**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
002304**baseyear to add the century to the year part.               **  003000      
002305**INPUT is A2K-FEC-AMD-001                                    **  003100      
002306**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
002307****************************************************************  003300      
002308                                                                  003400      
002309 A2K-CONV-AMD-TO-CAMD.                                            003500      
002310         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
002311         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
002312         IF A2K-FEC-AMD-001 = 0                                   003720      
002313            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
002314         ELSE                                                     003741      
002315          IF A2K-FEC-AMD-001 = 999999                             003742      
002316             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
002317         ELSE                                                     003760      
002318         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
002319                 A2K-OBTAIN-CENTURY-EXIT                          003900      
002320         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
002321         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
002322         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
002323         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
002324                                                                  004400      
002325 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
002326         EXIT.                                                    004600      
002327                                                                  004700      
002328******************************************************************004800      
002329**A2K-CONV-MDA-TO-MDCA.                                         **004900      
002330**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
002331** an eight digit format as MMDDCCAA. It use a                  **005100      
002332** baseyear to add century to the yaer.                         **005200      
002333** INPUT is A2K-FEC-MDA-001                                     **005300      
002334** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
002335                                                                  005500      
002336 A2K-CONV-MDA-TO-MDCA.                                            005600      
002337     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
002338     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
002339     IF A2K-FEC-MDA-001 = 0                                       005820      
002340        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
002341     ELSE                                                         005845      
002342      IF A2K-FEC-MDA-001 = 999999                                 005850      
002343         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
002344     ELSE                                                         005860      
002345     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
002346             A2K-OBTAIN-CENTURY-EXIT                              006000      
002347     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
002348     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
002349     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
002350     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
002351                                                                  006500      
002352 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
002353     EXIT.                                                        006700      
002354                                                                  006800      
002355***************************************************************** 006900      
002356**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
002357**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
002358**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
002359**baseyear to add century to the year.                         ** 007300      
002360**INPUT is A2K-FEC-DMA-001                                     ** 007400      
002361**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
002362                                                                  007600      
002363 A2K-CONV-DMA-TO-DMCA.                                            007700      
002364       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
002365       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
002366       IF  A2K-FEC-DMA-001   = 0                                  007920      
002367          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
002368       ELSE                                                       007945      
002369        IF A2K-FEC-DMA-001 = 999999                               007950      
002370          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
002371       ELSE                                                       007960      
002372       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
002373               A2K-OBTAIN-CENTURY-EXIT                            008100      
002374       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
002375       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
002376       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
002377       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
002378                                                                  008600      
002379 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
002380       EXIT.                                                      008800      
002381                                                                  008900      
002382***************************************************************** 009000      
002383** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
002384** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
002385** a 6 digit format as AAMMDD.                                 ** 009300      
002386** It simply removes the century information in the output     ** 009400      
002387** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
002388** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
002389                                                                  009700      
002390 A2K-CONV-CAMD-TO-AMD.                                            009800      
002391     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
002392     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
002393     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
002394     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
002395                                                                  010300      
002396 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
002397      EXIT.                                                       010500      
002398                                                                  010600      
002399******************************************************************010700      
002400******************************************************************010800      
002401** A2K-CONV-MDCA-TO-MDA.                                        **010900      
002402** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
002403** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
002404** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
002405** INPUT is A2K-FEC-MDCA-001                                    **011300      
002406** OUTPUT is A2K-FEC-MDA-001                                    **011400      
002407                                                                  011500      
002408 A2K-CONV-MDCA-TO-MDA.                                            011600      
002409     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
002410     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
002411     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
002412     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
002413                                                                  012100      
002414 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
002415      EXIT.                                                       012300      
002416                                                                  012400      
002417******************************************************************012500      
002418***************************************************************** 012600      
002419** A2K-CONV-DMCA-TO-DMA.                                        **012700      
002420** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
002421** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
002422** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
002423** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
002424** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
002425                                                                  013300      
002426 A2K-CONV-DMCA-TO-DMA.                                            013400      
002427     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
002428     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
002429     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
002430     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
002431                                                                  013900      
002432 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
002433      EXIT.                                                       014100      
002434                                                                  014200      
002435***************************************************************** 014300      
002436 A2K-CONV-MDCA-TO-CAMD.                                           014400      
002437      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
002438      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
002439      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
002440      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
002441      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
002442 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
002443      EXIT.                                                       015100      
002444***************************************************************** 015200      
002445** This paragraph adds century to an year field which is 9(02) ** 015300      
002446** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
002447** Output is A2K-FEC-CCAA-001.                                 ** 015600      
002448***************************************************************** 015700      
002449 A2K-CONV-AA-TO-CCAA.                                             015800      
002450      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
002451      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
002452              A2K-OBTAIN-CENTURY-EXIT.                            016100      
002453      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
002454 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
002455      EXIT.                                                       016400      
002456***************************************************************** 016500      
002457** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
002458** format.                                                     ** 016700      
002459** Input is A2K-FEC-DMCA-001.                                  ** 016800      
002460** Output is A2K-FEC-CAMD-001.                                 ** 016900      
002461***************************************************************** 017000      
002462 A2K-CONV-DMCA-TO-CAMD.                                           017100      
002463      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
002464      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
002465      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
002466      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
002467      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
002468 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
002469      EXIT.                                                       017800      
002470***************************************************************** 017900      
002471** This paragraph desides the Century to be added depending    ** 018000      
002472** on the base year.                                           ** 018100      
002473** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
002474** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
002475***************************************************************** 018400      
002476 A2K-OBTAIN-CENTURY.                                              018500      
002477      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
002478          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
002479      ELSE                                                        018800      
002480          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
002481 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
002482      EXIT.                                                       019100      
002483                                                                  019200      
002484***************************************************************** 019300      
002485** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
002486**  Format                                                     ** 019500      
002487** Input Is A2K-FEC-CAMD-001                                   ** 019600      
002488** Output Is A2K-FEC-DMCA-001                                  ** 019700      
002489***************************************************************** 019800      
002490 A2K-CONV-CAMD-TO-DMCA.                                           019900      
002491      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
002492      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
002493      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
002494      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
002495      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
002496                                                                  020500      
002497 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
002498      EXIT.                                                       020700      
002499                                                                  020800      
002500******************************************************************020900      
002501******************************************************************021000      
002502 A2K-CONV-AM-TO-CAM.                                              021100      
002503      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
002504      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
002505      IF A2K-FEC-AM-001 = 0                                       021220      
002506         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
002507      ELSE                                                        021245      
002508      IF A2K-FEC-AM-001 = 9999                                    021250      
002509         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
002510      ELSE                                                        021260      
002511      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
002512      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
002513      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
002514              A2K-OBTAIN-CENTURY-EXIT                             021600      
002515      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
002516                                                                  021800      
002517 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
002518      EXIT.                                                       022000      
002519                                                                  022100      
002520******************************************************************022200      
002521******************************************************************022300      
002522 A2K-CONV-CAM-TO-AM.                                              022400      
002523      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
002524      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
002525      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
002526                                                                  022800      
002527 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
002528   EXIT.                                                          023000      
002529                                                                  023100      
002530                                                                  023200      
002531                                                                  023500      
002532*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002533 A2K-CPY-EXIT-PARA.                                               139400      
002534    EXIT.                                                         139500      
002535                                                                  139600      
002536                                                                  139700      
002537                                                                  139800      
002538                                                                  139900      
