000001$SET LINEINFO OPTIMIZE MAP LIST                                   000100      
000002$SET LIST XREF MAP LINEINFO ERRORLIMIT = 100                      000151      
000003*                                                                 000200      
000004 IDENTIFICATION   DIVISION.                                       000300      
000005 PROGRAM-ID.              EXTRACTOR.                              000400      
000006 AUTHOR.                  E. BREACHER.                            000500      
000007 INSTALLATION.            BANAMEX                                 000600      
000008                          INGENIERIA DE SISTEMAS.                 000700      
000009*                                                                 000800      
000010 DATE-WRITTEN.            ENERO DE 1991.                          000900      
000011 DATE-COMPILED.                                                   001000      
000012                                                                  001100      
000013*SECURITY.                COPYRIGHT BY BREACHER CO.               001200      
000014*                                                                 001300      
000015 ENVIRONMENT      DIVISION.                                       001400      
000016                                                                  001500      
000017 CONFIGURATION    SECTION.                                        001600      
000018                                                                  001700      
000019 SOURCE-COMPUTER.         B-7900.                                 001800      
000020 OBJECT-COMPUTER.         B-7900.                                 001900      
000021                                                                  002000      
000022 INPUT-OUTPUT     SECTION.                                        002100      
000023 FILE-CONTROL.                                                    002200      
000024                                                                  002300      
000025     SELECT   SALDOS        ASSIGN TO DISK.                       002400      
000026     SELECT   V00-REPORTE   ASSIGN TO PRINTER.                    002500      
000027                                                                  002551      
000028     SELECT   V00-REPORTE2  ASSIGN TO PRINTER.                    002571      
000029                                                                  002600      
000030 DATA             DIVISION.                                       002700      
000031 FILE             SECTION.                                        002800      
000032                                                                  002900      
000033 FD  SALDOS                                                       003000      
000034     BLOCK CONTAINS 50 RECORDS                                    003100      
000035     VALUE OF TITLE W-ETIQ-SALDOS                                 003200      
000036     DATA RECORD IS REG-SALDOS.                                   003300      
000037                                                                  003400      
000038 01  REG-SALDOS                   PIC X(90).                      003500      
000039                                                                  003600      
000040 FD  V00-REPORTE                                                  003700      
000041     VALUE OF TITLE WKS-TIT-REPORTE                               003800      
000042     DATA RECORD IS LINEA.                                        003900      
000043                                                                  004000      
000044 01  LINEA                        PIC X(132).                     004100      
000045                                                                  004200      
000046 FD  V00-REPORTE2                                                 004251      
000047     VALUE OF TITLE WKS-TIT-REPORTE2.                             004261      
000048                                                                  004271      
000049 01  V00-R00-REPORTE2             PIC X(132).                     004281      
000050                                                                  004300      
000051 DATA-BASE        SECTION.                                        004400      
000052                                                                  004500      
000053 DB  S151BD02ADSALDO ALL.                                         004600      
000054                                                                  004700      
000055 WORKING-STORAGE  SECTION.                                        004800      
000056                                                                  004900      
000057*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000058* COPY   "(S151)S151/FORMATO/DISPLAY.".                           004951      
000059                                                                  000100      
000060*===============================================================* 000200      
000061*         FORMATO PARA DISPLAYS                                 * 000300      
000062*===============================================================* 000400      
000063                                                                  000500      
000064 01 WKS-TIT-REPORTE2.                                             000600      
000065    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000066    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000067    02 FILLER                       PIC X(06) VALUE               000900      
000068                                              "/LIST/".           001000      
000069    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000070    02 FILLER                       PIC X(01) VALUE "/".          001071      
000071    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000072    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000073    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000074    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000075    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000076    02 FILLER                       PIC X(11) VALUE               001600      
000077                                              "/001MSGIMP.".      001700      
000078                                                                  002100      
000079 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000080                                                                  002300      
000081***********************************************************       002400      
000082*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000083***********************************************************       002600      
000084 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000085*8D                                                               002800      
000086 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000087 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000088    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000089    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000090    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000091*8D                                                               003400      
000092 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000093 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000094    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000095    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000096    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000097                                                                  004100      
000098 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000099                                                                  004300      
000100 01 WKS-FECHA-HORA2.                                              004400      
000101    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000102    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000103       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000104       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000105    02 WKS-TIME-MAQ2.                                             004600      
000106       04 WKS-HH-MAQ2                     PIC 9(02).              004700      
000107       04 WKS-MM-MAQ2                     PIC 9(02).              004720      
000108       04 WKS-SS-MAQ2                     PIC 9(02).              004740      
000109       04 WKS-CC-MAQ2                     PIC 9(02).              004800      
000110    02 FILLER                             PIC X(01).              004900      
000111    02 WKS-RESTO2                         PIC X(04).              005000      
000112                                                                  005100      
000113*8D                                                               005200      
000114****************** REPORTE DE MENSAJES *********************      005300      
000115 01 WLI-ENCAB-12.                                                 005400      
000116    03 FILLER                             PIC X(05) VALUE         005500      
000117       "S151-".                                                   005600      
000118    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000119    03 FILLER                             PIC X(15) VALUE         005671      
000120       "-001IMPMENSAJES".                                         005691      
000121    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000122    03 FILLER                             PIC X(34) VALUE         005800      
000123       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000124    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000125    03 FILLER                             PIC X(26) VALUE         006100      
000126       "FECHA DE LA INFORMACION : ".                              006200      
000127    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000128    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000129       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000130       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000131       05  WKS-SLASH1                         PIC X(01).          006356      
000132       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000133       05  WKS-SLASH2                         PIC X(01).          006358      
000134       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000135 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000136 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000137    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000138    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000139    03 FILLER                          PIC X(01).                 006371      
000140    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000141    03 FILLER                          PIC X(01).                 006381      
000142    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000143*8D                                                               006400      
000144 01 WLI-ENCAB-22.                                                 006500      
000145     03 FILLER                          PIC X(11) VALUE           006600      
000146        "F.PROCESO: ".                                            006700      
000147     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000148     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000149     03 WLI-RB-E2-HR-TIT2               PIC 9(02).                007000      
000150     03 FILLER                          PIC X(01) VALUE ":".      007020      
000151     03 WLI-RB-E2-MM-TIT2               PIC 9(02).                007040      
000152     03 FILLER                          PIC X(01) VALUE ":".      007060      
000153     03 WLI-RB-E2-SS-TIT2               PIC 9(02).                007080      
000154     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000155     03 FILLER                          PIC X(24) VALUE           007200      
000156              "IMPRESION MENSAJES DEL S".                         007300      
000157     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000158     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000159     03 FILLER                          PIC X(14) VALUE           007600      
000160        "TIPO PROCESO: ".                                         007700      
000161     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000162*8D                                                               007900      
000163 01 WLI-ENCAB-32.                                                 008000      
000164     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000165*       "VERSION  : ".                                            008200      
000166*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000167     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000168     03 FILLER                     PIC X(07) VALUE                008500      
000169        "HOJA : ".                                                008600      
000170     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000171                                                                  008800      
000172 01 WLI-ENCAB-42.                                                 008900      
000173     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000174     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000175     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000176                                                                  009300      
000177 01 WLI-ENCAB-52.                                                 009400      
000178    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000179    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000180    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000181    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000182                                                                  009900      
000183****************************************************************  010000      
000184*                 CONTADORES DE HOJAS                          *  010100      
000185****************************************************************  010200      
000186                                                                  010300      
000187  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000188*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000189*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000190* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           004971      
000191**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000192  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000193  01 MENSAJE-LJ.                                                  100300      
000194     02 SISTEMA-LJ     PIC X(04).                                 100400      
000195     02 FILLER         PIC X VALUE "/".                           100500      
000196     02 PASO-LJ        PIC X(04).                                 100600      
000197     02 FILLER         PIC X VALUE "/".                           100700      
000198     02 MTP-LJ         PIC 9(03).                                 100800      
000199     02 FILLER         PIC X VALUE ":".                           100900      
000200     02 TIPO-LJ        PIC X.                                     101000      
000201     02 FILLER         PIC X VALUE ">".                           101100      
000202     02 CODIGO-LJ      PIC 9(06).                                 101200      
000203     02 FILLER         PIC X VALUE "<".                           101300      
000204     02 TEXTO-LJ       PIC X(250).                                101400      
000205*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000206                                                                  004991      
000207 77  77-CSI               PIC  9(02)    COMP VALUE ZEROES.        005000      
000208 77  77-EOF               PIC  9(02)    COMP VALUE ZEROES.        005100      
000209 77  77-EOF-SDOS          PIC  9(02)    COMP VALUE ZEROES.        005200      
000210 77  77-ERROR             PIC  9(02)    COMP VALUE ZEROES.        005300      
000211 77  77-HOJA              PIC  9(02)    COMP VALUE ZEROES.        005400      
000212 77  77-LEI-AUXKEY        PIC  9(02)    COMP VALUE ZEROES.        005500      
000213 77  77-LINEA             PIC  9(02)    COMP VALUE 65.            005600      
000214 77  77-VAR               PIC S9(16)V99 COMP VALUE ZEROES.        005700      
000215 77  77-IMPAB             PIC  9(20)    COMP VALUE ZEROES.        005800      
000216 77  77-IMPOR             PIC  9(20)    COMP VALUE ZEROES.        005900      
000217 77  77-IMPFV             PIC  9(06)    COMP VALUE ZEROES.        006000      
000218 77  77-FEC-FECH          PIC  9(06)    COMP VALUE ZEROES.        006100      
000219 77  77-OBL-IMSS          PIC  9(18)V99 COMP VALUE ZEROES.        006200      
000220 77  77-VOL-IMSS          PIC  9(18)V99 COMP VALUE ZEROES.        006300      
000221 77  77-OBL-ISTE          PIC  9(18)V99 COMP VALUE ZEROES.        006400      
000222 77  77-VOL-ISTE          PIC  9(18)V99 COMP VALUE ZEROES.        006500      
000223 77  77-INF-IMSS          PIC  9(18)V99 COMP VALUE ZEROES.        006600      
000224 77  77-INT-IMSS          PIC  9(18)V99 COMP VALUE ZEROES.        006700      
000225 77  77-INF-ISTE          PIC  9(18)V99 COMP VALUE ZEROES.        006800      
000226 77  77-INT-ISTE          PIC  9(18)V99 COMP VALUE ZEROES.        006900      
000227 77  77-OBL-INFO          PIC  9(18)V99 COMP VALUE ZEROES.        007000      
000228 77  77-VOL-INFO          PIC  9(18)V99 COMP VALUE ZEROES.        007100      
000229 77  77-IPR-INFO          PIC  9(18)V99 COMP VALUE ZEROES.        007200      
000230 77  77-IDE-INFO          PIC  9(18)V99 COMP VALUE ZEROES.        007300      
000231 77  77-ANT-IMSS          PIC  9(18)V99 COMP VALUE ZEROES.        007400      
000232 77  77-ANT-ISTE          PIC  9(18)V99 COMP VALUE ZEROES.        007500      
000233 77  77-ANT-INFO          PIC  9(18)V99 COMP VALUE ZEROES.        007600      
000234 77  77-ACT-IMSS          PIC  9(18)V99 COMP VALUE ZEROES.        007700      
000235 77  77-ACT-ISTE          PIC  9(18)V99 COMP VALUE ZEROES.        007800      
000236 77  77-ACT-INFO          PIC  9(18)V99 COMP VALUE ZEROES.        007900      
000237                                                                  008000      
000238*                                                                 008100      
000239******************************************************************008200      
000240*                   CAMPOS AUXILIARES                            *008300      
000241******************************************************************008400      
000242*                                                                 008500      
000243 01  CAMPOS-AUX.                                                  008600      
000244     02  I                PIC 9(02) COMP.                         008700      
000245     02  J                PIC 9(02) COMP.                         008800      
000246                                                                  008900      
000247 01  BASE-FECHA.                                                  009000      
000248     02  AA-BASE          PIC 9(02) COMP.                         009100      
000249     02  MM-BASE          PIC 9(02) COMP.                         009200      
000250     02  DD-BASE          PIC 9(02) COMP.                         009300      
000251*01  FECHA-BASE REDEFINES BASE-FECHA PIC 9(06) COMP.              009400      
000252                                                                  009451      
000253 01  FECHA-BASE.                                                  009471      
000254     02  AA-FBASE1         PIC 9(02) COMP.                        009491      
000255     02  AA-FBASE2         PIC 9(02) COMP.                        009511      
000256     02  MM-FBASE          PIC 9(02) COMP.                        009531      
000257     02  DD-FBASE          PIC 9(02) COMP.                        009551      
000258                                                                  009571      
000259 01  TABLA-SISTEMA.                                               009600      
000260     02  SIST-TABLA OCCURS 20.                                    009700      
000261         03  TAB-SIST     PIC 9(04) COMP.                         009800      
000262                                                                  009900      
000263 01  TABLA-CONTROL.                                               010000      
000264     02  CONTROL-ARCHS OCCURS 20.                                 010100      
000265         03  NOMB-TAB     PIC X(35).                              010200      
000266         03  FPRO-TAB     PIC 9(06) COMP.                         010300      
000267         03  DCRE-TAB     PIC 9(06) COMP.                         010400      
000268         03  HCRE-TAB     PIC 9(06) COMP.                         010500      
000269         03  RLEY-TAB     PIC X(25).                              010600      
000270         03  RLEI-TAB     PIC 9(06) COMP.                         010700      
000271         03  RGRA-TAB     PIC 9(06) COMP.                         010800      
000272                                                                  010900      
000273 01  BLANCOS              PIC X(132) VALUE SPACES.                011000      
000274*                                                                 011100      
000275******************************************************************011200      
000276*                 ETIQUETA DEL ARCHIVO                           *011300      
000277******************************************************************011400      
000278*                                                                 011500      
000279 01  W-ETIQ-SALDOS.                                               011600      
000280     03  FILLER           PIC X(20) VALUE "S151/FILE/CONCENTRA/". 011700      
000281     03  PANO             PIC 9(02).                              011800      
000282     03  PMES             PIC 9(02).                              011900      
000283     03  PDIA             PIC 9(02).                              012000      
000284     03  FILLER           PIC X(01) VALUE ".".                    012100      
000285*                                                                 012200      
000286  01  FECHA-SAR-R.                                                012300      
000287      02  ANO-SAR         PIC 9(02).                              012400      
000288      02  MES-SAR         PIC 9(02).                              012500      
000289      02  DIA-SAR         PIC 9(02).                              012600      
000290  01  FECHA-SAR REDEFINES FECHA-SAR-R PIC 9(06).                  012700      
000291******************************************************************012800      
000292*               TABLA DE MESES                                   *012900      
000293******************************************************************013000      
000294 01 TABLA-DE-MESES.                                               013100      
000295    02  FILLER            PIC XXX VALUE "ENE".                    013200      
000296    02  FILLER            PIC XXX VALUE "FEB".                    013300      
000297    02  FILLER            PIC XXX VALUE "MZO".                    013400      
000298    02  FILLER            PIC XXX VALUE "ABR".                    013500      
000299    02  FILLER            PIC XXX VALUE "MAY".                    013600      
000300    02  FILLER            PIC XXX VALUE "JUN".                    013700      
000301    02  FILLER            PIC XXX VALUE "JUL".                    013800      
000302    02  FILLER            PIC XXX VALUE "AGO".                    013900      
000303    02  FILLER            PIC XXX VALUE "SEP".                    014000      
000304    02  FILLER            PIC XXX VALUE "OCT".                    014100      
000305    02  FILLER            PIC XXX VALUE "NOV".                    014200      
000306    02  FILLER            PIC XXX VALUE "DIC".                    014300      
000307 01  TABLA-MES REDEFINES TABLA-DE-MESES.                          014400      
000308     02  CUALESMESES      OCCURS 12 TIMES.                        014500      
000309         03  CUAL-MES     PIC X(03).                              014600      
000310******************************************************************014700      
000311*                 TABLA DE C.S.I.S                               *014800      
000312******************************************************************014900      
000313*                                                                 015000      
000314 01  CSI-SIGLAS.                                                  015100      
000315     02  FILLER           PIC XXX VALUE "HER".                    015200      
000316     02  FILLER           PIC XXX VALUE "   ".                    015300      
000317     02  FILLER           PIC XXX VALUE "   ".                    015400      
000318     02  FILLER           PIC XXX VALUE "MON".                    015500      
000319     02  FILLER           PIC XXX VALUE "   ".                    015600      
000320     02  FILLER           PIC XXX VALUE "LEO".                    015700      
000321     02  FILLER           PIC XXX VALUE "VER".                    015800      
000322     02  FILLER           PIC XXX VALUE "   ".                    015900      
000323     02  FILLER           PIC XXX VALUE "CEN".                    016000      
000324     02  FILLER           PIC XXX VALUE "VDM".                    016100      
000325 01  SIGLAS-CSI REDEFINES CSI-SIGLAS.                             016200      
000326     02  CSIS-CSIS        OCCURS 10 TIMES.                        016300      
000327         03  CUAL-CSI     PIC X(03).                              016400      
000328                                                                  016500      
000329 01  NOMB-CSIS.                                                   016600      
000330     02  FILLER           PIC X(21) VALUE "C.S.I. HERMOSILLO    ".016700      
000331     02  FILLER           PIC X(21) VALUE "                     ".016800      
000332     02  FILLER           PIC X(21) VALUE "                     ".016900      
000333     02  FILLER           PIC X(21) VALUE "C.S.I. MONTERREY     ".017000      
000334     02  FILLER           PIC X(21) VALUE "                     ".017100      
000335     02  FILLER           PIC X(21) VALUE "C.S.I. CENTRO BAJIO  ".017200      
000336     02  FILLER           PIC X(21) VALUE "C.S.I. VERACRUZ      ".017300      
000337     02  FILLER           PIC X(21) VALUE "                     ".017400      
000338     02  FILLER           PIC X(21) VALUE "C.S.I. MORELOS       ".017500      
000339     02  FILLER           PIC X(21) VALUE "C.S.I. VALLE DE MEX. ".017600      
000340 01  NOMBRE-CSIS REDEFINES NOMB-CSIS.                             017700      
000341     02  N-NOMBRE-CSIS    OCCURS 10 TIMES.                        017800      
000342         03  NOMBRE-CSI   PIC X(21).                              017900      
000343*                                                                 018000      
000344******************************************************************018100      
000345*                    TABLA DE ERRORES                            *018200      
000346******************************************************************018300      
000347*                                                                 018400      
000348 01  TABLA-ERROR.                                                 018500      
000349     02  FILLER   PIC X(23) VALUE "EXCEPTION EN CLIENTES  ".      018600      
000350     02  FILLER   PIC X(23) VALUE "STORE EN CLIENTES      ".      018700      
000351     02  FILLER   PIC X(23) VALUE "TRANSACTION EN CLIENTES".      018800      
000352     02  FILLER   PIC X(23) VALUE "EXCEPTION EN SUCURSAL  ".      018900      
000353     02  FILLER   PIC X(23) VALUE "STORE EN SUCURSALES    ".      019000      
000354     02  FILLER   PIC X(23) VALUE "TRANSACTION EN SUCURSAL".      019100      
000355     02  FILLER   PIC X(23) VALUE "EXCEPTION EN GLOBALES  ".      019200      
000356     02  FILLER   PIC X(23) VALUE "STORE EN GLOBALES      ".      019300      
000357     02  FILLER   PIC X(23) VALUE "TRANSACTION EN GLOBALES".      019400      
000358 01  ERROR-TABLA REDEFINES TABLA-ERROR.                           019500      
000359     02  ERRORES  OCCURS 9.                                       019600      
000360         03  TAB-ERROR PIC X(23).                                 019700      
000361*                                                                 019800      
000362******************************************************************019900      
000363*            TABLA DE ACUMULACION DE CONCEPTOS                   *020000      
000364******************************************************************020100      
000365 01  TABLA-ACUMULACION.                                           020200      
000366     02  TAB-ACUMULACION OCCURS 7 TIMES.                          020300      
000367         03  TAB-SDO-CNC   PIC 9(16)V99 COMP.                     020400      
000368******************************************************************020500      
000369*           REGISTRO DE TRANSFERENCIA DE ARCHIVOS               * 020600      
000370******************************************************************020700      
000371*                                                                 020800      
000372 01  W-REG-SALDOS.                                                020900      
000373     02  W-HEADER-SDOS.                                           021000      
000374         03  SDO-CTL-CVES         PIC X(02).                      021100      
000375         03  SDO-CTL-CSIO         PIC 9(04)       COMP.           021200      
000376         03  FILLER               PIC X(01).                      021300      
000377         03  SDO-CTL-SIST         PIC 9(04)       COMP.           021400      
000378         03  SDO-CTL-FPRO         PIC 9(06).                      021500      
000379         03  SDO-CTL-DCRE         PIC 9(06).                      021600      
000380         03  SDO-CTL-HCRE         PIC 9(06).                      021700      
000381         03  FILLER               PIC X(65).                      021800      
000382     02  W-REG-CLIENTE REDEFINES W-HEADER-SDOS.                   021900      
000383         03  SDO-CTE-CVES         PIC 9(02)       COMP.           022000      
000384         03  SDO-CTE-SIST         PIC 9(04)       COMP.           022100      
000385         03  SDO-CTE-SUC          PIC 9(04)       COMP.           022200      
000386         03  SDO-CTE-MON          PIC 9(02)       COMP.           022300      
000387         03  SDO-CTE-CTAS         PIC 9(08)       COMP.           022400      
000388         03  SDO-CTE-INST         PIC 9(04)       COMP.           022500      
000389         03  SDO-CTE-NOMB         PIC X(30).                      022600      
000390         03  SDO-CTE-SANT         PIC 9(18)V99    COMP.           022700      
000391         03  SDO-CTE-SACT         PIC 9(18)V99    COMP.           022800      
000392         03  SDO-CTE-FECH         PIC 9(06)       COMP.           022900      
000393         03  FILLER               PIC X(25).                      023000      
000394     02  W-REG-SUCURSAL REDEFINES W-HEADER-SDOS.                  023100      
000395         03  SDO-SUC-CVES         PIC 9(02)       COMP.           023200      
000396         03  SDO-SUC-SIST         PIC 9(04)       COMP.           023300      
000397         03  SDO-SUC-SUCU         PIC 9(04)       COMP.           023400      
000398         03  SDO-SUC-MON          PIC 9(02)       COMP.           023500      
000399         03  SDO-SUC-SANT         PIC 9(18)V99    COMP.           023600      
000400         03  SDO-SUC-SACT         PIC 9(18)V99    COMP.           023700      
000401         03  SDO-SUC-FECH         PIC 9(06)       COMP.           023800      
000402         03  FILLER               PIC X(61).                      023900      
000403     02  W-REG-GLOBALES REDEFINES W-HEADER-SDOS.                  024000      
000404         03  SDO-GLO-CVES         PIC 9(02)       COMP.           024100      
000405         03  SDO-GLO-SIST         PIC 9(04)       COMP.           024200      
000406         03  SDO-GLO-MON          PIC 9(02)       COMP.           024300      
000407         03  SDO-GLO-SANT         PIC 9(18)V99    COMP.           024400      
000408         03  SDO-GLO-SACT         PIC 9(18)V99    COMP.           024500      
000409         03  SDO-GLO-FECH         PIC 9(06)       COMP.           024600      
000410         03  FILLER               PIC X(63).                      024700      
000411     02  W-TRAILER-SDOS REDEFINES W-HEADER-SDOS.                  024800      
000412         03  SDO-TRA-CVES         PIC 9(02)       COMP.           024900      
000413         03  SDO-TRA-SIST         PIC 9(04)       COMP.           025000      
000414         03  FILLER               PIC X(02).                      025100      
000415         03  SDO-TRA-REG          PIC 9(06)       COMP.           025200      
000416         03  FILLER               PIC X(82).                      025300      
000417******************************************************************025400      
000418*                 DESCRIPCION DE REPORTE                         *025500      
000419******************************************************************025600      
000420*         NOMBRE EXTERNO DEL LISTADO.                             025700      
000421 01  WKS-TIT-REPORTE.                                             025800      
000422     03 FILLER                                                    025900      
000423                                  PIC X(15) VALUE                 026000      
000424        "S151/LIST/P120/".                                        026100      
000425     03 WKS-CSI-REPORTE           PIC 9(02).                      026200      
000426     03 FILLER                    PIC X(08) VALUE "00/R000/".     026300      
000427     03 WKS-FECHA-REPORTE.                                        026400      
000428        05 WKS-AA-REPORTE         PIC 9(02).                      026500      
000429        05 WKS-MM-REPORTE         PIC 9(02).                      026600      
000430        05 WKS-DD-REPORTE         PIC 9(02).                      026700      
000431     03 FILLER                    PIC X(01) VALUE "/".            026800      
000432     03 WKS-MIX-REPORTE           PIC 9(07).                      026900      
000433     03 FILLER                    PIC X(12) VALUE "/001REPORTE.". 027000      
000434*=========== REGISTRO PARA EL CONTENIDO DEL LISTADO.              027100      
000435 01  COMUN-TITULO-1.                                              027200      
000436     02 FILLER       PIC X(5)  VALUE SPACES.                      027300      
000437     02 TIRE-COM1    PIC X.                                       027400      
000438     02 FILLER       PIC X(6)  VALUE "/S151-".                    027500      
000439     02 SUBS-COM1    PIC 9(3).                                    027600      
000440     02 FILLER       PIC X     VALUE "/".                         027700      
000441     02 PASO-COM1    PIC 9(3).                                    027800      
000442     02 FILLER       PIC X     VALUE "-".                         027900      
000443     02 NURE-COM1    PIC 9(3).                                    028000      
000444     02 FILLER       PIC X(23) VALUE SPACES.                      028100      
000445     02 BNCO-COM1    PIC X(40) VALUE "            B A N A M E X". 028200      
000446     02 FILLER       PIC X(23) VALUE SPACES.                      028300      
000447     02 FILLER       PIC X(10) VALUE "FECHA   : ".                028400      
000448     02 FECH-COM1    PIC 9999/99/99.                              028500      
000449*    MODIFICACION PARA CRONOS-2000-8-DIG.                         028551      
000450     02 FECH-COM1-RED REDEFINES FECH-COM1.                        028553      
000451        03  WKS-FECH-COM1-ANIO1                PIC 99.            028556      
000452        03  WKS-FECH-COM1-ANIO2                PIC 99.            028561      
000453        03  WKS-FECOM-SLASH1                   PIC X(01).         028566      
000454        03  WKS-FECH-COM1-MES                  PIC 99.            028571      
000455        03  WKS-FECOM-SLASH2                   PIC X(01).         028576      
000456        03  WKS-FECH-COM1-DIA                  PIC 99.            028581      
000457                                                                  028586      
000458     02 FILLER       PIC X(3) VALUE SPACES.                       028600      
000459 01  COMUN-TITULO-2.                                              028700      
000460     02 FILLER       PIC X(5)  VALUE SPACES.                      028800      
000461     02 FILLER       PIC X(7)  VALUE "PASO : ".                   028900      
000462     02 PASO-COM2    PIC X(15).                                   029000      
000463     02 FILLER       PIC X(17) VALUE SPACES.                      029100      
000464     02 FILLER       PIC X(42) VALUE                              029200      
000465        "          ADMINISTRADOR DE SALDOS         ".             029300      
000466     02 FILLER       PIC X(23) VALUE SPACES.                      029400      
000467     02 FILLER       PIC X(10) VALUE "PROCESO : ".                029500      
000468     02 TIPO-COM2    PIC X(8).                                    029600      
000469     02 FILLER       PIC X(5)  VALUE SPACES.                      029700      
000470 01  COMUN-TITULO-3.                                              029800      
000471     02 FILLER       PIC X(5)  VALUE SPACES.                      029900      
000472*JRC 02 FILLER       PIC X(10) VALUE "VERSION : ".                030000      
000473*    02 VERS-COM3    PIC 99/99/99.                                030100      
000474*    02 FILLER       PIC X(10) VALUE SPACES.                      030200      
000475     02 TITU-COM3    PIC X(65).                                   030300      
000476     02 FILLER       PIC X(41) VALUE SPACES.                      030400      
000477     02 FILLER       PIC X(13) VALUE "HOJA    :    ".             030500      
000478     02 HOJA-COM3    PIC Z,ZZ9.                                   030600      
000479     02 FILLER       PIC X(5)  VALUE SPACES.                      030700      
000480 01  COMUN-TITULO-41.                                             030800      
000481     02 FILLER       PIC X(5)  VALUE SPACES.                      030900      
000482     02 SGR-COM41    PIC X(5)B VALUE SPACES.                      031000      
000483     02 NUSU-COM41   PIC 9(4).                                    031100      
000484     02 FILLER       PIC X     VALUE SPACES.                      031200      
000485     02 NOSU-COM41   PIC X(40).                                   031300      
000486     02 FILLER       PIC X(86) VALUE SPACES.                      031400      
000487 01  COMUN-TITULO-4.                                              031500      
000488     02 FILLER       PIC X(5)  VALUE SPACES.                      031600      
000489*    02 SGR-COM4     PIC X(5)  VALUE "CSI. ".                     031700      
000490*    02 NUSU-COM4    PIC Z9999.                                   031800      
000491*    02 FILLER       PIC X     VALUE SPACES.                      031900      
000492     02 NOSU-COM4    PIC X(40).                                   032000      
000493     02 FILLER       PIC X(76) VALUE SPACES.                      032100      
000494 01  NOMBRE-RPTE1        PIC X(49) VALUE                          032200      
000495     "CONCENTRACION DE SALDOS                          ".         032300      
000496 01  NOMBRE-RPTE2        PIC X(49) VALUE                          032400      
000497     "SALDOS POR CONCEPTOS                             ".         032500      
000498 01  NOMBRE-RPTE4        PIC X(49) VALUE                          032600      
000499     "CONCENTRACION DE SALDOS PARA BANXICO             ".         032700      
000500 01  NOMBRE-RPTE3        PIC X(49) VALUE                          032800      
000501     "SALDOS S.A.R.                                    ".         032900      
000502                                                                  033000      
000503 01  CONT-ARCH-TITULO-1.                                          033100      
000504     02  FILLER       PIC X(20) VALUE SPACES.                     033200      
000505     02  FILLER       PIC X(22) VALUE "SUC       MON     SIST".   033300      
000506     02  FILLER       PIC X(22) VALUE "       SALDO ANTERIOR ".   033400      
000507     02  FILLER       PIC X(23) VALUE "         SALDO ACTUAL".    033500      
000508     02  FILLER       PIC X(25) VALUE "           VARIACION   ".  033600      
000509 01  CONT-ARCH-TITULO-2.                                          033700      
000510     02  FILLER       PIC X(80) VALUE SPACES.                     033800      
000511     02  FILLER       PIC X(22) VALUE "DE CAJA A BANXICO".        033900      
000512     02  FILLER       PIC X(17) VALUE "A BANXICO".                034000      
000513 01  CONT-ARCH-TITULO-3.                                          034100      
000514     02  FILLER       PIC X(28) VALUE "  SUC.   COBRO INMEDIATO". 034200      
000515     02  FILLER       PIC X(17) VALUE "SALDO DE CAJA".            034300      
000516     02  FILLER       PIC X(17) VALUE "CUOTAS I.M.S.S.".          034400      
000517     02  FILLER       PIC X(19) VALUE "IMPUESTO ADUANAL".         034500      
000518     02  FILLER       PIC X(18) VALUE "CONCENTRACIONES".          034600      
000519     02  FILLER       PIC X(19) VALUE "RETIROS DE CAJA".          034700      
000520     02  FILLER       PIC X(13) VALUE "T  O  T  A  L".            034800      
000521 01  DETALLE.                                                     034900      
000522     02  FILLER           PIC X(19) VALUE SPACES.                 035000      
000523     02  SUCU-DET         PIC ZZZ9B(07).                          035100      
000524     02   MON-DET         PIC X(03).                              035200      
000525     02  FILLER           PIC X(04) VALUE SPACES.                 035300      
000526     02  SIST-DET         PIC ZZZ9B(05).                          035400      
000527     02  SANT-DET         PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(05).            035500      
000528     02  SACT-DET         PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(05).            035600      
000529     02  VARI-DET         PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.                035700      
000530 01  DETALLE-CNC.                                                 035800      
000531     02  FILLER           PIC X(02) VALUE SPACES.                 035900      
000532     02  SUCU-CNC         PIC ZZZ9B(03).                          036000      
000533     02  COB-CNC          PIC ZZZZ,ZZZ,ZZ9.99B(03).               036100      
000534     02  SDO-CNC          PIC ZZZZ,ZZZ,ZZ9.99B(03).               036200      
000535     02  CUO-CNC          PIC ZZZZ,ZZZ,ZZ9.99B(03).               036300      
000536     02  IMP-CNC          PIC ZZZZ,ZZZ,ZZ9.99B(03).               036400      
000537     02  CON-CNC          PIC ZZZZ,ZZZ,ZZ9.99B(03).               036500      
000538     02  RET-CNC          PIC ZZZZ,ZZZ,ZZ9.99B(03).               036600      
000539     02  TOT-CNC          PIC ZZZZ,ZZZ,ZZ9.99.                    036700      
000540 01  DETALLE-TOT-CNC.                                             036800      
000541     02  FILLER           PIC X(09) VALUE " TOTAL".               036900      
000542     02  TCOB-CNC         PIC ZZZZ,ZZZ,ZZ9.99B(03).               037000      
000543     02  TSDO-CNC         PIC ZZZZ,ZZZ,ZZ9.99B(03).               037100      
000544     02  TCUO-CNC         PIC ZZZZ,ZZZ,ZZ9.99B(03).               037200      
000545     02  TIMP-CNC         PIC ZZZZ,ZZZ,ZZ9.99B(03).               037300      
000546     02  TCON-CNC         PIC ZZZZ,ZZZ,ZZ9.99B(03).               037400      
000547     02  TRET-CNC         PIC ZZZZ,ZZZ,ZZ9.99B(03).               037500      
000548     02  TTOT-CNC         PIC ZZZZ,ZZZ,ZZ9.99.                    037600      
000549                                                                  037700      
000550 01  DETALLE-SAR1.                                                037800      
000551     02  FILLER       PIC X(05) VALUE SPACES.                     037900      
000552     02  FILLER       PIC X(40) VALUE "IMPORTE DE ABONOS ".       038000      
000553     02  DET-IMPAB    PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             038100      
000554 01  DETALLE-SAR2.                                                038200      
000555     02  FILLER       PIC X(05) VALUE SPACES.                     038300      
000556     02  FILLER       PIC X(40) VALUE "IMPORTE DE ORDENES ".      038400      
000557     02  DET-IMPOR    PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             038500      
000558 01  DETALLE-SAR3.                                                038600      
000559     02  FILLER       PIC X(05) VALUE SPACES.                     038700      
000560     02  FILLER       PIC X(40) VALUE "IMPORTE FECHA VALOR".      038800      
000561     02  DET-IMPFV    PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             038900      
000562 01  DETALLE-SAR4.                                                039000      
000563     02  FILLER       PIC X(05) VALUE SPACES.                     039100      
000564     02  FILLER       PIC X(40) VALUE "FECHA DE RECEPCION".       039200      
000565     02  DET-FECH-D   PIC ZZ.                                     039300      
000566     02  FILLER       PIC X     VALUE "/".                        039400      
000567     02  DET-FECH-M   PIC XXX.                                    039500      
000568     02  FILLER       PIC X     VALUE "/".                        039600      
000569     02  DET-FECH-A   PIC ZZ.                                     039700      
000570 01  DETALLE-SAR5.                                                039800      
000571     02  FILLER       PIC X(05) VALUE SPACES.                     039900      
000572     02  FILLER       PIC X(40) VALUE "PATRON I.M.S.S.".          040000      
000573     02  DET-OBL-IMSS PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             040100      
000574 01  DETALLE-SAR6.                                                040200      
000575     02  FILLER       PIC X(05) VALUE SPACES.                     040300      
000576     02  FILLER       PIC X(40) VALUE "VOLUNTARIAS I.M.S.S.".     040400      
000577     02  DET-VOL-IMSS PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             040500      
000578 01  DETALLE-SAR7.                                                040600      
000579     02  FILLER       PIC X(05) VALUE SPACES.                     040700      
000580     02  FILLER       PIC X(40) VALUE "PATRON I.S.S.S.T.E.".      040800      
000581     02  DET-OBL-ISTE PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             040900      
000582 01  DETALLE-SAR8.                                                041000      
000583     02  FILLER       PIC X(05) VALUE SPACES.                     041100      
000584     02  FILLER       PIC X(40) VALUE "VOLUNTARIAS I.S.S.S.T.E".  041200      
000585     02  DET-VOL-ISTE PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             041300      
000586 01  DETALLE-SAR9.                                                041400      
000587     02  FILLER       PIC X(05) VALUE SPACES.                     041500      
000588     02  FILLER       PIC X(20) VALUE "ACT. POR INFLACION I".     041600      
000589     02  FILLER       PIC X(20) VALUE ".M.S.S.             ".     041700      
000590     02  DET-INF-IMSS PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             041800      
000591 01  DETALLE-SAR10.                                               041900      
000592     02  FILLER       PIC X(05) VALUE SPACES.                     042000      
000593     02  FILLER       PIC X(20) VALUE "INTERESES, TASA SHCP".     042100      
000594     02  FILLER       PIC X(20) VALUE ". I.M.S.S.          ".     042200      
000595     02  DET-INT-IMSS PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             042300      
000596 01  DETALLE-SAR11.                                               042400      
000597     02  FILLER       PIC X(05) VALUE SPACES.                     042500      
000598     02  FILLER       PIC X(20) VALUE "ACT. POR INFLACION I".     042600      
000599     02  FILLER       PIC X(20) VALUE ".S.S.S.T.E.         ".     042700      
000600     02  DET-INF-ISTE PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             042800      
000601 01  DETALLE-SAR12.                                               042900      
000602     02  FILLER       PIC X(05) VALUE SPACES.                     043000      
000603     02  FILLER       PIC X(20) VALUE "INTERESES, TASA SHCP".     043100      
000604     02  FILLER       PIC X(20) VALUE ". I.S.S.S.T.E.      ".     043200      
000605     02  DET-INT-ISTE PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             043300      
000606 01  DETALLE-SAR13.                                               043400      
000607     02  FILLER       PIC X(05) VALUE SPACES.                     043500      
000608     02  FILLER       PIC X(40) VALUE "PATRON I.N.F.O.N.A.V.I.T.".043600      
000609     02  DET-OBL-INFO PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             043700      
000610 01  DETALLE-SAR14.                                               043800      
000611     02  FILLER       PIC X(05) VALUE SPACES.                     043900      
000612     02  FILLER       PIC X(20) VALUE "VOLUNTARIAS I.N.F.O.".     044000      
000613     02  FILLER       PIC X(20) VALUE "N.A.V.I.T.          ".     044100      
000614     02  DET-VOL-INFO PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             044200      
000615 01  DETALLE-SAR15.                                               044300      
000616     02  FILLER       PIC X(05) VALUE SPACES.                     044400      
000617     02  FILLER       PIC X(20) VALUE "INT. PROVICIONALES. ".     044500      
000618     02  FILLER       PIC X(20) VALUE "I.N.F.O.N.A.V.I.T.  ".     044600      
000619     02  DET-IPR-INFO PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             044700      
000620 01  DETALLE-SAR16.                                               044800      
000621     02  FILLER       PIC X(05) VALUE SPACES.                     044900      
000622     02  FILLER       PIC X(20) VALUE "INT. DEFINITIVOS I.N".     045000      
000623     02  FILLER       PIC X(20) VALUE ".F.O.N.A.V.I.T.     ".     045100      
000624     02  DET-IDE-INFO PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             045200      
000625 01  DETALLE-SAR17.                                               045300      
000626     02  FILLER       PIC X(05) VALUE SPACES.                     045400      
000627     02  FILLER       PIC X(20) VALUE "SALDO ANTERIOR I.M.S".     045500      
000628     02  FILLER       PIC X(20) VALUE ".S.                 ".     045600      
000629     02  DET-ANT-IMSS PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             045700      
000630 01  DETALLE-SAR18.                                               045800      
000631     02  FILLER       PIC X(05) VALUE SPACES.                     045900      
000632     02  FILLER       PIC X(20) VALUE "SALDO ANTERIOR I.S.S".     046000      
000633     02  FILLER       PIC X(20) VALUE ".S.T.E.             ".     046100      
000634     02  DET-ANT-ISTE PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             046200      
000635 01  DETALLE-SAR19.                                               046300      
000636     02  FILLER       PIC X(05) VALUE SPACES.                     046400      
000637     02  FILLER       PIC X(20) VALUE "SALDO ANTERIOR I.N.F".     046500      
000638     02  FILLER       PIC X(20) VALUE ".O.N.A.V.I.T.       ".     046600      
000639     02  DET-ANT-INFO PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             046700      
000640 01  DETALLE-SAR20.                                               046800      
000641     02  FILLER       PIC X(05) VALUE SPACES.                     046900      
000642     02  FILLER       PIC X(20) VALUE "SALDO ACTUAL I.M.S.S".     047000      
000643     02  FILLER       PIC X(20) VALUE ".                   ".     047100      
000644     02  DET-ACT-IMSS PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             047200      
000645 01  DETALLE-SAR21.                                               047300      
000646     02  FILLER       PIC X(05) VALUE SPACES.                     047400      
000647     02  FILLER       PIC X(20) VALUE "SALDO ACTUAL I.S.S.T".     047500      
000648     02  FILLER       PIC X(20) VALUE ".E.                 ".     047600      
000649     02  DET-ACT-ISTE PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             047700      
000650 01  DETALLE-SAR22.                                               047800      
000651     02  FILLER       PIC X(05) VALUE SPACES.                     047900      
000652     02  FILLER       PIC X(20) VALUE "SALDO ACTUAL I.N.F.O".     048000      
000653     02  FILLER       PIC X(20) VALUE ".N.A.V.I.T.         ".     048100      
000654     02  DET-ACT-INFO PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             048200      
000655                                                                  048300      
000656                                                                  048400      
000657                                                                  048500      
000658******************************************************************048600      
000659*                                                                *048700      
000660*                                                                *048800      
000661*                                                                *048900      
000662*         CVES = 01  HEADER                                      *049000      
000663*                10  SDOS POR CLIENTES                           *049100      
000664*                20  SDOS POR SUCURSAL                           *049200      
000665*                30  SDOS GLOBALES                               *049300      
000666*                90  TRAILER                                     *049400      
000667*                                                                *049500      
000668*                                                                *049600      
000669******************************************************************049700      
000670/                                                                 049800      
000671 PROCEDURE        DIVISION.                                       049900      
000672 000-RAIZ.                                                        050000      
000673*---------                                                        050100      
000674                                                                  050200      
000675     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   050251      
000676        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          050256      
000677                                                                  050261      
000678     MOVE "S151"                  TO SISTEMA-LJ                   050266      
000679     MOVE "P120"                  TO PASO-LJ                      050271      
000680                                     WKS-PASO-BACK2               050276      
000681                                     WLI-RB-E1-PASO               050281      
000682*MTP PARA CRONOS-2000  02MTP001                                   050283      
000683     MOVE "009"                   TO MTP-LJ                       050286      
000684     MOVE "I"                     TO TIPO-LJ                      050291      
000685     MOVE 020101                  TO CODIGO-LJ                    050296      
000686                                                                  050300      
000687     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.050351      
000688     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            050361      
000689                                      "SOPORTECOMS".              050371      
000690                                                                  050381      
000691     MOVE "151"                   TO WKS-SIS-BACK2                050382      
000692                                     WLI-RB-E3-SISTEMA2.          050383      
000693                                                                  050384      
000694     PERFORM 1000-ABRE.                                           050400      
000695     PERFORM 2000-PROCESO   UNTIL 77-EOF = 1.                     050500      
000696     MOVE ZEROES                  TO 77-HOJA.                     050600      
000697     MOVE 65                      TO 77-LINEA.                    050700      
000698     PERFORM 3000-CONCEPTOS UNTIL 77-EOF = 2.                     050800      
000699     PERFORM 4000-TOT-B07TOTSDO   THRU 4000-EXIT.                 050900      
000700     PERFORM 5000-TOT-B08GLOSAR   THRU 5000-EXIT.                 051000      
000701     PERFORM 6000-IMPRIME-SAR.                                    051100      
000702     PERFORM 8000-IMPRIME-SAR-TESORERIA.                          051200      
000703     PERFORM 7000-CIERRA.                                         051300      
000704     CLOSE  V00-REPORTE2.                                         051351      
000705     STOP RUN.                                                    051400      
000706                                                                  051500      
000707*MODIFICACION DE CRONOS-2000-8-DIG.                               051551      
000708 1050-FECHA-BASE.                                                 051553      
000709*----------------                                                 051556      
000710     MOVE  AA-FBASE1               TO WKS-FECH-COM1-ANIO1.        051561      
000711     MOVE  AA-FBASE2               TO WKS-FECH-COM1-ANIO2.        051566      
000712     MOVE  "/"                     TO WKS-FECOM-SLASH1.           051571      
000713     MOVE  MM-FBASE                TO WKS-FECH-COM1-MES.          051576      
000714     MOVE  "/"                     TO WKS-FECOM-SLASH2.           051581      
000715     MOVE  DD-FBASE                TO WKS-FECH-COM1-DIA.          051586      
000716                                                                  051591      
000717 1000-FORMATO-DISPLAY.                                            051600      
000718*---------------------                                            051651      
000719                                                                  051661      
000720*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000721*     COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY.".               051671      
000722                                                                  000100      
000723*===============================================================* 000200      
000724*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
000725*         PARA LLAMADO DE DISPLAY                               * 000400      
000726*===============================================================* 000500      
000727                                                                  000600      
000728     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
000729            TO BYFUNCTION.                                        000671      
000730                                                                  000691      
000731     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
000732          USING WKS-DATE-ARRAY2.                                  000800      
000733     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
000734     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
000735     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
000736     MOVE WKS-HH-MAQ2              TO  WLI-RB-E2-HR-TIT2.         001200      
000737     MOVE WKS-MM-MAQ2              TO  WLI-RB-E2-MM-TIT2.         001220      
000738     MOVE WKS-SS-MAQ2              TO  WLI-RB-E2-SS-TIT2.         001240      
000739                                                                  001260      
000740                                                                  001300      
000741     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
000742     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
000743     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
000744                               WKS-TIT-REPORTE2.                  001700      
000745*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
000746*                                  GIVING WKS-COMPILA2.           001900      
000747*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
000748*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
000749*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
000750*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
000751                                                                  002066      
000752*    IF WKS-AAA-VERSION2  < 50                                    002071      
000753*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
000754*    ELSE                                                         002081      
000755*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
000756                                                                  002091      
000757                                                                  002500      
000758*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
000759     OPEN OUTPUT V00-REPORTE2.                                    002700      
000760     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
000761     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
000762                                                                  003000      
000763 000-050-CHECA-SALTO-HOJA2.                                       003051      
000764*==========================                                       003071      
000765    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
000766     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
000767        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
000768     ELSE                                                         003079      
000769        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
000770     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
000771     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
000772     MOVE "/"                     TO WKS-SLASH1.                  003086      
000773     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
000774     MOVE "/"                     TO WKS-SLASH2.                  003088      
000775     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
000776     IF  WKS-NUM-LINEAS2 > 56                                     003091      
000777         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
000778         ADD 1                   TO    W77-CONT-HOJA2             003200      
000779         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
000780         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
000781         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
000782         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
000783         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
000784         MOVE SPACES             TO V00-R00-REPORTE2              003800      
000785         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
000786         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
000787                                                                  004100      
000788 000-030-IMPRIME-MENSAJE.                                         004200      
000789*========================                                         004300      
000790*LP                                                               004400      
000791     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
000792     ADD             2       TO WKS-NUM-LINEAS2                   004600      
000793     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
000794                                                                  004800      
000795*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000796                                                                  051700      
000797/                                                                 051800      
000798 1000-ABRE.                                                       051900      
000799*----------                                                       052000      
000800                                                                  052100      
000801     OPEN UPDATE S151BD02ADSALDO                                  052200      
000802          ON EXCEPTION                                            052300      
000803          MOVE "E"                TO TIPO-LJ                      052356      
000804          MOVE 010105             TO CODIGO-LJ                    052361      
000805          STRING "S151/P120 ERROR AL ACCESAR LA BASE"             052366      
000806                      DELIMITED BY SIZE INTO TEXTO-LJ             052371      
000807          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ     052386      
000808          SET MYSELF(STATUS) TO -1.                               052500      
000809                                                                  052600      
000810     FIND S151BD02ADSALDO                                         052700      
000811       ON EXCEPTION                                               052800      
000812          IF  DMSTATUS(NOTFOUND)                                  052900      
000813              MOVE "E"                TO TIPO-LJ                  052956      
000814              MOVE 010105             TO CODIGO-LJ                052961      
000815              STRING "S151/P120 NO EXISTE REG DE FECHAS "         052966      
000816                          DELIMITED BY SIZE INTO TEXTO-LJ         052971      
000817              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 052986      
000818              SET MYSELF(STATUS) TO -1.                           053100      
000819                                                                  053200      
000820     MOVE B92-CTR-CSI             TO 77-CSI                       053300      
000821                                     WKS-CSI-REPORTE              053400      
000822                                     WKS-TR-CSI2.                 053451      
000823     MOVE B92-CTR-FECHA           TO FECHA-BASE                   053500      
000824                                     WLI-RB-E1-FECHA-INF2.        053551      
000825     MOVE "DIARIO"                TO WLI-RB-E2-TIPO-PROC2.        053571      
000826     PERFORM 1000-FORMATO-DISPLAY.                                053591      
000827     MOVE SPACES             TO WLI-ENCAB-52                      053592      
000828     MOVE "I"                TO WLI-TIPO-LJ                       053593      
000829     MOVE 010401             TO CODIGO-LJ                         053594      
000830     STRING "S151/P120 NO HUBO ERROR AL ACCESAR LA BASE"          053595      
000831                 DELIMITED BY SIZE INTO WLI-TEXTO-LJ              053596      
000832     PERFORM  000-030-IMPRIME-MENSAJE                             053597      
000833     MOVE AA-FBASE2               TO AA-BASE                      053598      
000834     MOVE MM-FBASE                TO MM-BASE                      053599      
000835     MOVE DD-FBASE                TO DD-BASE                      053600      
000836     MOVE AA-BASE                 TO PANO                         053700      
000837                                     WKS-AA-REPORTE.              053751      
000838     MOVE MM-BASE                 TO PMES                         053800      
000839                                     WKS-MM-REPORTE.              053900      
000840     MOVE DD-BASE                 TO PDIA                         054000      
000841                                     WKS-DD-REPORTE.              054100      
000842     OPEN OUTPUT SALDOS.                                          054200      
000843     MOVE ATTRIBUTE STACKNO OF MYSELF TO WKS-MIX-REPORTE.         054251      
000844     SET V00-REPORTE(USERBACKUPNAME)  TO VALUE TRUE.              054300      
000845     OPEN OUTPUT  V00-REPORTE.                                    054305      
000846     MOVE SPACES             TO WLI-ENCAB-52                      054310      
000847     MOVE "I"                TO WLI-TIPO-LJ                       054315      
000848     MOVE 010401             TO CODIGO-LJ                         054320      
000849     STRING "EL NOMBRE DEL REPORTE ES:" WKS-TIT-REPORTE           054325      
000850                 DELIMITED BY SIZE INTO WLI-TEXTO-LJ              054330      
000851     PERFORM  000-030-IMPRIME-MENSAJE                             054335      
000852*    OPEN OUTPUT  V00-REPORTE.                                    054500      
000853                                                                  054700      
000854     MOVE LOW-VALUES              TO W-REG-SALDOS.                054800      
000855     MOVE "HR"                    TO SDO-CTL-CVES.                054900      
000856     MOVE B92-CTR-CSI             TO SDO-CTL-CSIO.                055000      
000857     MOVE ZEROES                  TO SDO-CTL-SIST.                055100      
000858     MOVE B92-CTR-FECHA           TO SDO-CTL-FPRO.                055200      
000859     MOVE ZEROES                  TO SDO-CTL-DCRE                 055300      
000860                                     SDO-CTL-HCRE.                055400      
000861     PERFORM 2400-GRABA-ARCH.                                     055500      
000862     IF  77-LEI-AUXKEY = 1                                        055600      
000863         MOVE SPACES             TO WLI-ENCAB-52                  055651      
000864         MOVE "E"                TO WLI-TIPO-LJ                   055656      
000865         MOVE 010105             TO CODIGO-LJ                     055661      
000866         STRING "S151/P120 NO PUDE GRABAR REG DE FECHAS"          055666      
000867                     DELIMITED BY SIZE INTO WLI-TEXTO-LJ          055671      
000868         MOVE WLI-TIPO-LJ   TO  TIPO-LJ                           055676      
000869         MOVE WLI-TEXTO-LJ  TO  TEXTO-LJ                          055681      
000870         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ      055686      
000871         PERFORM    000-030-IMPRIME-MENSAJE                       055691      
000872         SET MYSELF(STATUS) TO -1.                                055800      
000873                                                                  055900      
000874/                                                                 056000      
000875*                                                                 056100      
000876 2000-PROCESO.                                                    056200      
000877*-------------                                                    056300      
000878                                                                  056400      
000879     FIND NEXT S151B02SDOSUC                                      056500      
000880       ON EXCEPTION                                               056600      
000881          IF  DMSTATUS(NOTFOUND)                                  056700      
000882              MOVE 1      TO 77-EOF                               056800      
000883          ELSE                                                    056900      
000884              MOVE SPACES             TO WLI-ENCAB-52             057000      
000885              MOVE "E"                TO WLI-TIPO-LJ              057051      
000886              MOVE 010105             TO CODIGO-LJ                057056      
000887              STRING "S151/P1120 BASE DA&ADA"                     057061      
000888                          DELIMITED BY SIZE INTO WLI-TEXTO-LJ     057066      
000889              MOVE WLI-TIPO-LJ   TO  TIPO-LJ                      057071      
000890              MOVE WLI-TEXTO-LJ  TO  TEXTO-LJ                     057076      
000891              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 057081      
000892              PERFORM    000-030-IMPRIME-MENSAJE                  057086      
000893              SET MYSELF(STATUS) TO -1.                           057100      
000894                                                                  057200      
000895     IF  77-EOF = 1                                               057300      
000896         NEXT SENTENCE                                            057400      
000897     ELSE                                                         057500      
000898         PERFORM 2100-CARGA-DATOS.                                057600      
000899                                                                  057700      
000900*                                                                 057800      
000901 2100-CARGA-DATOS.                                                057900      
000902*-----------------                                                058000      
000903                                                                  058100      
000904     MOVE B02-SUC-MONEDA          TO SDO-SUC-MON.                 058200      
000905     MOVE B02-SUC-NUMERO          TO SDO-SUC-SUCU.                058300      
000906                                                                  058400      
000907     PERFORM 2200-CARGA-TAB                                       058500      
000908             VARYING I FROM 1 BY 1 UNTIL I > 20.                  058600      
000909                                                                  058700      
000910                                                                  058800      
000911*                                                                 058900      
000912 2200-CARGA-TAB.                                                  059000      
000913*--------------                                                   059100      
000914                                                                  059200      
000915     MOVE B02-SUC-SISTEMA (I)     TO SDO-SUC-SIST                 059300      
000916     MOVE B02-SUC-ACTUAL  (I)     TO SDO-SUC-SACT                 059400      
000917     MOVE B02-SUC-ANTES   (I)     TO SDO-SUC-SANT.                059500      
000918                                                                  059600      
000919     IF  B02-SUC-SISTEMA  (I) > 0                                 059700      
000920         PERFORM 9000-REPORTE                                     059800      
000921         PERFORM 2400-GRABA-ARCH.                                 059900      
000922                                                                  060000      
000923     IF  77-LEI-AUXKEY > 0                                        060100      
000924         MOVE SPACES             TO WLI-ENCAB-52                  060200      
000925         MOVE "E"                TO WLI-TIPO-LJ                   060251      
000926         MOVE 010105             TO CODIGO-LJ                     060256      
000927         STRING "S151/P120 NO PUDE GRABAR REGISTRO "              060261      
000928                     DELIMITED BY SIZE INTO WLI-TEXTO-LJ          060266      
000929         MOVE WLI-TIPO-LJ   TO  TIPO-LJ                           060271      
000930         MOVE WLI-TEXTO-LJ  TO  TEXTO-LJ                          060276      
000931         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ      060281      
000932         PERFORM    000-030-IMPRIME-MENSAJE                       060286      
000933         SET MYSELF(STATUS) TO -1.                                060300      
000934                                                                  060400      
000935*                                                                 060500      
000936 2400-GRABA-ARCH.                                                 060600      
000937*-----------------                                                060700      
000938                                                                  060800      
000939                                                                  060900      
000940                                                                  061000      
000941     WRITE REG-SALDOS FROM W-REG-SALDOS                           061100      
000942                           INVALID KEY                            061200      
000943                                   MOVE 1 TO 77-LEI-AUXKEY.       061300      
000944                                                                  061400      
000945*                                                                 061500      
000946 3000-CONCEPTOS.                                                  061600      
000947                                                                  061700      
000948     FIND NEXT S151B05SDOCNC                                      061800      
000949       ON EXCEPTION                                               061900      
000950          IF  DMSTATUS(NOTFOUND)                                  062000      
000951              MOVE 2              TO 77-EOF                       062100      
000952          ELSE                                                    062200      
000953              MOVE SPACES             TO WLI-ENCAB-52             062300      
000954              MOVE "E"                TO WLI-TIPO-LJ              062351      
000955              MOVE 010105             TO CODIGO-LJ                062356      
000956              STRING "S151/P120 BASE DA&ADA CONCEPTO"             062361      
000957                          DELIMITED BY SIZE INTO WLI-TEXTO-LJ     062366      
000958              MOVE WLI-TIPO-LJ   TO  TIPO-LJ                      062371      
000959              MOVE WLI-TEXTO-LJ  TO  TEXTO-LJ                     062376      
000960              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 062381      
000961              PERFORM    000-030-IMPRIME-MENSAJE                  062386      
000962              SET MYSELF(STATUS) TO -1.                           062400      
000963                                                                  062500      
000964     IF  77-EOF = 2                                               062600      
000965         PERFORM 3200-TOTALES-CNC                                 062700      
000966     ELSE                                                         062800      
000967         PERFORM 3100-REPORTE-CNC.                                062900      
000968                                                                  063000      
000969 3100-REPORTE-CNC.                                                063100      
000970*-----------------                                                063200      
000971                                                                  063300      
000972     IF  77-LINEA > 55                                            063400      
000973         PERFORM 4300-TITULOS-CNC                                 063500      
000974         PERFORM 4400-SUBTITULOS-CNC.                             063600      
000975                                                                  063700      
000976     MOVE B05-CNC-SUCURSAL        TO SUCU-CNC.                    063800      
000977     MOVE B05-CNC-COBRO           TO  COB-CNC.                    063900      
000978     MOVE B05-CNC-SDOCAJA         TO  SDO-CNC.                    064000      
000979     MOVE B05-CNC-IMSS            TO  CUO-CNC.                    064100      
000980     MOVE B05-CNC-ADUANA          TO  IMP-CNC.                    064200      
000981     MOVE B05-CNC-CONBXICO        TO  CON-CNC.                    064300      
000982     MOVE B05-CNC-RETBXICO        TO  RET-CNC.                    064400      
000983     MOVE ZEROES                  TO 77-VAR.                      064500      
000984     COMPUTE 77-VAR = B05-CNC-COBRO    +  B05-CNC-SDOCAJA +       064600      
000985                      B05-CNC-IMSS     +  B05-CNC-ADUANA  +       064700      
000986                      B05-CNC-CONBXICO + B05-CNC-RETBXICO.        064800      
000987     MOVE 77-VAR                  TO TOT-CNC.                     064900      
000988     ADD B05-CNC-COBRO            TO TAB-SDO-CNC(1)               065000      
000989                                     TAB-SDO-CNC(7).              065100      
000990     ADD B05-CNC-SDOCAJA          TO TAB-SDO-CNC(2)               065200      
000991                                     TAB-SDO-CNC(7).              065300      
000992     ADD B05-CNC-IMSS             TO TAB-SDO-CNC(3)               065400      
000993                                     TAB-SDO-CNC(7).              065500      
000994     ADD B05-CNC-ADUANA           TO TAB-SDO-CNC(4)               065600      
000995                                     TAB-SDO-CNC(7).              065700      
000996     ADD B05-CNC-CONBXICO         TO TAB-SDO-CNC(5)               065800      
000997                                     TAB-SDO-CNC(7).              065900      
000998     ADD B05-CNC-RETBXICO         TO TAB-SDO-CNC(6)               066000      
000999                                     TAB-SDO-CNC(7).              066100      
001000     WRITE LINEA FROM DETALLE-CNC AFTER 2.                        066200      
001001     ADD 2                        TO 77-LINEA.                    066300      
001002                                                                  066400      
001003 3200-TOTALES-CNC.                                                066500      
001004     IF  77-LINEA > 55                                            066600      
001005         PERFORM 4300-TITULOS-CNC                                 066700      
001006         PERFORM 4400-SUBTITULOS-CNC.                             066800      
001007                                                                  066900      
001008     MOVE TAB-SDO-CNC(1)          TO TCOB-CNC.                    067000      
001009     MOVE TAB-SDO-CNC(2)          TO TSDO-CNC.                    067100      
001010     MOVE TAB-SDO-CNC(3)          TO TCUO-CNC.                    067200      
001011     MOVE TAB-SDO-CNC(4)          TO TIMP-CNC.                    067300      
001012     MOVE TAB-SDO-CNC(5)          TO TCON-CNC.                    067400      
001013     MOVE TAB-SDO-CNC(6)          TO TRET-CNC.                    067500      
001014     MOVE TAB-SDO-CNC(7)          TO TTOT-CNC.                    067600      
001015     WRITE LINEA FROM DETALLE-TOT-CNC AFTER 3.                    067700      
001016*                                                                 067800      
001017 9000-REPORTE.                                                    067900      
001018*-------------                                                    068000      
001019                                                                  068100      
001020     IF  77-LINEA > 55                                            068200      
001021         PERFORM 4100-TITULOS                                     068300      
001022         PERFORM 4200-SUBTITULOS.                                 068400      
001023     PERFORM 9300-DETALLE.                                        068500      
001024*                                                                 068600      
001025 7000-CIERRA.                                                     068700      
001026*------------                                                     068800      
001027                                                                  068900      
001028     CLOSE SALDOS WITH LOCK.                                      069000      
001029*                                                                 069100      
001030 4100-TITULOS.                                                    069200      
001031*-------------                                                    069300      
001032                                                                  069400      
001033     WRITE LINEA FROM BLANCOS BEFORE CHANNEL 1.                   069500      
001034     MOVE "D"                     TO TIRE-COM1.                   069600      
001035     MOVE  0                      TO SUBS-COM1.                   069700      
001036     MOVE 120                     TO PASO-COM1.                   069800      
001037     MOVE 1                       TO NURE-COM1.                   069900      
001038     PERFORM 1050-FECHA-BASE.                                     070000      
001039     WRITE LINEA FROM COMUN-TITULO-1 BEFORE 2.                    070100      
001040     MOVE "CONCENTRACION  "       TO PASO-COM2.                   070200      
001041     MOVE "DIARIO "               TO TIPO-COM2.                   070300      
001042     WRITE LINEA FROM COMUN-TITULO-2 BEFORE 2.                    070400      
001043*    MOVE 920120                  TO VERS-COM3.                   070500      
001044     MOVE NOMBRE-RPTE1            TO TITU-COM3.                   070600      
001045     ADD  1                       TO 77-HOJA.                     070700      
001046     MOVE 77-HOJA                 TO HOJA-COM3.                   070800      
001047     WRITE LINEA FROM COMUN-TITULO-3 BEFORE 3.                    070900      
001048     MOVE 6                       TO 77-LINEA.                    071000      
001049*                                                                 071100      
001050 4200-SUBTITULOS.                                                 071200      
001051*---------------                                                  071300      
001052                                                                  071400      
001053*    MOVE 00                      TO NUSU-COM4.                   071500      
001054     MOVE NOMBRE-CSI(77-CSI)      TO NOSU-COM4.                   071600      
001055     WRITE LINEA FROM COMUN-TITULO-4 BEFORE 1.                    071700      
001056     WRITE LINEA FROM BLANCOS BEFORE 1.                           071800      
001057     WRITE LINEA FROM CONT-ARCH-TITULO-1 BEFORE 1.                071900      
001058     WRITE LINEA FROM BLANCOS BEFORE 1.                           072000      
001059                                                                  072100      
001060     ADD  5                       TO 77-LINEA.                    072200      
001061*                                                                 072300      
001062 4300-TITULOS-CNC.                                                072400      
001063*-----------------                                                072500      
001064                                                                  072600      
001065     WRITE LINEA FROM BLANCOS BEFORE CHANNEL 1.                   072700      
001066     MOVE "D"                     TO TIRE-COM1.                   072800      
001067     MOVE  0                      TO SUBS-COM1.                   072900      
001068     MOVE 120                     TO PASO-COM1.                   073000      
001069     MOVE 2                       TO NURE-COM1.                   073100      
001070     PERFORM 1050-FECHA-BASE.                                     073200      
001071     WRITE LINEA FROM COMUN-TITULO-1 BEFORE 2.                    073300      
001072     MOVE "CONCEPTOS"             TO PASO-COM2.                   073400      
001073     MOVE "DIARIO "               TO TIPO-COM2.                   073500      
001074     WRITE LINEA FROM COMUN-TITULO-2 BEFORE 2.                    073600      
001075*JRC MOVE 920120                  TO VERS-COM3.                   073700      
001076     MOVE NOMBRE-RPTE2            TO TITU-COM3.                   073800      
001077     ADD  1                       TO 77-HOJA.                     073900      
001078     MOVE 77-HOJA                 TO HOJA-COM3.                   074000      
001079     WRITE LINEA FROM COMUN-TITULO-3 BEFORE 3.                    074100      
001080     MOVE 6                       TO 77-LINEA.                    074200      
001081*                                                                 074300      
001082 4400-SUBTITULOS-CNC.                                             074400      
001083*---------------                                                  074500      
001084                                                                  074600      
001085*    MOVE 00                      TO NUSU-COM4.                   074700      
001086     MOVE NOMBRE-CSI(77-CSI)      TO NOSU-COM4.                   074800      
001087     WRITE LINEA FROM COMUN-TITULO-4 BEFORE 1.                    074900      
001088     WRITE LINEA FROM BLANCOS BEFORE 1.                           075000      
001089     WRITE LINEA FROM CONT-ARCH-TITULO-3 BEFORE 1.                075100      
001090     WRITE LINEA FROM CONT-ARCH-TITULO-2 BEFORE 1.                075200      
001091     WRITE LINEA FROM BLANCOS BEFORE 1.                           075300      
001092                                                                  075400      
001093     ADD  5                       TO 77-LINEA.                    075500      
001094*                                                                 075600      
001095 9300-DETALLE.                                                    075700      
001096*-------------                                                    075800      
001097                                                                  075900      
001098     MOVE SDO-SUC-SUCU            TO SUCU-DET                     076000      
001099     IF  SDO-SUC-MON = 1                                          076100      
001100         MOVE "NAC"               TO  MON-DET                     076200      
001101     ELSE                                                         076300      
001102         MOVE "EXT"               TO  MON-DET.                    076400      
001103     MOVE SDO-SUC-SIST            TO SIST-DET                     076500      
001104     MOVE SDO-SUC-SANT            TO SANT-DET                     076600      
001105     MOVE SDO-SUC-SACT            TO SACT-DET                     076700      
001106     COMPUTE 77-VAR = SDO-SUC-SANT - SDO-SUC-SACT                 076800      
001107     MOVE 77-VAR                  TO VARI-DET                     076900      
001108     MOVE ZEROES                  TO 77-VAR.                      077000      
001109                                                                  077100      
001110     WRITE LINEA FROM DETALLE BEFORE 2.                           077200      
001111     ADD 2                        TO 77-LINEA.                    077300      
001112*                                                                 077400      
001113 4000-TOT-B07TOTSDO.                                              077500      
001114*-------------------                                              077600      
001115     FIND NEXT S151B07TOTSDO                                      077700      
001116       ON EXCEPTION                                               077800      
001117          IF  DMSTATUS(NOTFOUND)                                  077900      
001118              MOVE 3              TO 77-EOF                       078000      
001119          ELSE                                                    078100      
001120              MOVE SPACES             TO WLI-ENCAB-52             078200      
001121              MOVE "E"                TO WLI-TIPO-LJ              078251      
001122              MOVE 010105             TO CODIGO-LJ                078256      
001123              STRING "S151/P120 BASE DA&ADA SAR 1   "             078261      
001124                          DELIMITED BY SIZE INTO WLI-TEXTO-LJ     078266      
001125              MOVE WLI-TIPO-LJ   TO  TIPO-LJ                      078271      
001126              MOVE WLI-TEXTO-LJ  TO  TEXTO-LJ                     078276      
001127              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 078281      
001128              PERFORM    000-030-IMPRIME-MENSAJE                  078286      
001129              SET MYSELF(STATUS) TO -1.                           078300      
001130                                                                  078400      
001131                                                                  078500      
001132                                                                  078600      
001133     IF  77-EOF = 3                                               078700      
001134         NEXT SENTENCE                                            078800      
001135     ELSE                                                         078900      
001136         COMPUTE 77-IMPAB = B07-S333-IMPAB( 1)                    079000      
001137                          + B07-S333-IMPAB( 4)                    079100      
001138                          + B07-S333-IMPAB( 6)                    079200      
001139                          + B07-S333-IMPAB( 7)                    079300      
001140                          + B07-S333-IMPAB( 9)                    079400      
001141                          + B07-S333-IMPAB(10)                    079500      
001142                                                                  079600      
001143         COMPUTE 77-IMPOR = B07-S333-IMPOR( 1)                    079700      
001144                          + B07-S333-IMPOR( 4)                    079800      
001145                          + B07-S333-IMPOR( 6)                    079900      
001146                          + B07-S333-IMPOR( 7)                    080000      
001147                          + B07-S333-IMPOR( 9)                    080100      
001148                          + B07-S333-IMPOR(10)                    080200      
001149                                                                  080300      
001150         COMPUTE 77-IMPFV = B07-S333-IMPFV( 1)                    080400      
001151                          + B07-S333-IMPFV( 4)                    080500      
001152                          + B07-S333-IMPFV( 6)                    080600      
001153                          + B07-S333-IMPFV( 7)                    080700      
001154                          + B07-S333-IMPFV( 9)                    080800      
001155                          + B07-S333-IMPFV(10)                    080900      
001156                            GO        TO 4000-TOT-B07TOTSDO.      081000      
001157 4000-EXIT.                                                       081100      
001158   EXIT.                                                          081200      
001159                                                                  081300      
001160 5000-TOT-B08GLOSAR.                                              081400      
001161*-------------------                                              081500      
001162     FIND NEXT S151B08GLOSAR                                      081600      
001163       ON EXCEPTION                                               081700      
001164          IF  DMSTATUS(NOTFOUND)                                  081800      
001165              MOVE 4              TO 77-EOF                       081900      
001166          ELSE                                                    082000      
001167              MOVE SPACES             TO WLI-ENCAB-52             082100      
001168              MOVE "E"                TO WLI-TIPO-LJ              082151      
001169              MOVE 010105             TO CODIGO-LJ                082156      
001170              STRING "S151/P120 BASE DA&ADA SAR 2   "             082161      
001171                          DELIMITED BY SIZE INTO WLI-TEXTO-LJ     082166      
001172              MOVE WLI-TIPO-LJ   TO  TIPO-LJ                      082171      
001173              MOVE WLI-TEXTO-LJ  TO  TEXTO-LJ                     082176      
001174              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 082181      
001175              PERFORM    000-030-IMPRIME-MENSAJE                  082186      
001176              SET MYSELF(STATUS) TO -1.                           082200      
001177                                                                  082300      
001178                                                                  082400      
001179                                                                  082500      
001180     IF  77-EOF = 4                                               082600      
001181         NEXT SENTENCE                                            082700      
001182     ELSE                                                         082800      
001183         MOVE B08-GSAR-FECHA   TO 77-FEC-FECH                     082900      
001184         ADD B08-GSAR-OBL-IMSS TO 77-OBL-IMSS                     083000      
001185         ADD B08-GSAR-VOL-IMSS TO 77-VOL-IMSS                     083100      
001186         ADD B08-GSAR-OBL-ISTE TO 77-OBL-ISTE                     083200      
001187         ADD B08-GSAR-VOL-ISTE TO 77-VOL-ISTE                     083300      
001188         ADD B08-GSAR-INF-IMSS TO 77-INF-IMSS                     083400      
001189         ADD B08-GSAR-INT-IMSS TO 77-INT-IMSS                     083500      
001190         ADD B08-GSAR-INF-ISTE TO 77-INF-ISTE                     083600      
001191         ADD B08-GSAR-INT-ISTE TO 77-INT-ISTE                     083700      
001192         ADD B08-GSAR-OBL-INFO TO 77-OBL-INFO                     083800      
001193         ADD B08-GSAR-VOL-INFO TO 77-VOL-INFO                     083900      
001194         ADD B08-GSAR-IPR-INFO TO 77-IPR-INFO                     084000      
001195         ADD B08-GSAR-IDE-INFO TO 77-IDE-INFO                     084100      
001196         ADD B08-GSAR-ANT-IMSS TO 77-ANT-IMSS                     084200      
001197         ADD B08-GSAR-ANT-ISTE TO 77-ANT-ISTE                     084300      
001198         ADD B08-GSAR-ANT-INFO TO 77-ANT-ISTE                     084400      
001199         ADD B08-GSAR-ACT-IMSS TO 77-ACT-IMSS                     084500      
001200         ADD B08-GSAR-ACT-ISTE TO 77-ACT-ISTE                     084600      
001201         ADD B08-GSAR-ACT-INFO TO 77-ACT-INFO                     084700      
001202         GO                    TO 5000-TOT-B08GLOSAR.             084800      
001203                                                                  084900      
001204 5000-EXIT.                                                       085000      
001205   EXIT.                                                          085100      
001206                                                                  085200      
001207 6000-IMPRIME-SAR.                                                085300      
001208*-----------------                                                085400      
001209                                                                  085500      
001210     WRITE LINEA FROM BLANCOS BEFORE CHANNEL 1.                   085600      
001211     MOVE "D"                     TO TIRE-COM1.                   085700      
001212     MOVE  0                      TO SUBS-COM1.                   085800      
001213     MOVE 120                     TO PASO-COM1.                   085900      
001214     MOVE 1                       TO NURE-COM1.                   086000      
001215     PERFORM  1050-FECHA-BASE.                                    086100      
001216     WRITE LINEA FROM COMUN-TITULO-1 BEFORE 2.                    086200      
001217     MOVE "CONCENTRACION  "       TO PASO-COM2.                   086300      
001218     MOVE "DIARIO "               TO TIPO-COM2.                   086400      
001219     WRITE LINEA FROM COMUN-TITULO-2 BEFORE 2.                    086500      
001220*JRC MOVE 920120                  TO VERS-COM3.                   086600      
001221     MOVE NOMBRE-RPTE3            TO TITU-COM3.                   086700      
001222     MOVE 1                       TO 77-HOJA.                     086800      
001223     MOVE 77-HOJA                 TO HOJA-COM3.                   086900      
001224     WRITE LINEA FROM COMUN-TITULO-3 BEFORE 3.                    087000      
001225     MOVE 6                       TO 77-LINEA.                    087100      
001226*                                                                 087200      
001227                                                                  087300      
001228                                                                  087400      
001229                                                                  087500      
001230*    MOVE 00                      TO NUSU-COM4.                   087600      
001231     MOVE NOMBRE-CSI(77-CSI)      TO NOSU-COM4.                   087700      
001232     WRITE LINEA FROM COMUN-TITULO-4 BEFORE 1.                    087800      
001233     WRITE LINEA FROM BLANCOS BEFORE 1.                           087900      
001234*    WRITE LINEA FROM CONT-ARCH-TITULO-4 BEFORE 1.                088000      
001235     WRITE LINEA FROM BLANCOS BEFORE 1.                           088100      
001236                                                                  088200      
001237     ADD  5                       TO 77-LINEA.                    088300      
001238                                                                  088400      
001239     MOVE 77-IMPAB            TO DET-IMPAB                        088500      
001240     MOVE 77-IMPOR            TO DET-IMPOR                        088600      
001241     MOVE 77-IMPFV            TO DET-IMPFV                        088700      
001242     MOVE 77-ANT-IMSS         TO DET-ANT-IMSS                     088800      
001243     MOVE 77-ANT-ISTE         TO DET-ANT-ISTE                     088900      
001244     MOVE 77-ANT-INFO         TO DET-ANT-INFO                     089000      
001245     MOVE 77-ACT-IMSS         TO DET-ACT-IMSS                     089100      
001246     MOVE 77-ACT-ISTE         TO DET-ACT-ISTE                     089200      
001247     MOVE 77-ACT-INFO         TO DET-ACT-INFO.                    089300      
001248     WRITE LINEA FROM DETALLE-SAR1  AFTER 2.                      089400      
001249     WRITE LINEA FROM DETALLE-SAR2  AFTER 2.                      089500      
001250     WRITE LINEA FROM DETALLE-SAR3  AFTER 2.                      089600      
001251     WRITE LINEA FROM DETALLE-SAR17 AFTER 2.                      089700      
001252     WRITE LINEA FROM DETALLE-SAR18 AFTER 2.                      089800      
001253     WRITE LINEA FROM DETALLE-SAR19 AFTER 2.                      089900      
001254     WRITE LINEA FROM DETALLE-SAR20 AFTER 2.                      090000      
001255     WRITE LINEA FROM DETALLE-SAR21 AFTER 2.                      090100      
001256     WRITE LINEA FROM DETALLE-SAR22 AFTER 2.                      090200      
001257                                                                  090300      
001258 8000-IMPRIME-SAR-TESORERIA.                                      090400      
001259*---------------------------                                      090500      
001260     WRITE LINEA FROM BLANCOS BEFORE CHANNEL 1.                   090600      
001261     MOVE "D"                     TO TIRE-COM1.                   090700      
001262     MOVE  0                      TO SUBS-COM1.                   090800      
001263     MOVE 120                     TO PASO-COM1.                   090900      
001264     MOVE 1                       TO NURE-COM1.                   091000      
001265     PERFORM   1050-FECHA-BASE.                                   091100      
001266     WRITE LINEA FROM COMUN-TITULO-1 BEFORE 2.                    091200      
001267     MOVE "CONCENTRACION  "       TO PASO-COM2.                   091300      
001268     MOVE "DIARIO "               TO TIPO-COM2.                   091400      
001269     WRITE LINEA FROM COMUN-TITULO-2 BEFORE 2.                    091500      
001270*JRC MOVE 920120                  TO VERS-COM3.                   091600      
001271     MOVE NOMBRE-RPTE4            TO TITU-COM3.                   091700      
001272     MOVE 1                       TO 77-HOJA.                     091800      
001273     MOVE 77-HOJA                 TO HOJA-COM3.                   091900      
001274     WRITE LINEA FROM COMUN-TITULO-3 BEFORE 3.                    092000      
001275     MOVE 6                       TO 77-LINEA.                    092100      
001276*    MOVE 00                      TO NUSU-COM4.                   092200      
001277     MOVE NOMBRE-CSI(77-CSI)      TO NOSU-COM4.                   092300      
001278     WRITE LINEA FROM COMUN-TITULO-4 BEFORE 1.                    092400      
001279     WRITE LINEA FROM BLANCOS BEFORE 1.                           092500      
001280*    WRITE LINEA FROM CONT-ARCH-TITULO-4 BEFORE 1.                092600      
001281     WRITE LINEA FROM BLANCOS BEFORE 1.                           092700      
001282                                                                  092800      
001283     ADD  5                       TO 77-LINEA.                    092900      
001284                                                                  093000      
001285     MOVE 77-FEC-FECH             TO FECHA-SAR.                   093100      
001286     MOVE DIA-SAR                 TO DET-FECH-D.                  093200      
001287     IF  MES-SAR > 0 AND MES-SAR < 13                             093300      
001288         MOVE CUAL-MES(MES-SAR)   TO DET-FECH-M                   093400      
001289     ELSE                                                         093500      
001290         MOVE "XXX"               TO DET-FECH-M.                  093600      
001291     MOVE ANO-SAR                 TO DET-FECH-A.                  093700      
001292     MOVE 77-OBL-IMSS             TO DET-OBL-IMSS                 093800      
001293     MOVE 77-VOL-IMSS             TO DET-VOL-IMSS                 093900      
001294     MOVE 77-OBL-ISTE             TO DET-OBL-ISTE                 094000      
001295     MOVE 77-VOL-ISTE             TO DET-VOL-ISTE                 094100      
001296     MOVE 77-INF-IMSS             TO DET-INF-IMSS                 094200      
001297     MOVE 77-INT-IMSS             TO DET-INT-IMSS                 094300      
001298     MOVE 77-INF-ISTE             TO DET-INF-ISTE                 094400      
001299     MOVE 77-INT-ISTE             TO DET-INT-ISTE                 094500      
001300     MOVE 77-OBL-INFO             TO DET-OBL-INFO                 094600      
001301     MOVE 77-VOL-INFO             TO DET-VOL-INFO                 094700      
001302     MOVE 77-IPR-INFO             TO DET-IPR-INFO                 094800      
001303     MOVE 77-IDE-INFO             TO DET-IDE-INFO                 094900      
001304                                                                  095000      
001305     WRITE LINEA FROM DETALLE-SAR4  AFTER 4.                      095100      
001306     WRITE LINEA FROM DETALLE-SAR5  AFTER 2.                      095200      
001307     WRITE LINEA FROM DETALLE-SAR6  AFTER 2.                      095300      
001308     WRITE LINEA FROM DETALLE-SAR7  AFTER 2.                      095400      
001309     WRITE LINEA FROM DETALLE-SAR8  AFTER 2.                      095500      
001310     WRITE LINEA FROM DETALLE-SAR9  AFTER 2.                      095600      
001311     WRITE LINEA FROM DETALLE-SAR10 AFTER 2.                      095700      
001312     WRITE LINEA FROM DETALLE-SAR11 AFTER 2.                      095800      
001313     WRITE LINEA FROM DETALLE-SAR12 AFTER 2.                      095900      
001314     WRITE LINEA FROM DETALLE-SAR13 AFTER 2.                      096000      
001315     WRITE LINEA FROM DETALLE-SAR14 AFTER 2.                      096100      
001316     WRITE LINEA FROM DETALLE-SAR15 AFTER 2.                      096200      
001317     WRITE LINEA FROM DETALLE-SAR16 AFTER 2.                      096300      
