000001$SET LIST LINEINFO MAP XREF OPTIMIZE                              000100      
000002$SET LISTOMITTED                                                  000200      
000003************************************************************      000202      
000004* RECOMPILACION POR EL UPGRADE DEL MCP A 55                *      000204      
000005* 20141205 15MTP001 MJGRG                                  *      000206      
000006************************************************************      000208      
000007IDENTIFICATION DIVISION.                                          000300      
000008PROGRAM-ID. S151P071.                                             000400      
000009AUTHOR. JOSE FELIX TORRES FRANCO.                                 000500      
000010ENVIRONMENT DIVISION.                                             000600      
000011  INPUT-OUTPUT SECTION.                                           000700      
000012  FILE-CONTROL.                                                   000800      
000013  SELECT A01-MONITOR  ASSIGN TO DISK                              000900      
000014         ACCESS MODE  IS SEQUENTIAL.                              001000      
000015                                                                  001100      
000016DATA DIVISION.                                                    001200      
000017FILE SECTION.                                                     001300      
000018  FD  A01-MONITOR                                                 001400      
000019      RECORD CONTAINS 1500 CHARACTERS                             001500      
000020      BLOCK  CONTAINS 10   RECORDS                                001600      
000021      VALUE OF TITLE IS WKS-TIT-MONITOR.                          001700      
000022  01  R01-REG-MONITOR             PIC X(1500).                    001800      
000023                                                                  001900      
000024 WORKING-STORAGE SECTION.                                         002000      
000025 01 WKS-TIT-MONITOR.                                              002100      
000026    03 FILLER                     PIC X(29) VALUE                 002200      
000027       "(S151)S151/FILE/P071/MONITOR/".                           002300      
000028    03 WKS-FECHA-MON              PIC 9(06).                      002400      
000029    03 FILLER                     PIC X(01) VALUE "/".            002500      
000030    03 WKS-HORA-MON               PIC 9(06).                      002600      
000031    03 FILLER                     PIC X(10) VALUE " ON CMEMP.".   002700      
000032                                                                  002800      
000033 77 W77-MONITOR                   PIC 9(01).                      002900      
000034    88 W88-MONITOR                VALUE 1.                        003000      
000035 77 W77-HDR-BNMX                  PIC 9(02) VALUE 48.             003100      
000036 77 W77-HDR-SA2                   PIC 9(02) VALUE 77.             003200      
000037 77 W77-LONGMSG                   PIC 9(04).                      003300      
000038 77 W77-RESULT-COMS               PIC 9(06).                      003400      
000039 77 W77-IND                       PIC 9(04).                      003500      
000040 77 W77-IND2                      PIC 9(04).                      003600      
000041 77 W77-FIN                       PIC 9(02).                      003700      
000042 77 W77-SALIDA                    PIC 9(02).                      003800      
000043 77 W77-ERROR                     PIC 9(04).                      003900      
000044 77 W77-NUM-MOVTOS                PIC 9(02) VALUE 25.             004000      
000045 77 W77-HI                        PIC 9(05) VALUE 0.              004100      
000046    88 W88-HI-2                   VALUE 2.                        004200      
000047    88 W88-HI-3                   VALUE 3.                        004300      
000048    88 W88-HI-4                   VALUE 4.                        004400      
000049    88 W88-HI-6                   VALUE 6.                        004500      
000050    88 W88-HI-32                  VALUE 32.                       004600      
000051 77 W77-SISTEMAS-PUNTEO           PIC 9(04).                      004700      
000052    88 W88-SISTEMAS-PUNTEO        VALUE  017,                     004800      
000053                                         018,                     004900      
000054                                         084,                     005000      
000055                                         087,                     005100      
000056                                         264,                     005200      
000057                                         252,                     005250      
000058                                         333,                     005300      
000059                                         335,                     005400      
000060                                         336,                     005500      
000061                                         404,                     005600      
000062                                         408,                     005610      
000063                                         500,                     005700      
000064                                         501,                     005800      
000065                                         502,                     005900      
000066                                         701,                     006000      
000067                                         703,                     006100      
000068                                         707,                     006200      
000069                                         711.                     006300      
000070                                                                  006400      
000071 77 W77-RESULT-L011               PIC S9(11) BINARY.              006500      
000072 77 W77-RESP-L011                 PIC 9(04).                      006600      
000073*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000074* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           006700      
000075**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000076  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000077  01 MENSAJE-LJ.                                                  100300      
000078     02 SISTEMA-LJ     PIC X(04).                                 100400      
000079     02 FILLER         PIC X VALUE "/".                           100500      
000080     02 PASO-LJ        PIC X(04).                                 100600      
000081     02 FILLER         PIC X VALUE "/".                           100700      
000082     02 MTP-LJ         PIC 9(03).                                 100800      
000083     02 FILLER         PIC X VALUE ":".                           100900      
000084     02 TIPO-LJ        PIC X.                                     101000      
000085     02 FILLER         PIC X VALUE ">".                           101100      
000086     02 CODIGO-LJ      PIC 9(06).                                 101200      
000087     02 FILLER         PIC X VALUE "<".                           101300      
000088     02 TEXTO-LJ       PIC X(250).                                101400      
000089*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000090*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000091* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         006800      
000092*================================================================ 000100      
000093*         ENTRY-POINT CONSISDIA :                               = 000200      
000094*                                                                 000300      
000095* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000096* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000097* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000098* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000099* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000100* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000101* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000102* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000103* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000104* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000105*                                                               = 001400      
000106*================================================================ 001500      
000107                                                                  001600      
000108                                                                  001700      
000109*================================================================ 001800      
000110* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000111*                                                               = 002000      
000112* ENTRADA REQUERIDA :                                           = 002100      
000113*                                                               = 002200      
000114*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000115*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000116*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000117*================================================================ 002600      
000118 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000119    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000120    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000121    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000122    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000123    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000124    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000125    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000126    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000127    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000128    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000129    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000130    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000131    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000132    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000133    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000134    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000135    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000136    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000137    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000138    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000139       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000140       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000141       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000142       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000143*==============================================================   005200      
000144*                                                             =   005300      
000145* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000146*                                                             =   005500      
000147* CAMPOS REQUERIDOS :                                         =   005600      
000148*                                                             =   005700      
000149* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000150* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000151* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000152* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000153*==============================================================   006200      
000154 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000155    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000156    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000157    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000158    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000159                                                                  006800      
000160*==============================================================   006900      
000161*                                                             =   007000      
000162* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000163*                                                             =   007200      
000164* CAMPOS REQUERIDOS :                                         =   007300      
000165*                                                             =   007400      
000166* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000167* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000168* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000169* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000170*==============================================================   007900      
000171 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000172    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000173    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000174    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000175    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000176                                                                  008500      
000177*==============================================================   008600      
000178*                                                             =   008700      
000179* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000180*                                                             =   008900      
000181* CAMPOS REQUERIDOS :                                         =   009000      
000182*                                                             =   009100      
000183* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000184* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000185* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000186* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000187*==============================================================   009600      
000188 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000189    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000190    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000191    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000192    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000193                                                                  010200      
000194*============================================================     010300      
000195* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000196*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000197*                                                           =     010600      
000198*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000199*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000200*                                                           =     010900      
000201*  ENTRADA REQUERIDA.                                       =     011000      
000202*                                                           =     011100      
000203*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000204*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000205*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000206*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000207*============================================================     011600      
000208                                                                  011700      
000209 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000210     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000211     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000212     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000213     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000214                                                                  012300      
000215*=============================================================    012400      
000216*                                                            =    012500      
000217* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000218*             B01-SIS-FECARMOV.                              =    012700      
000219*                                                            =    012800      
000220* ENTRADA REQUERIDAD :                                       =    012900      
000221*                                                            =    013000      
000222*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000223*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000224*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000225*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000226*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000227*=============================================================    013600      
000228                                                                  013700      
000229 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000230     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000231     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000232     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000233     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000234     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000235*================================================================ 014400      
000236*                                                               = 014500      
000237* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000238*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000239*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000240*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000241*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000242*                                                               = 015100      
000243* ENTRADA REQUERIDA :                                           = 015200      
000244*                                                               = 015300      
000245* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000246* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000247* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000248* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000249* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000250*================================================================ 015900      
000251 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000252    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000253    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000254    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000255    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000256    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000257                                                                  016600      
000258*============================================================     016700      
000259*                                                           =     016800      
000260* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000261*                                                           =     017000      
000262* DATOS REQUERIDOS :                                        =     017100      
000263*                                                           =     017200      
000264* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000265* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000266* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000267* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000268* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000269*============================================================     017800      
000270                                                                  017900      
000271 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000272     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000273     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000274     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000275     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000276     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000277                                                                  018600      
000278*============================================================     018700      
000279*                                                           =     018800      
000280* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000281*                                                           =     019000      
000282* DATOS REQUERIDOS :                                        =     019100      
000283*                                                           =     019200      
000284* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000285* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000286* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000287* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000288* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000289*============================================================     019800      
000290                                                                  019900      
000291 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000292     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000293     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000294     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000295     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000296     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000297                                                                  020600      
000298*===============================================================  020700      
000299*                                                              =  020800      
000300* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000301*              MOVIMIENTOS.                                    =  021000      
000302* DATOS REQUERIDOS :                                           =  021100      
000303*                                                              =  021200      
000304* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000305* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000306* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000307* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000308* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000309* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000310*==============================================================   021900      
000311                                                                  022000      
000312 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000313     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000314     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000315     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000316     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000317     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000318     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000319*==============================================================   022800      
000320*                                                             =   022900      
000321* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000322*                                                             =   023100      
000323* CAMPOS REQUERIDOS :                                         =   023200      
000324*                                                             =   023300      
000325* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000326* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000327* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000328* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000329*==============================================================   023800      
000330 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000331    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000332    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000333    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000334    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000335                                                                  024304      
000336*=================================================================024306      
000337*                ENTRY POINT CONSISB01                           =024308      
000338*                                                                =024310      
000339*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000340*                                                                =024314      
000341*  FUNCIONES DISPONIBLES :                                       =024316      
000342*                                                                =024318      
000343*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000344*                                                                =024322      
000345*  PARAMETROS REQUERIDOS                                         =024324      
000346*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000347*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000348*=================================================================024330      
000349                                                                  024332      
000350 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000351     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000352     03 WKS-CON-CSI                PIC 9(02).                     024336      
000353     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000354     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000355        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000356        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000357        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000358        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000359        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000360                                                                  024400      
000361*=================================================================024500      
000362*                ENTRY POINT B02ARCINTER                         =024600      
000363*                                                                =024700      
000364*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000365*                                                                =024900      
000366*  FUNCIONES DISPONIBLES :                                       =025000      
000367*                                                                =025100      
000368*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000369* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000370* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000371* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000372*                                                                =025600      
000373*  PARAMETROS REQUERIDOS                                         =025700      
000374*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000375*                                                                =025900      
000376*=================================================================026000      
000377 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000378     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000379     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000380     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000381     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000382     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000383     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000384     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000385     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000386     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000387     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000388     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000389     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000390     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000391     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000392     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000393     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000394     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000395     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000396     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000397     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000398     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000399     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000400     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000401     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000402     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000403     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000404     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000405     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000406                                                                  029000      
000407*=================================================================029100      
000408*                ENTRY POINT B04SISTEMA                          =029200      
000409*                                                                =029300      
000410*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000411*                                                                =029500      
000412*  FUNCIONES DISPONIBLES :                                       =029600      
000413*                                                                =029700      
000414*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000415*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000416*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000417*                                                                =030100      
000418*  PARAMETROS REQUERIDOS                                         =030200      
000419*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000420*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000421*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000422*                                                                =030600      
000423*=================================================================030700      
000424 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000425     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000426     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000427     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000428     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000429     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000430     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000431     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000432                                                                  031600      
000433*================================================================ 031700      
000434*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000435*                                                               = 031900      
000436*  FUNCION                                                      = 032000      
000437*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000438*   19       ALTAS.                                             = 032200      
000439*   22       BAJAS                                              = 032300      
000440*   37       CAMBIOS.                                           = 032400      
000441*                                                               = 032500      
000442*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000443*                      FECHA DE PROCESO                         = 032700      
000444*                      NUMERO DE PROCESO                        = 032800      
000445*                      FECHA INICIO                             = 032900      
000446*                      REGISTRO INICIAL                         = 033000      
000447*================================================================ 033100      
000448                                                                  033200      
000449 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000450     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000451     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000452     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000453     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000454     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000455     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000456     03 WKS-B05-MIX                PIC 9(08).                     034000      
000457     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000458     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000459     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000460     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000461     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000462     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000463                                                                  034700      
000464                                                                  034800      
000465*================================================================ 034900      
000466*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000467*                                                               = 035100      
000468*  FUNCION                                                      = 035200      
000469*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000470*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000471*                                                               = 035500      
000472*================================================================ 035600      
000473                                                                  035700      
000474 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000475     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000476     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000477     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000478     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000479     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000480     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000481                                                                  036500      
000482*===============================================================  036600      
000483*                                                              =  036700      
000484*         ENTRY-POINT CONSISMEN                                =  036800      
000485*                                                              =  036900      
000486*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000487*                      SISTEMA                                 =  037100      
000488*                                                              =  037200      
000489*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000490*                                                              =  037400      
000491*===============================================================  037500      
000492 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000493     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000494     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000495     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000496     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000497     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000498     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000499     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000500     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000501     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000502     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000503     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000504     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000505     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000506     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000507     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000508        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000509        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000510        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000511        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000512        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000513        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000514        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000515                                                                  039900      
000516*=====================================================            040000      
000517*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000518*=====================================================            040200      
000519 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000520     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000521     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000522     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000523                                                                  040700      
000524*=====================================================            040800      
000525*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000526*=====================================================            041000      
000527 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000528     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000529     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000530     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000531                                                                  041500      
000532*=====================================================            041600      
000533*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000534*=====================================================            041800      
000535 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000536     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000537     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000538     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000539*=====================================================            042300      
000540*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000541*=====================================================            042500      
000542 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000543     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000544     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000545     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000546                                                                  043000      
000547*=====================================================            043100      
000548*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000549*=====================================================            043300      
000550 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000551     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000552     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000553     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000554                                                                  043800      
000555*=====================================================            043900      
000556*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000557*=====================================================            044100      
000558 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000559     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000560     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000561     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000562                                                                  044600      
000563*=====================================================            044700      
000564*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000565*=====================================================            044900      
000566 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000567     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000568     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000569     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000570                                                                  045400      
000571*=====================================================            045500      
000572*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000573*=====================================================            045700      
000574 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000575     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000576     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000577     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000578                                                                  046200      
000579*=====================================================            046300      
000580*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000581*=====================================================            046500      
000582 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000583     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000584     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000585     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000586                                                                  047000      
000587*=====================================================            047100      
000588*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000589*=====================================================            047300      
000590 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000591     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000592     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000593     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000594                                                                  047800      
000595*=====================================================            047900      
000596*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000597*=====================================================            048100      
000598 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000599     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000600     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000601     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000602                                                                  048600      
000603*=====================================================            048700      
000604*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000605*=====================================================            048900      
000606 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000607     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000608     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000609     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000610                                                                  049400      
000611*=====================================================            049500      
000612*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000613*=====================================================            049700      
000614 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000615     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000616     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000617     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000618     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000619     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000620     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000621     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000622     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000623     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000624     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000625                                                                  050900      
000626*=====================================================            051000      
000627*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000628*=====================================================            051200      
000629 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000630     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000631     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000632     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000633     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000634                                                                  051800      
000635*=====================================================            051900      
000636*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000637*=====================================================            052100      
000638 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000639     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000640     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000641     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000642     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000643                                                                  052700      
000644*=====================================================            052800      
000645*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000646*=====================================================            053000      
000647 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000648     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000649     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000650     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000651     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
000652                                                                  053600      
000653*=====================================================            053700      
000654*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
000655*=====================================================            053900      
000656 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
000657     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
000658     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
000659     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
000660     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
000661                                                                  054500      
000662*=====================================================            054600      
000663*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
000664*=====================================================            054800      
000665 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
000666     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
000667     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
000668     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
000669     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
000670                                                                  055400      
000671*=====================================================            055500      
000672*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
000673*=====================================================            055700      
000674 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
000675     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
000676     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
000677     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
000678     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
000679                                                                  056300      
000680*=====================================================            056400      
000681*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
000682*=====================================================            056600      
000683 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
000684     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
000685     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
000686     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
000687     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
000688                                                                  057200      
000689 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
000690*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000691 01 MY-ID                         PIC X(10) VALUE "S151/P070>".   006900      
000692 01 WKS-ERRORES.                                                  007000      
000693     02 WKS-ERR01 PIC X(32) VA "TERMINAL NO ACTIVA          0001".007100      
000694     02 WKS-ERR02 PIC X(32) VA "TRANSACCION NO IMPLEMENTADA 0002".007200      
000695     02 WKS-ERR03 PIC X(32) VA "SISTEMA INVALIDO            0003".007300      
000696     02 WKS-ERR04 PIC X(32) VA "SUCURSAL INVALIDA           0004".007400      
000697     02 WKS-ERR05 PIC X(32) VA "SISTEMA NO NUMERICO         0005".007500      
000698     02 WKS-ERR06 PIC X(32) VA "SUCURSAL NO NUMERICA        0006".007600      
000699     02 WKS-ERR07 PIC X(32) VA "CAJA NO NUMERICA            0007".007700      
000700     02 WKS-ERR08 PIC X(32) VA "MONEDA NO NUMERICA          0008".007800      
000701     02 WKS-ERR09 PIC X(32) VA "MDE NO NUMERICA             0009".007900      
000702     02 WKS-ERR10 PIC X(32) VA "NATURALEZA NO NUMERICA      0010".008000      
000703     02 WKS-ERR11 PIC X(32) VA "NO HAY INFORMACION          0011".008100      
000704     02 WKS-ERR12 PIC X(32) VA "FECHA NO NUMERICA           0012".008200      
000705     02 WKS-ERR13 PIC X(32) VA "FECHA INVALIDA              0013".008300      
000706     02 WKS-ERR14 PIC X(32) VA "BASE CERRADA                0014".008400      
000707     02 WKS-ERR15 PIC X(32) VA "ERROR EN BASE               0015".008500      
000708                                                                  008600      
000709 01  TABLA-ERRORES                REDEFINES WKS-ERRORES.          008700      
000710     02  WKS-TBL-ERROR            OCCURS 15 TIMES.                008800      
000711         03  WKS-TBL-ERRORES      PIC X(28).                      008900      
000712         03  WKS-TBL-ERROR-NUME   PIC 9(04).                      009000      
000713                                                                  009100      
000714 01  WKS-TAB-SISTEMAS.                                            009200      
000715     03 WKS-SISTEMAS-RESIDENTES OCCURS 50 TIMES.                  009300      
000716        05 WKS-TAB-NUMSIS         PIC 9(04) COMP.                 009400      
000717        05 WKS-TAB-FECCON         PIC 9(08) COMP.                 009500      
000718        05 WKS-TAB-RESCSI         PIC 9(02) COMP.                 009600      
000719        05 WKS-TAB-MODSIS         PIC 9(02) COMP.                 009700      
000720                                                                  009800      
000721 77  W77-RESULT-B01               PIC S9(04) BINARY.              009900      
000722 77  W77-RESULT-B03               PIC S9(04) BINARY.              010000      
000723 77  W77-RESULT-B04               PIC S9(04) BINARY.              010100      
000724 77  W77-FIN-SIS                  PIC 9(02).                      010200      
000725 77  W77-IND-SIS                  PIC 9(04).                      010300      
000726                                                                  010400      
000727  01 WKS-FECHAS.                                                  010500      
000728     03 WKS-FECHA-PROCESO         PIC 9(08).                      010600      
000729                                                                  010700      
000730     03 WKS-FECHA-MAQUINA         PIC X(10) TYPE IS NUMERIC-DATE. 010800      
000731     03 WKS-FECHA-MAQUINA-R       REDEFINES WKS-FECHA-MAQUINA.    010900      
000732        05 WKS-FECMAQ-MM          PIC 9(02).                      011000      
000733        05 WKS-DIAGONAL1          PIC X(01).                      011100      
000734        05 WKS-FECMAQ-DD          PIC 9(02).                      011200      
000735        05 WKS-DIAGONAL2          PIC X(01).                      011300      
000736        05 WKS-FECMAQ-AAAA        PIC 9(04).                      011400      
000737        05 WKS-FECMAQ-AAAA-R      REDEFINES WKS-FECMAQ-AAAA.      011500      
000738           07 WKS-FECMAQ-CC       PIC 9(02).                      011600      
000739           07 WKS-FECMAQ-AA       PIC 9(02).                      011700      
000740  01 WKS-FECHA-MAQ6D.                                             011800      
000741     03 WKS-FEC6-AA               PIC 9(02).                      011900      
000742     03 WKS-FEC6-MM               PIC 9(02).                      012000      
000743     03 WKS-FEC6-DD               PIC 9(02).                      012100      
000744                                                                  012200      
000745  01 WKS-HR-MAQUINA               PIC 9(08).                      012300      
000746  01 WKS-HR-MAQUINA-R REDEFINES WKS-HR-MAQUINA.                   012400      
000747     03 WKS-HHMMSS-MAQUINA PIC 9(06).                             012500      
000748     03  FILLER            PIC 9(02).                             012600      
000749  01 WKS-STR-HORA-MAQ             PIC X(08).                      012700      
000750  01 WKS-CTLVER-LIBID             PIC X(12).                      012800      
000751  01 WKS-CTLVER-NOMLIB            PIC X(72).                      012900      
000752  01 W77-CTLVER-RESULT            PIC S9(11) BINARY.              013000      
000753                                                                  013100      
000754  01 WKS-DATOS-HOST.                                              013200      
000755     03 WKS-NUMCSI-HOST           PIC 9(02).                      013300      
000756     03 WKS-NOMEQUIPO             PIC X(10).                      013400      
000757     03 WKS-NOMCSI                PIC X(26).                      013500      
000758     03 WKS-LINEA-BATCH           PIC X(05).                      013600      
000759                                                                  013700      
000760  01 WKS-TIT-TASKFILE.                                            013800      
000761     03 FILLER                    PIC X(30) VALUE                 013900      
000762        "FILE TASKFILE (USERBACKUPNAME=".                         014000      
000763     03 FILLER                    PIC X(30) VALUE                 014100      
000764        "TRUE,TITLE=S151/TASKFILE/P071/".                         014200      
000765     03 WKS-TSK-NODO              PIC 9(02).                      014300      
000766     03 WKS-TSK-SUBNODO           PIC 9(02) VALUE ZERO.           014400      
000767     03 FILLER                    PIC X(06) VALUE "/R000/".       014500      
000768     03 WKS-TSK-FECHA.                                            014600      
000769        05 WKS-TSK-AA             PIC 9(02).                      014700      
000770        05 WKS-TSK-MM             PIC 9(02).                      014800      
000771        05 WKS-TSK-DD             PIC 9(02).                      014900      
000772     03 FILLER                    PIC X(01) VALUE "/".            015000      
000773     03 WKS-TSK-MIX               PIC 9(07).                      015100      
000774     03 FILLER                    PIC X(01) VALUE "/".            015200      
000775     03 WKS-TSK-MNEMONICO         PIC X(14) VALUE                 015300      
000776        "001TASKFILE );".                                         015400      
000777                                                                  015500      
000778  01 WKS-CCR-DES                  PIC 9(02).                      015600      
000779  01 WKS-PREF-DES                 PIC 9(06).                      015700      
000780  01 WKS-SA2-ORI-SISTEMA          PIC 9(04).                      015800      
000781  01 WKS-SA2-ORI-CODSERV          PIC 9(02).                      015900      
000782  01 WKS-SA2-ORI-SUBCODSERV       PIC 9(03).                      016000      
000783  01 WKS-MENSAJE-COMS             PIC X(1920) WITH LOWER-BOUNDS.  016100      
000784  01 WKS-MSG-R                    REDEFINES WKS-MENSAJE-COMS.     016200      
000785     02 WKS-HEADER-BNX.                                           016300      
000786        03 WKS-HDR-PREFIJO        PIC X(01).                      016400      
000787        03 WKS-HDR-APL-DES        PIC X(01).                      016500      
000788        03 WKS-HDR-CCR-DES        PIC 9(02).                      016600      
000789        03 WKS-HDR-LST-ORG        PIC 9(04).                      016700      
000790        03 WKS-HDR-LST-ORG-R      REDEFINES                       016800      
000791           WKS-HDR-LST-ORG        PIC 9(08) COMP.                 016900      
000792        03 WKS-HDR-STATION.                                       017000      
000793           04 WKS-HDR-TPO         PIC X(01).                      017100      
000794           04 WKS-HDR-SUC         PIC 9999.                       017200      
000795           04 WKS-HDR-PRIV        PIC X(01).                      017300      
000796           04 WKS-HDR-CAJ         PIC 9(02).                      017400      
000797        03 WKS-HDR-CCR-ORG        PIC 9(02).                      017500      
000798        03 WKS-HDR-COP-ORG        PIC 9(02).                      017600      
000799        03 WKS-HDR-FAC            PIC 9(02).                      017700      
000800        03 WKS-HDR-FAC-R          REDEFINES                       017800      
000801           WKS-HDR-FAC            PIC X(02).                      017900      
000802        03 WKS-HDR-APL-ORG        PIC X(01).                      018000      
000803        03 WKS-HDR-RES            PIC 9(02).                      018100      
000804           88 MSG-DE-APLICACION   VALUE 2, 4.                     018200      
000805           88 MSG-DE-RED          VALUE 11, 12.                   018300      
000806           88 MSG-RED-FOR         VALUE 12.                       018400      
000807           88 MSG-A-MASCARA       VALUE 3.                        018500      
000808           88 MSG-A-TERMINAL      VALUE 1.                        018600      
000809           88 MSG-DE-ERRORES      VALUE 31, 32, 33.               018700      
000810           88 MSG-NO-EXIST-APL    VALUE 32.                       018800      
000811        03 WKS-HDR-MASC           PIC X(05).                      018900      
000812        03 WKS-HDR-PWR            PIC X(06).                      019000      
000813        03 WKS-TEXTO              PIC X(1884).                    019100      
000814        03 WKS-TEXTO-SA2         REDEFINES WKS-TEXTO.             019200      
000815           05 WKS-AMPLIACION-HEADER.                              019300      
000816              07  WKS-PREFIJO-DESTINO         PIC 9(06).          019400      
000817              07  WKS-PREFIJO-ORIGEN          PIC 9(06).          019500      
000818           05 WKS-SEGMENTO-DE-INFRAEST.                           019600      
000819              07  WKS-SA2-DESTINO-SISTEMA     PIC 9(04).          019700      
000820              07  WKS-SA2-DESTINO-CODSERV     PIC 9(02).          019800      
000821              07  WKS-SA2-DESTINO-SUBCODSERV  PIC 9(03).          019900      
000822              07  WKS-SA2-ORIGEN-SISTEMA      PIC 9(04).          020000      
000823              07  WKS-SA2-ORIGEN-CODSERV      PIC 9(02).          020100      
000824              07  WKS-SA2-ORIGEN-SUBCODSERV   PIC 9(03).          020200      
000825              07  WKS-SA2-DIRECCION           PIC 9.              020300      
000826              07  WKS-SA2-LONG-MSG            PIC 9(04).          020400      
000827              07  WKS-SA2-TIEMPO-ESPERA       PIC 9(05).          020500      
000828              07  WKS-SA2-RESULT-ICA          PIC 9(02).          020600      
000829              07  WKS-SA2-FORMATO-ID          PIC 9(02).          020700      
000830              07  WKS-SA2-FORMATO-RECON       PIC 9.              020800      
000831              07  WKS-SA2-FORMATO-VERSION     PIC X.              020900      
000832              07  WKS-SA2-MENSAJE-CLASE       PIC 9.              021000      
000833              07  WKS-SA2-MENSAJE-RESULT      PIC 9.              021100      
000834              07  WKS-SA2-MENSAJE-MODO        PIC 9.              021200      
000835              07  WKS-SA2-MENSAJE-SUC         PIC 9(04).          021205      
000836              07  WKS-SA2-MENSAJE-CAJA.                           021210      
000837                  09 WKS-SA2-MENSAJE-LETRA    PIC X.              021215      
000838                  09 WKS-SA2-MENSAJE-VAL-CAJ  PIC 9(02).          021220      
000839              07  WKS-SA2-MENSAJE-SEC-TRANS   PIC 9(08).          021225      
000840              07  WKS-SA2-MENSAJE-FECHA-GEN   PIC 9(06).          021230      
000841              07  WKS-SA2-MENSAJE-HORA-GEN    PIC 9(06).          021235      
000842              07  WKS-SA2-MENSAJE-MODALIDAD   PIC 9(02).          021240      
000843              07  WKS-SA2-MENSAJE-OPERADOR    PIC X(10).          021245      
000844              07  WKS-SA2-MENSAJE-VERSION     PIC X.              021250      
000845           05 WKS-MENSAJE-ENTRE-APLIS         PIC X(1795).        021300      
000846****************************************************************  021400      
000847*    DESCRIPCION DE LOS REGISTROS DE DATOS DE ENTRADA          *  021500      
000848****************************************************************  021600      
000849  01 WKS-MSG-TEXTO                           PIC X(1795).         021700      
000850* Entrada consulta de totales por Sucursal                        021710      
000851  01 WKS-ENIVEL1-SM              REDEFINES WKS-MSG-TEXTO.         021720      
000852     03 WKS-ENIVEL1-FECOPE                   PIC 9(08).           021730      
000853     03 WKS-ENIVEL1-SUC                      PIC 9(04).           021740      
000854     03 WKS-ENIVEL1-CONT.                                         021750      
000855        05 WKS-ENIVEL1-CAJCON                PIC 9(04).           021760      
000856        05 WKS-ENIVEL1-MONCON                PIC 9(04).           021770      
000857        05 WKS-ENIVEL1-SISCON                PIC 9(04).           021780      
000858     03 FILLER                               PIC X(1771).         021790      
000859* Entrada consulta de totales por Sucursal-Caja                   021792      
000860  01 WKS-ENIVEL2-SM              REDEFINES WKS-MSG-TEXTO.         021800      
000861     03 WKS-ENIVEL2-FECOPE                   PIC 9(08).           021900      
000862     03 WKS-ENIVEL2-SUC                      PIC 9(04).           022000      
000863     03 WKS-ENIVEL2-CAJA                     PIC 9(04).           022100      
000864     03 WKS-ENIVEL2-CONT.                                         022200      
000865        05 WKS-ENIVEL2-MONCON                PIC 9(04).           022300      
000866        05 WKS-ENIVEL2-SISCON                PIC 9(04).           022400      
000867     03 FILLER                               PIC X(1771).         022500      
000868                                                                  022600      
000869****************************************************************  022700      
000870*    REGISTRO EN MEMORIA PARA MANEJO DE DATOS DE SALIDA        *  022800      
000871****************************************************************  022900      
000872* Salida consulta de totales por Sucursal-Caja                    022950      
000873  01 WKS-MENSAJE-SAL                       PIC X(1795).           023000      
000874  01 WKS-NIVEL2-SM         REDEFINES WKS-MENSAJE-SAL.             023100      
000875     03 WKS-NIVEL2-SUC                     PIC 9(04).             023200      
000876     03 WKS-NIVEL2-CAJA                    PIC 9(04).             023400      
000877     03 WKS-NIVEL2-CONT.                                          023500      
000878        05 WKS-NIVEL2-MONCON               PIC 9(04).             023600      
000879        05 WKS-NIVEL2-SISCON               PIC 9(04).             023700      
000880        05 WKS-NIVEL2-OCURRENCIAS          PIC 9(02).             023750      
000881     03 WKS-NIVEL2-DATOS OCCURS 25 TIMES.                         023800      
000882        05 WKS-NIVEL2-RESP                 PIC X(57).             023900      
000883        05 WKS-NIVEL2-RESP-R REDEFINES WKS-NIVEL2-RESP.           024000      
000884          07 WKS-NIVEL2-MON                PIC 9(04).             024100      
000885          07 WKS-NIVEL2-SIS                PIC 9(04).             024200      
000886          07 WKS-NIVEL2-ICAR               PIC 9(16)V9(02).       024300      
000887          07 WKS-NIVEL2-IABO               PIC 9(16)V9(02).       024400      
000888          07 WKS-NIVEL2-NCAR               PIC 9(06).             024500      
000889          07 WKS-NIVEL2-NABO               PIC 9(06).             024600      
000890          07 WKS-NIVEL2-ERROR              PIC 9(01).             024700      
000891     03 FILLER                             PIC X(352).            024800      
000892* Salida consulta de totales por Sucursal                         024900      
000893 01 WKS-NIVEL1-SM         REDEFINES WKS-MENSAJE-SAL.              025000      
000894    03 WKS-NIVEL1-SUC                     PIC 9(04).              025200      
000895    03 WKS-NIVEL1-CONT.                                           025300      
000896       05 WKS-NIVEL1-CAJCON               PIC 9(04).              025400      
000897       05 WKS-NIVEL1-MONCON               PIC 9(04).              025500      
000898       05 WKS-NIVEL1-SISCON               PIC 9(04).              025600      
000899       05 WKS-NIVEL1-OCURRENCIAS          PIC 9(02).              025650      
000900    03 WKS-NIVEL1-DATOS OCCURS 25 TIMES.                          025700      
000901       05 WKS-NIVEL1-RESP                 PIC X(57).              025800      
000902       05 WKS-NIVEL1-RESP-R REDEFINES WKS-NIVEL1-RESP.            025900      
000903         07 WKS-NIVEL1-MON                PIC 9(04).              026100      
000904         07 WKS-NIVEL1-SIS                PIC 9(04).              026200      
000905         07 WKS-NIVEL1-ICAR               PIC 9(16)V9(02).        026300      
000906         07 WKS-NIVEL1-IABO               PIC 9(16)V9(02).        026400      
000907         07 WKS-NIVEL1-NCAR               PIC 9(06).              026500      
000908         07 WKS-NIVEL1-NABO               PIC 9(06).              026600      
000909         07 WKS-NIVEL1-ERROR              PIC 9(01).              026700      
000910    03 FILLER                             PIC X(392).             026800      
000911                                                                  026900      
000912****************************************************************  027000      
000913*   DESCRIPCION DE FORMATOS DE LLAMADO A LIBRERIA DE PUNTEO    *  027100      
000914****************************************************************  027200      
000915 01 WKS-L011-TOTALES               WITH LOWER-BOUNDS.             027300      
000916    03 WKS-L011-FUNCION            PIC 9(02).                     027400      
000917    03 WKS-L011-FECHA              PIC 9(08).                     027500      
000918    03 WKS-L011-SUCURSAL           PIC 9(04).                     027600      
000919    03 WKS-L011-CAJA               PIC 9(04).                     027700      
000920    03 WKS-L011-CONT.                                             027800      
000921       05 WKS-L011-MONCON          PIC 9(04).                     027900      
000922    03 WKS-L011-AREA-DATOS         PIC X(1500).                   028000      
000923    03 WKS-L011-DATOS REDEFINES                                   028100      
000924                      WKS-L011-AREA-DATOS OCCURS 25 TIMES.        028200      
000925*=== AREA DE DATOS PARA LLAMADO DE FUNCION 2                      028300      
000926       05 WKS-L011-F2-MONEDA       PIC 9(04).                     028400      
000927       05 WKS-L011-F2-NCAR         PIC 9(08).                     028500      
000928       05 WKS-L011-F2-IMPCR        PIC 9(16)V99.                  028600      
000929       05 WKS-L011-F2-NABO         PIC 9(08).                     028700      
000930       05 WKS-L011-F2-IMPAB        PIC 9(16)V99.                  028800      
000931       05 WKS-L011-FILLER          PIC X(04).                     028900      
000932    03 WS-L011-DATOS REDEFINES                                    029000      
000933                     WKS-L011-AREA-DATOS OCCURS 25 TIMES.         029100      
000934*=== AREA DE DATOS PARA LLAMADO DE FUNCION 1                      029200      
000935       05 WS-L011-F1-CAJA          PIC 9(04).                     029300      
000936       05 WS-L011-F1-MONEDA        PIC 9(04).                     029400      
000937       05 WS-L011-F1-NCAR          PIC 9(08).                     029500      
000938       05 WS-L011-F1-IMPCR         PIC 9(16)V99.                  029600      
000939       05 WS-L011-F1-NABO          PIC 9(08).                     029700      
000940       05 WS-L011-F1-IMPAB         PIC 9(16)V99.                  029800      
000941                                                                  029900      
000942 77 W77-MSG-OK                     PIC 9(02).                     030000      
000943 88 W88-MSG-OK                     VALUE 0.                       030100      
000944*==============================================================   030200      
000945*         VARIABLES PARA LIBRERIA ESTRUCTURA                  =   030300      
000946*==============================================================   030400      
000947*RGV v                                                            030500      
000948 77  W77-RES-STRUCT                PIC S9(11) BINARY.             030600      
000949 77  W77-NUMSIS                    PIC S9(11) BINARY.             030700      
000950 77  W77-NUMPASO                   PIC S9(11) BINARY.             030800      
000951 77  W77-DEPTO                     PIC 9(04).                     030900      
000952 01  WKS-ENT-STRUCT.                                              031000      
000953     03 WKS-ENT-CVERANGO           PIC 9(02) COMP.                031100      
000954     03 WKS-ENT-OFICINA            PIC 9(04) COMP.                031200      
000955     03 FILLER                     PIC X(27).                     031300      
000956 01  WKS-SAL-STRUCT.                                              031400      
000957     03 WKS-SAL-OFICINA            PIC 9(04) COMP.                031500      
000958     03 WKS-SAL-CVERANGO           PIC 9(02) COMP.                031600      
000959*RGV ^                                                            031700      
000960     03 WKS-SAL-COMITE             PIC 9(04) COMP.                031800      
000961     03 WKS-SAL-AREA               PIC 9(04) COMP.                031900      
000962     03 WKS-SAL-DIVISION           PIC 9(04) COMP.                032000      
000963     03 WKS-SAL-DIRECCION          PIC 9(04) COMP.                032100      
000964     03 WKS-SAL-GERENCIA           PIC 9(04) COMP.                032200      
000965     03 WKS-SAL-OPECOM             PIC 9(04) COMP.                032300      
000966     03 WKS-SAL-TIPO-OFICINA       PIC 9(02) COMP.                032400      
000967     03 WKS-SAL-NCORTO             PIC X(20).                     032500      
000968     03 WKS-SAL-NLARGO             PIC X(40).                     032600      
000969     03 WKS-SAL-DOMICILIO          PIC X(84).                     032700      
000970     03 WKS-SAL-APOSTAL            PIC X(35).                     032800      
000971     03 WKS-SAL-CORRESPONDENCIA    PIC 9(02) COMP.                032900      
000972     03 WKS-SAL-TELEFONO           PIC 9(10) COMP.                033000      
000973     03 WKS-SAL-RESPONSABLE        PIC X(36).                     033100      
000974     03 WKS-SAL-FECALTA            PIC 9(06) COMP.                033200      
000975     03 WKS-SAL-TELRESP            PIC 9(10) COMP.                033300      
000976     03 WKS-SAL-EDO                PIC 9(02) COMP.                033400      
000977     03 WKS-SAL-CD                 PIC 9(04) COMP.                033500      
000978     03 WKS-SAL-MPIO               PIC 9(04) COMP.                033600      
000979     03 WKS-SAL-REGION             PIC 9(02) COMP.                033700      
000980     03 WKS-SAL-ZONA               PIC 9(02) COMP.                033800      
000981     03 WKS-SAL-ZONA-ECO           PIC X(04).                     033900      
000982     03 WKS-SAL-ZONA-SAL           PIC 9(02) COMP.                034000      
000983     03 WKS-SAL-LOC-BDM            PIC 9(08) COMP.                034100      
000984     03 WKS-SAL-NIVEL-AUTO         PIC 9(02) COMP.                034200      
000985     03 WKS-SAL-CSI                PIC 9(02) COMP.                034300      
000986     03 WKS-SAL-CSI-TARCRE         PIC 9(08) COMP.                034400      
000987     03 WKS-SAL-SUCRESP1           PIC 9(08) COMP.                034500      
000988     03 WKS-SAL-SUCRESP2           PIC 9(08) COMP.                034600      
000989     03 WKS-SAL-CTAUNICA           PIC 9(08) COMP.                034700      
000990     03 WKS-SAL-BANCA              PIC 9(02) COMP.                034800      
000991     03 WKS-SAL-FECHA-ALTA         PIC 9(06) COMP.                034900      
000992     03 WKS-SAL-FECHA-BAJA         PIC 9(06) COMP.                035000      
000993     03 WKS-SAL-FECMODIF           PIC 9(06) COMP.                035100      
000994     03 FILLER                     PIC X(72).                     035200      
000995                                                                  035300      
000996*==================================================*              035400      
000997*       TABLA DE SUCURSAL-CSI DE RESIDENCIA        *              035500      
000998*  Indice = sucursal, Contenido = CSI              *              035600      
000999*===================================================              035700      
001000 01 WKS-TABLA-SUC.                                                035800      
001001    03 WKS-NUM-CSI    OCCURS 10000 TIMES PIC 9(02).               035900      
001002                                                                  036000      
001003 77 W77-MI-CSI                     PIC 9(02).                     036100      
001004                                                                  036200      
001005 01  WKS-HDR-LST-ORG-AUX           PIC 9(04).                     036300      
001006 01  WKS-HDR-LST-ORG-AUX-R REDEFINES                              036400      
001007     WKS-HDR-LST-ORG-AUX           PIC 9(08) COMP.                036500      
001008 LINKAGE SECTION.                                                 036600      
001009                                                                  036700      
001010 01 WKS-COMS-MY-PROGRAM-NAME       PIC X(0018).                   036800      
001011 77 W77-COMS-MY-PROGRAM-DESG       REAL.                          036900      
001012                                                                  037000      
001013 01 WKS-COMS-EX-AGENDA-NAME.                                      037100      
001014    03 FILLER                      PIC X(01) VALUE   "S".         037200      
001015    03 WKS-COMS-EX-AGENDA-SIS      PIC 9(03) VALUE   151.         037300      
001016    03 WKS-COMS-EX-AGENDA-MOD      PIC 9(02) VALUE    71.         037400      
001017                                                                  037500      
001018                                                                  037600      
001019 77 W77-COMS-EX-AGENDA-DESG        REAL.                          037700      
001020                                                                  037800      
001021 01 WKS-COMS-AG-SALIDA-NAME        PIC X(50).                     037900      
001022 77 W77-COMS-AG-SALIDA-DESG        REAL.                          038000      
001023 01  LS-NOAPLINCLUDE-PARAMETRO     PIC X(0030).                   038100      
001024 77  LS-NOAPLINCLUDE-DESG          REAL.                          038200      
001025 77  LS-APLINCLUDE-RESULT          PIC S9(011)  BINARY.           038300      
001026     88 LS-APLINCLUDE-OK           VALUE 0.                       038400      
001027 77 W77-COMS-RESULT                PIC S9(011) BINARY.            038500      
001028    88 W88-COMS-OK                 VALUE     0.                   038600      
001029 01 WKS-COMS-DEFSTATION-NAME       PIC X(18).                     038700      
001030 77 W77-COMS-DEFSTATION-DESG       REAL.                          038800      
001031 01 WKS-NOAPLINCLUDE-PARAMETRO     PIC  X(30).                    038900      
001032 77 W77-NOAPLINCLUDE-DESG          REAL.                          039000      
001033 77 W77-NOAPL-RESULT               PIC S9(11) BINARY.             039100      
001034    88 W88-NOAPL-OK                VALUE 0.                       039200      
001035 77 W77-ACEPTA-MSG                 PIC S9(11) BINARY.             039300      
001036    88 W88-ACEPTA-MSG              VALUE 0.                       039400      
001037 77 W77-ESPERACOMS-TIEMPO          PIC S9(11) BINARY  VALUE 60.   039500      
001038 77 W77-ESPERACOMS-TIPO-EVENTO     PIC S9(11) BINARY.             039600      
001039    88 W88-POR-MSG                 VALUE  1.                      039700      
001040    88 W88-POR-ACCEPT              VALUE  2.                      039800      
001041    88 W88-POR-HI                  VALUE  3.                      039900      
001042    88 W88-POR-TIMEOUT             VALUE  4.                      040000      
001043    88 W88-POR-EVENTO              VALUE  5.                      040100      
001044 01 WKS-ESPERACOMS-TIPO-EVENTO     PIC 9(11).                     040200      
001045 01 WKS-SMCOMS-COMANDO.                                           040300      
001046    03 WKS-SMCOMS-STRING1          PIC X(20).                     040400      
001047    03 WKS-SMCOMS-STRING2          PIC X(20).                     040500      
001048 01 WKS-SMCOMS-TRABAJO             PIC X(132).                    040600      
001049 77 W77-SMCOMS-RESULT              PIC S9(11) BINARY.             040700      
001050    88 W88-SMCOMS-OK               VALUE  0.                      040800      
001051                                                                  040900      
001052  COMMUNICATION SECTION.                                          041000      
001053  INPUT HEADER COMS-IN;                                           041100      
001054        PROGRAMDESG            IS CS-COMS-IN-PROGRAM;             041200      
001055        FUNCTIONSTATUS         IS CS-COMS-IN-FUNCTION-STATUS;     041300      
001056        FUNCTIONINDEX          IS CS-COMS-IN-FUNCTION-INDEX;      041400      
001057        USERCODE               IS CS-COMS-IN-USERCODE;            041500      
001058        SECURITYDESG           IS CS-COMS-IN-SECURITY-DESG;       041600      
001059        TRANSPARENT            IS CS-COMS-IN-TRANSPARENT;         041700      
001060        VTFLAG                 IS CS-COMS-IN-VT-FLAG;             041800      
001061        TIMESTAMP              IS CS-COMS-IN-TIMESTAMP;           041900      
001062        STATION                IS CS-COMS-IN-STATION;             042000      
001063        TEXTLENGTH             IS CS-COMS-IN-TEXT-LENGTH;         042100      
001064        STATUSVALUE            IS CS-COMS-IN-STATUS-KEY;          042200      
001065        MESSAGECOUNT           IS CS-COMS-IN-MSG-COUNT;           042300      
001066        RESTART                IS CS-COMS-IN-RST-LOC;             042400      
001067        AGENDA                 IS CS-COMS-IN-AGENDA.              042500      
001068    OUTPUT HEADER COMS-OUT;                                       042600      
001069        DESTCOUNT              IS CS-COMS-OUT-COUNT;              042700      
001070        TEXTLENGTH             IS CS-COMS-OUT-TEXT-LENGTH;        042800      
001071        STATUSVALUE            IS CS-COMS-OUT-STATUS-KEY;         042900      
001072        TRANSPARENT            IS CS-COMS-OUT-TRANSPARENT;        043000      
001073        VTFLAG                 IS CS-COMS-OUT-VT-FLAG;            043100      
001074        CONFIRMFLAG            IS CS-COMS-OUT-CONFIRM-FLAG;       043200      
001075        CONFIRMKEY             IS CS-COMS-OUT-CONFIRM-KEY;        043300      
001076        DESTINATIONDESG        IS CS-COMS-OUT-DESTINATION;        043400      
001077        NEXTINPUTAGENDA        IS CS-COMS-OUT-NEXT-INPUT-AGENDA;  043500      
001078        SETNEXTINPUTAGENDA     IS CS-COMS-OUT-SNEXT-INPUT-AGENDA; 043600      
001079        RETAINTRANSACTIONMODE  IS CS-COMS-OUT-SAVE-TRANS-MODE;    043700      
001080        AGENDA                 IS CS-COMS-OUT-AGENDA.             043800      
001081                                                                  043900      
001082                                                                  044000      
001083PROCEDURE DIVISION.                                               044100      
001084 DECLARATIVES.                                                    044200      
001085 INTERRUPT-BY-HI SECTION.                                         044300      
001086     USE AS INTERRUPT PROCEDURE.                                  044400      
001087 000A-BEGIN-INTERRUPT.                                            044500      
001088    DISALLOW INTERRUPT.                                           044600      
001089    MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-HI.                 044700      
001090    IF W88-HI-2                                                   044800      
001091       IF W77-MONITOR = 0                                         044900      
001092          MOVE "PRENDE MONITOR"                        TO TEXTO-LJ045000      
001093          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ     045100      
001094          MOVE 1 TO W77-MONITOR                                   045200      
001095          MOVE WKS-FECHA-MAQ6D    TO  WKS-FECHA-MON               045300      
001096          ACCEPT WKS-HR-MAQUINA   FROM TIME                       045400      
001097          MOVE WKS-HR-MAQUINA     TO WKS-HORA-MON                 045500      
001098          OPEN OUTPUT A01-MONITOR                                 045600      
001099       ELSE                                                       045700      
001100          NEXT SENTENCE                                           045800      
001101    ELSE                                                          045900      
001102    IF W88-HI-3                                                   046000      
001103       IF W77-MONITOR = 1                                         046100      
001104          CLOSE A01-MONITOR WITH SAVE                             046200      
001105          MOVE "APAGA MONITOR"                         TO TEXTO-LJ046300      
001106          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ     046400      
001107          MOVE 0 TO W77-MONITOR                                   046500      
001108       ELSE                                                       046600      
001109          NEXT SENTENCE                                           046700      
001110    ELSE                                                          046800      
001111    IF W88-HI-4                                                   046900      
001112       MOVE "FIN NORMAL POR OPERADOR"               TO TEXTO-LJ   047000      
001113       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        047100      
001114       MOVE 1 TO W77-FIN                                          047200      
001115    ELSE                                                          047300      
001116    IF W88-HI-6                                                   047400      
001117       MOVE "TERMINACION DE EMERGENCIA"             TO TEXTO-LJ   047500      
001118       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        047600      
001119       MOVE 1 TO W77-FIN                                          047700      
001120    ELSE                                                          047800      
001121        MOVE "     HI2   -> PRENDE MONITOR"   TO TEXTO-LJ         047900      
001122        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       048000      
001123        MOVE "     HI3   -> APAGA MONITOR "   TO TEXTO-LJ         048100      
001124        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       048200      
001125        MOVE "     HI4   -> FIN NORMAL POR OPERADOR" TO TEXTO-LJ  048300      
001126        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      048400      
001127     ALLOW INTERRUPT.                                             048500      
001128 0000A-END.                                                       048600      
001129 END DECLARATIVES.                                                048700      
001130 010000-INICIO-PGMA SECTION.                                      048800      
001131 010100-INICIA-CONTROL.                                           048900      
001132    PERFORM 020000-INICIO.                                        049000      
001133    PERFORM 030100-INI-PROC UNTIL W77-FIN = 1.                    049100      
001134    PERFORM 999999-FIN.                                           049200      
001135    STOP RUN.                                                     049300      
001136                                                                  049400      
001137 020000-INICIO.                                                   049500      
001138*==============                                                   049600      
001139     PERFORM 020100-INI-VARIABLES.                                049700      
001140     PERFORM 020200-LIBRERIAS.                                    049800      
001141     PERFORM 020300-TASKFILE.                                     049900      
001142     PERFORM 020400-COMS.                                         050000      
001143                                                                  050100      
001144 020100-INI-VARIABLES.                                            050200      
001145     MOVE ZERO                    TO W77-FIN                      050300      
001146                                     W77-MONITOR.                 050400      
001147    MOVE "S151"                   TO SISTEMA-LJ.                  050500      
001148    MOVE "P071"                   TO PASO-LJ.                     050600      
001149    MOVE  2                       TO MTP-LJ.                      050700      
001150    MOVE "I"                      TO TIPO-LJ.                     050800      
001151    MOVE 020201                   TO CODIGO-LJ.                   050900      
001152                                                                  051000      
001153 020200-LIBRERIAS.                                                051100      
001154*=================                                                051200      
001155    CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION. 051300      
001156    CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS"                051400      
001157                                  TO "SOPORTECOMS".               051500      
001158                                                                  051600      
001159    CHANGE ATTRIBUTE LIBACCESS    OF "DCILIBRARY" TO  BYFUNCTION. 051700      
001160    CHANGE ATTRIBUTE FUNCTIONNAME OF "DCILIBRARY" TO              051800      
001161                                     "COMSSUPPORT".               051900      
001162                                                                  052000      
001163    CHANGE ATTRIBUTE LIBACCESS    OF "CTRLVERS" TO BYFUNCTION.    052100      
001164    CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".     052200      
001165                                                                  052300      
001166     MOVE "S080BD01CON"           TO WKS-CTLVER-LIBID.            052400      
001167     CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID,          052500      
001168                                       WKS-CTLVER-NOMLIB          052600      
001169                                 GIVING W77-CTLVER-RESULT.        052700      
001170     IF W77-CTLVER-RESULT = 0                                     052800      
001171        CHANGE ATTRIBUTE TITLE OF "ESTRUCTURA" TO                 052900      
001172                                   WKS-CTLVER-NOMLIB              053000      
001173     ELSE                                                         053100      
001174        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  053200      
001175                                                                  053300      
001176    CHANGE ATTRIBUTE TITLE OF "LIB-DISP"  TO                      053400      
001177           "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".       053500      
001178                                                                  053600      
001179    MOVE "S151L001CTL"          TO     WKS-CTLVER-LIBID.          053700      
001180    CALL "DAME_TIT IN CTRLVERS" USING  WKS-CTLVER-LIBID           053800      
001181                                       WKS-CTLVER-NOMLIB          053900      
001182                                GIVING W77-CTLVER-RESULT.         054000      
001183     IF W77-CTLVER-RESULT = 0                                     054100      
001184        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL"                   054200      
001185                               TO WKS-CTLVER-NOMLIB               054300      
001186     ELSE                                                         054400      
001187        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                054500      
001188               "(S151)S151/OBJECT/L001/CONTROL ON CMEMP.".        054600      
001189     CALL "CSIID OF SOPORTECOMS"   USING WKS-DATOS-HOST.          054700      
001190     IF WKS-NUMCSI-HOST = 32                                      054800      
001191        MOVE 10                TO W77-MI-CSI                      054900      
001192     ELSE                                                         055000      
001193        MOVE WKS-NUMCSI-HOST   TO W77-MI-CSI.                     055100      
001194*RGV v                                                            055200      
001195     MOVE  0                   TO  WKS-SAL-OFICINA                055300      
001196                                   W77-RES-STRUCT.                055400      
001197     MOVE  71                  TO  WKS-ENT-CVERANGO.              055500      
001198     PERFORM                   020202-CARGA-ESTRUCT UNTIL         055600      
001199                               W77-RES-STRUCT  > 1.               055700      
001200*RGV ^                                                            055800      
001201     PERFORM 020210-CARGA-SISTEMAS.                               055900      
001202     MOVE ZERO                     TO W77-FIN-SIS.                056000      
001203     PERFORM 020240-LEVANTA-LIBS VARYING W77-IND-SIS FROM 1 BY 1  056100      
001204                                 UNTIL   W77-FIN-SIS = 1.         056200      
001205                                                                  056300      
001206 020202-CARGA-ESTRUCT.                                            056400      
001207*=====================                                            056500      
001208*RGV v                                                            056600      
001209     MOVE  WKS-SAL-OFICINA        TO  WKS-ENT-OFICINA             056700      
001210     MOVE  0                      TO  W77-RES-STRUCT.             056800      
001211     CALL  "L120_NEXT_OFICINA     IN  ESTRUCTURA"          USING  056900      
001212           W77-NUMSIS                                             057000      
001213           W77-NUMPASO                                            057100      
001214           WKS-ENT-STRUCT                                         057200      
001215           WKS-SAL-STRUCT                                  GIVING 057300      
001216           W77-RES-STRUCT.                                        057400      
001217     IF  W77-RES-STRUCT           =   00 OR 01                    057500      
001218         MOVE WKS-SAL-OFICINA     TO W77-IND                      057600      
001219         MOVE WKS-SAL-CSI         TO  WKS-NUM-CSI(W77-IND).       057700      
001220*RGV ^                                                            057800      
001221 020210-CARGA-SISTEMAS.                                           057900      
001222*=====================                                            058000      
001223     MOVE LOW-VALUES               TO WKS-B04SISTEMA.             058100      
001224     MOVE ZEROS                    TO W77-IND-SIS                 058200      
001225                                      WKS-B04-SISTEMA             058300      
001226                                      WKS-B04-PRODUCTO            058400      
001227                                      WKS-B04-INSTRUM.            058500      
001228     MOVE 02                       TO WKS-B04-FUNCION.            058600      
001229     CALL "B04SISTEM IN LIB-CONTROL" USING  WKS-B04SISTEMA        058700      
001230                                     GIVING W77-RESULT-B04.       058800      
001231     IF W77-RESULT-B04 = 0                                        058900      
001232        PERFORM 020220-CARGA-TABLA UNTIL W77-FIN-SIS = 1.         059000      
001233                                                                  059100      
001234 020220-CARGA-TABLA.                                              059200      
001235                                                                  059250      
001236     MOVE LOW-VALUES               TO WKS-S151B03SISMEN.          059300      
001237     MOVE LOW-VALUES               TO WKS-S151B01SISDIA.          059400      
001238     MOVE ZERO                     TO W77-RESULT-B01              059500      
001239                                      W77-RESULT-B03              059600      
001240                                      W77-RESULT-B04.             059700      
001241     MOVE WKS-B04-SISTEMA          TO WKS-B03-SISTEMA             059800      
001242                                      WKS-B01-SISTEMA             059900      
001243                                      W77-SISTEMAS-PUNTEO.        060000      
001244     MOVE 01                       TO WKS-B03-FUNCION.            060100      
001245     CALL "CONSISMEN IN LIB-CONTROL"  USING  WKS-S151B03SISMEN    060200      
001246                                      GIVING W77-RESULT-B03.      060300      
001247                                                                  060400      
001248     MOVE 01                       TO WKS-B01-FUNCION.            060500      
001249     CALL "CONSISDIA IN LIB-CONTROL"  USING  WKS-S151B01SISDIA    060600      
001250                                      GIVING W77-RESULT-B01.      060700      
001251     IF W88-SISTEMAS-PUNTEO AND                                   060800      
001252        W77-RESULT-B01 = 0  AND                                   060900      
001253        W77-RESULT-B03 = 0  AND                                   061000      
001254        W77-RESULT-B04 = 0                                        061100      
001255        IF WKS-B04-ESTATUS = 3                       AND          061200      
001256           (                                                      061300      
001257            (WKS-B03-MODSIS = 1 AND                               061400      
001258             WKS-B03-RESCSI = WKS-NUMCSI-HOST)       OR           061500      
001259            (WKS-B03-MODSIS = 0 AND                               061600      
001260            (WKS-B03-RESCSI = 0 OR WKS-NUMCSI-HOST))              061700      
001261           )                                                      061800      
001262           ADD 1                   TO W77-IND-SIS                 061900      
001263           IF W77-IND-SIS < 51                                    062000      
001264              MOVE WKS-B04-SISTEMA TO WKS-TAB-NUMSIS(W77-IND-SIS) 062100      
001265              MOVE WKS-B01-FECCON  TO WKS-TAB-FECCON(W77-IND-SIS) 062200      
001266              MOVE WKS-B03-MODSIS  TO WKS-TAB-MODSIS(W77-IND-SIS) 062300      
001267              MOVE WKS-B03-RESCSI  TO WKS-TAB-RESCSI(W77-IND-SIS).062400      
001268     MOVE 02                       TO WKS-B04-FUNCION.            062500      
001269     MOVE ZERO                     TO WKS-B04-PRODUCTO            062600      
001270                                      WKS-B04-INSTRUM.            062700      
001271     CALL "B04SISTEM  IN LIB-CONTROL" USING  WKS-B04SISTEMA       062800      
001272                                      GIVING W77-RESULT-B04.      062900      
001273     IF W77-RESULT-B04 > 0                                        063000      
001274        MOVE 1                     TO W77-FIN-SIS.                063100      
001275                                                                  063200      
001276 020240-LEVANTA-LIBS.                                             063300      
001277*====================                                             063400      
001278     IF WKS-TAB-NUMSIS(W77-IND-SIS) > 0                           063500      
001279        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 17                       063600      
001280           MOVE "S151L011C017"         TO    WKS-CTLVER-LIBID     063700      
001281           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     063800      
001282                                             WKS-CTLVER-NOMLIB    063900      
001283                                       GIVING W77-CTLVER-RESULT   064000      
001284           IF W77-CTLVER-RESULT = 0                               064100      
001285              CHANGE ATTRIBUTE TITLE  OF "L011-S017"              064200      
001286                                      TO  WKS-CTLVER-NOMLIB       064300      
001287           ELSE                                                   064400      
001288              CHANGE ATTRIBUTE TITLE  OF "L011-S017"  TO          064500      
001289                "(S151)S151/OBJECT/L011/CONSMOVS017 ON CMEMP."    064600      
001290        ELSE                                                      064700      
001291        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 18                       064800      
001292           MOVE "S151L011C018"         TO    WKS-CTLVER-LIBID     064900      
001293           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     065000      
001294                                             WKS-CTLVER-NOMLIB    065100      
001295                                       GIVING W77-CTLVER-RESULT   065200      
001296           IF W77-CTLVER-RESULT = 0                               065300      
001297              CHANGE ATTRIBUTE TITLE  OF "L011-S018"              065400      
001298                                      TO  WKS-CTLVER-NOMLIB       065500      
001299           ELSE                                                   065600      
001300              CHANGE ATTRIBUTE TITLE  OF "L011-S018"  TO          065700      
001301                "(S151)S151/OBJECT/L011/CONSMOVS018 ON CMEMP."    065800      
001302        ELSE                                                      065900      
001303        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 84                       066000      
001304           MOVE "S151L011C084"         TO    WKS-CTLVER-LIBID     066100      
001305           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     066200      
001306                                             WKS-CTLVER-NOMLIB    066300      
001307                                       GIVING W77-CTLVER-RESULT   066400      
001308           IF W77-CTLVER-RESULT = 0                               066500      
001309              CHANGE ATTRIBUTE TITLE  OF "L011-S084"              066600      
001310                                      TO  WKS-CTLVER-NOMLIB       066700      
001311           ELSE                                                   066800      
001312              CHANGE ATTRIBUTE TITLE  OF "L011-S084"  TO          066900      
001313                "(S151)S151/OBJECT/L011/CONSMOVS084 ON CMEMP."    067000      
001314        ELSE                                                      067100      
001315        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 87                       067200      
001316           MOVE "S151L011C087"         TO    WKS-CTLVER-LIBID     067300      
001317           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     067400      
001318                                             WKS-CTLVER-NOMLIB    067500      
001319                                       GIVING W77-CTLVER-RESULT   067600      
001320           IF W77-CTLVER-RESULT = 0                               067700      
001321              CHANGE ATTRIBUTE TITLE  OF "L011-S087"              067800      
001322                                      TO  WKS-CTLVER-NOMLIB       067900      
001323           ELSE                                                   068000      
001324              CHANGE ATTRIBUTE TITLE  OF "L011-S087"  TO          068100      
001325                "(S151)S151/OBJECT/L011/CONSMOVS087 ON CMEMP."    068200      
001326        ELSE                                                      068300      
001327        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 252                      068400      
001328           MOVE "S151L011C252"         TO    WKS-CTLVER-LIBID     068500      
001329           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     068600      
001330                                             WKS-CTLVER-NOMLIB    068700      
001331                                       GIVING W77-CTLVER-RESULT   068800      
001332           IF W77-CTLVER-RESULT = 0                               068900      
001333              CHANGE ATTRIBUTE TITLE  OF "L011-S252"              069000      
001334                                      TO  WKS-CTLVER-NOMLIB       069100      
001335           ELSE                                                   069200      
001336              CHANGE ATTRIBUTE TITLE  OF "L011-S252"  TO          069300      
001337                "(S151)S151/OBJECT/L011/CONSMOVS252 ON CMEMP."    069400      
001338        ELSE                                                      069500      
001339        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 264                      069600      
001340           MOVE "S151L011C264"         TO    WKS-CTLVER-LIBID     069700      
001341           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     069800      
001342                                             WKS-CTLVER-NOMLIB    069900      
001343                                       GIVING W77-CTLVER-RESULT   070000      
001344           IF W77-CTLVER-RESULT = 0                               070100      
001345              CHANGE ATTRIBUTE TITLE  OF "L011-S264"              070200      
001346                                      TO  WKS-CTLVER-NOMLIB       070300      
001347           ELSE                                                   070400      
001348              CHANGE ATTRIBUTE TITLE  OF "L011-S264"  TO          070500      
001349                "(S151)S151/OBJECT/L011/CONSMOVS264 ON CMEMP."    070600      
001350        ELSE                                                      070700      
001351        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 333                      070800      
001352           MOVE "S151L011C333"         TO    WKS-CTLVER-LIBID     070900      
001353           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     071000      
001354                                             WKS-CTLVER-NOMLIB    071100      
001355                                       GIVING W77-CTLVER-RESULT   071200      
001356           IF W77-CTLVER-RESULT = 0                               071300      
001357              CHANGE ATTRIBUTE TITLE  OF "L011-S333"              071400      
001358                                      TO  WKS-CTLVER-NOMLIB       071500      
001359           ELSE                                                   071600      
001360              CHANGE ATTRIBUTE TITLE  OF "L011-S333"  TO          071700      
001361                "(S151)S151/OBJECT/L011/CONSMOVS333 ON CMEMP."    071800      
001362        ELSE                                                      071900      
001363        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 335                      072000      
001364           MOVE "S151L011C335"         TO    WKS-CTLVER-LIBID     072100      
001365           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     072200      
001366                                             WKS-CTLVER-NOMLIB    072300      
001367                                       GIVING W77-CTLVER-RESULT   072400      
001368           IF W77-CTLVER-RESULT = 0                               072500      
001369              CHANGE ATTRIBUTE TITLE  OF "L011-S335"              072600      
001370                                      TO  WKS-CTLVER-NOMLIB       072700      
001371           ELSE                                                   072800      
001372              CHANGE ATTRIBUTE TITLE  OF "L011-S335"  TO          072900      
001373                "(S151)S151/OBJECT/L011/CONSMOVS335 ON CMEMP."    073000      
001374        ELSE                                                      073100      
001375        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 336                      073200      
001376           MOVE "S151L011C336"         TO    WKS-CTLVER-LIBID     073300      
001377           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     073400      
001378                                             WKS-CTLVER-NOMLIB    073500      
001379                                       GIVING W77-CTLVER-RESULT   073600      
001380           IF W77-CTLVER-RESULT = 0                               073700      
001381              CHANGE ATTRIBUTE TITLE  OF "L011-S336"              073800      
001382                                      TO  WKS-CTLVER-NOMLIB       073900      
001383           ELSE                                                   074000      
001384              CHANGE ATTRIBUTE TITLE  OF "L011-S336"  TO          074100      
001385                "(S151)S151/OBJECT/L011/CONSMOVS336 ON CMEMP."    074200      
001386        ELSE                                                      074300      
001387        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 404                      074400      
001388           MOVE "S151L011C404"         TO    WKS-CTLVER-LIBID     074500      
001389           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     074600      
001390                                             WKS-CTLVER-NOMLIB    074700      
001391                                       GIVING W77-CTLVER-RESULT   074800      
001392           IF W77-CTLVER-RESULT = 0                               074900      
001393              CHANGE ATTRIBUTE TITLE  OF "L011-S404"              075000      
001394                                      TO  WKS-CTLVER-NOMLIB       075102      
001395           ELSE                                                   075204      
001396              CHANGE ATTRIBUTE TITLE  OF "L011-S404"  TO          075306      
001397                "(S151)S151/OBJECT/L011/CONSMOVS404 ON CMEMP."    075408      
001398        ELSE                                                      075500      
001399        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 408                      075512      
001400           MOVE "S151L011C408"         TO    WKS-CTLVER-LIBID     075514      
001401           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     075516      
001402                                             WKS-CTLVER-NOMLIB    075518      
001403                                       GIVING W77-CTLVER-RESULT   075520      
001404           IF W77-CTLVER-RESULT = 0                               075522      
001405              CHANGE ATTRIBUTE TITLE  OF "L011-S408"              075524      
001406                                      TO  WKS-CTLVER-NOMLIB       075526      
001407           ELSE                                                   075528      
001408              CHANGE ATTRIBUTE TITLE  OF "L011-S408"  TO          075530      
001409                "(S151)S151/OBJECT/L011/CONSMOVS408 ON CMEMP."    075532      
001410        ELSE                                                      075534      
001411        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 500                      075600      
001412           MOVE "S151L011C500"         TO    WKS-CTLVER-LIBID     075700      
001413           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     075800      
001414                                             WKS-CTLVER-NOMLIB    075900      
001415                                       GIVING W77-CTLVER-RESULT   076000      
001416           IF W77-CTLVER-RESULT = 0                               076100      
001417              CHANGE ATTRIBUTE TITLE  OF "L011-S500"              076200      
001418                                      TO  WKS-CTLVER-NOMLIB       076300      
001419           ELSE                                                   076400      
001420              CHANGE ATTRIBUTE TITLE  OF "L011-S500"  TO          076500      
001421                "(S151)S151/OBJECT/L011/CONSMOVS500 ON CMEMP."    076600      
001422        ELSE                                                      076700      
001423        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 501                      076800      
001424           MOVE "S151L011C501"         TO    WKS-CTLVER-LIBID     076900      
001425           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     077000      
001426                                             WKS-CTLVER-NOMLIB    077100      
001427                                       GIVING W77-CTLVER-RESULT   077200      
001428           IF W77-CTLVER-RESULT = 0                               077300      
001429              CHANGE ATTRIBUTE TITLE  OF "L011-S501"              077400      
001430                                      TO  WKS-CTLVER-NOMLIB       077500      
001431           ELSE                                                   077600      
001432              CHANGE ATTRIBUTE TITLE  OF "L011-S501"  TO          077700      
001433                "(S151)S151/OBJECT/L011/CONSMOVS501 ON CMEMP."    077800      
001434        ELSE                                                      077900      
001435        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 502                      078000      
001436           MOVE "S151L011C502"         TO    WKS-CTLVER-LIBID     078100      
001437           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     078200      
001438                                             WKS-CTLVER-NOMLIB    078300      
001439                                       GIVING W77-CTLVER-RESULT   078400      
001440           IF W77-CTLVER-RESULT = 0                               078500      
001441              CHANGE ATTRIBUTE TITLE  OF "L011-S502"              078600      
001442                                      TO  WKS-CTLVER-NOMLIB       078700      
001443           ELSE                                                   078800      
001444              CHANGE ATTRIBUTE TITLE  OF "L011-S502"  TO          078900      
001445                "(S151)S151/OBJECT/L011/CONSMOVS502 ON CMEMP."    079000      
001446        ELSE                                                      079100      
001447        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 701                      079200      
001448           MOVE "S151L011C701"         TO    WKS-CTLVER-LIBID     079300      
001449           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     079400      
001450                                             WKS-CTLVER-NOMLIB    079500      
001451                                       GIVING W77-CTLVER-RESULT   079600      
001452           IF W77-CTLVER-RESULT = 0                               079700      
001453              CHANGE ATTRIBUTE TITLE  OF "L011-S701"              079800      
001454                                      TO  WKS-CTLVER-NOMLIB       079900      
001455           ELSE                                                   080000      
001456              CHANGE ATTRIBUTE TITLE  OF "L011-S701"  TO          080100      
001457                "(S151)S151/OBJECT/L011/CONSMOVS701 ON CMEMP."    080200      
001458        ELSE                                                      080300      
001459        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 703                      080400      
001460           MOVE "S151L011C703"         TO    WKS-CTLVER-LIBID     080500      
001461           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     080600      
001462                                             WKS-CTLVER-NOMLIB    080700      
001463                                       GIVING W77-CTLVER-RESULT   080800      
001464           IF W77-CTLVER-RESULT = 0                               080900      
001465              CHANGE ATTRIBUTE TITLE  OF "L011-S703"              081000      
001466                                      TO  WKS-CTLVER-NOMLIB       081100      
001467           ELSE                                                   081200      
001468              CHANGE ATTRIBUTE TITLE  OF "L011-S703"  TO          081300      
001469                "(S151)S151/OBJECT/L011/CONSMOVS703 ON CMEMP."    081400      
001470        ELSE                                                      081500      
001471        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 707                      081600      
001472           MOVE "S151L011C707"         TO    WKS-CTLVER-LIBID     081700      
001473           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     081800      
001474                                             WKS-CTLVER-NOMLIB    081900      
001475                                       GIVING W77-CTLVER-RESULT   082000      
001476           IF W77-CTLVER-RESULT = 0                               082100      
001477              CHANGE ATTRIBUTE TITLE  OF "L011-S707"              082200      
001478                                      TO  WKS-CTLVER-NOMLIB       082300      
001479           ELSE                                                   082400      
001480              CHANGE ATTRIBUTE TITLE  OF "L011-S707"  TO          082500      
001481                "(S151)S151/OBJECT/L011/CONSMOVS707 ON CMEMP."    082600      
001482        ELSE                                                      082700      
001483        IF WKS-TAB-NUMSIS(W77-IND-SIS) = 711                      082800      
001484           MOVE "S151L011C711"         TO    WKS-CTLVER-LIBID     082900      
001485           CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID     083000      
001486                                             WKS-CTLVER-NOMLIB    083100      
001487                                       GIVING W77-CTLVER-RESULT   083200      
001488           IF W77-CTLVER-RESULT = 0                               083300      
001489              CHANGE ATTRIBUTE TITLE  OF "L011-S711"              083400      
001490                                      TO  WKS-CTLVER-NOMLIB       083500      
001491           ELSE                                                   083600      
001492              CHANGE ATTRIBUTE TITLE  OF "L011-S711"  TO          083700      
001493                "(S151)S151/OBJECT/L011/CONSMOVS711 ON CMEMP."    083800      
001494        ELSE                                                      083900      
001495           NEXT SENTENCE                                          084000      
001496     ELSE                                                         084100      
001497        MOVE 1                        TO W77-FIN-SIS.             084200      
001498                                                                  084300      
001499     MOVE LOW-VALUES                  TO WKS-L011-TOTALES.        084400      
001500     PERFORM 030322-CONSULTA-TOTALES.                             084500      
001501                                                                  084600      
001502 020300-TASKFILE.                                                 084700      
001503*================                                                 084800      
001504    MOVE "/"                      TO WKS-DIAGONAL1,WKS-DIAGONAL2. 084900      
001505    ACCEPT WKS-FECHA-MAQUINA      FROM TODAYS-DATE.               085000      
001506    MOVE WKS-FECMAQ-AA            TO WKS-TSK-AA                   085100      
001507                                     WKS-FEC6-AA.                 085200      
001508    MOVE WKS-FECMAQ-MM            TO WKS-TSK-MM                   085300      
001509                                     WKS-FEC6-MM.                 085400      
001510    MOVE WKS-FECMAQ-DD            TO WKS-TSK-DD                   085500      
001511                                     WKS-FEC6-DD.                 085600      
001512    MOVE WKS-NUMCSI-HOST          TO WKS-TSK-NODO.                085700      
001513    MOVE ATTRIBUTE MIXNUMBER      OF MYSELF TO WKS-TSK-MIX.       085800      
001514    SET  MYSELF (OPTION)          TO 1926.                        085900      
001515    SET  MYSELF (FILECARDS)       TO WKS-TIT-TASKFILE.            086000      
001516    ALLOW INTERRUPT.                                              086100      
001517    ATTACH INTERRUPT-BY-HI TO ATTRIBUTE EXCEPTIONEVENT OF MYSELF. 086200      
001518                                                                  086300      
001519 020400-COMS.                                                     086400      
001520*============                                                     086500      
001521    ENABLE INPUT COMS-IN KEY "ONLINE".                            086600      
001522                                                                  086700      
001523*=============== VALIDACION DE AGENDA DE SALIDA ================= 086800      
001524     MOVE "OUTPUT OF LINEA" TO WKS-COMS-AG-SALIDA-NAME.           086900      
001525     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               087000      
001526           USING  WKS-COMS-AG-SALIDA-NAME                         087100      
001527                  VALUE AGENDA                                    087200      
001528                  W77-COMS-AG-SALIDA-DESG                         087300      
001529           GIVING W77-COMS-RESULT.                                087400      
001530     IF W88-COMS-OK                                               087500      
001531        NEXT SENTENCE                                             087600      
001532     ELSE                                                         087700      
001533        PERFORM 900000-FIN-MAL.                                   087800      
001534                                                                  087900      
001535*=============== DESIGNACION DE ESTACION DEFAULT  =============   088000      
001536     MOVE "DEFAULTSTATION" TO WKS-COMS-DEFSTATION-NAME.           088100      
001537     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               088200      
001538           USING WKS-COMS-DEFSTATION-NAME                         088300      
001539                 VALUE STATION                                    088400      
001540                 W77-COMS-DEFSTATION-DESG                         088500      
001541           GIVING W77-COMS-RESULT.                                088600      
001542     IF W88-COMS-OK                                               088700      
001543        NEXT SENTENCE                                             088800      
001544     ELSE                                                         088900      
001545        PERFORM 900000-FIN-MAL.                                   089000      
001546                                                                  089100      
001547*================== VALIDACION DEL PROGRAMA  =====================089200      
001548     MOVE CS-COMS-IN-PROGRAM TO W77-COMS-MY-PROGRAM-DESG          089300      
001549     CALL "GET-NAME-USING-DESIGNATOR OF DCILIBRARY"               089400      
001550           USING  W77-COMS-MY-PROGRAM-DESG                        089500      
001551                  WKS-COMS-MY-PROGRAM-NAME                        089600      
001552           GIVING W77-COMS-RESULT.                                089700      
001553     IF W88-COMS-OK                                               089800      
001554        NEXT SENTENCE                                             089900      
001555     ELSE                                                         090000      
001556        PERFORM 900000-FIN-MAL.                                   090100      
001557                                                                  090200      
001558     MOVE "NOAPL"        TO LS-NOAPLINCLUDE-PARAMETRO             090300      
001559     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               090400      
001560          USING  LS-NOAPLINCLUDE-PARAMETRO                        090500      
001561          VALUE PROGRAM                                           090600      
001562          LS-NOAPLINCLUDE-DESG                                    090700      
001563          GIVING LS-APLINCLUDE-RESULT.                            090800      
001564     IF NOT LS-APLINCLUDE-OK                                      090900      
001565        PERFORM 900000-FIN-MAL.                                   091000      
001566                                                                  091100      
001567 030100-INI-PROC.                                                 091200      
001568*================                                                 091300      
001569   PERFORM 030100-ACEPTA-MENSAGE.                                 091400      
001570   IF W88-ACEPTA-MSG                                              091500      
001571      PERFORM 030200-ANALIZA-MSG                                  091600      
001572      IF W88-MSG-OK AND WKS-SA2-MENSAJE-RESULT = 0                091700      
001573          PERFORM 030250-ARMA-CALL-LIB                            091800      
001574          PERFORM 030300-PROCESA-MSG                              091900      
001575          PERFORM 030700-ENVIA-RESPUESTA                          092000      
001576      ELSE                                                        092100      
001577         IF WKS-SA2-MENSAJE-RESULT = 2                            092200      
001578            PERFORM 030700-ENVIA-RESPUESTA.                       092300      
001579                                                                  092400      
001580 030100-ACEPTA-MENSAGE.                                           092500      
001581*======================                                           092600      
001582    MOVE ZERO                   TO W77-ACEPTA-MSG.                092700      
001583    CALL "ESPERACOMS OF SOPORTECOMS"                              092800      
001584         USING  W77-ESPERACOMS-TIEMPO                             092900      
001585         GIVING W77-ESPERACOMS-TIPO-EVENTO.                       093000      
001586    IF W88-POR-MSG OR W88-POR-EVENTO                              093100      
001587       NEXT SENTENCE                                              093200      
001588    ELSE                                                          093300      
001589    IF W88-POR-TIMEOUT                                            093400      
001590       MOVE 1                   TO W77-ACEPTA-MSG                 093500      
001591    ELSE                                                          093600      
001592    IF W88-POR-ACCEPT                                             093700      
001593       ACCEPT W77-SALIDA                                          093800      
001594       MOVE 1                   TO W77-ACEPTA-MSG                 093900      
001595    ELSE                                                          094000      
001596    IF W88-POR-HI                                                 094100      
001597       MOVE 1                   TO W77-ACEPTA-MSG                 094200      
001598       IF W88-HI-4                                                094300      
001599          PERFORM 800000-HI-SALIDA                                094400      
001600          PERFORM 999999-FIN.                                     094500      
001601                                                                  094600      
001602 030200-ANALIZA-MSG.                                              094700      
001603*===================                                              094800      
001604    MOVE ZERO                          TO W77-MSG-OK              094900      
001605                                          W77-LONGMSG             095000      
001606                                          WKS-SA2-MENSAJE-RESULT. 095100      
001607    RECEIVE COMS-IN MESSAGE INTO WKS-MENSAJE-COMS                 095200      
001608                    NO DATA NEXT SENTENCE.                        095300      
001609    IF CS-COMS-IN-STATUS-KEY = 99                                 095400      
001610       MOVE 1                          TO W77-FIN                 095500      
001611                                          W77-MSG-OK              095600      
001612    ELSE                                                          095700      
001613    IF CS-COMS-IN-STATUS-KEY = 0 OR 89 OR 92 OR 93                095800      
001614       IF WKS-SA2-DESTINO-SISTEMA    = 151      AND               095900      
001615          WKS-SA2-DESTINO-CODSERV    = 1        AND               096000      
001616          WKS-SA2-DESTINO-SUBCODSERV = 1 OR 2                     096100      
001617          MOVE WKS-MENSAJE-ENTRE-APLIS TO WKS-MSG-TEXTO           096200      
001618          IF WKS-HDR-LST-ORG-R IS NUMERIC                         096300      
001619             MOVE WKS-HDR-LST-ORG-R TO WKS-HDR-LST-ORG-AUX-R      096400      
001620          ELSE                                                    096500      
001621             MOVE WKS-HDR-LST-ORG   TO WKS-HDR-LST-ORG-AUX        096600      
001622       ELSE                                                       096700      
001623          MOVE 2                       TO WKS-SA2-MENSAJE-RESULT  096800      
001624          MOVE 24                      TO W77-LONGMSG             096900      
001625    ELSE                                                          097000      
001626       MOVE 1                          TO W77-MSG-OK              097100      
001627       MOVE "ERROR EN RECEIVE COMS"    TO TEXTO-LJ                097200      
001628       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       097300      
001629    IF W88-MONITOR                                                097400      
001630        MOVE SPACES                TO R01-REG-MONITOR             097500      
001631        ACCEPT WKS-FECHA-MAQUINA   FROM DATE                      097600      
001632        ACCEPT WKS-HR-MAQUINA      FROM TIME                      097700      
001633        MOVE WKS-HR-MAQUINA        TO WKS-STR-HORA-MAQ            097800      
001634        STRING WKS-FECHA-MAQUINA  " "                             097900      
001635               WKS-STR-HORA-MAQ   " "                             098000      
001636               "ENTRADA : "  WKS-MENSAJE-COMS                     098100      
001637        DELIMITED BY SIZE                                         098200      
001638        INTO R01-REG-MONITOR                                      098300      
001639        WRITE R01-REG-MONITOR.                                    098400      
001640                                                                  098500      
001641 030250-ARMA-CALL-LIB.                                            098600      
001642*=====================                                            098700      
001643     MOVE LOW-VALUES               TO WKS-L011-TOTALES.           098800      
001644     IF WKS-SA2-DESTINO-CODSERV    = 1                            098900      
001645        IF WKS-SA2-DESTINO-SUBCODSERV = 2                         099000      
001646           MOVE WKS-ENIVEL2-FECOPE TO WKS-L011-FECHA              099100      
001647           MOVE WKS-ENIVEL2-SUC    TO WKS-L011-SUCURSAL           099200      
001648                                      WKS-NIVEL2-SUC              099300      
001649           MOVE WKS-ENIVEL2-CAJA   TO WKS-L011-CAJA               099400      
001650                                      WKS-NIVEL2-CAJA             099500      
001651           MOVE WKS-ENIVEL2-SISCON TO WKS-NIVEL2-SISCON           099600      
001652           MOVE WKS-ENIVEL2-MONCON TO WKS-NIVEL2-MONCON           099700      
001653                                      WKS-L011-MONCON.            099800      
001654                                                                  099810      
001655     IF WKS-SA2-DESTINO-CODSERV    = 1                            099820      
001656        IF WKS-SA2-DESTINO-SUBCODSERV = 1                         099830      
001657           MOVE WKS-ENIVEL1-FECOPE TO WKS-L011-FECHA              099840      
001658           MOVE WKS-ENIVEL1-SUC    TO WKS-L011-SUCURSAL           099850      
001659                                      WKS-NIVEL1-SUC              099855      
001660           MOVE WKS-ENIVEL1-CAJCON TO WKS-L011-CAJA               099860      
001661           MOVE WKS-ENIVEL1-MONCON TO WKS-L011-MONCON             099870      
001662           MOVE WKS-ENIVEL1-SISCON TO WKS-ENIVEL2-SISCON.         099880      
001663                                                                  099900      
001664 030300-PROCESA-MSG.                                              100000      
001665*==================                                               100100      
001666    MOVE WKS-SA2-DESTINO-SUBCODSERV TO WKS-L011-FUNCION.          100200      
001667    PERFORM 030310-LIMPIA-ARREGLO                                 100300      
001668            VARYING W77-IND FROM 1 BY 1                           100400      
001669            UNTIL   W77-IND > W77-NUM-MOVTOS.                     100500      
001670    MOVE 1                     TO W77-IND.                        100600      
001671    MOVE 1                     TO W77-IND-SIS.                    100700      
001672    MOVE 1                     TO WKS-SA2-MENSAJE-RESULT          100800      
001673    PERFORM 030320-BUSCA-SISTEMA                                  100900      
001674       UNTIL WKS-TAB-NUMSIS(W77-IND-SIS) = 0 OR                   101000      
001675             W77-IND > W77-NUM-MOVTOS        OR                   101100      
001676             W77-IND-SIS > 50.                                    101200      
001677    IF W77-IND = 1                                                101300      
001678       MOVE 2                  TO WKS-SA2-MENSAJE-RESULT          101400      
001679       MOVE 24                 TO W77-LONGMSG                     101500      
001680       IF WKS-SA2-DESTINO-SUBCODSERV = 1                          101600      
001681          MOVE ZERO            TO WKS-NIVEL1-SISCON               101700      
001682                                  WKS-NIVEL1-MONCON               101800      
001683                                  WKS-NIVEL1-CAJCON               101900      
001684          ADD 65               TO W77-LONGMSG                     102000      
001685          MOVE 1               TO WKS-NIVEL1-ERROR(1)             102100      
001686       ELSE                                                       102200      
001687          MOVE ZERO            TO WKS-NIVEL2-MONCON               102300      
001688                                  WKS-NIVEL2-SISCON               102400      
001689          ADD 61               TO W77-LONGMSG                     102500      
001690          MOVE 1               TO WKS-NIVEL2-ERROR(1).            102600      
001691                                                                  102700      
001692 030310-LIMPIA-ARREGLO.                                           102800      
001693*======================                                           102900      
001694    MOVE ZERO                  TO WKS-NIVEL2-SIS(W77-IND)         103000      
001695                                  WKS-NIVEL2-MON(W77-IND)         103100      
001696                                  WKS-NIVEL2-NCAR(W77-IND)        103200      
001697                                  WKS-NIVEL2-ICAR(W77-IND)        103300      
001698                                  WKS-NIVEL2-NABO(W77-IND)        103400      
001699                                  WKS-NIVEL2-IABO(W77-IND)        103500      
001700                                  WKS-NIVEL1-SIS(W77-IND)         103600      
001701                                  WKS-NIVEL1-MON(W77-IND)         103700      
001702                                  WKS-NIVEL1-NCAR(W77-IND)        103900      
001703                                  WKS-NIVEL1-ICAR(W77-IND)        104000      
001704                                  WKS-NIVEL1-NABO(W77-IND)        104100      
001705                                  WKS-NIVEL1-IABO(W77-IND).       104200      
001706                                                                  104300      
001707                                                                  104400      
001708 030320-BUSCA-SISTEMA.                                            104500      
001709*=====================                                            104600      
001710    IF WKS-TAB-NUMSIS(W77-IND-SIS) > WKS-ENIVEL2-SISCON           104700      
001711       MOVE WKS-TAB-NUMSIS(W77-IND-SIS) TO WKS-NIVEL2-SISCON      104800      
001712                                           WKS-NIVEL1-SISCON      104900      
001713       MOVE WKS-L011-FECHA              TO                        105000      
001714                                  WKS-TAB-FECCON(W77-IND-SIS)     105100      
001715       MOVE ZEROS                       TO WKS-L011-AREA-DATOS    105200      
001716       PERFORM 030322-CONSULTA-TOTALES                            105300      
001717       IF WKS-L011-FUNCION = 1                                    105600      
001718          PERFORM 030321-RECIBE-RESPLIB-FUN1                      105700      
001719       ELSE                                                       105800      
001720          PERFORM 030321-RECIBE-RESPLIB-FUN2.                     105900      
001721     ADD 1                       TO W77-IND-SIS.                  106000      
001722                                                                  106100      
001723 030321-RECIBE-RESPLIB-FUN1.                                      106200      
001724*===========================                                      106300      
001725       MOVE W77-RESULT-L011 TO WKS-NIVEL1-ERROR(W77-IND).         106400      
001726       IF W77-RESULT-L011      = 0 AND                            106500      
001727          WS-L011-F1-MONEDA(1) > 0                                106600      
001728          MOVE ZERO                TO WKS-NIVEL1-ERROR(W77-IND)   106700      
001729          PERFORM 030326-MUEVE-TOTALES-FUN1                       106800      
001730                  VARYING W77-IND2 FROM 1 BY 1                    106900      
001731                  UNTIL   WS-L011-F1-MONEDA(W77-IND2) = 0  OR     107000      
001732                          W77-IND2 > W77-NUM-MOVTOS        OR     107100      
001733                          W77-IND  > W77-NUM-MOVTOS               107200      
001734       ELSE                                                       107300      
001735          IF WKS-TAB-NUMSIS(W77-IND-SIS) = 711                    107400      
001736             MOVE ZERO       TO WKS-NIVEL1-SISCON                 107500      
001737                                WKS-NIVEL1-MONCON                 107600      
001738                                WKS-NIVEL1-CAJCON                 107700      
001739          ELSE                                                    107800      
001740             MOVE WKS-TAB-NUMSIS(W77-IND-SIS)                     107900      
001741                             TO WKS-NIVEL1-SISCON                 108000      
001742             MOVE 99         TO WKS-NIVEL1-MONCON                 108100      
001743                                WKS-NIVEL1-CAJCON.                108200      
001744 030321-RECIBE-RESPLIB-FUN2.                                      108300      
001745*===========================                                      108400      
001746       IF W77-RESULT-L011 = 0 AND                                 108500      
001747          WKS-L011-F2-MONEDA(1) > 0                               108600      
001748          MOVE ZERO                TO WKS-NIVEL2-ERROR(W77-IND)   108700      
001749          PERFORM 030324-MUEVE-TOTALES-FUN2                       108800      
001750                  VARYING W77-IND2 FROM 1 BY 1                    108900      
001751                  UNTIL   WKS-L011-F2-MONEDA(W77-IND2) = 0 OR     109000      
001752                          W77-IND2 > W77-NUM-MOVTOS        OR     109100      
001753                          W77-IND  > W77-NUM-MOVTOS               109200      
001754       ELSE                                                       109300      
001755          IF WKS-TAB-NUMSIS(W77-IND-SIS) = 711                    109400      
001756             MOVE ZERO          TO WKS-NIVEL2-SISCON              109500      
001757                                   WKS-NIVEL2-MONCON              109600      
001758          ELSE                                                    109700      
001759             MOVE WKS-TAB-NUMSIS(W77-IND-SIS)                     109800      
001760                                TO WKS-NIVEL2-SISCON              109900      
001761             MOVE 99            TO WKS-NIVEL2-MONCON.             110000      
001762                                                                  110100      
001763 030322-CONSULTA-TOTALES.                                         110200      
001764*========================                                         110300      
001765     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 17                          110400      
001766        CALL "TOTALESCI   IN L011-S017"                           110500      
001767              USING  WKS-L011-TOTALES                             110600      
001768              GIVING W77-RESULT-L011                              110700      
001769     ELSE                                                         110800      
001770     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 18                          110900      
001771        CALL "TOTALESCI   IN L011-S018"                           111000      
001772              USING  WKS-L011-TOTALES                             111100      
001773              GIVING W77-RESULT-L011                              111200      
001774     ELSE                                                         111300      
001775     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 84                          111400      
001776        CALL "TOTALESCI   IN L011-S084"                           111500      
001777              USING  WKS-L011-TOTALES                             111600      
001778              GIVING W77-RESULT-L011                              111700      
001779     ELSE                                                         111800      
001780     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 87                          111900      
001781        CALL "TOTALESCI   IN L011-S087"                           112000      
001782              USING  WKS-L011-TOTALES                             112100      
001783              GIVING W77-RESULT-L011                              112200      
001784     ELSE                                                         112300      
001785     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 252                         112310      
001786        CALL "TOTALESCI   IN L011-S252"                           112320      
001787              USING  WKS-L011-TOTALES                             112330      
001788              GIVING W77-RESULT-L011                              112340      
001789     ELSE                                                         112350      
001790     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 264                         112400      
001791        CALL "TOTALESCI   IN L011-S264"                           112500      
001792              USING  WKS-L011-TOTALES                             112600      
001793              GIVING W77-RESULT-L011                              112700      
001794     ELSE                                                         112800      
001795     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 333                         112900      
001796        CALL "TOTALESCI   IN L011-S333"                           113000      
001797              USING  WKS-L011-TOTALES                             113100      
001798              GIVING W77-RESULT-L011                              113200      
001799     ELSE                                                         113300      
001800     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 335                         113400      
001801        CALL "TOTALESCI   IN L011-S335"                           113500      
001802              USING  WKS-L011-TOTALES                             113600      
001803              GIVING W77-RESULT-L011                              113700      
001804     ELSE                                                         113800      
001805     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 336                         113900      
001806        CALL "TOTALESCI   IN L011-S336"                           114000      
001807              USING  WKS-L011-TOTALES                             114100      
001808              GIVING W77-RESULT-L011                              114200      
001809     ELSE                                                         114300      
001810     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 404                         114400      
001811        CALL "TOTALESCI   IN L011-S404"                           114500      
001812              USING  WKS-L011-TOTALES                             114600      
001813              GIVING W77-RESULT-L011                              114700      
001814     ELSE                                                         114810      
001815     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 408                         114820      
001816        CALL "TOTALESCI   IN L011-S408"                           114830      
001817              USING  WKS-L011-TOTALES                             114840      
001818              GIVING W77-RESULT-L011                              114850      
001819     ELSE                                                         114860      
001820     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 500                         114900      
001821        CALL "TOTALESCI   IN L011-S500"                           115000      
001822              USING  WKS-L011-TOTALES                             115100      
001823              GIVING W77-RESULT-L011                              115200      
001824     ELSE                                                         115300      
001825     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 501                         115400      
001826        CALL "TOTALESCI   IN L011-S501"                           115500      
001827              USING  WKS-L011-TOTALES                             115600      
001828              GIVING W77-RESULT-L011                              115700      
001829     ELSE                                                         115800      
001830     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 502                         115900      
001831        CALL "TOTALESCI   IN L011-S502"                           116000      
001832              USING  WKS-L011-TOTALES                             116100      
001833              GIVING W77-RESULT-L011                              116200      
001834     ELSE                                                         116300      
001835     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 701                         116400      
001836        CALL "TOTALESCI   IN L011-S701"                           116500      
001837              USING  WKS-L011-TOTALES                             116600      
001838              GIVING W77-RESULT-L011                              116700      
001839     ELSE                                                         116800      
001840     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 703                         116900      
001841        CALL "TOTALESCI   IN L011-S703"                           117000      
001842              USING  WKS-L011-TOTALES                             117100      
001843              GIVING W77-RESULT-L011                              117200      
001844     ELSE                                                         117300      
001845     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 707                         117400      
001846        CALL "TOTALESCI   IN L011-S707"                           117500      
001847              USING  WKS-L011-TOTALES                             117600      
001848              GIVING W77-RESULT-L011                              117700      
001849     ELSE                                                         117800      
001850     IF WKS-TAB-NUMSIS(W77-IND-SIS) = 711                         117900      
001851        CALL "TOTALESCI   IN L011-S711"                           118000      
001852              USING  WKS-L011-TOTALES                             118100      
001853              GIVING W77-RESULT-L011                              118200      
001854    ELSE                                                          118300      
001855    MOVE 3                  TO W77-RESULT-L011.                   118400      
001856    IF W88-MONITOR                                                118500      
001857       MOVE SPACES                TO R01-REG-MONITOR              118600      
001858       ACCEPT WKS-FECHA-MAQUINA   FROM DATE                       118700      
001859       ACCEPT WKS-HR-MAQUINA      FROM TIME                       118800      
001860       MOVE WKS-HR-MAQUINA        TO WKS-STR-HORA-MAQ             118900      
001861       MOVE W77-RESULT-L011 TO W77-ERROR                          119000      
001862       STRING WKS-FECHA-MAQUINA " "                               119100      
001863              WKS-STR-HORA-MAQ  " "                               119200      
001864              "CONSULTA SISTEMA : " WKS-NIVEL2-SISCON             119300      
001865              " DATOS ENTRADA FN "  WKS-L011-FUNCION              119400      
001866              " FECHA "             WKS-L011-FECHA                119500      
001867              " SUC "               WKS-L011-SUCURSAL             119600      
001868              " CAJA "              WKS-L011-CAJA                 119700      
001869              " CONTINUACION "      WKS-L011-CONT                 119800      
001870              " RESULT L011 "       W77-ERROR                     119900      
001871       DELIMITED BY SIZE                                          120000      
001872       INTO R01-REG-MONITOR                                       120100      
001873       WRITE R01-REG-MONITOR.                                     120200      
001874                                                                  120300      
001875 030324-MUEVE-TOTALES-FUN2.                                       120400      
001876*=========================                                        120500      
001877    IF WKS-L011-F2-MONEDA(W77-IND2) > 0                           120600      
001878      MOVE WKS-TAB-NUMSIS(W77-IND-SIS) TO WKS-NIVEL2-SISCON       120800      
001879                                          WKS-NIVEL2-SIS (W77-IND)120900      
001880      MOVE WKS-L011-F2-MONEDA(W77-IND2) TO WKS-NIVEL2-MON(W77-IND)121000      
001881                                           WKS-NIVEL2-MONCON      121100      
001882      MOVE WKS-L011-CAJA               TO WKS-NIVEL2-CAJA         121200      
001883      MOVE WKS-L011-F2-NCAR (W77-IND2) TO WKS-NIVEL2-NCAR(W77-IND)121300      
001884      MOVE WKS-L011-F2-IMPCR(W77-IND2) TO WKS-NIVEL2-ICAR(W77-IND)121400      
001885      MOVE WKS-L011-F2-NABO (W77-IND2) TO WKS-NIVEL2-NABO(W77-IND)121500      
001886      MOVE WKS-L011-F2-IMPAB(W77-IND2) TO WKS-NIVEL2-IABO(W77-IND)121600      
001887      MOVE W77-RESULT-L011            TO WKS-NIVEL2-ERROR(W77-IND)121700      
001888      ADD  57                          TO W77-LONGMSG             121800      
001889      MOVE W77-IND                     TO WKS-NIVEL2-OCURRENCIAS  121900      
001890      IF W77-IND = 1                                              122000      
001891         ADD 24                        TO W77-LONGMSG             122100      
001892         ADD 1                         TO W77-IND                 122200      
001893      ELSE                                                        122300      
001894         ADD 1                         TO W77-IND.                122400      
001895                                                                  122500      
001896 030326-MUEVE-TOTALES-FUN1.                                       122600      
001897*=========================                                        122700      
001898    IF WS-L011-F1-MONEDA(W77-IND2) > 0                            122800      
001899*      MOVE WKS-L011-FECHA              TO WKS-NIVEL1-FECOPE      122900      
001900       MOVE WKS-TAB-NUMSIS(W77-IND-SIS) TO WKS-NIVEL1-SISCON      123000      
001901                                           WKS-NIVEL1-SIS(W77-IND)123100      
001902       MOVE WS-L011-F1-CAJA(W77-IND2)  TO  WKS-NIVEL1-CAJCON      123200      
001903       MOVE WS-L011-F1-MONEDA(W77-IND2) TO WKS-NIVEL1-MON(W77-IND)123400      
001904                                           WKS-NIVEL1-MONCON      123500      
001905       MOVE WS-L011-F1-NCAR (W77-IND2) TO WKS-NIVEL1-NCAR(W77-IND)123600      
001906       MOVE WS-L011-F1-IMPCR(W77-IND2) TO WKS-NIVEL1-ICAR(W77-IND)123700      
001907       MOVE WS-L011-F1-NABO (W77-IND2) TO WKS-NIVEL1-NABO(W77-IND)123800      
001908       MOVE WS-L011-F1-IMPAB(W77-IND2) TO WKS-NIVEL1-IABO(W77-IND)123900      
001909       MOVE W77-RESULT-L011           TO WKS-NIVEL1-ERROR(W77-IND)124000      
001910       ADD  57                         TO W77-LONGMSG             124100      
001911       MOVE W77-IND                     TO WKS-NIVEL1-OCURRENCIAS 124200      
001912       IF W77-IND = 1                                             124300      
001913          ADD 24                       TO W77-LONGMSG             124400      
001914          ADD 1                        TO W77-IND                 124500      
001915       ELSE                                                       124600      
001916          ADD 1                        TO W77-IND.                124700      
001917                                                                  124800      
001918 030700-ENVIA-RESPUESTA.                                          124900      
001919*=======================                                          125000      
001920     MOVE WKS-SA2-DESTINO-SISTEMA    TO WKS-SA2-ORI-SISTEMA    .  125100      
001921     MOVE WKS-SA2-DESTINO-CODSERV    TO WKS-SA2-ORI-CODSERV    .  125200      
001922     MOVE WKS-SA2-DESTINO-SUBCODSERV TO WKS-SA2-ORI-SUBCODSERV .  125300      
001923     MOVE WKS-SA2-ORIGEN-SISTEMA     TO WKS-SA2-DESTINO-SISTEMA.  125400      
001924     MOVE WKS-SA2-ORIGEN-CODSERV     TO WKS-SA2-DESTINO-CODSERV.  125500      
001925     MOVE WKS-SA2-ORIGEN-SUBCODSERV  TO WKS-SA2-DESTINO-SUBCODSERV125600      
001926     MOVE WKS-SA2-ORI-SISTEMA        TO WKS-SA2-ORIGEN-SISTEMA.   125700      
001927     MOVE WKS-SA2-ORI-CODSERV        TO WKS-SA2-ORIGEN-CODSERV    125800      
001928     MOVE WKS-SA2-ORI-SUBCODSERV     TO WKS-SA2-ORIGEN-SUBCODSERV.125900      
001929     MOVE 2                          TO WKS-SA2-RESULT-ICA.       126000      
001930     MOVE 2                          TO WKS-SA2-DIRECCION.        126100      
001931     MOVE 6                          TO WKS-HDR-RES.              126150      
001932     MOVE 1                          TO WKS-SA2-MENSAJE-MODO.     126200      
001933     MOVE WKS-PREFIJO-DESTINO        TO WKS-PREF-DES       .      126300      
001934     MOVE WKS-PREFIJO-ORIGEN         TO WKS-PREFIJO-DESTINO.      126400      
001935     MOVE WKS-PREF-DES               TO WKS-PREFIJO-ORIGEN .      126500      
001936     MOVE W77-COMS-DEFSTATION-DESG   TO CS-COMS-OUT-DESTINATION.  126600      
001937     MOVE W77-COMS-AG-SALIDA-DESG    TO CS-COMS-OUT-AGENDA.       126700      
001938     ADD  W77-HDR-BNMX               TO W77-LONGMSG               126800      
001939     ADD  W77-HDR-SA2                TO W77-LONGMSG               126900      
001940     MOVE W77-LONGMSG                TO WKS-SA2-LONG-MSG          127000      
001941                                        CS-COMS-OUT-TEXT-LENGTH.  127100      
001942     MOVE 1                          TO CS-COMS-OUT-COUNT.        127200      
001943     MOVE 0                          TO CS-COMS-OUT-STATUS-KEY.   127300      
001944     MOVE WKS-MENSAJE-SAL            TO WKS-MENSAJE-ENTRE-APLIS.  127400      
001945     MOVE WKS-HDR-CCR-DES            TO WKS-CCR-DES               127500      
001946     MOVE WKS-HDR-CCR-ORG            TO WKS-HDR-CCR-DES.          127600      
001947     MOVE WKS-CCR-DES                TO WKS-HDR-CCR-ORG.          127700      
001948     MOVE WKS-HDR-APL-ORG            TO WKS-HDR-APL-DES.          127800      
001949     MOVE "0"                        TO WKS-HDR-APL-ORG.          127900      
001950     IF WKS-HDR-COP-ORG > 00                                      128000      
001951        MOVE WKS-HDR-COP-ORG TO WKS-HDR-CCR-DES.                  128100      
001952                                                                  128200      
001953     IF WKS-HDR-LST-ORG-AUX-R IS NUMERIC                          128300      
001954        MOVE WKS-HDR-LST-ORG-AUX-R TO WKS-HDR-LST-ORG-R           128400      
001955     ELSE                                                         128500      
001956        MOVE WKS-HDR-LST-ORG-AUX   TO WKS-HDR-LST-ORG.            128600      
001957     SEND COMS-OUT FROM WKS-MENSAJE-COMS.                         128700      
001958     IF W88-MONITOR                                               128800      
001959        MOVE SPACES                TO R01-REG-MONITOR             128900      
001960        ACCEPT WKS-FECHA-MAQUINA   FROM DATE                      129000      
001961        ACCEPT WKS-HR-MAQUINA      FROM TIME                      129100      
001962        MOVE WKS-HR-MAQUINA        TO WKS-STR-HORA-MAQ            129200      
001963        STRING WKS-FECHA-MAQUINA  " "                             129300      
001964               WKS-STR-HORA-MAQ   " "                             129400      
001965               "SALIDA : "                                        129500      
001966               WKS-MENSAJE-COMS                                   129600      
001967        DELIMITED BY SIZE                                         129700      
001968        INTO R01-REG-MONITOR                                      129800      
001969        WRITE R01-REG-MONITOR.                                    129900      
001970                                                                  130000      
001971     IF CS-COMS-OUT-STATUS-KEY = 0 OR 96                          130100      
001972        NEXT SENTENCE                                             130200      
001973     ELSE                                                         130300      
001974       MOVE CS-COMS-OUT-STATUS-KEY TO W77-ERROR                   130400      
001975       STRING "ERROR EN SEND MESSAGE ST-KEY = "                   130500      
001976              W77-ERROR                                           130600      
001977       DELIMITED BY SIZE                                          130700      
001978       INTO TEXTO-LJ                                              130800      
001979       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       130900      
001980                                                                  131000      
001981 800000-HI-SALIDA.                                                131100      
001982    MOVE  020201                              TO CODIGO-LJ.       131200      
001983    MOVE  "I"                                 TO TIPO-LJ.         131300      
001984                                                                  131400      
001985    IF W88-HI-4                                                   131500      
001986       MOVE "TERMINACION NORMAL"              TO TEXTO-LJ         131600      
001987    ELSE                                                          131700      
001988    IF W88-HI-6                                                   131800      
001989       MOVE "TERMINACION DE EMERGENCIA"       TO TEXTO-LJ.        131900      
001990    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                      132000      
001991                                MENSAJE-LJ.                       132100      
001992 900000-FIN-MAL.                                                  132200      
001993    STRING " ERROR EN COMS, FIN ERRORNEO DE PROGRAMA "            132300      
001994           " AVISAR AL RESPONSABLE DEL SISTEMA "                  132400      
001995    DELIMITED BY SIZE                                             132500      
001996    INTO TEXTO-LJ.                                                132600      
001997    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.          132700      
001998    PERFORM 999999-FIN.                                           132800      
001999                                                                  132900      
002000 999999-FIN.                                                      133000      
002001     MOVE "DISABLE PROGRAM "       TO WKS-SMCOMS-STRING1          133100      
002002     MOVE WKS-COMS-MY-PROGRAM-NAME TO WKS-SMCOMS-STRING2          133200      
002003     CALL "SMCOMS OF SOPORTECOMS"                                 133300      
002004           USING  WKS-SMCOMS-COMANDO                              133400      
002005                  WKS-SMCOMS-TRABAJO                              133500      
002006           GIVING W77-SMCOMS-RESULT.                              133600      
002007     IF W88-SMCOMS-OK                                             133700      
002008        NEXT SENTENCE                                             133800      
002009     ELSE                                                         133900      
002010        MOVE W77-SMCOMS-RESULT     TO W77-RESULT-COMS             134000      
002011        STRING                                                    134100      
002012             " ERROR DISABLE RESULT "                             134200      
002013             W77-RESULT-COMS                                      134300      
002014        DELIMITED BY SIZE                                         134400      
002015        INTO TEXTO-LJ                                             134500      
002016        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      134600      
002017                                                                  134700      
002018     IF W77-MONITOR = 1                                           134800      
002019        CLOSE A01-MONITOR WITH SAVE.                              134900      
002020                                                                  135000      
002021 999999-EXIT.                                                     135100      
002022     EXIT.                                                        135200      
