000001$$SET XREF LIST STACK MAP LINEINFO ERRORLIMIT=50 NEWID "S151/P116"000500      
000002*$SET FEDLEVEL = 5                                                001000      
000003*$SET TADS                                                        001100      
000004 IDENTIFICATION DIVISION.                                         001500      
000005   PROGRAM-ID.                S151-P116-CONCENTRA.                002000      
000006* IMPLANTACION.             ROGELIO RAMOS P.  NOV/84.             002500      
000007* MODIFICACION.             ANSELMO SANCHEZ MTZ. ABR'99.          003000      
000008* INSTALLATION.             BANCO NACIONAL DE MEXICO              003500      
000009 DATE-WRITTEN.              AGOSTO DE 1984.                       004000      
000010 DATE-COMPILED.                                                   004500      
000011*SECURITY.                                                        005000      
000012*--------------------------------------------------------------*  005500      
000013*                                                                 006000      
000014*    SSSSS  00000  33333  00000       //    11    11   66666      006500      
000015*    S      0   0      3  0   0      //    111   111   6          007000      
000016*    SSSSS  0   0  3333   0   0     //      11    11   66666      007500      
000017*        S  0   0      3  0   0    //       11    11   6   6      008000      
000018*    SSSSS  00000  33333  00000   //        11    11   66666      008500      
000019*                                                                 009000      
000020*                                                              *  009010      
000021* RECOMPILACION POR EL UPGRADE DEL MCP A 55                    *  009012      
000022* 20141208 15MTP001 MJGRG                                      *  009014      
000023*--------------------------------------------------------------*  009500      
000024*  DIC '85:  CONTROL DEL TOTAL DE LA INFORMACION DE CADA LOG,  *  013500      
000025*           YA  QUE COMO ESTOS SON TRANSMITIDOS VIA XFER,  SI  *  014000      
000026*           SE  PERDIA PARTE DE TAL ARCHIVO EN EL CAMINO,  NO  *  014500      
000027*           ERA DETECTADO EN ESTE PASO.  CADA LOG DEBERA CON-  *  015000      
000028*           TENER  AL PRINCIPIO UN HEADER O REGISTRO DE  CON-  *  015500      
000029*           TROL,  ASI COMO AL FINAL DE  LOS MOVIMIENTOS,  UN  *  016000      
000030*           TRAILER O REGISTRO TOTALIZADOR.                    *  016500      
000031*--------------------------------------------------------------*  040500      
000032/                                                                 041000      
000033 ENVIRONMENT DIVISION.                                            041500      
000034 CONFIGURATION SECTION.                                           042000      
000035 SOURCE-COMPUTER.           A3.                                   042500      
000036 OBJECT-COMPUTER.           A3.                                   043000      
000037 INPUT-OUTPUT SECTION.                                            043500      
000038 FILE-CONTROL.                                                    044000      
000039*                                                                 044500      
000040     SELECT FILE1        ASSIGN TO DISK.                          045000      
000041     SELECT LOG-GRAL     ASSIGN TO DISK.                          048500      
000042     SELECT LOG-CSI      ASSIGN TO DISK.                          049500      
000043     SELECT COMPENSACION ASSIGN TO DISK                           050500      
000044            ORGANIZATION IS INDEXED                               051000      
000045            ACCESS MODE  IS DYNAMIC                               051500      
000046            RECORD KEY   IS LLAVE-COMP.                           052000      
000047     SELECT SORT1-RESUMEN ASSIGN TO SORT DISK.                    053000      
000048     SELECT SORT2-DETECTA ASSIGN TO SORT DISK.                    054000      
000049     SELECT A01-CONTROL   ASSIGN TO DISK                          054100      
000050                          ORGANIZATION IS SEQUENTIAL.             054200      
000051     SELECT V00-REPORTE2 ASSIGN TO PRINTER.                       056600      
000052/                                                                 057500      
000053 DATA DIVISION.                                                   058000      
000054 FILE SECTION.                                                    058500      
000055*                                                                 059000      
000056 FD  V00-REPORTE2                                                 059050      
000057     VALUE OF TITLE WKS-TIT-REPORTE2.                             059100      
000058                                                                  059150      
000059 01  V00-R00-REPORTE2             PIC X(132).                     059200      
000060                                                                  059250      
000061 FD  FILE1                                                        059500      
000062     VALUE OF DEPENDENTSPECS TRUE.                                060000      
000063 01 REG-FILE1                     PIC X(180).                     060500      
000064*************************************                             060600      
000065*   ARCHIVO DE CONTROL DE FECHAS    *                             060700      
000066*************************************                             060800      
000067 FD  A01-CONTROL                                                  060900      
000068     VALUE OF TITLE IS "(S151)S151/FILE/CONTROL/CORP."            061000      
000069     VALUE OF DEPENDENTSPECS IS TRUE.                             061100      
000070                                                                  061200      
000071 01  A01-REG-CONTROL                      PIC X(90).              061300      
000072*                                                                 068000      
000073/***************************************************              068500      
000074*   LOG DE MOVIMIENTOS DE APLICACIONES EN LINEA,   *              069000      
000075*   TRANSMITIDO DESDE CADA C.S.I.                  *              069500      
000076****************************************************              070000      
000077 FD  LOG-CSI                                                      070500      
000078                            BLOCK  CONTAINS  10 RECORDS           071000      
000079                            RECORD CONTAINS 160 CHARACTERS        071500      
000080                            VALUE OF TITLE NOMBRE-LOGCSI          072000      
000081                            DATA RECORD IS REG-LOG-CSI .          072500      
000082 01  REG-LOG-CSI                  PIC  X(160).                    073000      
000083*                                                                 073500      
000084****************************************************              074000      
000085*    LOG GENERAL CON TODAS LAS TRANSACCIONES DE    *              074500      
000086*    APLICACIONES EN LINEA, ACEPTADAS PARA EL      *              075000      
000087*    PROCESO DE COMPENSACION.                      *              075500      
000088****************************************************              076000      
000089*                                                                 076500      
000090 FD  LOG-GRAL                                                     077000      
000091                            BLOCK  CONTAINS  40 RECORDS           077500      
000092                            RECORD CONTAINS 160 CHARACTERS        078000      
000093                            VALUE OF TITLE NOMBRE-LOG-GRAL        078500      
000094                            DATA RECORD IS REG-LOG-GRAL.          079000      
000095 01  REG-LOG-GRAL                 PIC  X(160).                    079500      
000096/                                                                 080000      
000097*                                                                 080502      
000098*********************************************************         080504      
000099*    DESCRIPCION DEL ARCHIVO DE COMPENSACION  NACIONAL  *         080506      
000100*    CONTIENE LA SUMARIZACION DE OPERACIONES POR  CADA  *         080508      
000101*    C.S.I.B. REGIONAL                                  *         080510      
000102*********************************************************         080512      
000103*                                                                 080514      
000104 FD  COMPENSACION                                                 080516      
000105     BLOCK  CONTAINS  12 RECORDS                                  080518      
000106     RECORD CONTAINS  72 CHARACTERS                               080520      
000107     DATA RECORD IS REG-COMPENSACION                              080522      
000108     VALUE OF                                                     080524      
000109             AREAS    IS 20                                       080526      
000110             AREASIZE IS 84                                       080528      
000111             TITLE    "S151/FILE/COMPENSACION".                   080530      
000112*                                                                 080532      
000113 01  REG-COMPENSACION.                                            080534      
000114     02  LLAVE-COMP.                                              080536      
000115         03 CSI-LOCAL-COMP        PIC 9(02).                      080538      
000116            88 LOCAL-COMP-VALIDO  VALUES ARE 2,4,10.              080540      
000117         03 MONEDA-COMP           PIC 9(03).                      080542      
000118            88 MON-COMP-VALIDO    VALUES ARE 1 THRU 999.          080544      
000119         03 FECHA-COMP            PIC 9(06).                      080546      
000120         03 APL-ORI-COMP          PIC 9(04).                      080548      
000121            88 APL-ORI-VALIDO     VALUES ARE 1 THRU 9999.         080550      
000122         03 CSI-FORANEO-COMP      PIC 9(02).                      080552      
000123            88 FORAN-COMP-VALIDO  VALUES ARE 2,4,10.              080554      
000124         03 FILLER                PIC 9(01).                      080556      
000125     02  CIFRAS-COMP              COMP.                           080558      
000126         03 OPER-APLI-COMP        OCCURS   2 TIMES.               080560      
000127             04 NUM-CARGOS-COMP   PIC S9(07).                     080562      
000128             04 NUM-ABONOS-COMP   PIC S9(07).                     080564      
000129             04 IMP-CARGOS-COMP   PIC S9(15)V9(02).               080566      
000130             04 IMP-ABONOS-COMP   PIC S9(15)V9(02).               080568      
000131     02  OTROS-DATOS-COMP.                                        080570      
000132         03 DUMMY-COMP            PIC 9(02).                      080572      
000133*                                                                 080574      
000134*--------------------------------------------------------------*  081000      
000135*          DESCRIPCION DEL ARCHIVO " P R I N T E R "           *  081500      
000136*--------------------------------------------------------------*  082000      
000137                                                                  082500      
000138*FD  REPORTE                                                      083000      
000139*    VALUE OF TITLE IS WS-NOMB-REPORTE                            083100      
000140*             USERBACKUPNAME TRUE                                 083200      
000141*     DATA RECORD IS LINEA.                                       083500      
000142*01  LINEA                       PIC X(132).                      084000      
000143*                                                                 084500      
000144*FD  LISTADO                                                      085000      
000145*    VALUE OF TITLE IS WS-NOMB-REPORTE                            085100      
000146*             USERBACKUPNAME TRUE                                 085200      
000147*     DATA RECORD IS LREP2.                                       085500      
000148*01  LREP2                       PIC X(132).                      086000      
000149*                                                                 086500      
000150/--------------------------------------------------------------*  087000      
000151*          DESCRIPCION DEL ARCHIVO DE SORT                     *  087500      
000152*--------------------------------------------------------------*  088000      
000153 SD SORT1-RESUMEN.                                                088500      
000154 01 REG-SORT1.                                                    089000      
000155    03 RS1-RESUMEN                PIC X(180).                     089500      
000156    03 RS1-RESUMEN-R              REDEFINES RS1-RESUMEN.          090000      
000157       05 RS1-LLAVE               PIC X(018).                     090500      
000158       05 RS1-RESTO               PIC X(160).                     091000      
000159       05 FILLER                  PIC X(002).                     091100      
000160*                                 ---------------------           091500      
000161*                 TAMA\O          180 CARACTERES = 30 PALABRAS    092000      
000162*                                                                 092500      
000163*                                                                 093000      
000164 SD SORT2-DETECTA.                                                093500      
000165 01 REG-SORT2.                                                    094000      
000166    03 RS2-DETECTA                PIC X(240).                     094500      
000167    03 RS2-DETECTA-R              REDEFINES RS2-DETECTA.          095000      
000168       05 RS2-LLAVE               PIC X(072).                     095500      
000169       05 RS2-RESTO               PIC X(160).                     096000      
000170       05 FILLER                  PIC X(008).                     096100      
000171*                                 ---------------------           096500      
000172*                 TAMA\O          240 CARACTERES = 40 PALABRAS    097000      
000173*                                                                 097500      
000174/                                                                 098000      
000175 WORKING-STORAGE SECTION.                                         098500      
000176*                                                                 099000      
000177*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000178* COPY "(S151)S151/FORMATO/DISPLAY.".                             099100      
000179                                                                  000100      
000180*===============================================================* 000200      
000181*         FORMATO PARA DISPLAYS                                 * 000300      
000182*===============================================================* 000400      
000183                                                                  000500      
000184 01 WKS-TIT-REPORTE2.                                             000600      
000185    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000186    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000187    02 FILLER                       PIC X(06) VALUE               000900      
000188                                              "/LIST/".           001000      
000189    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000190    02 FILLER                       PIC X(01) VALUE "/".          001071      
000191    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000192    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000193    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000194    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000195    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000196    02 FILLER                       PIC X(11) VALUE               001600      
000197                                              "/001MSGIMP.".      001700      
000198                                                                  002100      
000199 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000200                                                                  002300      
000201***********************************************************       002400      
000202*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000203***********************************************************       002600      
000204 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000205*8D                                                               002800      
000206 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000207 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000208    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000209    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000210    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000211*8D                                                               003400      
000212 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000213 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000214    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000215    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000216    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000217                                                                  004100      
000218 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000219                                                                  004300      
000220 01 WKS-FECHA-HORA2.                                              004400      
000221    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000222    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000223       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000224       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000225    02 WKS-TIME-MAQ2.                                             004600      
000226       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
000227       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
000228          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
000229          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
000230          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
000231       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
000232    02 FILLER                             PIC X(01).              004900      
000233    02 WKS-RESTO2                         PIC X(04).              005000      
000234                                                                  005100      
000235*8D                                                               005200      
000236****************** REPORTE DE MENSAJES *********************      005300      
000237 01 WLI-ENCAB-12.                                                 005400      
000238    03 FILLER                             PIC X(05) VALUE         005500      
000239       "S151-".                                                   005600      
000240    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000241    03 FILLER                             PIC X(15) VALUE         005671      
000242       "-001IMPMENSAJES".                                         005691      
000243    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000244    03 FILLER                             PIC X(34) VALUE         005800      
000245       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000246    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000247    03 FILLER                             PIC X(26) VALUE         006100      
000248       "FECHA DE LA INFORMACION : ".                              006200      
000249    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000250    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000251       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000252       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000253       05  WKS-SLASH1                         PIC X(01).          006356      
000254       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000255       05  WKS-SLASH2                         PIC X(01).          006358      
000256       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000257 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000258 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000259    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000260    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000261    03 FILLER                          PIC X(01).                 006371      
000262    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000263    03 FILLER                          PIC X(01).                 006381      
000264    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000265*8D                                                               006400      
000266 01 WLI-ENCAB-22.                                                 006500      
000267     03 FILLER                          PIC X(11) VALUE           006600      
000268        "F.PROCESO: ".                                            006700      
000269     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000270     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000271     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
000272     03 FILLER                          PIC X(01) VALUE ":".      007020      
000273     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
000274     03 FILLER                          PIC X(01) VALUE ":".      007060      
000275     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
000276     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000277     03 FILLER                          PIC X(24) VALUE           007200      
000278              "IMPRESION MENSAJES DEL S".                         007300      
000279     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000280     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000281     03 FILLER                          PIC X(14) VALUE           007600      
000282        "TIPO PROCESO: ".                                         007700      
000283     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000284*8D                                                               007900      
000285 01 WLI-ENCAB-32.                                                 008000      
000286     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000287*       "VERSION  : ".                                            008200      
000288*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000289     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000290     03 FILLER                     PIC X(07) VALUE                008500      
000291        "HOJA : ".                                                008600      
000292     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000293                                                                  008800      
000294 01 WLI-ENCAB-42.                                                 008900      
000295     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000296     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000297     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000298                                                                  009300      
000299 01 WLI-ENCAB-52.                                                 009400      
000300    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000301    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000302    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000303    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000304                                                                  009900      
000305*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
000306 01 WLI-ENCAB-62.                                                 009910      
000307    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
000308    03 WLI-RESULT                 PIC X(04).                      009920      
000309    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
000310    03 WLI-TEXTO                  PIC X(110).                     009930      
000311                                                                  009935      
000312 01 WLI-TOT-ENVIO.                                                009940      
000313    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
000314    03 FILLER                     PIC X(37) VALUE                 009950      
000315       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
000316    03 WLI-ENV-CTD                PIC X(04).                      009960      
000317*FIN - INFOWARE                                                   009970      
000318****************************************************************  010000      
000319*                 CONTADORES DE HOJAS                          *  010100      
000320****************************************************************  010200      
000321                                                                  010300      
000322  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000323*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000324 01 WS-REG-SORT1.                                                 099500      
000325    03 WS-RS1-RESUMEN             PIC X(180).                     100000      
000326    03 WS-RS1-RESUMEN-R           REDEFINES WS-RS1-RESUMEN.       100500      
000327       05 WS-RS1-LLAVE.                                           101000      
000328          07 WS-RS1-CSI-ORI       PIC  9(002).                    101500      
000329          07 WS-RS1-CVE-MON       PIC  9(003).                    102000      
000330          07 WS-RS1-FECHA         PIC  9(006).                    102500      
000331          07 WS-RS1-APL-ORI       PIC  9(004).                    103000      
000332          07 WS-RS1-CSI-DES       PIC  9(002).                    103500      
000333          07 FILLER               PIC  9(001).                    104000      
000334       05 WS-RS1-RESTO            PIC  X(160).                    104500      
000335       05 FILLER                  PIC  X(002).                    104600      
000336*                                                                 105000      
000337 01 WS-REG-SORT1-ANT.                                             105500      
000338    03 WS-RS1-RESUMEN-ANT         PIC X(180).                     106000      
000339    03 WS-RS1-RESUMEN-ANT-R       REDEFINES WS-RS1-RESUMEN-ANT.   106500      
000340       05 WS-RS1-LLAVE-ANT.                                       107000      
000341          07 WS-RS1-CSI-ORI-ANT   PIC  9(002).                    107500      
000342          07 WS-RS1-CVE-MON-ANT   PIC  9(003).                    108000      
000343          07 WS-RS1-FECHA-ANT     PIC  9(006).                    108500      
000344          07 WS-RS1-APL-ORI-ANT   PIC  9(004).                    109000      
000345          07 WS-RS1-CSI-DES-ANT   PIC  9(002).                    109500      
000346          07 FILLER               PIC  9(001).                    110000      
000347       05 WS-RS1-RESTO-ANT        PIC  X(160).                    110500      
000348       05 FILLER                  PIC  X(002).                    110600      
000349*                                                                 111000      
000350*                                                                 111500      
000351 01 WS-REG-SORT2.                                                 112000      
000352    03 WS-RS2-DETECTA             PIC X(240).                     112500      
000353    03 WS-RS2-DETECTA-R           REDEFINES WS-RS2-DETECTA.       113000      
000354       05 WS-RS2-LLAVE.                                           113500      
000355          07 WS-RS2-CVE-MON       PIC 9(03)       COMP.           114000      
000356          07 WS-RS2-APL-ORI       PIC 9(04)       COMP.           114500      
000357          07 WS-RS2-APL-DES       PIC 9(04)       COMP.           115000      
000358          07 FILLER               PIC 9(01)       COMP.           115500      
000359          07 WS-RS2-STA-NAME      PIC X(08).                      116000      
000360          07 WS-RS2-ID-CTA        PIC X(20).                      116500      
000361          07 WS-RS2-N-AUTOR       PIC X(20).                      117000      
000362          07 WS-RS2-IMP-MOV       PIC 9(16)V99    COMP.           117500      
000363          07 WS-RS2-TIPO-MOV      PIC 9(02)       COMP.           118000      
000364          07 WS-RS2-STATUS        PIC 9(02)       COMP.           118500      
000365          07 WS-RS2-HORA-GEN      PIC 9(06)       COMP.           119000      
000366          07 FILLER               PIC X(04).                      119500      
000367       05 WS-RS2-RESTO            PIC X(160).                     120000      
000368       05 FILLER                  PIC X(008).                     120100      
000369*                                                                 120500      
000370/                                                                 121000      
000371 01  WS-DATOS-SORTS.                                              121500      
000372     03  WS-MEM-SIZE              PIC 9(10) VALUE 0.              122000      
000373     03  WS-DISK-SIZE             PIC 9(10) VALUE 0.              122500      
000374     03  WS-ULTREG-LOG-SORT2      PIC 9(10) VALUE 0.              123000      
000375     03  WS-ULTREG-LOG-SORT1      PIC 9(10) VALUE 0.              123500      
000376     03  WS-REGSIZE-LOG-SORT2     PIC 9(02) VALUE 30.             124000      
000377     03  WS-REGSIZE-LOG-SORT1     PIC 9(02) VALUE 40.             124500      
000378     03  WS-CT1-MSIZE             PIC 9(02) VALUE 03.             125000      
000379     03  WS-CT2-MSIZE             PIC 9(04) VALUE 1200.           125500      
000380     03  WS-CT3-MSIZE             PIC 9(04) VALUE 1500.           126000      
000381*                                                                 126500      
000382 77 WS-FORMATO                    PIC S9(11) BINARY.              127000      
000383 77 WS-FUNCION                    PIC S9(11) BINARY.              127500      
000384 77 WS-FECHA1                     PIC  X(08).                     128000      
000385 77 WS-FECHA1-NUM                 REDEFINES WS-FECHA1             128500      
000386                                  PIC  9(08).                     129000      
000387 77 WS-FECHA2                     PIC  9(08).                     129100      
000388 77 W77-FECHA-PROC                PIC 9(08).                      129200      
000389 77 W77-JUL-YY4                   PIC  9(04).                     129250      
000390 77 W77-STATUS                    PIC  9(04).                     129300      
000391 77 W77-VALUE                     PIC  9(08).                     129400      
000392*                                                                 130000      
000393/                                                                 130500      
000394*                                                                 131002      
000395*********************************************************         131004      
000396*    DESCRIPCION DEL ARCHIVO S151/FILE/GUARDIAN/CORP    *         131006      
000397*********************************************************         131008      
000398*                                                                 131010      
000399*ASM 01 WS-REG-GUARDIAN.                                          131012      
000400*ASM02 WS-RG-LLAVE.                                               131014      
000401*ASM   03 WS-RG-APLICACION        PIC 9(04).                      131016      
000402*ASM   03 FILLER                  PIC 9(02).                      131018      
000403*ASM02 WS-RG-DATOS.                                               131020      
000404*ASM   03 WS-RG-SIGLAS            PIC X(02).                      131022      
000405*ASM   03 WS-RG-DESC-CORTA        PIC X(07).                      131024      
000406*ASM   03 WS-RG-DESC-LARGA        PIC X(14).                      131026      
000407*ASM   03 FILLER                  PIC X(11).                      131028      
000408*ASM   03 WS-RG-SEC               PIC 9(02).                      131030      
000409*ASM   03 WS-RG-FEC-INT           PIC 9(06).                      131032      
000410*                                                                 131034      
000411*ASM 01 WS-REG-CTL-GUARDIAN.                                      131036      
000412*ASM02 WS-RGC-LLAVE               PIC 9(06).                      131038      
000413*ASM02 WS-RGC-DATOS.                                              131040      
000414*ASM   03 WS-RGC-FECHA-CONTABLE   PIC 9(06).                      131042      
000415*ASM   03 WS-RGC-FECHA-CONTABLE-R REDEFINES WS-RGC-FECHA-CONTABLE.131044      
000416*ASM      05 WS-RGC-DD            PIC 9(02).                      131046      
000417*ASM      05 WS-RGC-MM            PIC 9(02).                      131048      
000418*ASM      05 WS-RGC-AA            PIC 9(02).                      131050      
000419*ASM   03 WS-RGC-FECHA-REAL       PIC 9(06).                      131052      
000420*ASM   03 WS-RGC-HORA-REAL        PIC 9(06).                      131054      
000421*ASM   03 WS-RGC-DATOS-FOLIOS.                                    131056      
000422*ASM      05 WS-RGC-NUM-FOLIO-INI PIC 9(08).                      131058      
000423*ASM      05 WS-RGC-NUM-FOLIO-FIN PIC 9(08).                      131060      
000424*ASM      05 WS-RGC-NUM-FOLIO-ACT PIC 9(08).                      131062      
000425*ASM   03 WS-RGC-OTROS-DATOS      REDEFINES WS-RGC-DATOS-FOLIOS.  131064      
000426*ASM      05 WS-RGC-CSI           PIC 9(02).                      131066      
000427*ASM      05 FILLER               PIC X(22).                      131068      
000428*                                                                 131070      
000429*ASM 01 WS-REG-GUARD-DEFAULT.                                     131072      
000430*ASM02 FILLER                     PIC 9(04) VALUE 9999.           131074      
000431*ASM02 FILLER                     PIC 9(02) VALUE ZEROS.          131076      
000432*ASM02 FILLER                     PIC X(02) VALUE "**".           131078      
000433*ASM02 FILLER                     PIC X(14) VALUE "* * * * * * *".131080      
000434*ASM02 FILLER                     PIC X(11) VALUE "  ".           131082      
000435*ASM02 FILLER                     PIC 9(02) VALUE 99.             131084      
000436*ASM02 FILLER                     PIC 9(06) VALUE 999999.         131086      
000437/                                                                 131088      
000438/                                                                 131500      
000439*----------------------------------------------------------------*132002      
000440*       DESCRIPCION DEL S151/XFER/FILE/INFOICA/OOODDD/AAMMDD     *132004      
000441*----------------------------------------------------------------*132006      
000442*                                                                 132008      
000443**** -------       D  E  T  A  L  L  E       -------- ****        132010      
000444*                                                                 132012      
000445 01 WS-REG-DET-INFOICA            PIC X(160).                     132014      
000446 01 WS-REG-DET-INFOICA-R          REDEFINES WS-REG-DET-INFOICA.   132016      
000447    03 WS-RDI-CSI-ORI             PIC 9(02).                      132018      
000448       88 RDI-CSI-ORI-VAL         VALUES ARE 2,4,10.              132020      
000449    03 WS-RDI-NOD-ORI             PIC 9(02).                      132022      
000450    03 WS-RDI-CSI-DES             PIC 9(02).                      132024      
000451       88 RDI-CSI-DES-VAL         VALUES ARE 2,4,10.              132026      
000452    03 WS-RDI-NOM-EST             PIC X(08).                      132028      
000453    03 WS-RDI-NOM-EST-R           REDEFINES WS-RDI-NOM-EST.       132030      
000454       05 WS-RDI-TIPO-DISP        PIC X(01).                      132032      
000455       05 WS-RDI-SUC-ORI          PIC 9(04).                      132034      
000456       05 WS-RDI-CAJA-ORI         PIC X(03).                      132036      
000457    03 WS-RDI-FEC-GEN             PIC 9(08).                      132038      
000458    03 WS-RDI-HOR-GEN             PIC 9(06).                      132040      
000459    03 WS-RDI-HOR-GEN-R           REDEFINES WS-RDI-HOR-GEN.       132042      
000460       05 WS-RDI-HOR-GEN-HH       PIC 9(02).                      132044      
000461       05 WS-RDI-HOR-GEN-MM       PIC 9(02).                      132045      
000462       05 FILLER                  PIC 9(02).                      132046      
000463    03 WS-RDI-APL-ORI             PIC 9(04).                      132048      
000464    03 WS-RDI-APL-DES             PIC 9(04).                      132050      
000465    03 WS-RDI-STA-TRN             PIC 9(02).                      132052      
000466       88 RDI-STA-TRN-ENVIADO     VALUE 1.                        132054      
000467       88 RDI-STA-TRN-APLICADO    VALUE 2.                        132056      
000468       88 RDI-STA-TRN-OPERADO     VALUE 3.                        132058      
000469       88 RDI-STA-TRN-DENEGADO    VALUE 4.                        132060      
000470       88 RDI-STA-TRN-PENDIENTE   VALUE 5.                        132062      
000471       88 RDI-STA-TRN-VAL         VALUE 1 THRU 5.                 132064      
000472    03 WS-RDI-COD-SER             PIC 9(02).                      132066      
000473       88 RDI-COD-SER-CARGO       VALUE 10.                       132068      
000474       88 RDI-COD-SER-ABONO       VALUE 20.                       132070      
000475       88 RDI-COD-SER-ELIMCARGO   VALUE 11.                       132072      
000476       88 RDI-COD-SER-ELIMABONO   VALUE 21.                       132074      
000477       88 RDI-COD-SER-VAL         VALUES ARE 10,11,20,21.         132076      
000478    03 WS-RDI-SUB-SER             PIC 9(03).                      132078      
000479    03 WS-RDI-CTA-DES             PIC X(20).                      132080      
000480    03 WS-RDI-CTA-DES-R           REDEFINES WS-RDI-CTA-DES.       132082      
000481       05 FILLER                  PIC X(09).                      132084      
000482       05 WS-RDI-CTA-DES-SUC      PIC 9(04).                      132086      
000483       05 WS-RDI-CTA-DES-NUM      PIC 9(07).                      132088      
000484    03 WS-RDI-IMP-TRN             PIC 9(16)V99.                   132090      
000485    03 WS-RDI-MON-TRN             PIC 9(03).                      132092      
000486    03 WS-RDI-FEC-CON             PIC 9(08).                      132094      
000487    03 WS-RDI-CVE-AUT             PIC X(20).                      132096      
000488    03 WS-RDI-NUM-TRN             PIC 9(08).                      132098      
000489    03 WS-RDI-CTA-ACC             PIC X(20).                      132100      
000490    03 WS-RDI-REF-OPE             PIC X(20).                      132102      
000491*                                                                 132104      
000492**** -------  REGISTRO DE CONTROL O HEADER  --------- ****        132106      
000493 01 WS-REG-HEA-INFOICA            PIC X(160).                     132108      
000494 01 WS-REG-HEA-INFOICA-R          REDEFINES WS-REG-HEA-INFOICA.   132110      
000495    03 WS-RHI-ID                  PIC X(003).                     132112      
000496       88 RHI-ID-HDR              VALUE "HDR".                    132114      
000497    03 WS-RHI-FEC-PRO             PIC 9(008).                     132116      
000498    03 WS-RHI-FEC-GEN             PIC 9(008).                     132118      
000499    03 WS-RHI-HOR-GEN             PIC 9(004).                     132120      
000500    03 WS-RHI-SIS-EMI             PIC X(004).                     132122      
000501    03 WS-RHI-SIS-REC             PIC X(004).                     132124      
000502    03 WS-RHI-NOM-EXT             PIC X(008).                     132126      
000503    03 WS-RHI-NUM-REG             PIC 9(007).                     132128      
000504    03 WS-RHI-CSI-ORI             PIC X(003).                     132130      
000505    03 WS-RHI-CSI-DES             PIC X(003).                     132132      
000506    03 FILLER                     PIC X(108).                     132134      
000507*                                                                 132136      
000508**** -------  REGISTRO TOTALIZADOR O TRAILER  --------- ****      132138      
000509 01 WS-REG-TRA-INFOICA            PIC X(160).                     132140      
000510 01 WS-REG-TRA-INFOICA-R          REDEFINES WS-REG-TRA-INFOICA.   132142      
000511    03 WS-RTI-ID                  PIC X(003).                     132144      
000512       88 RTI-ID-HDR              VALUE "TLR".                    132146      
000513    03 WS-RTI-NUM-REG             PIC 9(007).                     132148      
000514    03 FILLER                     PIC X(150).                     132150      
000515*                                                                 132152      
000516* ETIQUETA EXTERNA                                                132154      
000517*                                                                 132156      
000518 01 NOMBRE-INFOICA.                                               132158      
000519    03 FILLER                     PIC X(23) VALUE                 132160      
000520                                  "S151/XFER/FILE/INFOICA/".      132162      
000521    03 NI-CSI-ORI                 PIC X(03).                      132164      
000522    03 NI-CSI-DES                 PIC X(03).                      132166      
000523    03 FILLER                     PIC X(01) VALUE "/".            132168      
000524    03 NI-CSI-FEC                 PIC 9(06).                      132170      
000525    03 NI-CSI-FEC-R               REDEFINES NI-CSI-FEC.           132172      
000526       05 NI-CSI-FEC-AA           PIC 9(02).                      132174      
000527       05 NI-CSI-FEC-MM           PIC 9(02).                      132176      
000528       05 NI-CSI-FEC-DD           PIC 9(02).                      132178      
000529    03 FILLER                     PIC X(01) VALUE ".".            132180      
000530*                                                                 132182      
000531/                                                                 132500      
000532*----------------------------------------------------------------*133002      
000533*       DESCRIPCION DEL ARCHIVO S151/FILE/LOGCSI/XXX/DDMMAA      *133004      
000534*----------------------------------------------------------------*133006      
000535*                                                                 133008      
000536**** -------       D  E  T  A  L  L  E       -------- ****        133010      
000537*  EL FORMATO ES IGUAL AL QUE SE TIENE PARA EL S030ROCBD          133012      
000538 01 WS-REG-LOG                    PIC X(160).                     133014      
000539*                                                                 133016      
000540**** -------  REGISTRO DE CONTROL O HEADER  --------- ****        133018      
000541 01  WS-REG-LOG-CONTROL           REDEFINES WS-REG-LOG.           133020      
000542     02  WS-RLC-IDENT             PIC X(006).                     133022      
000543     02  WS-RLC-CSI               PIC X(003).                     133024      
000544     02  WS-RLC-FECONT            PIC 9(008).                     133026      
000545     02  WS-RLC-CVESIS            PIC X(004).                     133028      
000546     02  WS-RLC-FECHA             PIC 9(008).                     133030      
000547     02  WS-RLC-HH                PIC 9(002).                     133032      
000548     02  WS-RLC-MM                PIC 9(002).                     133033      
000549     02  WS-RLC-SS                PIC 9(002).                     133034      
000550     02  FILLER                   PIC X(125).                     133035      
000551*                                                                 133036      
000552**** -------  REGISTRO TOTALIZADOR O TRAILER -------- ****        133038      
000553 01  WS-RG-LOG-TRAILER           REDEFINES WS-REG-LOG.            133040      
000554     02  WS-RLT-IDENT             PIC X(07).                      133042      
000555     02  WS-RLT-NCO               PIC 9(06).                      133044      
000556     02  WS-RLT-ICO               PIC 9(18)V99.                   133046      
000557     02  WS-RLT-NAO               PIC 9(06).                      133048      
000558     02  WS-RLT-IAO               PIC 9(18)V99.                   133050      
000559     02  WS-RLT-NCA               PIC 9(06).                      133052      
000560     02  WS-RLT-ICA               PIC 9(18)V99.                   133054      
000561     02  WS-RLT-NAA               PIC 9(06).                      133056      
000562     02  WS-RLT-IAA               PIC 9(18)V99.                   133058      
000563     02  FILLER                   PIC X(49).                      133060      
000564*                                                                 133062      
000565*    TAMA\O DEL REGISTRO               160 CARACTERES.            133064      
000566*                                                                 133066      
000567/                                                                 133500      
000568*----------------------------------------------------------------*134000      
000569*  DEFINICION DE LOS REGISTROS DE IMPRESION >>> NUEVA CARATULA   *134500      
000570*----------------------------------------------------------------*135000      
000571 01  WS-CCTL-ENC1.                                                135500      
000572     03  FILLER                 PIC X(22) VALUE                   136000      
000573         "R/030-140/001-CARATULA".                                136500      
000574     03  FILLER                 PIC X(16) VALUE SPACES.           137000      
000575     03  FILLER                 PIC X(57) VALUE                   137500      
000576      "C O M P E N S A C I O N  C O N T A B L E  N A C I O N A L".138000      
000577     03  FILLER                 PIC X(37) VALUE SPACES.           138500      
000578*                                                                 139000      
000579 01  WS-CCTL-ENC2.                                                139500      
000580     03  FILLER                 PIC X(19) VALUE                   140000      
000581       "FECHA DE PROCESO : ".                                     140500      
000582     03  WS-ENC2-FEC            PIC 99/99/99.                     141000      
000583     03  FILLER                 PIC X(91) VALUE SPACES.           141500      
000584     03  FILLER                 PIC X(06) VALUE "HOJA: ".         142000      
000585     03  WS-ENC2-PAG            PIC Z(05).                        142500      
000586     03  FILLER                 PIC X(03) VALUE SPACES.           143000      
000587*                                                                 143500      
000588 01  WS-CCTL-ENC3.                                                144000      
000589     03  FILLER                 PIC X(19) VALUE                   144500      
000590       "HORA DE PROCESO  : ".                                     145000      
000591     03  WS-ENC3-HH             PIC 99.                           145500      
000592     03  FILLER                 PIC X VALUE ":".                  145600      
000593     03  WS-ENC3-MM             PIC 99.                           145700      
000594     03  FILLER                 PIC X VALUE ":".                  145800      
000595     03  WS-ENC3-SS             PIC 99.                           145900      
000596     03  FILLER                 PIC X(19) VALUE SPACES.           146000      
000597     03  FILLER                 PIC X(40) VALUE                   146500      
000598       "CARATULA DE CONTROL DE ARCHIVOS 'LOGCSI'".                147000      
000599     03  FILLER                 PIC X(28) VALUE SPACES.           147500      
000600     03  FILLER                 PIC X(10) VALUE                   148000      
000601       "VERSION : ".                                              148500      
000602     03  WS-ENC3-FEC            PIC 99/99/99.                     149000      
000603*                                                                 149500      
000604 01  WS-CCTL-ENC4.                                                150000      
000605     03  FILLER                 PIC X(24) VALUE                   150500      
000606       "FECHA DE COMPENSACION : ".                                151000      
000607     03  WS-ENC4-FEC            PIC 99/99/99.                     151500      
000608     03  FILLER                 PIC X(33) VALUE SPACES.           152000      
000609     03  WS-ENC4-TIT            PIC X(33) VALUE                   152100      
000610         "CIFRAS EXPRESADAS EN NUEVOS PESOS".                     152200      
000611     03  FILLER                 PIC X(34) VALUE SPACES.           152300      
000612*                                                                 152500      
000613 01  WS-CCTL-ENC5.                                                153000      
000614     03  FILLER                 PIC X(04) VALUE SPACES.           153500      
000615     03  FILLER                 PIC X(16) VALUE                   154000      
000616       "DATOS DE PROCESO".                                        154500      
000617     03  FILLER                 PIC X(22) VALUE SPACES.           155000      
000618     03  FILLER                 PIC X(13) VALUE                   155500      
000619       "O P E R A D O".                                           156000      
000620     03  FILLER                 PIC X(42) VALUE SPACES.           156500      
000621     03  FILLER                 PIC X(15) VALUE                   157000      
000622       "A P L I C A D O".                                         157500      
000623     03  FILLER                 PIC X(20) VALUE SPACES.           158000      
000624/                                                                 158500      
000625 01  WS-CCTL-ENC6.                                                159000      
000626     03  FILLER                 PIC X(19) VALUE                   159500      
000627       "CSI   FECHA    HORA".                                     160000      
000628     03  FILLER                 PIC X(10) VALUE SPACES.           160500      
000629     03  FILLER                 PIC X(11) VALUE                   161000      
000630       "C A R G O S".                                             161500      
000631     03  FILLER                 PIC X(16) VALUE SPACES.           162000      
000632     03  FILLER                 PIC X(11) VALUE                   162500      
000633       "A B O N O S".                                             163000      
000634     03  FILLER                 PIC X(18) VALUE SPACES.           163500      
000635     03  FILLER                 PIC X(11) VALUE                   164000      
000636       "C A R G O S".                                             164500      
000637     03  FILLER                 PIC X(17) VALUE SPACES.           165000      
000638     03  FILLER                 PIC X(11) VALUE                   165500      
000639       "A B O N O S".                                             166000      
000640     03  FILLER                 PIC X(08) VALUE SPACES.           166500      
000641*                                                                 167000      
000642 01  WS-CCTL-DET1.                                                167500      
000643     03  WS-DET1-CSI            PIC X(03) VALUE SPACES.           168000      
000644     03  FILLER                 PIC X(01) VALUE SPACES.           168500      
000645     03  WS-DET1-FEC            PIC 99/99/99.                     169000      
000646     03  FILLER                 PIC X(01) VALUE SPACES.           169500      
000647     03  WS-DET1-HH             PIC 99.                           170000      
000648     03  FILLER                 PIC X VALUE ":".                  170100      
000649     03  WS-DET1-MM             PIC 99.                           170200      
000650     03  FILLER                 PIC X VALUE ":".                  170300      
000651     03  WS-DET1-SS             PIC 99.                           170400      
000652     03  FILLER                 PIC X(01) VALUE SPACES.           170500      
000653     03  WS-DET1-NCO            PIC ZZZZ9 VALUE ZEROES.           171000      
000654     03  FILLER                 PIC X(01) VALUE SPACES.           171500      
000655     03  WS-DET1-ICO            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99.         172000      
000656     03  FILLER                 PIC X(01) VALUE SPACES.           172500      
000657     03  WS-DET1-NAO            PIC ZZZZ9 VALUE ZEROES.           173000      
000658     03  FILLER                 PIC X(01) VALUE SPACES.           173500      
000659     03  WS-DET1-IAO            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99-.        174000      
000660     03  FILLER                 PIC X(02) VALUE SPACES.           174500      
000661     03  WS-DET1-NCA            PIC ZZZZ9 VALUE ZEROES.           175000      
000662     03  FILLER                 PIC X(01) VALUE SPACES.           175500      
000663     03  WS-DET1-ICA            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99-.        176000      
000664     03  FILLER                 PIC X(01) VALUE SPACES.           176500      
000665     03  WS-DET1-NAA            PIC ZZZZ9 VALUE ZEROES.           177000      
000666     03  FILLER                 PIC X(01) VALUE SPACES.           177500      
000667     03  WS-DET1-IAA            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99.         178000      
000668*                                                                 178500      
000669 01  WS-CCTL-DET2.                                                179000      
000670     03  FILLER                 PIC X(22) VALUE                   179500      
000671       "TOTAL ARCHIVOS =====> ".                                  180000      
000672     03  WS-DET2-NCO            PIC ZZZZ9 VALUE ZEROES.           180500      
000673     03  FILLER                 PIC X(01) VALUE SPACES.           181000      
000674     03  WS-DET2-ICO            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99.         181500      
000675     03  FILLER                 PIC X(01) VALUE SPACES.           182000      
000676     03  WS-DET2-NAO            PIC ZZZZ9 VALUE ZEROES.           182500      
000677     03  FILLER                 PIC X(01) VALUE SPACES.           183000      
000678     03  WS-DET2-IAO            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99-.        183500      
000679     03  FILLER                 PIC X(02) VALUE SPACES.           184000      
000680     03  WS-DET2-NCA            PIC ZZZZ9 VALUE ZEROES.           184500      
000681     03  FILLER                 PIC X(01) VALUE SPACES.           185000      
000682     03  WS-DET2-ICA            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99-.        185500      
000683     03  FILLER                 PIC X(01) VALUE SPACES.           186000      
000684     03  WS-DET2-NAA            PIC ZZZZ9 VALUE ZEROES.           186500      
000685     03  FILLER                 PIC X(01) VALUE SPACES.           187000      
000686     03  WS-DET2-IAA            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99.         187500      
000687/                                                                 188000      
000688 01  WS-CCTL-DET3.                                                188500      
000689     03  FILLER                 PIC X(28) VALUE SPACES.           189000      
000690     03  WS-DET3-TCO            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99.         189500      
000691     03  FILLER                 PIC X(07) VALUE SPACES.           190000      
000692     03  WS-DET3-TAO            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99-.        190500      
000693     03  FILLER                 PIC X(08) VALUE SPACES.           191000      
000694     03  WS-DET3-TCA            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99-.        191500      
000695     03  FILLER                 PIC X(07) VALUE SPACES.           192000      
000696     03  WS-DET3-TAA            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99.         192500      
000697*                                                                 193000      
000698 01  WS-CCTL-DET4.                                                193500      
000699     03  FILLER                 PIC X(84) VALUE SPACES.           194000      
000700     03  WS-DET4-TCL            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99-.        194500      
000701     03  FILLER                 PIC X(07) VALUE SPACES.           195000      
000702     03  WS-DET4-TAL            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99.         195500      
000703*                                                                 196000      
000704 01  WS-CCTL-DET5.                                                196500      
000705     03  FILLER                 PIC X(22) VALUE                   197000      
000706       "DIF CIFRAS DE CONTROL ".                                  197500      
000707     03  WS-DET5-NCO            PIC ZZZZ9 VALUE ZEROES.           198000      
000708     03  FILLER                 PIC X(01) VALUE SPACES.           198500      
000709     03  WS-DET5-ICO            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99.         199000      
000710     03  FILLER                 PIC X(01) VALUE SPACES.           199500      
000711     03  WS-DET5-NAO            PIC ZZZZ9 VALUE ZEROES.           200000      
000712     03  FILLER                 PIC X(01) VALUE SPACES.           200500      
000713     03  WS-DET5-IAO            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99-.        201000      
000714     03  FILLER                 PIC X(02) VALUE SPACES.           201500      
000715     03  WS-DET5-NCA            PIC ZZZZ9 VALUE ZEROES.           202000      
000716     03  FILLER                 PIC X(01) VALUE SPACES.           202500      
000717     03  WS-DET5-ICA            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99-.        203000      
000718     03  FILLER                 PIC X(01) VALUE SPACES.           203500      
000719     03  WS-DET5-NAA            PIC ZZZZ9 VALUE ZEROES.           204000      
000720     03  FILLER                 PIC X(01) VALUE SPACES.           204500      
000721     03  WS-DET5-IAA            PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99.         205000      
000722*                                                                 205500      
000723 01  WS-CCTL-DET6.                                                206000      
000724     03  FILLER                 PIC X(132) VALUE SPACES.          206500      
000725*                                                                 207000      
000726 01  WS-CCTL-DET7.                                                207500      
000727     03  WS-DET7-CSI            PIC X(03)  VALUE SPACES.          208000      
000728     03  FILLER                 PIC X(01)  VALUE SPACES.          208500      
000729     03  WS-DET7-FEC            PIC 99/99/99.                     209000      
000730     03  FILLER                 PIC X(01)  VALUE SPACES.          209500      
000731     03  WS-DET7-HH             PIC 99.                           210000      
000732     03  FILLER                 PIC X VALUE ":".                  210100      
000733     03  WS-DET7-MM             PIC 99.                           210200      
000734     03  FILLER                 PIC X VALUE ":".                  210300      
000735     03  WS-DET7-SS             PIC 99.                           210400      
000736     03  FILLER                 PIC X(26)  VALUE SPACES.          210500      
000737     03  FILLER                 PIC X(58)  VALUE                  211000      
000738   "FECHA CONTABLE DE LA LOG NO CORRESPONDE A FECHA DE PROCESO".  211500      
000739     03  FILLER                 PIC X(26)  VALUE SPACES.          212000      
000740/                                                                 212500      
000741 01  TIT-ELIM1.                                                   213000      
000742     03  FILLER                 PIC X(27) VALUE                   213500      
000743         "R/030-140/002-ELIMINACIONES".                           214000      
000744     03  FILLER                 PIC X(13) VALUE SPACES.           214500      
000745     03  FILLER                 PIC X(52) VALUE                   215000      
000746         "BANCO NACIONAL DE MEXICO - SERVICIOS TRANSACCIONALES".  215500      
000747     03  FILLER                 PIC X(25) VALUE SPACES.           216000      
000748     03  FILLER                 PIC X(07) VALUE                   216500      
000749         "HOJA:  ".                                               217000      
000750     03  TIT-ELIM1-PAGE         PIC Z(05).                        217500      
000751     03  FILLER                 PIC X(03) VALUE SPACES.           218000      
000752*                                                                 218500      
000753 01  TIT-ELIM2.                                                   219000      
000754     03  FILLER                 PIC X(12) VALUE                   219500      
000755         "FECHA REAL: ".                                          220000      
000756     03  TIT-ELIM2-FEC          PIC 99/99/99.                     220500      
000757     03  FILLER                 PIC X(31) VALUE SPACES.           221000      
000758     03  FILLER                 PIC X(30) VALUE                   221500      
000759         "COMPENSACION CONTABLE NACIONAL".                        222000      
000760     03  FILLER                 PIC X(36) VALUE SPACES.           222500      
000761     03  FILLER                 PIC X(06) VALUE                   223000      
000762         "V   : ".                                                223500      
000763     03  TIT-ELIM2-VER          PIC 9(06).                        224000      
000764     03  FILLER                 PIC X(03) VALUE SPACES.           224500      
000765*                                                                 225000      
000766 01  TIT-ELIM3.                                                   225500      
000767     03  FILLER                 PIC X(12) VALUE                   226000      
000768         "HORA  REAL: ".                                          226500      
000769     03  TIT-ELIM3-HH           PIC 99.                           227000      
000770     03  FILLER                 PIC X VALUE ":".                  227100      
000771     03  TIT-ELIM3-MM           PIC 99.                           227200      
000772     03  FILLER                 PIC X VALUE ":".                  227300      
000773     03  TIT-ELIM3-SS           PIC 99.                           227400      
000774     03  FILLER                 PIC X(23) VALUE SPACES.           227500      
000775     03  FILLER                 PIC X(46) VALUE                   228000      
000776         "MOVIMIENTOS ELIMINADOS DE LOS DIFERENTES CSI'S".        228500      
000777     03  FILLER                 PIC X(43) VALUE SPACES.           229000      
000778*                                                                 229500      
000779 01  TIT-ELIM4.                                                   230000      
000780     03  FILLER                 PIC X(51) VALUE SPACES.           230500      
000781     03  FILLER                 PIC X(22) VALUE                   231000      
000782         "FECHA DE MOVIMIENTOS: ".                                231500      
000783     03  TIT-ELIM4-FEC          PIC 99/99/99.                     232000      
000784     03  FILLER                 PIC X(51) VALUE SPACES.           232500      
000785*                                                                 233000      
000786 01  TIT-ELIM5.                                                   233500      
000787     03  FILLER                 PIC X(35) VALUE                   234000      
000788         "CENTRO DE SERVICIO DE INFORMACION: ".                   234500      
000789     03  TIT-ELIM5-NOM          PIC X(15) VALUE SPACES.           235000      
000790     03  FILLER                 PIC X(82) VALUE SPACES.           235500      
000791*                                                                 236000      
000792 01  TIT-ELIM8.                                                   236500      
000793     03  FILLER                 PIC X(20) VALUE SPACES.           237000      
000794     03  FILLER                 PIC X(30) VALUE ALL "*".          237500      
000795     03  FILLER                 PIC X(32) VALUE                   238000      
000796         "NO PRESENTO MOVIMIENTOS ERRONEOS".                      238500      
000797     03  FILLER                 PIC X(30) VALUE ALL "*".          239000      
000798     03  FILLER                 PIC X(20) VALUE SPACES.           239500      
000799/                                                                 240000      
000800 01  REP2-SUB1.                                                   240500      
000801     03  FILLER                   PIC X(48) VALUE                 241000      
000802         "CSI APL  CSI APL   NOMBRE        CLAVE DE       ".      241500      
000803     03  FILLER                   PIC X(55) VALUE                 242000      
000804        "                       TIPO                            ".242500      
000805     03  FILLER                   PIC X(29) VALUE                 243000      
000806         "    FECHA  HORA   TIPO-ERROR ".                         243500      
000807*                                                                 244000      
000808 01  REP2-SUB2.                                                   244500      
000809     03  FILLER                   PIC X(48) VALUE                 245000      
000810         "ORI ORI  DES DES  ESTACION     AUTORIZACION     ".      245500      
000811     03  FILLER                   PIC X(55) VALUE                 246000      
000812        "    CUENTA-DESTINO      MOV      I M P O R T E     STA ".246500      
000813     03  FILLER                   PIC X(29) VALUE                 247000      
000814         "MON  CONT.  GEN. ABCDEFGHIJKL".                         247500      
000815*                                                                 248000      
000816 01  REP2-SUB3.                                                   248500      
000817     03  FILLER                   PIC X(48) VALUE                 249000      
000818         "--- ---- --- ---- -------- -------------------- ".      249500      
000819     03  FILLER                   PIC X(55) VALUE                 250000      
000820        "---------------------- ---- ---------------------- --- ".250500      
000821     03  FILLER                   PIC X(29) VALUE                 251000      
000822         "--- ------ ----- ------------".                         251500      
000823*                                                                 252000      
000824 01  REP2-SUB4.                                                   252500      
000825     03  REP2-SUB4-LEY          PIC X(22)  VALUE SPACES.          253000      
000826     03  FILLER                 PIC X(01)  VALUE SPACES.          253500      
000827     03  REP2-SUB4-CSI          PIC X(03)  VALUE SPACES.          254000      
000828     03  FILLER                 PIC X(07)  VALUE                  254500      
000829                                    "  NUM. ".                    255000      
000830     03  FILLER                 PIC X(28)  VALUE                  255500      
000831                                   "     C  A  R  G  O  S       ".256000      
000832     03  FILLER                 PIC X(07)  VALUE                  256500      
000833                                    "  NUM. ".                    257000      
000834     03  FILLER                 PIC X(28)  VALUE                  257500      
000835                                   "     A  B  O  N  O  S       ".258000      
000836     03  FILLER                 PIC X(08)  VALUE                  258500      
000837                                    "  NUM. ".                    259000      
000838     03  FILLER                 PIC X(28)  VALUE                  259500      
000839                                   "   TIPO MOVTO DESCONOCIDO   ".260000      
000840*                                                                 260500      
000841 01  REP2-SUB5.                                                   261000      
000842     03  FILLER                 PIC X(22)  VALUE ALL "-".         261500      
000843     03  FILLER                 PIC X(01)  VALUE SPACES.          262000      
000844     03  FILLER                 PIC X(03)  VALUE ALL "-".         262500      
000845     03  FILLER                 PIC X(07)  VALUE                  263000      
000846                                    "-------".                    263500      
000847     03  FILLER                 PIC X(28)  VALUE                  264000      
000848                                   "----------------------------".264500      
000849     03  FILLER                 PIC X(07)  VALUE                  265000      
000850                                    "-------".                    265500      
000851     03  FILLER                 PIC X(28)  VALUE                  266000      
000852                                   "----------------------------".266500      
000853     03  FILLER                 PIC X(08)  VALUE                  267000      
000854                                    "-------".                    267500      
000855     03  FILLER                 PIC X(28)  VALUE                  268000      
000856                                   "----------------------------".268500      
000857*                                                                 269000      
000858 01  REP2-DET1.                                                   269500      
000859     03  R2D1-CSI-ORI             PIC X(03).                      270000      
000860     03  FILLER                   PIC X(01).                      270500      
000861     03  R2D1-APL-ORI             PIC X(04).                      271000      
000862     03  FILLER                   PIC X(01).                      271500      
000863     03  R2D1-CSI-DES             PIC X(03).                      272000      
000864     03  FILLER                   PIC X(01).                      272500      
000865     03  R2D1-APL-DES             PIC X(04).                      273000      
000866     03  FILLER                   PIC X(01).                      273500      
000867     03  R2D1-STA-NAME            PIC X(08).                      274000      
000868     03  FILLER                   PIC X(01).                      274500      
000869     03  R2D1-N-AUTOR             PIC X(20).                      275000      
000870     03  FILLER                   PIC X(01).                      275500      
000871     03  R2D1-CTA-DES             PIC X(22).                      276000      
000872     03  FILLER                   PIC X(02).                      276500      
000873     03  R2D1-TIPO-MOV            PIC X(03).                      277000      
000874     03  FILLER                   PIC X(01).                      277500      
000875     03  R2D1-IMPORTE             PIC ZZZZZZZZZZZZZZZ,ZZ9.99.     278000      
000876     03  FILLER                   PIC X(02).                      278500      
000877     03  R2D1-STATUS              PIC Z9.                         279000      
000878     03  FILLER                   PIC X(01).                      279500      
000879     03  R2D1-MONEDA              PIC ZZ9.                        280000      
000880     03  FILLER                   PIC X(01).                      280500      
000881     03  R2D1-FEC-CON             PIC 9(06).                      281000      
000882     03  FILLER                   PIC X(01).                      281500      
000883     03  R2D1-HORA-HH             PIC 99.                         282000      
000884     03  FILLER                   PIC X VALUE ":".                282100      
000885     03  R2D1-HORA-MM             PIC 99.                         282200      
000886     03  FILLER                   PIC X(01).                      282500      
000887     03  R2D1-ERRORES             PIC X(12).                      283000      
000888     03  R2D1-ERRORES-R           REDEFINES R2D1-ERRORES          283500      
000889                                  OCCURS  12 TIMES.               284000      
000890         05  R2D1-ERR             PIC X(01).                      284500      
000891/                                                                 285000      
000892 01  REP2-DET2.                                                   285500      
000893     03  FILLER                   PIC X(17) VALUE SPACES.         286000      
000894     03  FILLER                   PIC X(12) VALUE "CTA-ACCESO: ". 286500      
000895     03  R2D2-CTA-ACC             PIC X(20).                      287000      
000896     03  FILLER                   PIC X(03) VALUE SPACES.         287500      
000897     03  FILLER                   PIC X(05) VALUE "REF: ".        288000      
000898     03  R2D2-REF-OPE             PIC X(20).                      288500      
000899     03  FILLER                   PIC X(03) VALUE SPACES.         289000      
000900     03  FILLER                   PIC X(09) VALUE "CVE-MOV: ".    289500      
000901     03  R2D2-SUB-SER             PIC X(03).                      290000      
000902     03  FILLER                   PIC X(03) VALUE SPACES.         290500      
000903     03  FILLER                   PIC X(11) VALUE "FECHA-GEN: ".  291000      
000904     03  R2D2-FEC-GEN             PIC 99/99/99.                   291500      
000905     03  FILLER                   PIC X(18) VALUE SPACES.         292000      
000906*                                                                 292500      
000907 01  REP2-DET3.                                                   293000      
000908     03  R2D3-LEY                 PIC X(27)  VALUE SPACES.        293500      
000909     03  R2D3-NC                  PIC ZZZZZ9 VALUE ZEROES.        294000      
000910     03  FILLER                   PIC X(02)  VALUE SPACES.        294500      
000911     03  R2D3-IC                  PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99. 295000      
000912     03  FILLER                   PIC X(01)  VALUE SPACES.        295500      
000913     03  R2D3-NA                  PIC ZZZZZ9 VALUE ZEROES.        296000      
000914     03  FILLER                   PIC X(02)  VALUE SPACES.        296500      
000915     03  R2D3-IA                  PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99-.297000      
000916     03  FILLER                   PIC X(01)  VALUE SPACES.        297500      
000917     03  R2D3-NCA                 PIC ZZZZZ9 VALUE ZEROES.        298000      
000918     03  FILLER                   PIC X(02)  VALUE SPACES.        298500      
000919     03  R2D3-ICA                 PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99. 299000      
000920*                                                                 299500      
000921 01 WS-R2D3-LEYENDA.                                              300000      
000922    03 FILLER      PIC X(27) VALUE "POR LO OPERADO             ". 300500      
000923    03 FILLER      PIC X(27) VALUE "POR LO APLICADO            ". 301000      
000924    03 FILLER      PIC X(27) VALUE "POR STATUS DIF.            ". 301500      
000925 01 WS-R2D3-LEYENDA-R              REDEFINES WS-R2D3-LEYENDA.     302000      
000926    03 WS-R2D3-OCC                 OCCURS 3 TIMES.                302500      
000927       05 WS-R2D3-LEY              PIC X(27).                     303000      
000928*                                                                 303500      
000929 01 WS-EDIT-CTADES.                                               304000      
000930    03 WS-SUC-CTADES            PIC Z(12)9.                       304500      
000931    03 FILLER                   PIC X(01) VALUE SPACES.           305000      
000932    03 WS-CTA-CTADES            PIC Z(05)99.                      305500      
000933*                                                                 306000      
000934 01 WS-PARTE-CTADES.                                              306500      
000935    03 WS-PARTE-SUC             PIC 9(13).                        307000      
000936    03 WS-PARTE-CTA             PIC 9(07).                        307500      
000937/                                                                 308000      
000938 01  CONTADORES-WS              COMP .                            308500      
000939     02  LEIDOS-WS              PIC S9(06).                       309000      
000940     02  ACEPTADOS-WS           PIC S9(06).                       309500      
000941     02  RECHAZADOS-WS          PIC S9(06).                       310000      
000942     02  NUM-HOJA-WS            PIC S9(04).                       310500      
000943     02  NUM-HOJA-LG            PIC S9(04).                       311000      
000944     02  NUM-LINEAS             PIC  9(2).                        311500      
000945     02  WS-CONT-R2-LIN           PIC  9(2).                      312000      
000946     02  IMP-ACEPTADOS-WS       PIC S9(18)V9(02).                 312500      
000947     02  IMP-RECHAZADOS-WS      PIC S9(18)V9(02).                 313000      
000948     02  IMP-LEIDOS-WS          PIC S9(18)V9(02).                 313500      
000949*                                                                 314000      
000950 01  TOTALES-WS                 COMP .                            314500      
000951     02  TOT-LEIDOS-WS          PIC S9(06).                       315000      
000952     02  TOT-ACEPTADOS-WS       PIC S9(06).                       315500      
000953     02  TOT-RECHAZADOS-WS      PIC S9(06).                       316000      
000954     02  TOT-IMP-LEIDOS-WS      PIC S9(18)V9(02).                 316500      
000955     02  TOT-IMP-ACEPTADOS-WS   PIC S9(18)V9(02).                 317000      
000956     02  TOT-IMP-RECHAZADOS-WS  PIC S9(18)V9(02).                 317500      
000957     02  TOT-CSIS-WS            PIC  9(02).                       318000      
000958     02  SALDO-CALCULADO-WS     PIC S9(18)V9(02).                 318500      
000959     02  IMPORTE-NEGATI         PIC S9(18)V9(02).                 319000      
000960     02  IMPORTE-ENTERO         PIC 9(16)V9(02).                  319500      
000961*                                                                 320000      
000962 01  WS-IMPORTES-TRAILER.                                         320500      
000963     02  WS-IT-IDENT              PIC X(07).                      321000      
000964     02  WS-IT-NCO                PIC 9(06).                      321500      
000965     02  WS-IT-ICO                PIC 9(18)V99.                   322000      
000966     02  WS-IT-NAO                PIC 9(06).                      322500      
000967     02  WS-IT-IAO                PIC 9(18)V99.                   323000      
000968     02  WS-IT-NCA                PIC 9(06).                      323500      
000969     02  WS-IT-ICA                PIC 9(18)V99.                   324000      
000970     02  WS-IT-NAA                PIC 9(06).                      324500      
000971     02  WS-IT-IAA                PIC 9(18)V99.                   325000      
000972     02  FILLER                   PIC X(45).                      325500      
000973/                                                                 326000      
000974 01  OPER-APLI-ACUM.                                              326500      
000975     02  TAB-ACUM.                                                327000      
000976         03  ACUMULADOR COMP        OCCURS 2 TIMES.               327500      
000977             04  NUM-CARGOS-ACUM  PIC S9(06).                     328000      
000978             04  IMP-CARGOS-ACUM  PIC S9(18)V99.                  328500      
000979             04  NUM-ABONOS-ACUM  PIC S9(06).                     329000      
000980             04  IMP-ABONOS-ACUM  PIC S9(18)V99.                  329500      
000981*                                                                 330000      
000982 01  OPER-APLI-TOT.                                               330500      
000983     02  TAB-TOT.                                                 331000      
000984         03  TOTALIZADOR COMP     OCCURS 2 TIMES.                 331500      
000985             04  NUM-CARGOS-TOT   PIC S9(06).                     332000      
000986             04  IMP-CARGOS-TOT   PIC S9(18)V99.                  332500      
000987             04  NUM-ABONOS-TOT   PIC S9(06).                     333000      
000988             04  IMP-ABONOS-TOT   PIC S9(18)V99.                  333500      
000989*                                                                 334000      
000990 01  OPER-APLI-ACUM-ELIM.                                         334500      
000991     02  TAB-AELIM.                                               335000      
000992         03  ACUM-ELIMINA COMP    OCCURS 3 TIMES.                 335500      
000993             04  NUM-CARGOS-AELIM PIC S9(06).                     336000      
000994             04  IMP-CARGOS-AELIM PIC S9(18)V99.                  336500      
000995             04  NUM-ABONOS-AELIM PIC S9(06).                     337000      
000996             04  IMP-ABONOS-AELIM PIC S9(18)V99.                  337500      
000997             04  NUM-CARABO-AELIM PIC S9(06).                     338000      
000998             04  IMP-CARABO-AELIM PIC S9(18)V99.                  338500      
000999*                                                                 339000      
001000 01  OPER-APLI-TOT-ELIM.                                          339500      
001001     02  TAB-TELIM.                                               340000      
001002         03  TOT-ELIMINA  COMP    OCCURS 3 TIMES.                 340500      
001003             04  NUM-CARGOS-TELIM PIC S9(06).                     341000      
001004             04  IMP-CARGOS-TELIM PIC S9(18)V99.                  341500      
001005             04  NUM-ABONOS-TELIM PIC S9(06).                     342000      
001006             04  IMP-ABONOS-TELIM PIC S9(18)V99.                  342500      
001007             04  NUM-CARABO-TELIM PIC S9(06).                     343000      
001008             04  IMP-CARABO-TELIM PIC S9(18)V99.                  343500      
001009*                                                                 344000      
001010 01  WS-MON-X                     PIC X(03).                      344500      
001011 01  WS-MON   REDEFINES WS-MON-X  PIC 9(03).                      345000      
001012*                                                                 345500      
001013 01  LLAVE-COMP-WS.                                               346000      
001014     03 CSI-LOC-WS                PIC 9(02) VALUE 0.              346500      
001015     03 MONEDA-WS                 PIC 9(03) VALUE 0.              347000      
001016     03 SISTEMA-WS                PIC 9(02) VALUE 0.              347500      
001017     03 CSI-FOR-WS                PIC 9(02) VALUE 0.              348000      
001018     03 FILLER                    PIC 9(03) VALUE 0.              348500      
001019/                                                                 349000      
001020 01  AUXILIARES-WS.                                               349500      
001021    02 WS-FECHA-DMA               PIC 9(08).                      349520      
001022    02 WS-FECHA-DMA-R REDEFINES WS-FECHA-DMA.                     349540      
001023       03 WS-FE-DMA-DIA           PIC 9(02).                      349560      
001024       03 WS-FE-DMA-MES           PIC 9(02).                      349580      
001025       03 WS-FE-DMA-YEAR          PIC 9(04).                      349600      
001026    02 WS-FECHA-AMD               PIC 9(08).                      349620      
001027    02 WS-FECHA-AMD-R REDEFINES WS-FECHA-AMD.                     349640      
001028       03 WS-FE-AMD-YEAR          PIC 9(04).                      349660      
001029       03 WS-FE-AMD-MES           PIC 9(02).                      349680      
001030       03 WS-FE-AMD-DIA           PIC 9(02).                      349700      
001031    02 WS-FEMAQ-DMA               PIC 9(08).                      349720      
001032    02 WS-FEMAQ-DMA-R REDEFINES WS-FEMAQ-DMA.                     349740      
001033       03 WS-FM-DMA-DIA           PIC 9(02).                      349760      
001034       03 WS-FM-DMA-MES           PIC 9(02).                      349780      
001035       03 WS-FM-DMA-YEAR          PIC 9(04).                      349800      
001036    02 WS-FEMAQ-AMD               PIC 9(08).                      349820      
001037    02 WS-FEMAQ-AMD-R REDEFINES WS-FEMAQ-AMD.                     349840      
001038       03 WS-FM-AMD-YEAR          PIC 9(04).                      349860      
001039       03 WS-FM-AMD-MES           PIC 9(02).                      349880      
001040       03 WS-FM-AMD-DIA           PIC 9(02).                      349900      
001041     02  VERSION-WS             PIC 9(08).                        350000      
001042     02  VERS-WS REDEFINES VERSION-WS.                            350500      
001043         03  DD-VS              PIC 9(02).                        351000      
001044         03  MM-VS              PIC 9(02).                        351500      
001045         03  AA-VS              PIC 9(04).                        352000      
001046*                                                                 352500      
001047     02  FECHA-PROCESO-WS       PIC 9(08).                        353000      
001048     02  FECHA-PROCESO-WS-R     REDEFINES FECHA-PROCESO-WS.       353500      
001049         03 FPROCESO-AA         PIC  9999.                        354000      
001050         03 FPROCESO-MM         PIC  99.                          354500      
001051         03 FPROCESO-DD         PIC  99.                          355000      
001052*                                                                 355500      
001053     02  WS-FECHA-PROCESO       PIC 9(08).                        356000      
001054     02  WS-FECHA-PROCESO-R     REDEFINES WS-FECHA-PROCESO.       356500      
001055         03 WPROCESO-DD         PIC  99.                          357000      
001056         03 WPROCESO-MM         PIC  99.                          357500      
001057         03 WPROCESO-AA         PIC  9999.                        358000      
001058*                                                                 358500      
001059     02  FECHA-REAL-WS          PIC 9(08).                        359000      
001060     02  FECH-WS REDEFINES FECHA-REAL-WS.                         359500      
001061         03  DD-REAL-WS         PIC 9(02).                        360000      
001062         03  MM-REAL-WS         PIC 9(02).                        360500      
001063         03  AA-REAL-WS         PIC 9(04).                        361000      
001064*                                                                 361500      
001065      02  WS-DATE               PIC  9(8).                        362000      
001066      02  WS-DATE-R             REDEFINES WS-DATE.                362500      
001067          03 WS-DATE-AA         PIC  9999.                        363000      
001068          03 WS-DATE-MM         PIC  99.                          363500      
001069          03 WS-DATE-DD         PIC  99.                          364000      
001070      02  WS-DATE-R2            REDEFINES WS-DATE.                364050      
001071          03 WS-DATE-DD2        PIC  99.                          364100      
001072          03 WS-DATE-MM2        PIC  99.                          364150      
001073          03 WS-DATE-AA2        PIC  9999.                        364200      
001074                                                                  364250      
001075      02  WS-ANIO               PIC  9999.                        364500      
001076      02  WS-TIME               PIC  9(8).                        365000      
001077      02  WS-TIME-R             REDEFINES WS-TIME.                365500      
001078          03 WS-TIMER           PIC  9(6).                        366000      
001079          03 WS-TIMER-R         REDEFINES WS-TIMER.               366500      
001080             05 WS-TIME-HH      PIC  9(2).                        367000      
001081             05 WS-TIME-MM      PIC  9(2).                        367100      
001082             05 WS-TIME-SS      PIC  9(2).                        367500      
001083          03 FILLER             PIC  XX.                          368000      
001084/                                                                 368500      
001085     02  WS-LOW-VALUES          PIC  X(36).                       369000      
001086     02  WS-HIGH-VALUES.                                          369500      
001087        05 PALABRA-1            PIC 9(12) COMP VALUE 999999999999.370000      
001088        05 PALABRA-2            PIC 9(12) COMP VALUE 999999999999.370500      
001089        05 PALABRA-3            PIC 9(12) COMP VALUE 999999999999.371000      
001090        05 PALABRA-4            PIC 9(12) COMP VALUE 999999999999.371500      
001091        05 PALABRA-5            PIC 9(12) COMP VALUE 999999999999.372000      
001092        05 PALABRA-6            PIC 9(12) COMP VALUE 999999999999.372500      
001093*                                                                 373000      
001094     02  NOMBRE-LOGCSI.                                           373500      
001095         03  FILLER               PIC X(22) VALUE                 374000      
001096                                  "S151/XFER/FILE/LOGCSI/".       374500      
001097         03  NL-CSI-ORI           PIC X(03).                      375000      
001098         03  FILLER               PIC X(04) VALUE "VDM/".         375500      
001099         03  NL-CSI-FEC           PIC 9(06).                      376000      
001100         03  NL-CSI-FEC-R         REDEFINES NL-CSI-FEC.           376500      
001101             05  NL-CSI-FEC-AA    PIC 9(02).                      377000      
001102             05  NL-CSI-FEC-MM    PIC 9(02).                      377500      
001103             05  NL-CSI-FEC-DD    PIC 9(02).                      378000      
001104         03  FILLER               PIC X(01) VALUE ".".            378500      
001105*                                                                 379000      
001106     02  NOMBRE-LOG-GRAL.                                         379500      
001107         03  FILLER             PIC X(18) VALUE                   380000      
001108                                "S151/FILE/LOGGRAL/".             380500      
001109         03  FECHA-NLG          PIC 9(06).                        381000      
001110         03  FILLER             PIC X(01) VALUE ".".              381500      
001111*                                                                 382000      
001112    02  SUC-WS                  PIC 9(03) COMP.                   382500      
001113    02  CTA-WS                  PIC 9(10) COMP.                   383000      
001114    02  DATO-DUMMY              PIC 9(01) COMP.                   383500      
001115/                                                                 384000      
001116    02  WS-APL-ORI-ANT        PIC 9(04) VALUE 0.                  384500      
001117*                                                                 385000      
001118     02  FECHA-CARGA-WS         PIC 9(08).                        385500      
001119     02  HORA-CARGA-WS          PIC 9(04).                        386000      
001120*                                                                 386500      
001121     02  REG-WS                 PIC X(126).                       387000      
001122     02  NUM-PROCESO-WS         PIC 9(02) COMP  .                 387500      
001123     02  DUMMY-WS               PIC 9(02).                        388000      
001124     02  HORA-MAQ-WS            PIC 9(11) COMP  .                 388500      
001125     02  FILLER                 PIC 9(01) COMP  .                 389000      
001126     02  CSI-ORI-ANT            PIC 9(02).                        389500      
001127*                                                                 390000      
001128 01 WS-LLAVE-COMP-BACK.                                           390500      
001129    03 LLAVE-COMP-BACK            PIC 9(18).                      391000      
001130    03 LLAVE-COMP-BACK-R          REDEFINES LLAVE-COMP-BACK.      391500      
001131       05 FECHA-BACK              PIC 9(06).                      392000      
001132       05 CSI-LOCAL-BACK          PIC 9(02).                      392500      
001133       05 MONEDA-BACK             PIC 9(03).                      393000      
001134       05 APL-ORI-BACK            PIC 9(04).                      393500      
001135       05 CSI-FORANEO-BACK        PIC 9(02).                      394000      
001136       05 FILLER                  PIC 9(01).                      394500      
001137*                                                                 395000      
001138 01 WS-LLAVE-COMP.                                                395500      
001139    03 LLAVE-COMP-WS.                                             396000      
001140       05 FECHA-WS                PIC 9(06).                      396500      
001141       05 CSI-LOCAL-WS            PIC 9(02).                      397000      
001142          88 CSI-LOCAL-WS-VALIDO  VALUE 2,4,10.                   397500      
001143       05 MONEDA-WS               PIC 9(03).                      398000      
001144       05 APL-ORI-WS              PIC 9(04).                      398500      
001145          88 APL-ORI-LOGCCR       VALUE 1001 THRU 1005.           399000      
001146       05 APL-ORI-WS-R            REDEFINES  APL-ORI-WS.          399500      
001147          07 FILLER               PIC 9(01).                      400000      
001148          07 SIS-WS               PIC 9(03).                      400500      
001149       05 CSI-FORANEO-WS          PIC 9(02).                      401000      
001150       05 FILLER                  PIC 9(01).                      401500      
001151*                                                                 402000      
001152/                                                                 402500      
001153 01  IDENTIFICADORES-WS.                                          403000      
001154     02  IND-VACIO              PIC  9.                           403500      
001155     02  IND-FECHA              PIC  9.                           404000      
001156     02  WS-FIN-LOG-SORT1       PIC 9(01).                        404500      
001157         88 FIN-LOG-SORT1       VALUE 1.                          405000      
001158*ASM 02  IND-FIN-GUARDIAN       PIC 9(01).                        405500      
001159*ASM     88  FIN-GUARDIAN       VALUE 1.                          406000      
001160     02  IND-FIN-MANIOBRA       PIC 9(01).                        406500      
001161         88  FIN-MANIOBRA       VALUE 1.                          407000      
001162*ASM 02  IND-GUARDIAN           PIC 9(01).                        407500      
001163*ASM     88  SI-EXISTE          VALUE 1.                          408000      
001164*ASM     88  NO-EXISTE          VALUE 0.                          408500      
001165     02  FIN-LOG-GRAL-WS        PIC 9(01).                        409000      
001166         88  FIN-LOG-GRAL       VALUE 1.                          409500      
001167*                                                                 410000      
001168     02  EXISTE-REGISTRO-WS     PIC 9(01).                        410500      
001169         88  EXISTE-REGISTRO    VALUE 1.                          411000      
001170*                                                                 411500      
001171     02  ALTA-OK-COMP-WS        PIC 9(01).                        412000      
001172         88  ALTA-OK-COMP       VALUE 1.                          412500      
001173*                                                                 413000      
001174     02  EXISTE-EN-COMP-WS      PIC 9(01).                        413500      
001175         88  EXISTE-EN-COMP     VALUE 1.                          414000      
001176*                                                                 414500      
001177     02  FIN-LOG-CSI-WS        PIC 9(01).                         415000      
001178         88  FIN-LOG-CSI        VALUE 1.                          415500      
001179*                                                                 416000      
001180     02  ARCHIVO-EXISTE-WS      PIC 9(01).                        416500      
001181         88 ARCHIVO-EXISTE      VALUE 1.                          417000      
001182*                                                                 417500      
001183     02  HUBO-TRANSACCIONES-WS  PIC 9(01).                        418000      
001184         88  HUBO-TRANSACCIONES VALUE 1.                          418500      
001185*                                                                 419000      
001186     02  HAY-TRAILER-WS         PIC 9(01).                        419500      
001187         88  HAY-TRAILER        VALUE 1.                          420000      
001188*                                                                 420500      
001189     02  HAY-DIF-WS             PIC 9(01).                        421000      
001190         88  HAY-DIF            VALUE 1.                          421500      
001191*                                                                 422000      
001192     02  HAY-ELIMINA-WS         PIC 9(01).                        422500      
001193         88  HAY-ELIMINA        VALUE 1.                          423000      
001194*                                                                 423500      
001195     02  SI-ELIMINA-WS          PIC 9(01).                        424000      
001196         88  SI-ELIMINA         VALUE 1.                          424500      
001197*                                                                 425000      
001198*ASM 02  WS-ENCONTRE-GUARDIAN        PIC 9(01) VALUE 0.           425500      
001199*ASM     88 ENCONTRE-GUARDIAN        VALUE ZERO.                  426000      
001200     02  IND-CONT               PIC 9(04) VALUE 0.                426500      
001201*                                                                 427000      
001202/                                                                 427500      
001203 01  TABLA-CSIS.                                                  428000      
001204     02  FILLER      PIC X(24) VALUE "01**********************".  428500      
001205     02  FILLER      PIC X(24) VALUE "02INT....B INTERNACIONAL".  429000      
001206     02  FILLER      PIC X(24) VALUE "03COR....CORPORATIVO A/B".  429500      
001207     02  FILLER      PIC X(24) VALUE "04MON....N O R T E      ".  430000      
001208     02  FILLER      PIC X(24) VALUE "05**********************".  430500      
001209     02  FILLER      PIC X(24) VALUE "06LEO....CENTRO-BAJIO   ".  431000      
001210     02  FILLER      PIC X(24) VALUE "07**********************".  431500      
001211     02  FILLER      PIC X(24) VALUE "08BIV....BANCA INVERSION".  432000      
001212     02  FILLER      PIC X(24) VALUE "09**********************".  432500      
001213     02  FILLER      PIC X(24) VALUE "10VDM....VALLE DE MEXICO".  433000      
001214     02  FILLER      PIC X(24) VALUE "11BAS....B. AUTOSERVICIO".  433500      
001215     02  FILLER      PIC X(24) VALUE "12COR....CORPORATIVO G  ".  434000      
001216     02  FILLER      PIC X(24) VALUE "13BE ....B ELECT. MEXICO".  434500      
001217     02  FILLER      PIC X(24) VALUE "14IAS....DESARROLLO IAS ".  435000      
001218     02  FILLER      PIC X(24) VALUE "15BE ....B ELECT. MONTER".  435500      
001219     02  FILLER      PIC X(24) VALUE "16**********************".  436000      
001220     02  FILLER      PIC X(24) VALUE "17**********************".  436500      
001221     02  FILLER      PIC X(24) VALUE "18**********************".  437000      
001222     02  FILLER      PIC X(24) VALUE "19**********************".  437500      
001223     02  FILLER      PIC X(24) VALUE "20**********************".  438000      
001224 01  TAB-CSIS-R REDEFINES TABLA-CSIS.                             438500      
001225     02  INFO-TAB-CSIS           OCCURS 20 TIMES.                 439000      
001226         03  NUM-CSI-TC          PIC 9(02).                       439500      
001227         03  ABR-CSI-TC          PIC X(03).                       440000      
001228         03  OCCA-CSI-TC         PIC 9(04).                       440500      
001229         03  NOM-CSI-TC          PIC X(15).                       441000      
001230*                                                                 441500      
001231 01  LIM-CSIS                    PIC 9(02) VALUE 20.              442000      
001232 01  CSIS-INVALIDOS-WS           PIC 9(02).                       442500      
001233     88 CSIS-INVALIDOS           VALUES  ARE                      443000      
001234                    00,01,03,05,06,07,08,09,11 THRU 20.           443010      
001235*                                                                 443500      
001236/                                                                 447000      
001237 01  TABLA-SISTEMAS.                                              447500      
001238      02  FILLER                  PIC X(27) VALUE                 448000      
001239          "CHS001CHEQUES       CHEQUES".                          448500      
001240      02  FILLER                  PIC X(27) VALUE                 449000      
001241          "CMS001CUENTA MAESTRACTAMAE ".                          449500      
001242      02  FILLER                  PIC X(27) VALUE                 450000      
001243          "LBS001LINEA BANAMEX LIN.BNM".                          450500      
001244      02  FILLER                  PIC X(27) VALUE                 451000      
001245          "OAS001ORDENES ABONO O.ABONO".                          451500      
001246      02  FILLER                  PIC X(27) VALUE                 452000      
001247          "BCS001BCO EN SU CASAB.CASA ".                          452500      
001248 01  TAB-SIST-R                   REDEFINES TABLA-SISTEMAS.       453000      
001249     02  INFO-TAB-SIST            OCCURS   5 TIMES.               453500      
001250         03  PREFIJO-TS           PIC X(02).                      454000      
001251         03  SISTEMA-TS           PIC X(04).                      454500      
001252         03  SIST-R-TS            REDEFINES SISTEMA-TS.           455000      
001253             04  FILLER           PIC X(01).                      455500      
001254             04  SISTEMA-NUM-TS   PIC 9(03).                      456000      
001255         03  DESCR-SIST-TS        PIC X(14).                      456500      
001256         03  DESCR-SIST-CORTA     PIC X(07).                      457000      
001257 01 LIM-SISTEMAS                  PIC 9(01) VALUE 5.              457500      
001258*                                                                 458000      
001259 01 WS-AUX-SISTEMAS.                                              458500      
001260    02  WS-SISTEMA-LG             PIC X(14).                      459000      
001261    02  WS-SISTEMA-LG-R           REDEFINES WS-SISTEMA-LG.        459500      
001262        03  WS-SIS-LG             PIC Z(04).                      460000      
001263        03  FILLER                PIC X(10).                      460500      
001264    02  WS-SISTEMA-CR             PIC X(07).                      461000      
001265    02  WS-SISTEMA-CR-R           REDEFINES WS-SISTEMA-CR.        461500      
001266        03  WS-SIS-CR             PIC Z(04).                      462000      
001267        03  FILLER                PIC X(03).                      462500      
001268*                                                                 463000      
001269 01 TAB-DIFNOCON.                                                 463500      
001270    03 FILLER                     PIC X(27) VALUE SPACES.         464000      
001271    03 FILLER                     PIC X(03) VALUE " CR".          464500      
001272    03 FILLER                     PIC X(03) VALUE "ECR".          465000      
001273    03 FILLER                     PIC X(24) VALUE SPACES.         465500      
001274    03 FILLER                     PIC X(03) VALUE " DR".          466000      
001275    03 FILLER                     PIC X(03) VALUE "EDR".          466500      
001276*                                                                 467000      
001277 01 TAB-DIFNOCON-R                REDEFINES TAB-DIFNOCON.         467500      
001278    03 TAB-DNC                    PIC X(03)                       468000      
001279                                  OCCURS    21 TIMES.             468500      
001280 01 LIM-DNC                       PIC 9(02) VALUE 21.             469000      
001281/                                                                 469500      
001282 77  WS-CONT-DIF                 PIC 9     VALUE ZEROS.           470000      
001283 77  WS-CONTADOR-SIST            PIC 99    VALUE ZEROS.           470500      
001284     88 CONTADOR-SIST-LIM        VALUE 99.                        471000      
001285     88 CONTADOR-SIST-AVISA      VALUE 80 THRU 99.                471500      
001286 77  WS-CONT-NOARCH              PIC 9     VALUE ZEROS.           472000      
001287*                                                                 472500      
001288 01  WS-DATOS-CTL-COMP           COMP .                           473000      
001289     03  WS-NUM-LEIDOS           PIC S9(07).                      473500      
001290     03  WS-IMP-LEIDOS           PIC S9(15)V99.                   474000      
001291     03  WS-NUM-ACEPTADOS        PIC S9(07).                      474500      
001292     03  WS-IMP-ACEPTADOS        PIC S9(15)V99.                   475000      
001293     03  WS-NUM-RECHAZADOS       PIC S9(07).                      475500      
001294     03  WS-IMP-RECHAZADOS       PIC S9(15)V99.                   476000      
001295*                                                                 476500      
001296 01  WS-DATOS-FOLIOS.                                             477000      
001297     03  WS-NUM-FOLIO-INI        PIC 9(08).                       477500      
001298     03  WS-NUM-FOLIO-FIN        PIC 9(08).                       478000      
001299     03  WS-NUM-FOLIO-ACT        PIC 9(08).                       478500      
001300     03  WS-FECHA-INICIAL        PIC 9(06).                       479000      
001301                                                                  479050      
001302 01  WKS-REG-HD-CONTROL.                                          479055      
001303     03  WKS-HD-CSI       PIC 9(02).                              479060      
001304     03  WKS-HD-FECPRO    PIC 9(08).                              479065      
001305     03  FILLER           PIC X(80).                              479070      
001306                                                                  479075      
001307 01  WKS-REG-DET-CONTROL.                                         479100      
001308     03  WKS-DET-SIST     PIC 9(03).                              479150      
001309     03  WKS-DET-FECPRO   PIC 9(08).                              479200      
001310     03  WKS-DET-INDPF    PIC 9(01).                              479250      
001311*                                                                 479500      
001312* >>> ESTANDAR NOMBRE DE REPORTES >>> SEPARACION POR NODO/SUBNODO 479502      
001313                                                                  479504      
001314*01  WS-NOMB-REPORTE.                                             479506      
001315*    03 FILLER                    PIC X(15) VALUE                 479508      
001316*                                 "S151/LIST/P140/".              479510      
001317*    03 WS-RM-NODO                PIC 9(02) VALUE ZEROS.          479512      
001318*    03 WS-RM-SUBNODO             PIC 9(02) VALUE ZEROS.          479514      
001319*    03 FILLER                    PIC X(01) VALUE "/".            479516      
001320*    03 WS-RM-TIPO                PIC X(01) VALUE "R".            479518      
001321*    03 FILLER                    PIC X(04) VALUE "000/".         479520      
001322*    03 WS-RM-AAMMDD              PIC 9(06).                      479522      
001323*    03 WS-RM-AAMMDD-R            REDEFINES WS-RM-AAMMDD.         479524      
001324*       05 WS-RM-AA               PIC 9(02).                      479526      
001325*       05 WS-RM-MM               PIC 9(02).                      479528      
001326*       05 WS-RM-DD               PIC 9(02).                      479530      
001327*    03 FILLER                    PIC X(01) VALUE "/".            479532      
001328*    03 WS-RM-MIX                 PIC 9(07) VALUE ZEROS.          479534      
001329*    03 FILLER                    PIC X(01) VALUE "/".            479536      
001330*    03 WS-RM-SEQ                 PIC 9(03) VALUE ZEROS.          479538      
001331*    03 FILLER                    PIC X(04) VALUE "P140".         479540      
001332*    03 WS-RM-DESC                PIC X(10) VALUE SPACES.         479542      
001333*                                                                 479544      
001334 01  APUNTADORES-WS               COMP .                          479562      
001335     02  PTER-CSI-WS              PIC 9(02).                      479564      
001336         88 PTER-CSIOKOR          VALUES ARE 1 THRU 20.           479565      
001337         88 PTER-CSIOK            VALUES ARE 2,4,10.              479566      
001338         88 PTER-CSI-CORP         VALUES ARE 10.                  479568      
001339         88 PTER-CSI-TANDEM       VALUES ARE 02.                  479570      
001340         88 PTER-CSI-ICA          VALUES ARE 2,4,10.              479572      
001341     02  WS-CSI-TANDEM            PIC 9(02) VALUE 02.             479574      
001342     02  PTER-LOG-WS              PIC 9(02).                      479576      
001343     02  PTER-SIST-WS             PIC 9(02).                      479578      
001344     02  WS-AP-OPER-APL           PIC 9(02).                      479580      
001345     02  PTER-CORTE-WS            PIC 9(02).                      479582      
001346     02  PTER-1-CSI-WS            PIC 9(02).                      479584      
001347         88 CSI-1-VALIDO          VALUES ARE 2,4,10.              479586      
001348     02  PTER-2-CSI-WS            PIC 9(02).                      479588      
001349         88 CSI-2-VALIDO          VALUES ARE 2,4,10.              479590      
001350*                                                                 479950      
001351* 01 WS-PROGRAMA PIC X(19) VALUE "S151 P116 15MTP001 ".           479970      
001352  01 WS-PROGRAMA PIC X(19) VALUE "S151 P116 25MTP001 ".           479972      
001353                                                                  479990      
001354/***************************************************************  480002      
001355***          CARGA DE TIEMPOS ESPECIALES PARA COBOL74        ***  480004      
001356****************************************************************  480006      
001357 01  CODE-FILE            PIC X(300).                             480008      
001358*                                                                 480010      
001359 01  TIME-1               PIC 9(013).                             480012      
001360*          ........ SEXAGESIMOS DE SEGUNDO DESDE LA MEDIA NOCHE.  480014      
001361 01  COMPILETIME-10       PIC 9(006).                             480016      
001362*                  ................. FECHA DE COMPILACION DDDAA.  480018      
001363 01  COMPILETIME-11       PIC 9(011).                             480020      
001364*      ... HORA DE COMPILACION EN UNIDADES DE 2.4 MICROSEGUNDOS.  480022      
001365 01  COMPILETIME-15       PIC 9(006).                             480024      
001366*                   ............... FECHA DE COMPILACION MMDDAA.  480026      
001367 01  JUL-FECHA            PIC 9(006).                             480028      
001368 01  JUL-DATE             REDEFINES JUL-FECHA.                    480030      
001369     03 FILLER            PIC 9(001).                             480032      
001370     03 JUL-YY            PIC 9(002).                             480034      
001371     03 JUL-DDD           PIC 9(003).                             480036      
001372 01  DATE-MMDDYY.                                                 480038      
001373     03 DATE-MM           PIC 9(002).                             480040      
001374     03 DATE-DD           PIC 9(002).                             480042      
001375     03 DATE-YY           PIC 9(002).                             480044      
001376 01  COCIENTE             PIC 9(002).                             480046      
001377 01  T-CREA               PIC 9(013).                             480048      
001378 01  WRESIDUO              PIC 9(002).                            480050      
001379 01  APUNT-MES            PIC 9(002).                             480052      
001380 01  MESES-BISIESTO       PIC X(036) VALUE                        480054      
001381     "031060091121152182213244274305335366".                      480056      
001382 01  MESES-BISIESTO-R     REDEFINES MESES-BISIESTO.               480058      
001383     02 M-DAY             PIC 9(003) OCCURS 12 TIMES.             480060      
001384 01  MESES                PIC X(036) VALUE                        480062      
001385     "031059090120151181212243273304334365".                      480064      
001386 01  MESES-R              REDEFINES MESES.                        480066      
001387     02 D-DAY             PIC 9(003) OCCURS 12 TIMES.             480068      
001388/                                                                 480070      
001389 01  WKS-CTLVERS-LIBRERIA            PIC X(12).                   480072      
001390 01  WKS-CTLVERS-TITULO              PIC X(72).                   480074      
001391 01  WKS-CTLVERS-STATUS              PIC S9(11) BINARY.           480076      
001392                                                                  480078      
001393 01  WKS-DATOS-HOST.                                              480080      
001394     03  WKS-NUMCSI                    PIC 9(02).                 480090      
001395     03  WKS-NOMEQUIPO                 PIC X(10).                 480100      
001396     03  WKS-NOMCSI                    PIC X(26).                 480110      
001397     03  WKS-LINEABATCH                PIC X(05).                 480120      
001398*                                                                 480130      
001399*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001400*  COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL".                  480170      
001401*================================================================ 000100      
001402*         ENTRY-POINT CONSISDIA :                               = 000200      
001403*                                                                 000300      
001404* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
001405* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
001406* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
001407* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
001408* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
001409* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
001410* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
001411* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
001412* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
001413* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
001414*                                                               = 001400      
001415*================================================================ 001500      
001416                                                                  001600      
001417                                                                  001700      
001418*================================================================ 001800      
001419* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
001420*                                                               = 002000      
001421* ENTRADA REQUERIDA :                                           = 002100      
001422*                                                               = 002200      
001423*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
001424*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
001425*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
001426*================================================================ 002600      
001427 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
001428    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
001429    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
001430    03 WKS-B01-CSI                 PIC 9(02).                     003000      
001431    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
001432    03 WKS-B01-FECCON              PIC 9(08).                     003202      
001433    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
001434    03 WKS-B01-STAREG              PIC 9(02).                     003400      
001435    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
001436    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
001437    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
001438    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
001439    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
001440    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
001441    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
001442    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
001443    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
001444    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
001445    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
001446    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
001447    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
001448       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
001449       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
001450       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
001451       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
001452*==============================================================   005200      
001453*                                                             =   005300      
001454* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
001455*                                                             =   005500      
001456* CAMPOS REQUERIDOS :                                         =   005600      
001457*                                                             =   005700      
001458* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
001459* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
001460* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
001461* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
001462*==============================================================   006200      
001463 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
001464    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
001465    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
001466    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
001467    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
001468                                                                  006800      
001469*==============================================================   006900      
001470*                                                             =   007000      
001471* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
001472*                                                             =   007200      
001473* CAMPOS REQUERIDOS :                                         =   007300      
001474*                                                             =   007400      
001475* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
001476* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
001477* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
001478* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
001479*==============================================================   007900      
001480 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
001481    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
001482    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
001483    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
001484    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
001485                                                                  008500      
001486*==============================================================   008600      
001487*                                                             =   008700      
001488* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
001489*                                                             =   008900      
001490* CAMPOS REQUERIDOS :                                         =   009000      
001491*                                                             =   009100      
001492* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
001493* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
001494* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
001495* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
001496*==============================================================   009600      
001497 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
001498    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
001499    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
001500    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
001501    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
001502                                                                  010200      
001503*============================================================     010300      
001504* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
001505*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
001506*                                                           =     010600      
001507*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
001508*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
001509*                                                           =     010900      
001510*  ENTRADA REQUERIDA.                                       =     011000      
001511*                                                           =     011100      
001512*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
001513*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
001514*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
001515*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
001516*============================================================     011600      
001517                                                                  011700      
001518 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
001519     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
001520     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
001521     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
001522     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
001523                                                                  012300      
001524*=============================================================    012400      
001525*                                                            =    012500      
001526* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
001527*             B01-SIS-FECARMOV.                              =    012700      
001528*                                                            =    012800      
001529* ENTRADA REQUERIDAD :                                       =    012900      
001530*                                                            =    013000      
001531*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
001532*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
001533*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
001534*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
001535*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
001536*=============================================================    013600      
001537                                                                  013700      
001538 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
001539     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
001540     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
001541     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
001542     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
001543     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
001544*================================================================ 014400      
001545*                                                               = 014500      
001546* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
001547*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
001548*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
001549*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
001550*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
001551*                                                               = 015100      
001552* ENTRADA REQUERIDA :                                           = 015200      
001553*                                                               = 015300      
001554* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
001555* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
001556* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
001557* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
001558* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
001559*================================================================ 015900      
001560 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
001561    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
001562    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
001563    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
001564    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
001565    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
001566                                                                  016600      
001567*============================================================     016700      
001568*                                                           =     016800      
001569* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
001570*                                                           =     017000      
001571* DATOS REQUERIDOS :                                        =     017100      
001572*                                                           =     017200      
001573* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
001574* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
001575* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
001576* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
001577* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
001578*============================================================     017800      
001579                                                                  017900      
001580 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
001581     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
001582     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
001583     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
001584     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
001585     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
001586                                                                  018600      
001587*============================================================     018700      
001588*                                                           =     018800      
001589* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
001590*                                                           =     019000      
001591* DATOS REQUERIDOS :                                        =     019100      
001592*                                                           =     019200      
001593* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
001594* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
001595* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
001596* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
001597* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
001598*============================================================     019800      
001599                                                                  019900      
001600 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
001601     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
001602     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
001603     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
001604     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
001605     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
001606                                                                  020600      
001607*===============================================================  020700      
001608*                                                              =  020800      
001609* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
001610*              MOVIMIENTOS.                                    =  021000      
001611* DATOS REQUERIDOS :                                           =  021100      
001612*                                                              =  021200      
001613* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
001614* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
001615* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
001616* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
001617* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
001618* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
001619*==============================================================   021900      
001620                                                                  022000      
001621 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
001622     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
001623     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
001624     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
001625     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
001626     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
001627     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
001628*==============================================================   022800      
001629*                                                             =   022900      
001630* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
001631*                                                             =   023100      
001632* CAMPOS REQUERIDOS :                                         =   023200      
001633*                                                             =   023300      
001634* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
001635* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
001636* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
001637* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
001638*==============================================================   023800      
001639 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
001640    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
001641    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
001642    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
001643    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
001644                                                                  024304      
001645*=================================================================024306      
001646*                ENTRY POINT CONSISB01                           =024308      
001647*                                                                =024310      
001648*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
001649*                                                                =024314      
001650*  FUNCIONES DISPONIBLES :                                       =024316      
001651*                                                                =024318      
001652*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
001653*                                                                =024322      
001654*  PARAMETROS REQUERIDOS                                         =024324      
001655*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
001656*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
001657*=================================================================024330      
001658                                                                  024332      
001659 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
001660     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
001661     03 WKS-CON-CSI                PIC 9(02).                     024336      
001662     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
001663     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
001664        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
001665        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
001666        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
001667        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
001668        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
001669                                                                  024400      
001670*=================================================================024500      
001671*                ENTRY POINT B02ARCINTER                         =024600      
001672*                                                                =024700      
001673*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
001674*                                                                =024900      
001675*  FUNCIONES DISPONIBLES :                                       =025000      
001676*                                                                =025100      
001677*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
001678* 19.- ALTAS DE ARCHIVOS.                                        =025300      
001679* 22.- BAJAS DE ARCHIVOS.                                        =025400      
001680* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
001681*                                                                =025600      
001682*  PARAMETROS REQUERIDOS                                         =025700      
001683*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
001684*                                                                =025900      
001685*=================================================================026000      
001686 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
001687     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
001688     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
001689     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
001690     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
001691     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
001692     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
001693     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
001694     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
001695     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
001696     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
001697     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
001698     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
001699     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
001700     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
001701     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
001702     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
001703     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
001704     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
001705     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
001706     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
001707     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
001708     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
001709     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
001710     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
001711     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
001712     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
001713     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
001714     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
001715                                                                  029000      
001716*=================================================================029100      
001717*                ENTRY POINT B04SISTEMA                          =029200      
001718*                                                                =029300      
001719*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
001720*                                                                =029500      
001721*  FUNCIONES DISPONIBLES :                                       =029600      
001722*                                                                =029700      
001723*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
001724*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
001725*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
001726*                                                                =030100      
001727*  PARAMETROS REQUERIDOS                                         =030200      
001728*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
001729*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
001730*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
001731*                                                                =030600      
001732*=================================================================030700      
001733 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
001734     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
001735     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
001736     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
001737     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
001738     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
001739     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
001740     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
001741                                                                  031600      
001742*================================================================ 031700      
001743*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
001744*                                                               = 031900      
001745*  FUNCION                                                      = 032000      
001746*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
001747*   19       ALTAS.                                             = 032200      
001748*   22       BAJAS                                              = 032300      
001749*   37       CAMBIOS.                                           = 032400      
001750*                                                               = 032500      
001751*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
001752*                      FECHA DE PROCESO                         = 032700      
001753*                      NUMERO DE PROCESO                        = 032800      
001754*                      FECHA INICIO                             = 032900      
001755*                      REGISTRO INICIAL                         = 033000      
001756*================================================================ 033100      
001757                                                                  033200      
001758 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
001759     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
001760     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
001761     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
001762     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
001763     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
001764     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
001765     03 WKS-B05-MIX                PIC 9(08).                     034000      
001766     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
001767     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
001768     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
001769     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
001770     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
001771     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
001772                                                                  034700      
001773                                                                  034800      
001774*================================================================ 034900      
001775*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
001776*                                                               = 035100      
001777*  FUNCION                                                      = 035200      
001778*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
001779*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
001780*                                                               = 035500      
001781*================================================================ 035600      
001782                                                                  035700      
001783 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
001784     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
001785     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
001786     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
001787     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
001788     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
001789     03 WKS-B09-NOMREN             PIC X(15).                     036400      
001790                                                                  036500      
001791*===============================================================  036600      
001792*                                                              =  036700      
001793*         ENTRY-POINT CONSISMEN                                =  036800      
001794*                                                              =  036900      
001795*   DATOS REQUERIDOS : FUNCION                                 =  037000      
001796*                      SISTEMA                                 =  037100      
001797*                                                              =  037200      
001798*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
001799*                                                              =  037400      
001800*===============================================================  037500      
001801 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
001802     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
001803     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
001804     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
001805     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
001806     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
001807     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
001808     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
001809     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
001810     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
001811     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
001812     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
001813     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
001814     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
001815     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
001816     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
001817        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
001818        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
001819        05 WKS-B03-AAMM            PIC 9(06).                     039402      
001820        05 WKS-B03-SECOK           PIC 9(10).                     039500      
001821        05 WKS-B03-SECINF          PIC 9(10).                     039600      
001822        05 WKS-B03-SECERR          PIC 9(10).                     039700      
001823        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
001824                                                                  039900      
001825*=====================================================            040000      
001826*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
001827*=====================================================            040200      
001828 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
001829     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
001830     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
001831     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
001832                                                                  040700      
001833*=====================================================            040800      
001834*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
001835*=====================================================            041000      
001836 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
001837     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
001838     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
001839     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
001840                                                                  041500      
001841*=====================================================            041600      
001842*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
001843*=====================================================            041800      
001844 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
001845     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
001846     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
001847     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
001848*=====================================================            042300      
001849*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
001850*=====================================================            042500      
001851 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
001852     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
001853     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
001854     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
001855                                                                  043000      
001856*=====================================================            043100      
001857*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
001858*=====================================================            043300      
001859 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
001860     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
001861     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
001862     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
001863                                                                  043800      
001864*=====================================================            043900      
001865*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
001866*=====================================================            044100      
001867 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
001868     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
001869     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
001870     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
001871                                                                  044600      
001872*=====================================================            044700      
001873*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
001874*=====================================================            044900      
001875 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
001876     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
001877     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
001878     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
001879                                                                  045400      
001880*=====================================================            045500      
001881*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
001882*=====================================================            045700      
001883 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
001884     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
001885     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
001886     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
001887                                                                  046200      
001888*=====================================================            046300      
001889*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
001890*=====================================================            046500      
001891 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
001892     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
001893     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
001894     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
001895                                                                  047000      
001896*=====================================================            047100      
001897*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
001898*=====================================================            047300      
001899 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
001900     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
001901     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
001902     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001903                                                                  047800      
001904*=====================================================            047900      
001905*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001906*=====================================================            048100      
001907 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001908     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001909     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001910     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001911                                                                  048600      
001912*=====================================================            048700      
001913*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001914*=====================================================            048900      
001915 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001916     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001917     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001918     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001919                                                                  049400      
001920*=====================================================            049500      
001921*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001922*=====================================================            049700      
001923 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001924     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001925     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001926     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001927     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001928     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001929     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001930     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001931     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001932     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001933     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001934                                                                  050900      
001935*=====================================================            051000      
001936*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001937*=====================================================            051200      
001938 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001939     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001940     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001941     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001942     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001943                                                                  051800      
001944*=====================================================            051900      
001945*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001946*=====================================================            052100      
001947 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001948     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001949     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001950     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001951     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001952                                                                  052700      
001953*=====================================================            052800      
001954*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001955*=====================================================            053000      
001956 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001957     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001958     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001959     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001960     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001961                                                                  053600      
001962*=====================================================            053700      
001963*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001964*=====================================================            053900      
001965 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001966     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001967     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001968     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001969     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001970                                                                  054500      
001971*=====================================================            054600      
001972*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001973*=====================================================            054800      
001974 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001975     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001976     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001977     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001978     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001979                                                                  055400      
001980*=====================================================            055500      
001981*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001982*=====================================================            055700      
001983 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001984     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001985     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001986     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001987     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001988                                                                  056300      
001989*=====================================================            056400      
001990*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001991*=====================================================            056600      
001992 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001993     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001994     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001995     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001996     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001997                                                                  057200      
001998 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001999*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002000*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002001*  COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".          480270      
002002**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
002003  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
002004  01 MENSAJE-LJ.                                                  100300      
002005     02 SISTEMA-LJ     PIC X(04).                                 100400      
002006     02 FILLER         PIC X VALUE "/".                           100500      
002007     02 PASO-LJ        PIC X(04).                                 100600      
002008     02 FILLER         PIC X VALUE "/".                           100700      
002009     02 MTP-LJ         PIC 9(03).                                 100800      
002010     02 FILLER         PIC X VALUE ":".                           100900      
002011     02 TIPO-LJ        PIC X.                                     101000      
002012     02 FILLER         PIC X VALUE ">".                           101100      
002013     02 CODIGO-LJ      PIC 9(06).                                 101200      
002014     02 FILLER         PIC X VALUE "<".                           101300      
002015     02 TEXTO-LJ       PIC X(250).                                101400      
002016*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002017*                                                                 480370      
002018****************************************************************  480500      
002019 PROCEDURE DIVISION.                                              481000      
002020 0000-PRIMERA                    SECTION.                         481500      
002021*                                                                 482000      
002022/**********************************************************       482502      
002023***      CARGA DE TIEMPOS ESPECIALES PARA COBOL74       ***       482504      
002024***********************************************************       482506      
002025 FNC-CARGA-TIEMPOS.                                               482508      
002026*                                                                 482510      
002027     MOVE   ATTRIBUTE NAME  OF MYSELF TO CODE-FILE.               482512      
002028     CHANGE ATTRIBUTE TITLE OF FILE1  TO CODE-FILE.               482514      
002029     IF ATTRIBUTE PRESENT   OF FILE1 IS EQUAL TO VALUE TRUE       482516      
002030        PERFORM 100-CARGATIMES                                    482518      
002031     ELSE                                                         482520      
002032        MOVE 999999      TO COMPILETIME-15                        482522      
002033        MOVE 99999999999 TO COMPILETIME-11                        482524      
002034        MOVE 99999       TO COMPILETIME-10.                       482526      
002035     ACCEPT  TIME-1    FROM TIMER.                                482528      
002036     COMPUTE TIME-1 = ((TIME-1 * 2.4) / 1000000) * 60.            482530      
002037*                                                                 482532      
002038 100-CARGATIMES.                                                  482534      
002039*                                                                 482536      
002040     MOVE ATTRIBUTE CREATIONTIME OF FILE1 TO COMPILETIME-11.      482538      
002041     COMPUTE COMPILETIME-11 = COMPILETIME-11 / 2.4.               482539      
002042     MOVE ATTRIBUTE CREATIONDATE OF FILE1 TO COMPILETIME-10.      482540      
002043     MOVE COMPILETIME-10 TO JUL-FECHA.                            482541      
002044     MOVE JUL-YY         TO DATE-YY.                              482542      
002045*    DIVIDE JUL-YY BY 4 GIVING COCIENTE REMAINDER WRESIDUO.       482543      
002046*    SI DA COMO RESIDUO = 0, ENTONCES SE TRATA DE A\O BISIESTO.   482544      
002047                                                                  482545      
002048     IF JUL-YY < 80                                               482546      
002049        COMPUTE W77-JUL-YY4 = JUL-YY + 2000                       482547      
002050     ELSE                                                         482549      
002051        COMPUTE W77-JUL-YY4 = JUL-YY + 1900.                      482551      
002052                                                                  482553      
002053     DIVIDE W77-JUL-YY4 BY 4 GIVING COCIENTE REMAINDER WRESIDUO.  482554      
002054     IF WRESIDUO = 0                                              482555      
002055        PERFORM 200-SUMAUNO VARYING APUNT-MES    FROM 1 BY 1      482556      
002056                      UNTIL JUL-DDD < (M-DAY(APUNT-MES) + 1)      482558      
002057        MOVE APUNT-MES TO DATE-MM                                 482560      
002058        IF APUNT-MES > 1                                          482562      
002059           SUBTRACT M-DAY(APUNT-MES - 1)                          482564      
002060                    FROM JUL-DDD          GIVING DATE-DD          482566      
002061        ELSE                                                      482568      
002062           MOVE JUL-DDD                   TO DATE-DD              482570      
002063     ELSE                                                         482572      
002064        PERFORM 200-SUMAUNO VARYING APUNT-MES    FROM 1 BY 1      482574      
002065                      UNTIL JUL-DDD < (D-DAY(APUNT-MES) + 1)      482576      
002066        MOVE APUNT-MES TO DATE-MM                                 482578      
002067        IF APUNT-MES > 1                                          482580      
002068           SUBTRACT D-DAY(APUNT-MES - 1)                          482582      
002069                    FROM JUL-DDD          GIVING DATE-DD          482584      
002070        ELSE                                                      482586      
002071           MOVE JUL-DDD                   TO DATE-DD.             482588      
002072      MOVE DATE-MMDDYY                    TO COMPILETIME-15.      482590      
002073 200-SUMAUNO. EXIT.                                               482592      
002074/                                                                 482594      
002075 0000-MODULO-PRINCIPAL.                                           483000      
002076     PERFORM 1000-INICIA-PROCESO.                                 483500      
002077     PERFORM 2000-PROCESA-SISTEMA VARYING PTER-SIST-WS            484000      
002078                                     FROM 1 BY 1                  484500      
002079                                    UNTIL PTER-SIST-WS > 1.       485000      
002080     PERFORM 3000-PROCESA-LOG-GRAL.                               485500      
002081     PERFORM 4000-TERMINA-PROCESO.                                486000      
002082     STOP RUN.                                                    486500      
002083/                                                                 487000      
002084*                                                                 487070      
002085****************************************************************  487500      
002086 1000-INICIA-PROCESO.                                             488000      
002087     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   488002      
002088      "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".            488004      
002089     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     488006      
002090     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      488008      
002091     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.488020      
002092     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            488040      
002093                                      "SOPORTECOMS".              488050      
002094     CALL "CSIID OF SOPORTECOMS" USING WKS-DATOS-HOST.            488060      
002095     IF WKS-NUMCSI = 32 OR 12                                     488062      
002096        MOVE 10           TO      WKS-NUMCSI.                     488064      
002097     MOVE WKS-NUMCSI      TO      WKS-TR-CSI2.                    488065      
002098*                                                                 488066      
002099*ASM CHANGE ATTRIBUTE LIBACCESS    OF "CTRLVERS" TO BYFUNCTION.   488068      
002100*ASM CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".    488070      
002101*ASM                                                              488072      
002102*ASM MOVE "S151L001CTL"         TO WKS-CTLVERS-LIBRERIA           488074      
002103*ASM CALL "DAME_TIT IN CTRLVERS"                                  488076      
002104*ASM      USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO          488078      
002105*ASM      GIVING WKS-CTLVERS-STATUS.                              488080      
002106*ASM                                                              488081      
002107*ASM IF WKS-CTLVERS-STATUS < 0                                    488082      
002108*ASM    MOVE "ERROR EN CTLVERS, USO LIBEST SIN RELEASE NI MTP"    488083      
002109*ASM                     TO TEXTO-LJ                              488084      
002110*ASM ELSE                                                         488085      
002111*ASM    CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL" TO             488086      
002112*ASM           WKS-CTLVERS-TITULO.                                488087      
002113     MOVE "S151"                  TO SISTEMA-LJ.                  488088      
002114     MOVE "P116"                  TO WKS-PASO-BACK2               488089      
002115                                     PASO-LJ                      488090      
002116                                     WLI-RB-E1-PASO.              488091      
002117     MOVE "001"                   TO MTP-LJ.                      488092      
002118     MOVE "DIARIO"                TO WLI-RB-E2-TIPO-PROC2.        488093      
002119     MOVE "151"        TO WKS-SIS-BACK2, WLI-RB-E3-SISTEMA2.      488094      
002120     PERFORM 11500-OBTIENE-FECHA-CTRL.                            488097      
002121     PERFORM 12500-VACIA-FECHAS.                                  488147      
002122     MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ        488150      
002123     MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ         488200      
002124     MOVE 020101                 TO CODIGO-LJ                     488250      
002125     MOVE "INICIO DE PROCESO"                                     488300      
002126                                 TO WLI-TEXTO-LJ, TEXTO-LJ        488350      
002127     PERFORM      000-030-IMPRIME-MENSAJE                         488400      
002128     PERFORM FNC-CARGA-TIEMPOS.                                   488500      
002129     MOVE COMPILETIME-15         TO VERSION-WS.                   489000      
002130     MOVE DD-VS                  TO DUMMY-WS.                     489500      
002131     MOVE MM-VS                  TO DD-VS.                        490000      
002132     MOVE DUMMY-WS               TO MM-VS.                        490500      
002133     MOVE LOW-VALUES             TO WS-LOW-VALUES.                492500      
002134*                                                                 495000      
002135     OPEN OUTPUT COMPENSACION.                                    495500      
002136     MOVE ZEROS                  TO REG-COMPENSACION.             496000      
002137     MOVE ZEROS                  TO LLAVE-COMP.                   496500      
002138     WRITE REG-COMPENSACION      INVALID KEY                      497000      
002139          MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ   497550      
002140          MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ    497600      
002141          MOVE 010105                 TO CODIGO-LJ                497650      
002142          MOVE "ERROR AL GRABAR REG DE CTRL COMPENSACION"         497700      
002143                                      TO WLI-TEXTO-LJ, TEXTO-LJ   497750      
002144          PERFORM      000-030-IMPRIME-MENSAJE                    497800      
002145          SET MYSELF(STATUS)     TO -1.                           498000      
002146     CLOSE COMPENSACION WITH SAVE.                                498500      
002147/                                                                 499000      
002148     MOVE LOW-VALUES             TO IDENTIFICADORES-WS.           499500      
002149     MOVE ZEROS                  TO REG-COMPENSACION.             500000      
002150     MOVE ZEROS                  TO LLAVE-COMP.                   500500      
002151     MOVE LOW-VALUES             TO CONTADORES-WS.                501000      
002152     MOVE LOW-VALUES             TO TOTALES-WS.                   501500      
002153     MOVE 1                      TO NUM-PROCESO-WS.               502000      
002154*                                                                 502500      
002155     ACCEPT WS-TIME              FROM TIME.                       503000      
002156*ASM MOVE WS-DATE-AA             TO AA-REAL-WS.                   503500      
002157*ASM MOVE WS-DATE-MM             TO MM-REAL-WS.                   504000      
002158*ASM MOVE WS-DATE-DD             TO DD-REAL-WS.                   504500      
002159*ASM MOVE WS-DATE                TO WS-ENC2-FEC.                  505000      
002160*ASM MOVE WS-DATE                TO TIT-ELIM2-FEC                 505500      
002161     MOVE WS-TIME-HH             TO WS-ENC3-HH.                   506000      
002162     MOVE WS-TIME-MM             TO WS-ENC3-MM.                   506100      
002163     MOVE WS-TIME-SS             TO WS-ENC3-SS.                   506200      
002164     MOVE WS-TIME-HH             TO TIT-ELIM3-HH.                 506500      
002165     MOVE WS-TIME-MM             TO TIT-ELIM3-MM.                 506600      
002166     MOVE WS-TIME-SS             TO TIT-ELIM3-SS.                 506700      
002167*                                                                 507000      
002168*ASM PERFORM 12000-OBTIENE-FECHA.                                 507500      
002169     MOVE WS-FECHA-AMD           TO WS-ENC4-FEC.                  508000      
002170     MOVE WS-FECHA-AMD           TO TIT-ELIM4-FEC.                508500      
002171*ASM IF FPROCESO-AA < 93  AND  FPROCESO-AA > 95                   508600      
002172*ASM    MOVE SPACES              TO WS-ENC4-TIT.                  508700      
002173*                                                                 508750      
002174 0100-FORMATO-DISPLAY.                                            508800      
002175*---------------------                                            508850      
002176                                                                  508900      
002177*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002178* COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY.".                   508950      
002179                                                                  000100      
002180*===============================================================* 000200      
002181*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
002182*         PARA LLAMADO DE DISPLAY                               * 000400      
002183*===============================================================* 000500      
002184                                                                  000600      
002185     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
002186            TO BYFUNCTION.                                        000671      
002187                                                                  000691      
002188     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
002189          USING WKS-DATE-ARRAY2.                                  000800      
002190     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
002191     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
002192     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
002193     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
002194     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
002195     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
002196                                                                  001300      
002197     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
002198     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
002199     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
002200                               WKS-TIT-REPORTE2.                  001700      
002201*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
002202*                                  GIVING WKS-COMPILA2.           001900      
002203*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
002204*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
002205*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
002206*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
002207                                                                  002066      
002208*    IF WKS-AAA-VERSION2  < 50                                    002071      
002209*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
002210*    ELSE                                                         002081      
002211*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
002212                                                                  002091      
002213                                                                  002500      
002214*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
002215     OPEN OUTPUT V00-REPORTE2.                                    002700      
002216     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
002217     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
002218                                                                  003000      
002219 000-050-CHECA-SALTO-HOJA2.                                       003051      
002220*==========================                                       003071      
002221    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
002222     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
002223        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
002224     ELSE                                                         003079      
002225        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
002226     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
002227     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
002228     MOVE "/"                     TO WKS-SLASH1.                  003086      
002229     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
002230     MOVE "/"                     TO WKS-SLASH2.                  003088      
002231     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
002232     IF  WKS-NUM-LINEAS2 > 56                                     003091      
002233         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
002234         ADD 1                   TO    W77-CONT-HOJA2             003200      
002235         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
002236         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
002237         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
002238         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
002239         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
002240         MOVE SPACES             TO V00-R00-REPORTE2              003800      
002241         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
002242         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
002243                                                                  004100      
002244 000-030-IMPRIME-MENSAJE.                                         004200      
002245*========================                                         004300      
002246*LP                                                               004400      
002247     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
002248     ADD             2       TO WKS-NUM-LINEAS2                   004600      
002249     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
002250                                                                  004800      
002251*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002252*                                                                 509000      
002253 11500-OBTIENE-FECHA-CTRL.                                        509005      
002254*-------------------------                                        509010      
002255     OPEN INPUT A01-CONTROL.                                      509015      
002256     READ A01-CONTROL INTO WKS-REG-HD-CONTROL.                    509020      
002257     MOVE WKS-HD-FECPRO           TO WS-FECHA-AMD.                509025      
002258     CLOSE A01-CONTROL.                                           509030      
002259                                                                  509035      
002260*===================                                              509060      
002261 12500-VACIA-FECHAS.                                              509065      
002262*===================                                              509070      
002263     MOVE WS-FECHA-AMD              TO WLI-RB-E1-FECHA-INF2.      509160      
002264     PERFORM 0100-FORMATO-DISPLAY.                                509161      
002265     MOVE WKS-FEMAQ8D2              TO WS-FEMAQ-AMD.              509163      
002266     PERFORM 1012-INVIERTE-FECHAS.                                509164      
002267     MOVE WS-FECHA-DMA              TO W77-FECHA-PROC.            509165      
002268     MOVE WS-FEMAQ-AMD              TO WS-DATE.                   509166      
002269     MOVE WS-FEMAQ-DMA              TO FECHA-REAL-WS.             509167      
002270     MOVE WS-DATE                   TO WS-ENC2-FEC.               509168      
002271     MOVE WS-DATE                   TO TIT-ELIM2-FEC.             509169      
002272     MOVE WKS-NUMCSI              TO PTER-CSI-WS.                 509170      
002273     IF PTER-CSI-CORP                                             509175      
002274        MOVE WS-CSI-TANDEM        TO PTER-CSI-WS.                 509180      
002275     IF NOT PTER-CSIOK                                            509195      
002276        MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ     509200      
002277        MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ      509201      
002278        MOVE 010104                 TO CODIGO-LJ                  509202      
002279        MOVE "CSI INVALIDO EN LIB-CONTROL"                        509203      
002280                                    TO WLI-TEXTO-LJ, TEXTO-LJ     509204      
002281        PERFORM      000-030-IMPRIME-MENSAJE                      509205      
002282        SET MYSELF(STATUS)        TO -1.                          509210      
002283*                                                                 509215      
002284     MOVE ABR-CSI-TC(PTER-CSI-WS) TO NL-CSI-ORI                   509435      
002285                                     NI-CSI-ORI NI-CSI-DES.       509440      
002286     MOVE WS-FECHA-AMD            TO NL-CSI-FEC NI-CSI-FEC.       509455      
002287*                                                                 509490      
002288 1012-INVIERTE-FECHAS.                                            509590      
002289*---------------------                                            509690      
002290     MOVE WS-FE-AMD-DIA             TO WS-FE-DMA-DIA.             509790      
002291     MOVE WS-FE-AMD-MES             TO WS-FE-DMA-MES.             509890      
002292     MOVE WS-FE-AMD-YEAR            TO WS-FE-DMA-YEAR.            509990      
002293     MOVE WS-FM-AMD-DIA             TO WS-FM-DMA-DIA.             510090      
002294     MOVE WS-FM-AMD-MES             TO WS-FM-DMA-MES.             510190      
002295     MOVE WS-FM-AMD-YEAR            TO WS-FM-DMA-YEAR.            510290      
002296/***************************************************************  526000      
002297 2000-PROCESA-SISTEMA.                                            526500      
002298*                                                                 527000      
002299     MOVE LOW-VALUES              TO TAB-ACUM TAB-AELIM.          527500      
002300     MOVE LOW-VALUES              TO TAB-TOT  TAB-TELIM.          528000      
002301     MOVE ZEROS                   TO WS-CONT-NOARCH.              528500      
002302     MOVE ZEROS                   TO WS-CONT-DIF.                 529000      
002303*    MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WS-RM-MIX.             529001      
002304*    MOVE FPROCESO-DD             TO WS-RM-DD.                    529002      
002305*    MOVE FPROCESO-MM             TO WS-RM-MM.                    529003      
002306*    MOVE FPROCESO-AA             TO WS-RM-AA.                    529004      
002307*    MOVE 12                      TO WS-RM-NODO.                  529006      
002308*    MOVE ZEROES                  TO WS-RM-SUBNODO.               529008      
002309*    MOVE "C"                     TO WS-RM-TIPO.                  529010      
002310*    MOVE 001                     TO WS-RM-SEQ.                   529012      
002311*    MOVE "CARATULA  "            TO WS-RM-DESC.                  529014      
002312*    CHANGE ATTRIBUTE TITLE OF REPORTE TO WS-NOMB-REPORTE.        529016      
002313*    OPEN OUTPUT REPORTE.                                         529500      
002314*    MOVE "R"                     TO WS-RM-TIPO.                  529550      
002315*    MOVE 002                     TO WS-RM-SEQ.                   529600      
002316*    MOVE "ELIMINADOS"            TO WS-RM-DESC.                  529700      
002317*    CHANGE ATTRIBUTE TITLE OF LISTADO TO WS-NOMB-REPORTE.        529800      
002318*    OPEN OUTPUT LISTADO.                                         529900      
002319                                                                  530000      
002320     PERFORM 2001-VERIFICA-CSIS   VARYING PTER-CSI-WS             530500      
002321                                  FROM  1 BY 1                    531000      
002322                           UNTIL PTER-CSI-WS > LIM-CSIS.          531500      
002323     PERFORM 2006-IMPRIME-TOTALES.                                532000      
002324     PERFORM 20029-TOTAL-GRAL-ELIM.                               532500      
002325     MOVE LOW-VALUES            TO CONTADORES-WS.                 533000      
002326     MOVE LOW-VALUES            TO TOTALES-WS.                    533500      
002327     MOVE LOW-VALUES            TO IDENTIFICADORES-WS.            534000      
002328*      CLOSE REPORTE LISTADO.                                     534500      
002329                                                                  535000      
002330*ASM    DISPLAY "010401 01  " WS-PROGRAMA,                        535100      
002331*ASM            " FALTA UN LOG PARA EL PROCESO"                   535500      
002332*ASM    SET MYSELF(STATUS) TO -1.                                 536000      
002333*    IF WS-CONT-DIF    > 1                                        536500      
002334*       DISPLAY "S151/100: HAY MAS DE UN LOG INCOMPLETO O "       537000      
002335*               "CON DIF ENTRE TOTAL MOVTOS Y TRAILER"            537500      
002336*       SET MYSELF(STATUS) TO -1.                                 538000      
002337*                                                                 538500      
002338     OPEN I-O    COMPENSACION.                                    539000      
002339     OPEN OUTPUT LOG-GRAL.                                        539500      
002340*                                                                 540000      
002341     COMPUTE WS-MEM-SIZE =                                        540500      
002342           ( WS-REGSIZE-LOG-SORT2 + WS-CT1-MSIZE ) * WS-CT2-MSIZE 541000      
002343                                                 + WS-CT3-MSIZE.  541500      
002344*                                                                 542000      
002345     PERFORM 2010-PROCESA-CSI VARYING PTER-CSI-WS                 542500      
002346                                 FROM 1 BY 1                      543000      
002347                           UNTIL PTER-CSI-WS > LIM-CSIS.          543500      
002348*                                                                 544000      
002349     CLOSE COMPENSACION WITH LOCK.                                544500      
002350     CLOSE LOG-GRAL     WITH SAVE.                                545000      
002351/                                                                 545500      
002352 2001-VERIFICA-CSIS.                                              546000      
002353     MOVE ZEROS                       TO HAY-DIF-WS.              546500      
002354     MOVE ZEROS                       TO HAY-TRAILER-WS.          547000      
002355     MOVE ZEROS                       TO FIN-LOG-CSI-WS.          547500      
002356     MOVE ZEROS                       TO ARCHIVO-EXISTE-WS.       548000      
002357     MOVE PTER-CSI-WS                 TO CSIS-INVALIDOS-WS.       548500      
002358     IF CSIS-INVALIDOS                                            549000      
002359        NEXT SENTENCE                                             549500      
002360     ELSE                                                         550000      
002361        MOVE ABR-CSI-TC(PTER-CSI-WS)  TO NL-CSI-ORI               550500      
002362        MOVE WS-FECHA-AMD             TO NL-CSI-FEC FECHA-NLG     551000      
002363        CHANGE ATTRIBUTE TITLE OF LOG-CSI TO NOMBRE-LOGCSI        551500      
002364*ASM    IF ATTRIBUTE RESIDENT OF LOG-CSI  EQUAL TO VALUE TRUE     552000      
002365*ASM         MOVE 1                   TO ARCHIVO-EXISTE-WS        552500      
002366*ASM    ELSE                                                      553000      
002367*ASM         ADD  1                   TO WS-CONT-NOARCH           553500      
002368*ASM         DISPLAY "010501 01  " WS-PROGRAMA,                   553600      
002369*ASM                 "FALTA LOG "NOMBRE-LOGCSI.                   554000      
002370*ASM         MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ554050      
002371*ASM         MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ 554100      
002372*ASM         MOVE 010501                 TO CODIGO-LJ             554150      
002373*ASM         MOVE "FALTA UNO DE LOS ARCHIVOS LOGCSI, P.F. REVISAR"554200      
002374*ASM                                     TO WLI-TEXTO-LJ, TEXTO-LJ554250      
002375*ASM         PERFORM      000-030-IMPRIME-MENSAJE                 554300      
002376*ASM         SET MYSELF(STATUS)     TO -1.                        554400      
002377*ASM IF ARCHIVO-EXISTE                                            554500      
002378        OPEN INPUT LOG-CSI                                        555000      
002379*       DISPLAY "S151/100: "NOMBRE-LOGCSI" ENTRA A VERIFICACION"  555500      
002380        PERFORM 2002-PROCESA-CSI                                  556000      
002381*       DISPLAY "S151/100: "NOMBRE-LOGCSI" YA FUE PROCESADO"      556500      
002382        CLOSE LOG-CSI  WITH SAVE.                                 557000      
002383/                                                                 557500      
002384 2002-PROCESA-CSI.                                                558000      
002385        MOVE 0                       TO HAY-ELIMINA-WS.           558500      
002386        MOVE 0                       TO  SI-ELIMINA-WS.           559000      
002387        READ LOG-CSI             INTO WS-REG-LOG                  559500      
002388         AT END                                                   560000      
002389               MOVE 1                TO  FIN-LOG-CSI-WS.          560500      
002390        MOVE ABR-CSI-TC(PTER-CSI-WS) TO WS-DET1-CSI  WS-DET7-CSI. 561000      
002391        MOVE WS-RLC-FECHA            TO WS-DET1-FEC  WS-DET7-FEC. 561500      
002392        MOVE WS-RLC-HH               TO WS-DET1-HH   WS-DET7-HH . 562000      
002393        MOVE WS-RLC-MM               TO WS-DET1-MM   WS-DET7-MM . 562100      
002394        MOVE WS-RLC-SS               TO WS-DET1-SS   WS-DET7-SS . 562200      
002395        IF WS-RLC-FECONT   NOT EQUAL TO WS-FECHA-AMD              562500      
002396*            WRITE LINEA FROM WS-CCTL-DET7 BEFORE 3               563000      
002397           ADD 1                     TO WS-CONT-NOARCH            563500      
002398*ASM       DISPLAY "010401 01  " WS-PROGRAMA,                     563600      
002399*ASM               " FECHA CONTABLE " WS-RLC-FECONT               564000      
002400*ASM               " DEL "NOMBRE-LOGCSI                           564500      
002401*ASM               " NO CORRESPONDE CON FECHA"                    565000      
002402*ASM               " PROCESO " FECHA-PROCESO-WS                   565500      
002403           MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ  565550      
002404           MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ   565600      
002405           MOVE 010401                 TO CODIGO-LJ               565650      
002406           MOVE "FECHA CONTABLE NO CORRESPONDE CON FECHA PROCESO" 565700      
002407                                       TO WLI-TEXTO-LJ, TEXTO-LJ  565750      
002408           PERFORM      000-030-IMPRIME-MENSAJE                   565800      
002409           SET MYSELF(STATUS)     TO -1                           565900      
002410        ELSE                                                      566000      
002411           MOVE ZEROS                TO WS-APL-ORI-ANT            566500      
002412           PERFORM 20023-LEE-LOG-CSI                              567000      
002413           PERFORM 20027-ENCABEZADO-ELIMINA                       567500      
002414           PERFORM 20021-SUMARIZA UNTIL FIN-LOG-CSI               568000      
002415           PERFORM 20024-IMPRIME-DETALLE                          568500      
002416           PERFORM 20025-BUSCA-DIFERENCIA                         569000      
002417           IF SI-ELIMINA                                          569500      
002418              PERFORM 20028-TOTALES-CSI-ELIM                      570000      
002419           ELSE                                                   570500      
002420*             WRITE LREP2 FROM TIT-ELIM8 BEFORE 3                 571000      
002421              ADD 3                  TO WS-CONT-R2-LIN.           571500      
002422        MOVE LOW-VALUES              TO TAB-ACUM TAB-AELIM.       572000      
002423/                                                                 572500      
002424 20021-SUMARIZA.                                                  573000      
002425     MOVE 1                       TO HAY-ELIMINA-WS.              573500      
002426     MOVE SPACES                  TO REP2-DET1 REP2-DET2.         574000      
002427*                                                                 574500      
002428     IF WS-RDI-APL-ORI NOT EQUAL TO WS-APL-ORI-ANT                575000      
002429        PERFORM 20011-BUSCA-SIST.                                 575500      
002430*                                                                 576000      
002431     IF RDI-STA-TRN-OPERADO                                       576500      
002432        MOVE 1                    TO WS-AP-OPER-APL               577000      
002433     ELSE                                                         577500      
002434     IF RDI-STA-TRN-APLICADO                                      578000      
002435        MOVE 2                    TO WS-AP-OPER-APL               578500      
002436     ELSE                                                         579000      
002437        MOVE 3                    TO WS-AP-OPER-APL.              579500      
002438*                                                                 580000      
002439*ASM IF ENCONTRE-GUARDIAN                                         580500      
002440        IF RDI-CSI-ORI-VAL AND RDI-CSI-DES-VAL                    581000      
002441           IF WS-RDI-CSI-ORI NOT = WS-RDI-CSI-DES                 581500      
002442              IF RDI-STA-TRN-OPERADO OR RDI-STA-TRN-APLICADO      582000      
002443                 IF RDI-COD-SER-VAL                               582500      
002444                    MOVE ZEROS    TO HAY-ELIMINA-WS               583000      
002445                    PERFORM  20022-SUMA-CARGO-ABONO               583500      
002446                 ELSE                                             584000      
002447                    MOVE "NAT/INVALIDA"                           584500      
002448                                  TO R2D1-ERRORES                 585000      
002449              ELSE                                                585500      
002450                 MOVE "STA/INVALIDO"                              586000      
002451                                  TO R2D1-ERRORES                 586500      
002452           ELSE                                                   587000      
002453              MOVE "MOVTO. LOCAL" TO R2D1-ERRORES                 587500      
002454        ELSE                                                      588000      
002455           MOVE "CSI/INVALIDO"    TO R2D1-ERRORES.                588500      
002456*ASM ELSE                                                         589000      
002457*ASM    MOVE "APL/INVALIDO"       TO R2D1-ERRORES.                589500      
002458*                                                                 590000      
002459     IF HAY-ELIMINA                                               590500      
002460        PERFORM 200221-SUMA-CARGO-ABONO-ELIM                      591000      
002461        PERFORM 20026-IMPRIME-ELIMINACION.                        591500      
002462     PERFORM 20023-LEE-LOG-CSI .                                  592000      
002463/                                                                 592500      
002464 20011-BUSCA-SIST.                                                593000      
002465*                                                                 593500      
002466     MOVE WS-RDI-APL-ORI          TO WS-APL-ORI-ANT.              594000      
002467*                                                                 594500      
002468*ASM MOVE ZEROS                   TO WS-ENCONTRE-GUARDIAN.        595000      
002469*ASM READ GUARDIAN              INTO WS-REG-GUARDIAN              595500      
002470*ASM      INVALID KEY                                             596000      
002471*ASM      MOVE 1                  TO WS-ENCONTRE-GUARDIAN.        596500      
002472*                                                                 597000      
002473 20022-SUMA-CARGO-ABONO.                                          597500      
002474     IF RDI-COD-SER-CARGO                                         598000      
002475        ADD 1              TO NUM-CARGOS-ACUM(WS-AP-OPER-APL)     598500      
002476        ADD 1              TO NUM-CARGOS-TOT (WS-AP-OPER-APL)     599000      
002477        ADD WS-RDI-IMP-TRN TO IMP-CARGOS-ACUM(WS-AP-OPER-APL)     599500      
002478        ADD WS-RDI-IMP-TRN TO IMP-CARGOS-TOT (WS-AP-OPER-APL)     600000      
002479     ELSE                                                         600500      
002480     IF RDI-COD-SER-ABONO                                         601000      
002481        ADD 1              TO NUM-ABONOS-ACUM(WS-AP-OPER-APL)     601500      
002482        ADD 1              TO NUM-ABONOS-TOT (WS-AP-OPER-APL)     602000      
002483        ADD WS-RDI-IMP-TRN TO IMP-ABONOS-ACUM(WS-AP-OPER-APL)     602500      
002484        ADD WS-RDI-IMP-TRN TO IMP-ABONOS-TOT (WS-AP-OPER-APL)     603000      
002485     ELSE                                                         603500      
002486     IF RDI-COD-SER-ELIMCARGO                                     604000      
002487        SUBTRACT 1       FROM NUM-CARGOS-ACUM(WS-AP-OPER-APL)     604500      
002488        SUBTRACT 1       FROM NUM-CARGOS-TOT (WS-AP-OPER-APL)     605000      
002489        SUBTRACT WS-RDI-IMP-TRN                                   605500      
002490                         FROM IMP-CARGOS-ACUM(WS-AP-OPER-APL)     606000      
002491        SUBTRACT WS-RDI-IMP-TRN                                   606500      
002492                         FROM IMP-CARGOS-TOT (WS-AP-OPER-APL)     607000      
002493     ELSE                                                         607500      
002494*    ...RDI-CT-ELIMABONO                                          608000      
002495        SUBTRACT 1       FROM NUM-ABONOS-ACUM(WS-AP-OPER-APL)     608500      
002496        SUBTRACT 1       FROM NUM-ABONOS-TOT (WS-AP-OPER-APL)     609000      
002497        SUBTRACT WS-RDI-IMP-TRN                                   609500      
002498                         FROM IMP-ABONOS-ACUM(WS-AP-OPER-APL)     610000      
002499        SUBTRACT WS-RDI-IMP-TRN                                   610500      
002500                         FROM IMP-ABONOS-TOT (WS-AP-OPER-APL).    611000      
002501/                                                                 611500      
002502 200221-SUMA-CARGO-ABONO-ELIM.                                    612000      
002503*                                                                 612500      
002504     IF RDI-COD-SER-CARGO                                         613000      
002505        ADD 1              TO NUM-CARGOS-AELIM(WS-AP-OPER-APL)    613500      
002506        ADD WS-RDI-IMP-TRN TO IMP-CARGOS-AELIM(WS-AP-OPER-APL)    614000      
002507     ELSE                                                         614500      
002508     IF RDI-COD-SER-ABONO                                         615000      
002509        ADD 1              TO NUM-ABONOS-AELIM(WS-AP-OPER-APL)    615500      
002510        ADD WS-RDI-IMP-TRN TO IMP-ABONOS-AELIM(WS-AP-OPER-APL)    616000      
002511     ELSE                                                         616500      
002512     IF RDI-COD-SER-ELIMCARGO                                     617000      
002513        SUBTRACT 1       FROM NUM-CARGOS-AELIM(WS-AP-OPER-APL)    617500      
002514        SUBTRACT WS-RDI-IMP-TRN                                   618000      
002515                         FROM IMP-CARGOS-AELIM(WS-AP-OPER-APL)    618500      
002516     ELSE                                                         619000      
002517     IF RDI-COD-SER-ELIMABONO                                     619500      
002518        SUBTRACT 1       FROM NUM-ABONOS-AELIM(WS-AP-OPER-APL)    620000      
002519        SUBTRACT WS-RDI-IMP-TRN                                   620500      
002520                         FROM IMP-ABONOS-AELIM(WS-AP-OPER-APL)    621000      
002521     ELSE                                                         621500      
002522        ADD 1              TO NUM-CARABO-AELIM(WS-AP-OPER-APL)    622000      
002523        ADD WS-RDI-IMP-TRN TO IMP-CARABO-AELIM(WS-AP-OPER-APL).   622500      
002524*                                                                 623000      
002525/=================                                                623500      
002526 20023-LEE-LOG-CSI.                                               624000      
002527*=================                                                624500      
002528     READ LOG-CSI               INTO WS-REG-LOG                   625000      
002529       AT END                                                     625500      
002530          MOVE 1                  TO FIN-LOG-CSI-WS.              626000      
002531*                                                                 626500      
002532     IF WS-REG-LOG                = LOW-VALUES OR HIGH-VALUES     627000      
002533        MOVE  1                   TO FIN-LOG-CSI-WS.              627500      
002534     IF WS-RLT-IDENT              = "TRAILER"                     628000      
002535        MOVE WS-REG-LOG           TO WS-IMPORTES-TRAILER          628500      
002536        MOVE 1                    TO HAY-TRAILER-WS               629000      
002537        MOVE 1                    TO FIN-LOG-CSI-WS.              629500      
002538     IF FIN-LOG-CSI    AND       NOT HAY-TRAILER                  630000      
002539        ADD  1                    TO WS-CONT-DIF.                 630500      
002540     IF NOT FIN-LOG-CSI                                           631000      
002541        MOVE WS-REG-LOG           TO WS-REG-DET-INFOICA.          631500      
002542*                                                                 631600      
002543     IF NOT FIN-LOG-CSI                                           631610      
002544        IF WS-RDI-CSI-ORI = 09                                    631620      
002545           MOVE 10                TO WS-RDI-CSI-ORI               631630      
002546        ELSE                                                      631632      
002547        IF WS-RDI-CSI-ORI = 07                                    631634      
002548           MOVE 04                TO WS-RDI-CSI-ORI               631636      
002549        ELSE                                                      631640      
002550        IF WS-RDI-CSI-ORI = 01                                    631643      
002551           MOVE 04                TO WS-RDI-CSI-ORI               631647      
002552        ELSE                                                      631650      
002553        IF WS-RDI-CSI-ORI = 06                                    631652      
002554           MOVE 04                TO WS-RDI-CSI-ORI.              631654      
002555*                                                                 631840      
002556     IF NOT FIN-LOG-CSI                                           631850      
002557        IF WS-RDI-CSI-DES = 09                                    631860      
002558           MOVE 10                TO WS-RDI-CSI-DES               631870      
002559        ELSE                                                      631872      
002560        IF WS-RDI-CSI-DES = 07                                    631874      
002561           MOVE 04                TO WS-RDI-CSI-DES               631876      
002562        ELSE                                                      631879      
002563        IF WS-RDI-CSI-DES = 01                                    631882      
002564           MOVE 04                TO WS-RDI-CSI-DES               631885      
002565        ELSE                                                      631890      
002566        IF WS-RDI-CSI-DES = 06                                    631892      
002567           MOVE 04                TO WS-RDI-CSI-DES.              631894      
002568*                                                                 632000      
002569*======================                                           632500      
002570 20024-IMPRIME-DETALLE.                                           633000      
002571*======================                                           633500      
002572     MOVE NUM-CARGOS-ACUM(1)     TO WS-DET1-NCO.                  634000      
002573     MOVE IMP-CARGOS-ACUM(1)     TO WS-DET1-ICO.                  634500      
002574     MOVE NUM-ABONOS-ACUM(1)     TO WS-DET1-NAO.                  635000      
002575     COMPUTE IMPORTE-NEGATI = IMP-ABONOS-ACUM(1) * -1.            635500      
002576     MOVE IMPORTE-NEGATI         TO WS-DET1-IAO.                  636000      
002577     MOVE NUM-CARGOS-ACUM(2)     TO WS-DET1-NCA.                  636500      
002578     COMPUTE IMPORTE-NEGATI = IMP-CARGOS-ACUM(2) * -1.            637000      
002579     MOVE IMPORTE-NEGATI         TO WS-DET1-ICA.                  637500      
002580     MOVE NUM-ABONOS-ACUM(2)     TO WS-DET1-NAA.                  638000      
002581     MOVE IMP-ABONOS-ACUM(2)     TO WS-DET1-IAA.                  638500      
002582*    WRITE LINEA FROM WS-CCTL-DET1 BEFORE 1.                      639000      
002583*                                                                 639500      
002584/                                                                 640000      
002585 20025-BUSCA-DIFERENCIA.                                          640500      
002586     MOVE 0                      TO HAY-DIF-WS.                   641000      
002587* OBTENCION DEL VALOR ABSOLUTO DEL ACUMULADOR PARA LA COMPARACION.641500      
002588     IF NUM-CARGOS-ACUM(1) < 0                                    642000      
002589        COMPUTE NUM-CARGOS-ACUM(1) = NUM-CARGOS-ACUM(1) * -1.     642500      
002590     IF IMP-CARGOS-ACUM(1) < 0                                    643000      
002591        COMPUTE IMP-CARGOS-ACUM(1) = IMP-CARGOS-ACUM(1) * -1.     643500      
002592     IF NUM-ABONOS-ACUM(1) < 0                                    644000      
002593        COMPUTE NUM-ABONOS-ACUM(1) = NUM-ABONOS-ACUM(1) * -1.     644500      
002594     IF IMP-ABONOS-ACUM(1) < 0                                    645000      
002595        COMPUTE IMP-ABONOS-ACUM(1) = IMP-ABONOS-ACUM(1) * -1.     645500      
002596     IF NUM-CARGOS-ACUM(2) < 0                                    646000      
002597        COMPUTE NUM-CARGOS-ACUM(2) = NUM-CARGOS-ACUM(2) * -1.     646500      
002598     IF IMP-CARGOS-ACUM(2) < 0                                    647000      
002599        COMPUTE IMP-CARGOS-ACUM(2) = IMP-CARGOS-ACUM(2) * -1.     647500      
002600     IF NUM-ABONOS-ACUM(2) < 0                                    648000      
002601        COMPUTE NUM-ABONOS-ACUM(2) = NUM-ABONOS-ACUM(2) * -1.     648500      
002602     IF IMP-ABONOS-ACUM(2) < 0                                    649000      
002603        COMPUTE IMP-ABONOS-ACUM(2) = IMP-ABONOS-ACUM(2) * -1.     649500      
002604*                                                                 650000      
002605     IF HAY-TRAILER                                               650500      
002606        IF   NUM-CARGOS-ACUM(1) NOT =  WS-IT-NCO                  651000      
002607          OR IMP-CARGOS-ACUM(1) NOT =  WS-IT-ICO                  651500      
002608          OR NUM-ABONOS-ACUM(1) NOT =  WS-IT-NAO                  652000      
002609          OR IMP-ABONOS-ACUM(1) NOT =  WS-IT-IAO                  652500      
002610          OR NUM-CARGOS-ACUM(2) NOT =  WS-IT-NCA                  653000      
002611          OR IMP-CARGOS-ACUM(2) NOT =  WS-IT-ICA                  653500      
002612          OR NUM-ABONOS-ACUM(2) NOT =  WS-IT-NAA                  654000      
002613          OR IMP-ABONOS-ACUM(2) NOT =  WS-IT-IAA                  654500      
002614             MOVE  1             TO  HAY-DIF-WS.                  655000      
002615/                                                                 655500      
002616     IF HAY-TRAILER                                               656000      
002617        IF HAY-DIF                                                656500      
002618           ADD 1                 TO WS-CONT-DIF                   657000      
002619*ASM       DISPLAY "010201 02  " WS-PROGRAMA,                     657100      
002620*ASM               NOMBRE-LOGCSI                                  657500      
002621*ASM               " DIFIERE EN SUS TOTALES"                      658000      
002622*ASM               " CON SU REGISTRO TRAILER"                     658500      
002623           MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ  658550      
002624           MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ   658600      
002625           MOVE 010201                 TO CODIGO-LJ               658650      
002626           MOVE "DIFERENCIA DE TOTALES EN TRAILER"                658700      
002627                                       TO WLI-TEXTO-LJ, TEXTO-LJ  658750      
002628           PERFORM      000-030-IMPRIME-MENSAJE                   658800      
002629           MOVE WS-IT-NCO        TO WS-DET5-NCO                   659000      
002630           MOVE WS-IT-ICO        TO WS-DET5-ICO                   659500      
002631           MOVE WS-IT-NAO        TO WS-DET5-NAO                   660000      
002632           COMPUTE IMPORTE-NEGATI = WS-IT-IAO * -1                660500      
002633           MOVE IMPORTE-NEGATI   TO WS-DET5-IAO                   661000      
002634           MOVE WS-IT-NCA        TO WS-DET5-NCA                   661500      
002635           COMPUTE IMPORTE-NEGATI = WS-IT-ICA * -1                662000      
002636           MOVE IMPORTE-NEGATI   TO WS-DET5-ICA                   662500      
002637           MOVE WS-IT-NAA        TO WS-DET5-NAA                   663000      
002638           MOVE WS-IT-IAA        TO WS-DET5-IAA                   663500      
002639*          WRITE LINEA FROM WS-CCTL-DET5 BEFORE 1                 664000      
002640           SET MYSELF (STATUS)   TO -1                            664010      
002641        ELSE                                                      664500      
002642*ASM       WRITE LINEA FROM WS-CCTL-DET6 BEFORE 1                 665000      
002643           NEXT SENTENCE                                          665100      
002644     ELSE                                                         665500      
002645*ASM   DISPLAY "010201 02  " WS-PROGRAMA,                         665600      
002646*ASM           NOMBRE-LOGCSI                                      666000      
002647*ASM           " INCOMPLETO, SIN REGISTRO TRAILER"                666500      
002648       MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ      666550      
002649       MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ       666600      
002650       MOVE 010201                 TO CODIGO-LJ                   666650      
002651       MOVE "LOGCSI INCOMPLETO, SIN REG TRAILER"                  666700      
002652                                   TO WLI-TEXTO-LJ, TEXTO-LJ      666750      
002653       PERFORM      000-030-IMPRIME-MENSAJE                       666800      
002654       MOVE ZEROS                TO WS-DET5-NCO                   667000      
002655       MOVE ZEROS                TO WS-DET5-ICO                   667500      
002656       MOVE ZEROS                TO WS-DET5-NAO                   668000      
002657       MOVE ZEROS                TO WS-DET5-IAO                   668500      
002658       MOVE ZEROS                TO WS-DET5-NCA                   669000      
002659       MOVE ZEROS                TO WS-DET5-ICA                   669500      
002660       MOVE ZEROS                TO WS-DET5-NAA                   670000      
002661       MOVE ZEROS                TO WS-DET5-IAA                   670500      
002662*      WRITE LINEA FROM WS-CCTL-DET5 BEFORE 1                     671000      
002663       SET MYSELF (STATUS)       TO -1.                           671010      
002664*    WRITE LINEA FROM WS-CCTL-DET6   BEFORE 1.                    671500      
002665/                                                                 672000      
002666 20026-IMPRIME-ELIMINACION.                                       672500      
002667     IF WS-CONT-R2-LIN > 60                                       673000      
002668       PERFORM 20027-ENCABEZADO-ELIMINA.                          673500      
002669     MOVE 1                       TO SI-ELIMINA-WS.               674000      
002670     MOVE WS-RDI-APL-ORI          TO APL-ORI-WS.                  674500      
002671     IF APL-ORI-LOGCCR                                            675000      
002672        MOVE DESCR-SIST-CORTA(SIS-WS)                             675500      
002673                                  TO WS-SISTEMA-CR                676000      
002674     ELSE                                                         676500      
002675        MOVE SPACES               TO WS-SISTEMA-CR                677000      
002676        MOVE APL-ORI-WS           TO WS-SIS-CR.                   677500      
002677     MOVE WS-SISTEMA-CR           TO R2D1-APL-ORI.                678000      
002678     MOVE WS-RDI-APL-DES          TO APL-ORI-WS.                  678500      
002679     IF APL-ORI-LOGCCR                                            679000      
002680        MOVE DESCR-SIST-CORTA(SIS-WS)                             679500      
002681                                  TO WS-SISTEMA-CR                680000      
002682     ELSE                                                         680500      
002683        MOVE SPACES               TO WS-SISTEMA-CR                681000      
002684        MOVE APL-ORI-WS           TO WS-SIS-CR.                   681500      
002685     MOVE WS-SISTEMA-CR           TO R2D1-APL-DES.                682000      
002686     IF RDI-CSI-ORI-VAL                                           682500      
002687        MOVE ABR-CSI-TC(WS-RDI-CSI-ORI)                           683000      
002688                                  TO R2D1-CSI-ORI                 683500      
002689     ELSE                                                         684000      
002690        MOVE WS-RDI-CSI-ORI       TO R2D1-CSI-ORI.                684500      
002691     IF RDI-CSI-DES-VAL                                           685000      
002692        MOVE ABR-CSI-TC(WS-RDI-CSI-DES)                           685500      
002693                                  TO R2D1-CSI-DES                 686000      
002694     ELSE                                                         686500      
002695        MOVE WS-RDI-CSI-DES       TO R2D1-CSI-DES.                687000      
002696     MOVE WS-RDI-NOM-EST          TO R2D1-STA-NAME.               687500      
002697     MOVE WS-RDI-CTA-DES          TO WS-PARTE-CTADES.             688000      
002698     MOVE WS-PARTE-SUC            TO WS-SUC-CTADES.               688500      
002699     MOVE WS-PARTE-CTA            TO WS-CTA-CTADES.               689000      
002700     MOVE WS-EDIT-CTADES          TO R2D1-CTA-DES.                689500      
002701     MOVE WS-RDI-IMP-TRN          TO IMPORTE-ENTERO.              690000      
002702     IF   RDI-COD-SER-CARGO      OR RDI-COD-SER-ABONO             690500      
002703     OR   RDI-COD-SER-ELIMCARGO  OR RDI-COD-SER-ELIMABONO         691000      
002704        MOVE TAB-DNC(WS-RDI-COD-SER)                              691500      
002705                                  TO R2D1-TIPO-MOV                692000      
002706     ELSE                                                         692500      
002707        MOVE WS-RDI-COD-SER       TO R2D1-TIPO-MOV.               693000      
002708     MOVE IMPORTE-ENTERO          TO R2D1-IMPORTE.                693500      
002709     MOVE WS-RDI-STA-TRN          TO R2D1-STATUS.                 694000      
002710     MOVE WS-RDI-CVE-AUT          TO R2D1-N-AUTOR.                694500      
002711     MOVE WS-RDI-MON-TRN          TO R2D1-MONEDA.                 695000      
002712     MOVE WS-RDI-FEC-CON          TO R2D1-FEC-CON.                695500      
002713     MOVE WS-RDI-HOR-GEN-HH       TO R2D1-HORA-HH.                696000      
002714     MOVE WS-RDI-HOR-GEN-MM       TO R2D1-HORA-MM.                696100      
002715     MOVE WS-RDI-FEC-GEN          TO R2D2-FEC-GEN.                696500      
002716     MOVE WS-RDI-CTA-ACC          TO R2D2-CTA-ACC.                697000      
002717     MOVE WS-RDI-REF-OPE          TO R2D2-REF-OPE.                697500      
002718     MOVE WS-RDI-SUB-SER          TO R2D2-SUB-SER.                698000      
002719*    WRITE LREP2                FROM REP2-DET1 BEFORE 1.          698500      
002720*    WRITE LREP2 FROM REP2-DET2   BEFORE 2.                       699000      
002721     ADD 3                        TO WS-CONT-R2-LIN.              699500      
002722/                                                                 700000      
002723 20027-ENCABEZADO-ELIMINA.                                        700500      
002724     PERFORM 200271-ENCABELIM-PARTE1.                             701000      
002725     PERFORM 200272-ENCABELIM-PARTE2.                             701500      
002726*                                                                 702000      
002727 200271-ENCABELIM-PARTE1.                                         702500      
002728     MOVE ZEROS                      TO WS-CONT-R2-LIN.           703000      
002729     ADD  1                          TO NUM-HOJA-WS.              703500      
002730     MOVE NUM-HOJA-WS                TO TIT-ELIM1-PAGE.           704000      
002731     MOVE SPACES                     TO TIT-ELIM5-NOM.            704500      
002732     IF PTER-CSIOKOR                                              705000      
002733        MOVE NOM-CSI-TC(PTER-CSI-WS) TO TIT-ELIM5-NOM.            705500      
002734*    WRITE LREP2 FROM WS-CCTL-DET6   BEFORE PAGE.                 706000      
002735*    WRITE LREP2 FROM TIT-ELIM1      BEFORE 1.                    706500      
002736*    WRITE LREP2 FROM TIT-ELIM2      BEFORE 1.                    707000      
002737*    WRITE LREP2 FROM TIT-ELIM3      BEFORE 1.                    707500      
002738*    WRITE LREP2 FROM TIT-ELIM4      BEFORE 2.                    708000      
002739*    WRITE LREP2 FROM TIT-ELIM5      BEFORE 2.                    708500      
002740     ADD 8                           TO WS-CONT-R2-LIN.           709000      
002741*                                                                 709500      
002742 200272-ENCABELIM-PARTE2.                                         710000      
002743*    WRITE LREP2 FROM REP2-SUB1      BEFORE 1.                    710500      
002744*    WRITE LREP2 FROM REP2-SUB2      BEFORE 1.                    711000      
002745*    WRITE LREP2 FROM REP2-SUB3      BEFORE 2.                    711500      
002746     ADD  3                          TO WS-CONT-R2-LIN.           712000      
002747*                                                                 712500      
002748 20028-TOTALES-CSI-ELIM.                                          713000      
002749*                                                                 713500      
002750     MOVE SPACES                     TO REP2-SUB4-CSI.            714000      
002751     MOVE ">>> TOTALES DEL C.S.I."   TO REP2-SUB4-LEY.            714500      
002752     IF PTER-CSIOKOR                                              715000      
002753        MOVE ABR-CSI-TC(PTER-CSI-WS) TO REP2-SUB4-CSI.            715500      
002754     IF WS-CONT-R2-LIN > 60                                       716000      
002755        PERFORM 200271-ENCABELIM-PARTE1.                          716500      
002756*    WRITE LREP2 FROM REP2-SUB4          BEFORE 3.                717000      
002757*    WRITE LREP2 FROM REP2-SUB5          BEFORE 1.                717500      
002758     PERFORM 200281-POR-STATUS VARYING WS-AP-OPER-APL             718000      
002759                FROM 1 BY 1      UNTIL WS-AP-OPER-APL > 3.        718500      
002760*                                                                 719000      
002761 200281-POR-STATUS.                                               719500      
002762     COMPUTE IMPORTE-ENTERO = NUM-CARGOS-AELIM(WS-AP-OPER-APL)    720000      
002763     MOVE NUM-CARGOS-AELIM(WS-AP-OPER-APL) TO R2D3-NC.            720500      
002764     MOVE IMP-CARGOS-AELIM(WS-AP-OPER-APL) TO R2D3-IC.            721000      
002765     MOVE NUM-ABONOS-AELIM(WS-AP-OPER-APL) TO R2D3-NA.            721500      
002766     MOVE IMP-ABONOS-AELIM(WS-AP-OPER-APL) TO R2D3-IA.            722000      
002767     MOVE NUM-CARABO-AELIM(WS-AP-OPER-APL) TO R2D3-NCA.           722500      
002768     MOVE IMP-CARABO-AELIM(WS-AP-OPER-APL) TO R2D3-ICA.           723000      
002769     MOVE WS-R2D3-LEY      (WS-AP-OPER-APL) TO R2D3-LEY.          723500      
002770*    WRITE LREP2 FROM REP2-DET3 BEFORE 1.                         724000      
002771     ADD 1                        TO WS-CONT-R2-LIN.              724500      
002772*                                                                 725000      
002773 20029-TOTAL-GRAL-ELIM.                                           725500      
002774*                                                                 726000      
002775     MOVE "TOTAL GRAL ELIMINADOS " TO REP2-SUB4-LEY.              726500      
002776     MOVE SPACES                   TO REP2-SUB4-CSI.              727000      
002777     PERFORM 200271-ENCABELIM-PARTE1.                             727500      
002778*      WRITE LREP2 FROM REP2-SUB4          BEFORE 3.              728000      
002779*    WRITE LREP2 FROM REP2-SUB5          BEFORE 1.                728500      
002780     ADD 4                        TO WS-CONT-R2-LIN.              729000      
002781     PERFORM 200291-POR-STATUS VARYING WS-AP-OPER-APL             729500      
002782                FROM 1 BY 1      UNTIL WS-AP-OPER-APL > 3.        730000      
002783*                                                                 730500      
002784 200291-POR-STATUS.                                               731000      
002785     MOVE NUM-CARGOS-TELIM(WS-AP-OPER-APL) TO R2D3-NC.            731500      
002786     MOVE IMP-CARGOS-TELIM(WS-AP-OPER-APL) TO R2D3-IC.            732000      
002787     MOVE NUM-ABONOS-TELIM(WS-AP-OPER-APL) TO R2D3-NA.            732500      
002788     MOVE IMP-ABONOS-TELIM(WS-AP-OPER-APL) TO R2D3-IA.            733000      
002789     MOVE NUM-CARABO-TELIM(WS-AP-OPER-APL) TO R2D3-NCA.           733500      
002790     MOVE IMP-CARABO-TELIM(WS-AP-OPER-APL) TO R2D3-ICA.           734000      
002791     MOVE WS-R2D3-LEY      (WS-AP-OPER-APL) TO R2D3-LEY.          734500      
002792*    WRITE LREP2 FROM REP2-DET3 BEFORE 1.                         735000      
002793     ADD 1                        TO WS-CONT-R2-LIN.              735500      
002794*                                                                 736000      
002795 2005-IMPRIME-TITULOS.                                            736500      
002796     MOVE 0                          TO NUM-HOJA-WS.              737000      
002797     MOVE 1                          TO WS-ENC2-PAG.              737500      
002798*    WRITE LINEA FROM WS-CCTL-DET6   BEFORE PAGE.                 738000      
002799*    WRITE LINEA FROM WS-CCTL-ENC1   BEFORE 1.                    738500      
002800*    WRITE LINEA FROM WS-CCTL-ENC2   BEFORE 1.                    739000      
002801*    WRITE LINEA FROM WS-CCTL-ENC3   BEFORE 2.                    739500      
002802*    WRITE LINEA FROM WS-CCTL-ENC4   BEFORE 2.                    740000      
002803*    WRITE LINEA FROM WS-CCTL-ENC5   BEFORE 1.                    740500      
002804*    WRITE LINEA FROM WS-CCTL-ENC6   BEFORE 2.                    741000      
002805/                                                                 741500      
002806*                                                                 742000      
002807 2006-IMPRIME-TOTALES.                                            742500      
002808     MOVE SPACES TO WS-CCTL-DET3  WS-CCTL-DET4.                   743000      
002809     MOVE NUM-CARGOS-TOT(1) TO WS-DET2-NCO.                       743500      
002810     MOVE IMP-CARGOS-TOT(1) TO WS-DET2-ICO.                       744000      
002811     MOVE NUM-ABONOS-TOT(1) TO WS-DET2-NAO.                       744500      
002812     COMPUTE IMPORTE-NEGATI = IMP-ABONOS-TOT(1) * -1.             745000      
002813     MOVE IMPORTE-NEGATI    TO WS-DET2-IAO.                       745500      
002814     MOVE NUM-CARGOS-TOT(2) TO WS-DET2-NCA.                       746000      
002815     COMPUTE IMPORTE-NEGATI = IMP-CARGOS-TOT(2) * -1.             746500      
002816     MOVE IMPORTE-NEGATI    TO WS-DET2-ICA.                       747000      
002817     MOVE NUM-ABONOS-TOT(2) TO WS-DET2-NAA.                       747500      
002818     MOVE IMP-ABONOS-TOT(2) TO WS-DET2-IAA.                       748000      
002819*    WRITE LINEA FROM WS-CCTL-DET2 BEFORE 2.                      748500      
002820*                                                                 749000      
002821     COMPUTE SALDO-CALCULADO-WS = IMP-CARGOS-TOT(1)               749500      
002822                                - IMP-ABONOS-TOT(1).              750000      
002823     IF SALDO-CALCULADO-WS < 0                                    750500      
002824        MOVE SALDO-CALCULADO-WS TO WS-DET3-TAO                    751000      
002825     ELSE                                                         751500      
002826        MOVE SALDO-CALCULADO-WS TO WS-DET3-TCO.                   752000      
002827*                                                                 752500      
002828     COMPUTE SALDO-CALCULADO-WS = IMP-ABONOS-TOT(2)               753000      
002829                                - IMP-CARGOS-TOT(2).              753500      
002830     IF SALDO-CALCULADO-WS < 0                                    754000      
002831        MOVE SALDO-CALCULADO-WS TO WS-DET3-TCA                    754500      
002832     ELSE                                                         755000      
002833        MOVE SALDO-CALCULADO-WS TO WS-DET3-TAA.                   755500      
002834*    WRITE LINEA FROM WS-CCTL-DET3 BEFORE 2.                      756000      
002835*                                                                 756500      
002836     COMPUTE SALDO-CALCULADO-WS =                                 757000      
002837              IMP-CARGOS-TOT(1) - IMP-ABONOS-TOT(1) -             757500      
002838              IMP-CARGOS-TOT(2) + IMP-ABONOS-TOT(2).              758000      
002839     IF SALDO-CALCULADO-WS < 0                                    758500      
002840        MOVE SALDO-CALCULADO-WS TO WS-DET4-TCL                    759000      
002841     ELSE                                                         759500      
002842        MOVE SALDO-CALCULADO-WS TO WS-DET4-TAL.                   760000      
002843*    WRITE LINEA FROM WS-CCTL-DET4 BEFORE 2.                      760500      
002844     MOVE ZERO                    TO FIN-LOG-CSI-WS.              761000      
002845/                                                                 761500      
002846****************************************************************  762000      
002847 2010-PROCESA-CSI.                                                762500      
002848     MOVE ZEROS                   TO FIN-LOG-CSI-WS.              763000      
002849     MOVE ZEROS                   TO ARCHIVO-EXISTE-WS.           763500      
002850     MOVE PTER-CSI-WS             TO CSIS-INVALIDOS-WS.           764000      
002851     IF CSIS-INVALIDOS                                            764500      
002852        NEXT SENTENCE                                             765000      
002853     ELSE                                                         765500      
002854        MOVE ABR-CSI-TC(PTER-CSI-WS)  TO NL-CSI-ORI               766000      
002855        MOVE WS-FECHA-AMD             TO NL-CSI-FEC FECHA-NLG     766500      
002856*ASM    CHANGE ATTRIBUTE TITLE OF LOG-CSI TO NOMBRE-LOGCSI        767000      
002857*ASM    IF ATTRIBUTE RESIDENT  OF LOG-CSI EQUAL TO VALUE TRUE     767500      
002858*ASM       MOVE 1                     TO ARCHIVO-EXISTE-WS        768000      
002859           OPEN INPUT LOG-CSI                                     768500      
002860           MOVE ATTRIBUTE LASTRECORD  OF LOG-CSI                  769000      
002861                                      TO WS-ULTREG-LOG-SORT2      769500      
002862           COMPUTE WS-DISK-SIZE =                                 770000      
002863          ( WS-REGSIZE-LOG-SORT2 * WS-ULTREG-LOG-SORT2 * 3.5 ).   770500      
002864*                                                                 771000      
002865    MOVE PTER-CSI-WS              TO CSIS-INVALIDOS-WS.           771500      
002866    IF CSIS-INVALIDOS                                             772000      
002867        NEXT SENTENCE                                             772500      
002868     ELSE                                                         773000      
002869*ASM IF ARCHIVO-EXISTE                                            773500      
002870*          DISPLAY "S151/100: " NOMBRE-LOGCSI" INTEGRANDOSE"      774000      
002871           MOVE 1                 TO HUBO-TRANSACCIONES-WS        774500      
002872           SORT SORT1-RESUMEN ON ASCENDING KEY RS1-LLAVE          775000      
002873                INPUT  PROCEDURE IS 4000-ORDENA-LOG               775500      
002874                OUTPUT PROCEDURE IS 5000-RETORNA-LOG              776000      
002875                       MEMORY SIZE WS-MEM-SIZE  WORDS             776500      
002876                       DISK   SIZE WS-DISK-SIZE WORDS             777000      
002877           CLOSE LOG-CSI   WITH SAVE.                             777500      
002878*          DISPLAY "S151/100: " NOMBRE-LOGCSI " - INTEGRADO".     778000      
002879*                                                                 778500      
002880****************************************************************  779000      
002881/                                                                 779500      
002882****************************************************************  780000      
002883 3000-PROCESA-LOG-GRAL.                                           780500      
002884*                                                                 781000      
002885     OPEN INPUT LOG-GRAL.                                         781500      
002886     MOVE ATTRIBUTE LASTRECORD OF LOG-GRAL TO WS-ULTREG-LOG-SORT1.782000      
002887     COMPUTE WS-MEM-SIZE =                                        782500      
002888           ( WS-REGSIZE-LOG-SORT1 + WS-CT1-MSIZE ) * WS-CT2-MSIZE 783000      
002889                                                 + WS-CT3-MSIZE.  783500      
002890     COMPUTE WS-DISK-SIZE =                                       784000      
002891           ( WS-REGSIZE-LOG-SORT1 * WS-ULTREG-LOG-SORT1 * 3.5 ).  784500      
002892     CLOSE LOG-GRAL WITH SAVE.                                    785000      
002893*                                                                 785500      
002894      SORT SORT2-DETECTA ON ASCENDING KEY RS2-LLAVE               786000      
002895          INPUT  PROCEDURE IS 6000-ENVIA-A-SORT                   786500      
002896          OUTPUT PROCEDURE IS 7000-LOG-GRAL                       787000      
002897                 MEMORY SIZE WS-MEM-SIZE  WORDS                   787500      
002898                 DISK   SIZE WS-DISK-SIZE WORDS.                  788000      
002899*                                                                 788500      
002900****************************************************************  789000      
002901 4000-TERMINA-PROCESO.                                            789500      
002902*ASM CLOSE GUARDIAN WITH LOCK.                                    790000      
002903*ASM DISPLAY "020201 01  " WS-PROGRAMA,                           790100      
002904*ASM         " FIN NORMAL DEL PROCESO".                           790500      
002905     MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ        790550      
002906     MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ         790600      
002907     MOVE 020201                 TO CODIGO-LJ                     790650      
002908     MOVE "FIN NORMAL DEL PROCESO"                                790700      
002909                                 TO WLI-TEXTO-LJ, TEXTO-LJ        790750      
002910     PERFORM      000-030-IMPRIME-MENSAJE.                        790800      
002911*                                                                 791000      
002912/***************************************************************  791500      
002913 4000-ORDENA-LOG                 SECTION.                         792000      
002914 4000-ORDENA.                                                     792500      
002915*========================================                         793000      
002916     MOVE ZEROS                   TO FIN-LOG-CSI-WS.              793500      
002917     MOVE ZEROS                   TO WS-APL-ORI-ANT.              794000      
002918     PERFORM 4050-LEE-LOG-CSI     2 TIMES.                        794500      
002919     PERFORM 4020-BUSCA-SIST.                                     795000      
002920     PERFORM 4010-CLASIFICA-LOG   UNTIL FIN-LOG-CSI.              795500      
002921     GO  TO  4090-EXIT-SECTION.                                   796000      
002922*                                                                 796500      
002923*===================                                              797000      
002924 4010-CLASIFICA-LOG.                                              797500      
002925*===================                                              798000      
002926     IF WS-RDI-APL-ORI NOT = WS-APL-ORI-ANT                       798500      
002927        PERFORM 4020-BUSCA-SIST.                                  799000      
002928*                                                                 799500      
002929*ASM IF ENCONTRE-GUARDIAN                                         800000      
002930        IF WS-RDI-CSI-ORI NOT = WS-RDI-CSI-DES                    800500      
002931           IF ( RDI-STA-TRN-OPERADO OR RDI-STA-TRN-APLICADO ) AND 801000      
002932              ( RDI-COD-SER-VAL )                                 801500      
002933              PERFORM 4030-MUEVE-A-SORT                           802000      
002934              PERFORM 4040-MUEVE-A-LOGGRAL.                       802500      
002935     PERFORM 4050-LEE-LOG-CSI.                                    803000      
002936*                                                                 803500      
002937*================                                                 804000      
002938 4020-BUSCA-SIST.                                                 804500      
002939*================                                                 805000      
002940     MOVE WS-RDI-APL-ORI          TO WS-APL-ORI-ANT.              805500      
002941*ASM MOVE ZEROS                   TO WS-ENCONTRE-GUARDIAN.        806000      
002942*ASM  READ GUARDIAN             INTO WS-REG-GUARDIAN              806500      
002943*ASM       INVALID KEY                                            807000      
002944*ASM       MOVE 1                 TO WS-ENCONTRE-GUARDIAN.        807500      
002945*                                                                 808000      
002946*==================                                               808500      
002947 4030-MUEVE-A-SORT.                                               809000      
002948*==================                                               809500      
002949     MOVE SPACES                  TO REG-SORT1.                   810000      
002950     MOVE WS-RDI-FEC-CON          TO WS-RS1-FECHA.                810500      
002951     MOVE WS-RDI-CSI-ORI          TO WS-RS1-CSI-ORI.              811000      
002952     MOVE WS-RDI-MON-TRN          TO WS-RS1-CVE-MON.              811500      
002953     MOVE WS-RDI-APL-ORI          TO WS-RS1-APL-ORI.              812000      
002954     MOVE WS-RDI-CSI-DES          TO WS-RS1-CSI-DES.              812500      
002955     MOVE WS-REG-DET-INFOICA      TO WS-RS1-RESTO.                813000      
002956     RELEASE REG-SORT1          FROM WS-REG-SORT1.                813500      
002957*                                                                 814000      
002958/====================                                             814500      
002959 4040-MUEVE-A-LOGGRAL.                                            815000      
002960*====================                                             815500      
002961*                                                                 816000      
002962     WRITE REG-LOG-GRAL         FROM WS-REG-DET-INFOICA           816500      
002963      INVALID KEY                                                 817000      
002964*ASM          DISPLAY "010105 01  " WS-PROGRAMA,                  817100      
002965*ASM                  " ESP INSUF PARA LOG GRAL(1) "              817500      
002966              MOVE SPACES              TO WLI-TEXTO-LJ, TEXTO-LJ  817550      
002967              MOVE "I"                 TO WLI-TIPO-LJ,  TIPO-LJ   817600      
002968              MOVE 010105              TO CODIGO-LJ               817650      
002969              MOVE "ESPACIO INSUF. PARA LOG GRAL(1)"              817700      
002970                                       TO WLI-TEXTO-LJ, TEXTO-LJ  817750      
002971              PERFORM      000-030-IMPRIME-MENSAJE                817800      
002972              SET MYSELF(STATUS)  TO -1.                          818000      
002973*                                                                 818500      
002974*=================                                                819000      
002975 4050-LEE-LOG-CSI.                                                819500      
002976*=================                                                820000      
002977     READ LOG-CSI               INTO WS-REG-LOG                   820500      
002978       AT END                                                     821000      
002979          MOVE 1                  TO FIN-LOG-CSI-WS.              821500      
002980*                                                                 822000      
002981     IF WS-REG-LOG                = LOW-VALUES OR HIGH-VALUES     822500      
002982        MOVE  1                   TO FIN-LOG-CSI-WS.              823000      
002983     IF WS-RLT-IDENT              = "TRAILER"                     823500      
002984        MOVE 1                    TO FIN-LOG-CSI-WS.              824000      
002985     IF NOT FIN-LOG-CSI                                           824500      
002986        MOVE WS-REG-LOG           TO WS-REG-DET-INFOICA.          825000      
002987*                                                                 825100      
002988     IF NOT FIN-LOG-CSI                                           825110      
002989        IF WS-RDI-CSI-ORI = 09                                    825120      
002990           MOVE 10                TO WS-RDI-CSI-ORI               825130      
002991        ELSE                                                      825132      
002992        IF WS-RDI-CSI-ORI = 07                                    825134      
002993           MOVE 04                TO WS-RDI-CSI-ORI               825136      
002994        ELSE                                                      825140      
002995        IF WS-RDI-CSI-ORI = 01                                    825143      
002996           MOVE 04                TO WS-RDI-CSI-ORI               825146      
002997        ELSE                                                      825150      
002998        IF WS-RDI-CSI-ORI = 06                                    825152      
002999           MOVE 04                TO WS-RDI-CSI-ORI.              825154      
003000*                                                                 825340      
003001     IF NOT FIN-LOG-CSI                                           825350      
003002        IF WS-RDI-CSI-DES = 09                                    825360      
003003           MOVE 10                TO WS-RDI-CSI-DES               825370      
003004        ELSE                                                      825372      
003005        IF WS-RDI-CSI-DES = 07                                    825374      
003006           MOVE 04                TO WS-RDI-CSI-DES               825376      
003007        ELSE                                                      825378      
003008        IF WS-RDI-CSI-DES = 01                                    825381      
003009           MOVE 04                TO WS-RDI-CSI-DES               825384      
003010        ELSE                                                      825390      
003011        IF WS-RDI-CSI-DES = 06                                    825392      
003012           MOVE 04                TO WS-RDI-CSI-DES.              825394      
003013*                                                                 825500      
003014*========================                                         826000      
003015 4090-EXIT-SECTION. EXIT.                                         826500      
003016*========================                                         827000      
003017/                                                                 827500      
003018****************************************************************  828000      
003019 5000-RETORNA-LOG                SECTION.                         828500      
003020 5000-RETORNA-LOGS.                                               829000      
003021*                                                                 829500      
003022     MOVE ZEROS                   TO WS-FIN-LOG-SORT1.            830000      
003023     PERFORM 5030-LEE-SORT1.                                      830500      
003024     MOVE WS-RS1-LLAVE            TO WS-RS1-LLAVE-ANT.            831000      
003025     MOVE WS-FIN-LOG-SORT1        TO IND-VACIO.                   831500      
003026     PERFORM 5070-ACTUALIZA-REG-CTL-CSI.                          832000      
003027     PERFORM 5010-PROCESA-SORT1   UNTIL FIN-LOG-SORT1.            832500      
003028     GO TO   5100-EXIT-SECTION.                                   833000      
003029*                                                                 833500      
003030*====================                                             834000      
003031 5010-PROCESA-SORT1.                                              834500      
003032*====================                                             835000      
003033     MOVE ZEROS                   TO LLAVE-COMP                   835500      
003034     MOVE WS-RS1-LLAVE            TO WS-RS1-LLAVE-ANT.            836000      
003035     MOVE LOW-VALUES              TO CIFRAS-COMP.                 836500      
003036     PERFORM 5020-SUMARIZA UNTIL FIN-LOG-SORT1                    837000      
003037             OR  WS-RS1-LLAVE NOT = WS-RS1-LLAVE-ANT.             837500      
003038*                                                                 838000      
003039     PERFORM 5050-ACTUALIZA-COMP-NAL.                             838500      
003040*                                                                 839000      
003041*===============                                                  839500      
003042 5020-SUMARIZA.                                                   840000      
003043*===============                                                  840500      
003044     IF RDI-STA-TRN-APLICADO                                      841000      
003045        MOVE 2                    TO WS-AP-OPER-APL               841500      
003046        PERFORM 5040-SUMA-CARGO-ABONO                             842000      
003047     ELSE                                                         842500      
003048     IF RDI-STA-TRN-OPERADO                                       843000      
003049        MOVE 1                    TO WS-AP-OPER-APL               843500      
003050        PERFORM 5040-SUMA-CARGO-ABONO.                            844000      
003051*                                                                 844500      
003052      PERFORM 5030-LEE-SORT1.                                     845000      
003053*                                                                 845500      
003054*================                                                 846000      
003055 5030-LEE-SORT1.                                                  846500      
003056*================                                                 847000      
003057     RETURN SORT1-RESUMEN       INTO WS-REG-SORT1                 847500      
003058      AT END                                                      848000      
003059         MOVE  1                  TO WS-FIN-LOG-SORT1.            848500      
003060*                                                                 849000      
003061     IF NOT FIN-LOG-SORT1                                         849500      
003062        MOVE WS-RS1-RESTO         TO WS-REG-DET-INFOICA.          850000      
003063*                                                                 850500      
003064/=======================                                          851000      
003065 5040-SUMA-CARGO-ABONO.                                           851500      
003066*=======================                                          852000      
003067     IF RDI-COD-SER-CARGO                                         852500      
003068        ADD 1             TO NUM-CARGOS-COMP(WS-AP-OPER-APL)      853000      
003069                             NUM-CARGOS-TOT (WS-AP-OPER-APL)      853500      
003070        ADD WS-RDI-IMP-TRN                                        854000      
003071                          TO IMP-CARGOS-COMP(WS-AP-OPER-APL)      854500      
003072                             IMP-CARGOS-TOT (WS-AP-OPER-APL)      855000      
003073     ELSE                                                         855500      
003074     IF RDI-COD-SER-ABONO                                         856000      
003075        ADD 1             TO NUM-ABONOS-COMP(WS-AP-OPER-APL)      856500      
003076                             NUM-ABONOS-TOT (WS-AP-OPER-APL)      857000      
003077        ADD WS-RDI-IMP-TRN                                        857500      
003078                          TO IMP-ABONOS-COMP(WS-AP-OPER-APL)      858000      
003079                             IMP-ABONOS-TOT (WS-AP-OPER-APL)      858500      
003080     ELSE                                                         859000      
003081     IF RDI-COD-SER-ELIMCARGO                                     859500      
003082        SUBTRACT 1      FROM NUM-CARGOS-COMP(WS-AP-OPER-APL)      860000      
003083                             NUM-CARGOS-TOT (WS-AP-OPER-APL)      860500      
003084        SUBTRACT WS-RDI-IMP-TRN                                   861000      
003085                        FROM IMP-CARGOS-COMP(WS-AP-OPER-APL)      861500      
003086                             IMP-CARGOS-TOT (WS-AP-OPER-APL)      862000      
003087     ELSE                                                         862500      
003088     IF RDI-COD-SER-ELIMABONO                                     863000      
003089        SUBTRACT 1      FROM NUM-ABONOS-COMP(WS-AP-OPER-APL)      863500      
003090                             NUM-ABONOS-TOT (WS-AP-OPER-APL)      864000      
003091        SUBTRACT WS-RDI-IMP-TRN                                   864500      
003092                        FROM IMP-ABONOS-COMP(WS-AP-OPER-APL)      865000      
003093                             IMP-ABONOS-TOT (WS-AP-OPER-APL).     865500      
003094*                                                                 866000      
003095/=========================                                        866500      
003096 5050-ACTUALIZA-COMP-NAL.                                         867000      
003097*=========================                                        867500      
003098*           REGISTRO DETALLE COMPENSACION                         868000      
003099     MOVE ZEROS                   TO LLAVE-COMP.                  868500      
003100     MOVE WS-RS1-FECHA-ANT        TO FECHA-COMP.                  869000      
003101     MOVE WS-RS1-CSI-ORI-ANT      TO CSI-LOCAL-COMP.              869500      
003102     MOVE WS-RS1-CVE-MON-ANT      TO MONEDA-COMP.                 870000      
003103     MOVE WS-RS1-APL-ORI-ANT      TO APL-ORI-COMP.                870500      
003104     MOVE WS-RS1-CSI-DES-ANT      TO CSI-FORANEO-COMP.            871000      
003105     MOVE 0                       TO DUMMY-COMP.                  871500      
003106*                                                                 872000      
003107*----- OBSERVE QUE LAS CIFRAS FUERON SUMADAS EN EL REGISTRO -----*872500      
003108     WRITE REG-COMPENSACION                                       873000      
003109      INVALID KEY                                                 873500      
003110          PERFORM 5080-REESCRIBE-REG-CTL.                         874000      
003111*                                                                 874500      
003112     MOVE LOW-VALUES              TO REG-COMPENSACION.            875000      
003113     MOVE ZEROES                  TO LLAVE-COMP.                  875500      
003114*                                                                 876000      
003115*=======================                                          876500      
003116 5060-LEE-COMPENSACION.                                           877000      
003117*=======================                                          877500      
003118     MOVE 1                       TO EXISTE-REGISTRO-WS.          878000      
003119     READ COMPENSACION                                            878500      
003120      INVALID KEY                                                 879000      
003121              MOVE ZERO           TO EXISTE-REGISTRO-WS.          879500      
003122*                                                                 880000      
003123*============================                                     880500      
003124 5070-ACTUALIZA-REG-CTL-CSI.                                      881000      
003125*============================                                     881500      
003126*          REGISTRO DE CONTROL DEL CSI ORIGEN                     882000      
003127     MOVE LOW-VALUES              TO REG-COMPENSACION.            882500      
003128     MOVE ZEROS                   TO LLAVE-COMP.                  883000      
003129     MOVE WS-RS1-CSI-ORI-ANT      TO CSI-LOCAL-COMP.              883500      
003130     IF IND-VACIO = 1                                             884000      
003131        MOVE PTER-CSI-WS          TO CSI-LOCAL-COMP               884500      
003132        MOVE 1                    TO DUMMY-COMP.                  885000      
003133     PERFORM 5075-ESCRIBE-COMPENSACION.                           885500      
003134*                                                                 886000      
003135*===========================                                      886500      
003136 5075-ESCRIBE-COMPENSACION.                                       887000      
003137*===========================                                      887500      
003138     WRITE REG-COMPENSACION                                       888000      
003139      INVALID KEY                                                 888500      
003140*ASM          DISPLAY "010105 02  " WS-PROGRAMA,                  888600      
003141*ASM                  " ERROR ESCRITURA COMPENSACION "            889000      
003142*ASM                   LLAVE-COMP                                 889500      
003143              MOVE SPACES              TO WLI-TEXTO-LJ, TEXTO-LJ  889550      
003144              MOVE "I"                 TO WLI-TIPO-LJ,  TIPO-LJ   889600      
003145              MOVE 010105              TO CODIGO-LJ               889650      
003146              MOVE "ERROR DE ESCRITURA EN COMPENSACION"           889700      
003147                                       TO WLI-TEXTO-LJ, TEXTO-LJ  889750      
003148              PERFORM      000-030-IMPRIME-MENSAJE                889800      
003149              SET MYSELF(STATUS)  TO -1.                          890000      
003150*                                                                 890500      
003151*=======================                                          891000      
003152 5080-REESCRIBE-REG-CTL.                                          891500      
003153*=======================                                          892000      
003154     REWRITE REG-COMPENSACION                                     892500      
003155      INVALID KEY                                                 893000      
003156*ASM          DISPLAY "010105 02  " WS-PROGRAMA,                  893100      
003157*ASM                   "ERROR REESCRITURA COMPENSACION "          893500      
003158*ASM                  LLAVE-COMP                                  894000      
003159              MOVE SPACES              TO WLI-TEXTO-LJ, TEXTO-LJ  894050      
003160              MOVE "I"                 TO WLI-TIPO-LJ,  TIPO-LJ   894100      
003161              MOVE 010105              TO CODIGO-LJ               894150      
003162              MOVE "ERROR DE REESCRITURA EN COMPENSACION"         894200      
003163                                       TO WLI-TEXTO-LJ, TEXTO-LJ  894250      
003164              PERFORM      000-030-IMPRIME-MENSAJE                894300      
003165              SET MYSELF(STATUS)  TO -1.                          894500      
003166*                                                                 895000      
003167*=========================                                        895500      
003168 5100-EXIT-SECTION.  EXIT.                                        896000      
003169/                                                                 896500      
003170 6000-ENVIA-A-SORT                SECTION.                        897000      
003171 6000-ENVIA.                                                      897500      
003172     OPEN INPUT LOG-GRAL.                                         898000      
003173      MOVE ZEROS                   TO FIN-LOG-GRAL-WS.            898500      
003174     MOVE LOW-VALUES              TO REG-SORT2.                   899000      
003175     PERFORM 6020-LEE-LOG-GRAL.                                   899500      
003176      PERFORM 6010-RELEASE-SORT UNTIL FIN-LOG-GRAL.               900000      
003177     CLOSE LOG-GRAL WITH PURGE.                                   900500      
003178     GO TO 6030-EXIT-SECTION.                                     901000      
003179*                                                                 901500      
003180 6010-RELEASE-SORT.                                               902000      
003181     MOVE LOW-VALUES              TO WS-REG-SORT2.                902500      
003182     MOVE WS-RDI-MON-TRN          TO WS-RS2-CVE-MON.              903000      
003183     IF RDI-STA-TRN-OPERADO                                       903100      
003184        MOVE WS-RDI-APL-ORI       TO WS-RS2-APL-ORI               903500      
003185        MOVE WS-RDI-APL-DES       TO WS-RS2-APL-DES               904000      
003186     ELSE                                                         904100      
003187        MOVE WS-RDI-APL-ORI       TO WS-RS2-APL-DES               904200      
003188        MOVE WS-RDI-APL-DES       TO WS-RS2-APL-ORI.              904300      
003189     MOVE WS-RDI-NOM-EST          TO WS-RS2-STA-NAME.             904500      
003190     MOVE WS-RDI-CVE-AUT          TO WS-RS2-N-AUTOR.              905000      
003191     MOVE WS-RDI-COD-SER          TO WS-RS2-TIPO-MOV.             905500      
003192     MOVE WS-RDI-CTA-DES          TO WS-RS2-ID-CTA.               906000      
003193     MOVE WS-RDI-IMP-TRN          TO WS-RS2-IMP-MOV.              906500      
003194     MOVE WS-RDI-STA-TRN          TO WS-RS2-STATUS.               907000      
003195     MOVE WS-RDI-HOR-GEN          TO WS-RS2-HORA-GEN.             907500      
003196     MOVE WS-REG-DET-INFOICA      TO WS-RS2-RESTO.                908000      
003197     RELEASE REG-SORT2          FROM WS-REG-SORT2.                908500      
003198     PERFORM 6020-LEE-LOG-GRAL.                                   909000      
003199*                                                                 909500      
003200 6020-LEE-LOG-GRAL.                                               910000      
003201     READ LOG-GRAL              INTO WS-REG-DET-INFOICA           910500      
003202      AT END                                                      911000      
003203           MOVE 1                  TO FIN-LOG-GRAL-WS.            911500      
003204*                                                                 912000      
003205 6030-EXIT-SECTION.                                               912500      
003206     EXIT.                                                        913000      
003207/                                                                 913500      
003208 7000-LOG-GRAL                    SECTION.                        914000      
003209 7000-CREA-LOG.                                                   914500      
003210     MOVE ZEROS                    TO FIN-LOG-GRAL-WS.            915000      
003211     OPEN OUTPUT LOG-GRAL.                                        915500      
003212     PERFORM 7080-LEE-SORT.                                       916000      
003213     PERFORM 7010-GENERA-LOG-GRAL  UNTIL FIN-LOG-GRAL.            916500      
003214     CLOSE LOG-GRAL WITH LOCK.                                    917000      
003215     GO TO 7090-EXIT-SECTION.                                     917500      
003216*                                                                 918000      
003217 7010-GENERA-LOG-GRAL.                                            918500      
003218     PERFORM 7020-GRABA-LOG-GRAL.                                 919000      
003219     PERFORM 7080-LEE-SORT.                                       919500      
003220*                                                                 920000      
003221 7020-GRABA-LOG-GRAL.                                             920500      
003222     WRITE REG-LOG-GRAL         FROM WS-REG-DET-INFOICA           921000      
003223      INVALID KEY                                                 921500      
003224*ASM     DISPLAY "010105 02  " WS-PROGRAMA,                       921600      
003225*ASM             "INSUF. ESPACIO PARA GRABAR LOG GRAL"            922000      
003226         MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ    922050      
003227         MOVE "I"                    TO WLI-TIPO-LJ,  TIPO-LJ     922100      
003228         MOVE 010105                 TO CODIGO-LJ                 922150      
003229         MOVE "ESPACIO INSUF. PARA GRABAR LOG GRAL."              922200      
003230                                     TO WLI-TEXTO-LJ, TEXTO-LJ    922250      
003231         PERFORM      000-030-IMPRIME-MENSAJE                     922300      
003232         SET MYSELF(STATUS) TO -1.                                922500      
003233*                                                                 923000      
003234 7080-LEE-SORT.                                                   923500      
003235     RETURN SORT2-DETECTA       INTO WS-REG-SORT2                 924000      
003236      AT END                                                      924500      
003237         MOVE 1                    TO FIN-LOG-GRAL-WS.            925000      
003238*                                                                 925500      
003239     IF NOT FIN-LOG-GRAL                                          926000      
003240        MOVE WS-RS2-RESTO         TO WS-REG-DET-INFOICA.          926500      
003241*                                                                 927000      
003242 7090-EXIT-SECTION.                                               927500      
003243     EXIT.                                                        928000      
003244*                                                                 928500      
