000001*$SET TARGET=LEVEL2                                               000100      
000002$SET LIST                                                         000200      
000003 IDENTIFICATION DIVISION.                                         000300      
000004 PROGRAM-ID.             LEE-MOVSNNN.                             000400      
000005 AUTHOR.                 JOSE FELIX TORRES FRANCO.                000500      
000006 INSTALLATION.           BANAMEX                                  000600      
000007                         INGENIERIA DE SISTEMAS                   000700      
000008                         CENTRO DE DESARROLLO LEON.               000800      
000009 DATE-WRITTEN.           ENERO DE 1998.                           000900      
000010 DATE-COMPILED.                                                   001000      
000011 SECURITY.               COPYRIGHT 1995 BY THE AUTHOR.            001100      
000012******************************************************************001105      
000013**JNRB 251112 SE LIBERA NUEVA VERSION POR PROCESO DE             *001110      
000014**RECOMPILACION                                                  *001115      
000015*                                                                *001120      
000016*                                                                *001125      
000017*                                                                *001130      
000018*                                                                *001135      
000019*                                                                *001140      
000020*                                                                *001145      
000021*                                                                *001150      
000022*                                                                *001155      
000023*                                                                *001160      
000024*                                                                *001165      
000025*                                                                *001170      
000026******************************************************************001175      
000027 ENVIRONMENT DIVISION.                                            001200      
000028 CONFIGURATION SECTION.                                           001300      
000029 SOURCE-COMPUTER.        A10.                                     001400      
000030 OBJECT-COMPUTER.        A10.                                     001500      
000031 INPUT-OUTPUT SECTION.                                            001600      
000032 FILE-CONTROL.                                                    001700      
000033      SELECT A01-ERRSNNN     ASSIGN TO DISK                       001800      
000034                             ACCESS MODE IS SEQUENTIAL            001900      
000035                             ACTUAL KEY   IS A01-KEY-NUMREG.      002000      
000036 DATA DIVISION.                                                   002100      
000037 FILE SECTION.                                                    002200      
000038*                                                                 002300      
000039 FD A01-ERRSNNN                                                   002400      
000040    VALUE OF                                                      002500      
000041                 SECURITYTYPE IS PUBLIC                           002600      
000042                 TITLE WKS-ETI-S151-MOVANT                        002700      
000043                 DEPENDENTSPECS IS TRUE.                          002800      
000044                                                                  002900      
000045*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000046*    COPY "CITIDIRECT/S151/FORMATO/ARCHIVO/ESCRITURA.".           003000      
000047                                                                  000100      
000048******************************************************************000200      
000049**  FORMATO DE LLAMADO DE MOVIMIENTOS AL S151 PARA TODOS        **000300      
000050**  LOS SISTEMAS:                                               **000400      
000051**  - LONGITUD DEL REGISTRO           990 CARACTERES            **000500      
000052**    - LONGITUD DE DATOS GENERALES   450 CARACTERES            **000600      
000053**    - LONGITUD DE DATOS ADICIONALES 540 CARACTERES            **000700      
000054******************************************************************000800      
000055                                                                  000900      
000056 01  WKS-MOV-DATOS.                                               001000      
000057    03 WKS-MOV-ID-HD                   PIC X(02).                 001020      
000058    03 WKS-MOV-ID-R REDEFINES WKS-MOV-ID-HD.                      001040      
000059        05 WKS-MOV-FUNCION             PIC  9(02)      COMP.      001100      
000060        05 WKS-MOV-FORMATO             PIC  9(02)      COMP.      001200      
000061    03 WKS-MOV-FECHD                   PIC  9(08).                001220      
000062    03 WKS-MOV-FECHD-R REDEFINES WKS-MOV-FECHD.                   001240      
000063       05 WKS-MOV-SISTEMA              PIC  9(04)      COMP.      001300      
000064       05 WKS-MOV-PRODUCTO             PIC  9(04)      COMP.      001500      
000065       05 WKS-MOV-INSTRUMENTO          PIC  9(02)      COMP.      002100      
000066       05 WKS-MOV-SERVICIO             PIC  9(02)      COMP.      002600      
000067       05 WKS-MOV-TIPO-OPERACION       PIC  X(01).                002700      
000068       05 WKS-MOV-TIPO-MOVIMIENTO      PIC  9(02)      COMP.      002800      
000069    03 WKS-MOV-AGRUP-DESV-PROD         PIC  9(04)      COMP.      002900      
000070    03 WKS-MOV-AGRUP-DESV-INST         PIC  9(04)      COMP.      003000      
000071    03 WKS-MOV-SIRH-DESVIO             PIC  9(04)      COMP.      003100      
000072    03 WKS-MOV-IND-CONTA               PIC  9(02)      COMP.      003300      
000073    03 WKS-MOV-CVEIMP                  PIC  X(95).                003600      
000074    03 WKS-MOV-CVEIMP-OC               REDEFINES WKS-MOV-CVEIMP.  003700      
000075       04 WKS-MOV-ELE-CVEIMP           OCCURS 5 TIMES.            003800      
000076          05 WKS-MOV-CVETRAN           PIC  9(06)      COMP.      003900      
000077          05 WKS-MOV-INDLEY            PIC  9(02)      COMP.      004000      
000078          05 WKS-MOV-ESQCON            PIC  9(04)      COMP.      004100      
000079          05 WKS-MOV-TM REDEFINES WKS-MOV-ESQCON PIC 9(04) COMP.  004200      
000080          05 WKS-MOV-IMPORTE           PIC  9(16)V99   COMP.      004300      
000081          05 WKS-MOV-CVE-DESVIO        PIC  9(04)      COMP.      004400      
000082          05 WKS-MOV-GUIA-DESVIO       PIC  9(04)      COMP.      004500      
000083    03 WKS-MOV-CVEIMP-DET              REDEFINES WKS-MOV-CVEIMP.  004600      
000084       04 WKS-MOV-CVETRAN1             PIC  9(06)      COMP.      004700      
000085       04 WKS-MOV-INDLEY1              PIC  9(02)      COMP.      004800      
000086       04 WKS-MOV-ESQCON1              PIC  9(04)      COMP.      004900      
000087       04 WKS-MOV-TM1 REDEFINES WKS-MOV-ESQCON1 PIC 9(04) COMP.   005100      
000088       04 WKS-MOV-IMPORTE1             PIC  9(16)V99   COMP.      005200      
000089       04 WKS-MOV-CVE-DESVIO1          PIC  9(04)      COMP.      005300      
000090       04 WKS-MOV-GUIA-DESVIO1         PIC  9(04)      COMP.      005400      
000091                                                                  005500      
000092       04 WKS-MOV-CVETRAN2             PIC  9(06)      COMP.      005600      
000093       04 WKS-MOV-INDLEY2              PIC  9(02)      COMP.      005700      
000094       04 WKS-MOV-ESQCON2              PIC  9(04)      COMP.      005800      
000095       04 WKS-MOV-TM2 REDEFINES WKS-MOV-ESQCON2 PIC 9(04) COMP.   005900      
000096       04 WKS-MOV-IMPORTE2             PIC  9(16)V99   COMP.      006000      
000097       04 WKS-MOV-CVE-DESVIO2          PIC  9(04)      COMP.      006100      
000098       04 WKS-MOV-GUIA-DESVIO2         PIC  9(04)      COMP.      006200      
000099                                                                  006300      
000100       04 WKS-MOV-CVETRAN3             PIC  9(06)      COMP.      006400      
000101       04 WKS-MOV-INDLEY3              PIC  9(02)      COMP.      006500      
000102       04 WKS-MOV-ESQCON3              PIC  9(04)      COMP.      006600      
000103       04 WKS-MOV-TM3 REDEFINES WKS-MOV-ESQCON3 PIC 9(04) COMP.   006700      
000104       04 WKS-MOV-IMPORTE3             PIC  9(16)V99   COMP.      006800      
000105       04 WKS-MOV-CVE-DESVIO3          PIC  9(04)      COMP.      006900      
000106       04 WKS-MOV-GUIA-DESVIO3         PIC  9(04)      COMP.      007000      
000107                                                                  007100      
000108       04 WKS-MOV-CVETRAN4             PIC  9(06)      COMP.      007200      
000109       04 WKS-MOV-INDLEY4              PIC  9(02)      COMP.      007300      
000110       04 WKS-MOV-ESQCON4              PIC  9(04)      COMP.      007400      
000111       04 WKS-MOV-TM4 REDEFINES WKS-MOV-ESQCON4 PIC 9(04) COMP.   007500      
000112       04 WKS-MOV-IMPORTE4             PIC  9(16)V99   COMP.      007600      
000113       04 WKS-MOV-CVE-DESVIO4          PIC  9(04)      COMP.      007700      
000114       04 WKS-MOV-GUIA-DESVIO4         PIC  9(04)      COMP.      007800      
000115                                                                  007900      
000116       04 WKS-MOV-CVETRAN5             PIC  9(06)      COMP.      008000      
000117       04 WKS-MOV-INDLEY5              PIC  9(02)      COMP.      008100      
000118       04 WKS-MOV-ESQCON5              PIC  9(04)      COMP.      008200      
000119       04 WKS-MOV-TM5 REDEFINES WKS-MOV-ESQCON5 PIC 9(04) COMP.   008300      
000120       04 WKS-MOV-IMPORTE5             PIC  9(16)V99   COMP.      008400      
000121       04 WKS-MOV-CVE-DESVIO5          PIC  9(04)      COMP.      008500      
000122       04 WKS-MOV-GUIA-DESVIO5         PIC  9(04)      COMP.      008600      
000123                                                                  008700      
000124    03 WKS-MOV-MONEDA                  PIC  9(04)      COMP.      008800      
000125    03 WKS-MOV-ORIGEN                  PIC  9(02)      COMP.      008900      
000126    03 WKS-MOV-IND-EFEC                PIC  9(02)      COMP.      009000      
000127    03 WKS-MOV-SOBREGIRO               PIC  9(02)      COMP.      009100      
000128    03 WKS-MOV-IND-EDOCTA              PIC  9(02)      COMP.      009200      
000129    03 WKS-MOV-IND-EDOCTA-R            REDEFINES                  009300      
000130       WKS-MOV-IND-EDOCTA              PIC  X(01).                009400      
000131    03 WKS-MOV-ENVIO-CD                PIC  9(02)      COMP.      009500      
000132    03 WKS-MOV-IND-DATOS-ADIC          PIC  9(02)      COMP.      009600      
000133    03 WKS-MOV-IND-NUMREN              PIC  9(02)      COMP.      009700      
000134    03 WKS-MOV-FEC-VEN                 PIC  9(08)      COMP.      009800      
000135    03 WKS-MOV-FEC-PARTIDA             REDEFINES WKS-MOV-FEC-VEN  009900      
000136                                       PIC  9(08)      COMP.      010000      
000137    03 WKS-MOV-PLAZO                   PIC  9(04)      COMP.      010100      
000138    03 WKS-MOV-FEC-ULT-MOV             PIC  9(08)      COMP.      010200      
000139    03 WKS-MOV-BCOS                    PIC  9(10)      COMP.      010300      
000140    03 WKS-MOV-BCOS-R                  REDEFINES WKS-MOV-BCOS.    010400      
000141       05 WKS-MOV-BCO-ORI              PIC  9(05)      COMP.      010500      
000142       05 WKS-MOV-BCO-DES              PIC  9(05)      COMP.      010600      
000143    03 WKS-MOV-NODO-ORIG               PIC  9(02)      COMP.      010700      
000144    03 WKS-MOV-NODO-DESTINO            PIC  9(02)      COMP.      010800      
000145    03 WKS-MOV-SIS-ORIG                PIC  9(04)      COMP.      010900      
000146    03 WKS-MOV-PROD-ORIG               PIC  9(04)      COMP.      011000      
000147    03 WKS-MOV-INST-ORIG               PIC  9(02)      COMP.      011100      
000148    03 WKS-MOV-CVETR-ORI               PIC  9(06)      COMP.      011200      
000149    03 WKS-MOV-REF-ORIG                PIC  9(18)      COMP.      011300      
000150    03 WKS-MOV-CLIENTE                 PIC  9(12)      COMP.      011400      
000151    03 WKS-MOV-SECTOR                  PIC  9(02)      COMP.      011500      
000152    03 WKS-MOV-SUCPROM                 PIC  9(04)      COMP.      011600      
000153    03 WKS-MOV-CONTRATO                PIC  9(16)      COMP.      011700      
000154    03 WKS-MOV-CVEMDA                  PIC  9(04)      COMP.      011800      
000155    03 WKS-MOV-NUMMDA                  PIC  9(20)      COMP.      011900      
000156    03 WKS-MOV-MDA-R                   REDEFINES WKS-MOV-NUMMDA   012000      
000157                                       PIC X(10).                 012100      
000158    03 WKS-MOV-NUMMDA-R                REDEFINES WKS-MOV-NUMMDA.  012200      
000159       05 WKS-MOV-MDA-SUC              PIC  9(04)      COMP.      012300      
000160       05 WKS-MOV-MDA-CTA              PIC  9(16)      COMP.      012400      
000161    03 WKS-MOV-CVEMDE                  PIC  9(02)      COMP.      012500      
000162    03 WKS-MOV-INTERCOMPANY            PIC  9(06)      COMP.      012600      
000163    03 WKS-MOV-FILIAL                  PIC  X(05).                012700      
000164                                                                  012800      
000165    03 WKS-MOV-REFNUM                  PIC  9(18)      COMP.      012900      
000166    03 WKS-MOV-REFNUM-R                REDEFINES WKS-MOV-REFNUM   013000      
000167                                       PIC  X(09).                013100      
000168    03 WKS-MOV-REFERENCIA              REDEFINES WKS-MOV-REFNUM   013200      
000169                                       PIC  9(18)      COMP.      013300      
000170    03 WKS-MOV-AUTORIZA                PIC  9(18)      COMP.      013400      
000171    03 WKS-MOV-AUTORIZA-R              REDEFINES WKS-MOV-AUTORIZA 013500      
000172                                       PIC  X(9).                 013600      
000173    03 WKS-MOV-AUT3ER                  PIC  9(10)      COMP.      013700      
000174    03 WKS-MOV-AUT3ER-R                REDEFINES WKS-MOV-AUT3ER   013800      
000175                                       PIC  X(05).                013900      
000176    03 WKS-MOV-NIO                     PIC  X(16).                014000      
000177    03 WKS-MOV-AUT-S151                PIC  9(08)      COMP.      014100      
000178    03 WKS-MOV-AUT-AELIM-S151          PIC  9(08)      COMP.      014200      
000179    03 WKS-MOV-AUT-AELIM-S151-R        REDEFINES                  014300      
000180       WKS-MOV-AUT-AELIM-S151          PIC  X(04).                014400      
000181    03 WKS-MOV-AUT-ANT-S151            PIC  9(08)      COMP.      014500      
000182    03 WKS-MOV-AUT-ANT-S151-R          REDEFINES                  014600      
000183       WKS-MOV-AUT-ANT-S151            PIC  X(04).                014700      
000184    03 WKS-MOV-TIPO-PROC               PIC  9(02)      COMP.      014800      
000185    03 WKS-MOV-FECMOV                  PIC  9(08)      COMP.      014900      
000186    03 WKS-MOV-HORMOV                  PIC  9(06)      COMP.      015000      
000187    03 WKS-MOV-FECCONT                 PIC  9(08)      COMP.      015100      
000188    03 WKS-MOV-FECVAL                  PIC  9(08)      COMP.      015200      
000189    03 WKS-MOV-FECVAL-R                REDEFINES WKS-MOV-FECVAL   015300      
000190                                       PIC  X(04).                015400      
000191    03 WKS-MOV-SUC-INIC                PIC  9(04)      COMP.      015500      
000192    03 WKS-MOV-CAJA-INIC               PIC  9(04)      COMP.      015600      
000193    03 WKS-MOV-CAJA-S501               REDEFINES WKS-MOV-CAJA-INIC015700      
000194                                       PIC  9(04)      COMP.      015800      
000195    03 WKS-MOV-SUCOPER                 PIC  9(04)      COMP.      015900      
000196    03 WKS-MOV-CAJAOPER                PIC  9(04)      COMP.      016000      
000197    03 WKS-MOV-SUCTRAN                 PIC  9(04)      COMP.      016100      
000198    03 WKS-MOV-CAJATRAN                PIC  9(04)      COMP.      016200      
000199    03 WKS-MOV-VERIF-FIRMA             PIC  9(02)      COMP.      016300      
000200                                                                  016400      
000201    03 WKS-MOV-NOMINA-OPE              PIC  9(14)      COMP.      016500      
000202    03 WKS-MOV-NOMINA-OPE-R            REDEFINES                  016600      
000203       WKS-MOV-NOMINA-OPE              PIC X(07).                 016700      
000204    03 WKS-MOV-FILXAPL                 PIC X(165).                016800      
000205                                                                  016900      
000206    03 WKS-MOV-S408                    REDEFINES WKS-MOV-FILXAPL. 030400      
000207       05 WKS-MOV-FOLIO                PIC  9(04)     COMP.       030500      
000208       05 WKS-MOV-NUMLIN               PIC  9(04)     COMP.       030600      
000209       05 WKS-MOV-TASA-S408            PIC  9(4)V9(4) COMP.       030700      
000210       05 WKS-MOV-FINI-S408            PIC  9(08)     COMP.       030800      
000211       05 WKS-MOV-FFIN-S408            PIC  9(08)     COMP.       030900      
000212       05 WKS-MOV-IMPORTE-S408         PIC  9(12)V99  COMP.       031000      
000213       05 FILLER                       PIC  X(142).               031100      
000214                                                                  031200      
000215    03 WKS-MOV-REDS500                 REDEFINES WKS-MOV-FILXAPL. 031300      
000216       05 WKS-MOV-CVEAVISO             PIC  9(04)     COMP.       031320      
000217       05 WKS-MOV-BANCA                PIC  9(02)     COMP.       031340      
000218       05 WKS-MOV-ESTACION             PIC  9(04)     COMP.       031400      
000219       05 WKS-MOV-CHVV                 PIC  9(04)     COMP.       031500      
000220       05 WKS-MOV-TCHEQ                PIC  9(02)     COMP.       031600      
000221       05 WKS-MOV-CTACON               PIC  9(02)     COMP.       031700      
000222       05 WKS-MOV-CVECAUSA             PIC  9(04)     COMP.       031900      
000223       05 WKS-MOV-FECDEV               PIC  9(08)     COMP.       032000      
000224       05 WKS-MOV-MOTIVO-DEV           PIC  X(30).                032050      
000225       05 WKS-MOV-BCO                  PIC  9(04)     COMP.       032100      
000226       05 WKS-MOV-NOMB-BCO             PIC  X(20).                032150      
000227       05 WKS-MOV-NOMORD               PIC  X(30).                032200      
000228       05 WKS-MOV-CAUSAORD             PIC  X(50).                032300      
000229       05 WKS-MOV-SUCORD               PIC  9(04)     COMP.       032400      
000230       05 WKS-MOV-REF-CECO             PIC  X(07).                032900      
000231       05 WKS-MOV-NUM-ORD-PAGO         PIC  9(18)     COMP.       032950      
000232                                                                  033600      
000233    03 WKS-MOV-REDS701                 REDEFINES WKS-MOV-FILXAPL. 033700      
000234       05 WKS-MOV-DATOS-S701           PIC X(95).                 033800      
000235       05 WKS-MOV-PAG-SERV             REDEFINES                  033900      
000236                                       WKS-MOV-DATOS-S701.        034000      
000237          07 WKS-MOV-ID                PIC X(30).                 034100      
000238          07 WKS-MOV-FECREC            PIC 9(06).                 034200      
000239          07 WKS-MOV-REF1              PIC X(20).                 034300      
000240          07 WKS-MOV-REF2              PIC X(20).                 034400      
000241          07 WKS-MOV-TIPOPAGO          PIC 9(06).                 034500      
000242          07 WKS-MOV-TIPOPAGO-R        REDEFINES                  034600      
000243                                       WKS-MOV-TIPOPAGO.          034700      
000244             09 WKS-MOV-ESTAB          PIC 9(04).                 034800      
000245             09 WKS-MOV-SEQ            PIC 9(02).                 034900      
000246          07 WKS-MOV-AUT-S701          PIC 9(08).                 035000      
000247          07 WKS-MOV-FPAGO             PIC 9(02).                 035100      
000248          07 WKS-MOV-EBPP              PIC 9(03).                 035200      
000249       05 WKS-MOV-PAG-IMPT             REDEFINES                  035300      
000250                                       WKS-MOV-DATOS-S701.        035400      
000251          07 WKS-MOV-RFC               PIC X(13).                 035500      
000252          07 WKS-MOV-FORMULARIO        PIC X(10).                 035600      
000253          07 FILLER                    PIC X(72).                 035700      
000254       05 FILLER                       PIC X(70).                 035800      
000255                                                                  035900      
000256    03 FILLER                          PIC X(04).                 036000      
000257    03 WKS-MOV-STATUS                  PIC 9(02) COMP.            036100      
000258                                                                  038300      
000259******************************************************************038400      
000260***               F O R M A T O  -  C A L L  S 1 5 1           ***038500      
000261***                 D A T O S   A D I C I O N A L E S          ***038600      
000262******************************************************************038700      
000263                                                                  038800      
000264     03 WKS-MOV-REF-BANAMEX            PIC X(26).                 038850      
000265     03 WKS-MOV-CVECON-YREFLOC  REDEFINES                         038900      
000266        WKS-MOV-REF-BANAMEX            PIC X(26).                 038950      
000267     03 WKS-MOV-CVECON-Y-REFV REDEFINES WKS-MOV-REF-BANAMEX.      039000      
000268        05 WKS-MOV-CONT-ORIG           PIC 9(20) COMP.            039200      
000269        05 WKS-MOV-REFLOC-BNM          PIC X(12).                 039300      
000270        05 WKS-MOV-REFLOC-23POS REDEFINES WKS-MOV-REFLOC-BNM.     039400      
000271           07 WKS-MOV-REF23POS         PIC 9(23) COMP.            039700      
000272           07 FILLER                   PIC 9(01) COMP.            039800      
000273        05 FILLER                      PIC X(04).                 039900      
000274     03 WKS-MOV-CONTYREFLOC  REDEFINES WKS-MOV-REF-BANAMEX.       041100      
000275        05 WKS-MOV-PRODGEN             PIC 9(03) COMP.            041200      
000276        05 WKS-MOV-SUBPRODGEN          PIC 9(03) COMP.            041300      
000277        05 WKS-MOV-CRE-FOLIO           PIC 9(04) COMP.            041400      
000278        05 WKS-MOV-CONSECUTIVO         OCCURS 5 TIMES.            041500      
000279           06 WKS-MOV-CONSEC           PIC 9(08) COMP.            041600      
000280        05 WKS-MOV-MON-CONTRUC         PIC 9(02) COMP.            041700      
000281    03 WKS-MOV-NOMINA-FUN1             PIC 9(14) COMP.            041800      
000282    03 WKS-MOV-NOMINA-FUN2             PIC 9(14) COMP.            041900      
000283    03 WKS-MOV-NOM-MAKER               PIC 9(14) COMP.            042000      
000284    03 WKS-MOV-NOM-CHECKER             PIC 9(14) COMP.            042100      
000285    03 WKS-MOV-REF-CLIENTE             PIC X(16).                 042200      
000286    03 WKS-MOV-REFERENCIA1             PIC X(35).                 042300      
000287    03 WKS-MOV-REF2-CTE                PIC X(35).                 042400      
000288    03 WKS-MOV-REF3-CTE                PIC X(35).                 042500      
000289    03 WKS-MOV-REF4-CTE                PIC X(35).                 042600      
000290    03 WKS-MOV-LEYENDAS                PIC X(200).                042620      
000291    03 WKS-MOV-LEYENDAS-R              REDEFINES WKS-MOV-LEYENDAS.042640      
000292       05 WKS-MOV-LEY1                 PIC X(40).                 042700      
000293       05 WKS-MOV-LEY2                 PIC X(40).                 042800      
000294       05 WKS-MOV-LEY3                 PIC X(40).                 042900      
000295       05 WKS-MOV-LEY4                 PIC X(40).                 043000      
000296       05 WKS-MOV-LEY5                 PIC X(40).                 043100      
000297    03 WKS-MOV-LEYENDAS-R1             REDEFINES WKS-MOV-LEYENDAS.043120      
000298       05 WKS-MOV-ELEM-LEY             OCCURS 5 TIMES.            043140      
000299          07 WKS-MOV-LEY               PIC X(40).                 043160      
000300    03 WKS-MOV-FILLERXAPLI             PIC X(120).                043200      
000301    03 WKS-MOV-FILLERAXPLI-S500 REDEFINES WKS-MOV-FILLERXAPLI.    043300      
000302       05 WKS-MOV-NOMB-CTE             PIC X(36).                 043400      
000303       05 WKS-MOV-NOMB-BENEF           PIC X(50).                 043500      
000304       05 WKS-MOV-CVE-RASTREO-S500     PIC X(30).                 043600      
000305       05 WKS-MOV-FECHA-PAGO           PIC 9(08)   COMP.          043700      
000306                                                                  043800      
000307    03 FILLER                          PIC X(10).                 043900      
000308                                                                  044300      
000309*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000310                                                                  003100      
000311 WORKING-STORAGE SECTION.                                         009500      
000312 01  A01-KEY-NUMREG                PIC 9(06).                     009600      
000313 77  LOG-KEY                       PIC 9(08).                     009700      
000314 77  W77-NUMREG                    PIC 9(06).                     009800      
000315 01  WKS-ETI-S151-MOVANT.                                         009900      
000316     02 FILLER                     PIC X(16) VALUE                010000      
000317        "(S151)S151/FILE/".                                       010100      
000318     02 WKS-ETI-S151-FILE          PIC X(03).                     010120      
000319     02 WKS-ETI-S151-S             PIC X(01) VALUE "S".           010140      
000320     02 WKS-SIS-MOV                PIC 9(03).                     010200      
000321     02 FILLER                     PIC X(01) VALUE "/".           010300      
000322     02 WKS-SIS-FEC                PIC 9(06).                     010400      
000323     02 FILLER                     PIC X(06) VALUE " ON ".        010450      
000324     02 WKS-SIS-PACK               PIC X(15).                     010500      
000325     02 FILLER                     PIC X(01) VALUE ".".           010550      
000326                                                                  010600      
000327 77  W77-I                         PIC 9(04).                     010700      
000328 77  W77-FIN                       PIC 9(02) COMP VALUE ZEROS.    010800      
000329 77   W77-TOT-870                  PIC 9(05).                     010820      
000330 77   W77-TOT-342                  PIC 9(05).                     010840      
000331 77   W77-TOT-SUC                  PIC 9(05).                     010860      
000332                                                                  010880      
000333 01 WKS-PARAMETRO.                                                010900      
000334    03 WKS-FILE                    PIC X(03).                     010920      
000335    03 WKS-FECHA                   PIC 9(06).                     010940      
000336    03 WKS-SISTEMA                 PIC 9(03).                     010950      
000337                                                                  011000      
000338 01 WKS-CTLVER-LIBID             PIC X(12).                       012000      
000339 01 WKS-CTLVER-NOMLIB            PIC X(72).                       013000      
000340 01 W77-CTLVER-RESULT            PIC S9(11) BINARY.               014000      
000341  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  015000      
000342  01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                         016000      
000343     03 WKS-B01-FUNCION             PIC 9(02).                    017000      
000344     03 WKS-B01-SISTEMA             PIC 9(04).                    018000      
000345     03 WKS-B01-CSI                 PIC 9(02).                    019000      
000346     03 WKS-B01-FECPRO              PIC 9(08).                    020000      
000347     03 WKS-B01-FECCON              PIC 9(08).                    021000      
000348     03 WKS-B01-FECPRO151           PIC 9(08).                    022000      
000349     03 WKS-B01-STAREG              PIC 9(02).                    023000      
000350     03 WKS-B01-NOMARCSAL           PIC X(34).                    024000      
000351     03 WKS-B01-NOMPACSAL           PIC X(17).                    025000      
000352     03 WKS-B01-NOMARCMOV           PIC X(34).                    026000      
000353     03 WKS-B01-NOMPACMOV           PIC X(17).                    027000      
000354     03 WKS-B01-NOMARCDES           PIC X(34).                    028000      
000355     03 WKS-B01-NOMPACDES           PIC X(17).                    029000      
000356     03 WKS-B01-NOMARCERR           PIC X(34).                    030000      
000357     03 WKS-B01-NOMPACERR           PIC X(17).                    031000      
000358     03 WKS-B01-NOMBDSEM            PIC X(17).                    032000      
000359     03 WKS-B01-STABDSEM            PIC 9(02).                    033000      
000360     03 WKS-B01-NUMARC              PIC 9(02).                    034000      
000361     03 WKS-B01-3ERNIV              PIC 9(02).                    035000      
000362     03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                      036000      
000363        05 WKS-B01-FECARCMOV        PIC 9(08).                    037000      
000364        05 WKS-B01-NIVARCMOV        PIC 9(08).                    038000      
000365        05 WKS-B01-NIVBDMOV         PIC 9(08).                    039000      
000366        05 WKS-B01-STAARCLOG        PIC 9(02).                    040000      
000367                                                                  041000      
000368  01 MENSAJE-LJ.                                                  042000      
000369     02 SISTEMA-LJ     PIC X(04).                                 043000      
000370     02 FILLER         PIC X VALUE "/".                           044000      
000371     02 PASO-LJ        PIC X(04).                                 045000      
000372     02 FILLER         PIC X VALUE "/".                           046000      
000373     02 MTP-LJ         PIC 9(03).                                 047000      
000374     02 FILLER         PIC X VALUE ":".                           048000      
000375     02 TIPO-LJ        PIC X.                                     049000      
000376     02 FILLER         PIC X VALUE ">".                           050000      
000377     02 CODIGO-LJ      PIC 9(06).                                 051000      
000378     02 FILLER         PIC X VALUE "<".                           052000      
000379     02 TEXTO-LJ       PIC X(250).                                053000      
000380 77 W77-ERROR                    PIC 9(02).                       054000      
000381 01 W77-RESULT-B01               PIC 9(08).                       055000      
000382                                                                  056000      
000383 PROCEDURE DIVISION USING WKS-PARAMETRO.                          057000      
000384 000000-INIC-PROGRAMA.                                            058000      
000385     MOVE "S151"                  TO SISTEMA-LJ.                  059000      
000386     MOVE "P630"                  TO PASO-LJ.                     060000      
000387     MOVE "002"                   TO MTP-LJ.                      061000      
000388     MOVE "I"                     TO TIPO-LJ.                     062000      
000389     MOVE 020201                  TO CODIGO-LJ.                   063000      
000390     PERFORM 020400-LIBRERIAS.                                    064000      
000391     MOVE WKS-FECHA                 TO WKS-SIS-FEC.               066000      
000392     MOVE WKS-FILE                TO WKS-ETI-S151-FILE            067000      
000393     MOVE WKS-SISTEMA               TO WKS-SIS-MOV                068000      
000394     IF WKS-FILE = "CON"                                          069100      
000395        PERFORM 020400-CONSULTA                                   069150      
000396     ELSE                                                         069200      
000397        PERFORM 020400-ACTUALIZA.                                 069300      
000398     STOP RUN.                                                    069400      
000399                                                                  069500      
000400 020400-ACTUALIZA.                                                069600      
000401     OPEN I-O    A01-ERRSNNN.                                     070000      
000402     READ A01-ERRSNNN INTO WKS-MOV-DATOS AT END MOVE 1 TO W77-FIN.071000      
000403*MUESTRA LA FECHA EN EL ARCHIVO ANTES DE ACTUALIZARLA             071100      
000404     STRING "FECHA ARCHIVO " WKS-MOV-FECHD                        071200      
000405     DELIMITED BY SIZE INTO TEXTO-LJ                              071300      
000406     MOVE "I"                       TO TIPO-LJ                    071400      
000407     MOVE 020101                    TO CODIGO-LJ                  071500      
000408     CALL "LJ IN LIB-DISP"          USING CONTADOR-LJ,            071600      
000409                                          MENSAJE-LJ.             071700      
000410*                                                                 071800      
000411     MOVE "HD"                      TO WKS-MOV-ID-HD.             072000      
000412     MOVE WKS-FECHA                 TO WKS-MOV-FECHD.             073000      
000413     ADD  20000000                  TO WKS-MOV-FECHD.             074000      
000414     REWRITE WKS-MOV-DATOS                                        075000      
000415             INVALID KEY DISPLAY "ERROR EN GRABAR HD".            076000      
000416     CLOSE A01-ERRSNNN WITH SAVE.                                 077000      
000417                                                                  078000      
000418 020400-CONSULTA.                                                 079000      
000419*============================                                     079020      
000420     IF WKS-SISTEMA = 500                                         079040      
000421        MOVE "CB2" TO WKS-ETI-S151-FILE                           079060      
000422        PERFORM 020400-DESPLIEGA                                  079080      
000423        MOVE "CTD" TO WKS-ETI-S151-FILE                           079100      
000424        PERFORM 020400-DESPLIEGA.                                 079120      
000425     MOVE "MOV" TO WKS-ETI-S151-FILE                              079140      
000426     PERFORM 020400-DESPLIEGA                                     079160      
000427     MOVE "DES" TO WKS-ETI-S151-FILE                              079180      
000428     PERFORM 020400-DESPLIEGA.                                    079200      
000429                                                                  079220      
000430 020400-DESPLIEGA.                                                079240      
000431*================================                                 079260      
000432CHANGE ATTRIBUTE TITLE OF  A01-ERRSNNN TO WKS-ETI-S151-MOVANT.    079270      
000433     OPEN INPUT    A01-ERRSNNN.                                   079280      
000434     READ A01-ERRSNNN INTO WKS-MOV-DATOS AT END MOVE 1 TO W77-FIN.079300      
000435     CLOSE A01-ERRSNNN WITH RELEASE.                              079340      
000436     STRING "FECHA ARCHIVO " WKS-ETI-S151-FILE                    079342      
000437              " : " WKS-MOV-FECHD                                 079344      
000438     DELIMITED BY SIZE INTO TEXTO-LJ                              079346      
000439     MOVE "I"                       TO TIPO-LJ                    079348      
000440     MOVE 020101                    TO CODIGO-LJ                  079350      
000441     CALL "LJ IN LIB-DISP"          USING CONTADOR-LJ,            079352      
000442                                          MENSAJE-LJ.             079354      
000443                                                                  079360      
000444                                                                  079500      
000445 020400-LIBRERIAS.                                                080000      
000446*=================                                                081000      
000447    CHANGE ATTRIBUTE LIBACCESS         OF "CTRLVERS"              082000      
000448                                       TO BYFUNCTION.             083000      
000449    CHANGE ATTRIBUTE FUNCTIONNAME      OF "CTRLVERS"              084000      
000450                                       TO "CTLVERS".              085000      
000451    CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION.      086000      
000452    CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP".        087000      
000453    CHANGE ATTRIBUTE TITLE             OF "LIB-DISP"              088000      
000454       TO "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".        089000      
000455                                                                  090000      
000456                                                                  091000      
000457                                                                  092000      
000458                                                                  093000      
000459*********** OBTIENE NOMBRE DEL ARCHIVO DE MOVS ****************** 094000      
000460    MOVE "S151L001CTL"                 TO     WKS-CTLVER-LIBID.   095000      
000461    CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID    096000      
000462                                              WKS-CTLVER-NOMLIB   097000      
000463                                       GIVING W77-CTLVER-RESULT.  098000      
000464     IF W77-CTLVER-RESULT = 0                                     099000      
000465        CHANGE ATTRIBUTE TITLE         OF "S151-L001"             100000      
000466                                       TO WKS-CTLVER-NOMLIB       101000      
000467     ELSE                                                         102000      
000468        CHANGE ATTRIBUTE TITLE         OF "S151-L001" TO          103000      
000469               "(S151)S151/OBJECT/L001/CONTROL ON CMEMP.".        104000      
000470                                                                  105000      
000471     MOVE WKS-SISTEMA                  TO WKS-B01-SISTEMA         106000      
000472     MOVE 01                           TO WKS-B01-FUNCION.        107000      
000473     CALL "CONSISDIA IN S151-L001"     USING  WKS-S151B01SISDIA   108000      
000474                                       GIVING W77-RESULT-B01.     109000      
000475                                                                  110000      
000476     IF W77-RESULT-B01 > 0                                        111000      
000477        MOVE W77-RESULT-B01            TO W77-ERROR               112000      
000478        STRING "NO PUEDO OBTENER FECHA DE PROCESO "               113000      
000479               " ERROR EN S151-L001 S" WKS-SISTEMA                114000      
000480               ", ERR #" W77-ERROR                                115000      
000481        DELIMITED BY SIZE INTO TEXTO-LJ                           116000      
000482        MOVE "O"                       TO TIPO-LJ                 117000      
000483        MOVE 020901                    TO CODIGO-LJ               118000      
000484        CALL "LJ IN LIB-DISP"          USING CONTADOR-LJ,         119000      
000485                                             MENSAJE-LJ           120000      
000486        SET MYSELF(STATUS) TO -1                                  121000      
000487     ELSE                                                         122000      
000488        MOVE WKS-B01-NOMPACMOV         TO WKS-SIS-PACK.           123000      
000489                                                                  124000      
