000001$SET LIST  LINEINFO                                               000100      
000002$SET OPTIMIZE                                                     000200      
000003*$SET TADS                                                        000300      
000004 IDENTIFICATION DIVISION.                                         000400      
000005******************************************************************000500      
000006*   FUNCION : MODIFICAR EL ARCHIVO DE DIRECTORIOS                *000600      
000007******************************************************************000700      
000008 ENVIRONMENT DIVISION.                                            000800      
000009 INPUT-OUTPUT SECTION.                                            000900      
000010 FILE-CONTROL.                                                    001000      
000011     SELECT A01-DIR-INPUT     ASSIGN TO DISK                      001100      
000012     ORGANIZATION IS SEQUENTIAL                                   001200      
000013     ACCESS MODE  IS SEQUENTIAL.                                  001300      
000014     SELECT A01-DIR2-INPUT    ASSIGN TO DISK                      001400      
000015     ORGANIZATION IS SEQUENTIAL                                   001500      
000016     ACCESS MODE IS SEQUENTIAL.                                   001600      
000017 DATA DIVISION.                                                   001700      
000018 FILE SECTION.                                                    001800      
000019 FD  A01-DIR-INPUT                                                001900      
000020     VALUE OF MAXRECSIZE     IS 80                                002100      
000021              FRAMESIZE      IS 8                                 002200      
000022              TITLE "S151/FILE/I10/DEPURAR/DIRECTORIOS/007."      002300      
000023     BLOCK  CONTAINS 100 RECORDS.                                 002400      
000024 01 A01-REG-DIR              PIC X(80).                           002500      
000025                                                                  002600      
000026 FD  A01-DIR2-INPUT                                               003200      
000027     VALUE OF MAXRECSIZE IS 80                                    003300      
000028              FRAMESIZE  IS 8                                     003400      
000029              TITLE "S151/FILE/I10/DEPURAR/DIRECTORIOS/TEMP."     003500      
000030     BLOCK CONTAINS 100 RECORDS.                                  003600      
000031 01 A01-REG2-DIR             PIC X(80).                           003700      
000032                                                                  003800      
000033 WORKING-STORAGE SECTION.                                         004400      
000034 01  WKS-ID-LIB                    PIC X(12).                     004500      
000035 01  WKS-TIT-LIB                   PIC X(72).                     004600      
000036 01  WKS-TIT-S151DIR               PIC X(72).                     004700      
000037 01  WKS-SOPCOMS.                                                 004800      
000038     03 WKS-NUMCSI                 PIC 9(02).                     004900      
000039     03 WKS-NOMEQUIPO              PIC X(10).                     005000      
000040     03 WKS-NOMCSI                 PIC X(26).                     005100      
000041     03 WKS-LINEA-BATCH            PIC X(05).                     005200      
000042 77 W77-RESULT                     PIC S9(11) BINARY.             005300      
000043 77 W77-ERROR                      PIC 9(02).                     005400      
000044 77 W77-SLASH                      PIC 9(02).                     005500      
000045 77 W77-DIAS-MENOS                 PIC 9(02).                     005600      
000046 01 WKS-DUPLI                      PIC 9(01).                     005700      
000047 01 WKS-NOMLIB                     PIC X(60).                     005800      
000048 01 WKS-CONTROL                    PIC 9(01).                     005900      
000049 01 WKS-FIN-RUTI                   PIC 9(01).                     006000      
000050 77 W77-FIN                        PIC 9(02).                     006100      
000051 77 WKS-FIN-ARCH                   PIC 9(02).                     006200      
000052 01 WKS-USUARIO                    PIC X(06).                     006300      
000053 01 WKS-DIRECTORIO                 PIC X(30).                     006400      
000054                                                                  006420      
000055*=============    PARAMETROS                                      006440      
000056 01 WKS-PARAM-USER                 PIC X(04).                     006450      
000057 01 WKS-PARAM-DIR                  PIC X(30).                     006500      
000058 01 WKS-PARAM-PACK                 PIC X(17).                     006600      
000059 01 WKS-PARAM-CSI                  PIC 9(02).                     006700      
000060 01 WKS-PARAM-DIA                  PIC 9(02).                     006800      
000061 01 WKS-OPCION                     PIC X(01).                     006900      
000062*==============   LINEA DE DETALLE                                006910      
000063 01 WKS-USER                       PIC X(04).                     006920      
000064 01 WKS-DIR                        PIC X(30).                     006930      
000065 01 WKS-PACK                       PIC X(17).                     006940      
000066 01 WKS-CSI                        PIC X(02).                     006950      
000067                                                                  006960      
000068 01 WKS-PUNTO                      PIC X(01) VALUE ".".           006980      
000069 01 WKS-STRING-ON                  PIC X(04) VALUE " ON ".        007000      
000070***COPY PARA LA LIBRERIA LJ                                       007100      
000071*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000072* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           007200      
000073**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000074  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000075  01 MENSAJE-LJ.                                                  100300      
000076     02 SISTEMA-LJ     PIC X(04).                                 100400      
000077     02 FILLER         PIC X VALUE "/".                           100500      
000078     02 PASO-LJ        PIC X(04).                                 100600      
000079     02 FILLER         PIC X VALUE "/".                           100700      
000080     02 MTP-LJ         PIC 9(03).                                 100800      
000081     02 FILLER         PIC X VALUE ":".                           100900      
000082     02 TIPO-LJ        PIC X.                                     101000      
000083     02 FILLER         PIC X VALUE ">".                           101100      
000084     02 CODIGO-LJ      PIC 9(06).                                 101200      
000085     02 FILLER         PIC X VALUE "<".                           101300      
000086     02 TEXTO-LJ       PIC X(250).                                101400      
000087*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000088  PROCEDURE DIVISION USING WKS-OPCION    ,                        007300      
000089                           WKS-PARAM-DIR ,                        007400      
000090                           WKS-PARAM-PACK,                        007500      
000091                           WKS-PARAM-CSI ,                        007600      
000092                           WKS-PARAM-DIA .                        007700      
000093                                                                  007800      
000094  0000-INICIA.                                                    007900      
000095*=============                                                    008000      
000096   MOVE "S151"                  TO  SISTEMA-LJ .                  008100      
000097   MOVE "P620"                  TO  PASO-LJ    .                  008200      
000098   MOVE "005"                   TO  MTP-LJ     .                  008300      
000099   MOVE "I"                     TO  TIPO-LJ    .                  008400      
000100   MOVE 020101                  TO  CODIGO-LJ  .                  008500      
000101   PERFORM 0100-LIBRERIAS.                                        008600      
000102   MOVE "S151"                  TO WKS-PARAM-USER.                008700      
000103   IF WKS-OPCION = "A" OR "B"                                     008800      
000104      INSPECT WKS-PARAM-DIR TALLYING W77-SLASH FOR ALL "/"        009100      
000105      IF W77-SLASH > 1                                            009200      
000106         PERFORM 0200-PROCESO                                     009300      
000107         IF W77-ERROR = 0                                         009400      
000108            CLOSE A01-DIR-INPUT WITH PURGE                        009500      
000109            OPEN INPUT A01-DIR2-INPUT                             009600      
000110            CHANGE ATTRIBUTE TITLE OF A01-DIR2-INPUT TO           009700      
000111*               "S151/FILE/I10/DEPURAR/DIRECTORIOS/007."          009800      
000112            WKS-TIT-S151DIR                                       009850      
000113            CLOSE A01-DIR2-INPUT WITH SAVE                        009900      
000114         ELSE                                                     010000      
000115            NEXT SENTENCE                                         010100      
000116      ELSE                                                        010200      
000117         MOVE "EL NIVEL DEL DIRECTORIO DEBE DE SER > 2"           010300      
000118                                           TO TEXTO-LJ            010400      
000119         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ      010500      
000120   ELSE                                                           011000      
000121      MOVE "LA ACCION DEBE DE SER ALTA (A) O BAJA (B)"            011100      
000122                                              TO TEXTO-LJ         011200      
000123      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.        011300      
000124                                                                  011400      
000125   STOP RUN.                                                      011500      
000126                                                                  011600      
000127 0100-LIBRERIAS.                                                  011700      
000128*===============                                                  011800      
000129     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     011820      
000130     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      011840      
000131                                                                  011860      
000132     MOVE "S151DIR"                TO     WKS-ID-LIB.             011865      
000133     CALL "DAME_TIT IN CTLVER"     USING  WKS-ID-LIB,             011870      
000134                                          WKS-TIT-LIB             011875      
000135                                   GIVING W77-RESULT.             011880      
000136     IF W77-RESULT = 0                                            011885      
000137        CHANGE ATTRIBUTE TITLE OF A01-DIR-INPUT TO WKS-TIT-LIB    011890      
000138        MOVE WKS-TIT-LIB           TO WKS-TIT-S151DIR.            011892      
000139                                                                  011895      
000140     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.011900      
000141     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            012000      
000142                                      "SOPORTECOMS".              012100      
000143     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"           TO            012200      
000144          "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".        012300      
000145                                                                  012400      
000146     CALL "CSIID IN SOPORTECOMS" USING WKS-SOPCOMS.               012500      
000147     CANCEL "SOPORTECOMS".                                        012600      
000148                                                                  013400      
000149 0200-PROCESO.                                                    013500      
000150*=============                                                    013600      
000151   OPEN INPUT A01-DIR-INPUT.                                      013700      
000152   MOVE ZERO                               TO W77-FIN.            013800      
000153   READ A01-DIR-INPUT AT END        MOVE 1 TO W77-FIN.            013900      
000154                                                                  014000      
000155   OPEN OUTPUT A01-DIR2-INPUT                                     014100      
000156   PERFORM 0210-CREA-ARCH UNTIL W77-FIN = 1                       014200      
000157   CLOSE A01-DIR2-INPUT WITH SAVE.                                014300      
000158                                                                  014400      
000159   IF WKS-OPCION = "A"                                            014500      
000160      IF WKS-DUPLI  = 1                                           014600      
000161         MOVE "EL REGISTRO YA EXISTE"      TO TEXTO-LJ            014700      
000162         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ      014800      
000163         MOVE 1                            TO W77-ERROR           014900      
000164      ELSE                                                        015000      
000165         PERFORM 0220-PROCESA-ALTA.                               015100      
000166                                                                  015200      
000167  0210-CREA-ARCH.                                                 015300      
000168*======================                                           015400      
000169    IF A01-REG-DIR = SPACES                                       015420      
000170       NEXT SENTENCE                                              015440      
000171    ELSE                                                          015460      
000172       UNSTRING A01-REG-DIR DELIMITED BY WKS-PUNTO INTO WKS-USER  015500      
000173                            DELIMITER IN WKS-PUNTO ,    WKS-DIR   015520      
000174                            DELIMITER IN WKS-PUNTO ,    WKS-PACK  015540      
000175                            DELIMITER IN WKS-PUNTO ,    WKS-CSI   015560      
000176       IF WKS-DIR     = WKS-PARAM-DIR    AND                      015600      
000177          WKS-PACK    = WKS-PARAM-PACK   AND                      015650      
000178          WKS-CSI     = WKS-PARAM-CSI    AND                      015700      
000179          WKS-OPCION  = "B" THEN                                  015800      
000180          NEXT SENTENCE                                           015900      
000181       ELSE                                                       016400      
000182       IF WKS-DIR     = WKS-PARAM-DIR    AND                      016450      
000183          WKS-PACK    = WKS-PARAM-PACK   AND                      016500      
000184          WKS-CSI     = WKS-PARAM-CSI                             016550      
000185          MOVE 1                       TO WKS-DUPLI               016600      
000186       ELSE                                                       016650      
000187          MOVE  A01-REG-DIR            TO A01-REG2-DIR            016800      
000188          WRITE A01-REG2-DIR.                                     016900      
000189                                                                  017000      
000190    READ  A01-DIR-INPUT AT END MOVE 1  TO W77-FIN.                017100      
000191                                                                  017200      
000192 0220-PROCESA-ALTA.                                               017300      
000193*==================                                               017400      
000194   IF WKS-PARAM-DIA > 4                                           017500      
000195      MOVE 4                         TO WKS-PARAM-DIA.            017600      
000196                                                                  017700      
000197   OPEN EXTEND   A01-DIR2-INPUT.                                  017800      
000198   STRING WKS-PARAM-USER DELIMITED BY SIZE,                       018200      
000199          WKS-PUNTO      DELIMITED BY SIZE,                       018250      
000200          WKS-PARAM-DIR  DELIMITED BY SIZE,                       018300      
000201          WKS-PUNTO      DELIMITED BY SIZE,                       018350      
000202          WKS-PARAM-PACK DELIMITED BY SIZE,                       018400      
000203          WKS-PUNTO      DELIMITED BY SIZE,                       018420      
000204          WKS-PARAM-CSI  DELIMITED BY SIZE,                       018440      
000205          WKS-PUNTO      DELIMITED BY SIZE,                       018460      
000206          WKS-PARAM-DIA  DELIMITED BY SIZE                        018480      
000207   INTO A01-REG2-DIR .                                            018500      
000208   WRITE A01-REG2-DIR.                                            018900      
000209   CLOSE A01-DIR2-INPUT WITH SAVE.                                019000      
000210                                                                  019100      
