000001$$SET XREF LIST STACK MAP LINEINFO ERRORLIMIT=50 NEWID "S030/P115"000100      
000002*$SET FEDLEVEL = 5                                                000200      
000003*$TADS                                                            000300      
000004 IDENTIFICATION DIVISION.                                         000400      
000005 PROGRAM-ID.                S151-P115-COMPENREG.                  000500      
000006* AUTOR.                    ANSELMO SANCHEZ MARTINEZ.             000600      
000007* INSTALLATION.             BANCO NACIONAL DE MEXICO              000700      
000008 DATE-WRITTEN.              ENERO DE 1999.                        000800      
000009 DATE-COMPILED.                                                   000900      
000010*SECURITY.                                                        001000      
000011*--------------------------------------------------------------*  001100      
000012*                                                                 001200      
000013*     SSSS    11   55555    11        //      11    11   55555    001300      
000014*    S       1 1   5       1 1       //      1 1   1 1   5        001400      
000015*     SSS      1   5555      1      //         1     1   5555     001500      
000016*        S     1       5     1     //          1     1       5    001600      
000017*    SSSS      1   5555      1    //           1     1   5555     001700      
000018*                                                                 001800      
000019*                                                              *  001810      
000020* RECOMPILACION POR EL UPGRADE DEL MCP A 55                    *  001812      
000021* 20141208 15MTP001 MJGRG                                      *  001814      
000022*--------------------------------------------------------------*  001900      
000023/                                                                 002000      
000024*  OBJETIVO:                                                      002100      
000025*                                                                 002200      
000026*         CONTROL Y COMPENSACION REGIONAL, DE LAS OPERACIONES     002300      
000027*         REALIZADAS POR LOS SERVICIOS EN LINEA.                  002400      
000028*                                                                 002500      
000029*  ALCANCES:                                                      002600      
000030*                                                                 002700      
000031*         - INTEGRACION EN EL PROCESO DE CONTROL Y COMPENSACION,  002800      
000032*           DE LA INFORMACION QUE PROPORCIONAN LAS SIGUIENTES     002900      
000033*           FUENTES:                                              003000      
000034*                 * ENLACE DEL SISTEMA S030 PASO 120, DE CADA NODO003100      
000035*                   DEPENDIENTE DEL HOST (INFOICA).               003200      
000036*                                                                 003300      
000037*                 * ENLACE DEL SISTEMA S001 CHEQUES (LOGCCR).     003400      
000038*                                                                 003500      
000039*                 * EXTRACCION DE LA BASE DE DATOS S030ROCBD,     003600      
000040*                   A TRAVES DE LA S030/OBJECT/LIBRARY/ROC        003700      
000041*                                                                 003800      
000042*         - GENERACION DEL ARCHIVO DE INTERFASE CON EL SISTEMA    003900      
000043*           S028 PASO --010, PARA EFECTUAR EL PROCESO DE COMPENSA-004000      
000044*           CION CONTABLE REGIONAL.                               004100      
000045*                                                                 004200      
000046*         - GENERACION DEL ARCHIVO DE INTERFASE CON EL SISTEMA    004300      
000047*           S030 PASO 140, EN EL C.S.I. CORPORATIVO, PARA EL      004400      
000048*           PROCESO DE COMPENSACION CONTABLE NACIONAL.            004500      
000049*                                                                 004600      
000050*         - CONTROL DE PARTIDAS PENDIENTES DE APLICAR, QUE FUERON 004700      
000051*           AUTORIZADAS EN FECHAS ANTERIORES A LA ACTUAL.         004800      
000052*                                                                 004900      
000053*         - GENERACION DE REPORTES DE:                            005000      
000054*                 * CARATULA CON CIFRAS DE CONTROL DE ARCHIVOS.   005100      
000055*                 * COMPENSACION REGIONAL DE OPERACIONES FORANEAS.005200      
000056*                 * OPERACIONES ELIMINADAS DEL PROCESO.           005300      
000057*                 * RESUMEN DE TRANSMISION POR SISTEMAS.          005400      
000058*                 * COMPENSACION POR NODOS.                       005500      
000059*                 * OPERACIONES PENDIENTES DE APLICAR.            005600      
000060*                                                                 005700      
000061/                                                                 005800      
000062 ENVIRONMENT DIVISION.                                            005900      
000063 CONFIGURATION SECTION.                                           006000      
000064 SOURCE-COMPUTER.           A3.                                   006100      
000065 OBJECT-COMPUTER.           A3.                                   006200      
000066 INPUT-OUTPUT SECTION.                                            006300      
000067 FILE-CONTROL.                                                    006400      
000068*                                                                 006500      
000069      SELECT TANDEM                                               006600      
000070             ASSIGN TO DISK.                                      006700      
000071*                                                                 006800      
000072      SELECT SALIDA                                               006900      
000073             ASSIGN TO DISK.                                      007000      
000074*                                                                 007100      
000075     SELECT FILE1                 ASSIGN TO DISK.                 007200      
000076*                                                                 007300      
000077*ASM SELECT GUARDIANR             ASSIGN TO DISK.                 007400      
000078*                                                                 007500      
000079*ASM SELECT SISTEMAS              ASSIGN TO DISK                  007600      
000080*ASM                              ORGANIZATION IS INDEXED         007700      
000081*ASM                              ACCESS MODE  IS DYNAMIC         007800      
000082*ASM                              RECORD KEY   IS LLAVE-SISTEMAS. 007900      
000083*                                                                 008000      
000084     SELECT LOG-SORT              ASSIGN TO DISK.                 008100      
000085*                                                                 008200      
000086     SELECT LOG-TRANSMISION       ASSIGN TO DISK.                 008300      
000087*                                                                 008400      
000088*ASM SELECT PENDIENTES            ASSIGN TO DISK.                 008500      
000089*                                                                 008600      
000090     SELECT INFOICA               ASSIGN TO DISK.                 008700      
000091*                                                                 008800      
000092     SELECT TRANSMISION           ASSIGN TO DISK.                 008900      
000093*                                                                 009000      
000094     SELECT LOG-CSI               ASSIGN TO DISK.                 009100      
000095*                                                                 009200      
000096***  SELECT LOG-CCR               ASSIGN TO DISK.                 009300      
000097*                                                                 009400      
000098     SELECT LOG-ERROR             ASSIGN TO DISK.                 009500      
000099*                                                                 009600      
000100     SELECT COMPENSACION          ASSIGN TO DISK                  009700      
000101                                  ORGANIZATION IS INDEXED         009800      
000102                                  ACCESS MODE  IS DYNAMIC         009900      
000103                                  RECORD KEY   IS LLAVE-COMP.     010000      
000104*                                                                 010020      
000105     SELECT A01-CONTROL           ASSIGN TO DISK                  010040      
000106                                      ORGANIZATION IS SEQUENTIAL. 010060      
000107*                                                                 010100      
000108     SELECT SORT1-DETECTA         ASSIGN TO SORT DISK.            010200      
000109*                                                                 010300      
000110     SELECT SORT2-RESUMEN         ASSIGN TO SORT DISK.            010400      
000111*                                                                 010500      
000112     SELECT SORT3-TRANSMISION     ASSIGN TO SORT DISK.            010600      
000113*                                                                 010700      
000114     SELECT SORT4-PENDIENTES      ASSIGN TO SORT DISK.            010800      
000115*                                                                 010900      
000116     SELECT SORT5-ERRORES         ASSIGN TO SORT DISK.            011000      
000117*                                                                 011100      
000118***  SELECT REPORTE0              ASSIGN TO PRINTER.              011200      
000119*                                                                 011300      
000120***  SELECT REPORTE1              ASSIGN TO PRINTER.              011400      
000121*                                                                 011500      
000122***  SELECT REPORTE2              ASSIGN TO PRINTER.              011600      
000123*                                                                 011700      
000124***  SELECT REPORTE3              ASSIGN TO PRINTER.              011800      
000125*                                                                 011900      
000126***  SELECT REPORTE4              ASSIGN TO PRINTER.              012000      
000127*                                                                 012100      
000128***  SELECT REPORTE5              ASSIGN TO PRINTER.              012200      
000129*                                                                 012300      
000130***  SELECT REPORTE6              ASSIGN TO PRINTER.              012400      
000131*                                                                 012500      
000132***  SELECT REPORTE7              ASSIGN TO PRINTER.              012600      
000133*                                                                 012700      
000134     SELECT            V00-REPORTE2   ASSIGN TO PRINTER.          012750      
000135*                                                                 012800      
000136/                                                                 012900      
000137 DATA DIVISION.                                                   013000      
000138 FILE SECTION.                                                    013100      
000139*                                                                 013200      
000140 FD  V00-REPORTE2                                                 013220      
000141     VALUE OF TITLE WKS-TIT-REPORTE2.                             013240      
000142                                                                  013260      
000143 01  V00-R00-REPORTE2             PIC X(132).                     013280      
000144*----------------------------------------------*                  013300      
000145*   ARCHIVOS DE TANDEM                         *                  013400      
000146*----------------------------------------------*                  013500      
000147 FD TANDEM                                                        013600      
000148    VALUE OF TITLE IS WKS-ARCHIVO-TANDEM                          013700      
000149    BLOCK CONTAINS 30 RECORDS                                     013800      
000150    RECORD CONTAINS 156 CHARACTERS                                013900      
000151    DATA RECORD IS REG-TANDEM.                                    014000      
000152                                                                  014100      
000153 01 REG-TANDEM.                                                   014200      
000154    03 REGISTRO-TANDEM        PIC X(156).                         014300      
000155******                                                            014400      
000156 FD SALIDA                                                        014500      
000157    BLOCK CONTAINS 30 RECORDS                                     014600      
000158    RECORD CONTAINS 160 CHARACTERS                                014700      
000159    DATA RECORD IS REG-SALIDA.                                    014800      
000160 01 REG-SALIDA.                                                   014900      
000161    03 REGISTRO-SALIDA        PIC X(160).                         015000      
000162*                                                                 015100      
000163 FD  FILE1                                                        015200      
000164     VALUE OF DEPENDENTSPECS TRUE.                                015300      
000165 01  REG-FILE1                    PIC X(200).                     015400      
000166*                                                                 015500      
000167*************************************                             015600      
000168*   ARCHIVO DE CONTROL DE FECHAS    *                             015700      
000169*************************************                             015800      
000170 FD  A01-CONTROL                                                  015900      
000171     VALUE OF TITLE IS "(S151)S151/FILE/CONTROL/CORP."            016000      
000172     VALUE OF DEPENDENTSPECS IS TRUE.                             016100      
000173                                                                  016200      
000174 01  A01-REG-CONTROL                      PIC X(90).              016300      
000175*                                                                 016500      
000176****************************************************              016600      
000177*   SISTEMAS ... CONTROL DE APLICACIONES                          016700      
000178****************************************************              016800      
000179*ASM FD  SISTEMAS                                                 016900      
000180*ASM                  BLOCK  CONTAINS  10 RECORDS                 017000      
000181*ASM                  RECORD CONTAINS  48 CHARACTERS              017100      
000182*ASM                  VALUE OF TITLE NOMBRE-SISTEMAS              017200      
000183*ASM                  DATA RECORD IS REG-SISTEMAS.                017300      
000184*ASM  01  REG-SISTEMAS.                                           017400      
000185*ASM  02 LLAVE-SISTEMAS.                                          017500      
000186*ASM     03 RG-APL                PIC 9(04).                      017600      
000187*ASM     03 FILLER                PIC 9(02).                      017700      
000188*ASM  02 RESTO-SISTEMAS           PIC X(42).                      017800      
000189*                                                                 017900      
000190/***************************************************              018000      
000191*   INFORMACION EXTRAIDA DE I.C.A. EN CADA NODO    *              018100      
000192*   O HOST DONDE SE ENCUENTRE ESTE                 *              018200      
000193****************************************************              018300      
000194 FD  INFOICA                                                      018400      
000195     BLOCK  CONTAINS  30 RECORDS                                  018500      
000196     RECORD CONTAINS 160 CHARACTERS                               018600      
000197     VALUE OF TITLE NOMBRE-INFOICA                                018700      
000198     DATA RECORD IS REG-INFOICA.                                  018800      
000199 01  REG-INFOICA                  PIC  X(160).                    018900      
000200*                                                                 019000      
000201****************************************************              019100      
000202*   ARCHIVO DE INTERFASE CON EL SISTEMA S028       *              019200      
000203*   PARA EL PROCESO DE COMPENSACION REGIONAL       *              019300      
000204****************************************************              019400      
000205 FD  TRANSMISION                                                  019500      
000206     BLOCK  CONTAINS  15 RECORDS                                  019600      
000207     RECORD CONTAINS  60 CHARACTERS                               019700      
000208      VALUE OF TITLE "S151/FILE/E01/TRANSMISION"                  019800      
000209     DATA RECORD IS REG-E01-TRANSMISION.                          019900      
000210 01  REG-E01-TRANSMISION          PIC  X(060).                    020000      
000211*                                                                 020100      
000212****************************************************              020200      
000213*   LOG DE MOVIMIENTOS QUE SE ENVIA AL C.S.I.      *              020300      
000214*   CORPORATIVO PARA LA COMPENSACION NACIONAL      *              020400      
000215****************************************************              020500      
000216 FD  LOG-CSI                                                      020600      
000217     BLOCK  CONTAINS  10 RECORDS                                  020700      
000218     RECORD CONTAINS 160 CHARACTERS                               020800      
000219     VALUE OF TITLE NOMBRE-LOGCSI                                 020900      
000220     DATA RECORD IS REG-LOG-CSI .                                 021000      
000221 01  REG-LOG-CSI                  PIC  X(160).                    021100      
000222*                                                                 021200      
000223/***************************************************              021300      
000224*    LOG PARA SORTS ... 1 = DETECCION ERRORES DE   *              021400      
000225*                           DIALOGO, DUPLICADOS O  *              021500      
000226*                           ANULADOS.              *              021600      
000227*                   ... 2 = GENERACION DE LOGCSI   *              021700      
000228*                           Y REP. DE COMPENSACION *              021800      
000229****************************************************              021900      
000230*                                                                 022000      
000231 FD  LOG-SORT                                                     022100      
000232     BLOCK  CONTAINS  40 RECORDS                                  022200      
000233     RECORD CONTAINS 160 CHARACTERS                               022300      
000234      VALUE OF TITLE "S151/FILE/LOGSORT"                          022400      
000235     DATA RECORD IS REG-LOG-SORT.                                 022500      
000236 01  REG-LOG-SORT                 PIC  X(160).                    022600      
000237*                                                                 022700      
000238****************************************************              022800      
000239*    LOG PARA SORTS ... 1 = REPORTE POR SISTEMA    *              022900      
000240*    TRANSMISION    ... 2 = REPORTE POR NODO       *              023000      
000241*                   ... 3 = GENERACION DE ENLACE   *              023100      
000242*                           CON EL SISTEMA S028    *              023200      
000243****************************************************              023300      
000244*                                                                 023400      
000245 FD  LOG-TRANSMISION                                              023500      
000246     BLOCK  CONTAINS  40 RECORDS                                  023600      
000247     RECORD CONTAINS  42 CHARACTERS                               023700      
000248      VALUE OF TITLE "S151/FILE/LOGTRANSMISION"                   023800      
000249     DATA RECORD IS REG-LOG-TRANSMISION.                          023900      
000250 01  REG-LOG-TRANSMISION          PIC  X(42).                     024000      
000251*                                                                 024100      
000252****************************************************              024200      
000253*    RECOLECCION ERRORES EN MENSAJES               *              024300      
000254****************************************************              024400      
000255*                                                                 024500      
000256 FD  LOG-ERROR                                                    024600      
000257     BLOCK  CONTAINS  40 RECORDS                                  024700      
000258     RECORD CONTAINS 180 CHARACTERS                               024800      
000259      VALUE OF TITLE "S151/FILE/LOGERROR"                         024900      
000260     DATA RECORD IS REG-ERRORES.                                  025000      
000261 01  REG-ERRORES.                                                 025100      
000262     03 RE-REG-ERROR              PIC  X(160).                    025200      
000263     03 RE-TIPO-ERROR             PIC  X(012).                    025300      
000264     03 FILLER                    PIC  X(008).                    025400      
000265*                                                                 025500      
000266*                                                                 025600      
000267/***********************************************************      025700      
000268*    ARCHIVO QUE CONSERVA PARTIDAS PENDIENTES DE APLICAR   *      025800      
000269************************************************************      025900      
000270*                                                                 026000      
000271*ASM FD  PENDIENTES                                               026100      
000272*ASM BLOCK  CONTAINS  40 RECORDS                                  026200      
000273*ASM RECORD CONTAINS 160 CHARACTERS                               026300      
000274*ASM VALUE OF TITLE "S151/FILE/PENDIENTES"                        026400      
000275*ASM DATA RECORD IS REG-PENDIENTES.                               026500      
000276*ASM 01  REG-PENDIENTES               PIC  X(160).                026600      
000277*                                                                 026700      
000278*                                                                 026800      
000279*********************************************************         026900      
000280*    ARCHIVO DE MANIOBRA PARA EL RESUMEN POR SISTEMA    *         027000      
000281*********************************************************         027100      
000282*                                                                 027200      
000283 FD  COMPENSACION                                                 027300      
000284     BLOCK  CONTAINS  12 RECORDS                                  027400      
000285     RECORD CONTAINS  72 CHARACTERS                               027500      
000286     DATA RECORD IS REG-COMPENSACION                              027600      
000287     VALUE OF                                                     027700      
000288             AREAS    IS 20                                       027800      
000289             AREASIZE IS 84                                       027900      
000290              TITLE    "S151/FILE/MANIOBRA130".                   028000      
000291*                                                                 028100      
000292 01  REG-COMPENSACION.                                            028200      
000293     02  LLAVE-COMP.                                              028300      
000294         03 FECHA-COMP            PIC 9(06).                      028400      
000295         03 CSI-LOCAL-COMP        PIC 9(02).                      028500      
000296            88 LOCAL-COMP-VALIDO  VALUES ARE 1,2,4,6,10.          028600      
000297         03 MONEDA-COMP           PIC 9(03).                      028700      
000298            88 MON-COMP-VALIDO    VALUES ARE 1 THRU 999.          028800      
000299         03 APL-ORI-COMP          PIC 9(04).                      028900      
000300            88 APL-ORI-VALIDO     VALUES ARE 1 THRU 9999.         029000      
000301         03 CSI-FORANEO-COMP      PIC 9(02).                      029100      
000302            88 FORAN-COMP-VALIDO  VALUES ARE 1,2,4,6,10.          029200      
000303         03 FILLER                PIC 9(01).                      029300      
000304     02  CIFRAS-COMP              COMP.                           029400      
000305         03 OPER-APLI-COMP        OCCURS   2 TIMES.               029500      
000306             04 NUM-CARGOS-COMP   PIC S9(07).                     029600      
000307             04 NUM-ABONOS-COMP   PIC S9(07).                     029700      
000308             04 IMP-CARGOS-COMP   PIC S9(15)V9(02).               029800      
000309             04 IMP-ABONOS-COMP   PIC S9(15)V9(02).               029900      
000310     02  OTROS-DATOS-COMP.                                        030000      
000311         03 DUMMY-COMP            PIC 9(02).                      030100      
000312*                                                                 030200      
000313/                                                                 030300      
000314*--------------------------------------------------------------*  030400      
000315*          DESCRIPCION DEL ARCHIVO " P R I N T E R "           *  030500      
000316*--------------------------------------------------------------*  030600      
000317*                                                                 030700      
000318*FD  REPORTE0                                                     030800      
000319***  VALUE OF TITLE IS WS-NOMB-REPORTE                            030900      
000320***           USERBACKUPNAME TRUE                                 031000      
000321***  DATA RECORD IS LREP0.                                        031100      
000322*01  LREP0                        PIC X(132).                     031200      
000323*                                                                 031300      
000324*FD  REPORTE1                                                     031400      
000325***  VALUE OF TITLE IS WS-NOMB-REPORTE                            031500      
000326***           USERBACKUPNAME TRUE                                 031600      
000327***  DATA RECORD IS LREP1.                                        031700      
000328*01  LREP1                        PIC X(132).                     031800      
000329*                                                                 031900      
000330*FD  REPORTE2                                                     032000      
000331***  VALUE OF TITLE IS WS-NOMB-REPORTE                            032100      
000332***           USERBACKUPNAME TRUE                                 032200      
000333***  DATA RECORD IS LREP2.                                        032300      
000334*01  LREP2                        PIC X(132).                     032400      
000335*                                                                 032500      
000336*FD  REPORTE3                                                     032600      
000337***  VALUE OF TITLE IS WS-NOMB-REPORTE                            032700      
000338***           USERBACKUPNAME TRUE                                 032800      
000339***  DATA RECORD IS LREP3.                                        032900      
000340*01  LREP3                        PIC X(132).                     033000      
000341/                                                                 033100      
000342*FD  REPORTE4                                                     033200      
000343***  VALUE OF TITLE IS WS-NOMB-REPORTE                            033300      
000344***           USERBACKUPNAME TRUE                                 033400      
000345***  DATA RECORD IS LREP4.                                        033500      
000346*01  LREP4                        PIC X(132).                     033600      
000347*                                                                 033700      
000348*FD  REPORTE5                                                     033800      
000349***  VALUE OF TITLE IS WS-NOMB-REPORTE                            033900      
000350***           USERBACKUPNAME TRUE                                 034000      
000351***  DATA RECORD IS LREP5.                                        034100      
000352*01  LREP5                        PIC X(132).                     034200      
000353*                                                                 034300      
000354*FD  REPORTE6                                                     034400      
000355***  VALUE OF TITLE IS WS-NOMB-REPORTE                            034500      
000356***           USERBACKUPNAME TRUE                                 034600      
000357***  DATA RECORD IS LREP6.                                        034700      
000358*01  LREP6                        PIC X(132).                     034800      
000359*                                                                 034900      
000360*FD  REPORTE7                                                     035000      
000361***  VALUE OF TITLE IS WS-NOMB-REPORTE                            035100      
000362***           USERBACKUPNAME TRUE                                 035200      
000363***  DATA RECORD IS LREP7.                                        035300      
000364*01  LREP7                        PIC X(132).                     035400      
000365*                                                                 035500      
000366/--------------------------------------------------------------*  035600      
000367*          DESCRIPCION DEL ARCHIVO DE SORT                     *  035700      
000368*--------------------------------------------------------------*  035800      
000369 SD SORT1-DETECTA.                                                035900      
000370 01 REG-SORT1.                                                    036000      
000371    03 RS1-DETECTA                PIC X(240).                     036100      
000372    03 RS1-DETECTA-R              REDEFINES RS1-DETECTA.          036200      
000373       05 RS1-LLAVE               PIC X(072).                     036300      
000374       05 RS1-RESTO               PIC X(160).                     036400      
000375       05 FILLER                  PIC X(008).                     036500      
000376*                                 ---------------------           036600      
000377*                 TAMA\O          240 CARACTERES = 40 PALABRAS    036700      
000378*                                                                 036800      
000379 SD SORT2-RESUMEN.                                                036900      
000380 01 REG-SORT2.                                                    037000      
000381    03 RS2-RESUMEN                PIC X(180).                     037100      
000382    03 RS2-RESUMEN-R              REDEFINES RS2-RESUMEN.          037200      
000383       05 RS2-LLAVE               PIC X(018).                     037300      
000384       05 RS2-RESTO               PIC X(160).                     037400      
000385       05 FILLER                  PIC X(002).                     037500      
000386*                                 ---------------------           037600      
000387*                 TAMA\O          180 CARACTERES = 30 PALABRAS    037700      
000388*                                                                 037800      
000389 SD SORT3-TRANSMISION.                                            037900      
000390 01 REG-SORT3.                                                    038000      
000391    03 RS3-TRANSMISION            PIC X(42).                      038100      
000392    03 RS3-TRANSMISION-R          REDEFINES RS3-TRANSMISION.      038200      
000393       05 RS3-LLAVE               PIC X(18).                      038300      
000394       05 RS3-RESTO               PIC X(24).                      038400      
000395*                                 ----------------------------    038500      
000396*                 TAMA\O           42 CARACTERES =  7 PALABRAS    038600      
000397*                                                                 038700      
000398 SD SORT4-PENDIENTES.                                             038800      
000399 01 REG-SORT4.                                                    038900      
000400    03 RS4-PENDIENTES             PIC X(180).                     039000      
000401    03 RS4-PENDIENTES-R           REDEFINES RS4-PENDIENTES.       039100      
000402       05 RS4-LLAVE               PIC X(018).                     039200      
000403       05 RS4-RESTO               PIC X(160).                     039300      
000404       05 FILLER                  PIC X(002).                     039400      
000405*                                 ----------------------------    039500      
000406*                 TAMA\O          180 CARACTERES = 30 PALABRAS    039600      
000407*                                                                 039700      
000408 SD SORT5-ERRORES.                                                039800      
000409 01 REG-SORT5.                                                    039900      
000410    03 RS5-ERRORES                PIC X(210).                     040000      
000411    03 RS5-ERRORES-R              REDEFINES RS5-ERRORES.          040100      
000412       05 RS5-LLAVE               PIC X(042).                     040200      
000413       05 RS5-RESTO               PIC X(168).                     040300      
000414*                                 ----------------------          040400      
000415*                 TAMA\O          210 CARACTERES = 35 PALABRAS    040500      
000416*                                                                 040600      
000417/=======================                                          040700      
000418 WORKING-STORAGE SECTION.                                         040800      
000419*=======================                                          040900      
000420*--------------------------------------------------------*        041000      
000421* VARIABLES PARA EL CAMBIO DE NOMBRE DE ARCH DE TANDEM   *        041100      
000422*--------------------------------------------------------*        041200      
000423*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000424* COPY "(S151)S151/FORMATO/DISPLAY.".                             041250      
000425                                                                  000100      
000426*===============================================================* 000200      
000427*         FORMATO PARA DISPLAYS                                 * 000300      
000428*===============================================================* 000400      
000429                                                                  000500      
000430 01 WKS-TIT-REPORTE2.                                             000600      
000431    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000432    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000433    02 FILLER                       PIC X(06) VALUE               000900      
000434                                              "/LIST/".           001000      
000435    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000436    02 FILLER                       PIC X(01) VALUE "/".          001071      
000437    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000438    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000439    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000440    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000441    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000442    02 FILLER                       PIC X(11) VALUE               001600      
000443                                              "/001MSGIMP.".      001700      
000444                                                                  002100      
000445 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000446                                                                  002300      
000447***********************************************************       002400      
000448*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000449***********************************************************       002600      
000450 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000451*8D                                                               002800      
000452 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000453 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000454    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000455    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000456    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000457*8D                                                               003400      
000458 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000459 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000460    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000461    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000462    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000463                                                                  004100      
000464 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000465                                                                  004300      
000466 01 WKS-FECHA-HORA2.                                              004400      
000467    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000468    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000469       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000470       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000471    02 WKS-TIME-MAQ2.                                             004600      
000472       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
000473       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
000474          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
000475          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
000476          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
000477       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
000478    02 FILLER                             PIC X(01).              004900      
000479    02 WKS-RESTO2                         PIC X(04).              005000      
000480                                                                  005100      
000481*8D                                                               005200      
000482****************** REPORTE DE MENSAJES *********************      005300      
000483 01 WLI-ENCAB-12.                                                 005400      
000484    03 FILLER                             PIC X(05) VALUE         005500      
000485       "S151-".                                                   005600      
000486    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000487    03 FILLER                             PIC X(15) VALUE         005671      
000488       "-001IMPMENSAJES".                                         005691      
000489    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000490    03 FILLER                             PIC X(34) VALUE         005800      
000491       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000492    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000493    03 FILLER                             PIC X(26) VALUE         006100      
000494       "FECHA DE LA INFORMACION : ".                              006200      
000495    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000496    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000497       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000498       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000499       05  WKS-SLASH1                         PIC X(01).          006356      
000500       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000501       05  WKS-SLASH2                         PIC X(01).          006358      
000502       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000503 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000504 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000505    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000506    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000507    03 FILLER                          PIC X(01).                 006371      
000508    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000509    03 FILLER                          PIC X(01).                 006381      
000510    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000511*8D                                                               006400      
000512 01 WLI-ENCAB-22.                                                 006500      
000513     03 FILLER                          PIC X(11) VALUE           006600      
000514        "F.PROCESO: ".                                            006700      
000515     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000516     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000517     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
000518     03 FILLER                          PIC X(01) VALUE ":".      007020      
000519     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
000520     03 FILLER                          PIC X(01) VALUE ":".      007060      
000521     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
000522     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000523     03 FILLER                          PIC X(24) VALUE           007200      
000524              "IMPRESION MENSAJES DEL S".                         007300      
000525     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000526     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000527     03 FILLER                          PIC X(14) VALUE           007600      
000528        "TIPO PROCESO: ".                                         007700      
000529     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000530*8D                                                               007900      
000531 01 WLI-ENCAB-32.                                                 008000      
000532     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000533*       "VERSION  : ".                                            008200      
000534*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000535     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000536     03 FILLER                     PIC X(07) VALUE                008500      
000537        "HOJA : ".                                                008600      
000538     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000539                                                                  008800      
000540 01 WLI-ENCAB-42.                                                 008900      
000541     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000542     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000543     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000544                                                                  009300      
000545 01 WLI-ENCAB-52.                                                 009400      
000546    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000547    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000548    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000549    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000550                                                                  009900      
000551*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
000552 01 WLI-ENCAB-62.                                                 009910      
000553    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
000554    03 WLI-RESULT                 PIC X(04).                      009920      
000555    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
000556    03 WLI-TEXTO                  PIC X(110).                     009930      
000557                                                                  009935      
000558 01 WLI-TOT-ENVIO.                                                009940      
000559    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
000560    03 FILLER                     PIC X(37) VALUE                 009950      
000561       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
000562    03 WLI-ENV-CTD                PIC X(04).                      009960      
000563*FIN - INFOWARE                                                   009970      
000564****************************************************************  010000      
000565*                 CONTADORES DE HOJAS                          *  010100      
000566****************************************************************  010200      
000567                                                                  010300      
000568  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000569*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000570 77 WS-FIN-PROC-TANDEM               PIC  9(01) VALUE 0.          041300      
000571    88 FIN-PROC-TANDEM        VALUE 1.                            041400      
000572 77 W77-FECHA-PROC                   PIC 9(08).                   041500      
000573*77 WS-FUNCION                       PIC S9(11) BINARY.           041600      
000574 77 W77-STATUS                       PIC  9(04).                  041700      
000575 77 W77-VALUE                        PIC  9(08).                  041800      
000576                                                                  041900      
000577 01 WKS-ARCHIVO-TANDEM.                                           041910      
000578    03 WKS-NOMBRE-ENT           PIC X(017)                        041915      
000579                                VALUE "S151/FILE/TANDEM/".        041920      
000580    03 WKS-FECHA-PROCESO        PIC 9(06).                        041925      
000581    03 FILLER                   PIC X(01) VALUE ".".              041930      
000582                                                                  041935      
000583 01 WS-REG-FECHA-TANDEM         PIC X(156).                       042000      
000584                                                                  042100      
000585 01 WS-REG-FECHA-TANDEM-R REDEFINES WS-REG-FECHA-TANDEM.          042200      
000586    02 WS-NOM-ARCH-SALIDA.                                        042300      
000587       03 WS-NOMBRE-TANDEM       PIC X(036).                      042400      
000588       03 WS-PUNTO               PIC X(001).                      042500      
000589    02 FILLER                    PIC X(119).                      042600      
000590*                                                                 042700      
000591 01 WS-REG-SORT1.                                                 042800      
000592    03 WS-RS1-DETECTA             PIC X(240).                     042900      
000593    03 WS-RS1-DETECTA-R           REDEFINES WS-RS1-DETECTA.       043000      
000594       05 WS-RS1-LLAVE.                                           043100      
000595          07 WS-RS1-CVE-MON       PIC 9(03)       COMP.           043200      
000596          07 WS-RS1-CSI-ORI       PIC 9(02)       COMP.           043300      
000597          07 WS-RS1-APL-ORI       PIC 9(04)       COMP.           043400      
000598          07 WS-RS1-CSI-DES       PIC 9(02)       COMP.           043500      
000599          07 WS-RS1-APL-DES       PIC 9(04)       COMP.           043600      
000600          07 FILLER               PIC 9(01)       COMP.           043700      
000601          07 WS-RS1-STA-NAME      PIC X(08).                      043800      
000602          07 WS-RS1-ID-CTA        PIC X(20).                      043900      
000603          07 WS-RS1-N-AUTOR       PIC X(20).                      044000      
000604          07 WS-RS1-IMP-MOV       PIC 9(16)V99    COMP.           044100      
000605          07 WS-RS1-TIPO-MOV      PIC 9(02)       COMP.           044200      
000606          07 WS-RS1-STATUS        PIC 9(02)       COMP.           044300      
000607          07 WS-RS1-HORA-GEN      PIC 9(06)       COMP.           044400      
000608          07 FILLER               PIC X(02).                      044500      
000609       05 WS-RS1-RESTO            PIC X(160).                     044600      
000610       05 FILLER                  PIC X(08).                      044700      
000611*                                                                 044800      
000612*                                                                 044900      
000613 01 WS-REG-SORT2.                                                 045000      
000614    03 WS-RS2-RESUMEN             PIC X(180).                     045100      
000615    03 WS-RS2-RESUMEN-R           REDEFINES WS-RS2-RESUMEN.       045200      
000616       05 WS-RS2-LLAVE.                                           045300      
000617          07 WS-RS2-FECHA         PIC  9(006).                    045400      
000618          07 WS-RS2-CSI-ORI       PIC  9(002).                    045500      
000619          07 WS-RS2-CVE-MON       PIC  9(003).                    045600      
000620          07 WS-RS2-APL-ORI       PIC  9(004).                    045700      
000621          07 WS-RS2-CSI-DES       PIC  9(002).                    045800      
000622          07 FILLER               PIC  9(001).                    045900      
000623       05 WS-RS2-RESTO            PIC  X(160).                    046000      
000624       05 FILLER                  PIC  X(002).                    046100      
000625*                                                                 046200      
000626 01 WS-REG-SORT2-ANT.                                             046300      
000627    03 WS-RS2-RESUMEN-ANT         PIC X(180).                     046400      
000628    03 WS-RS2-RESUMEN-ANT-R       REDEFINES WS-RS2-RESUMEN-ANT.   046500      
000629       05 WS-RS2-LLAVE-ANT.                                       046600      
000630          07 WS-RS2-FECHA-ANT     PIC  9(006).                    046700      
000631          07 WS-RS2-CSI-ORI-ANT   PIC  9(002).                    046800      
000632          07 WS-RS2-CVE-MON-ANT   PIC  9(003).                    046900      
000633          07 WS-RS2-APL-ORI-ANT   PIC  9(004).                    047000      
000634          07 WS-RS2-CSI-DES-ANT   PIC  9(002).                    047100      
000635          07 FILLER               PIC  9(001).                    047200      
000636       05 WS-RS2-RESTO-ANT        PIC  X(160).                    047300      
000637       05 FILLER                  PIC  X(002).                    047400      
000638/                                                                 047500      
000639 01 WS-REG-SORT3.                                                 047600      
000640    03 WS-RS3-TRANSMISION         PIC X(42).                      047700      
000641    03 WS-RS3-TRANSMISION-R       REDEFINES WS-RS3-TRANSMISION.   047800      
000642       05 WS-RS3-LLAVE.                                           047900      
000643          07 WS-RS3-TIPO-REP      PIC 9(01).                      048000      
000644             88 RS3-REP-TRNSXSIS  VALUE 1.                        048100      
000645             88 RS3-REP-COMPXNOD  VALUE 2.                        048200      
000646             88 RS3-REP-ENLACE    VALUE 3.                        048300      
000647          07 WS-RS3-LLAVE-REP1.                                   048400      
000648             09 WS-RS3-FEC-CON    PIC 9(06).                      048500      
000649             09 WS-RS3-APL-ORI    PIC 9(04).                      048600      
000650             09 WS-RS3-AMBITO     PIC 9(01).                      048700      
000651                88 RS3-LOCAL      VALUE 1.                        048800      
000652                88 RS3-FORANEO    VALUE 2.                        048900      
000653                88 RS3-PENDIENTE  VALUE 3.                        049000      
000654             09 FILLER            PIC 9(06).                      049100      
000655          07 WS-RS3-LLAVE-REP2    REDEFINES WS-RS3-LLAVE-REP1.    049200      
000656             09 WS-RS3-NOD-ORI    PIC 9(03).                      049300      
000657             09 WS-RS3-STA-NAME   PIC X(08).                      049400      
000658             09 FILLER            PIC 9(06).                      049500      
000659          07 WS-RS3-LLAVE-REP3    REDEFINES WS-RS3-LLAVE-REP1.    049600      
000660             09 WS-RS3-SISTEMA    PIC 9(04) COMP.                 049700      
000661             09 WS-RS3-SUCURSAL   PIC 9(04).                      049800      
000662             09 WS-RS3-TERMINAL   PIC X(08).                      049900      
000663             09 WS-RS3-MONEDA     PIC 9(03).                      050000      
000664       05 WS-RS3-RESTO.                                           050100      
000665          07 WS-RS3-COD-SER       PIC 9(02).                      050200      
000666             88 RS3-COD-SER-CARGO     VALUE 10.                   050300      
000667             88 RS3-COD-SER-ABONO     VALUE 20.                   050400      
000668             88 RS3-COD-SER-ELIMCARGO VALUE 11.                   050500      
000669             88 RS3-COD-SER-ELIMABONO VALUE 21.                   050600      
000670          07 WS-RS3-IMP-TRN       PIC 9(16)V99.                   050700      
000671          07 FILLER               PIC 9(04).                      050800      
000672/                                                                 050900      
000673 01 WS-REG-SORT3-ANT.                                             051000      
000674    03 WS-RS3-TRANSMISION-ANT     PIC X(42).                      051100      
000675    03 WS-RS3-TRANSMISION-ANT-R  REDEFINES WS-RS3-TRANSMISION-ANT.051200      
000676       05 WS-RS3-LLAVE-ANT.                                       051300      
000677          07 WS-RS3-TIPO-REP-ANT    PIC 9(01).                    051400      
000678             88 RS3-REP-TRNSXSIS-A  VALUE 1.                      051500      
000679             88 RS3-REP-COMPXNOD-A  VALUE 2.                      051600      
000680          07 WS-RS3-LLAVE-REP1-ANT.                               051700      
000681             09 WS-RS3-FEC-CON-ANT  PIC 9(06).                    051800      
000682             09 WS-RS3-APL-ORI-ANT  PIC 9(04).                    051900      
000683             09 WS-RS3-AMBITO-ANT   PIC 9(01).                    052000      
000684                88 RS3-LOCAL-A      VALUE 1.                      052100      
000685                88 RS3-FORANEO-A    VALUE 2.                      052200      
000686                88 RS3-PENDIENTE-A  VALUE 3.                      052300      
000687             09 FILLER              PIC 9(06).                    052400      
000688          07 WS-RS3-LLAVE-REP2-ANT  REDEFINES                     052500      
000689                                    WS-RS3-LLAVE-REP1-ANT.        052600      
000690             09 WS-RS3-NOD-ORI-ANT  PIC 9(03).                    052700      
000691             09 WS-RS3-STA-NAME-ANT PIC X(08).                    052800      
000692             09 FILLER              PIC 9(06).                    052900      
000693          07 WS-RS3-LLAVE-REP3-ANT  REDEFINES                     053000      
000694                                    WS-RS3-LLAVE-REP1-ANT.        053100      
000695             09 WS-RS3-SISTEMA-ANT  PIC 9(04) COMP.               053200      
000696             09 WS-RS3-SUCURSAL-ANT PIC 9(04).                    053300      
000697             09 WS-RS3-TERMINAL-ANT PIC X(08).                    053400      
000698             09 WS-RS3-MONEDA-ANT   PIC 9(03).                    053500      
000699       05 WS-RS3-RESTO-ANT        PIC X(24).                      053600      
000700*                                                                 053700      
000701*                                                                 053800      
000702 01 WS-REG-SORT4.                                                 053900      
000703    03 WS-RS4-PENDIENTES          PIC X(180).                     054000      
000704    03 WS-RS4-PENDIENTES-R        REDEFINES WS-RS4-PENDIENTES.    054100      
000705       05 WS-RS4-LLAVE.                                           054200      
000706          07 WS-RS4-FEC-CON       PIC 9(008).                     054300      
000707          07 WS-RS4-APL-ORI       PIC 9(004).                     054400      
000708          07 WS-RS4-STA-NAME      PIC X(008).                     054500      
000709       05 WS-RS4-RESTO            PIC X(160).                     054600      
000710*                                                                 054700      
000711 01 WS-REG-SORT4-ANT.                                             054800      
000712    03 WS-RS4-PENDIENTES-ANT      PIC X(180).                     054900      
000713    03 WS-RS4-PENDIENTES-ANT-R    REDEFINES WS-RS4-PENDIENTES-ANT.055000      
000714       05 WS-RS4-LLAVE-ANT.                                       055100      
000715          07 WS-RS4-FEC-CON-ANT   PIC 9(008).                     055200      
000716          07 WS-RS4-APL-ORI-ANT   PIC 9(004).                     055300      
000717          07 WS-RS4-STA-NAME-ANT  PIC X(008).                     055400      
000718       05 WS-RS4-RESTO-ANT        PIC X(160).                     055500      
000719*                                                                 055600      
000720/                                                                 055700      
000721 01 WS-REG-SORT5.                                                 055800      
000722    03 WS-RS5-ERRORES             PIC X(216).                     055900      
000723    03 WS-RS5-ERRORES-R           REDEFINES WS-RS5-ERRORES.       056000      
000724       05 WS-RS5-LLAVE.                                           056100      
000725          07 WS-RS5-CVE-MON       PIC 9(003).                     056200      
000726          07 WS-RS5-CSI-ORI       PIC 9(002).                     056300      
000727          07 WS-RS5-APL-ORI       PIC 9(004).                     056400      
000728          07 WS-RS5-CSI-DES       PIC 9(002).                     056500      
000729          07 WS-RS5-APL-DES       PIC 9(004)      COMP.           056600      
000730          07 WS-RS5-STATUS        PIC 9(002)      COMP.           056700      
000731          07 WS-RS5-STA-NAME      PIC X(008).                     056800      
000732          07 WS-RS5-N-AUTOR       PIC X(020).                     056900      
000733       05 WS-RS5-RESTO            PIC X(160).                     057000      
000734       05 WS-RS5-TIPO-ERROR       PIC X(012).                     057100      
000735       05 FILLER                  PIC X(002).                     057200      
000736*                                                                 057300      
000737 01 WS-REG-SORT5-ANT.                                             057400      
000738    03 WS-RS5-ERRORES-ANT         PIC X(216).                     057500      
000739    03 WS-RS5-ERRORES-ANT-R       REDEFINES WS-RS5-ERRORES-ANT.   057600      
000740       05 WS-RS5-LLAVE-ANT.                                       057700      
000741          07 WS-RS5-CVE-MON-ANT   PIC 9(003).                     057800      
000742          07 WS-RS5-CSI-ORI-ANT   PIC 9(002).                     057900      
000743             88 RS5-CSI-ORI-ANT   VALUES ARE 1,2,4,6,10.          058000      
000744          07 WS-RS5-APL-ORI-ANT   PIC 9(004).                     058100      
000745          07 WS-RS5-CSI-DES-ANT   PIC 9(002).                     058200      
000746             88 RS5-CSI-DES-ANT   VALUES ARE 1,2,4,6,10.          058300      
000747          07 WS-RS5-APL-DES-ANT   PIC 9(004)      COMP.           058400      
000748          07 WS-RS5-STATUS-ANT    PIC 9(002)      COMP.           058500      
000749          07 WS-RS5-STA-NAME-ANT  PIC X(008).                     058600      
000750          07 WS-RS5-N-AUTOR-ANT   PIC X(020).                     058700      
000751       05 WS-RS5-RESTO-ANT        PIC X(160).                     058800      
000752       05 WS-RS5-TIPO-ERROR-ANT   PIC X(012).                     058900      
000753       05 FILLER                  PIC X(002).                     059000      
000754*                                                                 059100      
000755*                                                                 059200      
000756 01  WS-DATOS-SORTS.                                              059300      
000757     03  WS-MEM-SIZE              PIC 9(10) VALUE 0.              059400      
000758     03  WS-DISK-SIZE             PIC 9(10) VALUE 0.              059500      
000759     03  WS-ULTREG-LOG-SORT1      PIC 9(10) VALUE 0.              059600      
000760     03  WS-ULTREG-LOG-SORT2      PIC 9(10) VALUE 0.              059700      
000761     03  WS-ULTREG-LOG-SORT3      PIC 9(10) VALUE 0.              059800      
000762     03  WS-ULTREG-LOG-SORT4      PIC 9(10) VALUE 0.              059900      
000763     03  WS-ULTREG-LOG-SORT5      PIC 9(10) VALUE 0.              060000      
000764     03  WS-REGSIZE-LOG-SORT1     PIC 9(02) VALUE 40.             060100      
000765     03  WS-REGSIZE-LOG-SORT2     PIC 9(02) VALUE 30.             060200      
000766     03  WS-REGSIZE-LOG-SORT3     PIC 9(02) VALUE  7.             060300      
000767     03  WS-REGSIZE-LOG-SORT4     PIC 9(02) VALUE 30.             060400      
000768     03  WS-REGSIZE-LOG-SORT5     PIC 9(02) VALUE 35.             060500      
000769     03  WS-CT1-MSIZE             PIC 9(02) VALUE 03.             060600      
000770     03  WS-CT2-MSIZE             PIC 9(04) VALUE 1200.           060700      
000771     03  WS-CT3-MSIZE             PIC 9(04) VALUE 1500.           060800      
000772                                                                  060805      
000773 01  WKS-REG-HD-CONTROL.                                          060810      
000774     03  WKS-HD-CSI       PIC 9(02).                              060815      
000775     03  WKS-HD-FECPRO    PIC 9(08).                              060820      
000776     03  FILLER           PIC X(80).                              060825      
000777                                                                  060830      
000778 01  WKS-REG-DET-CONTROL.                                         060835      
000779     03  WKS-DET-SIST     PIC 9(03).                              060840      
000780     03  WKS-DET-FECPRO   PIC 9(08).                              060845      
000781     03  WKS-DET-INDPF    PIC 9(01).                              060850      
000782/                                                                 060900      
000783 77 WS-FORMATO                    PIC S9(11) BINARY.              061000      
000784 77 WS-FUNCION                    PIC S9(11) BINARY.              061100      
000785 77 WS-FECHA1                     PIC  X(08).                     061200      
000786 77 WS-FECHA1-NUM                 REDEFINES WS-FECHA1             061300      
000787                                  PIC 9(08).                      061400      
000788 77 WS-FECHA2                     PIC 9(08).                      061500      
000789*ASM 77 WS-FECMAX-ANTIGUEDAD          PIC 9(08).                  061600      
000790*                                                                 061700      
000791 77 WS-SECUENCIA-BASE             PIC 9(11) BINARY VALUE ZEROES.  061800      
000792 77 WS-FECHA-BASE                 PIC 9(11) BINARY VALUE ZEROES.  061900      
000793*                                                                 062000      
000794 77 W77-JUL-YY4                    PIC 9(4).                      062020      
000795                                                                  062040      
000796 01 WS-REG-LOG-FILE.                                              062100      
000797     02  HEADER-LOG.                                              062200      
000798         03 PREFIJO-H-LOG            PIC X(01).                   062300      
000799         03 APL-DEST-H-LOG           PIC X(01).                   062400      
000800         03 CCR-DEST-H-LOG           PIC 9(02).                   062500      
000801            88 VERI-CCR-DEST VALUES 1 2 4 6 10.                   062600      
000802         03 LSN-ORIG-H-LOG           PIC 9(04).                   062700      
000803         03 RSN-ORIG-H-LOG           PIC X(08).                   062800      
000804         03 RSN-ORIG-H-LOG-R         REDEFINES RSN-ORIG-H-LOG.    062900      
000805            05 FILLER                PIC  XX.                     063000      
000806            05 RSN-CCR-ORIG-SUCOPE   PIC  9(3).                   063100      
000807            05 RSN-CCR-ORIG-CAJA     PIC  X(3).                   063200      
000808            05 RSN-CCR-ORIG-CAJA-R   REDEFINES RSN-CCR-ORIG-CAJA. 063300      
000809               07 FILLER             PIC X(01).                   063400      
000810               07 RSN-CCR-ORIG-NCAJA PIC 9(02).                   063500      
000811         03 CCR-ORIG-H-LOG           PIC 9(02).                   063600      
000812            88 VERI-CCR-ORIG VALUES 1 2 4 6 10.                   063700      
000813         03 NCPO-H-LOG               PIC 9(02).                   063800      
000814         03 NCSO-H-LOG               PIC 9(02).                   063900      
000815         03 APL-ORIG-H-LOG           PIC X(01).                   064000      
000816         03 RS-PROC-H-LOG            PIC 9(02).                   064100      
000817         03 MASCARA-H-LOG            PIC X(05).                   064200      
000818         03 CVE-SEG-H-LOG            PIC X(06).                   064300      
000819     02  DATOS-LOG.                                               064400      
000820         03 FILLER                   PIC 9(02) COMP.              064500      
000821         03 SUC-RED                  PIC 9(04) COMP.              064600      
000822         03 CTA-RED                  PIC 9(07) COMP.              064700      
000823         03 CVE-MOVTO-LOG            PIC 9(02) COMP.              064800      
000824            88  ES-CARGO-LOG         VALUE  1 THRU  9, 51, 85.    064900      
000825            88  ES-ABONO-LOG         VALUE 11 THRU 19, 71, 79.    065000      
000826            88  ANULA-CARGO-LOG      VALUE 29.                    065100      
000827            88  ANULA-ABONO-LOG      VALUE 39.                    065200      
000828         03 NUM-REF-LOG              PIC 9(11) COMP.              065300      
000829         03 IMPTE-LOG                PIC 9(12)V9(02) COMP.        065400      
000830         03 FILLER                   PIC 9(14) COMP.              065500      
000831         03 HORA-LOG                 PIC 9(06) COMP.              065600      
000832         03 HORA-LOG-X               REDEFINES HORA-LOG.          065700      
000833            05 HM-LOG                PIC 9(04) COMP.              065800      
000834            05 FILLER                PIC 9(02) COMP.              065900      
000835         03 MONEDA-LOG               PIC 9(01) COMP.              066000      
000836         03 FILLER                   PIC 9(01) COMP.              066100      
000837         03 FILLER                   PIC 9(06) COMP.              066200      
000838         03 STATUS-MOVTO-LOG         PIC 9(02) COMP.              066300      
000839            88 NO-CONFIRMADO-LOG         VALUE 3.                 066400      
000840            88 CONFIRMADO-OK-LOG         VALUE 4.                 066500      
000841            88 CONFIRMADO-NOOK-LOG       VALUE 5.                 066600      
000842            88 OPERADO-OK-LOG            VALUE 9.                 066700      
000843            88 OPERADO-OK-LOG-CTAMAE     VALUE 20.                066800      
000844            88 CONFIRMADO-OK-LOG-CTAMAE  VALUE 24.                066900      
000845         03 FILLER                   PIC X(02).                   067000      
000846         03 NUM-AUT-LOG              PIC 9(06) COMP.              067100      
000847         03 FILLER                   PIC X(104).                  067200      
000848/                                                                 067300      
000849**** -------  REGISTRO DE CONTROL O HEADER  --------- ****        067400      
000850 01  WS-REG-LOG-CTL                  REDEFINES WS-REG-LOG-FILE.   067500      
000851     02  WS-CCR-HEADER               PIC X(003).                  067600      
000852     02  WS-FECONT-HEADER            PIC 9(008).                  067700      
000853     02  WS-CVESIS-HEADER            PIC X(004).                  067800      
000854     02  WS-FEC-HEADER               PIC 9(008).                  067900      
000855     02  WS-HORA-HEADER              PIC 9(006).                  068000      
000856     02  FILLER                      PIC X(155).                  068100      
000857*                                                                 068200      
000858**** -------  REGISTRO TOTALIZADOR O TRAILER -------- ****        068300      
000859 01  WS-REG-LOG-TRAILER              REDEFINES WS-REG-LOG-FILE.   068400      
000860     02  WS-IDENT-TRAILER            PIC X(7).                    068500      
000861     02  WS-NCO-TRAILER              PIC 9(5).                    068600      
000862     02  WS-ICO-TRAILER              PIC 9(14)V99.                068700      
000863     02  WS-NAO-TRAILER              PIC 9(5).                    068800      
000864     02  WS-IAO-TRAILER              PIC 9(14)V99.                068900      
000865     02  WS-NCA-TRAILER              PIC 9(5).                    069000      
000866     02  WS-ICA-TRAILER              PIC 9(14)V99.                069100      
000867     02  WS-NAA-TRAILER              PIC 9(5).                    069200      
000868     02  WS-IAA-TRAILER              PIC 9(14)V99.                069300      
000869     02  FILLER                      PIC X(89).                   069400      
000870*                                                                 069500      
000871*********************************************************         069600      
000872*    DESCRIPCION DEL ARCHIVO S030/FILE/GUARDIAN/CORP    *         069700      
000873*********************************************************         069800      
000874*                                                                 069900      
000875 01 WS-REG-GUARDIAN.                                              070000      
000876    02 WS-RG-LLAVE.                                               070100      
000877       03 WS-RG-APLICACION        PIC 9(04).                      070200      
000878       03 FILLER                  PIC 9(02).                      070300      
000879    02 WS-RG-DATOS.                                               070400      
000880       03 WS-RG-SIGLAS            PIC X(02).                      070500      
000881       03 WS-RG-DESC-CORTA        PIC X(07).                      070600      
000882       03 WS-RG-DESC-LARGA        PIC X(14).                      070700      
000883       03 FILLER                  PIC X(11).                      070800      
000884       03 WS-RG-SEC               PIC 9(02).                      070900      
000885       03 WS-RG-FEC-INT           PIC 9(06).                      071000      
000886*                                                                 071100      
000887 01 WS-REG-CTL-GUARDIAN.                                          071200      
000888    02 WS-RGC-LLAVE               PIC 9(06).                      071300      
000889    02 WS-RGC-DATOS.                                              071400      
000890       03 WS-RGC-FECHA-CONTABLE   PIC 9(06).                      071500      
000891       03 WS-RGC-FECHA-CONTABLE-R REDEFINES WS-RGC-FECHA-CONTABLE.071600      
000892          05 WS-RGC-DD            PIC 9(02).                      071700      
000893          05 WS-RGC-MM            PIC 9(02).                      071800      
000894          05 WS-RGC-AA            PIC 9(02).                      071900      
000895       03 WS-RGC-FECHA-REAL       PIC 9(06).                      072000      
000896       03 WS-RGC-HORA-REAL        PIC 9(06).                      072100      
000897       03 WS-RGC-DATOS-FOLIOS.                                    072200      
000898          05 WS-RGC-NUM-FOLIO-INI PIC 9(08).                      072300      
000899          05 WS-RGC-NUM-FOLIO-FIN PIC 9(08).                      072400      
000900          05 WS-RGC-NUM-FOLIO-ACT PIC 9(08).                      072500      
000901       03 WS-RGC-OTROS-DATOS      REDEFINES WS-RGC-DATOS-FOLIOS.  072600      
000902          05 WS-RGC-CSI           PIC 9(02).                      072700      
000903          05 FILLER               PIC X(22).                      072800      
000904*                                                                 072900      
000905 01 WS-REG-GUARD-DEFAULT.                                         073000      
000906    02 FILLER                     PIC 9(04) VALUE 9999.           073100      
000907    02 FILLER                     PIC 9(02) VALUE ZEROS.          073200      
000908    02 FILLER                     PIC X(02) VALUE "**".           073300      
000909    02 FILLER                     PIC X(14) VALUE "* * * * * * *".073400      
000910    02 FILLER                     PIC X(11) VALUE "  ".           073500      
000911    02 FILLER                     PIC 9(02) VALUE 99.             073600      
000912    02 FILLER                     PIC 9(06) VALUE 999999.         073700      
000913*                                                                 073800      
000914*********************************************************         073900      
000915*    DESCRIPCION DEL ARCHIVO DE INTERFASE CON EL        *         074000      
000916*    SISTEMA S028 COMPENSACION CONTABLE REGIONAL        *         074100      
000917*********************************************************         074200      
000918*                                                                 074300      
000919*             S030/FILE/TRANSMISION                               074400      
000920*                                                                 074500      
000921 01 WS-REG-CTL-S028.                                              074600      
000922    03 WS-R028-CHEA               PIC X(02).                      074700      
000923    03 WS-R028-FPRO.                                              074800      
000924       05 WS-R028-DIAP            PIC 9(02).                      074900      
000925       05 WS-R028-MESP            PIC 9(02).                      075000      
000926       05 WS-R028-ANOP            PIC 9(02).                      075100      
000927    03 WS-R028-FREAL              PIC 9(06).                      075200      
000928    03 WS-R028-HREAL              PIC 9(06).                      075300      
000929    03 WS-R028-CSIS               PIC X(04).                      075400      
000930    03 WS-R028-NSIS               PIC X(14).                      075500      
000931    03 WS-R028-CFOR               PIC X(02).                      075600      
000932    03 FILLER                     PIC X(20).                      075700      
000933*                                                                 075800      
000934 01 WS-REG-MOV-S028.                                              075900      
000935    03 WS-R028-SUC                PIC 9(04).                      076000      
000936    03 WS-R028-NECO               PIC 9(04).                      076100      
000937    03 WS-R028-SISTEMA            PIC 9(04).                      076200      
000938    03 WS-R028-TERM               PIC X(03).                      076300      
000939    03 WS-R028-MON                PIC 9(03).                      076400      
000940    03 WS-R028-CCTA               PIC 9(06).                      076500      
000941    03 WS-R028-NCAR               PIC 9(04)    COMP.              076600      
000942    03 WS-R028-ICAR               PIC 9(14)V99 COMP.              076700      
000943    03 WS-R028-NABO               PIC 9(04)    COMP.              076800      
000944    03 WS-R028-IABO               PIC 9(14)V99 COMP.              076900      
000945    03 WS-R028-LEY                PIC X(16).                      077000      
000946*                                                                 077100      
000947 01 WS-REG-TRA-S028.                                              077200      
000948    03 WS-R028-CTRA               PIC X(02).                      077300      
000949    03 WS-R028-TREG               PIC 9(06).                      077400      
000950    03 WS-R028-TCAR               PIC 9(14)V99.                   077500      
000951    03 WS-R028-TABO               PIC 9(14)V99.                   077600      
000952    03 FILLER                     PIC X(20).                      077700      
000953*                                                                 077800      
000954*    ARCHIVO GUARDIAN PARA EL CONTROL DE FECHAS DE PROCESO        077900      
000955*                                                                 078000      
000956 01  WS-REG-GUARDIANR.                                            078100      
000957     02  WS-RG-SISTEMA            PIC X(04).                      078200      
000958     02  WS-RG-PASO               PIC X(03).                      078300      
000959     02  WS-RG-CSI-NUM            PIC 9(02).                      078400      
000960         88 WS-RG-CSI-OK          VALUE 1,2,4,6,10.               078500      
000961     02  WS-RG-CSI-SIG            PIC X(03).                      078600      
000962     02  WS-RG-FEC-PROC-HOY       PIC 9(06).                      078700      
000963     02  WS-RG-FEC-PROC-HOYR REDEFINES                            078800      
000964         WS-RG-FEC-PROC-HOY.                                      078900      
000965         03 GUARD-PROC-HOY-DD     PIC 9(02).                      079000      
000966         03 GUARD-PROC-HOY-MM     PIC 9(02).                      079100      
000967         03 GUARD-PROC-HOY-AA     PIC 9(02).                      079200      
000968     02  WS-RG-FEC-PROC-ANT       PIC 9(06).                      079300      
000969     02  WS-RG-NUM-PROC           PIC 9(06).                      079400      
000970     02  WS-RG-FEC-PROC-SIG       PIC 9(06).                      079500      
000971     02  WS-RG-FEC-PROC-SIGR REDEFINES                            079600      
000972         WS-RG-FEC-PROC-SIG.                                      079700      
000973         03 GUARD-PROC-SIG-DD     PIC 9(02).                      079800      
000974         03 GUARD-PROC-SIG-MM     PIC 9(02).                      079900      
000975         03 GUARD-PROC-SIG-AA     PIC 9(02).                      080000      
000976     02  WS-RG-FEC-ACT            PIC 9(06).                      080100      
000977     02  WS-RG-HORA-ACT           PIC 9(06).                      080200      
000978     02  WS-RG-FEC-CRE            PIC 9(06).                      080300      
000979     02  WS-RG-HORA-CRE           PIC 9(06).                      080400      
000980*----------------------------------------------------------------*080500      
000981*       DESCRIPCION DEL S030/XFER/FILE/INFOICA/OOODDD/AAMMDD     *080600      
000982*----------------------------------------------------------------*080700      
000983*                                                                 080800      
000984**** -------       D  E  T  A  L  L  E       -------- ****        080900      
000985*                                                                 081000      
000986 01 WS-REG-DET-INFOICA            PIC X(160).                     081100      
000987 01 WS-REG-DET-INFOICA-R          REDEFINES WS-REG-DET-INFOICA.   081200      
000988    03 WS-RDI-CSI-ORI             PIC 9(02).                      081300      
000989       88 RDI-CSI-ORI-VAL         VALUES ARE 1,2,4,6,10.          081400      
000990    03 WS-RDI-NOD-ORI             PIC 9(02).                      081500      
000991    03 WS-RDI-CSI-DES             PIC 9(02).                      081600      
000992       88 RDI-CSI-DES-VAL         VALUES ARE 1,2,4,6,10.          081700      
000993    03 WS-RDI-NOM-EST             PIC X(08).                      081800      
000994    03 WS-RDI-NOM-EST-R           REDEFINES WS-RDI-NOM-EST.       081900      
000995       05 WS-RDI-TIPO-DISP        PIC X(01).                      082000      
000996       05 WS-RDI-SUC-ORI          PIC 9(04).                      082100      
000997       05 WS-RDI-CAJA-ORI         PIC X(03).                      082200      
000998    03 WS-RDI-FEC-GEN             PIC 9(08).                      082300      
000999    03 WS-RDI-HOR-GEN             PIC 9(06).                      082400      
001000    03 WS-RDI-HOR-GEN-R           REDEFINES WS-RDI-HOR-GEN.       082500      
001001       05 WS-RDI-HOR-GEN-HH       PIC 9(02).                      082600      
001002       05 WS-RDI-HOR-GEN-MM       PIC 9(02).                      082650      
001003       05 FILLER                  PIC 9(02).                      082700      
001004    03 WS-RDI-APL-ORI             PIC 9(04).                      082800      
001005    03 WS-RDI-APL-DES             PIC 9(04).                      082900      
001006    03 WS-RDI-STA-TRN             PIC 9(02).                      083000      
001007       88 RDI-STA-TRN-ENVIADO     VALUE 1.                        083100      
001008       88 RDI-STA-TRN-APLICADO    VALUE 2.                        083200      
001009       88 RDI-STA-TRN-OPERADO     VALUE 3.                        083300      
001010       88 RDI-STA-TRN-DENEGADO    VALUE 4.                        083400      
001011       88 RDI-STA-TRN-PENDIENTE   VALUE 5.                        083500      
001012       88 RDI-STA-TRN-VAL         VALUE 1 THRU 5.                 083600      
001013    03 WS-RDI-COD-SER             PIC 9(02).                      083700      
001014       88 RDI-COD-SER-CARGO       VALUE 10.                       083800      
001015       88 RDI-COD-SER-ABONO       VALUE 20.                       083900      
001016       88 RDI-COD-SER-ELIMCARGO   VALUE 11.                       084000      
001017       88 RDI-COD-SER-ELIMABONO   VALUE 21.                       084100      
001018       88 RDI-COD-SER-VAL         VALUES ARE 10,11,20,21.         084200      
001019    03 WS-RDI-SUB-SER             PIC 9(03).                      084300      
001020    03 WS-RDI-CTA-DES             PIC X(20).                      084400      
001021    03 WS-RDI-CTA-DES-R           REDEFINES WS-RDI-CTA-DES.       084500      
001022       05 FILLER                  PIC X(09).                      084600      
001023       05 WS-RDI-CTA-DES-SUC      PIC 9(04).                      084700      
001024       05 WS-RDI-CTA-DES-NUM      PIC 9(07).                      084800      
001025    03 WS-RDI-IMP-TRN             PIC 9(16)V99.                   084900      
001026    03 WS-RDI-MON-TRN             PIC 9(03).                      085000      
001027    03 WS-RDI-FEC-CON             PIC 9(08).                      085100      
001028    03 WS-RDI-CVE-AUT             PIC X(20).                      085200      
001029    03 WS-RDI-NUM-TRN             PIC 9(08).                      085300      
001030    03 WS-RDI-CTA-ACC             PIC X(20).                      085400      
001031    03 WS-RDI-REF-OPE             PIC X(20).                      085500      
001032*                                                                 085600      
001033**** -------  REGISTRO DE CONTROL O HEADER  --------- ****        085700      
001034 01 WS-REG-HEA-INFOICA            PIC X(160).                     085800      
001035 01 WS-REG-HEA-INFOICA-R          REDEFINES WS-REG-HEA-INFOICA.   085900      
001036    03 WS-RHI-ID                  PIC X(003).                     086000      
001037       88 RHI-ID-HDR              VALUE "HDR".                    086100      
001038    03 WS-RHI-FEC-PRO             PIC 9(008).                     086200      
001039    03 WS-RHI-FEC-GEN             PIC 9(008).                     086300      
001040    03 WS-RHI-HOR-GEN             PIC 9(004).                     086400      
001041    03 WS-RHI-HOR-GEN-R REDEFINES WS-RHI-HOR-GEN.                 086420      
001042       05 WS-RHI-HH-GEN           PIC 9(02).                      086440      
001043       05 WS-RHI-MM-GEN           PIC 9(02).                      086460      
001044    03 WS-RHI-SIS-EMI             PIC X(004).                     086500      
001045    03 WS-RHI-SIS-REC             PIC X(004).                     086600      
001046    03 WS-RHI-NOM-EXT             PIC X(008).                     086700      
001047    03 WS-RHI-NUM-REG             PIC 9(007).                     086800      
001048    03 WS-RHI-CSI-ORI             PIC X(003).                     086900      
001049    03 WS-RHI-CSI-DES             PIC X(003).                     087000      
001050    03 FILLER                     PIC X(108).                     087100      
001051*                                                                 087200      
001052**** -------  REGISTRO TOTALIZADOR O TRAILER  --------- ****      087300      
001053 01 WS-REG-TRA-INFOICA            PIC X(160).                     087400      
001054 01 WS-REG-TRA-INFOICA-R          REDEFINES WS-REG-TRA-INFOICA.   087500      
001055    03 WS-RTI-ID                  PIC X(003).                     087600      
001056       88 RTI-ID-HDR              VALUE "TLR".                    087700      
001057    03 WS-RTI-NUM-REG             PIC 9(007).                     087800      
001058    03 FILLER                     PIC X(150).                     087900      
001059*                                                                 088000      
001060**** -------   D E T A L L E  T A N D E M    -------- ****        088100      
001061*                                                                 088200      
001062 01 WS-REG-DET-TANDEM             PIC X(156).                     088300      
001063 01 WS-REG-DET-TANDEM-R           REDEFINES WS-REG-DET-TANDEM.    088400      
001064    03 WS-TDI-CSI-ORI             PIC 9(02).                      088500      
001065       88 TDI-CSI-ORI-VAL         VALUES ARE 1,2,4,6,10.          088600      
001066    03 WS-TDI-NOD-ORI             PIC 9(02).                      088700      
001067    03 WS-TDI-CSI-DES             PIC 9(02).                      088800      
001068       88 TDI-CSI-DES-VAL         VALUES ARE 1,2,4,6,10.          088900      
001069    03 WS-TDI-NOM-EST             PIC X(08).                      089000      
001070    03 WS-TDI-NOM-EST-R           REDEFINES WS-TDI-NOM-EST.       089100      
001071       05 WS-TDI-TIPO-DISP        PIC X(01).                      089200      
001072       05 WS-TDI-SUC-ORI          PIC 9(04).                      089300      
001073       05 WS-TDI-CAJA-ORI         PIC X(03).                      089400      
001074    03 WS-TDI-FEC-GEN             PIC 9(06).                      089500      
001075    03 WS-TDI-HOR-GEN             PIC 9(06).                      089600      
001076    03 WS-TDI-HOR-GEN-R           REDEFINES WS-TDI-HOR-GEN.       089700      
001077       05 WS-TDI-HOR-GEN-HHMM     PIC 9(04).                      089800      
001078       05 FILLER                  PIC 9(02).                      089900      
001079    03 WS-TDI-APL-ORI             PIC 9(04).                      090000      
001080    03 WS-TDI-APL-DES             PIC 9(04).                      090100      
001081    03 WS-TDI-STA-TRN             PIC 9(02).                      090200      
001082       88 TDI-STA-TRN-ENVIADO     VALUE 1.                        090300      
001083       88 TDI-STA-TRN-APLICADO    VALUE 2.                        090400      
001084       88 TDI-STA-TRN-OPERADO     VALUE 3.                        090500      
001085       88 TDI-STA-TRN-DENEGADO    VALUE 4.                        090600      
001086       88 TDI-STA-TRN-PENDIENTE   VALUE 5.                        090700      
001087       88 TDI-STA-TRN-VAL         VALUE 1 THRU 5.                 090800      
001088    03 WS-TDI-COD-SER             PIC 9(02).                      090900      
001089       88 TDI-COD-SER-CARGO       VALUE 10.                       091000      
001090       88 TDI-COD-SER-ABONO       VALUE 20.                       091100      
001091       88 TDI-COD-SER-ELIMCARGO   VALUE 11.                       091200      
001092       88 TDI-COD-SER-ELIMABONO   VALUE 21.                       091300      
001093       88 TDI-COD-SER-VAL         VALUES ARE 10,11,20,21.         091400      
001094    03 WS-TDI-SUB-SER             PIC 9(03).                      091500      
001095    03 WS-TDI-CTA-DES             PIC X(20).                      091600      
001096    03 WS-TDI-CTA-DES-R           REDEFINES WS-TDI-CTA-DES.       091700      
001097       05 FILLER                  PIC X(09).                      091800      
001098       05 WS-TDI-CTA-DES-SUC      PIC 9(04).                      091900      
001099       05 WS-TDI-CTA-DES-NUM      PIC 9(07).                      092000      
001100    03 WS-TDI-IMP-TRN             PIC 9(16)V99.                   092100      
001101    03 WS-TDI-MON-TRN             PIC 9(03).                      092200      
001102    03 WS-TDI-FEC-CON             PIC 9(06).                      092300      
001103    03 WS-TDI-CVE-AUT             PIC X(20).                      092400      
001104    03 WS-TDI-NUM-TRN             PIC 9(08).                      092500      
001105    03 WS-TDI-CTA-ACC             PIC X(20).                      092600      
001106    03 WS-TDI-REF-OPE             PIC X(20).                      092700      
001107*                                                                 092800      
001108**** -----  REGISTRO DE CONTROL O HEADER TANDEM  ------- ****     092900      
001109 01 WS-REG-HEA-TANDEM             PIC X(156).                     093000      
001110 01 WS-REG-HEA-TANDEM-R           REDEFINES WS-REG-HEA-TANDEM.    093100      
001111    03 WS-THI-ID                  PIC X(003).                     093200      
001112       88 THI-ID-HDR              VALUE "HDR".                    093300      
001113    03 WS-THI-FEC-PRO             PIC 9(006).                     093400      
001114    03 WS-THI-FEC-GEN             PIC 9(006).                     093500      
001115    03 WS-THI-HOR-GEN             PIC 9(004).                     093600      
001116    03 WS-THI-SIS-EMI             PIC X(004).                     093700      
001117    03 WS-THI-SIS-REC             PIC X(004).                     093800      
001118    03 WS-THI-NOM-EXT             PIC X(008).                     093900      
001119    03 WS-THI-NUM-REG             PIC 9(007).                     094000      
001120    03 WS-THI-CSI-ORI             PIC X(003).                     094100      
001121    03 WS-THI-CSI-DES             PIC X(003).                     094200      
001122    03 FILLER                     PIC X(108).                     094300      
001123*                                                                 094400      
001124**** -----  REGISTRO TOTALIZADOR O TRAILER TANDEM ------ ****     094500      
001125 01 WS-REG-TRA-TANDEM             PIC X(156).                     094600      
001126 01 WS-REG-TRA-TANDEM-R           REDEFINES WS-REG-TRA-TANDEM.    094700      
001127    03 WS-TTI-ID                  PIC X(003).                     094800      
001128       88 TTI-ID-HDR              VALUE "TLR".                    094900      
001129    03 WS-TTI-NUM-REG             PIC 9(007).                     095000      
001130    03 FILLER                     PIC X(146).                     095100      
001131*                                                                 095200      
001132* ETIQUETA EXTERNA                                                095300      
001133*                                                                 095400      
001134 01 NOMBRE-INFOICA.                                               095500      
001135    03 FILLER                     PIC X(23) VALUE                 095600      
001136                                  "S151/XFER/FILE/INFOICA/".      095700      
001137    03 NI-CSI-ORI                 PIC X(03).                      095800      
001138    03 NI-CSI-DES                 PIC X(03).                      095900      
001139    03 FILLER                     PIC X(01) VALUE "/".            096000      
001140    03 NI-CSI-FEC                 PIC 9(06).                      096100      
001141    03 NI-CSI-FEC-R               REDEFINES NI-CSI-FEC.           096200      
001142       05 NI-CSI-FEC-AA           PIC 9(02).                      096300      
001143       05 NI-CSI-FEC-MM           PIC 9(02).                      096400      
001144       05 NI-CSI-FEC-DD           PIC 9(02).                      096500      
001145    03 FILLER                     PIC X(01) VALUE ".".            096600      
001146*                                                                 096700      
001147 01 WS-REG-DET-INFOICA-ANT        PIC X(160).                     096800      
001148 01 WS-REG-DET-INFOICA-TEMP       PIC X(160).                     096900      
001149/                                                                 097000      
001150*----------------------------------------------------------------*097100      
001151*       DESCRIPCION DEL S030/FILE/PENDIENTES                     *097200      
001152*----------------------------------------------------------------*097300      
001153*                                                                 097400      
001154**** -------       D  E  T  A  L  L  E       -------- ****        097500      
001155*         IGUAL FORMATO QUE WS-REG-DET-INFOICA                    097600      
001156*                                                                 097700      
001157 01 WS-REG-PENDIENTES             PIC X(160).                     097800      
001158*                                                                 097900      
001159**** -------       REGISTRO DE CONTROL      --------- ****        098000      
001160 01 WS-REG-CTL-PENDIENTES         PIC X(160).                     098100      
001161 01 WS-REG-CTL-PENDIENTES-R       REDEFINES WS-REG-CTL-PENDIENTES.098200      
001162    03 WS-RCP-ID                  PIC X(003).                     098300      
001163       88 RCP-ID-CTL              VALUE "CTL".                    098400      
001164    03 WS-RCP-FEC-PRO             PIC 9(008).                     098500      
001165    03 WS-RCP-FEC-GEN             PIC 9(008).                     098600      
001166    03 WS-RCP-HOR-GEN             PIC 9(004).                     098700      
001167    03 FILLER                     PIC X(137).                     098800      
001168*                                                                 098900      
001169 01 WS-TABLA-VERIF-MSG.                                           099000      
001170    03 WS-TVM-TOTAL               PIC X(16000).                   099100      
001171    03 WS-TVM-OCC                 OCCURS 100 TIMES.               099200      
001172       05 WS-TVM-REG              PIC X(160).                     099300      
001173       05 WS-TVM-REG-R            REDEFINES WS-TVM-REG.           099400      
001174          07 FILLER               PIC X(36).                      099500      
001175          07 WS-TVM-STA-TRN       PIC 9(02).                      099600      
001176             88 TVM-ENVIADO       VALUE 1.                        099700      
001177             88 TVM-APLICADO      VALUE 2.                        099800      
001178             88 TVM-OPERADO       VALUE 3.                        099900      
001179             88 TVM-DENEGADO      VALUE 4.                        100000      
001180             88 TVM-PENDIENTE     VALUE 5.                        100100      
001181          07 WS-TVM-COD-SER       PIC 9(02).                      100200      
001182             88 TVM-CARGO         VALUE 10.                       100300      
001183             88 TVM-ANUCARGO      VALUE 11.                       100400      
001184                                                                  100500      
001185             88 TVM-EINSTCARGO    VALUE 13.                       100600      
001186             88 TVM-ABONO         VALUE 20.                       100700      
001187             88 TVM-ANUABONO      VALUE 21.                       100800      
001188             88 TVM-INSTABONO     VALUE 22.                       100900      
001189             88 TVM-EINSTABONO    VALUE 23.                       101000      
001190          07 FILLER               PIC 9(03).                      101100      
001191          07 WS-TVM-ID-CTA        PIC X(20).                      101200      
001192          07 WS-TVM-IMPORTE       PIC 9(18).                      101300      
001193          07 FILLER               PIC 9(03).                      101400      
001194          07 WS-TVM-FECHA         PIC 9(08).                      101500      
001195          07 FILLER               PIC X(68).                      101600      
001196*                                                                 101700      
001197 01 WS-TABLA-VERIF-PEND.                                          101800      
001198    03 WS-TVP-TOTAL               PIC X(16000).                   101900      
001199    03 WS-TVP-OCC                 OCCURS 100 TIMES.               102000      
001200       05 WS-TVP-REG              PIC X(160).                     102100      
001201       05 WS-TVP-REG-R            REDEFINES WS-TVP-REG.           102200      
001202          07 FILLER               PIC X(36).                      102300      
001203          07 WS-TVP-STA-TRN       PIC 9(02).                      102400      
001204             88 TVP-ENVIADO       VALUE 1.                        102500      
001205             88 TVP-APLICADO      VALUE 2.                        102600      
001206             88 TVP-OPERADO       VALUE 3.                        102700      
001207             88 TVP-DENEGADO      VALUE 4.                        102800      
001208             88 TVP-PENDIENTE     VALUE 5.                        102900      
001209          07 WS-TVP-COD-SER       PIC 9(02).                      103000      
001210             88 TVP-CARGO         VALUE 10.                       103100      
001211             88 TVP-ANUCARGO      VALUE 11.                       103200      
001212             88 TVP-INSTCARGO     VALUE 12.                       103300      
001213             88 TVP-EINSTCARGO    VALUE 13.                       103400      
001214             88 TVP-ABONO         VALUE 20.                       103500      
001215             88 TVP-ANUABONO      VALUE 21.                       103600      
001216             88 TVP-INSTABONO     VALUE 22.                       103700      
001217             88 TVP-EINSTABONO    VALUE 23.                       103800      
001218          07 FILLER               PIC 9(03).                      103900      
001219          07 WS-TVP-ID-CTA        PIC X(20).                      104000      
001220          07 WS-TVP-IMPORTE       PIC 9(18).                      104100      
001221          07 FILLER               PIC 9(03).                      104200      
001222          07 WS-TVP-FECHA         PIC 9(08).                      104300      
001223          07 FILLER               PIC X(68).                      104400      
001224*                                                                 104500      
001225*----------------------------------------------------------------*104600      
001226*       DESCRIPCION DEL ARCHIVO S030/FILE/LOGCSI/XXX/DDMMAA      *104700      
001227*----------------------------------------------------------------*104800      
001228*                                                                 104900      
001229**** -------       D  E  T  A  L  L  E       -------- ****        105000      
001230*  EL FORMATO ES IGUAL AL QUE SE TIENE PARA EL S030ROCBD          105100      
001231 01 WS-REG-LOG                    PIC X(160).                     105200      
001232*                                                                 105300      
001233**** -------  REGISTRO DE CONTROL O HEADER  --------- ****        105400      
001234 01  WS-REG-LOG-CONTROL           REDEFINES WS-REG-LOG.           105500      
001235     02  WS-RLC-IDENT             PIC X(006).                     105600      
001236     02  WS-RLC-CSI               PIC X(003).                     105700      
001237     02  WS-RLC-FECONT            PIC 9(008).                     105800      
001238     02  WS-RLC-CVESIS            PIC X(004).                     105900      
001239     02  WS-RLC-FECHA             PIC 9(008).                     106000      
001240     02  WS-RLC-HORA              PIC 9(006).                     106100      
001241     02  FILLER                   PIC X(125).                     106200      
001242*                                                                 106300      
001243**** -------  REGISTRO TOTALIZADOR O TRAILER -------- ****        106400      
001244 01  WS-RG-LOG-TRAILER           REDEFINES WS-REG-LOG.            106500      
001245     02  WS-RLT-IDENT             PIC X(07).                      106600      
001246     02  WS-RLT-NCO               PIC 9(06).                      106700      
001247     02  WS-RLT-ICO               PIC 9(18)V99.                   106800      
001248     02  WS-RLT-NAO               PIC 9(06).                      106900      
001249     02  WS-RLT-IAO               PIC 9(18)V99.                   107000      
001250     02  WS-RLT-NCA               PIC 9(06).                      107100      
001251     02  WS-RLT-ICA               PIC 9(18)V99.                   107200      
001252     02  WS-RLT-NAA               PIC 9(06).                      107300      
001253     02  WS-RLT-IAA               PIC 9(18)V99.                   107400      
001254     02  FILLER                   PIC X(49).                      107500      
001255/                                                                 107600      
001256*                                                                 107700      
001257****************************************************************  107800      
001258*  CAMPOS AUXILIARES PARA EL USO DE:                           *  107900      
001259*                                   S080/OBJECT/LIBRARY/LIBEST *  108000      
001260****************************************************************  108100      
001261*                                                                 108200      
001262 01  IS-CODIGO                         PIC 9(06).                 108300      
001263 01  IS-CODIGO-R                       REDEFINES IS-CODIGO.       108400      
001264*                                                                 108500      
001265     02  IS-LLAVE                      PIC 9(04).                 108600      
001266     02  IS-CLAVE                      PIC 9(02).                 108700      
001267*                                                                 108800      
001268 01  IS-RESPUESTA                      PIC X(81).                 108900      
001269 01  IS-RESPUESTA-R                    REDEFINES IS-RESPUESTA.    109000      
001270*                                                                 109100      
001271     02  IS-RESULTADO                  PIC 9(01).                 109200      
001272     02  IS-DATO-CONSULT               PIC X(80).                 109300      
001273     02  IS-DATO-TRANS25               REDEFINES IS-DATO-CONSULT. 109400      
001274*                                                                 109500      
001275*  TIPO DE TRANSACCION 25                                         109600      
001276*                                                                 109700      
001277         03  IS-TIPO-IMPRESION         PIC 9(02).                 109800      
001278         03  IS-PRIOR-PLAZA            PIC 9(02).                 109900      
001279         03  IS-PRIOR-OFICINA          PIC 9(02).                 110000      
001280         03  IS-CENT-BCA-ELECT         PIC 9(04).                 110100      
001281         03  IS-NODO                   PIC 9(02).                 110200      
001282         03  IS-SUBNODO                PIC 9(02).                 110300      
001283         03  FILLER                    PIC X(66).                 110400      
001284*                                                                 110500      
001285     02  IS-DATO-TRANS27               REDEFINES IS-DATO-CONSULT. 110600      
001286*                                                                 110700      
001287*  TIPO DE TRANSACCION 27                                         110800      
001288*                                                                 110900      
001289         03  IS-CSI                    PIC 9(02).                 111000      
001290         03  IS-NOMB-LARGO             PIC X(40).                 111100      
001291         03  IS-ESTRUCTURA             PIC 9(20).                 111200      
001292         03  IS-ESTRUCTURA-R           REDEFINES IS-ESTRUCTURA.   111300      
001293             04  IS-AREA               PIC 9(04).                 111400      
001294             04  IS-DIVISION           PIC 9(04).                 111500      
001295             04  IS-DIRECCION          PIC 9(04).                 111600      
001296             04  IS-PL-REG-DIS         PIC 9(04).                 111700      
001297             04  IS-PL-OPER-COM        PIC 9(04).                 111800      
001298         03  FILLER                    PIC X(18).                 111900      
001299*                                                                 112000      
001300     02  IS-DATO-TRANS03               REDEFINES IS-DATO-CONSULT. 112100      
001301         03  IS-NOMB-LARGO-EST         PIC X(40).                 112200      
001302         03  FILLER                    PIC X(40).                 112300      
001303*                                                                 112400      
001304*                                                                 112500      
001305 01 WS-IS-TRANS27                      PIC 9(02) VALUE 27.        112600      
001306 01 WS-IS-TRANS25                      PIC 9(02) VALUE 25.        112700      
001307 01 WS-IS-TRANS03                      PIC 9(02) VALUE 03.        112800      
001308*                                                                 112900      
001309 01 WS-LIBRERIA PIC X(12) VALUE "S080ESTLIN".                     113000      
001310 01 WS-TITULO   PIC X(72).                                        113100      
001311 01 WS-STATUS   PIC S9(11) BINARY.                                113200      
001312*                                                                 113300      
001313/                                                                 113400      
001314*                                                                 113500      
001315*   S030-P130-REPORTES  ******************************************113600      
001316*                                                                 113700      
001317 01 REP-TIT1.                                                     113800      
001318    03 FILLER                     PIC X(10) VALUE "R/030-130/".   113900      
001319    03 RT1-TITULO                 PIC X(25).                      114000      
001320    03 FILLER                     PIC X(08) VALUE SPACES.         114100      
001321    03 FILLER                     PIC X(33) VALUE                 114200      
001322       "BANCO NACIONAL DE MEXICO, S.A. - ".                       114300      
001323    03 FILLER                     PIC X(30) VALUE                 114400      
001324       "COMPENSACION CONTABLE NACIONAL".                          114500      
001325    03 FILLER                     PIC X(07) VALUE SPACES.         114600      
001326    03 FILLER                     PIC X(11) VALUE "   PAGINA: ".  114700      
001327    03 RT1-PAG                    PIC ZZZZZZZ9.                   114800      
001328*                                                                 114900      
001329 01 WS-REP-TIT1.                                                  115000      
001330    03 WS-RT1-REP0                PIC X(25) VALUE                 115100      
001331       "000-CARATULA             ".                               115200      
001332    03 WS-RT1-REP1                PIC X(25) VALUE                 115300      
001333       "001-COMPENSACION-REGIONAL".                               115400      
001334    03 WS-RT1-REP2                PIC X(25) VALUE                 115500      
001335       "002-ELIMINACIONES        ".                               115600      
001336    03 WS-RT1-REP3                PIC X(25) VALUE                 115700      
001337       "003-TRANSMISION-SISTEMAS ".                               115800      
001338    03 WS-RT1-REP4                PIC X(25) VALUE                 115900      
001339       "004-COMPENSACION-NODOS   ".                               116000      
001340    03 WS-RT1-REP5                PIC X(25) VALUE                 116100      
001341       "005-PENDIENTES           ".                               116200      
001342    03 WS-RT1-REP6                PIC X(25) VALUE                 116300      
001343       "006-DUPLICADOS           ".                               116400      
001344    03 WS-RT1-REP7                PIC X(25) VALUE                 116500      
001345       "007-SIN-PAREJA           ".                               116600      
001346/                                                                 116700      
001347 01 REP-TIT2.                                                     116800      
001348    03 FILLER                     PIC X(12) VALUE "FECHA REAL: ". 116900      
001349    03 RT2-FEC-REAL               PIC 99/99/99.                   117000      
001350    03 FILLER                     PIC X(21) VALUE SPACES.         117100      
001351    03 RT2-TITULO                 PIC X(50).                      117200      
001352    03 FILLER                     PIC X(22) VALUE SPACES.         117300      
001353    03 FILLER                     PIC X(11) VALUE "  VERSION: ".  117400      
001354    03 RT2-VERSION                PIC 99/99/99.                   117500      
001355*                                                                 117600      
001356 01 WS-REP-TIT2.                                                  117700      
001357    03 WS-RT2-REP0                PIC X(50) VALUE                 117800      
001358       "          CIFRAS DE CONTROL DE ARCHIVOS           ".      117900      
001359    03 WS-RT2-REP1                PIC X(50) VALUE                 118000      
001360       "         RESUMEN DE OPERACIONES FORANEAS          ".      118100      
001361    03 WS-RT2-REP2                PIC X(50) VALUE                 118200      
001362       "     MOVIMIENTOS ERRONEOS ELIMINADOS/ANULADOS     ".      118300      
001363    03 WS-RT2-REP3                PIC X(50) VALUE                 118400      
001364       "        RESUMEN DE TRANSMISION POR SISTEMA        ".      118500      
001365    03 WS-RT2-REP4                PIC X(50) VALUE                 118600      
001366       "              COMPENSACION POR NODOS              ".      118700      
001367    03 WS-RT2-REP5                PIC X(50) VALUE                 118800      
001368       "         MOVIMIENTOS PENDIENTES DE APLICAR        ".      118900      
001369    03 WS-RT2-REP6                PIC X(50) VALUE                 119000      
001370       "              MOVIMIENTOS DUPLICADOS              ".      119100      
001371    03 WS-RT2-REP7                PIC X(50) VALUE                 119200      
001372       "          MENSAJES CON ERROR EN PROTOCOLO         ".      119300      
001373*                                                                 119400      
001374*                                                                 119500      
001375 01 REP-TIT3.                                                     119600      
001376    03 FILLER                     PIC X(12) VALUE "HORA  REAL: ". 119700      
001377    03 RT3-HH-REAL                PIC 99.                         119800      
001378    03 FILLER                     PIC X VALUE ":".                119810      
001379    03 RT3-MM-REAL                PIC 99.                         119820      
001380    03 FILLER                     PIC X VALUE ":".                119830      
001381    03 RT3-SS-REAL                PIC 99.                         119840      
001382    03 FILLER                     PIC X VALUE ":".                119850      
001383    03 FILLER                     PIC X(30) VALUE SPACES.         119900      
001384    03 RT3-TITULO                 PIC X(33) VALUE                 120000      
001385       "CIFRAS EXPRESADAS EN PESOS".                              120100      
001386    03 FILLER                     PIC X(30) VALUE SPACES.         120200      
001387    03 FILLER                     PIC X(11) VALUE "F.PROCESO: ".  120300      
001388    03 RT3-FEC-PROCESO            PIC 99/99/99.                   120400      
001389*                                                                 120500      
001390 01 REP-TIT4.                                                     120600      
001391    03 FILLER                     PIC X(08) VALUE "C.S.I.: ".     120700      
001392    03 RT4-CSI                    PIC X(15).                      120800      
001393    03 FILLER                     PIC X(25) VALUE SPACES.         120900      
001394    03 RT4-NUM-OCCA               PIC ZZZZ.                       121000      
001395    03 FILLER                     PIC X(01) VALUE SPACES.         121100      
001396    03 RT4-OCCA                   PIC X(32).                      121200      
001397    03 FILLER                     PIC X(28) VALUE SPACES.         121300      
001398    03 RT4-NMONEDA                PIC X(11)    VALUE SPACES.      121400      
001399    03 RT4-MONEDA                 PIC ZZZZZZZZ VALUE ZEROS.       121500      
001400*                                                                 121600      
001401/                 R E P O R T E   0                               121700      
001402*                                                                 121800      
001403 01 REP0-SUB1.                                                    121900      
001404    03 FILLER                     PIC X(31) VALUE                 122000      
001405       " ARCHIVO      FECHA      HORA  ".                         122100      
001406    03 FILLER                     PIC X(37) VALUE                 122200      
001407       "     S  T  A  T  U  S".                                   122300      
001408    03 FILLER                     PIC X(40) VALUE "C A R G O S  ".122400      
001409    03 FILLER                     PIC X(24) VALUE "A B O N O S  ".122500      
001410*                                                                 122600      
001411 01 REP0-DET1.                                                    122700      
001412    03 R0D1-LEY                   PIC X(31).                      122800      
001413    03 R0D1-LEY-R                 REDEFINES R0D1-LEY.             122900      
001414       05 R0D1-TARCH              PIC X(09).                      123000      
001415       05 R0D1-TARCH-R            REDEFINES R0D1-TARCH.           123100      
001416          07  R0D1-LOG1           PIC X(06).                      123200      
001417          07  R0D1-LOG2           PIC X(03).                      123300      
001418       05 FILLER                  PIC X(03).                      123400      
001419       05 R0D1-FEC                PIC 99/99/99.                   123500      
001420       05 FILLER                  PIC X(03).                      123600      
001421       05 R0D1-HH                 PIC 99.                         123700      
001422       05 R0D1-2-PUNTOS1          PIC X .                         123720      
001423       05 R0D1-MM                 PIC 99.                         123740      
001424       05 R0D1-2-PUNTOS2          PIC X .                         123745      
001425       05 R0D1-SS                 PIC 99.                         123750      
001426                                                                  123760      
001427    03 FILLER                     PIC X(05)    VALUE SPACES.      123800      
001428    03 R0D1-STATUS                PIC X(20)    VALUE SPACES.      123900      
001429    03 R0D1-NCO                   PIC ZZZZZZZ9 VALUE ZEROES.      124000      
001430    03 FILLER                     PIC X(03)    VALUE SPACES.      124100      
001431    03 R0D1-ICO                   PIC ZZZZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.  124200      
001432    03 FILLER                     PIC X(03)    VALUE SPACES.      124300      
001433    03 R0D1-NAO                   PIC ZZZZZZZ9 VALUE ZEROES.      124400      
001434    03 FILLER                     PIC X(03)    VALUE SPACES.      124500      
001435    03 R0D1-IAO                   PIC ZZZZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99-. 124600      
001436*                                                                 124700      
001437 01 WS-R0D1-STATUS.                                               124800      
001438    03 FILLER                     PIC X(20) VALUE                 124900      
001439                                  "LOCAL-OPERADO       ".         125000      
001440    03 FILLER                     PIC X(20) VALUE                 125100      
001441                                  "FORANEO-OPERADO     ".         125200      
001442    03 FILLER                     PIC X(20) VALUE                 125300      
001443                                  "FORANEO-APLICADO    ".         125400      
001444    03 FILLER                     PIC X(20) VALUE                 125500      
001445                                  "FORANEO-PENDIENTE   ".         125600      
001446    03 FILLER                     PIC X(20) VALUE                 125700      
001447                                  "DESCONOCIDO         ".         125800      
001448    03 FILLER                     PIC X(20) VALUE                 125900      
001449                                  "TOTAL REGS. LEIDOS  ".         126000      
001450    03 FILLER                     PIC X(20) VALUE                 126100      
001451                                  "TOTAL REGS. TRAILER ".         126200      
001452 01 WS-R0D1-STATUS-R              REDEFINES WS-R0D1-STATUS.       126300      
001453    03 WS-R0D1-STA                PIC X(20) OCCURS 7 TIMES.       126400      
001454*                                                                 126500      
001455 01 REP0-DET4.                                                    126600      
001456    03 FILLER                     PIC X(72) VALUE SPACES.         126700      
001457    03 R0D4-NXX                   PIC ZZZZZZZ9 VALUE ZEROES.      126800      
001458    03 FILLER                     PIC X(03) VALUE SPACES.         126900      
001459    03 R0D4-IXX                   PIC ZZZZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.  127000      
001460*                                                                 127100      
001461 01 REP0-DET5.                                                    127200      
001462    03 FILLER                     PIC X(132) VALUE SPACES.        127300      
001463*                                                                 127400      
001464 01 REP0-DET6.                                                    127500      
001465    03 FILLER                     PIC X(49) VALUE SPACES.         127600      
001466    03 FILLER                     PIC X(83) VALUE ALL "-".        127700      
001467/                 R E P O R T E   1                               127800      
001468*                                                                 127900      
001469 01 REP1-SUB1.                                                    128000      
001470    03 FILLER                     PIC X(13) VALUE                 128100      
001471                                  "  C. S. I.   ".                128200      
001472    03 FILLER                     PIC X(60) VALUE                 128300      
001473   "             MOVIMIENTOS OPERADOS ( ENVIADOS )              ".128400      
001474    03 FILLER                     PIC X(59) VALUE                 128500      
001475    "           MOVIMIENTOS APLICADOS ( RECIBIDOS )             ".128600      
001476*                                                                 128700      
001477 01 REP1-SUB2.                                                    128800      
001478    03 FILLER                     PIC X(13) VALUE                 128900      
001479                                  "  A  /  DE   ".                129000      
001480    03 FILLER                     PIC X(29) VALUE                 129100      
001481                            "NUM.     C  A  R  G  O  S    ".      129200      
001482    03 FILLER                     PIC X(31) VALUE                 129300      
001483                            "NUM.     A  B  O  N  O  S      ".    129400      
001484    03 FILLER                     PIC X(30) VALUE                 129500      
001485                            "NUM.     C  A  R  G  O  S     ".     129600      
001486    03 FILLER                     PIC X(29) VALUE                 129700      
001487                            "NUM.     A  B  O  N  O  S    ".      129800      
001488*                                                                 129900      
001489 01 REP1-SUB3.                                                    130000      
001490    03 FILLER                     PIC X(13) VALUE                 130100      
001491                                  " ----------- ".                130200      
001492    03 FILLER                     PIC X(29) VALUE                 130300      
001493                            "----- ---------------------- ".      130400      
001494    03 FILLER                     PIC X(31) VALUE                 130500      
001495                            "----- -----------------------  ".    130600      
001496    03 FILLER                     PIC X(30) VALUE                 130700      
001497                            "----- ----------------------- ".     130800      
001498    03 FILLER                     PIC X(29) VALUE                 130900      
001499                            "----- ---------------------- ".      131000      
001500*                                                                 131100      
001501 01 REP1-SUB4.                                                    131200      
001502    03 FILLER                     PIC X(08) VALUE "SISTEMA ".     131300      
001503    03 R1S4-SISTEMA               PIC X(14).                      131400      
001504    03 FILLER                     PIC X(110) VALUE SPACES.        131500      
001505/                                                                 131600      
001506 01 REP1-DET1.                                                    131700      
001507    03 FILLER                     PIC X(01) VALUE SPACES.         131800      
001508    03 R1D1-CSI-OPERAPLI          PIC X(11) VALUE SPACES.         131900      
001509    03 FILLER                     PIC X(01) VALUE SPACES.         132000      
001510    03 R1D1-NUM-CAR-OP            PIC ZZZZ9.                      132100      
001511    03 FILLER                     PIC X(01) VALUE SPACES.         132200      
001512    03 R1D1-IMP-CAR-OP            PIC $$$$$$$$$$$,$$$,$$9.99.     132300      
001513    03 FILLER                     PIC X(01) VALUE SPACES.         132400      
001514    03 R1D1-NUM-ABO-OP            PIC ZZZZ9.                      132500      
001515    03 FILLER                     PIC X(01) VALUE SPACES.         132600      
001516    03 R1D1-IMP-ABO-OP            PIC $$$$$$$$$$$,$$$,$$9.99-.    132700      
001517    03 FILLER                     PIC X(02) VALUE SPACES.         132800      
001518    03 R1D1-NUM-CAR-APL           PIC ZZZZ9.                      132900      
001519    03 FILLER                     PIC X(01) VALUE SPACES.         133000      
001520    03 R1D1-IMP-CAR-APL           PIC $$$$$$$$$$$,$$$,$$9.99-.    133100      
001521    03 FILLER                     PIC X(01) VALUE SPACES.         133200      
001522    03 R1D1-NUM-ABO-APL           PIC ZZZZ9.                      133300      
001523    03 FILLER                     PIC X(01) VALUE SPACES.         133400      
001524    03 R1D1-IMP-ABO-APL           PIC $$$$$$$$$$$,$$$,$$9.99.     133500      
001525*                                                                 133600      
001526 01 REP1-DET2.                                                    133700      
001527    03 FILLER                     PIC X(01) VALUE SPACES.         133800      
001528    03 R1D2-SALDO-LEY             PIC X(09) VALUE "S A L D O".    133900      
001529    03 FILLER                     PIC X(08) VALUE SPACES.         134000      
001530    03 R1D2-SALDO-CAR-OP          PIC $$$$$$$$$$$$,$$$,$$9.99.    134100      
001531    03 FILLER                     PIC X(06) VALUE SPACES.         134200      
001532    03 R1D2-SALDO-ABO-OP          PIC $$$$$$$$$$$$,$$$,$$9.99-.   134300      
001533    03 FILLER                     PIC X(07) VALUE SPACES.         134400      
001534    03 R1D2-SALDO-CAR-APL         PIC $$$$$$$$$$$$,$$$,$$9.99-.   134500      
001535    03 FILLER                     PIC X(06) VALUE SPACES.         134600      
001536    03 R1D2-SALDO-ABO-APL         PIC $$$$$$$$$$$$,$$$,$$9.99.    134700      
001537*                                                                 134800      
001538 01 REP1-DET3.                                                    134900      
001539    03 FILLER                     PIC X(01) VALUE SPACES.         135000      
001540    03 R1D3-TOT-LEY               PIC X(11) VALUE SPACES.         135100      
001541    03 FILLER                     PIC X(01) VALUE SPACES.         135200      
001542    03 R1D3-NUM-CAROP             PIC ZZZZ9.                      135300      
001543    03 FILLER                     PIC X(01) VALUE SPACES.         135400      
001544    03 R1D3-IMP-CAROP             PIC $$$$$$$$$$$,$$$,$$9.99.     135500      
001545    03 FILLER                     PIC X(01) VALUE SPACES.         135600      
001546    03 R1D3-NUM-ABOP              PIC ZZZZ9.                      135700      
001547    03 FILLER                     PIC X(01) VALUE SPACES.         135800      
001548    03 R1D3-IMP-ABOP              PIC $$$$$$$$$$$,$$$,$$9.99-.    135900      
001549    03 FILLER                     PIC X(02) VALUE SPACES.         136000      
001550    03 R1D3-NUM-CARAPLI           PIC ZZZZ9.                      136100      
001551    03 FILLER                     PIC X(01) VALUE SPACES.         136200      
001552    03 R1D3-IMP-CARAPLI           PIC $$$$$$$$$$$,$$$,$$9.99-.    136300      
001553    03 FILLER                     PIC X(01) VALUE SPACES.         136400      
001554    03 R1D3-NUM-ABAPLI            PIC ZZZZ9.                      136500      
001555    03 FILLER                     PIC X(01) VALUE SPACES.         136600      
001556    03 R1D3-IMP-ABAPLI            PIC $$$$$$$$$$$,$$$,$$9.99.     136700      
001557*                                                                 136800      
001558/                 R E P O R T E   2                               136900      
001559*                                                                 137000      
001560 01  REP2-SUB1.                                                   137100      
001561     03  FILLER                   PIC X(48) VALUE                 137200      
001562         "CSI APL  CSI APL   NOMBRE        CLAVE DE       ".      137300      
001563     03  FILLER                   PIC X(55) VALUE                 137400      
001564        "                       TIPO                            ".137500      
001565     03  FILLER                   PIC X(29) VALUE                 137600      
001566         "    FECHA  HORA   TIPO-ERROR ".                         137700      
001567*                                                                 137800      
001568 01  REP2-SUB2.                                                   137900      
001569     03  FILLER                   PIC X(48) VALUE                 138000      
001570         "ORI ORI  DES DES  ESTACION     AUTORIZACION     ".      138100      
001571     03  FILLER                   PIC X(55) VALUE                 138200      
001572        "    CUENTA-DESTINO      MOV      I M P O R T E     STA ".138300      
001573     03  FILLER                   PIC X(29) VALUE                 138400      
001574         "MON  CONT.  GEN. ABCDEFGHIJKL".                         138500      
001575*                                                                 138600      
001576 01  REP2-SUB3.                                                   138700      
001577     03  FILLER                   PIC X(48) VALUE                 138800      
001578         "--- ---- --- ---- -------- -------------------- ".      138900      
001579     03  FILLER                   PIC X(55) VALUE                 139000      
001580        "---------------------- ---- ---------------------- --- ".139100      
001581     03  FILLER                   PIC X(29) VALUE                 139200      
001582         "--- ------ ----- ------------".                         139300      
001583*                                                                 139400      
001584 01  REP2-SUB4.                                                   139500      
001585     03  FILLER                   PIC X(48) VALUE                 139600      
001586         "(A) (B)  (C) (D)    (E)            (F)          ".      139700      
001587     03  FILLER                   PIC X(55) VALUE                 139800      
001588        "         (G)            (H)           (I)          (J) ".139900      
001589     03  FILLER                   PIC X(29) VALUE                 140000      
001590         "(K)   (L)                    ".                         140100      
001591*                                                                 140200      
001592 01  REP2-SUB5.                                                   140300      
001593     03  FILLER                   PIC X(27)  VALUE SPACES.        140400      
001594     03  FILLER                   PIC X(08)  VALUE                140500      
001595                                    "  NUM.  ".                   140600      
001596     03  FILLER                   PIC X(27)  VALUE                140700      
001597                                   "     C  A  R  G  O  S      ". 140800      
001598     03  FILLER                   PIC X(08)  VALUE                140900      
001599                                    "  NUM.  ".                   141000      
001600     03  FILLER                   PIC X(28)  VALUE                141100      
001601                                   "     A  B  O  N  O  S       ".141200      
001602     03  FILLER                   PIC X(08)  VALUE                141300      
001603                                    "  NUM.  ".                   141400      
001604     03  FILLER                   PIC X(26)  VALUE                141500      
001605                                   "  TIPO MOVTO DESCONOCIDO  ".  141600      
001606/                                                                 141700      
001607 01  REP2-SUB6.                                                   141800      
001608     03  FILLER                   PIC X(27)  VALUE SPACES.        141900      
001609     03  FILLER                   PIC X(08)  VALUE                142000      
001610                                    "------  ".                   142100      
001611     03  FILLER                   PIC X(27)  VALUE                142200      
001612                                   "-------------------------  ". 142300      
001613     03  FILLER                   PIC X(08)  VALUE                142400      
001614                                    "-------".                    142500      
001615     03  FILLER                   PIC X(28)  VALUE                142600      
001616                                   "--------------------------  ".142700      
001617     03  FILLER                   PIC X(08)  VALUE                142800      
001618                                    "-------".                    142900      
001619     03  FILLER                   PIC X(26)  VALUE                143000      
001620                                   "--------------------------".  143100      
001621*                                                                 143200      
001622 01  REP2-DET1.                                                   143300      
001623     03  R2D1-CSI-ORI             PIC X(03).                      143400      
001624     03  FILLER                   PIC X(01).                      143500      
001625     03  R2D1-APL-ORI             PIC X(04).                      143600      
001626     03  FILLER                   PIC X(01).                      143700      
001627     03  R2D1-CSI-DES             PIC X(03).                      143800      
001628     03  FILLER                   PIC X(01).                      143900      
001629     03  R2D1-APL-DES             PIC X(04).                      144000      
001630     03  FILLER                   PIC X(01).                      144100      
001631     03  R2D1-STA-NAME            PIC X(08).                      144200      
001632     03  FILLER                   PIC X(01).                      144300      
001633     03  R2D1-N-AUTOR             PIC X(20).                      144400      
001634     03  FILLER                   PIC X(01).                      144500      
001635     03  R2D1-CTA-DES             PIC X(22).                      144600      
001636     03  FILLER                   PIC X(02).                      144700      
001637     03  R2D1-TIPO-MOV            PIC X(03).                      144800      
001638     03  FILLER                   PIC X(01).                      144900      
001639     03  R2D1-IMPORTE             PIC ZZZZZZZZZZZZZZZ,ZZ9.99.     145000      
001640     03  FILLER                   PIC X(02).                      145100      
001641     03  R2D1-STATUS              PIC Z9.                         145200      
001642     03  FILLER                   PIC X(01).                      145300      
001643     03  R2D1-MONEDA              PIC ZZ9.                        145400      
001644     03  FILLER                   PIC X(01).                      145500      
001645     03  R2D1-FEC-CON             PIC 9(06).                      145600      
001646     03  FILLER                   PIC X(01).                      145700      
001647     03  R2D1-HH-GEN              PIC 99.                         145800      
001648     03  FILLER                   PIC X VALUE ":".                145820      
001649     03  R2D1-MM-GEN              PIC 99.                         145840      
001650     03  FILLER                   PIC X(01).                      145900      
001651     03  R2D1-ERRORES             PIC X(12).                      146000      
001652     03  R2D1-ERRORES-R           REDEFINES R2D1-ERRORES          146100      
001653                                  OCCURS  12 TIMES.               146200      
001654         05  R2D1-ERR             PIC X(01).                      146300      
001655/                                                                 146400      
001656 01  REP2-DET2.                                                   146500      
001657     03  FILLER                   PIC X(17) VALUE SPACES.         146600      
001658     03  FILLER                   PIC X(12) VALUE "CTA-ACCESO: ". 146700      
001659     03  R2D2-CTA-ACC             PIC X(20).                      146800      
001660     03  FILLER                   PIC X(03) VALUE SPACES.         146900      
001661     03  FILLER                   PIC X(05) VALUE "REF: ".        147000      
001662     03  R2D2-REF-OPE             PIC X(20).                      147100      
001663     03  FILLER                   PIC X(03) VALUE SPACES.         147200      
001664     03  FILLER                   PIC X(09) VALUE "CVE-MOV: ".    147300      
001665     03  R2D2-SUB-SER             PIC X(03).                      147400      
001666     03  FILLER                   PIC X(03) VALUE SPACES.         147500      
001667     03  FILLER                   PIC X(11) VALUE "FECHA-GEN: ".  147600      
001668     03  R2D2-FEC-GEN             PIC 99/99/99.                   147700      
001669     03  FILLER                   PIC X(18) VALUE SPACES.         147800      
001670*                                                                 147900      
001671 01  REP2-DET3.                                                   148000      
001672     03  R2D3-TOT                 PIC X(14)  VALUE SPACES.        148100      
001673     03  FILLER                   PIC X(01)  VALUE SPACES.        148200      
001674     03  R2D3-LEY                 PIC X(11).                      148300      
001675     03  R2D3-LEY-R1              REDEFINES R2D3-LEY.             148400      
001676         05 R2D3-CVE-MON          PIC ZZ9.                        148500      
001677         05 FILLER                PIC X(08).                      148600      
001678     03  R2D3-LEY-R2              REDEFINES R2D3-LEY.             148700      
001679         05 R2D3-CSI-ORI          PIC X(11).                      148800      
001680     03  R2D3-LEY-R3              REDEFINES R2D3-LEY.             148900      
001681         05 R2D3-APL-ORI          PIC X(07).                      149000      
001682         05 FILLER                PIC X(04).                      149100      
001683     03  R2D3-LEY-R4              REDEFINES R2D3-LEY.             149200      
001684         05 R2D3-CSI-DES          PIC X(11).                      149300      
001685     03  R2D3-LEY-R5              REDEFINES R2D3-LEY.             149400      
001686         05 R2D3-STATUS           PIC X(02).                      149500      
001687         05 R2D3-LEY-STATUS       PIC X(09).                      149600      
001688     03  FILLER                   PIC X(01)  VALUE SPACES.        149700      
001689     03  R2D3-NC                  PIC ZZZZZ9 VALUE ZEROES.        149800      
001690     03  FILLER                   PIC X(02)  VALUE SPACES.        149900      
001691     03  R2D3-IC                  PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99. 150000      
001692     03  FILLER                   PIC X(01)  VALUE SPACES.        150100      
001693     03  R2D3-NA                  PIC ZZZZZ9 VALUE ZEROES.        150200      
001694     03  FILLER                   PIC X(02)  VALUE SPACES.        150300      
001695     03  R2D3-IA                  PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99-.150400      
001696     03  FILLER                   PIC X(01)  VALUE SPACES.        150500      
001697     03  R2D3-NCA                 PIC ZZZZZ9 VALUE ZEROES.        150600      
001698     03  FILLER                   PIC X(02)  VALUE SPACES.        150700      
001699     03  R2D3-ICA                 PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99. 150800      
001700/                                                                 150900      
001701 01  WS-STATUS-LEY.                                               151000      
001702     03 FILLER                    PIC X(09) VALUE                 151100      
001703        "/ENVIADO ".                                              151200      
001704     03 FILLER                    PIC X(09) VALUE                 151300      
001705        "/APLICADO".                                              151400      
001706     03 FILLER                    PIC X(09) VALUE                 151500      
001707        "/OPERADO ".                                              151600      
001708     03 FILLER                    PIC X(09) VALUE                 151700      
001709        "/DENEGADO".                                              151800      
001710     03 FILLER                    PIC X(09) VALUE                 151900      
001711        "/PENDIENT".                                              152000      
001712     03 FILLER                    PIC X(09) VALUE                 152100      
001713        "/INVALIDO".                                              152200      
001714 01  WS-STATUS-LEY-R              REDEFINES WS-STATUS-LEY.        152300      
001715     03 WS-STA-OCC                OCCURS   6 TIMES.               152400      
001716        05 WS-STA-LEY             PIC X(09).                      152500      
001717*                                                                 152600      
001718 01  WS-TOTAL-LEY.                                                152700      
001719     03 FILLER                    PIC X(14) VALUE                 152800      
001720        ">>>>> T.STATUS".                                         152900      
001721     03 FILLER                    PIC X(14) VALUE                 153000      
001722        ">>>> T.CSI-DES".                                         153100      
001723     03 FILLER                    PIC X(14) VALUE                 153200      
001724        ">>> T. APL-ORI".                                         153300      
001725     03 FILLER                    PIC X(14) VALUE                 153400      
001726        ">> TOT.CSI-ORI".                                         153500      
001727     03 FILLER                    PIC X(14) VALUE                 153600      
001728        "> TOTAL MONEDA".                                         153700      
001729     03 FILLER                    PIC X(14) VALUE                 153800      
001730        "TOTAL GENERAL ".                                         153900      
001731 01  WS-TOTAL-LEY-R               REDEFINES WS-TOTAL-LEY.         154000      
001732     03 WS-TOT-OCC                OCCURS   6 TIMES.               154100      
001733        05 WS-TOT-LEY             PIC X(14).                      154200      
001734*                                                                 154300      
001735 01  MENSAJES-IMPRESION.                                          154400      
001736     03  MENSAJE-TOTALES.                                         154500      
001737         05  MEN-SISTEMA.                                         154600      
001738             07  FILLER           PIC X(04) VALUE "TOT.".         154700      
001739             07  M-SIST           PIC X(07) VALUE SPACES.         154800      
001740         05  MEN-MONEDA.                                          154900      
001741             07  FILLER           PIC X(08) VALUE "TMONEDA ".     155000      
001742             07  M-MON            PIC ZZ9.                        155100      
001743         05  MEN-FECHA.                                           155200      
001744             07  FILLER           PIC X(03) VALUE "T. ".          155300      
001745             07  M-FEC            PIC 99/99/99.                   155400      
001746*                                                                 155500      
001747 01  REP2-DET4.                                                   155600      
001748     03  FILLER                   PIC X(20) VALUE SPACES.         155700      
001749     03  FILLER                   PIC X(30) VALUE ALL "*".        155800      
001750     03  FILLER                   PIC X(32) VALUE                 155900      
001751         "NO PRESENTO MOVIMIENTOS ERRONEOS".                      156000      
001752     03  FILLER                   PIC X(30) VALUE ALL "*".        156100      
001753     03  FILLER                   PIC X(20) VALUE SPACES.         156200      
001754*                                                                 156300      
001755/                 R E P O R T E   3                               156400      
001756*                                                                 156500      
001757 01 REP3-SUB1.                                                    156600      
001758    03 FILLER                     PIC X(22) VALUE                 156700      
001759       "           AMBITO  ".                                     156800      
001760    03 FILLER                     PIC X(41) VALUE                 156900      
001761       "NUM.REGS.        C  A  R  G  O  S     ".                  157000      
001762    03 FILLER                     PIC X(42) VALUE                 157100      
001763       "NUM.REGS.        A  B  O  N  O  S     ".                  157200      
001764    03 FILLER                     PIC X(27) VALUE                 157300      
001765       "   D I F E R E N C I A    ".                              157400      
001766*                                                                 157500      
001767 01 REP3-SUB2.                                                    157600      
001768    03 FILLER                     PIC X(22) VALUE                 157700      
001769       "          ---------".                                     157800      
001770    03 FILLER                     PIC X(41) VALUE                 157900      
001771       "---------   --------------------------".                  158000      
001772    03 FILLER                     PIC X(42) VALUE                 158100      
001773       "---------   --------------------------".                  158200      
001774    03 FILLER                     PIC X(27) VALUE                 158300      
001775       "--------------------------".                              158400      
001776*                                                                 158500      
001777 01 REP3-SUB3.                                                    158600      
001778    03 FILLER                     PIC X(17) VALUE                 158700      
001779       "FECHA CONTABLE : ".                                       158800      
001780    03 R3S3-FEC-CONT              PIC 99/99/99.                   158900      
001781    03 FILLER                     PIC X(107) VALUE SPACES.        159000      
001782*                                                                 159100      
001783 01 REP3-SUB4.                                                    159200      
001784    03 FILLER                     PIC X(14) VALUE                 159300      
001785       "    SISTEMA : ".                                          159400      
001786    03 R3S4-SISTEMA               PIC X(20) VALUE SPACES.         159500      
001787    03 FILLER                     PIC X(98) VALUE SPACES.         159600      
001788/                                                                 159700      
001789 01 REP3-DET1.                                                    159800      
001790    03 R3D1-LEY                   PIC X(22) VALUE SPACES.         159900      
001791    03 R3D1-NCAR                  PIC ZZZZZZZ9.                   160000      
001792    03 FILLER                     PIC X(02) VALUE SPACES.         160100      
001793    03 R3D1-ICAR                PIC $$$$$,$$$,$$$,$$$,$$$,$$9.99. 160200      
001794    03 FILLER                     PIC X(03) VALUE SPACES.         160300      
001795    03 R3D1-NABO                  PIC ZZZZZZZ9.                   160400      
001796    03 FILLER                     PIC X(02) VALUE SPACES.         160500      
001797    03 R3D1-IABO                PIC $$$$$,$$$,$$$,$$$,$$$,$$9.99. 160600      
001798    03 FILLER                     PIC X(02) VALUE SPACES.         160700      
001799    03 R3D1-IDIF                PIC $$$$$,$$$,$$$,$$$,$$$,$$9.99-.160800      
001800*                                                                 160900      
001801 01 WS-R3D1-LEYENDA.                                              161000      
001802    03 FILLER                     PIC X(22) VALUE                 161100      
001803       "          LOCAL....   ".                                  161200      
001804    03 FILLER                     PIC X(22) VALUE                 161300      
001805       "          FORANEO..   ".                                  161400      
001806    03 FILLER                     PIC X(22) VALUE                 161500      
001807       "       T.   OPERADO   ".                                  161600      
001808    03 FILLER                     PIC X(22) VALUE                 161700      
001809       "       T. PENDIENTE   ".                                  161800      
001810    03 FILLER                     PIC X(22) VALUE                 161900      
001811       "    T. SISTEMA ZZZZ   ".                                  162000      
001812    03 FILLER                     PIC X(22) VALUE                 162100      
001813       "  T. FECHA 99/99/99   ".                                  162200      
001814    03 FILLER                     PIC X(22) VALUE                 162300      
001815       ">> TOTAL GENERAL >>   ".                                  162400      
001816*                                                                 162500      
001817 01 WS-R3D1-LEYENDA-A             REDEFINES WS-R3D1-LEYENDA.      162600      
001818    03 FILLER                     PIC X(103).                     162700      
001819    03 WS-R3D1-APL-ORI            PIC X(004).                     162800      
001820    03 FILLER                     PIC X(047).                     162900      
001821*                                                                 163000      
001822 01 WS-R3D1-LEYENDA-F             REDEFINES WS-R3D1-LEYENDA.      163100      
001823    03 FILLER                     PIC X(121).                     163200      
001824    03 WS-R3D1-FEC-CON            PIC 99/99/99.                   163300      
001825    03 FILLER                     PIC X(25).                      163400      
001826*                                                                 163500      
001827 01 WS-R3D1-LEYENDA-O.                                            163600      
001828    03 WS-R3D1-LEY                PIC X(22) OCCURS 7 TIMES.       163700      
001829*                                                                 163800      
001830/                 R E P O R T E   4                               163900      
001831*                                                                 164000      
001832 01 REP4-SUB1.                                                    164100      
001833    03 FILLER                     PIC X(14) VALUE                 164200      
001834       "*** N O D O : ".                                          164300      
001835    03 R4S1-NODO                  PIC X(20) VALUE SPACES.         164400      
001836*                                                                 164500      
001837 01 REP4-SUB2.                                                    164600      
001838    03 FILLER                     PIC X(34) VALUE                 164700      
001839       "              NOMBRE ESTACION     ".                      164800      
001840    03 FILLER                     PIC X(45) VALUE                 164900      
001841       "NUM.REGS.          C  A  R  G  O  S     ".                165000      
001842    03 FILLER                     PIC X(53) VALUE                 165100      
001843       "NUM.REGS.          A  B  O  N  O  S     ".                165200      
001844*                                                                 165300      
001845 01 REP4-SUB3.                                                    165400      
001846    03 FILLER                     PIC X(34) VALUE                 165500      
001847       "              ---------------     ".                      165600      
001848    03 FILLER                     PIC X(45) VALUE                 165700      
001849       "---------     -------------------------- ".               165800      
001850    03 FILLER                     PIC X(53) VALUE                 165900      
001851       "---------     -------------------------- ".               166000      
001852*                                                                 166100      
001853 01 REP4-DET1.                                                    166200      
001854    03 R4D1-LEY                   PIC X(34) VALUE SPACES.         166300      
001855    03 R4D1-NCAR                  PIC ZZZZZZZ9.                   166400      
001856    03 FILLER                     PIC X(04) VALUE SPACES.         166500      
001857    03 R4D1-ICAR                PIC $$$$$,$$$,$$$,$$$,$$$,$$9.99. 166600      
001858    03 FILLER                     PIC X(05) VALUE SPACES.         166700      
001859    03 R4D1-NABO                  PIC ZZZZZZZ9.                   166800      
001860    03 FILLER                     PIC X(04) VALUE SPACES.         166900      
001861    03 R4D1-IABO                PIC $$$$$,$$$,$$$,$$$,$$$,$$9.99. 167000      
001862    03 FILLER                     PIC X(13) VALUE SPACES.         167100      
001863*                                                                 167200      
001864 01 WS-R4D1-LEYENDA.                                              167300      
001865    03 FILLER                     PIC X(34) VALUE                 167400      
001866       "                X XXXX X XX       ".                      167500      
001867    03 FILLER                     PIC X(34) VALUE                 167600      
001868       "           > TOTAL DEL NODO >     ".                      167700      
001869    03 FILLER                     PIC X(34) VALUE                 167800      
001870       "    >> TOTAL GENERAL NODOS >>     ".                      167900      
001871*                                                                 168000      
001872 01 WS-R4D1-LEYENDA-E             REDEFINES WS-R4D1-LEYENDA.      168100      
001873    03 FILLER                     PIC X(16).                      168200      
001874    03 WS-R4D1-STA-NAME           PIC XBXXXXBXBXX.                168300      
001875    03 FILLER                     PIC X(75).                      168400      
001876*                                                                 168500      
001877 01 WS-R4D1-LEYENDA-O             REDEFINES WS-R4D1-LEYENDA.      168600      
001878    03 WS-R4D1-LEY                PIC X(34) OCCURS 3 TIMES.       168700      
001879*                                                                 168800      
001880/                 R E P O R T E   5                               168900      
001881 01 REP5-SUB1.                                                    169000      
001882    03 FILLER                     PIC X(17) VALUE                 169100      
001883       "FECHA CONTABLE : ".                                       169200      
001884    03 R5S1-FEC-CONT              PIC 99/99/99.                   169300      
001885    03 FILLER                     PIC X(107) VALUE SPACES.        169400      
001886*                                                                 169500      
001887 01 REP5-SUB2.                                                    169600      
001888    03 FILLER                     PIC X(14) VALUE                 169700      
001889       "    SISTEMA : ".                                          169800      
001890    03 R5S2-SISTEMA               PIC X(20) VALUE SPACES.         169900      
001891    03 FILLER                     PIC X(98) VALUE SPACES.         170000      
001892*                                                                 170100      
001893 01  REP5-SUB3.                                                   170200      
001894     03  FILLER                   PIC X(39) VALUE                 170300      
001895         "CSI APL   NOMBRE        CLAVE DE       ".               170400      
001896     03  FILLER                   PIC X(55) VALUE                 170500      
001897        "                       TIPO                        CVE ".170600      
001898     03  FILLER                   PIC X(38) VALUE                 170700      
001899         "    FECHA  HORA                       ".                170800      
001900*                                                                 170900      
001901 01  REP5-SUB4.                                                   171000      
001902     03  FILLER                   PIC X(39) VALUE                 171100      
001903         "DES DES  ESTACION     AUTORIZACION     ".               171200      
001904     03  FILLER                   PIC X(55) VALUE                 171300      
001905        "    CUENTA-DESTINO      MOV      I M P O R T E     MOV ".171400      
001906     03  FILLER                   PIC X(38) VALUE                 171500      
001907         "MON  CONT.  GEN.   CUENTA DE ACCESO   ".                171600      
001908*                                                                 171700      
001909 01  REP5-SUB5.                                                   171800      
001910     03  FILLER                   PIC X(39) VALUE                 171900      
001911         "--- ---- -------- -------------------- ".               172000      
001912     03  FILLER                   PIC X(55) VALUE                 172100      
001913        "---------------------- ---- ---------------------- --- ".172200      
001914     03  FILLER                   PIC X(38) VALUE                 172300      
001915         "--- ------ ----- -------------------- ".                172400      
001916/                                                                 172500      
001917 01  REP5-DET1.                                                   172600      
001918     03  R5D1-CSI-DES             PIC X(03).                      172700      
001919     03  FILLER                   PIC X(01).                      172800      
001920     03  R5D1-APL-DES             PIC X(04).                      172900      
001921     03  FILLER                   PIC X(01).                      173000      
001922     03  R5D1-STA-NAME            PIC X(08).                      173100      
001923     03  FILLER                   PIC X(01).                      173200      
001924     03  R5D1-N-AUTOR             PIC X(20).                      173300      
001925     03  FILLER                   PIC X(01).                      173400      
001926     03  R5D1-CTA-DES             PIC X(22).                      173500      
001927     03  FILLER                   PIC X(02).                      173600      
001928     03  R5D1-TIPO-MOV            PIC X(03).                      173700      
001929     03  FILLER                   PIC X(01).                      173800      
001930     03  R5D1-IMPORTE             PIC ZZZZZZZZZZZZZZZ,ZZ9.99.     173900      
001931     03  FILLER                   PIC X(01).                      174000      
001932     03  R5D1-SUB-SER             PIC X(03).                      174100      
001933     03  FILLER                   PIC X(01).                      174200      
001934     03  R5D1-MONEDA              PIC ZZ9.                        174300      
001935     03  FILLER                   PIC X(01).                      174400      
001936     03  R5D1-FEC-CON             PIC 9(06).                      174500      
001937     03  FILLER                   PIC X(01).                      174600      
001938     03  R5D1-HH-GEN              PIC 99.                         174700      
001939     03  FILLER                   PIC X VALUE ":".                174720      
001940     03  R5D1-MM-GEN              PIC 99.                         174740      
001941     03  FILLER                   PIC X(01).                      174800      
001942     03  R5D1-CTA-ACC             PIC X(20).                      174900      
001943     03  FILLER                   PIC X(01).                      175000      
001944*                                                                 175100      
001945 01  REP5-DET2.                                                   175200      
001946     03  R5D2-LEY                 PIC X(27).                      175300      
001947     03  FILLER                   PIC X(06)  VALUE SPACES.        175400      
001948     03  FILLER                   PIC X(09)  VALUE " CARGOS: ".   175500      
001949     03  R5D2-NCAR                PIC ZZZZZ9 VALUE ZEROES.        175600      
001950     03  FILLER                   PIC X(02)  VALUE SPACES.        175700      
001951     03  R5D2-ICAR                PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99. 175800      
001952     03  FILLER                   PIC X(06)  VALUE SPACES.        175900      
001953     03  FILLER                   PIC X(09)  VALUE " ABONOS: ".   176000      
001954     03  R5D2-NABO                PIC ZZZZZ9 VALUE ZEROES.        176100      
001955     03  FILLER                   PIC X(02)  VALUE SPACES.        176200      
001956     03  R5D2-IABO                PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99-.176300      
001957     03  FILLER                   PIC X(06)  VALUE SPACES.        176400      
001958*                                                                 176500      
001959 01 WS-R5D2-LEYENDA.                                              176600      
001960    03 FILLER                     PIC X(27) VALUE                 176700      
001961       "        TOTAL SISTEMA ZZZZ".                              176800      
001962    03 FILLER                     PIC X(27) VALUE                 176900      
001963       "      TOTAL FECHA 99/99/99".                              177000      
001964    03 FILLER                     PIC X(27) VALUE                 177100      
001965       ">>> TOTAL GENERAL >>>     ".                              177200      
001966*                                                                 177300      
001967 01 WS-R5D2-LEYENDA-A             REDEFINES WS-R5D2-LEYENDA.      177400      
001968    03 FILLER                     PIC X(022).                     177500      
001969    03 WS-R5D2-APL-ORI            PIC X(004).                     177600      
001970    03 FILLER                     PIC X(055).                     177700      
001971*                                                                 177800      
001972 01 WS-R5D2-LEYENDA-F             REDEFINES WS-R5D2-LEYENDA.      177900      
001973    03 FILLER                     PIC X(045).                     178000      
001974    03 WS-R5D2-FEC-CON            PIC 99/99/99.                   178100      
001975    03 FILLER                     PIC X(28).                      178200      
001976*                                                                 178300      
001977 01 WS-R5D2-LEYENDA-O             REDEFINES WS-R5D2-LEYENDA.      178400      
001978    03 WS-R5D2-LEY                PIC X(27) OCCURS 3 TIMES.       178500      
001979/                                                                 178600      
001980 01 WS-EDIT-CTADES.                                               178700      
001981    03 WS-SUC-CTADES              PIC Z(12)9.                     178800      
001982    03 FILLER                     PIC X(01) VALUE SPACES.         178900      
001983    03 WS-CTA-CTADES              PIC Z(05)99.                    179000      
001984*                                                                 179100      
001985 01 WS-PARTE-CTADES.                                              179200      
001986    03 WS-PARTE-SUC               PIC 9(13).                      179300      
001987    03 WS-PARTE-CTA               PIC 9(07).                      179400      
001988*                                                                 179500      
001989 01  CONTADORES-WS                COMP .                          179600      
001990     02  WS-CONT-R0-HOJAS         PIC 9(04).                      179700      
001991     02  WS-CONT-R0-LIN           PIC 9(02).                      179800      
001992         88 CONT-R0-LIN-56        VALUES ARE 1 THRU 56.           179900      
001993         88 CONT-R0-LIN-60        VALUES ARE 1 THRU 60.           180000      
001994     02  WS-CONT-R1-HOJAS         PIC 9(04).                      180100      
001995     02  WS-CONT-R1-LIN           PIC 9(02).                      180200      
001996         88 CONT-R1-LIN-50        VALUES ARE 1 THRU 50.           180300      
001997         88 CONT-R1-LIN-56        VALUES ARE 1 THRU 56.           180400      
001998         88 CONT-R1-LIN-60        VALUES ARE 1 THRU 60.           180500      
001999     02  WS-CONT-R2-HOJAS         PIC 9(04).                      180600      
002000     02  WS-CONT-R2-LIN           PIC 9(02).                      180700      
002001         88 CONT-R2-LIN-63        VALUES ARE 1 THRU 63.           180800      
002002         88 CONT-R2-LIN-60        VALUES ARE 1 THRU 60.           180900      
002003     02  WS-CONT-R3-HOJAS         PIC 9(04).                      181000      
002004     02  WS-CONT-R3-LIN           PIC 9(02).                      181100      
002005         88 CONT-R3-LIN-63        VALUES ARE 1 THRU 63.           181200      
002006         88 CONT-R3-LIN-60        VALUES ARE 1 THRU 60.           181300      
002007     02  WS-CONT-R4-HOJAS         PIC 9(04).                      181400      
002008     02  WS-CONT-R4-LIN           PIC 9(02).                      181500      
002009         88 CONT-R4-LIN-63        VALUES ARE 1 THRU 63.           181600      
002010         88 CONT-R4-LIN-60        VALUES ARE 1 THRU 60.           181700      
002011     02  WS-CONT-R5-HOJAS         PIC 9(04).                      181800      
002012     02  WS-CONT-R5-LIN           PIC 9(02).                      181900      
002013         88 CONT-R5-LIN-63        VALUES ARE 1 THRU 63.           182000      
002014         88 CONT-R5-LIN-60        VALUES ARE 1 THRU 60.           182100      
002015     02  WS-CONT-R6-HOJAS         PIC 9(04).                      182200      
002016     02  WS-CONT-R6-LIN           PIC 9(02).                      182300      
002017         88 CONT-R6-LIN-63        VALUES ARE 1 THRU 63.           182400      
002018         88 CONT-R6-LIN-60        VALUES ARE 1 THRU 60.           182500      
002019     02  WS-CONT-R7-HOJAS         PIC 9(04).                      182600      
002020     02  WS-CONT-R7-LIN           PIC 9(02).                      182700      
002021         88 CONT-R7-LIN-63        VALUES ARE 1 THRU 63.           182800      
002022         88 CONT-R7-LIN-60        VALUES ARE 1 THRU 60.           182900      
002023     02  WS-CONT-REG-LOGCCR       PIC 9(08).                      183000      
002024     02  WS-CONT-REG-INFOICA      PIC 9(08).                      183100      
002025     02  WS-CONT-REG-BD           PIC 9(08).                      183200      
002026     02  WS-CONT-LEC-BD           PIC 9(02).                      183300      
002027         88 CONT-LEC-1-18         VALUES ARE 1 THRU 18.           183400      
002028     02  WS-CONT-REG-NODO         PIC 9(08).                      183500      
002029     02  WS-CONT-TERM             PIC 9(03).                      183600      
002030     02  WS-CONT-REG              PIC 9(08).                      183700      
002031     02  FILLER                   PIC 9(01).                      183800      
002032/                                                                 183900      
002033 01  TOTALES-WS                   COMP .                          184000      
002034     02  TOT-CSIS-WS              PIC  9(02).                     184100      
002035     02  SALDO-CALCULADO-WS       PIC S9(18)V9(02).               184200      
002036     02  IMPORTE-NEGATI           PIC S9(18)V9(02).               184300      
002037     02  IMPORTE-ENTERO           PIC  9(16)V9(02).               184400      
002038*                                                                 184500      
002039 01  WS-IMPORTES-TRAILER.                                         184600      
002040     02  WS-IT-IDENT              PIC X(07).                      184700      
002041     02  WS-IT-NCO                PIC 9(05).                      184800      
002042     02  WS-IT-ICO                PIC 9(14)V99.                   184900      
002043     02  WS-IT-NAO                PIC 9(05).                      185000      
002044     02  WS-IT-IAO                PIC 9(14)V99.                   185100      
002045     02  WS-IT-NCA                PIC 9(05).                      185200      
002046     02  WS-IT-ICA                PIC 9(14)V99.                   185300      
002047     02  WS-IT-NAA                PIC 9(05).                      185400      
002048     02  WS-IT-IAA                PIC 9(14)V99.                   185500      
002049     02  FILLER                   PIC X(89).                      185600      
002050*                                                                 185700      
002051 01 WS-TOTALES-SISTEMA            COMP          .                 185800      
002052    03 WS-TS-OPER-APLI-WS         OCCURS   5 TIMES.               185900      
002053       05 WS-TS-CARGO-ABONO-WS    OCCURS   3 TIMES.               186000      
002054          07 WS-NUM-SIS           PIC S9(06).                     186100      
002055          07 WS-IMP-SIS           PIC S9(18)V9(02).               186200      
002056*                                                                 186300      
002057 01 WS-TOTALES-MONEDA             COMP          .                 186400      
002058    03 WS-TM-OPER-APLI-WS         OCCURS   5 TIMES.               186500      
002059       05 WS-TM-CARGO-ABONO-WS    OCCURS   3 TIMES.               186600      
002060          07  WS-NUM-MON          PIC S9(06).                     186700      
002061          07  WS-IMP-MON          PIC S9(18)V9(02).               186800      
002062    03  SALDO-GRAL-MON            PIC S9(17)V9(02).               186900      
002063/                                                                 187000      
002064 01 WS-TOTALES-FECHA              COMP          .                 187100      
002065    03 WS-TF-OPER-APLI-WS         OCCURS   5 TIMES.               187200      
002066       05 WS-TF-CARGO-ABONO-WS    OCCURS   3 TIMES.               187300      
002067          07  WS-NUM-FEC          PIC S9(06).                     187400      
002068          07  WS-IMP-FEC          PIC S9(18)V9(02).               187500      
002069    03  SALDO-GRAL-FEC            PIC S9(17)V9(02).               187600      
002070*                                                                 187700      
002071 01 WS-LLAVE-COMP-BACK.                                           187800      
002072    03 LLAVE-COMP-BACK            PIC 9(18).                      187900      
002073    03 LLAVE-COMP-BACK-R          REDEFINES LLAVE-COMP-BACK.      188000      
002074       05 FECHA-BACK              PIC 9(06).                      188100      
002075       05 CSI-LOCAL-BACK          PIC 9(02).                      188200      
002076       05 MONEDA-BACK             PIC 9(03).                      188300      
002077       05 APL-ORI-BACK            PIC 9(04).                      188400      
002078       05 CSI-FORANEO-BACK        PIC 9(02).                      188500      
002079       05 FILLER                  PIC 9(01).                      188600      
002080*                                                                 188700      
002081 01 WS-LLAVE-COMP.                                                188800      
002082    03 LLAVE-COMP-WS.                                             188900      
002083       05 FECHA-WS                PIC 9(06).                      189000      
002084       05 CSI-LOCAL-WS            PIC 9(02).                      189100      
002085          88 CSI-LOCAL-WS-VALIDO  VALUES ARE 1,2,4,6,10.          189200      
002086       05 MONEDA-WS               PIC 9(03).                      189300      
002087       05 APL-ORI-WS              PIC 9(04).                      189400      
002088          88 APL-ORI-LOGCCR       VALUE 0001 THRU 0005.           189500      
002089       05 APL-ORI-WS-R            REDEFINES  APL-ORI-WS.          189600      
002090          07 FILLER               PIC 9(01).                      189700      
002091          07 SIS-WS               PIC 9(03).                      189800      
002092       05 CSI-FORANEO-WS          PIC 9(02).                      189900      
002093       05 FILLER                  PIC 9(01).                      190000      
002094*                                                                 190100      
002095 01 WS-CAMPOS-COMP.                                               190200      
002096    03 WS-CC-FECHA                PIC 9(06) COMP VALUE 999999.    190300      
002097*                                                                 190400      
002098*                                                                 190500      
002099 01  TABLA-DATOS-CSIS             COMP.                           190600      
002100     03  MON-TDC                  PIC 9(03).                      190700      
002101     03  FILLER                   PIC 9(01).                      190800      
002102     03  CSI-LOCAL-TDC            OCCURS  20 TIMES.               190900      
002103         04 CSI-FOR-TDC           OCCURS  20 TIMES.               191000      
002104            05 OPER-APLI-TDC      OCCURS   2 TIMES.               191100      
002105               06 NUM-CARGOS-TDC  PIC S9(07).                     191200      
002106               06 NUM-ABONOS-TDC  PIC S9(07).                     191300      
002107               06 IMP-CARGOS-TDC  PIC S9(15)V9(02).               191400      
002108               06 IMP-ABONOS-TDC  PIC S9(15)V9(02).               191500      
002109*                                                                 191600      
002110/                                                                 191700      
002111 01  OPER-APLI-ACUM.                                              191800      
002112     02  TAB-ACUM.                                                191900      
002113         03  ACUMULADOR      COMP OCCURS   7 TIMES.               192000      
002114             04  NUM-CARGOS-ACUM  PIC S9(06).                     192100      
002115             04  IMP-CARGOS-ACUM  PIC S9(18)V99.                  192200      
002116             04  NUM-ABONOS-ACUM  PIC S9(06).                     192300      
002117             04  IMP-ABONOS-ACUM  PIC S9(18)V99.                  192400      
002118*                                                                 192500      
002119 01  OPER-APLI-TOT.                                               192600      
002120     02  TAB-TOT.                                                 192700      
002121         03  TOTALIZADOR     COMP OCCURS   5 TIMES.               192800      
002122             04  NUM-CARGOS-TOT   PIC S9(06).                     192900      
002123             04  IMP-CARGOS-TOT   PIC S9(18)V99.                  193000      
002124             04  NUM-ABONOS-TOT   PIC S9(06).                     193100      
002125             04  IMP-ABONOS-TOT   PIC S9(18)V99.                  193200      
002126*                                                                 193300      
002127 01  OPER-APLI-ACUM-ELIM.                                         193400      
002128     02  TAB-AELIM.                                               193500      
002129         03  ACUM-ELIMINA    COMP OCCURS   6 TIMES.               193600      
002130             04  NUM-CARGOS-AELIM PIC S9(06).                     193700      
002131             04  IMP-CARGOS-AELIM PIC S9(18)V99.                  193800      
002132             04  NUM-ABONOS-AELIM PIC S9(06).                     193900      
002133             04  IMP-ABONOS-AELIM PIC S9(18)V99.                  194000      
002134             04  NUM-CARABO-AELIM PIC S9(06).                     194100      
002135             04  IMP-CARABO-AELIM PIC S9(18)V99.                  194200      
002136*                                                                 194300      
002137 01  WS-APL-ORI-PTE               PIC 9(04).                      194400      
002138 01  WS-MON-X                     PIC X(03).                      194500      
002139 01  WS-MON                       REDEFINES WS-MON-X              194600      
002140                                  PIC 9(03).                      194700      
002141*                                                                 194800      
002142/                                                                 194900      
002143 01  AUXILIARES-WS.                                               195000      
002144    02 WS-FECHA-DMA               PIC 9(08).                      195002      
002145    02 WS-FECHA-DMA-R REDEFINES WS-FECHA-DMA.                     195004      
002146       03 WS-FE-DMA-DIA           PIC 9(02).                      195006      
002147       03 WS-FE-DMA-MES           PIC 9(02).                      195008      
002148       03 WS-FE-DMA-YEAR          PIC 9(04).                      195010      
002149    02 WS-FECHA-AMD               PIC 9(08).                      195012      
002150    02 WS-FECHA-AMD-R REDEFINES WS-FECHA-AMD.                     195014      
002151       03 WS-FE-AMD-YEAR          PIC 9(04).                      195016      
002152       03 WS-FE-AMD-MES           PIC 9(02).                      195018      
002153       03 WS-FE-AMD-DIA           PIC 9(02).                      195020      
002154    02 WS-FEMAQ-DMA               PIC 9(08).                      195022      
002155    02 WS-FEMAQ-DMA-R REDEFINES WS-FEMAQ-DMA.                     195024      
002156       03 WS-FM-DMA-DIA           PIC 9(02).                      195026      
002157       03 WS-FM-DMA-MES           PIC 9(02).                      195028      
002158       03 WS-FM-DMA-YEAR          PIC 9(04).                      195030      
002159    02 WS-FEMAQ-AMD               PIC 9(08).                      195032      
002160    02 WS-FEMAQ-AMD-R REDEFINES WS-FEMAQ-AMD.                     195034      
002161       03 WS-FM-AMD-YEAR          PIC 9(04).                      195036      
002162       03 WS-FM-AMD-MES           PIC 9(02).                      195038      
002163       03 WS-FM-AMD-DIA           PIC 9(02).                      195040      
002164     02  VERSION-WS               PIC 9(08).                      195100      
002165     02  VERS-WS                  REDEFINES VERSION-WS.           195200      
002166         03  DD-VS                PIC 9(02).                      195300      
002167         03  MM-VS                PIC 9(02).                      195400      
002168         03  AA-VS                PIC 9(04).                      195500      
002169*                                                                 195600      
002170     02  FECHA-PROCESO-WS         PIC 9(08).                      195700      
002171     02  FECHA-PROCESO-WS-R       REDEFINES FECHA-PROCESO-WS.     195800      
002172         03 FPROCHOY-DD           PIC  99.                        195900      
002173         03 FPROCHOY-MM           PIC  99.                        196000      
002174         03 FPROCHOY-AA           PIC  9999.                      196100      
002175*                                                                 196200      
002176      02  FECHA-PROCSIG-WS         PIC 9(08).                     196300      
002177      02  FECHA-PROCSIG-WS-R       REDEFINES FECHA-PROCSIG-WS.    196400      
002178          03 FPROCSIG-DD           PIC  99.                       196500      
002179          03 FPROCSIG-MM           PIC  99.                       196600      
002180          03 FPROCSIG-AA           PIC  9999.                     196700      
002181*                                                                 196800      
002182     02 WS-FECHA-INV-PROC         PIC 9(08).                      196900      
002183     02 WS-FECHA-INV-PROC-R       REDEFINES WS-FECHA-INV-PROC.    197000      
002184        05 WS-FINV-AA             PIC 9(04).                      197100      
002185        05 WS-FINV-MM             PIC 9(02).                      197200      
002186        05 WS-FINV-DD             PIC 9(02).                      197300      
002187*                                                                 197400      
002188 02 WS-FECHA-INV-PROC-SIG     PIC 9(08).                          197500      
002189 02 WS-FECHA-INV-PROC-SIG-R   REDEFINES WS-FECHA-INV-PROC-SIG.    197600      
002190    05 WS-FINVS-AA            PIC 9(04).                          197700      
002191    05 WS-FINVS-MM            PIC 9(02).                          197800      
002192    05 WS-FINVS-DD            PIC 9(02).                          197900      
002193*                                                                 198000      
002194     02  FECHA-REAL-WS            PIC 9(08).                      198100      
002195     02  FECH-WS                  REDEFINES FECHA-REAL-WS.        198200      
002196         03  DD-REAL-WS           PIC 9(02).                      198300      
002197         03  MM-REAL-WS           PIC 9(02).                      198400      
002198         03  AA-REAL-WS           PIC 9(04).                      198500      
002199*                                                                 198600      
002200      02  WS-DATE                 PIC  9(8).                      198700      
002201      02  WS-DATE-R               REDEFINES WS-DATE.              198800      
002202          03 WS-DATE-AA           PIC  9999.                      198900      
002203          03 WS-DATE-MM           PIC  99.                        199000      
002204          03 WS-DATE-DD           PIC  99.                        199100      
002205      02  WS-DIA                  PIC  99.                        199200      
002206      02  WS-TIME                 PIC  9(8).                      199300      
002207      02  WS-TIME-R               REDEFINES WS-TIME.              199400      
002208          03 WS-TIMER             PIC  9(6).                      199500      
002209          03 WS-TIMER-R           REDEFINES WS-TIMER.             199600      
002210             05 WS-TIME-HH        PIC  9(2).                      199700      
002211             05 WS-TIME-MM        PIC  9(2).                      199750      
002212             05 WS-TIME-SS        PIC  9(2).                      199800      
002213          03 FILLER               PIC  XX.                        199900      
002214/                                                                 200000      
002215     02  NOMBRE-LOGCCR.                                           200100      
002216         03  FILLER               PIC X(15) VALUE                 200200      
002217                                   "S500/FILE/S151/".             200300      
002218         03  NL-CCR-ABR           PIC 9(02).                      200400      
002219         03  FILLER               PIC X(01) VALUE "/".            200500      
002220         03  NL-CCR-ABRD          PIC 9(02).                      200600      
002221         03  FILLER               PIC X(10) VALUE "/FORANEOS/".   200700      
002222         03  NL-CCR-FEC           PIC 9(06).                      200800      
002223         03  FILLER               PIC X(01) VALUE ".".            200900      
002224*                                                                 201000      
002225     02  NOMBRE-LOGCSI.                                           201100      
002226         03  FILLER               PIC X(22) VALUE                 201200      
002227                                  "S151/XFER/FILE/LOGCSI/".       201300      
002228         03  NL-CSI-ORI           PIC X(03).                      201400      
002229         03  FILLER               PIC X(04) VALUE "VDM/".         201500      
002230         03  NL-CSI-FEC           PIC 9(06).                      201600      
002231         03  NL-CSI-FEC-R         REDEFINES NL-CSI-FEC.           201700      
002232             05  NL-CSI-FEC-AA    PIC 9(02).                      201800      
002233             05  NL-CSI-FEC-MM    PIC 9(02).                      201900      
002234             05  NL-CSI-FEC-DD    PIC 9(02).                      202000      
002235         03  FILLER               PIC X(01) VALUE ".".            202100      
002236*                                                                 202200      
002237    02  NOMBRE-SISTEMAS.                                          202300      
002238         03  FILLER               PIC X(10) VALUE "S151/FILE/".   202400      
002239         03  NS-REG-O-CORP        PIC X(13).                      202500      
002240         03  FILLER               PIC X(01) VALUE ".".            202600      
002241*                                                                 202700      
002242    02  WS-NS-REG                 PIC X(13) VALUE "SISTEMAS     ".202800      
002243    02  WS-NS-CORP                PIC X(13) VALUE "GUARDIAN/CORP".202900      
002244*                                                                 203000      
002245    02  SUC-WS                    PIC 9(03) COMP.                 203100      
002246    02  CTA-WS                    PIC 9(10) COMP.                 203200      
002247    02  DATO-DUMMY                PIC 9(01) COMP.                 203300      
002248    02  WS-N-AUTOR-ANT            PIC X(20).                      203400      
002249    02  WS-SIS-SIGLAS             PIC X(02).                      203500      
002250    02  WS-SISTEMA-LG             PIC X(14).                      203600      
002251    02  WS-SISTEMA-LG-R           REDEFINES WS-SISTEMA-LG.        203700      
002252        03  WS-SIS-LG             PIC Z(04).                      203800      
002253        03  FILLER                PIC X(10).                      203900      
002254    02  WS-SISTEMA-CR             PIC X(07).                      204000      
002255    02  WS-SISTEMA-CR-R           REDEFINES WS-SISTEMA-CR.        204100      
002256        03  WS-SIS-CR             PIC Z(04).                      204200      
002257        03  FILLER                PIC X(03).                      204300      
002258*                                                                 204400      
002259    02  WS-SIS-PASO-PROC          PIC 9(06) VALUE 0.              204500      
002260*                                                                 204600      
002261     02  FECHA-CARGA-WS           PIC 9(06).                      204700      
002262     02  HORA-CARGA-WS            PIC 9(04).                      204800      
002263*                                                                 204900      
002264     02  REG-WS                   PIC X(126).                     205000      
002265     02  NUM-PROCESO-WS           PIC 9(02) COMP  .               205100      
002266     02  DUMMY-WS                 PIC 9(02).                      205200      
002267     02  HORA-MAQ-WS              PIC 9(11) COMP  .               205300      
002268     02  FILLER                   PIC 9(01) COMP  .               205400      
002269     02  CSI-ORI-ANT              PIC 9(02).                      205500      
002270*                                                                 205600      
002271/                                                                 205700      
002272 01  IDENTIFICADORES-WS.                                          205800      
002273     02  IND-VACIO                PIC 9(01).                      205900      
002274     02  IND-TAB                  PIC 9(03).                      206000      
002275         88 IND-TAB-VAL           VALUES ARE 0 THRU 99.           206100      
002276     02  IND-PEN                  PIC 9(03).                      206200      
002277         88 IND-PEN-VAL           VALUES ARE 0 THRU 99.           206300      
002278     02  IND-1                    PIC 9(03).                      206400      
002279     02  IND-2                    PIC 9(03).                      206500      
002280     02  IND-SW-SUBTIT            PIC 9(01).                      206600      
002281         88  SW-SUBTIT            VALUE 1.                        206700      
002282     02  WS-FIN-LOG-CCR           PIC 9(01).                      206800      
002283         88 FIN-LOG-CCR           VALUE 1.                        206900      
002284     02  WS-FIN-INFOICA           PIC 9(01).                      207000      
002285         88 FIN-INFOICA           VALUE 1.                        207100      
002286     02  WS-FIN-LOG-SORT1         PIC 9(01).                      207200      
002287         88 FIN-LOG-SORT1         VALUE 1.                        207300      
002288     02  WS-FIN-LOG-SORT2         PIC 9(01).                      207400      
002289         88 FIN-LOG-SORT2         VALUE 1.                        207500      
002290     02  WS-FIN-LOG-SORT3         PIC 9(01).                      207600      
002291         88 FIN-LOG-SORT3         VALUE 1.                        207700      
002292     02  WS-FIN-LOG-SORT4         PIC 9(01).                      207800      
002293         88 FIN-LOG-SORT4         VALUE 1.                        207900      
002294     02  WS-FIN-LOG-SORT5         PIC 9(01).                      208000      
002295         88 FIN-LOG-SORT5         VALUE 1.                        208100      
002296     02  WS-FIN-BD                PIC 9(01).                      208200      
002297         88 FIN-BD                VALUE 1.                        208300      
002298*                                                                 208400      
002299     02  EXISTE-REGISTRO-WS       PIC 9(01).                      208500      
002300         88  EXISTE-REGISTRO      VALUE 1.                        208600      
002301     02  WS-ENCONTRE-SIST         PIC 9(01).                      208700      
002302         88 ENCONTRE-SIST         VALUE 0.                        208800      
002303     02  HAY-TRAILER-WS           PIC 9(01).                      208900      
002304         88  HAY-TRAILER          VALUE 1.                        209000      
002305     02  HAY-DIF-WS               PIC 9(01).                      209100      
002306         88  HAY-DIF              VALUE 1.                        209200      
002307     02  HAY-ELIMINA-WS           PIC 9(01).                      209300      
002308         88  HAY-ELIMINA          VALUE 1.                        209400      
002309     02  SI-ELIMINA-WS            PIC 9(01).                      209500      
002310         88  SI-ELIMINA           VALUE 1.                        209600      
002311     02  WS-FIN-COMPENSACION      PIC 9(01).                      209700      
002312         88 FIN-COMPENSACION      VALUE 1.                        209800      
002313     02  WS-CONF-REPROCESO        PIC X(02).                      209900      
002314         88 CONF-REPROCESO-SI     VALUE "SI".                     210000      
002315         88 CONF-REPROCESO-NO     VALUE "NO".                     210100      
002316         88 CONF-REPRO-VAL        VALUES ARE "SI","NO".           210200      
002317/                                                                 210300      
002318 01  TABLA-MESES.                                                 210400      
002319     03  FILLER                   PIC X(10) VALUE "   ENERO  ".   210500      
002320     03  FILLER                   PIC X(10) VALUE "  FEBRERO ".   210600      
002321     03  FILLER                   PIC X(10) VALUE "   MARZO  ".   210700      
002322     03  FILLER                   PIC X(10) VALUE "   ABRIL  ".   210800      
002323     03  FILLER                   PIC X(10) VALUE "   MAYO   ".   210900      
002324     03  FILLER                   PIC X(10) VALUE "   JUNIO  ".   211000      
002325     03  FILLER                   PIC X(10) VALUE "   JULIO  ".   211100      
002326     03  FILLER                   PIC X(10) VALUE "  AGOSTO  ".   211200      
002327     03  FILLER                   PIC X(10) VALUE "SEPTIEMBRE".   211300      
002328     03  FILLER                   PIC X(10) VALUE " OCTUBRE  ".   211400      
002329     03  FILLER                   PIC X(10) VALUE " NOVIEMBRE".   211500      
002330     03  FILLER                   PIC X(10) VALUE " DICIEMBRE".   211600      
002331 01  TABLA-MESES-RED              REDEFINES TABLA-MESES.          211700      
002332     03  MES                      PIC X(10)                       211800      
002333                                  OCCURS  12 TIMES.               211900      
002334*                                                                 212000      
002335/                                                                 212100      
002336 01  TABLA-CSIS.                                                  212200      
002337     02  FILLER                   PIC X(56) VALUE                 212300      
002338     "01HERNOROESTE   0903CONTADURIA REGIONAL HERMOSILLO  0100".  212400      
002339     02  FILLER                   PIC X(56) VALUE                 212500      
002340     "02INTINTERNAL.  0140CONTADURIA INTERNACIONAL        0200".  212600      
002341     02  FILLER                   PIC X(56) VALUE                 212700      
002342     "03   DESCONOCIDO0000-DESCONOCIDO-                   0000".  212800      
002343     02  FILLER                   PIC X(56) VALUE                 212900      
002344     "04MONNORTE      0904CONTADURIA REGIONAL MONTERREY   0400".  213000      
002345     02  FILLER                   PIC X(56) VALUE                 213100      
002346     "05GUAOCCIDENTE  0902CONTADURIA REGIONAL GUADALAJARA 0500".  213200      
002347     02  FILLER                   PIC X(56) VALUE                 213300      
002348     "06LEOCEN-BAJIO  0901CONTADURIA REGIONAL LEON        6100".  213400      
002349     02  FILLER                   PIC X(56) VALUE                 213500      
002350     "07VERSURESTE    0905CONTADURIA REGIONAL VERACRUZ    0700".  213600      
002351     02  FILLER                   PIC X(56) VALUE                 213700      
002352     "08   DESCONOCIDO0000-DESCONOCIDO-                   0800".  213800      
002353     02  FILLER                   PIC X(56) VALUE                 213900      
002354     "09CENS U R      0906CONTADURIA REGIONAL CENTRO      0900".  214000      
002355     02  FILLER                   PIC X(56) VALUE                 214100      
002356     "10VDMV.DE MEXICO0907CONTADURIA REGIONAL V. DE MEXICO1000".  214200      
002357 01  TAB-CSIS-R                   REDEFINES TABLA-CSIS.           214300      
002358     02  INFO-TAB-CSIS            OCCURS  10 TIMES.               214400      
002359         03  NUM-CSI-TC           PIC 9(02).                      214500      
002360         03  ABR-CSI-TC           PIC X(03).                      214600      
002361         03  NOM-CSI-TC           PIC X(11).                      214700      
002362         03  CONTREG-CSI-TC       PIC 9(04).                      214800      
002363         03  CONREGN-CSI-TC       PIC X(32).                      214900      
002364         03  NODO-CSI-TC          PIC 9(02).                      215000      
002365         03  SUBNODO-CSI-TC       PIC 9(02).                      215100      
002366*                                                                 215200      
002367*RGV 01 WS-DATOS-DEFAULT.                                         215300      
002368*RGV    03 WS-DEF-NODO                PIC 9(02).                  215400      
002369*RGV    03 WS-DEF-SUBNODO             PIC 9(02).                  215500      
002370*                                                                 215600      
002371*                                                                 215700      
002372 01  LIM-CSIS                     PIC 9(02) VALUE 20.             215800      
002373 01  CSIS-VALIDOS-WS              PIC 9(02).                      215900      
002374     88 CSIS-VALIDOS              VALUES ARE 1,2,4,6,10.          216000      
002375/                                                                 216100      
002376* >>> ESTANDAR NOMBRE DE REPORTES >>> SEPARACION POR NODO/SUBNODO 216200      
002377*                                                                 216300      
002378 01  WS-NOMB-REPORTE.                                             216400      
002379     03 FILLER                    PIC X(15) VALUE                 216500      
002380                                   "S151/LIST/P115/".             216600      
002381     03 WS-RM-NODO                PIC 9(02) VALUE ZEROS.          216700      
002382     03 WS-RM-SUBNODO             PIC 9(02) VALUE ZEROS.          216800      
002383     03 FILLER                    PIC X(01) VALUE "/".            216900      
002384     03 WS-RM-TIPO                PIC X(01) VALUE "R".            217000      
002385     03 FILLER                    PIC X(04) VALUE "000/".         217100      
002386     03 WS-RM-AAMMDD              PIC 9(06).                      217200      
002387     03 WS-RM-AAMMDD-R            REDEFINES WS-RM-AAMMDD.         217300      
002388        05 WS-RM-AA               PIC 9(02).                      217400      
002389        05 WS-RM-MM               PIC 9(02).                      217500      
002390        05 WS-RM-DD               PIC 9(02).                      217600      
002391     03 FILLER                    PIC X(01) VALUE "/".            217700      
002392     03 WS-RM-MIX                 PIC 9(07) VALUE ZEROS.          217800      
002393     03 FILLER                    PIC X(01) VALUE "/".            217900      
002394     03 WS-RM-SEQ                 PIC 9(03) VALUE ZEROS.          218000      
002395     03 FILLER                    PIC X(04) VALUE "P130".         218100      
002396     03 WS-RM-DESC                PIC X(10) VALUE SPACES.         218200      
002397     03 FILLER                    PIC X(01) VALUE ".".            218300      
002398*                                                                 218400      
002399 01 WS-CONT-REPS                  PIC 9(02) VALUE 5.              218500      
002400 01 WS-DESC-REPORTES.                                             218600      
002401     03 WS-DESC-REP0              PIC X(10) VALUE                 218700      
002402        "CARATULA  ".                                             218800      
002403     03 WS-DESC-REP1              PIC X(10) VALUE                 218900      
002404        "COMPENREG ".                                             219000      
002405     03 WS-DESC-REP2              PIC X(10) VALUE                 219100      
002406        "ELIMINADOS".                                             219200      
002407     03 WS-DESC-REP3              PIC X(10) VALUE                 219300      
002408        "TRANSXSIST".                                             219400      
002409     03 WS-DESC-REP4              PIC X(10) VALUE                 219500      
002410        "COMPXNODOS".                                             219600      
002411     03 WS-DESC-REP5              PIC X(10) VALUE                 219700      
002412        "PENDIENTES".                                             219800      
002413     03 WS-DESC-REP6              PIC X(10) VALUE                 219900      
002414        "DUPLICADOS".                                             220000      
002415     03 WS-DESC-REP7              PIC X(10) VALUE                 220100      
002416        "PROTOCOLO ".                                             220200      
002417*                                                                 220300      
002418*                                                                 220400      
002419 01  APUNTADORES-WS               COMP .                          220500      
002420     02  PTER-CSI-WS              PIC 9(02).                      220600      
002421         88 PTER-CSIOK            VALUES ARE 1,2,4,6,10.          220700      
002422         88 PTER-CSI-CORP         VALUES ARE 12.                  220800      
002423         88 PTER-CSI-TANDEM       VALUES ARE 02.                  220900      
002424         88 PTER-CSI-ICA          VALUES ARE 1,2,4,6,10.          221000      
002425     02  WS-CSI-TANDEM            PIC 9(02) VALUE 02.             221100      
002426     02  PTER-LOG-WS              PIC 9(02).                      221200      
002427     02  PTER-SIST-WS             PIC 9(02).                      221300      
002428     02  WS-AP-OPER-APL           PIC 9(02).                      221400      
002429     02  PTER-CORTE-WS            PIC 9(02).                      221500      
002430     02  PTER-1-CSI-WS            PIC 9(02).                      221600      
002431         88 CSI-1-VALIDO          VALUES ARE 1,2,4,6,10.          221700      
002432     02  PTER-2-CSI-WS            PIC 9(02).                      221800      
002433         88 CSI-2-VALIDO          VALUES ARE 1,2,4,6,10.          221900      
002434*                                                                 222000      
002435/                                                                 222100      
002436 01  TABLA-SISTEMAS.                                              222200      
002437      02  FILLER                  PIC X(27) VALUE                 222300      
002438          "CHS001CHEQUES       CHEQUES".                          222400      
002439      02  FILLER                  PIC X(27) VALUE                 222500      
002440          "CMS001CUENTA MAESTRACTAMAE ".                          222600      
002441      02  FILLER                  PIC X(27) VALUE                 222700      
002442          "LBS001LINEA BANAMEX LIN.BNM".                          222800      
002443      02  FILLER                  PIC X(27) VALUE                 222900      
002444          "OAS001ORDENES ABONO O.ABONO".                          223000      
002445      02  FILLER                  PIC X(27) VALUE                 223100      
002446          "BCS001BCO EN SU CASAB.CASA ".                          223200      
002447 01  TAB-SIST-R                   REDEFINES TABLA-SISTEMAS.       223300      
002448     02  INFO-TAB-SIST            OCCURS   5 TIMES.               223400      
002449         03  PREFIJO-TS           PIC X(02).                      223500      
002450         03  SISTEMA-TS           PIC X(04).                      223600      
002451         03  SIST-R-TS            REDEFINES SISTEMA-TS.           223700      
002452             04  FILLER           PIC X(01).                      223800      
002453             04  SISTEMA-NUM-TS   PIC 9(03).                      223900      
002454         03  DESCR-SIST-TS        PIC X(14).                      224000      
002455         03  DESCR-SIST-CORTA     PIC X(07).                      224100      
002456 01 LIM-SISTEMAS                  PIC 9(01) VALUE 5.              224200      
002457*                                                                 224300      
002458 01 TAB-DIFNOCON.                                                 224400      
002459    03 FILLER                     PIC X(27) VALUE SPACES.         224500      
002460    03 FILLER                     PIC X(03) VALUE " CR".          224600      
002461    03 FILLER                     PIC X(03) VALUE "ECR".          224700      
002462    03 FILLER                     PIC X(24) VALUE SPACES.         224800      
002463    03 FILLER                     PIC X(03) VALUE " DR".          224900      
002464    03 FILLER                     PIC X(03) VALUE "EDR".          225000      
002465*                                                                 225100      
002466 01 TAB-DIFNOCON-R                REDEFINES TAB-DIFNOCON.         225200      
002467    03 TAB-DNC                    PIC X(03)                       225300      
002468                                  OCCURS    21 TIMES.             225400      
002469 01 LIM-DNC                       PIC 9(02) VALUE 21.             225500      
002470                                                                  225600      
002471*  01 WS-PROGRAMA PIC X(19) VALUE "S151 P115 15MTP001 ".          225700      
002472   01 WS-PROGRAMA PIC X(19) VALUE "S151 P115 25MTP001 ".          225710      
002473/                                                                 225800      
002474****************************************************************  225900      
002475***          CARGA DE TIEMPOS ESPECIALES PARA COBOL74        ***  226000      
002476****************************************************************  226100      
002477 01  CODE-FILE            PIC X(300).                             226200      
002478*                                                                 226300      
002479 01  TIME-1               PIC 9(013).                             226400      
002480*          ........ SEXAGESIMOS DE SEGUNDO DESDE LA MEDIA NOCHE.  226500      
002481 01  COMPILETIME-10       PIC 9(006).                             226600      
002482*                  ................. FECHA DE COMPILACION DDDAA.  226700      
002483 01  COMPILETIME-11       PIC 9(011).                             226800      
002484*      ... HORA DE COMPILACION EN UNIDADES DE 2.4 MICROSEGUNDOS.  226900      
002485 01  COMPILETIME-15       PIC 9(006).                             227000      
002486*                   ............... FECHA DE COMPILACION MMDDAA.  227100      
002487 01  JUL-FECHA            PIC 9(006).                             227200      
002488 01  JUL-DATE             REDEFINES JUL-FECHA.                    227300      
002489     03 FILLER            PIC 9(001).                             227400      
002490     03 JUL-YY            PIC 9(002).                             227500      
002491     03 JUL-DDD           PIC 9(003).                             227600      
002492 01  DATE-MMDDYY.                                                 227700      
002493     03 DATE-MM           PIC 9(002).                             227800      
002494     03 DATE-DD           PIC 9(002).                             227900      
002495     03 DATE-YY           PIC 9(002).                             228000      
002496 01  COCIENTE             PIC 9(002).                             228100      
002497 01  T-CREA               PIC 9(013).                             228200      
002498 01  WRESIDUO             PIC 9(002).                             228300      
002499 01  APUNT-MES            PIC 9(002).                             228400      
002500 01  MESES-BISIESTO       PIC X(036) VALUE                        228500      
002501     "031060091121152182213244274305335366".                      228600      
002502 01  MESES-BISIESTO-R     REDEFINES MESES-BISIESTO.               228700      
002503     02 M-DAY             PIC 9(003) OCCURS 12 TIMES.             228800      
002504 01  MESES                PIC X(036) VALUE                        228900      
002505     "031059090120151181212243273304334365".                      229000      
002506 01  MESES-R              REDEFINES MESES.                        229100      
002507     02 D-DAY             PIC 9(003) OCCURS 12 TIMES.             229200      
002508                                                                  229210      
002509 01  WKS-CTLVERS-LIBRERIA            PIC X(12).                   229220      
002510 01  WKS-CTLVERS-TITULO              PIC X(72).                   229230      
002511 01  WKS-CTLVERS-STATUS              PIC S9(11) BINARY.           229240      
002512                                                                  229250      
002513 01  WKS-DATOS-HOST.                                              229300      
002514     03  WKS-NUMCSI                    PIC 9(02).                 229400      
002515     03  WKS-NOMEQUIPO                 PIC X(10).                 229500      
002516     03  WKS-NOMCSI                    PIC X(26).                 229600      
002517     03  WKS-LINEABATCH                PIC X(05).                 229700      
002518*                                                                 229800      
002519*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002520*  COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL".                  229900      
002521*================================================================ 000100      
002522*         ENTRY-POINT CONSISDIA :                               = 000200      
002523*                                                                 000300      
002524* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
002525* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
002526* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
002527* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
002528* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
002529* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
002530* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
002531* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
002532* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
002533* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
002534*                                                               = 001400      
002535*================================================================ 001500      
002536                                                                  001600      
002537                                                                  001700      
002538*================================================================ 001800      
002539* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
002540*                                                               = 002000      
002541* ENTRADA REQUERIDA :                                           = 002100      
002542*                                                               = 002200      
002543*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
002544*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
002545*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
002546*================================================================ 002600      
002547 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
002548    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
002549    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
002550    03 WKS-B01-CSI                 PIC 9(02).                     003000      
002551    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
002552    03 WKS-B01-FECCON              PIC 9(08).                     003202      
002553    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
002554    03 WKS-B01-STAREG              PIC 9(02).                     003400      
002555    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
002556    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
002557    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
002558    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
002559    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
002560    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
002561    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
002562    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
002563    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
002564    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
002565    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
002566    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
002567    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
002568       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
002569       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
002570       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
002571       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
002572*==============================================================   005200      
002573*                                                             =   005300      
002574* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
002575*                                                             =   005500      
002576* CAMPOS REQUERIDOS :                                         =   005600      
002577*                                                             =   005700      
002578* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
002579* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
002580* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
002581* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
002582*==============================================================   006200      
002583 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
002584    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
002585    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
002586    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
002587    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
002588                                                                  006800      
002589*==============================================================   006900      
002590*                                                             =   007000      
002591* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
002592*                                                             =   007200      
002593* CAMPOS REQUERIDOS :                                         =   007300      
002594*                                                             =   007400      
002595* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
002596* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
002597* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
002598* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
002599*==============================================================   007900      
002600 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
002601    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
002602    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
002603    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
002604    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
002605                                                                  008500      
002606*==============================================================   008600      
002607*                                                             =   008700      
002608* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
002609*                                                             =   008900      
002610* CAMPOS REQUERIDOS :                                         =   009000      
002611*                                                             =   009100      
002612* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
002613* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
002614* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
002615* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
002616*==============================================================   009600      
002617 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
002618    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
002619    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
002620    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
002621    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
002622                                                                  010200      
002623*============================================================     010300      
002624* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
002625*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
002626*                                                           =     010600      
002627*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
002628*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
002629*                                                           =     010900      
002630*  ENTRADA REQUERIDA.                                       =     011000      
002631*                                                           =     011100      
002632*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
002633*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
002634*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
002635*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
002636*============================================================     011600      
002637                                                                  011700      
002638 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
002639     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
002640     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
002641     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
002642     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
002643                                                                  012300      
002644*=============================================================    012400      
002645*                                                            =    012500      
002646* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
002647*             B01-SIS-FECARMOV.                              =    012700      
002648*                                                            =    012800      
002649* ENTRADA REQUERIDAD :                                       =    012900      
002650*                                                            =    013000      
002651*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
002652*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
002653*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
002654*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
002655*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
002656*=============================================================    013600      
002657                                                                  013700      
002658 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
002659     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
002660     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
002661     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
002662     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
002663     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
002664*================================================================ 014400      
002665*                                                               = 014500      
002666* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
002667*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
002668*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
002669*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
002670*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
002671*                                                               = 015100      
002672* ENTRADA REQUERIDA :                                           = 015200      
002673*                                                               = 015300      
002674* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
002675* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
002676* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
002677* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
002678* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
002679*================================================================ 015900      
002680 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
002681    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
002682    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
002683    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
002684    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
002685    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
002686                                                                  016600      
002687*============================================================     016700      
002688*                                                           =     016800      
002689* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
002690*                                                           =     017000      
002691* DATOS REQUERIDOS :                                        =     017100      
002692*                                                           =     017200      
002693* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
002694* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
002695* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
002696* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
002697* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
002698*============================================================     017800      
002699                                                                  017900      
002700 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
002701     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
002702     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
002703     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
002704     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
002705     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
002706                                                                  018600      
002707*============================================================     018700      
002708*                                                           =     018800      
002709* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
002710*                                                           =     019000      
002711* DATOS REQUERIDOS :                                        =     019100      
002712*                                                           =     019200      
002713* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
002714* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
002715* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
002716* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
002717* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
002718*============================================================     019800      
002719                                                                  019900      
002720 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
002721     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
002722     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
002723     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
002724     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
002725     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
002726                                                                  020600      
002727*===============================================================  020700      
002728*                                                              =  020800      
002729* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
002730*              MOVIMIENTOS.                                    =  021000      
002731* DATOS REQUERIDOS :                                           =  021100      
002732*                                                              =  021200      
002733* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
002734* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
002735* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
002736* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
002737* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
002738* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
002739*==============================================================   021900      
002740                                                                  022000      
002741 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
002742     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
002743     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
002744     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
002745     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
002746     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
002747     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
002748*==============================================================   022800      
002749*                                                             =   022900      
002750* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
002751*                                                             =   023100      
002752* CAMPOS REQUERIDOS :                                         =   023200      
002753*                                                             =   023300      
002754* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
002755* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
002756* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
002757* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
002758*==============================================================   023800      
002759 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
002760    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
002761    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
002762    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
002763    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
002764                                                                  024304      
002765*=================================================================024306      
002766*                ENTRY POINT CONSISB01                           =024308      
002767*                                                                =024310      
002768*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
002769*                                                                =024314      
002770*  FUNCIONES DISPONIBLES :                                       =024316      
002771*                                                                =024318      
002772*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
002773*                                                                =024322      
002774*  PARAMETROS REQUERIDOS                                         =024324      
002775*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
002776*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
002777*=================================================================024330      
002778                                                                  024332      
002779 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
002780     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
002781     03 WKS-CON-CSI                PIC 9(02).                     024336      
002782     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
002783     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
002784        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
002785        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
002786        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
002787        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
002788        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
002789                                                                  024400      
002790*=================================================================024500      
002791*                ENTRY POINT B02ARCINTER                         =024600      
002792*                                                                =024700      
002793*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
002794*                                                                =024900      
002795*  FUNCIONES DISPONIBLES :                                       =025000      
002796*                                                                =025100      
002797*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
002798* 19.- ALTAS DE ARCHIVOS.                                        =025300      
002799* 22.- BAJAS DE ARCHIVOS.                                        =025400      
002800* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
002801*                                                                =025600      
002802*  PARAMETROS REQUERIDOS                                         =025700      
002803*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
002804*                                                                =025900      
002805*=================================================================026000      
002806 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
002807     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
002808     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
002809     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
002810     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
002811     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
002812     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
002813     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
002814     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
002815     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
002816     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
002817     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
002818     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
002819     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
002820     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
002821     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
002822     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
002823     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
002824     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
002825     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
002826     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
002827     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
002828     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
002829     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
002830     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
002831     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
002832     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
002833     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
002834     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
002835                                                                  029000      
002836*=================================================================029100      
002837*                ENTRY POINT B04SISTEMA                          =029200      
002838*                                                                =029300      
002839*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
002840*                                                                =029500      
002841*  FUNCIONES DISPONIBLES :                                       =029600      
002842*                                                                =029700      
002843*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
002844*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
002845*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
002846*                                                                =030100      
002847*  PARAMETROS REQUERIDOS                                         =030200      
002848*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
002849*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
002850*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
002851*                                                                =030600      
002852*=================================================================030700      
002853 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
002854     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
002855     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
002856     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
002857     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
002858     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
002859     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
002860     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
002861                                                                  031600      
002862*================================================================ 031700      
002863*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
002864*                                                               = 031900      
002865*  FUNCION                                                      = 032000      
002866*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
002867*   19       ALTAS.                                             = 032200      
002868*   22       BAJAS                                              = 032300      
002869*   37       CAMBIOS.                                           = 032400      
002870*                                                               = 032500      
002871*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
002872*                      FECHA DE PROCESO                         = 032700      
002873*                      NUMERO DE PROCESO                        = 032800      
002874*                      FECHA INICIO                             = 032900      
002875*                      REGISTRO INICIAL                         = 033000      
002876*================================================================ 033100      
002877                                                                  033200      
002878 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
002879     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
002880     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
002881     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
002882     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
002883     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
002884     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
002885     03 WKS-B05-MIX                PIC 9(08).                     034000      
002886     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
002887     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
002888     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
002889     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
002890     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
002891     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
002892                                                                  034700      
002893                                                                  034800      
002894*================================================================ 034900      
002895*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
002896*                                                               = 035100      
002897*  FUNCION                                                      = 035200      
002898*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
002899*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
002900*                                                               = 035500      
002901*================================================================ 035600      
002902                                                                  035700      
002903 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
002904     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
002905     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
002906     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
002907     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
002908     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
002909     03 WKS-B09-NOMREN             PIC X(15).                     036400      
002910                                                                  036500      
002911*===============================================================  036600      
002912*                                                              =  036700      
002913*         ENTRY-POINT CONSISMEN                                =  036800      
002914*                                                              =  036900      
002915*   DATOS REQUERIDOS : FUNCION                                 =  037000      
002916*                      SISTEMA                                 =  037100      
002917*                                                              =  037200      
002918*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
002919*                                                              =  037400      
002920*===============================================================  037500      
002921 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
002922     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
002923     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
002924     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
002925     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
002926     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
002927     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
002928     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
002929     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
002930     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
002931     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
002932     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
002933     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
002934     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
002935     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
002936     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
002937        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
002938        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
002939        05 WKS-B03-AAMM            PIC 9(06).                     039402      
002940        05 WKS-B03-SECOK           PIC 9(10).                     039500      
002941        05 WKS-B03-SECINF          PIC 9(10).                     039600      
002942        05 WKS-B03-SECERR          PIC 9(10).                     039700      
002943        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
002944                                                                  039900      
002945*=====================================================            040000      
002946*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
002947*=====================================================            040200      
002948 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
002949     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
002950     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
002951     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
002952                                                                  040700      
002953*=====================================================            040800      
002954*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
002955*=====================================================            041000      
002956 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
002957     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
002958     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
002959     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
002960                                                                  041500      
002961*=====================================================            041600      
002962*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
002963*=====================================================            041800      
002964 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
002965     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
002966     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
002967     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
002968*=====================================================            042300      
002969*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
002970*=====================================================            042500      
002971 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
002972     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
002973     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
002974     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
002975                                                                  043000      
002976*=====================================================            043100      
002977*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
002978*=====================================================            043300      
002979 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
002980     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
002981     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
002982     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
002983                                                                  043800      
002984*=====================================================            043900      
002985*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
002986*=====================================================            044100      
002987 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
002988     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
002989     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
002990     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
002991                                                                  044600      
002992*=====================================================            044700      
002993*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
002994*=====================================================            044900      
002995 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
002996     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
002997     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
002998     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
002999                                                                  045400      
003000*=====================================================            045500      
003001*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
003002*=====================================================            045700      
003003 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
003004     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
003005     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
003006     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
003007                                                                  046200      
003008*=====================================================            046300      
003009*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
003010*=====================================================            046500      
003011 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
003012     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
003013     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
003014     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
003015                                                                  047000      
003016*=====================================================            047100      
003017*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
003018*=====================================================            047300      
003019 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
003020     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
003021     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
003022     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
003023                                                                  047800      
003024*=====================================================            047900      
003025*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
003026*=====================================================            048100      
003027 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
003028     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
003029     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
003030     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
003031                                                                  048600      
003032*=====================================================            048700      
003033*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
003034*=====================================================            048900      
003035 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
003036     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
003037     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
003038     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
003039                                                                  049400      
003040*=====================================================            049500      
003041*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
003042*=====================================================            049700      
003043 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
003044     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
003045     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
003046     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
003047     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
003048     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
003049     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
003050     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
003051     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
003052     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
003053     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
003054                                                                  050900      
003055*=====================================================            051000      
003056*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
003057*=====================================================            051200      
003058 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
003059     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
003060     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
003061     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
003062     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
003063                                                                  051800      
003064*=====================================================            051900      
003065*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
003066*=====================================================            052100      
003067 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
003068     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
003069     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
003070     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
003071     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
003072                                                                  052700      
003073*=====================================================            052800      
003074*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
003075*=====================================================            053000      
003076 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
003077     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
003078     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
003079     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
003080     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
003081                                                                  053600      
003082*=====================================================            053700      
003083*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
003084*=====================================================            053900      
003085 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
003086     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
003087     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
003088     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
003089     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
003090                                                                  054500      
003091*=====================================================            054600      
003092*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
003093*=====================================================            054800      
003094 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
003095     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
003096     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
003097     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
003098     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
003099                                                                  055400      
003100*=====================================================            055500      
003101*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
003102*=====================================================            055700      
003103 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
003104     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
003105     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
003106     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
003107     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
003108                                                                  056300      
003109*=====================================================            056400      
003110*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
003111*=====================================================            056600      
003112 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
003113     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
003114     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
003115     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
003116     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
003117                                                                  057200      
003118 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
003119*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003120*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003121*  COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".          230000      
003122**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
003123  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
003124  01 MENSAJE-LJ.                                                  100300      
003125     02 SISTEMA-LJ     PIC X(04).                                 100400      
003126     02 FILLER         PIC X VALUE "/".                           100500      
003127     02 PASO-LJ        PIC X(04).                                 100600      
003128     02 FILLER         PIC X VALUE "/".                           100700      
003129     02 MTP-LJ         PIC 9(03).                                 100800      
003130     02 FILLER         PIC X VALUE ":".                           100900      
003131     02 TIPO-LJ        PIC X.                                     101000      
003132     02 FILLER         PIC X VALUE ">".                           101100      
003133     02 CODIGO-LJ      PIC 9(06).                                 101200      
003134     02 FILLER         PIC X VALUE "<".                           101300      
003135     02 TEXTO-LJ       PIC X(250).                                101400      
003136*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003137*INICIA CODIGO DE RENOVACION CRONOS 2000                          230100      
003138*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003139*  COPY "S151/CRONOS2K/CPY/WS".                                   230200      
003140******************************************************************000100      
003141** This copyBook defines all the additional variables that      **000200      
003142** Unisys has defined for the CRONOS2K project                  **000300      
003143** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
003144******************************************************************000500      
003145                                                                  000600      
003146******************************************************************000700      
003147** These Variables are used to Accept the system date in long   **000800      
003148** format and get the century information                       **000900      
003149** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
003150 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
003151 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
003152    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
003153    05 FILLER      PIC X(1).                                      001400      
003154    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
003155    05 FILLER      PIC X(1).                                      001600      
003156    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
003157    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
003158      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
003159      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
003160******************************************************************002100      
003161                                                                  002200      
003162******************************************************************002300      
003163** This variable defines a date in the format MMDDCCAA          **002400      
003164**                                                              **002500      
003165 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
003166 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
003167    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
003168    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
003169    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
003170    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
003171      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
003172      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
003173******************************************************************003400      
003174                                                                  003500      
003175******************************************************************003600      
003176** This variable defines a date in the format CCAAMMDD          **003700      
003177**                                                              **003800      
003178 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
003179 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
003180    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
003181    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
003182      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
003183      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
003184    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
003185    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
003186******************************************************************004700      
003187                                                                  004800      
003188******************************************************************004900      
003189** This variable defines a date in the format DDMMCCAA          **005000      
003190**                                                              **005100      
003191 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
003192 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
003193    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
003194    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
003195    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
003196    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
003197      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
003198      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
003199******************************************************************006000      
003200                                                                  006100      
003201******************************************************************006200      
003202** This variable defines a date in the Julian Format CCAADDD    **006300      
003203**                                                              **006400      
003204 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
003205 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
003206    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
003207    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
003208                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
003209      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
003210      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
003211    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
003212******************************************************************007300      
003213                                                                  007400      
003214******************************************************************007500      
003215** This variable defines a date in the format AAMMDD            **007600      
003216**                                                              **007700      
003217 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
003218 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
003219    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
003220    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
003221    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
003222******************************************************************008300      
003223                                                                  008400      
003224******************************************************************008500      
003225** This variable defines a date in the format MMDDAA            **008600      
003226**                                                              **008700      
003227 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
003228 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
003229    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
003230    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
003231    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
003232******************************************************************009300      
003233                                                                  009400      
003234******************************************************************009500      
003235** This variable defines a date in the format DDMMAA            **009600      
003236**                                                              **009700      
003237 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
003238 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
003239    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
003240    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
003241    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
003242******************************************************************010300      
003243                                                                  010400      
003244******************************************************************010500      
003245** These variables are defined to be used for CALL bridge logic **010600      
003246**                                                              **010700      
003247 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
003248 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
003249 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
003250 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
003251 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
003252 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
003253******************************************************************011400      
003254                                                                  011500      
003255******************************************************************011600      
003256** This variable is used for converting only a year field AA to **011700      
003257** CCAA and a CCAA to AA                                        **011800      
003258 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
003259 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
003260    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
003261    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
003262 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
003263 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
003264******************************************************************012300      
003265                                                                  012400      
003266******************************************************************012500      
003267** These variables are Bridge Variables for Intercambio files   **012600      
003268** para EDOCTA                                                  **012700      
003269 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
003270 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
003271 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
003272 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
003273 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
003274 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
003275 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
003276******************************************************************013500      
003277* Para MODULO                                                     013600      
003278 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
003279******************************************************************013800      
003280******************************************************************013900      
003281** Para FMOVSCHABO                                                014000      
003282 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
003283******************************************************************014200      
003284                                                                  014300      
003285******************************************************************014400      
003286***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
003287******************************************************************014600      
003288                                                                  014700      
003289 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
003290 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
003291     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
003292     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
003293     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
003294******************************************************************015300      
003295                                                                  015400      
003296******************************************************************015500      
003297***  These Variables Are Defined For Date In AAMM Format       ***015600      
003298******************************************************************015700      
003299                                                                  015800      
003300 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
003301 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
003302     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
003303     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
003304******************************************************************016300      
003305                                                                  016400      
003306                                                                  016500      
003307*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003308  01  A2K-BASE-YEAR     PIC 9(02) VALUE 50.                       230300      
003309*TERMINA CODIGO DE RENOVACION CRONOS 2000                         230400      
003310 77 W77-CSI-PARAM                      PIC 9(02).                 230410      
003311/                                                                 230500      
003312****************************************************************  230600      
003313 PROCEDURE DIVISION USING W77-CSI-PARAM.                          230700      
003314 0000-PRIMERA                    SECTION.                         230800      
003315*                                                                 230900      
003316/**********************************************************       231000      
003317***      CARGA DE TIEMPOS ESPECIALES PARA COBOL74       ***       231100      
003318***********************************************************       231200      
003319 FNC-CARGA-TIEMPOS.                                               231300      
003320*                                                                 231400      
003321     MOVE   ATTRIBUTE NAME  OF MYSELF TO CODE-FILE.               231500      
003322     CHANGE ATTRIBUTE TITLE OF FILE1  TO CODE-FILE.               231600      
003323     IF ATTRIBUTE PRESENT   OF FILE1 IS EQUAL TO VALUE TRUE       231700      
003324        PERFORM 100-CARGATIMES                                    231800      
003325     ELSE                                                         231900      
003326        MOVE 999999      TO COMPILETIME-15                        232000      
003327        MOVE 99999999999 TO COMPILETIME-11                        232100      
003328        MOVE 99999       TO COMPILETIME-10.                       232200      
003329     ACCEPT  TIME-1    FROM TIMER.                                232300      
003330     COMPUTE TIME-1 = ((TIME-1 * 2.4) / 1000000) * 60.            232400      
003331*                                                                 232500      
003332 100-CARGATIMES.                                                  232600      
003333*                                                                 232700      
003334     MOVE ATTRIBUTE CREATIONTIME OF FILE1 TO COMPILETIME-11.      232800      
003335     COMPUTE COMPILETIME-11 = COMPILETIME-11 / 2.4.               232900      
003336     MOVE ATTRIBUTE CREATIONDATE OF FILE1 TO COMPILETIME-10.      233000      
003337     MOVE COMPILETIME-10 TO JUL-FECHA.                            233100      
003338     MOVE JUL-YY         TO DATE-YY.                              233200      
003339*    DIVIDE JUL-YY BY 4 GIVING COCIENTE REMAINDER WRESIDUO.       233300      
003340*    SI DA COMO RESIDUO = 0, ENTONCES SE TRATA DE A\O BISIESTO.   233400      
003341*                                                                 233500      
003342     IF JUL-YY < 80                                               233520      
003343        COMPUTE W77-JUL-YY4 = JUL-YY + 2000                       233540      
003344     ELSE                                                         233542      
003345        COMPUTE W77-JUL-YY4 = JUL-YY + 1900.                      233544      
003346                                                                  233555      
003347     DIVIDE W77-JUL-YY4 BY 4 GIVING COCIENTE REMAINDER WRESIDUO.  233560      
003348                                                                  233580      
003349     IF WRESIDUO = 0                                              233600      
003350        PERFORM 200-SUMAUNO VARYING APUNT-MES    FROM 1 BY 1      233700      
003351                      UNTIL JUL-DDD < (M-DAY(APUNT-MES) + 1)      233800      
003352        MOVE APUNT-MES TO DATE-MM                                 233900      
003353        IF APUNT-MES > 1                                          234000      
003354           SUBTRACT M-DAY(APUNT-MES - 1)                          234100      
003355                    FROM JUL-DDD          GIVING DATE-DD          234200      
003356        ELSE                                                      234300      
003357           MOVE JUL-DDD                   TO DATE-DD              234400      
003358     ELSE                                                         234500      
003359        PERFORM 200-SUMAUNO VARYING APUNT-MES    FROM 1 BY 1      234600      
003360                      UNTIL JUL-DDD < (D-DAY(APUNT-MES) + 1)      234700      
003361        MOVE APUNT-MES TO DATE-MM                                 234800      
003362        IF APUNT-MES > 1                                          234900      
003363           SUBTRACT D-DAY(APUNT-MES - 1)                          235000      
003364                    FROM JUL-DDD          GIVING DATE-DD          235100      
003365        ELSE                                                      235200      
003366           MOVE JUL-DDD                   TO DATE-DD.             235300      
003367      MOVE DATE-MMDDYY                    TO COMPILETIME-15.      235400      
003368 200-SUMAUNO. EXIT.                                               235500      
003369/                                                                 235600      
003370*======================                                           235700      
003371 00000-MODULO-PRINCIPAL.                                          235800      
003372*======================                                           235900      
003373*ASM PERFORM 0100-FORMATO-DISPLAY.                                235950      
003374     PERFORM 10000-INICIA-PROCESO.                                236000      
003375     PERFORM 20000-CONTROL-PROCESO.                               236100      
003376     PERFORM 30000-TERMINA-PROCESO.                               236200      
003377     STOP RUN.                                                    236300      
003378*                                                                 236400      
003379*=====================                                            236500      
003380 10000-INICIA-PROCESO.                                            236600      
003381*=====================                                            236700      
003382     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   236720      
003383      "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".            236740      
003384     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     236760      
003385     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      236780      
003386     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.236800      
003387     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            236900      
003388                                      "SOPORTECOMS".              236910      
003389     IF W77-CSI-PARAM = 0                                         236920      
003390        CALL "CSIID OF SOPORTECOMS" USING WKS-DATOS-HOST          236930      
003391     ELSE                                                         236940      
003392        MOVE W77-CSI-PARAM        TO WKS-NUMCSI.                  236950      
003393     IF WKS-NUMCSI = 32                                           236970      
003394        MOVE 4                    TO WKS-NUMCSI.                  236990      
003395                                                                  237000      
003396    MOVE WKS-NUMCSI               TO PTER-CSI-WS.                 237005      
003397    IF WKS-NUMCSI = 12                                            237006      
003398       MOVE 10              TO      WKS-TR-CSI2                   237007      
003399    ELSE                                                          237008      
003400       MOVE WKS-NUMCSI      TO      WKS-TR-CSI2.                  237010      
003401                                                                  237015      
003402     IF PTER-CSI-CORP                                             237016      
003403        NEXT SENTENCE                                             237017      
003404     ELSE                                                         237018      
003405        CHANGE ATTRIBUTE LIBACCESS    OF "CTRLVERS" TO BYFUNCTION 237020      
003406        CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS"  237025      
003407                                                                  237030      
003408        MOVE "S151L001CTL"         TO WKS-CTLVERS-LIBRERIA        237035      
003409        CALL "DAME_TIT IN CTRLVERS"                               237040      
003410          USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO          237045      
003411          GIVING WKS-CTLVERS-STATUS                               237050      
003412                                                                  237055      
003413        IF WKS-CTLVERS-STATUS < 0                                 237060      
003414           MOVE "ERROR EN CTLVERS, USO LIBEST SIN RELEASE NI MTP" 237065      
003415                         TO TEXTO-LJ                              237070      
003416        ELSE                                                      237075      
003417           CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL" TO          237080      
003418               WKS-CTLVERS-TITULO.                                237081      
003419     MOVE "S151"                  TO SISTEMA-LJ.                  237082      
003420     MOVE "P115"                  TO WKS-PASO-BACK2               237084      
003421                                     PASO-LJ                      237085      
003422                                     WLI-RB-E1-PASO.              237086      
003423     MOVE "001"                   TO MTP-LJ.                      237087      
003424     MOVE "DIARIO"                TO WLI-RB-E2-TIPO-PROC2.        237088      
003425     MOVE "151"        TO WKS-SIS-BACK2, WLI-RB-E3-SISTEMA2.      237090      
003426     IF PTER-CSI-CORP                                             237091      
003427        PERFORM 11500-OBTIENE-FECHA-CTRL                          237092      
003428     ELSE                                                         237093      
003429        PERFORM 12000-OBTIENE-FECHA-SIST.                         237096      
003430*ASM DISPLAY "020101 01  " WS-PROGRAMA, " INICIO DE PROCESO".     237100      
003431     PERFORM 12500-VACIA-FECHAS.                                  237106      
003432     MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ        237110      
003433     MOVE "I"                    TO WLI-TIPO-LJ                   237120      
003434                                    TIPO-LJ                       237130      
003435     MOVE 020101                 TO CODIGO-LJ                     237140      
003436     MOVE "INICIO DE PROCESO"                                     237150      
003437                                 TO WLI-TEXTO-LJ                  237160      
003438                                    TEXTO-LJ                      237170      
003439     PERFORM      000-030-IMPRIME-MENSAJE                         237180      
003440     PERFORM 11000-DATOS-SISTEMA.                                 237200      
003441*ASM PERFORM 12000-OBTIENE-FECHA.                                 237300      
003442     PERFORM 13000-VERIFICA-ARCHS-ENTRADA.                        237400      
003443*RGV PERFORM 14000-CONSULTA-S080.                                 237500      
003444***  PERFORM 15000-ABRE-REPORTES.                                 237600      
003445*                                                                 237700      
003446 0100-FORMATO-DISPLAY.                                            237720      
003447*---------------------                                            237740      
003448                                                                  237760      
003449*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003450* COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY.".                   237780      
003451                                                                  000100      
003452*===============================================================* 000200      
003453*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
003454*         PARA LLAMADO DE DISPLAY                               * 000400      
003455*===============================================================* 000500      
003456                                                                  000600      
003457     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
003458            TO BYFUNCTION.                                        000671      
003459                                                                  000691      
003460     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
003461          USING WKS-DATE-ARRAY2.                                  000800      
003462     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
003463     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
003464     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
003465     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
003466     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
003467     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
003468                                                                  001300      
003469     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
003470     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
003471     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
003472                               WKS-TIT-REPORTE2.                  001700      
003473*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
003474*                                  GIVING WKS-COMPILA2.           001900      
003475*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
003476*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
003477*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
003478*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
003479                                                                  002066      
003480*    IF WKS-AAA-VERSION2  < 50                                    002071      
003481*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
003482*    ELSE                                                         002081      
003483*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
003484                                                                  002091      
003485                                                                  002500      
003486*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
003487     OPEN OUTPUT V00-REPORTE2.                                    002700      
003488     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
003489     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
003490                                                                  003000      
003491 000-050-CHECA-SALTO-HOJA2.                                       003051      
003492*==========================                                       003071      
003493    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
003494     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
003495        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
003496     ELSE                                                         003079      
003497        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
003498     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
003499     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
003500     MOVE "/"                     TO WKS-SLASH1.                  003086      
003501     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
003502     MOVE "/"                     TO WKS-SLASH2.                  003088      
003503     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
003504     IF  WKS-NUM-LINEAS2 > 56                                     003091      
003505         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
003506         ADD 1                   TO    W77-CONT-HOJA2             003200      
003507         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
003508         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
003509         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
003510         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
003511         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
003512         MOVE SPACES             TO V00-R00-REPORTE2              003800      
003513         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
003514         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
003515                                                                  004100      
003516 000-030-IMPRIME-MENSAJE.                                         004200      
003517*========================                                         004300      
003518*LP                                                               004400      
003519     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
003520     ADD             2       TO WKS-NUM-LINEAS2                   004600      
003521     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
003522                                                                  004800      
003523*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003524*====================                                             237800      
003525 11000-DATOS-SISTEMA.                                             237900      
003526*====================                                             238000      
003527     MOVE COMPILETIME-15          TO VERSION-WS.                  238100      
003528     MOVE DD-VS                   TO DUMMY-WS.                    238200      
003529     MOVE MM-VS                   TO DD-VS.                       238300      
003530     MOVE DUMMY-WS                TO MM-VS.                       238400      
003531*ASM  MOVE VERSION-WS              TO RT2-VERSION                 238500      
003532*                                                                 238600      
003533*ASM ACCEPT WS-DATE               FROM TODAYS-DATE.               238700      
003534*ASM MOVE WS-DATE-AA              TO WS-DIA.                      238800      
003535*ASM MOVE WS-DATE-DD              TO WS-DATE-AA.                  238900      
003536*ASM MOVE WS-DIA                  TO WS-DATE-DD.                  239000      
003537*                                                                 239100      
003538     MOVE SPACES                  TO REP2-DET1.                   239200      
003539     MOVE LOW-VALUES              TO IDENTIFICADORES-WS.          239300      
003540     MOVE ZEROS                   TO REG-COMPENSACION.            239400      
003541     MOVE ZEROS                   TO LLAVE-COMP.                  239500      
003542     MOVE LOW-VALUES              TO CONTADORES-WS.               239600      
003543     MOVE 90                      TO WS-CONT-R1-LIN.              239700      
003544     MOVE 90                      TO WS-CONT-R2-LIN.              239800      
003545     MOVE LOW-VALUES              TO TOTALES-WS.                  239900      
003546*                                                                 240000      
003547     ACCEPT WS-TIME             FROM TIME.                        240100      
003548     MOVE WS-DATE-AA              TO AA-REAL-WS.                  240200      
003549     MOVE WS-DATE-MM              TO MM-REAL-WS.                  240300      
003550     MOVE WS-DATE-DD              TO DD-REAL-WS.                  240400      
003551     MOVE WS-DATE                 TO RT2-FEC-REAL                 240500      
003552     MOVE WS-TIME-HH              TO RT3-HH-REAL.                 240600      
003553     MOVE WS-TIME-MM              TO RT3-MM-REAL.                 240620      
003554     MOVE WS-TIME-SS              TO RT3-SS-REAL.                 240640      
003555*                                                                 240700      
003556/=======================                                          240800      
003557 11500-OBTIENE-FECHA-CTRL.                                        240802      
003558*-------------------------                                        240804      
003559     OPEN INPUT A01-CONTROL.                                      240806      
003560     READ A01-CONTROL INTO WKS-REG-HD-CONTROL.                    240808      
003561     MOVE WKS-HD-FECPRO           TO WS-FECHA-AMD.                240810      
003562     CLOSE A01-CONTROL.                                           240812      
003563*                                                                 240814      
003564/=========================                                        240816      
003565 12000-OBTIENE-FECHA-SIST.                                        240818      
003566*=========================                                        240820      
003567     MOVE WKS-NUMCSI                TO WKS-B01-CSI.               240822      
003568*ASM SOLO PARA PRUEBAS LA SIGUIENTE LINEA                         240824      
003569*ASM MOVE 12                        TO WKS-B01-CSI.               240826      
003570     MOVE 264                       TO WKS-B01-SISTEMA.           240828      
003571     MOVE 1                         TO WKS-B01-FUNCION.           240830      
003572     CALL "CONSISDIA IN S151LIBCONTROL" USING WKS-S151B01SISDIA   240832      
003573                                     GIVING W77-STATUS.           240834      
003574     IF W77-STATUS > 0                                            240836      
003575        MOVE "E"                    TO TIPO-LJ                    240838      
003576        MOVE 020901                 TO CODIGO-LJ                  240840      
003577        STRING "ERROR AL CONSULTAR LIB-CONTROL : ", W77-STATUS    240842      
003578        DELIMITED BY SIZE INTO TEXTO-LJ                           240844      
003579        CALL "LJ IN LIB-DISP"                                     240846      
003580                     USING CONTADOR-LJ, MENSAJE-LJ                240848      
003581        SET MYSELF(STATUS)          TO -1.                        240850      
003582     IF ATTRIBUTE VALUE OF MYSELF = 0                             240852      
003583        MOVE WKS-B01-FECPRO151      TO WS-FECHA-AMD               240854      
003584     ELSE                                                         240856      
003585        MOVE ATTRIBUTE VALUE OF MYSELF TO WS-FECHA-AMD.           240858      
003586*                                                                 240860      
003587 12500-VACIA-FECHAS.                                              240862      
003588*-------------------                                              240864      
003589     MOVE WS-FECHA-AMD              TO WLI-RB-E1-FECHA-INF2       240866      
003590                                       WKS-FECHA-PROCESO.         240867      
003591     PERFORM 0100-FORMATO-DISPLAY.                                240868      
003592     MOVE WKS-FEMAQ8D2              TO WS-FEMAQ-AMD.              240870      
003593     PERFORM 1012-INVIERTE-FECHAS.                                240872      
003594     MOVE WS-FECHA-DMA              TO W77-FECHA-PROC.            240874      
003595     MOVE WS-FEMAQ-AMD              TO WS-DATE.                   240876      
003596     MOVE WS-FEMAQ-DMA              TO FECHA-REAL-WS.             240878      
003597*ASM MOVE WS-DATE                   TO RT2-FEC-REAL.              240880      
003598*                                                                 240882      
003599     MOVE WKS-NUMCSI              TO PTER-CSI-WS.                 240884      
003600     IF PTER-CSI-CORP                                             240886      
003601        MOVE WS-CSI-TANDEM        TO PTER-CSI-WS                  240888      
003602        PERFORM 15000-CAMBIA-ARCH-TANDEM.                         240890      
003603     IF NOT PTER-CSIOK                                            240892      
003604        MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ     240894      
003605        MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ       240896      
003606        MOVE 010104                 TO CODIGO-LJ                  240898      
003607        MOVE "CSI INVALIDO EN LIB-CONTROL"                        240900      
003608                                    TO WLI-TEXTO-LJ, TEXTO-LJ     240902      
003609        PERFORM      000-030-IMPRIME-MENSAJE                      240904      
003610        SET MYSELF(STATUS)        TO -1.                          240906      
003611     MOVE WS-FECHA-AMD            TO WS-FECHA-INV-PROC.           240908      
003612     MOVE ABR-CSI-TC(PTER-CSI-WS) TO NL-CSI-ORI                   240910      
003613                                     NI-CSI-ORI NI-CSI-DES.       240912      
003614     MOVE NUM-CSI-TC(PTER-CSI-WS) TO NL-CCR-ABR NL-CCR-ABRD.      240914      
003615     MOVE WS-FECHA-AMD            TO NL-CSI-FEC NI-CSI-FEC        240916      
003616                                     NL-CCR-FEC.                  240918      
003617*ASM MOVE NOM-CSI-TC(PTER-CSI-WS) TO RT4-CSI.                     240920      
003618*ASM MOVE CONTREG-CSI-TC(PTER-CSI-WS)                             240922      
003619*ASM                              TO RT4-NUM-OCCA.                240924      
003620*ASM MOVE CONREGN-CSI-TC(PTER-CSI-WS)                             240926      
003621*ASM                              TO RT4-OCCA.                    240928      
003622     MOVE W77-FECHA-PROC          TO FECHA-PROCESO-WS.            240930      
003623*ASM MOVE FECHA-PROCESO-WS        TO RT3-FEC-PROCESO.             240932      
003624*                                                                 250500      
003625 1012-INVIERTE-FECHAS.                                            250510      
003626*---------------------                                            250520      
003627     MOVE WS-FE-AMD-DIA             TO WS-FE-DMA-DIA.             250530      
003628     MOVE WS-FE-AMD-MES             TO WS-FE-DMA-MES.             250540      
003629     MOVE WS-FE-AMD-YEAR            TO WS-FE-DMA-YEAR.            250550      
003630     MOVE WS-FM-AMD-DIA             TO WS-FM-DMA-DIA.             250560      
003631     MOVE WS-FM-AMD-MES             TO WS-FM-DMA-MES.             250570      
003632     MOVE WS-FM-AMD-YEAR            TO WS-FM-DMA-YEAR.            250580      
003633/===============================                                  250600      
003634 13000-VERIFICA-ARCHS-ENTRADA.                                    250700      
003635*===============================                                  250800      
003636***  CHANGE ATTRIBUTE TITLE OF LOG-CCR TO NOMBRE-LOGCCR.          250900      
003637     CHANGE ATTRIBUTE TITLE OF LOG-CSI TO NOMBRE-LOGCSI.          251000      
003638     CHANGE ATTRIBUTE TITLE OF INFOICA TO NOMBRE-INFOICA.         251100      
003639     IF PTER-CSI-TANDEM                                           251200      
003640        MOVE WS-NS-CORP           TO NS-REG-O-CORP                251300      
003641     ELSE                                                         251400      
003642        MOVE WS-NS-REG            TO NS-REG-O-CORP.               251500      
003643*ASM CHANGE ATTRIBUTE TITLE OF SISTEMAS TO NOMBRE-SISTEMAS.       251600      
003644*                                                                 251700      
003645*ASM IF ATTRIBUTE RESIDENT OF LOG-CSI   IS EQUAL TO VALUE TRUE    251800      
003646*ASM    MOVE SPACES               TO WS-CONF-REPROCESO            251900      
003647*ASM    PERFORM 13100-PREGUNTA-REPROCESO UNTIL CONF-REPRO-VAL     252000      
003648*ASM    IF CONF-REPROCESO-NO                                      252100      
003649*ASM       DISPLAY "020501 01  " WS-PROGRAMA,                     252200      
003650*ASM               "REPROCESO CANCELADO"                          252300      
003651*ASM       SET MYSELF(STATUS)     TO -1                           252400      
003652*ASM    ELSE                                                      252500      
003653           OPEN OUTPUT LOG-CSI     CLOSE LOG-CSI   WITH PURGE.    252600      
003654*                                                                 252700      
003655***  IF PTER-CSI-ICA                                              252800      
003656        IF ATTRIBUTE RESIDENT OF INFOICA IS EQUAL TO VALUE FALSE  252900      
003657*ASM       DISPLAY "010501 01  " WS-PROGRAMA,                     253000      
003658*ASM               "COPIE A DISCO EL "NOMBRE-INFOICA.             253100      
003659           MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ  253110      
003660           MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ    253120      
003661           MOVE 010501                 TO CODIGO-LJ               253130      
003662           MOVE "COPIE A DISCO EL ARCHIVO INFOICA"                253140      
003663                                       TO WLI-TEXTO-LJ, TEXTO-LJ  253150      
003664           PERFORM      000-030-IMPRIME-MENSAJE.                  253160      
003665*                                                                 253200      
003666*ASM IF ATTRIBUTE RESIDENT OF LOG-ERROR IS EQUAL TO VALUE TRUE    253300      
003667        OPEN OUTPUT LOG-ERROR      CLOSE LOG-ERROR WITH PURGE.    253400      
003668     OPEN OUTPUT LOG-ERROR.                                       253500      
003669*                                                                 253600      
003670***  IF NOT PTER-CSI-TANDEM                                       253700      
003671***     PERFORM 13200-REVISA-LOGCCR                               253800      
003672***     PERFORM 13300-REVISA-BDROC.                               253900      
003673*                                                                 254000      
003674***  IF PTER-CSI-ICA                                              254100      
003675        PERFORM 13400-REVISA-INFOICA.                             254200      
003676     PERFORM 13500-CREA-COMPENSACION.                             254300      
003677*ASM PERFORM 13600-REVISA-PENDIENTES.                             254400      
003678*ASM PERFORM 13700-REVISA-SISTEMAS.                               254500      
003679     OPEN OUTPUT LOG-TRANSMISION.                                 254600      
003680*                                                                 254700      
003681*=========================                                        254800      
003682*ASM 13100-PREGUNTA-REPROCESO.                                    254900      
003683*=========================                                        255000      
003684*ASM DISPLAY "050110 01  " WS-PROGRAMA,                           255100      
003685*ASM         "SE EFECTUARA REPROCESO??? <SI/NO>"                  255200      
003686*ASM ACCEPT WS-CONF-REPROCESO.                                    255300      
003687*                                                                 255400      
003688/=====================                                            255500      
003689 13400-REVISA-INFOICA.                                            255600      
003690*=====================                                            255700      
003691     OPEN INPUT  INFOICA.                                         255800      
003692     READ INFOICA               INTO WS-REG-HEA-INFOICA           255900      
003693      AT END                                                      256000      
003694*ASM      DISPLAY "010106 02  " WS-PROGRAMA,                      256100      
003695*ASM              "ARCHIVO INFOICA VACIO"                         256200      
003696          MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ   256210      
003697          MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ     256220      
003698          MOVE 010106                 TO CODIGO-LJ                256230      
003699          MOVE "ARCHIVO INFOICA VACIO"                            256240      
003700                                      TO WLI-TEXTO-LJ, TEXTO-LJ   256250      
003701          PERFORM      000-030-IMPRIME-MENSAJE                    256260      
003702          SET MYSELF(STATUS)      TO -1.                          256300      
003703*                                                                 256400      
003704     IF NOT RHI-ID-HDR                                            256500      
003705*ASM    DISPLAY "010104 01  " WS-PROGRAMA,                        256600      
003706*ASM            "ARCHIVO INFOICA SIN REG.CTL."                    256700      
003707        MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ     256710      
003708        MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ       256720      
003709        MOVE 010104                 TO CODIGO-LJ                  256730      
003710        MOVE "ARCHIVO INFOICA SIN REGISTRO DE CONTROL"            256740      
003711                                    TO WLI-TEXTO-LJ, TEXTO-LJ     256750      
003712        PERFORM      000-030-IMPRIME-MENSAJE                      256760      
003713        SET MYSELF(STATUS)        TO -1.                          256800      
003714*                                                                 256900      
003715     IF WS-RHI-FEC-PRO NOT = FECHA-PROCESO-WS                     257000      
003716*ASM IF WS-RHI-FEC-PRO NOT = WS-FECHA-INV-PROC                    257050      
003717*ASM    DISPLAY "010104 01  " WS-PROGRAMA,                        257100      
003718*ASM            " FECHA CONTABLE " WS-RHI-FEC-PRO                 257200      
003719*ASM            " DEL "NOMBRE-INFOICA                             257300      
003720*ASM            " NO CORRESPONDE CON FECHA"                       257400      
003721*ASM            " PROCESO " FECHA-PROCESO-WS                      257500      
003722        MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ     257510      
003723        MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ       257520      
003724        MOVE 010104                 TO CODIGO-LJ                  257530      
003725        MOVE "FECHA CONTABLE NO CORRESPONDE CON FECHA DE PROCESO" 257540      
003726                                    TO WLI-TEXTO-LJ, TEXTO-LJ     257550      
003727        PERFORM      000-030-IMPRIME-MENSAJE                      257560      
003728         SET MYSELF(STATUS)       TO -1.                          257600      
003729*                                                                 257700      
003730     IF ( WS-RHI-CSI-ORI = NI-CSI-ORI )  AND                      257800      
003731        ( WS-RHI-CSI-DES = NI-CSI-DES )                           257900      
003732           NEXT SENTENCE                                          258000      
003733     ELSE                                                         258100      
003734*ASM    DISPLAY "010104 01  " WS-PROGRAMA,                        258200      
003735*ASM            " CSI-ORI "WS-RHI-CSI-ORI                         258300      
003736*ASM            " CSI-DES "WS-RHI-CSI-DES" DEL HEADER "           258400      
003737*ASM      " SON DIFERENTES A ETIQUETA EXTERNA DEL "NOMBRE-INFOICA 258500      
003738        MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ     258510      
003739        MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ       258520      
003740        MOVE 010104                 TO CODIGO-LJ                  258530      
003741        MOVE "CSI-ORI Y CSI-DES SON DIF. A ETIQUETA DE INFOICA"   258540      
003742                                    TO WLI-TEXTO-LJ, TEXTO-LJ     258550      
003743        PERFORM      000-030-IMPRIME-MENSAJE                      258560      
003744        SET MYSELF(STATUS)        TO -1.                          258600      
003745*========================                                         258700      
003746 13500-CREA-COMPENSACION.                                         258800      
003747*========================                                         258900      
003748     OPEN OUTPUT COMPENSACION.                                    259000      
003749     MOVE ZEROS                   TO REG-COMPENSACION.            259100      
003750     MOVE ZEROS                   TO LLAVE-COMP.                  259200      
003751     WRITE REG-COMPENSACION                                       259300      
003752      INVALID KEY                                                 259400      
003753*ASM      DISPLAY "010105 02  " WS-PROGRAMA,                      259500      
003754*ASM              "ERROR AL GRABAR REG CTL COMPENSACION"          259600      
003755          MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ   259610      
003756          MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ     259620      
003757          MOVE 010105                 TO CODIGO-LJ                259630      
003758          MOVE "ERROR AL GRABAR REG CTL COMPENSACION"             259640      
003759                                      TO WLI-TEXTO-LJ, TEXTO-LJ   259650      
003760          PERFORM      000-030-IMPRIME-MENSAJE                    259660      
003761          SET MYSELF(STATUS)      TO -1.                          259700      
003762     CLOSE COMPENSACION    WITH SAVE.                             259800      
003763*                                                                 259900      
003764/========================                                         260000      
003765*ASM 13600-REVISA-PENDIENTES.                                     260100      
003766*========================                                         260200      
003767*ASM OPEN INPUT PENDIENTES.                                       260300      
003768*ASM READ PENDIENTES            INTO WS-REG-CTL-PENDIENTES        260400      
003769*ASM  AT  END                                                     260500      
003770*ASM      DISPLAY "010106 02  " WS-PROGRAMA,                      260600      
003771*ASM              "ARCHIVO PENDIENTES VACIO"                      260700      
003772*ASM      MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ   260710      
003773*ASM      MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ     260720      
003774*ASM      MOVE 010106                 TO CODIGO-LJ                260730      
003775*ASM      MOVE "ARCHIVO DE PENDIENTES VACIO"                      260740      
003776*ASM                                  TO WLI-TEXTO-LJ, TEXTO-LJ   260750      
003777*ASM      PERFORM      000-030-IMPRIME-MENSAJE                    260760      
003778*ASM      SET MYSELF(STATUS)      TO -1.                          260800      
003779*                                                                 260900      
003780*ASM IF NOT RCP-ID-CTL                                            261000      
003781*ASM      DISPLAY "010401 01  " WS-PROGRAMA,                      261100      
003782*ASM              "1ER. REG. PENDIENTES NO ES DE CTL."            261200      
003783*ASM      MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ   261210      
003784*ASM      MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ     261220      
003785*ASM      MOVE 010401                 TO CODIGO-LJ                261230      
003786*ASM      MOVE "EL 1ER. REG DE PENDIENTES NO ES DE CTRL"          261240      
003787*ASM                                  TO WLI-TEXTO-LJ, TEXTO-LJ   261250      
003788*ASM      PERFORM      000-030-IMPRIME-MENSAJE                    261260      
003789*ASM      SET MYSELF(STATUS)      TO -1.                          261300      
003790*                                                                 261400      
003791*ASM IF WS-RCP-FEC-PRO            NOT = FECHA-PROCESO-WS          261500      
003792*ASM    DISPLAY "010401 01  " WS-PROGRAMA,                        261600      
003793*ASM            "FECHA DEL ARCHIVO DE PENDIENTES "                261700      
003794*ASM                                     WS-RCP-FEC-PRO           261800      
003795*ASM            " DIFERENTE AL PROCESO " FECHA-PROCESO-WS         261900      
003796*ASM      MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ   261910      
003797*ASM      MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ     261920      
003798*ASM      MOVE 010401                 TO CODIGO-LJ                261930      
003799*ASM      MOVE "FECHA DE PENDIENTES DIF. A FECHA PROCESO"         261940      
003800*ASM                                  TO WLI-TEXTO-LJ, TEXTO-LJ   261950      
003801*ASM      PERFORM      000-030-IMPRIME-MENSAJE                    261960      
003802*ASM      SET MYSELF(STATUS)      TO -1.                          262000      
003803*                                                                 262100      
003804*ASM MOVE FECHA-PROCSIG-WS        TO WS-RCP-FEC-PRO.              262200      
003805*ASM MOVE WS-DATE                 TO WS-RCP-FEC-GEN.              262300      
003806*ASM MOVE WS-TIMER                TO WS-RCP-HOR-GEN.              262400      
003807*                                                                 262500      
003808*======================                                           262600      
003809*ASM 13700-REVISA-SISTEMAS.                                       262700      
003810*======================                                           262800      
003811*ASM OPEN I-O   SISTEMAS.                                         262900      
003812*ASM MOVE ZEROS                   TO LLAVE-SISTEMAS.              263000      
003813*ASM READ SISTEMAS              INTO WS-REG-CTL-GUARDIAN          263100      
003814*ASM  INVALID KEY                                                 263200      
003815*ASM      DISPLAY "010106 02  " WS-PROGRAMA,                      263300      
003816*ASM              " ARCHIVO SISTEMAS SIN REG.CTL."                263400      
003817*ASM      MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ   263410      
003818*ASM      MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ     263420      
003819*ASM      MOVE 010106                 TO CODIGO-LJ                263430      
003820*ASM      MOVE "ARCHIVO SISTEMAS SIN REG DE CTRL"                 263440      
003821*ASM                                  TO WLI-TEXTO-LJ, TEXTO-LJ   263450      
003822*ASM      PERFORM      000-030-IMPRIME-MENSAJE                    263460      
003823*ASM      SET MYSELF(STATUS)      TO -1.                          263500      
003824*                                                                 263600      
003825*ASM IF NOT PTER-CSI-TANDEM                                       263700      
003826*ASM    IF WS-RGC-FECHA-CONTABLE NOT = FECHA-PROCESO-WS           263800      
003827*ASM       DISPLAY "010401 01  " WS-PROGRAMA,                     263900      
003828*ASM               "FECHA DEL ARCHIVO DE SISTEMAS "               264000      
003829*ASM                                   WS-RGC-FECHA-CONTABLE      264100      
003830*ASM               " DIFERENTE AL PROCESO " FECHA-PROCESO-WS      264200      
003831*ASM       MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ  264210      
003832*ASM       MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ    264220      
003833*ASM       MOVE 010401                 TO CODIGO-LJ               264230      
003834*ASM       MOVE "FECHA DE ARCHIVO SISTEMAS DIF. A FECHA PROCESO"  264240      
003835*ASM                                   TO WLI-TEXTO-LJ, TEXTO-LJ  264250      
003836*ASM       PERFORM      000-030-IMPRIME-MENSAJE                   264260      
003837*ASM       SET MYSELF(STATUS)     TO -1.                          264300      
003838*                                                                 264400      
003839*ASM MOVE FECHA-PROCSIG-WS        TO WS-RGC-FECHA-CONTABLE.       264500      
003840*ASM MOVE WS-DATE                 TO WS-RGC-FECHA-REAL.           264600      
003841*ASM MOVE WS-TIMER                TO WS-RGC-HORA-REAL.            264700      
003842*                                                                 264800      
003843*ASM IF NOT PTER-CSI-TANDEM                                       264900      
003844*ASM    REWRITE REG-SISTEMAS    FROM WS-REG-CTL-GUARDIAN          265000      
003845*ASM    INVALID KEY                                               265100      
003846*ASM      DISPLAY "010105 02  " WS-PROGRAMA,                      265200      
003847*ASM              "NO PUDO ACTUALIZAR REG.CTL. SISTEMAS"          265300      
003848*ASM      MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ   265310      
003849*ASM      MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ     265320      
003850*ASM      MOVE 010105                 TO CODIGO-LJ                265330      
003851*ASM      MOVE "NO SE PUDO ACTUALIZAR REG DE CTRL SISTEMAS"       265340      
003852*ASM                                  TO WLI-TEXTO-LJ, TEXTO-LJ   265350      
003853*ASM      PERFORM      000-030-IMPRIME-MENSAJE                    265360      
003854*ASM      SET MYSELF(STATUS)      TO -1.                          265400      
003855*ASM CLOSE SISTEMAS        WITH SAVE.                             265500      
003856*ASM OPEN INPUT SISTEMAS.                                         265600      
003857*                                                                 265700      
003858*RGV /====================                                        265800      
003859*RGV  14000-CONSULTA-S080.                                        265900      
003860*RGV *====================                                        266000      
003861*RGV      CHANGE ATTRIBUTE TITLE OF "NOMBRE"  TO                  266100      
003862*RGV             "*S006/OBJECT/LIBRARY/CTLVERS ON DISK.".         266200      
003863*RGV      CALL "DAME_TIT IN NOMBRE" USING                         266300      
003864*RGV           WS-LIBRERIA, WS-TITULO, GIVING WS-STATUS.          266400      
003865*RGV      IF WS-STATUS < 0                                        266500      
003866*RGV         NEXT SENTENCE                                        266600      
003867*RGV      ELSE                                                    266700      
003868*RGV         CHANGE ATTRIBUTE TITLE OF "NOMBLIB" TO WS-TITULO.    266800      
003869*RGV *                                                            266900      
003870*RGV      MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WS-RM-MIX.        267000      
003871*RGV      MOVE WS-FECHA-INV-PROC       TO WS-RM-AAMMDD.           267100      
003872*RGV *                                                            267200      
003873*RGV      MOVE ZEROS                   TO WS-DATOS-DEFAULT.       267300      
003874*RGV      IF WS-STATUS < 0                                        267400      
003875*RGV         NEXT SENTENCE                                        267500      
003876*RGV      ELSE                                                    267600      
003877*RGV      IF PTER-CSIOK                                           267700      
003878*RGV         MOVE WS-IS-TRANS25        TO IS-CLAVE                267800      
003879*RGV         MOVE ZEROS                TO IS-RESULTADO            267900      
003880*RGV         MOVE CONTREG-CSI-TC(PTER-CSI-WS) TO IS-LLAVE         268000      
003881*RGV         CALL "LIBEST IN NOMBLIB" USING IS-CODIGO,IS-RESPUESTA268100      
003882*RGV         IF IS-RESULTADO = ZEROS                              268200      
003883*RGV            MOVE IS-NODO           TO WS-DEF-NODO             268300      
003884*RGV            MOVE IS-SUBNODO        TO WS-DEF-SUBNODO.         268400      
003885*RGV *                                                            268500      
003886*RGV      IF WS-DATOS-DEFAULT = ZEROS                             268600      
003887*RGV         IF PTER-CSIOK                                        268700      
003888*RGV            MOVE NODO-CSI-TC   (PTER-CSI-WS) TO WS-DEF-NODO   268800      
003889*RGV            MOVE SUBNODO-CSI-TC(PTER-CSI-WS) TO WS-DEF-SUBNODO268900      
003890*RGV         ELSE                                                 269000      
003891*RGV            MOVE PTER-CSI-WS     TO WS-DEF-NODO               269100      
003892*RGV            MOVE ZEROS             TO WS-DEF-SUBNODO.         269200      
003893*RGV *                                                            269300      
003894/===================================================              269400      
003895*  RUTINA PARA CAMBIAR EL NOMBRE DEL ARCH DE TANDEM               269500      
003896*===================================================              269600      
003897 15000-CAMBIA-ARCH-TANDEM.                                        269700      
003898*----------------------------                                     269800      
003899       OPEN INPUT  TANDEM.                                        269900      
003900       READ TANDEM INTO WS-REG-FECHA-TANDEM                       270000      
003901          AT END                                                  270100      
003902*ASM      DISPLAY "010106 02 " WS-PROGRAMA, " NO EXISTE ARCHIVO"  270200      
003903          MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ   270210      
003904          MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ     270220      
003905          MOVE 010106                 TO CODIGO-LJ                270230      
003906          MOVE "NO EXISTE ARCHIVO TANDEM"                         270240      
003907                                      TO WLI-TEXTO-LJ, TEXTO-LJ   270250      
003908          PERFORM      000-030-IMPRIME-MENSAJE                    270260      
003909          STOP RUN.                                               270300      
003910       MOVE "." TO WS-PUNTO.                                      270400      
003911       CHANGE ATTRIBUTE TITLE OF SALIDA TO WS-NOM-ARCH-SALIDA.    270500      
003912       OPEN OUTPUT SALIDA.                                        270600      
003913       READ TANDEM INTO WS-REG-HEA-TANDEM                         270700      
003914            AT END MOVE 1 TO WS-FIN-PROC-TANDEM.                  270800      
003915       IF NOT FIN-PROC-TANDEM                                     270900      
003916          PERFORM 15300-CONV-FECHAS-HDR                           271000      
003917          WRITE REG-SALIDA FROM WS-REG-HEA-INFOICA.               271100      
003918       PERFORM 15500-PROCESA-CAMB-TANDEM UNTIL FIN-PROC-TANDEM.   271200      
003919                                                                  271300      
003920       CLOSE TANDEM.                                              271400      
003921       CLOSE SALIDA WITH LOCK.                                    271500      
003922*                                                                 271600      
003923*======================                                           271700      
003924 15300-CONV-FECHAS-HDR.                                           271800      
003925*======================                                           271900      
003926     MOVE WS-THI-ID               TO WS-RHI-ID.                   271950      
003927*ASM MOVE CORR WS-REG-HEA-TANDEM  TO WS-REG-HEA-INFOICA.          272000      
003928     MOVE WS-THI-FEC-PRO          TO A2K-FEC-DMA-001.             272100      
003929     PERFORM A2K-CONV-DMA-TO-DMCA THRU A2K-CONV-DMA-TO-DMCA-EXIT. 272200      
003930     MOVE A2K-FEC-DMCA-001        TO WS-RHI-FEC-PRO.              272300      
003931*ASM                       WS-RHI-FEC-PRO OF WS-REG-HEA-INFOICA.  272400      
003932     MOVE WS-THI-FEC-GEN          TO A2K-FEC-DMA-001.             272500      
003933     PERFORM A2K-CONV-DMA-TO-DMCA THRU A2K-CONV-DMA-TO-DMCA-EXIT. 272600      
003934     MOVE A2K-FEC-DMCA-001        TO WS-RHI-FEC-GEN.              272700      
003935*ASM                       WS-RHI-FEC-GEN OF WS-REG-HEA-INFOICA.  272800      
003936     MOVE WS-THI-HOR-GEN          TO WS-RHI-HOR-GEN.              272810      
003937     MOVE WS-THI-SIS-EMI          TO WS-RHI-SIS-EMI.              272820      
003938     MOVE WS-THI-SIS-REC          TO WS-RHI-SIS-REC.              272830      
003939     MOVE WS-THI-NOM-EXT          TO WS-RHI-NOM-EXT.              272840      
003940     MOVE WS-THI-NUM-REG          TO WS-RHI-NUM-REG.              272850      
003941     MOVE WS-THI-CSI-ORI          TO WS-RHI-CSI-ORI.              272860      
003942     MOVE WS-THI-CSI-DES          TO WS-RHI-CSI-DES.              272870      
003943*                                                                 272900      
003944*==========================                                       273000      
003945 15500-PROCESA-CAMB-TANDEM.                                       273100      
003946*==========================                                       273200      
003947       READ TANDEM INTO WS-REG-DET-TANDEM                         273300      
003948            AT END MOVE 1 TO WS-FIN-PROC-TANDEM.                  273400      
003949                                                                  273500      
003950       IF NOT FIN-PROC-TANDEM                                     273600      
003951          MOVE WS-REG-DET-TANDEM  TO WS-REG-TRA-TANDEM            273610      
003952          IF TTI-ID-HDR                                           273620      
003953             MOVE WS-TTI-ID       TO WS-RTI-ID                    273630      
003954             MOVE WS-TTI-NUM-REG  TO WS-RTI-NUM-REG               273640      
003955             WRITE REG-SALIDA FROM WS-REG-TRA-INFOICA             273650      
003956          ELSE                                                    273660      
003957             PERFORM 15800-CONV-FECHAS-DET                        273700      
003958             WRITE REG-SALIDA FROM WS-REG-DET-INFOICA.            273800      
003959*                                                                 273900      
003960*======================                                           274000      
003961 15800-CONV-FECHAS-DET.                                           274100      
003962*======================                                           274200      
003963*ASM MOVE CORR WS-REG-DET-TANDEM  TO WS-REG-DET-INFOICA.          274300      
003964     MOVE WS-TDI-CSI-ORI          TO WS-RDI-CSI-ORI.              274320      
003965     MOVE WS-TDI-NOD-ORI          TO WS-RDI-NOD-ORI.              274340      
003966     MOVE WS-TDI-CSI-DES          TO WS-RDI-CSI-DES.              274360      
003967     MOVE WS-TDI-NOM-EST          TO WS-RDI-NOM-EST.              274380      
003968     MOVE WS-TDI-FEC-GEN          TO A2K-FEC-AMD-001.             274400      
003969     PERFORM A2K-CONV-AMD-TO-CAMD THRU A2K-CONV-AMD-TO-CAMD-EXIT. 274500      
003970     MOVE A2K-FEC-CAMD-001        TO WS-RDI-FEC-GEN.              274600      
003971*ASM                       WS-RDI-FEC-GEN OF WS-REG-DET-INFOICA.  274700      
003972     MOVE WS-TDI-HOR-GEN          TO WS-RDI-HOR-GEN.              274710      
003973     MOVE WS-TDI-APL-ORI          TO WS-RDI-APL-ORI.              274720      
003974     MOVE WS-TDI-APL-DES          TO WS-RDI-APL-DES.              274730      
003975     MOVE WS-TDI-STA-TRN          TO WS-RDI-STA-TRN.              274740      
003976     MOVE WS-TDI-COD-SER          TO WS-RDI-COD-SER.              274750      
003977     MOVE WS-TDI-SUB-SER          TO WS-RDI-SUB-SER.              274760      
003978     MOVE WS-TDI-CTA-DES          TO WS-RDI-CTA-DES.              274770      
003979     MOVE WS-TDI-IMP-TRN          TO WS-RDI-IMP-TRN.              274780      
003980     MOVE WS-TDI-MON-TRN          TO WS-RDI-MON-TRN.              274790      
003981     MOVE WS-TDI-FEC-CON          TO A2K-FEC-AMD-001.             274800      
003982     PERFORM A2K-CONV-AMD-TO-CAMD THRU A2K-CONV-AMD-TO-CAMD-EXIT. 274900      
003983     MOVE A2K-FEC-CAMD-001        TO WS-RDI-FEC-CON.              275000      
003984*ASM                       WS-RDI-FEC-CON OF WS-REG-DET-INFOICA.  275100      
003985     MOVE WS-TDI-CVE-AUT          TO WS-RDI-CVE-AUT.              275120      
003986     MOVE WS-TDI-NUM-TRN          TO WS-RDI-NUM-TRN.              275140      
003987     MOVE WS-TDI-CTA-ACC          TO WS-RDI-CTA-ACC.              275160      
003988     MOVE WS-TDI-REF-OPE          TO WS-RDI-REF-OPE.              275180      
003989*                                                                 275200      
003990/======================                                           275300      
003991 20000-CONTROL-PROCESO.                                           275400      
003992*======================                                           275500      
003993     MOVE LOW-VALUES              TO TAB-TOT.                     275600      
003994     OPEN OUTPUT LOG-SORT.                                        275700      
003995***  PERFORM 21800-IMPRIME-TITULOS.                               275800      
003996     PERFORM 21000-VACIA-ENTRADAS.                                275900      
003997***  PERFORM 21900-IMPRIME-TOTALES.                               276000      
003998     CLOSE LOG-SORT        WITH SAVE.                             276100      
003999*                                                                 276200      
004000     MOVE LOW-VALUES              TO TAB-TOT WS-TOTALES-SISTEMA.  276300      
004001*                                                                 276400      
004002     PERFORM 22000-DETECTA-ERRORES.                               276500      
004003     PERFORM 23000-GENERA-LOGCSI.                                 276600      
004004     PERFORM 24000-GENERA-TRANSMISION.                            276700      
004005*ASM PERFORM 25000-IMPRIME-PENDIENTES.                            276800      
004006     PERFORM 26000-IMPRIME-ERRORES.                               276900      
004007*                                                                 277000      
004008*=====================                                            277100      
004009 21000-VACIA-ENTRADAS.                                            277200      
004010*=====================                                            277300      
004011***  IF NOT PTER-CSI-TANDEM                                       277400      
004012***     PERFORM 21010-BDROC                                       277500      
004013***     PERFORM 21020-LOGCCR.                                     277600      
004014*                                                                 277700      
004015***  IF PTER-CSI-ICA                                              277800      
004016        PERFORM 21030-INFOICA.                                    277900      
004017*                                                                 278000      
004018*==============                                                   278100      
004019 21030-INFOICA.                                                   278200      
004020*==============                                                   278300      
004021     MOVE SPACES                  TO R0D1-LEY.                    278400      
004022     MOVE "INFOICA"               TO R0D1-TARCH.                  278500      
004023     MOVE WS-RHI-FEC-GEN          TO R0D1-FEC.                    278600      
004024     MOVE WS-RHI-HH-GEN           TO R0D1-HH .                    278700      
004025     MOVE WS-RHI-MM-GEN           TO R0D1-MM .                    278750      
004026     MOVE ":"                     TO R0D1-2-PUNTOS1               278770      
004027                                     R0D1-2-PUNTOS2.              278790      
004028     PERFORM 21250-PROCESA-INFOICA.                               278800      
004029*                                                                 278900      
004030/=================                                                279000      
004031 21212-CHECA-CSI.                                                 279100      
004032*=================                                                279200      
004033     IF WS-RDI-CSI-ORI  = PTER-CSI-WS                             279300      
004034        NEXT SENTENCE                                             279400      
004035     ELSE                                                         279500      
004036     IF WS-RDI-CSI-DES  = PTER-CSI-WS                             279600      
004037        MOVE WS-RDI-CSI-ORI       TO WS-RDI-CSI-DES               279700      
004038        MOVE PTER-CSI-WS          TO WS-RDI-CSI-ORI               279800      
004039        MOVE WS-RDI-APL-ORI       TO WS-APL-ORI-PTE               279900      
004040        MOVE WS-RDI-APL-DES       TO WS-RDI-APL-ORI               280000      
004041        MOVE WS-APL-ORI-PTE       TO WS-RDI-APL-DES.              280100      
004042*                                                                 280200      
004043/=====================                                            280300      
004044 21250-PROCESA-INFOICA.                                           280400      
004045*=====================                                            280500      
004046     MOVE ZEROS                   TO HAY-DIF-WS.                  280600      
004047     MOVE ZEROS                   TO HAY-TRAILER-WS.              280700      
004048     MOVE ZEROS                   TO WS-FIN-INFOICA.              280800      
004049     MOVE ZEROS                   TO WS-CONT-REG-INFOICA.         280900      
004050     MOVE LOW-VALUES              TO WS-TOTALES-SISTEMA.          281000      
004051     MOVE LOW-VALUES              TO TAB-ACUM.                    281100      
004052     MOVE LOW-VALUES              TO TAB-AELIM.                   281200      
004053     PERFORM 21270-LEE-INFOICA.                                   281300      
004054     PERFORM 21260-VACIA-INFOICA UNTIL FIN-INFOICA.               281400      
004055***  PERFORM 21400-IMPRIME-DETALLE                                281500      
004056     PERFORM 21550-BUSCA-DIF-INFOICA                              281600      
004057*    DISPLAY "S030/050: LEIDOS DE INFOICA    >"WS-CONT-REG-INFOICA281700      
004058     CLOSE INFOICA         WITH LOCK.                             281800      
004059*                                                                 281900      
004060*==================                                               282000      
004061 21260-VACIA-INFOICA.                                             282100      
004062*==================                                               282200      
004063     PERFORM 21212-CHECA-CSI.                                     282300      
004064     PERFORM 21300-REVISA-LOG.                                    282400      
004065     PERFORM 21270-LEE-INFOICA.                                   282500      
004066*                                                                 282600      
004067*==================                                               282700      
004068 21270-LEE-INFOICA.                                               282800      
004069*==================                                               282900      
004070     READ INFOICA               INTO WS-REG-DET-INFOICA           283000      
004071     AT END                                                       283100      
004072          MOVE 1                  TO WS-FIN-INFOICA.              283200      
004073     IF WS-REG-DET-INFOICA        = LOW-VALUES OR HIGH-VALUES     283300      
004074        MOVE  1                   TO WS-FIN-INFOICA.              283400      
004075     MOVE WS-REG-DET-INFOICA      TO WS-REG-TRA-INFOICA           283500      
004076     IF RTI-ID-HDR                                                283600      
004077        MOVE 1                    TO HAY-TRAILER-WS               283700      
004078        MOVE 1                    TO WS-FIN-INFOICA.              283800      
004079     IF NOT FIN-INFOICA                                           283900      
004080        ADD 1                     TO WS-CONT-REG-INFOICA.         284000      
004081*                                                                 284100      
004082*===> SOLO PARA PRUEBAS                                           284200      
004083*    IF WS-RDI-CSI-ORI = 33                                       284300      
004084*       MOVE 06                   TO WS-RDI-CSI-ORI.              284400      
004085*    IF WS-RDI-CSI-DES = 33                                       284500      
004086*       MOVE 06                   TO WS-RDI-CSI-DES.              284600      
004087*===> ELIMINAR ASIGNACION ANTERIOR PARA PRODUCCION                284700      
004088*                                                                 284800      
004089/=================                                                284900      
004090 21300-REVISA-LOG.                                                285000      
004091*=================                                                285100      
004092     MOVE SPACES                  TO REP2-DET1.                   285200      
004093*                                                                 285300      
004094     IF WS-RDI-MON-TRN            = SPACES OR ZEROS               285400      
004095     OR WS-RDI-MON-TRN            NOT NUMERIC                     285500      
004096        MOVE "K"                  TO R2D1-ERR(11).                285600      
004097*                                                                 285700      
004098     IF NOT RDI-CSI-ORI-VAL                                       285800      
004099     OR  WS-RDI-CSI-ORI           NOT = PTER-CSI-WS               285900      
004100        MOVE "A"                  TO R2D1-ERR(1).                 286000      
004101*                                                                 286100      
004102     IF NOT RDI-CSI-DES-VAL                                       286200      
004103        MOVE "C"                  TO R2D1-ERR(3).                 286300      
004104*                                                                 286400      
004105     IF WS-RDI-APL-ORI            = SPACES OR ZEROS               286500      
004106     OR WS-RDI-APL-ORI            NOT NUMERIC                     286600      
004107     OR WS-RDI-APL-ORI            > 999                           286700      
004108        MOVE "B"                  TO R2D1-ERR(2).                 286800      
004109*                                                                 286900      
004110     IF WS-RDI-APL-DES            = SPACES OR ZEROS               287000      
004111     OR WS-RDI-APL-DES            NOT NUMERIC                     287100      
004112     OR WS-RDI-APL-DES            > 999                           287200      
004113        MOVE "D"                  TO R2D1-ERR(4).                 287300      
004114*                                                                 287400      
004115     IF WS-RDI-NOM-EST            = SPACES OR ZEROS               287500      
004116        MOVE "E"                  TO R2D1-ERR(5).                 287600      
004117*                                                                 287700      
004118     IF WS-RDI-CTA-DES            = SPACES                        287800      
004119        MOVE "G"                  TO R2D1-ERR(7).                 287900      
004120*                                                                 288000      
004121     IF WS-RDI-CVE-AUT            = SPACES OR ZEROS               288100      
004122        MOVE "F"                  TO R2D1-ERR(6).                 288200      
004123*                                                                 288300      
004124     IF WS-RDI-FEC-CON            = SPACES OR ZEROS               288400      
004125     OR WS-RDI-FEC-CON            NOT NUMERIC                     288500      
004126        MOVE "L"                  TO R2D1-ERR(12).                288600      
004127*                                                                 288700      
004128     IF WS-RDI-IMP-TRN            = SPACES OR ZEROS               288800      
004129     OR WS-RDI-IMP-TRN            NOT NUMERIC                     288900      
004130        MOVE "I"                  TO R2D1-ERR(9).                 289000      
004131*                                                                 289100      
004132     IF RDI-COD-SER-VAL                                           289200      
004133        NEXT SENTENCE                                             289300      
004134     ELSE                                                         289400      
004135        MOVE "H"                  TO R2D1-ERR(8).                 289500      
004136*                                                                 289600      
004137     IF RDI-STA-TRN-VAL                                           289700      
004138        NEXT SENTENCE                                             289800      
004139     ELSE                                                         289900      
004140        MOVE 3                    TO WS-AP-OPER-APL               290000      
004141        MOVE "J"                  TO R2D1-ERR(10).                290100      
004142/                                                                 290200      
004143     MOVE ZEROS                   TO HAY-ELIMINA-WS.              290300      
004144     IF R2D1-ERRORES NOT = SPACES                                 290400      
004145        MOVE 1                    TO HAY-ELIMINA-WS.              290500      
004146*                                                                 290600      
004147     IF RDI-STA-TRN-OPERADO                                       290700      
004148        MOVE 2                    TO WS-AP-OPER-APL               290800      
004149     ELSE                                                         290900      
004150     IF RDI-STA-TRN-APLICADO                                      291000      
004151        MOVE 3                    TO WS-AP-OPER-APL               291100      
004152     ELSE                                                         291200      
004153     IF RDI-STA-TRN-PENDIENTE                                     291300      
004154        MOVE 4                    TO WS-AP-OPER-APL               291400      
004155     ELSE                                                         291500      
004156        MOVE 5                    TO WS-AP-OPER-APL.              291600      
004157*                                                                 291700      
004158     IF WS-RDI-CSI-ORI = WS-RDI-CSI-DES                           291800      
004159        MOVE 1                    TO WS-AP-OPER-APL               291900      
004160        IF RDI-STA-TRN-OPERADO                                    292000      
004161           NEXT SENTENCE                                          292100      
004162        ELSE                                                      292200      
004163           MOVE 1                 TO HAY-ELIMINA-WS               292300      
004164           IF RDI-STA-TRN-PENDIENTE                               292400      
004165              MOVE "LOCAL S/RESP" TO R2D1-ERRORES                 292500      
004166           ELSE                                                   292600      
004167           IF RDI-STA-TRN-ENVIADO                                 292700      
004168              MOVE "LOCAL ANULAD" TO R2D1-ERRORES                 292800      
004169           ELSE                                                   292900      
004170              MOVE "LOCAL ER/STA" TO R2D1-ERRORES.                293000      
004171*                                                                 293100      
004172*ASM IF NOT HAY-ELIMINA                                           293200      
004173*ASM    IF WS-RDI-FEC-CON > WS-FECMAX-ANTIGUEDAD                  293300      
004174*ASM       NEXT SENTENCE                                          293400      
004175*ASM    ELSE                                                      293500      
004176*ASM       MOVE "FEC/ANTIGUA "    TO R2D1-ERRORES                 293600      
004177*ASM       MOVE 1                 TO HAY-ELIMINA-WS.              293700      
004178*                                                                 293800      
004179     IF NOT HAY-ELIMINA                                           293900      
004180        IF WS-RDI-CSI-ORI = WS-RDI-CSI-DES                        294000      
004181           PERFORM 21315-ARMA-LOG-TRANSMISION                     294100      
004182        ELSE                                                      294200      
004183           PERFORM 21310-ARMA-LOG-SORT.                           294300      
004184*                                                                 294400      
004185     IF NOT HAY-ELIMINA                                           294500      
004186        IF RDI-STA-TRN-OPERADO OR RDI-STA-TRN-APLICADO            294600      
004187        OR RDI-STA-TRN-PENDIENTE                                  294700      
004188           PERFORM 21320-SUMA-CARGO-ABONO.                        294800      
004189*                                                                 294900      
004190     IF HAY-ELIMINA                                               295000      
004191        IF RDI-STA-TRN-ENVIADO OR RDI-STA-TRN-DENEGADO            295100      
004192           PERFORM 21340-GRABA-ERROR                              295200      
004193        ELSE                                                      295300      
004194           PERFORM 21330-SUMA-ELIMINADOS                          295400      
004195           PERFORM 21340-GRABA-ERROR.                             295500      
004196*                                                                 295600      
004197     IF RDI-STA-TRN-ENVIADO OR RDI-STA-TRN-DENEGADO               295700      
004198        NEXT SENTENCE                                             295800      
004199     ELSE                                                         295900      
004200        PERFORM 21350-SUMA-TODOS.                                 296000      
004201*                                                                 296100      
004202/====================                                             296200      
004203 21310-ARMA-LOG-SORT.                                             296300      
004204*====================                                             296400      
004205*                                                                 296500      
004206     WRITE REG-LOG-SORT         FROM WS-REG-DET-INFOICA           296600      
004207      INVALID KEY                                                 296700      
004208*ASM          DISPLAY "010105 02  " WS-PROGRAMA,                  296800      
004209*ASM                  "ESP. INSUF. LOG-SORT"                      296900      
004210              MOVE SPACES               TO WLI-TEXTO-LJ, TEXTO-LJ 296910      
004211              MOVE "I"                  TO WLI-TIPO-LJ, TIPO-LJ   296920      
004212              MOVE 010105               TO CODIGO-LJ              296930      
004213              MOVE "ESPACIO INSUF. EN LOG-SORT"                   296940      
004214                                        TO WLI-TEXTO-LJ, TEXTO-LJ 296950      
004215              PERFORM      000-030-IMPRIME-MENSAJE                296960      
004216              SET MYSELF(STATUS)  TO -1.                          297000      
004217*                                                                 297100      
004218*===========================                                      297200      
004219 21315-ARMA-LOG-TRANSMISION.                                      297300      
004220*===========================                                      297400      
004221*                                                                 297500      
004222     MOVE LOW-VALUES              TO WS-REG-SORT3                 297600      
004223     MOVE WS-RDI-COD-SER          TO WS-RS3-COD-SER.              297700      
004224     MOVE WS-RDI-IMP-TRN          TO WS-RS3-IMP-TRN.              297800      
004225*                                                                 297900      
004226     MOVE 1                       TO WS-RS3-TIPO-REP.             298000      
004227     MOVE WS-RDI-FEC-CON          TO WS-RS3-FEC-CON               298100      
004228     MOVE WS-RDI-APL-ORI          TO WS-RS3-APL-ORI               298200      
004229     MOVE 1                       TO WS-RS3-AMBITO                298300      
004230     PERFORM 21316-ESCRIBE-LOG-TRANSMISION.                       298400      
004231*                                                                 298500      
004232     MOVE 2                       TO WS-RS3-TIPO-REP.             298600      
004233     MOVE WS-RDI-NOD-ORI          TO WS-RS3-NOD-ORI               298700      
004234     MOVE WS-RDI-NOM-EST          TO WS-RS3-STA-NAME              298800      
004235     PERFORM 21316-ESCRIBE-LOG-TRANSMISION.                       298900      
004236*                                                                 299000      
004237     MOVE 3                       TO WS-RS3-TIPO-REP.             299100      
004238     MOVE WS-RDI-APL-ORI          TO WS-RS3-SISTEMA               299200      
004239     MOVE WS-RDI-SUC-ORI          TO WS-RS3-SUCURSAL              299300      
004240     MOVE WS-RDI-MON-TRN          TO WS-RS3-MONEDA                299400      
004241     MOVE WS-RDI-NOM-EST          TO WS-RS3-TERMINAL              299500      
004242     IF WS-RDI-FEC-CON = WS-FECHA-INV-PROC                        299600      
004243        PERFORM 21316-ESCRIBE-LOG-TRANSMISION.                    299700      
004244*                                                                 299800      
004245*==============================                                   299900      
004246 21316-ESCRIBE-LOG-TRANSMISION.                                   300000      
004247*==============================                                   300100      
004248     WRITE REG-LOG-TRANSMISION  FROM WS-REG-SORT3                 300200      
004249      INVALID KEY                                                 300300      
004250*ASM          DISPLAY "010105 02  " WS-PROGRAMA,                  300400      
004251*ASM                  "ESP. INSUF. LOG-TRANSMISION"               300500      
004252              MOVE SPACES               TO WLI-TEXTO-LJ, TEXTO-LJ 300510      
004253              MOVE "I"                  TO WLI-TIPO-LJ, TIPO-LJ   300520      
004254              MOVE 010105               TO CODIGO-LJ              300530      
004255              MOVE "ESPACIO INSUF. EN LOG-TRANSMISION"            300540      
004256                                        TO WLI-TEXTO-LJ, TEXTO-LJ 300550      
004257              PERFORM      000-030-IMPRIME-MENSAJE                300560      
004258              SET MYSELF(STATUS)  TO -1.                          300600      
004259*                                                                 300700      
004260/=======================                                          300800      
004261 21320-SUMA-CARGO-ABONO.                                          300900      
004262*=======================                                          301000      
004263     IF RDI-COD-SER-CARGO                                         301100      
004264        ADD 1              TO NUM-CARGOS-ACUM(WS-AP-OPER-APL)     301200      
004265        ADD 1              TO NUM-CARGOS-TOT (WS-AP-OPER-APL)     301300      
004266        ADD WS-RDI-IMP-TRN TO IMP-CARGOS-ACUM(WS-AP-OPER-APL)     301400      
004267        ADD WS-RDI-IMP-TRN TO IMP-CARGOS-TOT (WS-AP-OPER-APL)     301500      
004268     ELSE                                                         301600      
004269     IF RDI-COD-SER-ABONO                                         301700      
004270        ADD 1              TO NUM-ABONOS-ACUM(WS-AP-OPER-APL)     301800      
004271        ADD 1              TO NUM-ABONOS-TOT (WS-AP-OPER-APL)     301900      
004272        ADD WS-RDI-IMP-TRN TO IMP-ABONOS-ACUM(WS-AP-OPER-APL)     302000      
004273        ADD WS-RDI-IMP-TRN TO IMP-ABONOS-TOT (WS-AP-OPER-APL)     302100      
004274     ELSE                                                         302200      
004275     IF RDI-COD-SER-ELIMCARGO                                     302300      
004276        SUBTRACT 1       FROM NUM-CARGOS-ACUM(WS-AP-OPER-APL)     302400      
004277        SUBTRACT 1       FROM NUM-CARGOS-TOT (WS-AP-OPER-APL)     302500      
004278        SUBTRACT WS-RDI-IMP-TRN                                   302600      
004279                         FROM IMP-CARGOS-ACUM(WS-AP-OPER-APL)     302700      
004280        SUBTRACT WS-RDI-IMP-TRN                                   302800      
004281                         FROM IMP-CARGOS-TOT (WS-AP-OPER-APL)     302900      
004282     ELSE                                                         303000      
004283*    ...RDI-CT-ELIMABONO                                          303100      
004284        SUBTRACT 1       FROM NUM-ABONOS-ACUM(WS-AP-OPER-APL)     303200      
004285        SUBTRACT 1       FROM NUM-ABONOS-TOT (WS-AP-OPER-APL)     303300      
004286        SUBTRACT WS-RDI-IMP-TRN                                   303400      
004287                         FROM IMP-ABONOS-ACUM(WS-AP-OPER-APL)     303500      
004288        SUBTRACT WS-RDI-IMP-TRN                                   303600      
004289                         FROM IMP-ABONOS-TOT (WS-AP-OPER-APL).    303700      
004290*                                                                 303800      
004291*======================                                           303900      
004292 21330-SUMA-ELIMINADOS.                                           304000      
004293*======================                                           304100      
004294     IF RDI-COD-SER-CARGO                                         304200      
004295        ADD 1              TO NUM-CARGOS-AELIM(WS-AP-OPER-APL)    304300      
004296        ADD WS-RDI-IMP-TRN TO IMP-CARGOS-AELIM(WS-AP-OPER-APL)    304400      
004297     ELSE                                                         304500      
004298     IF RDI-COD-SER-ABONO                                         304600      
004299        ADD 1              TO NUM-ABONOS-AELIM(WS-AP-OPER-APL)    304700      
004300        ADD WS-RDI-IMP-TRN TO IMP-ABONOS-AELIM(WS-AP-OPER-APL)    304800      
004301     ELSE                                                         304900      
004302     IF RDI-COD-SER-ELIMCARGO                                     305000      
004303        SUBTRACT 1       FROM NUM-CARGOS-AELIM(WS-AP-OPER-APL)    305100      
004304        SUBTRACT WS-RDI-IMP-TRN                                   305200      
004305                         FROM IMP-CARGOS-AELIM(WS-AP-OPER-APL)    305300      
004306     ELSE                                                         305400      
004307     IF RDI-COD-SER-ELIMABONO                                     305500      
004308        SUBTRACT 1       FROM NUM-ABONOS-AELIM(WS-AP-OPER-APL)    305600      
004309        SUBTRACT WS-RDI-IMP-TRN                                   305700      
004310                         FROM IMP-ABONOS-AELIM(WS-AP-OPER-APL)    305800      
004311     ELSE                                                         305900      
004312        ADD 1              TO NUM-CARABO-AELIM(WS-AP-OPER-APL)    306000      
004313        ADD WS-RDI-IMP-TRN TO IMP-CARABO-AELIM(WS-AP-OPER-APL).   306100      
004314*                                                                 306200      
004315/==================                                               306300      
004316 21340-GRABA-ERROR.                                               306400      
004317*==================                                               306500      
004318     MOVE WS-REG-DET-INFOICA      TO RE-REG-ERROR.                306600      
004319     MOVE R2D1-ERRORES            TO RE-TIPO-ERROR.               306700      
004320     WRITE REG-ERRORES                                            306800      
004321      INVALID KEY                                                 306900      
004322*ASM      DISPLAY "010105 02  " WS-PROGRAMA,                      307000      
004323*ASM              "ESP. INSUF. GRABAR LOG-ERROR(1)"               307100      
004324          MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ   307110      
004325          MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ     307120      
004326          MOVE 010105                 TO CODIGO-LJ                307130      
004327          MOVE "ESPACIO INSUF. GRABAR LOG-ERROR(1)"               307140      
004328                                      TO WLI-TEXTO-LJ, TEXTO-LJ   307150      
004329          PERFORM      000-030-IMPRIME-MENSAJE                    307160      
004330          SET MYSELF(STATUS)      TO -1.                          307200      
004331*                                                                 307300      
004332*=================                                                307400      
004333 21350-SUMA-TODOS.                                                307500      
004334*=================                                                307600      
004335     IF RDI-COD-SER-CARGO                                         307700      
004336        ADD 1                     TO WS-NUM-SIS(WS-AP-OPER-APL,1) 307800      
004337        ADD WS-RDI-IMP-TRN        TO WS-IMP-SIS(WS-AP-OPER-APL,1) 307900      
004338     ELSE                                                         308000      
004339     IF RDI-COD-SER-ABONO                                         308100      
004340        ADD 1                     TO WS-NUM-SIS(WS-AP-OPER-APL,2) 308200      
004341        ADD WS-RDI-IMP-TRN        TO WS-IMP-SIS(WS-AP-OPER-APL,2) 308300      
004342     ELSE                                                         308400      
004343     IF RDI-COD-SER-ELIMCARGO                                     308500      
004344        SUBTRACT 1              FROM WS-NUM-SIS(WS-AP-OPER-APL,1) 308600      
004345        SUBTRACT WS-RDI-IMP-TRN FROM WS-IMP-SIS(WS-AP-OPER-APL,1) 308700      
004346     ELSE                                                         308800      
004347     IF RDI-COD-SER-ELIMABONO                                     308900      
004348        SUBTRACT 1              FROM WS-NUM-SIS(WS-AP-OPER-APL,2) 309000      
004349        SUBTRACT WS-RDI-IMP-TRN FROM WS-IMP-SIS(WS-AP-OPER-APL,2) 309100      
004350     ELSE                                                         309200      
004351        ADD 1                     TO WS-NUM-SIS(WS-AP-OPER-APL,3) 309300      
004352        ADD WS-RDI-IMP-TRN        TO WS-IMP-SIS(WS-AP-OPER-APL,3).309400      
004353*                                                                 309500      
004354/=======================                                          309600      
004355 21550-BUSCA-DIF-INFOICA.                                         309700      
004356*=======================                                          309800      
004357     IF NOT CONT-R1-LIN-60                                        309900      
004358***     PERFORM 21800-IMPRIME-TITULOS.                            310000      
004359*                                                                 310100      
004360     IF HAY-TRAILER                                               310200      
004361        IF WS-CONT-REG-INFOICA   NOT =  WS-RTI-NUM-REG            310300      
004362*          DISPLAY "010201 02  " WS-PROGRAMA,                     310400      
004363*                  NOMBRE-INFOICA" TIENE "                        310500      
004364*            WS-CONT-REG-INFOICA" VS. TRAILER "WS-RTI-NUM-REG     310600      
004365           MOVE "      DIF. VS. CIFRAS TRAILER  "                 310700      
004366                                  TO R0D1-LEY                     310800      
004367           MOVE WS-R0D1-STA(6)    TO R0D1-STATUS                  310900      
004368           MOVE WS-CONT-REG-INFOICA TO R0D1-NCO                   311000      
004369***        WRITE LREP0 FROM REP0-DET1 BEFORE 1                    311100      
004370           MOVE SPACES            TO R0D1-LEY                     311200      
004371           MOVE WS-R0D1-STA(7)    TO R0D1-STATUS                  311300      
004372           MOVE WS-RTI-NUM-REG    TO R0D1-NCO                     311400      
004373***        WRITE LREP0 FROM REP0-DET1 BEFORE 1                    311500      
004374           SET MYSELF (STATUS)    TO -1                           311600      
004375        ELSE                                                      311700      
004376***        WRITE LREP0 FROM REP0-DET5 BEFORE 2                    311800      
004377           NEXT SENTENCE                                          311900      
004378     ELSE                                                         312000      
004379*ASM   DISPLAY "010401 01  " WS-PROGRAMA, " "NOMBRE-INFOICA       312100      
004380*ASM           " INCOMPLETO, SIN REGISTRO TRAILER"                312200      
004381       MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ      312210      
004382       MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ        312220      
004383       MOVE 010401                 TO CODIGO-LJ                   312230      
004384       MOVE "ARCHIVO INFOICA SIN REGISTRO TRAILER"                312240      
004385                                   TO WLI-TEXTO-LJ, TEXTO-LJ      312250      
004386       PERFORM      000-030-IMPRIME-MENSAJE                       312260      
004387       MOVE "     ARCHIVO SIN REG. TRAILER  "                     312300      
004388                                  TO R0D1-LEY                     312400      
004389       MOVE WS-R0D1-STA(6)        TO R0D1-STATUS                  312500      
004390       MOVE WS-CONT-REG-INFOICA   TO R0D1-NCO                     312600      
004391***    WRITE LREP0 FROM REP0-DET1 BEFORE 1                        312700      
004392       MOVE SPACES                TO R0D1-LEY                     312800      
004393       MOVE ZEROS                 TO R0D1-NCO                     312900      
004394       MOVE WS-R0D1-STA(7)        TO R0D1-STATUS                  313000      
004395***    WRITE LREP0 FROM REP0-DET1 BEFORE 1                        313100      
004396       SET MYSELF (STATUS)        TO -1.                          313200      
004397***  WRITE LREP0 FROM REP0-DET5   BEFORE 1.                       313300      
004398     ADD 3                        TO WS-CONT-R1-LIN.              313400      
004399*                                                                 313500      
004400/=====================                                            313600      
004401*21800-IMPRIME-TITULOS.                                           313700      
004402*=====================                                            313800      
004403***  ADD 1                        TO WS-CONT-R1-HOJAS.            313900      
004404***  MOVE WS-CONT-R1-HOJAS        TO RT1-PAG.                     314000      
004405***  MOVE WS-RT1-REP0             TO RT1-TITULO.                  314100      
004406***  MOVE WS-RT2-REP0             TO RT2-TITULO.                  314200      
004407***  MOVE SPACES                  TO RT4-NMONEDA.                 314300      
004408***  MOVE ZEROS                   TO RT4-MONEDA.                  314400      
004409***  WRITE LREP0 FROM REP0-DET5   BEFORE PAGE.                    314500      
004410***  WRITE LREP0 FROM REP-TIT1    BEFORE 1.                       314600      
004411***  WRITE LREP0 FROM REP-TIT2    BEFORE 1.                       314700      
004412***  WRITE LREP0 FROM REP-TIT3    BEFORE 2.                       314800      
004413***  WRITE LREP0 FROM REP-TIT4    BEFORE 2.                       314900      
004414***  WRITE LREP0 FROM REP0-SUB1   BEFORE 2.                       315000      
004415***  MOVE 8                       TO WS-CONT-R1-LIN.              315100      
004416*                                                                 315200      
004417*=====================                                            315300      
004418*21900-IMPRIME-TOTALES.                                           315400      
004419*=====================                                            315500      
004420***  IF NOT CONT-R1-LIN-60                                        315600      
004421***     PERFORM 21800-IMPRIME-TITULOS.                            315700      
004422***  MOVE ">> T O T A L   G E N E R A L >>"                       315800      
004423***                               TO R0D1-LEY.                    315900      
004424***  WRITE LREP0 FROM REP0-DET5   BEFORE 2.                       316000      
004425***  MOVE ALL "*"                 TO LREP0.                       316100      
004426***  WRITE LREP0                  BEFORE 2.                       316200      
004427***  PERFORM 21910-VACIA-TOTAL-GENERAL                            316300      
004428***               VARYING WS-AP-OPER-APL FROM 1 BY 1              316400      
004429***                 UNTIL WS-AP-OPER-APL > 4.                     316500      
004430***  ADD 4                        TO WS-CONT-R1-LIN.              316600      
004431*                                                                 316700      
004432*==========================                                       316800      
004433*21910-VACIA-TOTAL-GENERAL.                                       316900      
004434*==========================                                       317000      
004435***  IF WS-AP-OPER-APL > 1                                        317100      
004436***     MOVE SPACES               TO R0D1-LEY.                    317200      
004437***  MOVE WS-R0D1-STA   (WS-AP-OPER-APL)                          317300      
004438***                               TO R0D1-STATUS.                 317400      
004439***  MOVE NUM-CARGOS-TOT(WS-AP-OPER-APL)                          317500      
004440***                               TO R0D1-NCO.                    317600      
004441***  MOVE IMP-CARGOS-TOT(WS-AP-OPER-APL)                          317700      
004442***                               TO R0D1-ICO.                    317800      
004443***  MOVE NUM-ABONOS-TOT(WS-AP-OPER-APL)                          317900      
004444***                               TO R0D1-NAO.                    318000      
004445***  MOVE IMP-ABONOS-TOT(WS-AP-OPER-APL)                          318100      
004446***                               TO R0D1-IAO.                    318200      
004447***  WRITE LREP0 FROM REP0-DET1   BEFORE 2.                       318300      
004448***  ADD 2                        TO WS-CONT-R1-LIN.              318400      
004449*                                                                 318500      
004450*                                                                 318600      
004451/======================                                           318700      
004452 22000-DETECTA-ERRORES.                                           318800      
004453*======================                                           318900      
004454     MOVE ZEROS                   TO WS-MEM-SIZE WS-DISK-SIZE.    319000      
004455     OPEN INPUT  LOG-SORT                                         319100      
004456     MOVE ATTRIBUTE LASTRECORD OF LOG-SORT                        319200      
004457                                  TO WS-ULTREG-LOG-SORT1          319300      
004458       ADD 1                      TO WS-ULTREG-LOG-SORT1          319400      
004459     COMPUTE WS-MEM-SIZE =                                        319500      
004460           ( WS-REGSIZE-LOG-SORT1 + WS-CT1-MSIZE ) * WS-CT2-MSIZE 319600      
004461                                                   + WS-CT3-MSIZE 319700      
004462     COMPUTE WS-DISK-SIZE =                                       319800      
004463           ( WS-REGSIZE-LOG-SORT1 * WS-ULTREG-LOG-SORT1 * 3.5 )   319900      
004464     CLOSE LOG-SORT        WITH SAVE.                             320000      
004465*                                                                 320100      
004466     IF WS-DISK-SIZE = ZEROS                                      320200      
004467        NEXT SENTENCE                                             320300      
004468*       DISPLAY "010302 02  " WS-PROGRAMA,                        320400      
004469*               "SORT1 - NO HAY INFORMACION A ANALIZAR"           320500      
004470     ELSE                                                         320600      
004471        SORT SORT1-DETECTA     ON ASCENDING KEY RS1-LLAVE         320700      
004472             INPUT  PROCEDURE IS 22100-ENVIA-A-SORT1              320800      
004473             OUTPUT PROCEDURE IS 22200-REGRESA-SORT1              320900      
004474                    MEMORY SIZE WS-MEM-SIZE  WORDS                321000      
004475                    DISK   SIZE WS-DISK-SIZE WORDS.               321100      
004476*                                                                 321200      
004477/====================                                             321300      
004478 23000-GENERA-LOGCSI.                                             321400      
004479*====================                                             321500      
004480     MOVE ZEROS                   TO WS-MEM-SIZE WS-DISK-SIZE.    321600      
004481     OPEN INPUT  LOG-SORT                                         321700      
004482     MOVE ATTRIBUTE LASTRECORD OF LOG-SORT                        321800      
004483                                  TO WS-ULTREG-LOG-SORT2          321900      
004484       ADD 1                      TO WS-ULTREG-LOG-SORT2          322000      
004485     COMPUTE WS-MEM-SIZE =                                        322100      
004486           ( WS-REGSIZE-LOG-SORT2 + WS-CT1-MSIZE ) * WS-CT2-MSIZE 322200      
004487                                                   + WS-CT3-MSIZE 322300      
004488     COMPUTE WS-DISK-SIZE =                                       322400      
004489           ( WS-REGSIZE-LOG-SORT2 * WS-ULTREG-LOG-SORT2 * 3.5 )   322500      
004490     CLOSE LOG-SORT        WITH SAVE.                             322600      
004491*                                                                 322700      
004492     IF WS-DISK-SIZE = ZEROS                                      322800      
004493        NEXT SENTENCE                                             322900      
004494*       DISPLAY "010302 02  " WS-PROGRAMA,                        323000      
004495*               " SORT2 - NO HAY INFORMACION A COMPENSAR"         323100      
004496     ELSE                                                         323200      
004497        SORT SORT2-RESUMEN     ON ASCENDING KEY RS2-LLAVE         323300      
004498             INPUT  PROCEDURE IS 23100-ENVIA-A-SORT2              323400      
004499             OUTPUT PROCEDURE IS 23200-REGRESA-SORT2              323500      
004500                    MEMORY SIZE WS-MEM-SIZE  WORDS                323600      
004501                    DISK   SIZE WS-DISK-SIZE WORDS.               323700      
004502*                                                                 323800      
004503/=========================                                        323900      
004504 24000-GENERA-TRANSMISION.                                        324000      
004505*=========================                                        324100      
004506     MOVE ZEROS                   TO WS-MEM-SIZE WS-DISK-SIZE.    324200      
004507     OPEN INPUT  LOG-TRANSMISION                                  324300      
004508     MOVE ATTRIBUTE LASTRECORD OF LOG-TRANSMISION                 324400      
004509                                  TO WS-ULTREG-LOG-SORT3          324500      
004510       ADD 1                      TO WS-ULTREG-LOG-SORT3          324600      
004511     COMPUTE WS-MEM-SIZE =                                        324700      
004512           ( WS-REGSIZE-LOG-SORT3 + WS-CT1-MSIZE ) * WS-CT2-MSIZE 324800      
004513                                                   + WS-CT3-MSIZE 324900      
004514     COMPUTE WS-DISK-SIZE =                                       325000      
004515           ( WS-REGSIZE-LOG-SORT3 * WS-ULTREG-LOG-SORT3 * 3.5 )   325100      
004516     CLOSE LOG-TRANSMISION WITH SAVE.                             325200      
004517*                                                                 325300      
004518     IF WS-DISK-SIZE = ZEROS                                      325400      
004519        NEXT SENTENCE                                             325500      
004520*       DISPLAY "010302 02  " WS-PROGRAMA,                        325600      
004521*               " SORT3 - NO HAY INFORMACION ERRONEA"             325700      
004522     ELSE                                                         325800      
004523        SORT SORT3-TRANSMISION ON ASCENDING KEY RS3-LLAVE         325900      
004524             INPUT  PROCEDURE IS 24100-ENVIA-A-SORT3              326000      
004525             OUTPUT PROCEDURE IS 24200-REGRESA-SORT3              326100      
004526                    MEMORY SIZE WS-MEM-SIZE  WORDS                326200      
004527                    DISK   SIZE WS-DISK-SIZE WORDS.               326300      
004528*                                                                 326400      
004529/=========================                                        326500      
004530*ASM 25000-IMPRIME-PENDIENTES.                                    326600      
004531*=========================                                        326700      
004532*ASM MOVE ZEROS                   TO WS-MEM-SIZE WS-DISK-SIZE.    326800      
004533*ASM OPEN INPUT  PENDIENTES                                       326900      
004534*ASM MOVE ATTRIBUTE LASTRECORD OF PENDIENTES                      327000      
004535*ASM                              TO WS-ULTREG-LOG-SORT4          327100      
004536*ASM   ADD 1                      TO WS-ULTREG-LOG-SORT4          327200      
004537*ASM COMPUTE WS-MEM-SIZE =                                        327300      
004538*ASM       ( WS-REGSIZE-LOG-SORT4 + WS-CT1-MSIZE ) * WS-CT2-MSIZE 327400      
004539*ASM                                               + WS-CT3-MSIZE 327500      
004540*ASM COMPUTE WS-DISK-SIZE =                                       327600      
004541*ASM       ( WS-REGSIZE-LOG-SORT4 * WS-ULTREG-LOG-SORT4 * 3.5 )   327700      
004542*ASM CLOSE PENDIENTES      WITH SAVE.                             327800      
004543*                                                                 327900      
004544*ASM IF WS-DISK-SIZE = ZEROS                                      328000      
004545*ASM    NEXT SENTENCE                                             328100      
004546*       DISPLAY "010302 02  " WS-PROGRAMA,                        328200      
004547*               " SORT4 - NO HAY INFORMACION PENDIENTE"           328300      
004548*ASM ELSE                                                         328400      
004549*ASM    SORT SORT4-PENDIENTES  ON ASCENDING KEY RS4-LLAVE         328500      
004550*ASM         INPUT  PROCEDURE IS 25100-ENVIA-A-SORT4              328600      
004551*ASM         OUTPUT PROCEDURE IS 25200-REGRESA-SORT4              328700      
004552*ASM                MEMORY SIZE WS-MEM-SIZE  WORDS                328800      
004553*ASM                DISK   SIZE WS-DISK-SIZE WORDS.               328900      
004554*                                                                 329000      
004555/======================                                           329100      
004556 26000-IMPRIME-ERRORES.                                           329200      
004557*======================                                           329300      
004558     MOVE ZEROS                   TO WS-MEM-SIZE WS-DISK-SIZE.    329400      
004559     OPEN INPUT  LOG-ERROR                                        329500      
004560     MOVE ATTRIBUTE LASTRECORD OF LOG-ERROR                       329600      
004561                                  TO WS-ULTREG-LOG-SORT5          329700      
004562       ADD 1                      TO WS-ULTREG-LOG-SORT5          329800      
004563     COMPUTE WS-MEM-SIZE =                                        329900      
004564           ( WS-REGSIZE-LOG-SORT5 + WS-CT1-MSIZE ) * WS-CT2-MSIZE 330000      
004565                                                   + WS-CT3-MSIZE 330100      
004566     COMPUTE WS-DISK-SIZE =                                       330200      
004567           ( WS-REGSIZE-LOG-SORT5 * WS-ULTREG-LOG-SORT5 * 3.5 )   330300      
004568     CLOSE LOG-ERROR       WITH SAVE.                             330400      
004569*                                                                 330500      
004570     IF WS-DISK-SIZE = ZEROS                                      330600      
004571        NEXT SENTENCE                                             330700      
004572*       DISPLAY "010302 02  " WS-PROGRAMA,                        330800      
004573*               " SORT5 - NO HAY INFORMACION ERRONEA"             330900      
004574     ELSE                                                         331000      
004575        SORT SORT5-ERRORES     ON ASCENDING KEY RS5-LLAVE         331100      
004576             INPUT  PROCEDURE IS 26100-ENVIA-A-SORT5              331200      
004577             OUTPUT PROCEDURE IS 26200-REGRESA-SORT5              331300      
004578                    MEMORY SIZE WS-MEM-SIZE  WORDS                331400      
004579                    DISK   SIZE WS-DISK-SIZE WORDS.               331500      
004580*                                                                 331600      
004581*================                                                 331700      
004582 29000-BUSCA-SIST.                                                331800      
004583*================                                                 331900      
004584*ASM  MOVE ZEROS                  TO LLAVE-SISTEMAS.              332000      
004585*ASM  MOVE WS-APL-ORI-PTE         TO RG-APL.                      332100      
004586*ASM  MOVE ZEROS                  TO WS-ENCONTRE-SIST.            332200      
004587*ASM  READ SISTEMAS             INTO WS-REG-GUARDIAN              332300      
004588*ASM   INVALID KEY       MOVE 1   TO WS-ENCONTRE-SIST.            332400      
004589*                                                                 332500      
004590*ASM  MOVE SPACES                 TO WS-SISTEMA-LG.               332600      
004591*ASM  MOVE SPACES                 TO WS-SISTEMA-CR.               332700      
004592*ASM  IF ENCONTRE-SIST                                            332800      
004593         MOVE WKS-NUMCSI          TO WS-SIS-SIGLAS                332900      
004594         MOVE NI-CSI-ORI          TO WS-SISTEMA-LG                333000      
004595         MOVE NI-CSI-ORI          TO WS-SISTEMA-CR.               333100      
004596*                                                                 333200      
004597/=====================                                            333300      
004598 30000-TERMINA-PROCESO.                                           333400      
004599*=====================                                            333500      
004600***  CLOSE REPORTE0.                                              333600      
004601***  CLOSE REPORTE1.                                              333700      
004602***  CLOSE REPORTE2.                                              333800      
004603***  CLOSE REPORTE3.                                              333900      
004604***  CLOSE REPORTE4.                                              334000      
004605***  CLOSE REPORTE5.                                              334100      
004606***  CLOSE REPORTE6.                                              334200      
004607***  CLOSE REPORTE7.                                              334300      
004608*ASM CLOSE SISTEMAS        WITH LOCK.                             334400      
004609*ASM DISPLAY "020201 01  " WS-PROGRAMA, " "                       334500      
004610*ASM         "FIN NORMAL DEL PROCESO ".                           334600      
004611     MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ        334610      
004612     MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ          334620      
004613     MOVE 020201                 TO CODIGO-LJ                     334630      
004614     MOVE "FIN NORMAL DEL PROCESO"                                334640      
004615                                 TO WLI-TEXTO-LJ, TEXTO-LJ        334650      
004616     PERFORM      000-030-IMPRIME-MENSAJE.                        334660      
004617*                                                                 334700      
004618/=========================================                        334800      
004619 22100-ENVIA-A-SORT1              SECTION.                        334900      
004620 22100-CONTROL.                                                   335000      
004621*=========================================                        335100      
004622     OPEN INPUT  LOG-SORT.                                        335200      
004623     MOVE ZEROS                   TO WS-FIN-LOG-SORT1.            335300      
004624     PERFORM 22120-LEE-LOG-SORT1.                                 335400      
004625     PERFORM 22110-ENVIA-LOG-SORT1 UNTIL FIN-LOG-SORT1.           335500      
004626     MOVE ZEROS                   TO WS-FIN-LOG-SORT1.            335600      
004627*ASM PERFORM 22140-LEE-PENDIENTES.                                335700      
004628*ASM PERFORM 22130-ENVIA-PEN-SORT1 UNTIL FIN-LOG-SORT1.           335800      
004629     CLOSE LOG-SORT        WITH PURGE.                            335900      
004630*ASM CLOSE PENDIENTES      WITH PURGE.                            336000      
004631     GO TO 22190-EXIT-SECTION.                                    336100      
004632*                                                                 336200      
004633*======================                                           336300      
004634 22110-ENVIA-LOG-SORT1.                                           336400      
004635*======================                                           336500      
004636     PERFORM 22150-MUEVE-A-SORT.                                  336600      
004637     IF WS-RDI-FEC-CON NOT = WS-FECHA-INV-PROC                    336700      
004638        MOVE SPACES               TO WS-RS1-N-AUTOR.              336800      
004639     RELEASE REG-SORT1          FROM WS-REG-SORT1.                336900      
004640     PERFORM 22120-LEE-LOG-SORT1.                                 337000      
004641*                                                                 337100      
004642*===================                                              337200      
004643 22120-LEE-LOG-SORT1.                                             337300      
004644*===================                                              337400      
004645     READ LOG-SORT              INTO WS-REG-DET-INFOICA           337500      
004646      AT END                                                      337600      
004647          MOVE 1                  TO WS-FIN-LOG-SORT1.            337700      
004648*                                                                 337800      
004649*======================                                           337900      
004650*ASM 22130-ENVIA-PEN-SORT1.                                       338000      
004651*======================                                           338100      
004652*ASM IF WS-RDI-FEC-CON > WS-FECMAX-ANTIGUEDAD                     338200      
004653*ASM    PERFORM 22150-MUEVE-A-SORT                                338300      
004654*ASM    MOVE SPACES               TO WS-RS1-N-AUTOR               338400      
004655*ASM    RELEASE REG-SORT1       FROM WS-REG-SORT1                 338500      
004656*ASM ELSE                                                         338600      
004657*ASM    MOVE "ELIM/PEN/ANT"       TO RE-TIPO-ERROR                338700      
004658*ASM    PERFORM 22160-GRABA-ARCH-ERRORES.                         338800      
004659*ASM PERFORM 22140-LEE-PENDIENTES.                                338900      
004660*                                                                 339000      
004661*====================                                             339100      
004662*ASM 22140-LEE-PENDIENTES.                                        339200      
004663*====================                                             339300      
004664*ASM READ PENDIENTES            INTO WS-REG-DET-INFOICA           339400      
004665*ASM  AT END                                                      339500      
004666*ASM      MOVE 1                  TO WS-FIN-LOG-SORT1.            339600      
004667*                                                                 339700      
004668/===================                                              339800      
004669 22150-MUEVE-A-SORT.                                              339900      
004670*===================                                              340000      
004671     MOVE LOW-VALUES              TO REG-SORT1.                   340100      
004672     MOVE WS-RDI-MON-TRN          TO WS-RS1-CVE-MON.              340200      
004673     MOVE WS-RDI-CSI-ORI          TO WS-RS1-CSI-ORI.              340300      
004674     MOVE WS-RDI-APL-ORI          TO WS-RS1-APL-ORI.              340400      
004675     MOVE WS-RDI-CSI-DES          TO WS-RS1-CSI-DES.              340500      
004676     MOVE WS-RDI-APL-DES          TO WS-RS1-APL-DES.              340600      
004677     MOVE WS-RDI-NOM-EST          TO WS-RS1-STA-NAME.             340700      
004678     MOVE WS-RDI-CVE-AUT          TO WS-RS1-N-AUTOR.              340800      
004679     MOVE WS-RDI-COD-SER          TO WS-RS1-TIPO-MOV.             340900      
004680     MOVE WS-RDI-CTA-DES          TO WS-RS1-ID-CTA.               341000      
004681     MOVE WS-RDI-IMP-TRN          TO WS-RS1-IMP-MOV.              341100      
004682     MOVE WS-RDI-STA-TRN          TO WS-RS1-STATUS.               341200      
004683     MOVE WS-RDI-HOR-GEN          TO WS-RS1-HORA-GEN.             341300      
004684     MOVE WS-REG-DET-INFOICA      TO WS-RS1-RESTO.                341400      
004685*                                                                 341500      
004686*==========================                                       341600      
004687 22160-GRABA-ARCH-ERRORES.                                        341700      
004688*==========================                                       341800      
004689     WRITE REG-ERRORES                                            341900      
004690      INVALID KEY                                                 342000      
004691*ASM       DISPLAY "010105 02  " WS-PROGRAMA,                     342100      
004692*ASM               " ESP. INSUF. GRABAR LOG-ERROR(2)"             342200      
004693           MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ  342210      
004694           MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ    342220      
004695           MOVE 010105                 TO CODIGO-LJ               342230      
004696           MOVE "ESPACIO INSUF. AL GRABAR LOG-ERROR(2)"           342240      
004697                                       TO WLI-TEXTO-LJ, TEXTO-LJ  342250      
004698           PERFORM      000-030-IMPRIME-MENSAJE                   342260      
004699           SET MYSELF(STATUS)     TO -1.                          342300      
004700*                                                                 342400      
004701*=========================                                        342500      
004702 22190-EXIT-SECTION. EXIT.                                        342600      
004703*=========================                                        342700      
004704/=========================================                        342800      
004705 22200-REGRESA-SORT1              SECTION.                        342900      
004706 22200-CONTROL.                                                   343000      
004707*=========================================                        343100      
004708     MOVE ZEROS                   TO WS-FIN-LOG-SORT1.            343200      
004709     OPEN OUTPUT LOG-SORT.                                        343300      
004710*ASM OPEN OUTPUT PENDIENTES.                                      343400      
004711*ASM PERFORM 22205-REG-CTL-PENDIENTES.                            343500      
004712     PERFORM 22225-LEE-SORT1.                                     343600      
004713     PERFORM 22210-PROCESA-SORT1  UNTIL FIN-LOG-SORT1.            343700      
004714*ASM CLOSE PENDIENTES      WITH SAVE.                             343800      
004715     CLOSE LOG-SORT        WITH SAVE.                             343900      
004716     CLOSE LOG-ERROR       WITH SAVE.                             344000      
004717     CLOSE LOG-TRANSMISION WITH SAVE.                             344100      
004718     GO TO 22290-EXIT-SECTION.                                    344200      
004719*                                                                 344300      
004720*========================                                         344400      
004721*ASM 22205-REG-CTL-PENDIENTES.                                    344500      
004722*========================                                         344600      
004723*                                                                 344700      
004724*ASM WRITE REG-PENDIENTES       FROM WS-REG-CTL-PENDIENTES        344800      
004725*ASM  INVALID KEY                                                 344900      
004726*ASM       DISPLAY "010105 02  " WS-PROGRAMA,                     345000      
004727*ASM               "ESP. INSUF. REG. CTL. PENDIENTES"             345100      
004728*ASM       MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ  345110      
004729*ASM       MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ    345120      
004730*ASM       MOVE 010105                 TO CODIGO-LJ               345130      
004731*ASM       MOVE "ESPACIO INSUF. EN REG DE CTRL PENDIENTES"        345140      
004732*ASM                                   TO WLI-TEXTO-LJ, TEXTO-LJ  345150      
004733*ASM       PERFORM      000-030-IMPRIME-MENSAJE                   345160      
004734*ASM       SET MYSELF(STATUS)     TO -1.                          345200      
004735*                                                                 345300      
004736*====================                                             345400      
004737 22210-PROCESA-SORT1.                                             345500      
004738*====================                                             345600      
004739     MOVE SPACES                  TO WS-TABLA-VERIF-MSG.          345700      
004740     MOVE SPACES                  TO WS-TABLA-VERIF-PEND.         345800      
004741     MOVE ZEROS                   TO IND-TAB.                     345900      
004742     MOVE ZEROS                   TO IND-PEN.                     346000      
004743     MOVE WS-RDI-CVE-AUT          TO WS-N-AUTOR-ANT.              346100      
004744     PERFORM 22220-CARGA-TABLA-LOGS UNTIL                         346200      
004745             WS-RDI-CVE-AUT         NOT = WS-N-AUTOR-ANT          346300      
004746                                    OR    FIN-LOG-SORT1.          346400      
004747*    IF IND-TAB > 1                                               346500      
004748*       PERFORM 22230-ANULADOS      VARYING IND-1 FROM 1 BY 1     346600      
004749*                                   UNTIL   IND-1 > IND-TAB.      346700      
004750*                                                                 346800      
004751*    IF IND-TAB > 1                                               346900      
004752        PERFORM 22240-DIALOGO       VARYING IND-1 FROM 1 BY 1     347000      
004753                                    UNTIL   IND-1 > IND-TAB.      347100      
004754*    IF IND-PEN > 1                                               347200      
004755*ASM    PERFORM 22245-PENDIENTES    VARYING IND-1 FROM 1 BY 1     347300      
004756*ASM                                UNTIL   IND-1 > IND-PEN.      347400      
004757*                                                                 347500      
004758*    IF IND-TAB > 1                                               347600      
004759        PERFORM 22250-GRABA-ERRORES VARYING IND-1 FROM 1 BY 1     347700      
004760                                    UNTIL   IND-1 > IND-TAB.      347800      
004761*    IF IND-PEN > 1                                               347900      
004762*ASM    PERFORM 22255-GRABA-PEND    VARYING IND-1 FROM 1 BY 1     348000      
004763*ASM                                UNTIL   IND-1 > IND-PEN.      348100      
004764*                                                                 348200      
004765/=======================                                          348300      
004766 22220-CARGA-TABLA-LOGS.                                          348400      
004767*=======================                                          348500      
004768     IF WS-REG-DET-INFOICA = WS-REG-DET-INFOICA-ANT               348600      
004769        MOVE WS-REG-DET-INFOICA   TO RE-REG-ERROR                 348700      
004770        MOVE "...DUPLICADO"       TO RE-TIPO-ERROR                348800      
004771        PERFORM 22270-GRABA-ARCH-ERRORES.                         348900      
004772*                                                                 349000      
004773     IF WS-RDI-FEC-CON = WS-FECHA-INV-PROC                        349100      
004774        IF IND-TAB-VAL                                            349200      
004775           ADD  1                  TO IND-TAB                     349300      
004776           MOVE WS-REG-DET-INFOICA TO WS-TVM-REG(IND-TAB)         349400      
004777        ELSE                                                      349500      
004778        IF RDI-STA-TRN-OPERADO     OR RDI-STA-TRN-APLICADO        349600      
004779        OR RDI-STA-TRN-PENDIENTE                                  349700      
004780           MOVE WS-REG-DET-INFOICA TO WS-REG-PENDIENTES           349800      
004781           IF RDI-STA-TRN-OPERADO  OR RDI-STA-TRN-APLICADO        349900      
004782              PERFORM 22260-GRABA-LOG-SORT2                       350000      
004783           ELSE                                                   350100      
004784              PERFORM 22275-GRABA-PENDIENTES                      350200      
004785*ASM          NEXT SENTENCE                                       350250      
004786        ELSE                                                      350300      
004787           MOVE WS-REG-DET-INFOICA TO RE-REG-ERROR                350400      
004788           MOVE "STA/INVALIDO"     TO RE-TIPO-ERROR               350500      
004789           PERFORM 22270-GRABA-ARCH-ERRORES                       350600      
004790     ELSE                                                         350700      
004791*    ... PARA CONCILIAR OPERADOS/PENDIENTES                       350800      
004792     IF RDI-STA-TRN-OPERADO       OR RDI-STA-TRN-PENDIENTE        350900      
004793        IF IND-PEN-VAL                                            351000      
004794           ADD  1                  TO IND-PEN                     351100      
004795           MOVE WS-REG-DET-INFOICA TO WS-TVP-REG(IND-PEN)         351200      
004796        ELSE                                                      351300      
004797           MOVE WS-REG-DET-INFOICA TO WS-REG-PENDIENTES           351400      
004798           IF RDI-STA-TRN-OPERADO                                 351500      
004799              PERFORM 22260-GRABA-LOG-SORT2                       351600      
004800           ELSE                                                   351700      
004801*ASM       IF WS-RDI-FEC-CON > WS-FECMAX-ANTIGUEDAD               351800      
004802              PERFORM 22275-GRABA-PENDIENTES                      351900      
004803*ASM          NEXT SENTENCE                                       351950      
004804*ASM       ELSE                                                   352000      
004805*ASM          MOVE WS-REG-DET-INFOICA TO RE-REG-ERROR             352100      
004806*ASM          MOVE "PEND/ANTIGUA"     TO RE-TIPO-ERROR            352200      
004807*ASM          PERFORM 22270-GRABA-ARCH-ERRORES                    352300      
004808     ELSE                                                         352400      
004809        MOVE WS-REG-DET-INFOICA   TO RE-REG-ERROR                 352500      
004810        MOVE "STA/FEC/INV."       TO RE-TIPO-ERROR                352600      
004811        PERFORM 22270-GRABA-ARCH-ERRORES.                         352700      
004812*                                                                 352800      
004813     MOVE WS-REG-DET-INFOICA      TO WS-REG-DET-INFOICA-ANT.      352900      
004814     PERFORM 22225-LEE-SORT1.                                     353000      
004815*                                                                 353100      
004816/================                                                 353200      
004817 22225-LEE-SORT1.                                                 353300      
004818*================                                                 353400      
004819     RETURN SORT1-DETECTA       INTO WS-REG-SORT1                 353500      
004820      AT END                                                      353600      
004821         MOVE 1                   TO WS-FIN-LOG-SORT1.            353700      
004822*                                                                 353800      
004823     IF NOT FIN-LOG-SORT1                                         353900      
004824        MOVE WS-RS1-RESTO         TO WS-REG-DET-INFOICA.          354000      
004825*                                                                 354100      
004826*===============                                                  354200      
004827 22230-ANULADOS.                                                  354300      
004828*===============                                                  354400      
004829     PERFORM 22231-COMPARA-REGS-LOGS                              354500      
004830                            VARYING IND-2 FROM (IND-1 + 1)  BY 1  354600      
004831                            UNTIL   IND-2  >    IND-TAB.          354700      
004832*                                                                 354800      
004833*=======================                                          354900      
004834 22231-COMPARA-REGS-LOGS.                                         355000      
004835*=======================                                          355100      
004836     IF WS-TVM-REG           (IND-1) NOT = SPACES                 355200      
004837        IF WS-TVM-REG        (IND-2) NOT = SPACES                 355300      
004838           IF ( TVM-ENVIADO  (IND-1) AND TVM-ENVIADO  (IND-2)  OR 355400      
004839                TVM-APLICADO (IND-1) AND TVM-APLICADO (IND-2)  OR 355500      
004840                TVM-OPERADO  (IND-1) AND TVM-OPERADO  (IND-2)  OR 355600      
004841                TVM-DENEGADO (IND-1) AND TVM-DENEGADO (IND-2)  OR 355700      
004842                TVM-PENDIENTE(IND-1) AND TVM-PENDIENTE(IND-2)) AND355800      
004843             WS-TVM-IMPORTE  (IND-1) = WS-TVM-IMPORTE (IND-2)  AND355900      
004844             WS-TVM-ID-CTA   (IND-1) = WS-TVM-ID-CTA  (IND-2)  AND356000      
004845              ( TVM-CARGO    (IND-1) AND TVM-ANUCARGO (IND-2)  OR 356100      
004846                TVM-ABONO    (IND-1) AND TVM-ANUABONO (IND-2)  OR 356200      
004847                TVM-ANUCARGO (IND-1) AND TVM-CARGO    (IND-2)  OR 356300      
004848                TVM-ANUABONO (IND-1) AND TVM-ABONO    (IND-2))    356400      
004849              PERFORM 22232-CANCELA.                              356500      
004850*                                                                 356600      
004851*==============                                                   356700      
004852 22232-CANCELA.                                                   356800      
004853*==============                                                   356900      
004854     MOVE "ANULADO"               TO RE-TIPO-ERROR.               357000      
004855     MOVE WS-TVM-REG(IND-1)       TO RE-REG-ERROR.                357100      
004856     PERFORM 22270-GRABA-ARCH-ERRORES.                            357200      
004857     MOVE WS-TVM-REG(IND-2)       TO RE-REG-ERROR.                357300      
004858     PERFORM 22270-GRABA-ARCH-ERRORES.                            357400      
004859     MOVE SPACES                  TO WS-TVM-REG(IND-1).           357500      
004860     MOVE SPACES                  TO WS-TVM-REG(IND-2).           357600      
004861*                                                                 357700      
004862/==============                                                   357800      
004863 22240-DIALOGO.                                                   357900      
004864*==============                                                   358000      
004865     PERFORM 22241-COMPARA-REGS-LOGS                              358100      
004866                            VARYING IND-2 FROM (IND-1 + 1)  BY 1  358200      
004867                            UNTIL   IND-2  >    IND-TAB.          358300      
004868*                                                                 358400      
004869*========================                                         358500      
004870 22241-COMPARA-REGS-LOGS.                                         358600      
004871*========================                                         358700      
004872     IF WS-TVM-REG           (IND-1) NOT = SPACES                 358800      
004873        IF WS-TVM-REG        (IND-2) NOT = SPACES                 358900      
004874           IF ( TVM-ENVIADO  (IND-1) AND TVM-OPERADO  (IND-2)  OR 359000      
004875                TVM-ENVIADO  (IND-1) AND TVM-DENEGADO (IND-2)  OR 359100      
004876                TVM-ENVIADO  (IND-1) AND TVM-PENDIENTE(IND-2)  OR 359200      
004877                TVM-APLICADO (IND-1) AND TVM-DENEGADO (IND-2)  OR 359300      
004878                TVM-DENEGADO (IND-1) AND TVM-APLICADO (IND-2)  OR 359400      
004879                TVM-OPERADO  (IND-1) AND TVM-ENVIADO  (IND-2)  OR 359500      
004880                TVM-DENEGADO (IND-1) AND TVM-ENVIADO  (IND-2)  OR 359600      
004881                TVM-PENDIENTE(IND-1) AND TVM-ENVIADO  (IND-2)) AND359700      
004882             WS-TVM-IMPORTE  (IND-1) = WS-TVM-IMPORTE (IND-2)  AND359800      
004883             WS-TVM-ID-CTA   (IND-1) = WS-TVM-ID-CTA  (IND-2)  AND359900      
004884              ( TVM-CARGO    (IND-1) AND TVM-CARGO    (IND-2)  OR 360000      
004885                TVM-ABONO    (IND-1) AND TVM-ABONO    (IND-2)  OR 360100      
004886                TVM-ANUCARGO (IND-1) AND TVM-ANUCARGO (IND-2)  OR 360200      
004887                TVM-ANUABONO (IND-1) AND TVM-ANUABONO (IND-2))    360300      
004888              PERFORM 22242-CANCELA.                              360400      
004889*                                                                 360500      
004890*==============                                                   360600      
004891 22242-CANCELA.                                                   360700      
004892*==============                                                   360800      
004893     MOVE WS-TVM-REG    (IND-1)   TO WS-REG-PENDIENTES.           360900      
004894     IF TVM-OPERADO     (IND-1)                                   361000      
004895        PERFORM 22260-GRABA-LOG-SORT2                             361100      
004896     ELSE                                                         361200      
004897     IF TVM-PENDIENTE   (IND-1)                                   361300      
004898        PERFORM 22275-GRABA-PENDIENTES.                           361400      
004899*ASM    NEXT SENTENCE.                                            361450      
004900*                                                                 361500      
004901     MOVE WS-TVM-REG    (IND-2)   TO WS-REG-PENDIENTES.           361600      
004902     IF TVM-OPERADO     (IND-2)                                   361700      
004903        PERFORM 22260-GRABA-LOG-SORT2                             361800      
004904     ELSE                                                         361900      
004905     IF TVM-PENDIENTE   (IND-2)                                   362000      
004906        PERFORM 22275-GRABA-PENDIENTES.                           362100      
004907*ASM    NEXT SENTENCE.                                            362150      
004908*                                                                 362200      
004909     MOVE SPACES                  TO WS-TVM-REG   (IND-1).        362300      
004910     MOVE SPACES                  TO WS-TVM-REG   (IND-2).        362400      
004911*                                                                 362500      
004912/==============                                                   362600      
004913 22245-PENDIENTES.                                                362700      
004914*=================                                                362800      
004915     PERFORM 22246-COMPARA-REGS-LOGS                              362900      
004916                            VARYING IND-2 FROM (IND-1 + 1)  BY 1  363000      
004917                            UNTIL   IND-2  >    IND-PEN.          363100      
004918*                                                                 363200      
004919*========================                                         363300      
004920 22246-COMPARA-REGS-LOGS.                                         363400      
004921*========================                                         363500      
004922     IF WS-TVP-REG           (IND-1) NOT = SPACES                 363600      
004923        IF WS-TVP-REG        (IND-2) NOT = SPACES                 363700      
004924           IF ( TVP-OPERADO  (IND-1) AND TVP-PENDIENTE(IND-2)  OR 363800      
004925                TVP-PENDIENTE(IND-1) AND TVP-OPERADO  (IND-2)) AND363900      
004926             WS-TVP-IMPORTE  (IND-1) = WS-TVP-IMPORTE (IND-2)  AND364000      
004927             WS-TVP-ID-CTA   (IND-1) = WS-TVP-ID-CTA  (IND-2)  AND364100      
004928             WS-TVP-FECHA    (IND-1) = WS-TVP-FECHA   (IND-2)  AND364200      
004929              ( TVP-CARGO    (IND-1) AND TVP-CARGO    (IND-2)  OR 364300      
004930                TVP-ABONO    (IND-1) AND TVP-ABONO    (IND-2)  OR 364400      
004931                TVP-ANUCARGO (IND-1) AND TVP-ANUCARGO (IND-2)  OR 364500      
004932                TVP-ANUABONO (IND-1) AND TVP-ANUABONO (IND-2))    364600      
004933              PERFORM 22247-CANCELA.                              364700      
004934*                                                                 364800      
004935*==============                                                   364900      
004936 22247-CANCELA.                                                   365000      
004937*==============                                                   365100      
004938     IF TVP-OPERADO     (IND-1)                                   365200      
004939        MOVE WS-TVP-REG (IND-1)   TO WS-REG-PENDIENTES            365300      
004940     ELSE                                                         365400      
004941     IF TVP-OPERADO     (IND-2)                                   365500      
004942        MOVE WS-TVP-REG (IND-2)   TO WS-REG-PENDIENTES.           365600      
004943*                                                                 365700      
004944     IF TVP-OPERADO     (IND-1)   OR TVP-OPERADO(IND-2)           365800      
004945        PERFORM 22260-GRABA-LOG-SORT2.                            365900      
004946*                                                                 366000      
004947     MOVE SPACES                  TO WS-TVP-REG (IND-1).          366100      
004948     MOVE SPACES                  TO WS-TVP-REG (IND-2).          366200      
004949*                                                                 366300      
004950*====================                                             366400      
004951 22250-GRABA-ERRORES.                                             366500      
004952*====================                                             366600      
004953     IF WS-TVM-REG        (IND-1) NOT = SPACES                    366700      
004954        IF TVM-OPERADO    (IND-1) OR TVM-APLICADO(IND-1)  OR      366800      
004955           TVM-PENDIENTE  (IND-1)                                 366900      
004956           MOVE WS-TVM-REG(IND-1) TO WS-REG-PENDIENTES            367000      
004957           IF TVM-OPERADO (IND-1) OR TVM-APLICADO(IND-1)          367100      
004958              PERFORM 22260-GRABA-LOG-SORT2                       367200      
004959           ELSE                                                   367300      
004960              PERFORM 22275-GRABA-PENDIENTES                      367400      
004961*ASM          NEXT SENTENCE                                       367450      
004962        ELSE                                                      367500      
004963           MOVE "SIN/PAREJA  "    TO RE-TIPO-ERROR                367600      
004964           MOVE WS-TVM-REG(IND-1) TO RE-REG-ERROR                 367700      
004965           PERFORM 22270-GRABA-ARCH-ERRORES.                      367800      
004966*                                                                 367900      
004967/=================                                                368000      
004968 22255-GRABA-PEND.                                                368100      
004969*=================                                                368200      
004970     IF WS-TVP-REG        (IND-1) NOT = SPACES                    368300      
004971        IF TVP-OPERADO    (IND-1) OR TVP-PENDIENTE(IND-1)         368400      
004972           MOVE WS-TVP-REG(IND-1) TO WS-REG-PENDIENTES            368500      
004973           IF TVP-OPERADO (IND-1)                                 368600      
004974              MOVE "OPER/S/PEND."    TO RE-TIPO-ERROR             368700      
004975              MOVE WS-TVP-REG(IND-1) TO RE-REG-ERROR              368800      
004976              PERFORM 22270-GRABA-ARCH-ERRORES                    368900      
004977           ELSE                                                   369000      
004978*ASM       IF WS-TVP-FECHA(IND-1) > WS-FECMAX-ANTIGUEDAD          369100      
004979              PERFORM 22275-GRABA-PENDIENTES                      369200      
004980*ASM          NEXT SENTENCE                                       369250      
004981*ASM       ELSE                                                   369300      
004982*ASM          MOVE "PEND/ANTIGUA"    TO RE-TIPO-ERROR             369400      
004983*ASM          MOVE WS-TVP-REG(IND-1) TO RE-REG-ERROR              369500      
004984*ASM          PERFORM 22270-GRABA-ARCH-ERRORES                    369600      
004985        ELSE                                                      369700      
004986           MOVE "EXTEMPORANEO"    TO RE-TIPO-ERROR                369800      
004987           MOVE WS-TVP-REG(IND-1) TO RE-REG-ERROR                 369900      
004988           PERFORM 22270-GRABA-ARCH-ERRORES.                      370000      
004989*                                                                 370100      
004990*======================                                           370200      
004991 22260-GRABA-LOG-SORT2.                                           370300      
004992*======================                                           370400      
004993     WRITE REG-LOG-SORT         FROM WS-REG-PENDIENTES            370500      
004994      INVALID KEY                                                 370600      
004995*ASM     DISPLAY "010105 02  " WS-PROGRAMA,                       370700      
004996*ASM             "ESP. INSUF. LOG-SORT  (2) "                     370800      
004997         MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ    370810      
004998         MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ      370820      
004999         MOVE 010105                 TO CODIGO-LJ                 370830      
005000         MOVE "ESPACIO INSUF. EN LOG-SORT"                        370840      
005001                                     TO WLI-TEXTO-LJ, TEXTO-LJ    370850      
005002         PERFORM      000-030-IMPRIME-MENSAJE                     370860      
005003         SET MYSELF(STATUS)       TO -1.                          370900      
005004*                                                                 371000      
005005     PERFORM 22280-GRABA-TRANSMISION.                             371100      
005006*                                                                 371200      
005007*==========================                                       371300      
005008 22270-GRABA-ARCH-ERRORES.                                        371400      
005009*==========================                                       371500      
005010     WRITE REG-ERRORES                                            371600      
005011      INVALID KEY                                                 371700      
005012*ASM       DISPLAY "010105 02  " WS-PROGRAMA,                     371800      
005013*ASM               " ESP. INSUF. GRABAR LOG-ERROR(2)"             371900      
005014           MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ  371910      
005015           MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ    371920      
005016           MOVE 010105                 TO CODIGO-LJ               371930      
005017           MOVE "ESPACIO INSUF. AL GRABAR LOG-ERROR(2)"           371940      
005018                                       TO WLI-TEXTO-LJ, TEXTO-LJ  371950      
005019           PERFORM      000-030-IMPRIME-MENSAJE                   371960      
005020           SET MYSELF(STATUS)     TO -1.                          372000      
005021*                                                                 372100      
005022*=======================                                          372200      
005023 22275-GRABA-PENDIENTES.                                          372300      
005024*=======================                                          372400      
005025*ASM  WRITE REG-PENDIENTES       FROM WS-REG-PENDIENTES           372500      
005026*ASM  INVALID KEY                                                 372600      
005027*ASM       DISPLAY "010105 02  " WS-PROGRAMA,                     372700      
005028*ASM               "ESP. INSUF. GRABAR PENDIENTES"                372800      
005029*ASM       MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ  372810      
005030*ASM       MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ    372820      
005031*ASM       MOVE 010105                 TO CODIGO-LJ               372830      
005032*ASM       MOVE "ESPACIO INSUF. AL GRABAR PENDIENTES"             372840      
005033*ASM                                   TO WLI-TEXTO-LJ, TEXTO-LJ  372850      
005034*ASM       PERFORM      000-030-IMPRIME-MENSAJE                   372860      
005035*ASM       SET MYSELF(STATUS)     TO -1.                          372900      
005036*                                                                 373000      
005037     PERFORM 22280-GRABA-TRANSMISION.                             373100      
005038*                                                                 373200      
005039/========================                                         373300      
005040 22280-GRABA-TRANSMISION.                                         373400      
005041*========================                                         373500      
005042     MOVE WS-REG-DET-INFOICA      TO WS-REG-DET-INFOICA-TEMP.     373600      
005043     MOVE WS-REG-PENDIENTES       TO WS-REG-DET-INFOICA.          373700      
005044     IF RDI-STA-TRN-OPERADO OR RDI-STA-TRN-PENDIENTE              373800      
005045        PERFORM 22281-ARMA-LOG-TRANSMISION.                       373900      
005046     MOVE WS-REG-DET-INFOICA-TEMP TO WS-REG-DET-INFOICA.          374000      
005047*                                                                 374100      
005048*===========================                                      374200      
005049 22281-ARMA-LOG-TRANSMISION.                                      374300      
005050*===========================                                      374400      
005051*                                                                 374500      
005052     MOVE LOW-VALUES              TO WS-REG-SORT3                 374600      
005053     MOVE WS-RDI-COD-SER          TO WS-RS3-COD-SER.              374700      
005054     MOVE WS-RDI-IMP-TRN          TO WS-RS3-IMP-TRN.              374800      
005055*                                                                 374900      
005056     MOVE 1                       TO WS-RS3-TIPO-REP.             375000      
005057     MOVE WS-RDI-FEC-CON          TO WS-RS3-FEC-CON               375100      
005058     MOVE WS-RDI-APL-ORI          TO WS-RS3-APL-ORI               375200      
005059     IF RDI-STA-TRN-OPERADO                                       375300      
005060        MOVE 2                    TO WS-RS3-AMBITO                375400      
005061     ELSE                                                         375500      
005062        MOVE 3                    TO WS-RS3-AMBITO.               375600      
005063     PERFORM 22285-ESCRIBE-LOG-TRANSMISION.                       375700      
005064*                                                                 375800      
005065     MOVE 2                       TO WS-RS3-TIPO-REP.             375900      
005066     MOVE WS-RDI-NOD-ORI          TO WS-RS3-NOD-ORI               376000      
005067     MOVE WS-RDI-NOM-EST          TO WS-RS3-STA-NAME              376100      
005068     PERFORM 22285-ESCRIBE-LOG-TRANSMISION.                       376200      
005069*                                                                 376300      
005070     MOVE 3                       TO WS-RS3-TIPO-REP.             376400      
005071     MOVE WS-RDI-APL-ORI          TO WS-RS3-SISTEMA               376500      
005072     MOVE WS-RDI-SUC-ORI          TO WS-RS3-SUCURSAL              376600      
005073     MOVE WS-RDI-MON-TRN          TO WS-RS3-MONEDA                376700      
005074     MOVE WS-RDI-NOM-EST          TO WS-RS3-TERMINAL              376800      
005075     IF WS-RDI-FEC-CON = WS-FECHA-INV-PROC                        376900      
005076        PERFORM 22285-ESCRIBE-LOG-TRANSMISION.                    377000      
005077*                                                                 377100      
005078*==============================                                   377200      
005079 22285-ESCRIBE-LOG-TRANSMISION.                                   377300      
005080*==============================                                   377400      
005081     WRITE REG-LOG-TRANSMISION  FROM WS-REG-SORT3                 377500      
005082      INVALID KEY                                                 377600      
005083*ASM          DISPLAY "010105 02  " WS-PROGRAMA,                  377700      
005084*ASM                  " ESP. INSUF. LOG-TRANSMISION"              377800      
005085              MOVE SPACES               TO WLI-TEXTO-LJ, TEXTO-LJ 377810      
005086              MOVE "I"                  TO WLI-TIPO-LJ, TIPO-LJ   377820      
005087              MOVE 020101               TO CODIGO-LJ              377830      
005088              MOVE "ESPACIO INSUF. EN LOG-TRANSMISION"            377840      
005089                                        TO WLI-TEXTO-LJ, TEXTO-LJ 377850      
005090              PERFORM      000-030-IMPRIME-MENSAJE                377860      
005091              SET MYSELF(STATUS)  TO -1.                          377900      
005092*                                                                 378000      
005093*=========================                                        378100      
005094 22290-EXIT-SECTION. EXIT.                                        378200      
005095*=========================                                        378300      
005096*                                                                 378400      
005097/=========================================                        378500      
005098 23100-ENVIA-A-SORT2             SECTION.                         378600      
005099 23100-CONTROL.                                                   378700      
005100*=========================================                        378800      
005101     OPEN INPUT  LOG-SORT.                                        378900      
005102     MOVE ZEROS                   TO  WS-FIN-LOG-SORT2.           379000      
005103     PERFORM 23120-LEE-LOG-SORT2.                                 379100      
005104     PERFORM 23110-ENVIA-LOG-SORT2 UNTIL FIN-LOG-SORT2.           379200      
005105     CLOSE LOG-SORT        WITH PURGE.                            379300      
005106     GO TO 23130-EXIT-SECTION.                                    379400      
005107*                                                                 379500      
005108*=====================                                            379600      
005109 23110-ENVIA-LOG-SORT2.                                           379700      
005110*=====================                                            379800      
005111     MOVE SPACES                  TO REG-SORT2.                   379900      
005112     MOVE WS-RDI-FEC-CON          TO WS-RS2-FECHA.                380000      
005113     MOVE WS-RDI-CSI-ORI          TO WS-RS2-CSI-ORI.              380100      
005114     MOVE WS-RDI-MON-TRN          TO WS-RS2-CVE-MON.              380200      
005115     MOVE WS-RDI-APL-ORI          TO WS-RS2-APL-ORI.              380300      
005116     MOVE WS-RDI-CSI-DES          TO WS-RS2-CSI-DES.              380400      
005117     MOVE WS-REG-DET-INFOICA      TO WS-RS2-RESTO.                380500      
005118     RELEASE REG-SORT2          FROM WS-REG-SORT2.                380600      
005119     PERFORM 23120-LEE-LOG-SORT2.                                 380700      
005120*                                                                 380800      
005121*====================                                             380900      
005122 23120-LEE-LOG-SORT2.                                             381000      
005123*====================                                             381100      
005124     READ LOG-SORT              INTO WS-REG-DET-INFOICA           381200      
005125      AT END                                                      381300      
005126          MOVE 1                  TO WS-FIN-LOG-SORT2.            381400      
005127*                                                                 381500      
005128     IF WS-REG-DET-INFOICA        = LOW-VALUES OR HIGH-VALUES     381600      
005129        MOVE  1                   TO WS-FIN-LOG-SORT2.            381700      
005130*                                                                 381800      
005131*========================                                         381900      
005132 23130-EXIT-SECTION. EXIT.                                        382000      
005133*========================                                         382100      
005134*                                                                 382200      
005135/=========================================                        382300      
005136 23200-REGRESA-SORT2              SECTION.                        382400      
005137 23200-CONTROL.                                                   382500      
005138*=========================================                        382600      
005139*                                                                 382700      
005140     OPEN OUTPUT LOG-CSI.                                         382800      
005141     OPEN I-O    COMPENSACION.                                    382900      
005142     MOVE ZEROS                   TO IND-VACIO                    383000      
005143     MOVE ZEROS                   TO WS-FIN-LOG-SORT2.            383100      
005144     PERFORM 23205-REG-CONTROL-LOGCSI.                            383200      
005145     PERFORM 23230-LEE-SORT2.                                     383300      
005146     IF FIN-LOG-SORT2                                             383400      
005147*ASM    DISPLAY "010302 02  " WS-PROGRAMA,                        383500      
005148*ASM            " NO HAY INFORMACION A COMPENSAR "                383600      
005149        MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ     383610      
005150        MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ       383620      
005151        MOVE 010302                 TO CODIGO-LJ                  383630      
005152        MOVE "NO HAY INFORMACION A COMPENSAR"                     383640      
005153                                    TO WLI-TEXTO-LJ, TEXTO-LJ     383650      
005154        PERFORM      000-030-IMPRIME-MENSAJE                      383660      
005155        MOVE 1                    TO IND-VACIO.                   383700      
005156     MOVE WS-RS2-LLAVE            TO WS-RS2-LLAVE-ANT.            383800      
005157     PERFORM 23270-ACTUALIZA-REG-CTL-CSI.                         383900      
005158     PERFORM 23210-PROCESA-SORT2  UNTIL FIN-LOG-SORT2.            384000      
005159     PERFORM 23205-REG-TRAILER-LOGCSI.                            384100      
005160     CLOSE LOG-CSI         WITH LOCK.                             384200      
005161     CLOSE COMPENSACION    WITH SAVE.                             384300      
005162     IF IND-VACIO = 0                                             384400      
005163        PERFORM 23500-RESUMEN-REP1.                               384500      
005164     GO TO 23900-EXIT-SECTION.                                    384600      
005165*                                                                 384700      
005166*=========================                                        384800      
005167 23205-REG-CONTROL-LOGCSI.                                        384900      
005168*====================                                             385000      
005169     MOVE LOW-VALUES              TO WS-REG-LOG.                  385100      
005170     MOVE "HEADER"                TO WS-RLC-IDENT.                385200      
005171     MOVE PTER-CSI-WS             TO WS-RLC-CSI.                  385300      
005172     MOVE WS-FECHA-INV-PROC       TO WS-RLC-FECONT.               385400      
005173      MOVE "S151"                  TO WS-RLC-CVESIS.              385500      
005174     MOVE WS-DATE                 TO WS-RLC-FECHA.                385600      
005175     MOVE WS-TIMER                TO WS-RLC-HORA.                 385700      
005176     PERFORM 23225-GRABA-LOG-CSI.                                 385800      
005177*                                                                 385900      
005178*=========================                                        386000      
005179 23205-REG-TRAILER-LOGCSI.                                        386100      
005180*=========================                                        386200      
005181     MOVE LOW-VALUES              TO WS-REG-LOG.                  386300      
005182     MOVE "TRAILER"               TO WS-RLT-IDENT.                386400      
005183     MOVE NUM-CARGOS-TOT(1)       TO WS-RLT-NCO.                  386500      
005184     MOVE IMP-CARGOS-TOT(1)       TO WS-RLT-ICO.                  386600      
005185     MOVE NUM-ABONOS-TOT(1)       TO WS-RLT-NAO.                  386700      
005186     MOVE IMP-ABONOS-TOT(1)       TO WS-RLT-IAO.                  386800      
005187     MOVE NUM-CARGOS-TOT(2)       TO WS-RLT-NCA.                  386900      
005188     MOVE IMP-CARGOS-TOT(2)       TO WS-RLT-ICA.                  387000      
005189     MOVE NUM-ABONOS-TOT(2)       TO WS-RLT-NAA.                  387100      
005190     MOVE IMP-ABONOS-TOT(2)       TO WS-RLT-IAA.                  387200      
005191     PERFORM 23225-GRABA-LOG-CSI.                                 387300      
005192*                                                                 387400      
005193/====================                                             387500      
005194 23210-PROCESA-SORT2.                                             387600      
005195*====================                                             387700      
005196     MOVE ZEROS                   TO LLAVE-COMP                   387800      
005197     MOVE WS-RS2-LLAVE            TO WS-RS2-LLAVE-ANT.            387900      
005198     MOVE LOW-VALUES              TO CIFRAS-COMP.                 388000      
005199     PERFORM 23220-SUMARIZA UNTIL FIN-LOG-SORT2                   388100      
005200             OR  WS-RS2-LLAVE NOT = WS-RS2-LLAVE-ANT.             388200      
005201*                                                                 388300      
005202     PERFORM 23250-ACTUALIZA-COMP-NAL.                            388400      
005203*                                                                 388500      
005204*===============                                                  388600      
005205 23220-SUMARIZA.                                                  388700      
005206*===============                                                  388800      
005207     MOVE WS-REG-DET-INFOICA      TO WS-REG-LOG.                  388900      
005208     PERFORM 23225-GRABA-LOG-CSI.                                 389000      
005209     IF RDI-STA-TRN-APLICADO                                      389100      
005210        MOVE 2                    TO WS-AP-OPER-APL               389200      
005211        PERFORM 23240-SUMA-CARGO-ABONO                            389300      
005212     ELSE                                                         389400      
005213     IF RDI-STA-TRN-OPERADO                                       389500      
005214        MOVE 1                    TO WS-AP-OPER-APL               389600      
005215        PERFORM 23240-SUMA-CARGO-ABONO.                           389700      
005216*                                                                 389800      
005217      PERFORM 23230-LEE-SORT2.                                    389900      
005218*                                                                 390000      
005219/====================                                             390100      
005220 23225-GRABA-LOG-CSI.                                             390200      
005221*====================                                             390300      
005222     WRITE REG-LOG-CSI          FROM WS-REG-LOG                   390400      
005223      INVALID KEY                                                 390500      
005224*ASM          DISPLAY "010105 02  " WS-PROGRAMA,                  390600      
005225*ASM                  "ESP. INSUF. LOG-CSI"                       390700      
005226              MOVE SPACES              TO WLI-TEXTO-LJ, TEXTO-LJ  390710      
005227              MOVE "I"                 TO WLI-TIPO-LJ, TIPO-LJ    390720      
005228              MOVE 010105              TO CODIGO-LJ               390730      
005229              MOVE "ESPACIO INSUF. EN LOG-CSI"                    390740      
005230                                       TO WLI-TEXTO-LJ, TEXTO-LJ  390750      
005231              PERFORM      000-030-IMPRIME-MENSAJE                390760      
005232              SET MYSELF(STATUS)  TO -1.                          390800      
005233*                                                                 390900      
005234*================                                                 391000      
005235 23230-LEE-SORT2.                                                 391100      
005236*================                                                 391200      
005237     RETURN SORT2-RESUMEN       INTO WS-REG-SORT2                 391300      
005238      AT END                                                      391400      
005239         MOVE  1                  TO WS-FIN-LOG-SORT2.            391500      
005240*                                                                 391600      
005241     IF NOT FIN-LOG-SORT2                                         391700      
005242        MOVE WS-RS2-RESTO         TO WS-REG-DET-INFOICA.          391800      
005243*                                                                 391900      
005244*=======================                                          392000      
005245 23240-SUMA-CARGO-ABONO.                                          392100      
005246*=======================                                          392200      
005247     IF RDI-COD-SER-CARGO                                         392300      
005248        ADD 1             TO NUM-CARGOS-COMP(WS-AP-OPER-APL)      392400      
005249                             NUM-CARGOS-TOT (WS-AP-OPER-APL)      392500      
005250        ADD WS-RDI-IMP-TRN                                        392600      
005251                          TO IMP-CARGOS-COMP(WS-AP-OPER-APL)      392700      
005252                             IMP-CARGOS-TOT (WS-AP-OPER-APL)      392800      
005253     ELSE                                                         392900      
005254     IF RDI-COD-SER-ABONO                                         393000      
005255        ADD 1             TO NUM-ABONOS-COMP(WS-AP-OPER-APL)      393100      
005256                             NUM-ABONOS-TOT (WS-AP-OPER-APL)      393200      
005257        ADD WS-RDI-IMP-TRN                                        393300      
005258                          TO IMP-ABONOS-COMP(WS-AP-OPER-APL)      393400      
005259                             IMP-ABONOS-TOT (WS-AP-OPER-APL)      393500      
005260     ELSE                                                         393600      
005261     IF RDI-COD-SER-ELIMCARGO                                     393700      
005262        SUBTRACT 1      FROM NUM-CARGOS-COMP(WS-AP-OPER-APL)      393800      
005263                             NUM-CARGOS-TOT (WS-AP-OPER-APL)      393900      
005264        SUBTRACT WS-RDI-IMP-TRN                                   394000      
005265                        FROM IMP-CARGOS-COMP(WS-AP-OPER-APL)      394100      
005266                             IMP-CARGOS-TOT (WS-AP-OPER-APL)      394200      
005267     ELSE                                                         394300      
005268     IF RDI-COD-SER-ELIMABONO                                     394400      
005269        SUBTRACT 1      FROM NUM-ABONOS-COMP(WS-AP-OPER-APL)      394500      
005270                             NUM-ABONOS-TOT (WS-AP-OPER-APL)      394600      
005271        SUBTRACT WS-RDI-IMP-TRN                                   394700      
005272                        FROM IMP-ABONOS-COMP(WS-AP-OPER-APL)      394800      
005273                             IMP-ABONOS-TOT (WS-AP-OPER-APL).     394900      
005274*                                                                 395000      
005275/=========================                                        395100      
005276 23250-ACTUALIZA-COMP-NAL.                                        395200      
005277*=========================                                        395300      
005278*           REGISTRO DETALLE COMPENSACION                         395400      
005279     MOVE ZEROS                   TO LLAVE-COMP.                  395500      
005280     MOVE WS-RS2-FECHA-ANT        TO FECHA-COMP.                  395600      
005281     MOVE WS-RS2-CSI-ORI-ANT      TO CSI-LOCAL-COMP.              395700      
005282     MOVE WS-RS2-CVE-MON-ANT      TO MONEDA-COMP.                 395800      
005283     MOVE WS-RS2-APL-ORI-ANT      TO APL-ORI-COMP.                395900      
005284     MOVE WS-RS2-CSI-DES-ANT      TO CSI-FORANEO-COMP.            396000      
005285     MOVE 0                       TO DUMMY-COMP.                  396100      
005286*                                                                 396200      
005287*----- OBSERVE QUE LAS CIFRAS FUERON SUMADAS EN EL REGISTRO -----*396300      
005288     WRITE REG-COMPENSACION                                       396400      
005289      INVALID KEY                                                 396500      
005290          PERFORM 23280-REESCRIBE-REG-CTL.                        396600      
005291*                                                                 396700      
005292     MOVE LOW-VALUES              TO REG-COMPENSACION.            396800      
005293     MOVE ZEROES                  TO LLAVE-COMP.                  396900      
005294*                                                                 397000      
005295*=======================                                          397100      
005296 23260-LEE-COMPENSACION.                                          397200      
005297*=======================                                          397300      
005298     MOVE 1                       TO EXISTE-REGISTRO-WS.          397400      
005299     READ COMPENSACION                                            397500      
005300      INVALID KEY                                                 397600      
005301              MOVE ZERO           TO EXISTE-REGISTRO-WS.          397700      
005302*                                                                 397800      
005303*============================                                     397900      
005304 23270-ACTUALIZA-REG-CTL-CSI.                                     398000      
005305*============================                                     398100      
005306*          REGISTRO DE CONTROL DEL CSI ORIGEN                     398200      
005307     MOVE LOW-VALUES              TO REG-COMPENSACION.            398300      
005308     MOVE ZEROS                   TO LLAVE-COMP.                  398400      
005309     MOVE WS-RS2-CSI-ORI-ANT      TO CSI-LOCAL-COMP.              398500      
005310     IF IND-VACIO = 1                                             398600      
005311        MOVE PTER-CSI-WS          TO CSI-LOCAL-COMP               398700      
005312        MOVE 1                    TO DUMMY-COMP.                  398800      
005313     PERFORM 23275-ESCRIBE-COMPENSACION.                          398900      
005314*                                                                 399000      
005315*===========================                                      399100      
005316 23275-ESCRIBE-COMPENSACION.                                      399200      
005317*===========================                                      399300      
005318     WRITE REG-COMPENSACION                                       399400      
005319      INVALID KEY                                                 399500      
005320*ASM          DISPLAY "010105 02  " WS-PROGRAMA,                  399600      
005321*ASM                  " ERROR ESCRITURA COMPENSACION "            399700      
005322*ASM                   LLAVE-COMP                                 399800      
005323              MOVE SPACES              TO WLI-TEXTO-LJ, TEXTO-LJ  399810      
005324              MOVE "I"                 TO WLI-TIPO-LJ, TIPO-LJ    399820      
005325              MOVE 010105              TO CODIGO-LJ               399830      
005326              MOVE "ERROR DE ESCRITURA EN COMPENSACION"           399840      
005327                                       TO WLI-TEXTO-LJ, TEXTO-LJ  399850      
005328              PERFORM      000-030-IMPRIME-MENSAJE                399860      
005329              SET MYSELF(STATUS)  TO -1.                          399900      
005330*                                                                 400000      
005331*=======================                                          400100      
005332 23280-REESCRIBE-REG-CTL.                                         400200      
005333*=======================                                          400300      
005334     REWRITE REG-COMPENSACION                                     400400      
005335      INVALID KEY                                                 400500      
005336*ASM          DISPLAY "010105 02   " WS-PROGRAMA,                 400600      
005337*ASM                  "ERROR REESCRITURA COMPENSACION "           400700      
005338*ASM                  LLAVE-COMP                                  400800      
005339              MOVE SPACES              TO WLI-TEXTO-LJ, TEXTO-LJ  400810      
005340              MOVE "I"                 TO WLI-TIPO-LJ, TIPO-LJ    400820      
005341              MOVE 010105              TO CODIGO-LJ               400830      
005342              MOVE "ERROR DE REESCRITURA EN COMPENSACION"         400840      
005343                                       TO WLI-TEXTO-LJ, TEXTO-LJ  400850      
005344              PERFORM      000-030-IMPRIME-MENSAJE                400860      
005345              SET MYSELF(STATUS)  TO -1.                          400900      
005346*                                                                 401000      
005347/===================                                              401100      
005348 23500-RESUMEN-REP1.                                              401200      
005349*===================                                              401300      
005350     MOVE LOW-VALUES              TO WS-TOTALES-SISTEMA.          401400      
005351     MOVE LOW-VALUES              TO WS-TOTALES-MONEDA.           401500      
005352     MOVE LOW-VALUES              TO WS-TOTALES-FECHA.            401600      
005353     OPEN I-O    COMPENSACION.                                    401700      
005354     MOVE ZEROS                   TO LLAVE-COMP.                  401800      
005355     MOVE ZEROS                   TO LLAVE-COMP-BACK.             401900      
005356     MOVE 90                      TO WS-CONT-R1-LIN.              402000      
005357     PERFORM 23541-LECT-SEC-COMPENSACION UNTIL                    402100      
005358       ( FECHA-COMP     NOT EQUAL TO ZEROS ) AND                  402200      
005359       ( MONEDA-COMP    NOT EQUAL TO ZEROS ) AND                  402300      
005360       ( CSI-LOCAL-COMP NOT EQUAL TO ZEROS ) AND                  402400      
005361       ( APL-ORI-COMP   NOT EQUAL TO ZEROS ).                     402500      
005362     MOVE FECHA-COMP              TO FECHA-WS.                    402600      
005363     MOVE MONEDA-COMP             TO MONEDA-WS.                   402700      
005364     MOVE CSI-LOCAL-COMP          TO CSI-LOCAL-WS.                402800      
005365     MOVE APL-ORI-COMP            TO APL-ORI-WS.                  402900      
005366     MOVE ZEROS                   TO WS-FIN-COMPENSACION.         403000      
005367     PERFORM 23510-VACIA-COMPENSACION UNTIL FIN-COMPENSACION.     403100      
005368     CLOSE COMPENSACION    WITH PURGE.                            403200      
005369*                                                                 403300      
005370*========================                                         403400      
005371 23510-VACIA-COMPENSACION.                                        403500      
005372*========================                                         403600      
005373     IF MON-COMP-VALIDO AND LOCAL-COMP-VALIDO AND                 403700      
005374                            FORAN-COMP-VALIDO                     403800      
005375        MOVE OPER-APLI-COMP(1)    TO                              403900      
005376             OPER-APLI-TDC(CSI-LOCAL-COMP,CSI-FORANEO-COMP,1)     404000      
005377        MOVE OPER-APLI-COMP(2)    TO                              404100      
005378             OPER-APLI-TDC(CSI-LOCAL-COMP,CSI-FORANEO-COMP,2).    404200      
005379*                                                                 404300      
005380     PERFORM 23541-LECT-SEC-COMPENSACION.                         404400      
005381     IF LOCAL-COMP-VALIDO AND FORAN-COMP-VALIDO                   404500      
005382        IF FECHA-COMP     NOT EQUAL TO FECHA-WS                   404600      
005383        OR FIN-COMPENSACION                                       404700      
005384           PERFORM 23515-CORTE-X-FECHA                            404800      
005385        ELSE                                                      404900      
005386        IF CSI-LOCAL-COMP NOT EQUAL TO CSI-LOCAL-WS               405000      
005387           PERFORM 23520-CORTE-X-CSILOCAL                         405100      
005388        ELSE                                                      405200      
005389        IF MONEDA-COMP    NOT EQUAL TO MONEDA-WS                  405300      
005390           PERFORM 23530-CORTE-X-MONEDA                           405400      
005391        ELSE                                                      405500      
005392        IF APL-ORI-COMP   NOT EQUAL TO APL-ORI-WS                 405600      
005393           PERFORM 23550-CORTE-X-SISTEMA                          405700      
005394        ELSE                                                      405800      
005395           NEXT SENTENCE                                          405900      
005396     ELSE                                                         406000      
005397*ASM    DISPLAY "020801 02  " WS-PROGRAMA,                        406100      
005398*ASM            " DATOS INVALIDOS COMPENSACION CON "              406200      
005399*ASM             LLAVE-COMP.                                      406300      
005400        MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ     406310      
005401        MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ       406320      
005402        MOVE 020801                 TO CODIGO-LJ                  406330      
005403        MOVE "DATOS INVALIDOS EN COMPENSACION"                    406340      
005404                                    TO WLI-TEXTO-LJ, TEXTO-LJ     406350      
005405        PERFORM      000-030-IMPRIME-MENSAJE.                     406360      
005406*                                                                 406400      
005407*====================                                             406500      
005408 23515-CORTE-X-FECHA.                                             406600      
005409*====================                                             406700      
005410     PERFORM 23520-CORTE-X-CSILOCAL.                              406800      
005411     PERFORM 23600-IMPRIME-TOTALES-FECHA.                         406900      
005412     MOVE FECHA-COMP              TO FECHA-WS.                    407000      
005413     MOVE 90                      TO WS-CONT-R1-LIN.              407100      
005414*                                                                 407200      
005415/======================                                           407300      
005416 23520-CORTE-X-CSILOCAL.                                          407400      
005417*======================                                           407500      
005418     PERFORM 23530-CORTE-X-MONEDA.                                407600      
005419     MOVE CSI-LOCAL-COMP          TO CSI-LOCAL-WS.                407700      
005420*                                                                 407800      
005421*=====================                                            407900      
005422 23530-CORTE-X-MONEDA.                                            408000      
005423*=====================                                            408100      
005424     MOVE LLAVE-COMP              TO LLAVE-COMP-BACK.             408200      
005425     PERFORM 23550-CORTE-X-SISTEMA.                               408300      
005426     PERFORM 23590-IMPRIME-TOTALES-MONEDA.                        408400      
005427     PERFORM 23540-POSICIONA-COMPENSACION.                        408500      
005428     MOVE MONEDA-COMP             TO MONEDA-WS.                   408600      
005429*                                                                 408700      
005430*=============================                                    408800      
005431 23540-POSICIONA-COMPENSACION.                                    408900      
005432*=============================                                    409000      
005433     MOVE LLAVE-COMP-BACK         TO LLAVE-COMP.                  409100      
005434     START COMPENSACION KEY EQUAL TO LLAVE-COMP                   409200      
005435      INVALID KEY                                                 409300      
005436*ASM          DISPLAY "010103 02  " WS-PROGRAMA,                  409400      
005437*ASM                  "ERROR POSICIONA COMPENSACION"              409500      
005438*ASM                  LLAVE-COMP " CON "LLAVE-COMP-BACK           409600      
005439              MOVE SPACES              TO WLI-TEXTO-LJ, TEXTO-LJ  409610      
005440              MOVE "I"                 TO WLI-TIPO-LJ, TIPO-LJ    409620      
005441              MOVE 020101              TO CODIGO-LJ               409630      
005442              MOVE "INICIO DE PROCESO"                            409640      
005443                                       TO WLI-TEXTO-LJ, TEXTO-LJ  409650      
005444              PERFORM      000-030-IMPRIME-MENSAJE                409660      
005445              SET MYSELF(STATUS)  TO -1.                          409700      
005446*                                                                 409800      
005447     PERFORM 23541-LECT-SEC-COMPENSACION UNTIL                    409900      
005448                                     APL-ORI-COMP NOT = ZEROS     410000      
005449     MOVE APL-ORI-COMP            TO APL-ORI-WS.                  410100      
005450*                                                                 410200      
005451*============================                                     410300      
005452 23541-LECT-SEC-COMPENSACION.                                     410400      
005453*============================                                     410500      
005454     READ COMPENSACION NEXT                                       410600      
005455      AT END                                                      410700      
005456          MOVE 1                  TO WS-FIN-COMPENSACION.         410800      
005457*                                                                 410900      
005458*=====================                                            411000      
005459 23550-CORTE-X-SISTEMA.                                           411100      
005460*=====================                                            411200      
005461     MOVE CSI-LOCAL-WS            TO PTER-1-CSI-WS.               411300      
005462     IF NOT CONT-R1-LIN-50                                        411400      
005463       PERFORM 23570-IMPRIME-TITULOS.                             411500      
005464***  MOVE SPACES                   TO LREP1                       411600      
005465***  WRITE LREP1                   BEFORE 1                       411700      
005466     MOVE SPACES                  TO WS-SISTEMA-LG WS-SISTEMA-CR. 411800      
005467     MOVE APL-ORI-WS              TO WS-APL-ORI-PTE.              411900      
005468     PERFORM 29000-BUSCA-SIST.                                    412000      
005469     IF WS-SISTEMA-LG = SPACES                                    412100      
005470        MOVE APL-ORI-WS           TO WS-SIS-LG     WS-SIS-CR.     412200      
005471     MOVE WS-SISTEMA-LG           TO R1S4-SISTEMA                 412300      
005472***  WRITE LREP1 FROM REP1-SUB4    BEFORE 2                       412400      
005473     ADD 3                        TO WS-CONT-R1-LIN.              412500      
005474     PERFORM 23560-IMPRIME-DETALLES VARYING PTER-2-CSI-WS         412600      
005475                                       FROM 1 BY 1                412700      
005476                            UNTIL PTER-2-CSI-WS > LIM-CSIS.       412800      
005477     PERFORM 23580-IMPRIME-TOTALES-SISTEMA.                       412900      
005478     MOVE APL-ORI-COMP            TO APL-ORI-WS.                  413000      
005479     MOVE LOW-VALUES              TO TABLA-DATOS-CSIS.            413100      
005480*                                                                 413200      
005481/=======================                                          413300      
005482 23560-IMPRIME-DETALLES.                                          413400      
005483*=======================                                          413500      
005484     IF (PTER-1-CSI-WS NOT = PTER-2-CSI-WS) AND CSI-2-VALIDO      413600      
005485         MOVE NOM-CSI-TC(PTER-2-CSI-WS)                           413700      
005486                                 TO R1D1-CSI-OPERAPLI             413800      
005487         MOVE NUM-CARGOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,1)       413900      
005488                                  TO R1D1-NUM-CAR-OP              414000      
005489         MOVE IMP-CARGOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,1)       414100      
005490                                  TO R1D1-IMP-CAR-OP              414200      
005491         MOVE NUM-ABONOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,1)       414300      
005492                                        TO R1D1-NUM-ABO-OP        414400      
005493         MULTIPLY IMP-ABONOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,1)   414500      
005494                                  BY -1 GIVING R1D1-IMP-ABO-OP    414600      
005495         MOVE NUM-CARGOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,2)       414700      
005496                                  TO R1D1-NUM-CAR-APL             414800      
005497         MULTIPLY IMP-CARGOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,2)   414900      
005498                                  BY -1 GIVING R1D1-IMP-CAR-APL   415000      
005499         MOVE NUM-ABONOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,2)       415100      
005500                                  TO R1D1-NUM-ABO-APL             415200      
005501         MOVE IMP-ABONOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,2)       415300      
005502                                  TO R1D1-IMP-ABO-APL             415400      
005503*                                                                 415500      
005504         ADD NUM-CARGOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,1)        415600      
005505               TO WS-NUM-SIS(1,1) WS-NUM-MON(1,1) WS-NUM-FEC(1,1) 415700      
005506         ADD IMP-CARGOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,1)        415800      
005507               TO WS-IMP-SIS(1,1) WS-IMP-MON(1,1) WS-IMP-FEC(1,1) 415900      
005508         ADD NUM-ABONOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,1)        416000      
005509               TO WS-NUM-SIS(1,2) WS-NUM-MON(1,2) WS-NUM-FEC(1,2) 416100      
005510         SUBTRACT IMP-ABONOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,1)   416200      
005511             FROM WS-IMP-SIS(1,2) WS-IMP-MON(1,2) WS-IMP-FEC(1,2) 416300      
005512         ADD NUM-CARGOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,2)        416400      
005513               TO WS-NUM-SIS(2,1) WS-NUM-MON(2,1) WS-NUM-FEC(2,1) 416500      
005514         SUBTRACT IMP-CARGOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,2)   416600      
005515             FROM WS-IMP-SIS(2,1) WS-IMP-MON(2,1) WS-IMP-FEC(2,1) 416700      
005516         ADD NUM-ABONOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,2)        416800      
005517               TO WS-NUM-SIS(2,2) WS-NUM-MON(2,2) WS-NUM-FEC(2,2) 416900      
005518         ADD IMP-ABONOS-TDC(PTER-1-CSI-WS,PTER-2-CSI-WS,2)        417000      
005519               TO WS-IMP-SIS(2,2) WS-IMP-MON(2,2) WS-IMP-FEC(2,2) 417100      
005520         ADD 1                    TO WS-CONT-R1-LIN               417200      
005521***      WRITE LREP1 FROM REP1-DET1 BEFORE 1                      417300      
005522         MOVE SPACES              TO REP1-DET1.                   417400      
005523*                                                                 417500      
005524/======================                                           417600      
005525 23570-IMPRIME-TITULOS.                                           417700      
005526*======================                                           417800      
005527     PERFORM 23571-TITULOS.                                       417900      
005528     PERFORM 23572-SUBTITULOS.                                    418000      
005529*                                                                 418100      
005530*==============                                                   418200      
005531 23571-TITULOS.                                                   418300      
005532*==============                                                   418400      
005533     ADD 1                        TO WS-CONT-R1-HOJAS             418500      
005534     MOVE WS-CONT-R1-HOJAS        TO RT1-PAG.                     418600      
005535     MOVE WS-RT1-REP1             TO RT1-TITULO.                  418700      
005536     MOVE WS-RT2-REP1             TO RT2-TITULO.                  418800      
005537     MOVE "   MONEDA: "           TO RT4-NMONEDA.                 418900      
005538     MOVE MONEDA-WS               TO RT4-MONEDA.                  419000      
005539***  WRITE LREP1 FROM REP0-DET5    BEFORE PAGE.                   419100      
005540***  WRITE LREP1 FROM REP-TIT1     BEFORE 1.                      419200      
005541***  WRITE LREP1 FROM REP-TIT2     BEFORE 1.                      419300      
005542***  WRITE LREP1 FROM REP-TIT3     BEFORE 2.                      419400      
005543***  WRITE LREP1 FROM REP-TIT4     BEFORE 2.                      419500      
005544     MOVE 6                       TO WS-CONT-R1-LIN.              419600      
005545*                                                                 419700      
005546*================                                                 419800      
005547 23572-SUBTITULOS.                                                419900      
005548*================                                                 420000      
005549***  WRITE LREP1 FROM REP1-SUB1    BEFORE 1.                      420100      
005550***  WRITE LREP1 FROM REP1-SUB2    BEFORE 1.                      420200      
005551***  WRITE LREP1 FROM REP1-SUB3    BEFORE 1.                      420300      
005552     ADD  3                       TO WS-CONT-R1-LIN.              420400      
005553*                                                                 420500      
005554/==============================                                   420600      
005555 23580-IMPRIME-TOTALES-SISTEMA.                                   420700      
005556*==============================                                   420800      
005557***  MOVE SPACES                   TO LREP1.                      420900      
005558***  WRITE LREP1                   BEFORE 1.                      421000      
005559     MOVE WS-SISTEMA-CR           TO M-SIST.                      421100      
005560     MOVE MEN-SISTEMA             TO R1D3-TOT-LEY.                421200      
005561     MOVE WS-NUM-SIS(1, 1)        TO R1D3-NUM-CAROP               421300      
005562     MOVE WS-IMP-SIS(1, 1)        TO R1D3-IMP-CAROP               421400      
005563     MOVE WS-NUM-SIS(1, 2)        TO R1D3-NUM-ABOP                421500      
005564     MOVE WS-IMP-SIS(1, 2)        TO R1D3-IMP-ABOP                421600      
005565     MOVE WS-NUM-SIS(2, 1)        TO R1D3-NUM-CARAPLI             421700      
005566     MOVE WS-IMP-SIS(2, 1)        TO R1D3-IMP-CARAPLI             421800      
005567     MOVE WS-NUM-SIS(2, 2)        TO R1D3-NUM-ABAPLI              421900      
005568     MOVE WS-IMP-SIS(2, 2)        TO R1D3-IMP-ABAPLI              422000      
005569*                                                                 422100      
005570***  WRITE LREP1 FROM REP1-DET3    BEFORE 2.                      422200      
005571     ADD 3                        TO WS-CONT-R1-LIN.              422300      
005572     MOVE SPACES                  TO REP1-DET3.                   422400      
005573     MOVE LOW-VALUES              TO WS-TOTALES-SISTEMA.          422500      
005574*                                                                 422600      
005575/=============================                                    422700      
005576 23590-IMPRIME-TOTALES-MONEDA.                                    422800      
005577*=============================                                    422900      
005578     IF NOT CONT-R1-LIN-56                                        423000      
005579         PERFORM 23570-IMPRIME-TITULOS.                           423100      
005580     MOVE MONEDA-WS               TO M-MON   .                    423200      
005581     MOVE MEN-MONEDA              TO R1D3-TOT-LEY.                423300      
005582     MOVE WS-NUM-MON(1,1)         TO R1D3-NUM-CAROP               423400      
005583     MOVE WS-IMP-MON(1,1)         TO R1D3-IMP-CAROP               423500      
005584     MOVE WS-NUM-MON(1,2)         TO R1D3-NUM-ABOP                423600      
005585     MOVE WS-IMP-MON(1,2)         TO R1D3-IMP-ABOP                423700      
005586     MOVE WS-NUM-MON(2,1)         TO R1D3-NUM-CARAPLI             423800      
005587     MOVE WS-IMP-MON(2,1)         TO R1D3-IMP-CARAPLI             423900      
005588     MOVE WS-NUM-MON(2,2)         TO R1D3-NUM-ABAPLI              424000      
005589     MOVE WS-IMP-MON(2,2)         TO R1D3-IMP-ABAPLI              424100      
005590*                                                                 424200      
005591***  MOVE SPACES                   TO LREP1.                      424300      
005592***  WRITE LREP1                   BEFORE 3.                      424400      
005593***  WRITE LREP1 FROM REP1-DET3    BEFORE 2.                      424500      
005594     ADD 5                        TO WS-CONT-R1-LIN.              424600      
005595     MOVE SPACES                  TO REP1-DET2 REP1-DET3.         424700      
005596*                                                                 424800      
005597     MOVE "S A L D O"             TO R1D2-SALDO-LEY.              424900      
005598     COMPUTE SALDO-CALCULADO-WS =                                 425000      
005599             WS-IMP-MON(1,1) + WS-IMP-MON(1,2).                   425100      
005600     IF SALDO-CALCULADO-WS > 0                                    425200      
005601          MOVE SALDO-CALCULADO-WS TO R1D2-SALDO-CAR-OP            425300      
005602     ELSE                                                         425400      
005603          MOVE SALDO-CALCULADO-WS TO R1D2-SALDO-ABO-OP.           425500      
005604*                                                                 425600      
005605     COMPUTE SALDO-CALCULADO-WS =                                 425700      
005606             WS-IMP-MON(2,1) + WS-IMP-MON (2,2).                  425800      
005607     IF SALDO-CALCULADO-WS < 0                                    425900      
005608         MOVE SALDO-CALCULADO-WS  TO R1D2-SALDO-CAR-APL           426000      
005609     ELSE                                                         426100      
005610         MOVE SALDO-CALCULADO-WS  TO R1D2-SALDO-ABO-APL.          426200      
005611/                                                                 426300      
005612***  WRITE LREP1 FROM REP1-DET2    BEFORE 2.                      426400      
005613     MOVE SPACES                  TO REP1-DET2.                   426500      
005614     ADD 2                        TO WS-CONT-R1-LIN.              426600      
005615*                                                                 426700      
005616     COMPUTE SALDO-GRAL-MON = WS-IMP-MON(1, 1) + WS-IMP-MON(1, 2) 426800      
005617                            + WS-IMP-MON(2, 1) + WS-IMP-MON(2, 2).426900      
005618     IF (WS-IMP-MON(1,1) + WS-IMP-MON(1,2)) <                     427000      
005619        (WS-IMP-MON(2,1) + WS-IMP-MON(2,2))                       427100      
005620        IF (WS-IMP-MON(1,1) + WS-IMP-MON(1,2)) > 0                427200      
005621           MOVE SALDO-GRAL-MON    TO R1D2-SALDO-CAR-OP            427300      
005622        ELSE                                                      427400      
005623           MOVE SALDO-GRAL-MON    TO R1D2-SALDO-ABO-OP            427500      
005624     ELSE                                                         427600      
005625        IF (WS-IMP-MON(2,1) + WS-IMP-MON(2,2)) < 0                427700      
005626           MOVE SALDO-GRAL-MON    TO R1D2-SALDO-CAR-APL           427800      
005627        ELSE                                                      427900      
005628           MOVE SALDO-GRAL-MON    TO R1D2-SALDO-ABO-APL.          428000      
005629*                                                                 428100      
005630***  WRITE LREP1 FROM REP1-DET2    BEFORE 2.                      428200      
005631     MOVE SPACES                  TO REP1-DET2.                   428300      
005632     ADD 2                        TO WS-CONT-R1-LIN.              428400      
005633     MOVE LOW-VALUES              TO WS-TOTALES-MONEDA.           428500      
005634*                                                                 428600      
005635/=============================                                    428700      
005636 23600-IMPRIME-TOTALES-FECHA.                                     428800      
005637*=============================                                    428900      
005638     IF NOT CONT-R1-LIN-56                                        429000      
005639        PERFORM 23570-IMPRIME-TITULOS.                            429100      
005640     MOVE FECHA-WS                TO M-FEC   .                    429200      
005641     MOVE MEN-FECHA               TO R1D3-TOT-LEY.                429300      
005642     MOVE WS-NUM-FEC(1,1)         TO R1D3-NUM-CAROP               429400      
005643     MOVE WS-IMP-FEC(1,1)         TO R1D3-IMP-CAROP               429500      
005644     MOVE WS-NUM-FEC(1,2)         TO R1D3-NUM-ABOP                429600      
005645     MOVE WS-IMP-FEC(1,2)         TO R1D3-IMP-ABOP                429700      
005646     MOVE WS-NUM-FEC(2,1)         TO R1D3-NUM-CARAPLI             429800      
005647     MOVE WS-IMP-FEC(2,1)         TO R1D3-IMP-CARAPLI             429900      
005648     MOVE WS-NUM-FEC(2,2)         TO R1D3-NUM-ABAPLI              430000      
005649     MOVE WS-IMP-FEC(2,2)         TO R1D3-IMP-ABAPLI              430100      
005650*                                                                 430200      
005651***  MOVE SPACES                   TO LREP1.                      430300      
005652***  WRITE LREP1                   BEFORE 3.                      430400      
005653***  WRITE LREP1 FROM REP1-DET3    BEFORE 2.                      430500      
005654     ADD 5                        TO WS-CONT-R1-LIN.              430600      
005655     MOVE SPACES                  TO REP1-DET2 REP1-DET3.         430700      
005656*                                                                 430800      
005657     MOVE "S A L D O"             TO R1D2-SALDO-LEY.              430900      
005658     COMPUTE SALDO-CALCULADO-WS =                                 431000      
005659             WS-IMP-FEC(1,1) + WS-IMP-FEC(1,2).                   431100      
005660     IF SALDO-CALCULADO-WS > 0                                    431200      
005661          MOVE SALDO-CALCULADO-WS TO R1D2-SALDO-CAR-OP            431300      
005662     ELSE                                                         431400      
005663          MOVE SALDO-CALCULADO-WS TO R1D2-SALDO-ABO-OP.           431500      
005664*                                                                 431600      
005665     COMPUTE SALDO-CALCULADO-WS =                                 431700      
005666             WS-IMP-FEC(2,1) + WS-IMP-FEC (2,2).                  431800      
005667     IF SALDO-CALCULADO-WS < 0                                    431900      
005668         MOVE SALDO-CALCULADO-WS  TO R1D2-SALDO-CAR-APL           432000      
005669     ELSE                                                         432100      
005670         MOVE SALDO-CALCULADO-WS  TO R1D2-SALDO-ABO-APL.          432200      
005671/                                                                 432300      
005672***  WRITE LREP1 FROM REP1-DET2    BEFORE 2.                      432400      
005673     MOVE SPACES                  TO REP1-DET2.                   432500      
005674     ADD 2                        TO WS-CONT-R1-LIN.              432600      
005675*                                                                 432700      
005676     COMPUTE SALDO-GRAL-FEC = WS-IMP-FEC(1, 1) + WS-IMP-FEC(1, 2) 432800      
005677                            + WS-IMP-FEC(2, 1) + WS-IMP-FEC(2, 2).432900      
005678     IF (WS-IMP-FEC(1,1) + WS-IMP-FEC(1,2)) <                     433000      
005679        (WS-IMP-FEC(2,1) + WS-IMP-FEC(2,2))                       433100      
005680        IF (WS-IMP-FEC(1,1) + WS-IMP-FEC(1,2)) > 0                433200      
005681           MOVE SALDO-GRAL-FEC    TO R1D2-SALDO-CAR-OP            433300      
005682        ELSE                                                      433400      
005683           MOVE SALDO-GRAL-FEC    TO R1D2-SALDO-ABO-OP            433500      
005684     ELSE                                                         433600      
005685        IF (WS-IMP-FEC(2,1) + WS-IMP-FEC(2,2)) < 0                433700      
005686           MOVE SALDO-GRAL-FEC    TO R1D2-SALDO-CAR-APL           433800      
005687        ELSE                                                      433900      
005688           MOVE SALDO-GRAL-FEC    TO R1D2-SALDO-ABO-APL.          434000      
005689*                                                                 434100      
005690***  WRITE LREP1 FROM REP1-DET2    BEFORE 2.                      434200      
005691     MOVE SPACES                  TO REP1-DET2.                   434300      
005692     ADD 2                        TO WS-CONT-R1-LIN.              434400      
005693     MOVE LOW-VALUES              TO WS-TOTALES-FECHA.            434500      
005694*                                                                 434600      
005695*=========================                                        434700      
005696 23900-EXIT-SECTION.  EXIT.                                       434800      
005697*=========================                                        434900      
005698*                                                                 435000      
005699/=========================================                        435100      
005700 24100-ENVIA-A-SORT3              SECTION.                        435200      
005701 24100-CONTROL.                                                   435300      
005702*=========================================                        435400      
005703     OPEN INPUT  LOG-TRANSMISION.                                 435500      
005704     MOVE ZEROS                   TO  WS-FIN-LOG-SORT3.           435600      
005705     MOVE ZEROS                   TO  WS-CONT-REG.                435700      
005706     PERFORM 24120-LEE-LOG-TRANSMISION.                           435800      
005707     PERFORM 24110-ENVIA-LOG-SORT3 UNTIL FIN-LOG-SORT3.           435900      
005708     CLOSE LOG-TRANSMISION WITH PURGE.                            436000      
005709*    DISPLAY ">>>A SORT TRANSMISION: "WS-CONT-REG.                436100      
005710     GO TO 24190-EXIT-SECTION.                                    436200      
005711*                                                                 436300      
005712*======================                                           436400      
005713 24110-ENVIA-LOG-SORT3.                                           436500      
005714*======================                                           436600      
005715     MOVE SPACES                  TO REG-SORT3.                   436700      
005716     RELEASE REG-SORT3          FROM WS-REG-SORT3.                436800      
005717     ADD 1                        TO WS-CONT-REG.                 436900      
005718     PERFORM 24120-LEE-LOG-TRANSMISION.                           437000      
005719*                                                                 437100      
005720*==========================                                       437200      
005721 24120-LEE-LOG-TRANSMISION.                                       437300      
005722*==========================                                       437400      
005723     READ LOG-TRANSMISION       INTO WS-REG-SORT3                 437500      
005724      AT END                                                      437600      
005725          MOVE 1                  TO  WS-FIN-LOG-SORT3.           437700      
005726*                                                                 437800      
005727*=========================                                        437900      
005728 24190-EXIT-SECTION. EXIT.                                        438000      
005729*=========================                                        438100      
005730*                                                                 438200      
005731/=========================================                        438300      
005732 24200-REGRESA-SORT3              SECTION.                        438400      
005733 24200-CONTROL.                                                   438500      
005734*=========================================                        438600      
005735     MOVE ZEROS                   TO WS-FIN-LOG-SORT3.            438700      
005736     MOVE ZEROS                   TO WS-CONT-REG.                 438800      
005737     MOVE 90                      TO WS-CONT-R3-LIN.              438900      
005738     PERFORM 24600-LEE-SORT3.                                     439000      
005739     PERFORM 24300-REPORTE-X-SISTEMA.                             439100      
005740*    DISPLAY ">>> PARA REP X SISTEMA: "WS-CONT-REG.               439200      
005741     PERFORM 24400-REPORTE-X-NODO.                                439300      
005742*    DISPLAY ">>> PARA REP X NODO:    "WS-CONT-REG.               439400      
005743     PERFORM 24500-ENLACE-S028.                                   439500      
005744*    DISPLAY ">>> PARA REP X ENLACE:  "WS-CONT-REG.               439600      
005745     GO TO 24900-EXIT-SECTION.                                    439700      
005746*                                                                 439800      
005747/========================                                         439900      
005748 24300-REPORTE-X-SISTEMA.                                         440000      
005749*========================                                         440100      
005750     MOVE WS-RS3-LLAVE            TO WS-RS3-LLAVE-ANT.            440200      
005751     MOVE LOW-VALUES              TO OPER-APLI-ACUM.              440300      
005752     PERFORM 24310-PROCESA-REP-X-SIS   UNTIL RS3-REP-COMPXNOD     440400      
005753                                          OR FIN-LOG-SORT3.       440500      
005754     PERFORM 24320-TOTAL-REP-X-SIS.                               440600      
005755*                                                                 440700      
005756*========================                                         440800      
005757 24310-PROCESA-REP-X-SIS.                                         440900      
005758*========================                                         441000      
005759     IF WS-RS3-FEC-CON NOT = WS-RS3-FEC-CON-ANT                   441100      
005760        PERFORM 24330-CORTE-X-FEC                                 441200      
005761        MOVE 90                   TO WS-CONT-R3-LIN               441300      
005762     ELSE                                                         441400      
005763     IF WS-RS3-APL-ORI NOT = WS-RS3-APL-ORI-ANT                   441500      
005764        PERFORM 24340-CORTE-X-APL-ORI                             441600      
005765        PERFORM 24372-ENCAB-REP3-PARTE2.                          441700      
005766*                                                                 441800      
005767     MOVE WS-RS3-AMBITO           TO PTER-CORTE-WS.               441900      
005768     IF RS3-PENDIENTE                                             442000      
005769        MOVE 4                    TO PTER-CORTE-WS.               442100      
005770     PERFORM 24350-ACUMULA.                                       442200      
005771*                                                                 442300      
005772     IF RS3-LOCAL OR RS3-FORANEO                                  442400      
005773        MOVE 3                    TO PTER-CORTE-WS                442500      
005774        PERFORM 24350-ACUMULA.                                    442600      
005775*                                                                 442700      
005776     PERFORM 24350-ACUMULA VARYING PTER-CORTE-WS FROM 5 BY 1      442800      
005777                             UNTIL PTER-CORTE-WS > 7.             442900      
005778*                                                                 443000      
005779     PERFORM 24600-LEE-SORT3.                                     443100      
005780*                                                                 443200      
005781*=====================                                            443300      
005782 24320-TOTAL-REP-X-SIS.                                           443400      
005783*=====================                                            443500      
005784     PERFORM 24330-CORTE-X-FEC                                    443600      
005785     MOVE 7                       TO PTER-CORTE-WS.               443700      
005786     PERFORM 24360-IMPRIME-TOTALES.                               443800      
005787     MOVE WS-RS3-TIPO-REP         TO WS-RS3-TIPO-REP-ANT.         443900      
005788*                                                                 444000      
005789*==================                                               444100      
005790 24330-CORTE-X-FEC.                                               444200      
005791*==================                                               444300      
005792     PERFORM 24340-CORTE-X-APL-ORI                                444400      
005793     MOVE WS-RS3-FEC-CON-ANT      TO WS-R3D1-FEC-CON.             444500      
005794     MOVE 6                       TO PTER-CORTE-WS.               444600      
005795     PERFORM 24360-IMPRIME-TOTALES.                               444700      
005796     MOVE WS-RS3-FEC-CON          TO WS-RS3-FEC-CON-ANT.          444800      
005797*                                                                 444900      
005798/======================                                           445000      
005799 24340-CORTE-X-APL-ORI.                                           445100      
005800*======================                                           445200      
005801     PERFORM 24360-IMPRIME-TOTALES VARYING PTER-CORTE-WS          445300      
005802             FROM 1 BY 1             UNTIL PTER-CORTE-WS > 4.     445400      
005803     MOVE 5                       TO PTER-CORTE-WS.               445500      
005804     PERFORM 24360-IMPRIME-TOTALES.                               445600      
005805     MOVE WS-RS3-APL-ORI          TO WS-RS3-APL-ORI-ANT.          445700      
005806*                                                                 445800      
005807*==============                                                   445900      
005808 24350-ACUMULA.                                                   446000      
005809*==============                                                   446100      
005810     IF RS3-COD-SER-CARGO                                         446200      
005811        ADD 1             TO NUM-CARGOS-ACUM(PTER-CORTE-WS)       446300      
005812        ADD WS-RS3-IMP-TRN                                        446400      
005813                          TO IMP-CARGOS-ACUM(PTER-CORTE-WS)       446500      
005814     ELSE                                                         446600      
005815     IF RS3-COD-SER-ABONO                                         446700      
005816        ADD 1             TO NUM-ABONOS-ACUM(PTER-CORTE-WS)       446800      
005817        ADD WS-RS3-IMP-TRN                                        446900      
005818                          TO IMP-ABONOS-ACUM(PTER-CORTE-WS)       447000      
005819     ELSE                                                         447100      
005820     IF RS3-COD-SER-ELIMCARGO                                     447200      
005821        SUBTRACT 1      FROM NUM-CARGOS-ACUM(PTER-CORTE-WS)       447300      
005822        SUBTRACT WS-RS3-IMP-TRN                                   447400      
005823                        FROM IMP-CARGOS-ACUM(PTER-CORTE-WS)       447500      
005824     ELSE                                                         447600      
005825        SUBTRACT 1      FROM NUM-ABONOS-ACUM(PTER-CORTE-WS)       447700      
005826        SUBTRACT WS-RS3-IMP-TRN                                   447800      
005827                        FROM IMP-ABONOS-ACUM(PTER-CORTE-WS).      447900      
005828*                                                                 448000      
005829*======================                                           448100      
005830 24360-IMPRIME-TOTALES.                                           448200      
005831*======================                                           448300      
005832     IF NOT CONT-R3-LIN-60                                        448400      
005833        PERFORM 24370-ENCABEZADO-REP3.                            448500      
005834*                                                                 448600      
005835*                                                                 448700      
005836     MOVE WS-R3D1-LEY    (PTER-CORTE-WS) TO R3D1-LEY.             448800      
005837     MOVE NUM-CARGOS-ACUM(PTER-CORTE-WS) TO R3D1-NCAR.            448900      
005838     MOVE IMP-CARGOS-ACUM(PTER-CORTE-WS) TO R3D1-ICAR.            449000      
005839     MOVE NUM-ABONOS-ACUM(PTER-CORTE-WS) TO R3D1-NABO.            449100      
005840     MOVE IMP-ABONOS-ACUM(PTER-CORTE-WS) TO R3D1-IABO.            449200      
005841     COMPUTE SALDO-CALCULADO-WS = IMP-CARGOS-ACUM(PTER-CORTE-WS)  449300      
005842                                - IMP-ABONOS-ACUM(PTER-CORTE-WS). 449400      
005843     MOVE SALDO-CALCULADO-WS             TO R3D1-IDIF.            449500      
005844***  WRITE LREP3 FROM REP3-DET1    BEFORE 2.                      449600      
005845     ADD 2                        TO WS-CONT-R3-LIN.              449700      
005846*                                                                 449800      
005847     MOVE LOW-VALUES              TO ACUMULADOR(PTER-CORTE-WS).   449900      
005848*                                                                 450000      
005849/=====================                                            450100      
005850 24370-ENCABEZADO-REP3.                                           450200      
005851*=====================                                            450300      
005852     PERFORM 24371-ENCAB-REP3-PARTE1.                             450400      
005853     PERFORM 24372-ENCAB-REP3-PARTE2.                             450500      
005854*                                                                 450600      
005855*=======================                                          450700      
005856 24371-ENCAB-REP3-PARTE1.                                         450800      
005857*=======================                                          450900      
005858     ADD  1                       TO WS-CONT-R3-HOJAS.            451000      
005859     MOVE WS-CONT-R3-HOJAS        TO RT1-PAG.                     451100      
005860     MOVE WS-RT1-REP3             TO RT1-TITULO.                  451200      
005861     MOVE WS-RT2-REP3             TO RT2-TITULO.                  451300      
005862     MOVE SPACES                  TO RT4-NMONEDA.                 451400      
005863     MOVE ZEROS                   TO RT4-MONEDA.                  451500      
005864     MOVE WS-RS3-FEC-CON-ANT      TO R3S3-FEC-CONT.               451600      
005865***  WRITE LREP3 FROM REP0-DET5    BEFORE PAGE.                   451700      
005866***  WRITE LREP3 FROM REP-TIT1     BEFORE 1.                      451800      
005867***  WRITE LREP3 FROM REP-TIT2     BEFORE 1.                      451900      
005868***  WRITE LREP3 FROM REP-TIT3     BEFORE 2.                      452000      
005869***  WRITE LREP3 FROM REP-TIT4     BEFORE 2.                      452100      
005870***  WRITE LREP3 FROM REP3-SUB3    BEFORE 2.                      452200      
005871***  WRITE LREP3 FROM REP3-SUB1    BEFORE 1.                      452300      
005872***  WRITE LREP3 FROM REP3-SUB2    BEFORE 2.                      452400      
005873     MOVE 11                      TO WS-CONT-R3-LIN.              452500      
005874*                                                                 452600      
005875*=======================                                          452700      
005876 24372-ENCAB-REP3-PARTE2.                                         452800      
005877*=======================                                          452900      
005878     MOVE WS-RS3-APL-ORI-ANT      TO APL-ORI-WS.                  453000      
005879     MOVE APL-ORI-WS              TO WS-APL-ORI-PTE.              453100      
005880     PERFORM 29000-BUSCA-SIST.                                    453200      
005881     IF WS-SISTEMA-LG = SPACES                                    453300      
005882        MOVE APL-ORI-WS           TO WS-SIS-CR     WS-SIS-LG.     453400      
005883     MOVE WS-SISTEMA-LG           TO R3S4-SISTEMA.                453500      
005884     MOVE WS-SIS-CR               TO WS-R3D1-APL-ORI.             453600      
005885***  WRITE LREP3 FROM REP3-SUB4    BEFORE 2.                      453700      
005886     ADD  2                       TO WS-CONT-R3-LIN.              453800      
005887*                                                                 453900      
005888/=====================                                            454000      
005889 24400-REPORTE-X-NODO.                                            454100      
005890*=====================                                            454200      
005891     MOVE WS-RS3-LLAVE            TO WS-RS3-LLAVE-ANT.            454300      
005892     MOVE LOW-VALUES              TO OPER-APLI-ACUM.              454400      
005893     PERFORM 24410-PROCESA-REP-X-NODO  UNTIL RS3-REP-ENLACE       454500      
005894                                          OR FIN-LOG-SORT3.       454600      
005895     PERFORM 24420-TOTAL-REP-X-NODO.                              454700      
005896*                                                                 454800      
005897*========================                                         454900      
005898 24410-PROCESA-REP-X-NODO.                                        455000      
005899*========================                                         455100      
005900     IF WS-RS3-NOD-ORI  NOT = WS-RS3-NOD-ORI-ANT                  455200      
005901        PERFORM 24430-CORTE-X-NODO                                455300      
005902        MOVE 90                   TO WS-CONT-R4-LIN               455400      
005903     ELSE                                                         455500      
005904     IF WS-RS3-STA-NAME NOT = WS-RS3-STA-NAME-ANT                 455600      
005905        PERFORM 24440-CORTE-X-STA-NAME.                           455700      
005906*                                                                 455800      
005907     PERFORM 24450-ACUMULA VARYING PTER-CORTE-WS FROM 1 BY 1      455900      
005908                             UNTIL PTER-CORTE-WS > 3.             456000      
005909*                                                                 456100      
005910     PERFORM 24600-LEE-SORT3.                                     456200      
005911*                                                                 456300      
005912*======================                                           456400      
005913 24420-TOTAL-REP-X-NODO.                                          456500      
005914*======================                                           456600      
005915     PERFORM 24430-CORTE-X-NODO                                   456700      
005916     MOVE 3                       TO PTER-CORTE-WS.               456800      
005917     PERFORM 24460-IMPRIME-TOTALES.                               456900      
005918     MOVE WS-RS3-TIPO-REP         TO WS-RS3-TIPO-REP-ANT.         457000      
005919*                                                                 457100      
005920*==================                                               457200      
005921 24430-CORTE-X-NODO.                                              457300      
005922*==================                                               457400      
005923     PERFORM 24440-CORTE-X-STA-NAME                               457500      
005924     MOVE 2                       TO PTER-CORTE-WS.               457600      
005925     PERFORM 24460-IMPRIME-TOTALES.                               457700      
005926     MOVE WS-RS3-NOD-ORI          TO WS-RS3-NOD-ORI-ANT.          457800      
005927*                                                                 457900      
005928*======================                                           458000      
005929 24440-CORTE-X-STA-NAME.                                          458100      
005930*======================                                           458200      
005931     MOVE 1                       TO PTER-CORTE-WS.               458300      
005932     MOVE WS-RS3-STA-NAME-ANT     TO WS-R4D1-STA-NAME.            458400      
005933     PERFORM 24460-IMPRIME-TOTALES.                               458500      
005934     MOVE WS-RS3-STA-NAME         TO WS-RS3-STA-NAME-ANT.         458600      
005935*                                                                 458700      
005936/==============                                                   458800      
005937 24450-ACUMULA.                                                   458900      
005938*==============                                                   459000      
005939     IF RS3-COD-SER-CARGO                                         459100      
005940        ADD 1             TO NUM-CARGOS-ACUM(PTER-CORTE-WS)       459200      
005941        ADD WS-RS3-IMP-TRN                                        459300      
005942                          TO IMP-CARGOS-ACUM(PTER-CORTE-WS)       459400      
005943     ELSE                                                         459500      
005944     IF RS3-COD-SER-ABONO                                         459600      
005945        ADD 1             TO NUM-ABONOS-ACUM(PTER-CORTE-WS)       459700      
005946        ADD WS-RS3-IMP-TRN                                        459800      
005947                          TO IMP-ABONOS-ACUM(PTER-CORTE-WS)       459900      
005948     ELSE                                                         460000      
005949     IF RS3-COD-SER-ELIMCARGO                                     460100      
005950        SUBTRACT 1      FROM NUM-CARGOS-ACUM(PTER-CORTE-WS)       460200      
005951        SUBTRACT WS-RS3-IMP-TRN                                   460300      
005952                        FROM IMP-CARGOS-ACUM(PTER-CORTE-WS)       460400      
005953     ELSE                                                         460500      
005954        SUBTRACT 1      FROM NUM-ABONOS-ACUM(PTER-CORTE-WS)       460600      
005955        SUBTRACT WS-RS3-IMP-TRN                                   460700      
005956                        FROM IMP-ABONOS-ACUM(PTER-CORTE-WS).      460800      
005957*                                                                 460900      
005958*======================                                           461000      
005959 24460-IMPRIME-TOTALES.                                           461100      
005960*======================                                           461200      
005961     IF NOT CONT-R4-LIN-60                                        461300      
005962        PERFORM 24470-ENCABEZADO-REP4.                            461400      
005963*                                                                 461500      
005964     MOVE WS-R4D1-LEY    (PTER-CORTE-WS) TO R4D1-LEY.             461600      
005965     MOVE NUM-CARGOS-ACUM(PTER-CORTE-WS) TO R4D1-NCAR.            461700      
005966     MOVE IMP-CARGOS-ACUM(PTER-CORTE-WS) TO R4D1-ICAR.            461800      
005967     MOVE NUM-ABONOS-ACUM(PTER-CORTE-WS) TO R4D1-NABO.            461900      
005968     MOVE IMP-ABONOS-ACUM(PTER-CORTE-WS) TO R4D1-IABO.            462000      
005969***  WRITE LREP4 FROM REP4-DET1    BEFORE 2.                      462100      
005970     ADD 2                        TO WS-CONT-R4-LIN.              462200      
005971*                                                                 462300      
005972     MOVE LOW-VALUES              TO ACUMULADOR(PTER-CORTE-WS).   462400      
005973*                                                                 462500      
005974*=====================                                            462600      
005975 24470-ENCABEZADO-REP4.                                           462700      
005976*=====================                                            462800      
005977     ADD  1                       TO WS-CONT-R4-HOJAS.            462900      
005978     MOVE WS-CONT-R4-HOJAS        TO RT1-PAG.                     463000      
005979     MOVE WS-RT1-REP4             TO RT1-TITULO.                  463100      
005980     MOVE WS-RT2-REP4             TO RT2-TITULO.                  463200      
005981     MOVE SPACES                  TO RT4-NMONEDA.                 463300      
005982     MOVE ZEROS                   TO RT4-MONEDA.                  463400      
005983***  WRITE LREP4 FROM REP0-DET5    BEFORE PAGE.                   463500      
005984***  WRITE LREP4 FROM REP-TIT1     BEFORE 1.                      463600      
005985***  WRITE LREP4 FROM REP-TIT2     BEFORE 1.                      463700      
005986***  WRITE LREP4 FROM REP-TIT3     BEFORE 2.                      463800      
005987***  WRITE LREP4 FROM REP-TIT4     BEFORE 2.                      463900      
005988***  WRITE LREP4 FROM REP4-SUB1    BEFORE 2.                      464000      
005989***  WRITE LREP4 FROM REP4-SUB2    BEFORE 1.                      464100      
005990***  WRITE LREP4 FROM REP4-SUB3    BEFORE 2.                      464200      
005991     MOVE 11                      TO WS-CONT-R4-LIN.              464300      
005992*                                                                 464400      
005993/==================                                               464500      
005994 24500-ENLACE-S028.                                               464600      
005995*==================                                               464700      
005996     OPEN OUTPUT TRANSMISION.                                     464800      
005997     PERFORM 24510-REG-CONTROL-S028.                              464900      
005998     MOVE LOW-VALUES              TO OPER-APLI-ACUM.              465000      
005999     MOVE 1                       TO WS-CONT-TERM.                465100      
006000     MOVE WS-RS3-LLAVE            TO WS-RS3-LLAVE-ANT.            465200      
006001     PERFORM 24540-MUEVE-LLAVE.                                   465300      
006002     PERFORM 24520-PROCESA-ENLACE-S028 UNTIL FIN-LOG-SORT3.       465400      
006003     PERFORM 24530-GRABA-S028.                                    465500      
006004     PERFORM 24560-REG-TRAILER-S028.                              465600      
006005     CLOSE TRANSMISION     WITH LOCK.                             465700      
006006*                                                                 465800      
006007*==========================                                       465900      
006008 24510-REG-CONTROL-S028.                                          466000      
006009*==========================                                       466100      
006010     MOVE LOW-VALUES              TO WS-REG-CTL-S028              466200      
006011     MOVE LOW-VALUES              TO WS-REG-TRA-S028              466300      
006012     MOVE LOW-VALUES              TO WS-REG-MOV-S028.             466400      
006013     MOVE "HR"                    TO WS-R028-CHEA                 466500      
006014     MOVE WS-RG-FEC-PROC-HOY      TO WS-R028-FPRO                 466600      
006015     MOVE WS-DATE                 TO WS-R028-FREAL                466700      
006016     MOVE WS-TIMER                TO WS-R028-HREAL                466800      
006017      MOVE "S151"                  TO WS-R028-CSIS                466900      
006018     MOVE "COMP.NAL.P.REG"        TO WS-R028-NSIS                 467000      
006019     MOVE ZEROS                   TO WS-R028-CFOR                 467100      
006020     WRITE REG-E01-TRANSMISION  FROM WS-REG-CTL-S028              467200      
006021      INVALID KEY                                                 467300      
006022*ASM       DISPLAY "010105 02  " WS-PROGRAMA,                     467400      
006023*ASM               "ESP. INSUF. CONTROL DEL S028"                 467500      
006024           MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ  467510      
006025           MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ    467520      
006026           MOVE 010105                 TO CODIGO-LJ               467530      
006027           MOVE "ESPACIO INSUF. EN CONTROL DEL S028"              467540      
006028                                       TO WLI-TEXTO-LJ, TEXTO-LJ  467550      
006029           PERFORM      000-030-IMPRIME-MENSAJE                   467560      
006030           SET MYSELF(STATUS)     TO -1.                          467600      
006031*                                                                 467700      
006032/==========================                                       467800      
006033 24520-PROCESA-ENLACE-S028.                                       467900      
006034     IF WS-RS3-SISTEMA  NOT = WS-RS3-SISTEMA-ANT OR               468000      
006035        WS-RS3-SUCURSAL NOT = WS-RS3-SUCURSAL-ANT                 468100      
006036        MOVE 1                    TO WS-CONT-TERM                 468200      
006037     ELSE                                                         468300      
006038     IF WS-RS3-TERMINAL NOT = WS-RS3-TERMINAL-ANT                 468400      
006039        ADD  1                    TO WS-CONT-TERM.                468500      
006040*                                                                 468600      
006041     IF WS-RS3-LLAVE    NOT = WS-RS3-LLAVE-ANT                    468700      
006042        PERFORM 24530-GRABA-S028                                  468800      
006043        PERFORM 24540-MUEVE-LLAVE                                 468900      
006044        MOVE WS-RS3-LLAVE         TO WS-RS3-LLAVE-ANT.            469000      
006045*                                                                 469100      
006046     PERFORM 24550-ACUMULA.                                       469200      
006047     PERFORM 24600-LEE-SORT3.                                     469300      
006048*                                                                 469400      
006049*=================                                                469500      
006050 24530-GRABA-S028.                                                469600      
006051*=================                                                469700      
006052     MOVE NUM-CARGOS-ACUM(1)      TO WS-R028-NCAR.                469800      
006053     MOVE IMP-CARGOS-ACUM(1)      TO WS-R028-ICAR.                469900      
006054     MOVE NUM-ABONOS-ACUM(1)      TO WS-R028-NABO.                470000      
006055     MOVE IMP-ABONOS-ACUM(1)      TO WS-R028-IABO.                470100      
006056     WRITE REG-E01-TRANSMISION  FROM WS-REG-MOV-S028              470200      
006057      INVALID KEY                                                 470300      
006058*ASM       DISPLAY "010105 02  " WS-PROGRAMA,                     470400      
006059*ASM               " ESP. INSUF. MOV DEL S028"                    470500      
006060           MOVE SPACES                 TO WLI-TEXTO-LJ, TEXTO-LJ  470510      
006061           MOVE "I"                    TO WLI-TIPO-LJ, TIPO-LJ    470520      
006062           MOVE 010105                 TO CODIGO-LJ               470530      
006063           MOVE "ESPACIO INSUF. EN MOV DEL S028"                  470540      
006064                                       TO WLI-TEXTO-LJ, TEXTO-LJ  470550      
006065           PERFORM      000-030-IMPRIME-MENSAJE                   470560      
006066           SET MYSELF(STATUS)     TO -1.                          470600      
006067     ADD 1                        TO WS-R028-TREG.                470700      
006068     ADD WS-R028-ICAR             TO WS-R028-TCAR.                470800      
006069     ADD WS-R028-IABO             TO WS-R028-TABO.                470900      
006070     MOVE LOW-VALUES              TO OPER-APLI-ACUM.              471000      
006071*                                                                 471100      
006072/==================                                               471200      
006073 24540-MUEVE-LLAVE.                                               471300      
006074*==================                                               471400      
006075     MOVE LOW-VALUES              TO WS-REG-MOV-S028.             471500      
006076     MOVE WS-RS3-SISTEMA          TO WS-R028-SISTEMA.             471600      
006077     MOVE WS-RS3-SUCURSAL         TO WS-R028-SUC.                 471700      
006078     MOVE WS-RS3-MONEDA           TO WS-R028-MON.                 471800      
006079     MOVE WS-CONT-TERM            TO WS-R028-TERM.                471900      
006080*                                                                 472000      
006081*==============                                                   472100      
006082 24550-ACUMULA.                                                   472200      
006083*==============                                                   472300      
006084     IF RS3-COD-SER-CARGO                                         472400      
006085        ADD 1                     TO NUM-CARGOS-ACUM(1)           472500      
006086        ADD WS-RS3-IMP-TRN        TO IMP-CARGOS-ACUM(1)           472600      
006087     ELSE                                                         472700      
006088     IF RS3-COD-SER-ABONO                                         472800      
006089        ADD 1                     TO NUM-ABONOS-ACUM(1)           472900      
006090        ADD WS-RS3-IMP-TRN        TO IMP-ABONOS-ACUM(1)           473000      
006091     ELSE                                                         473100      
006092     IF RS3-COD-SER-ELIMCARGO                                     473200      
006093        SUBTRACT 1              FROM NUM-CARGOS-ACUM(1)           473300      
006094        SUBTRACT WS-RS3-IMP-TRN FROM IMP-CARGOS-ACUM(1)           473400      
006095     ELSE                                                         473500      
006096     IF RS3-COD-SER-ELIMABONO                                     473600      
006097        SUBTRACT 1              FROM NUM-ABONOS-ACUM(1)           473700      
006098        SUBTRACT WS-RS3-IMP-TRN FROM IMP-ABONOS-ACUM(1).          473800      
006099*                                                                 473900      
006100*=======================                                          474000      
006101 24560-REG-TRAILER-S028.                                          474100      
006102*=======================                                          474200      
006103     MOVE "TR"                    TO WS-R028-CTRA.                474300      
006104     WRITE REG-E01-TRANSMISION  FROM WS-REG-TRA-S028              474400      
006105      INVALID KEY                                                 474500      
006106*ASM          DISPLAY "010105 02  " WS-PROGRAMA,                  474600      
006107*ASM                  "ESP. INSUF. TRAILER DEL S028"              474700      
006108              MOVE SPACES              TO WLI-TEXTO-LJ, TEXTO-LJ  474710      
006109              MOVE "I"                 TO WLI-TIPO-LJ, TIPO-LJ    474720      
006110              MOVE 010105              TO CODIGO-LJ               474730      
006111              MOVE "ESPACIO INSUF. EN TRAILER DEL S028"           474740      
006112                                       TO WLI-TEXTO-LJ, TEXTO-LJ  474750      
006113              PERFORM      000-030-IMPRIME-MENSAJE                474760      
006114              SET MYSELF(STATUS)  TO -1.                          474800      
006115*                                                                 474900      
006116/================                                                 475000      
006117 24600-LEE-SORT3.                                                 475100      
006118*================                                                 475200      
006119     RETURN SORT3-TRANSMISION   INTO WS-REG-SORT3                 475300      
006120      AT END                                                      475400      
006121          MOVE 1                  TO WS-FIN-LOG-SORT3.            475500      
006122     IF NOT FIN-LOG-SORT3                                         475600      
006123        ADD 1                     TO WS-CONT-REG.                 475700      
006124*                                                                 475800      
006125*=========================                                        475900      
006126 24900-EXIT-SECTION. EXIT.                                        476000      
006127*=========================                                        476100      
006128*                                                                 476200      
006129/=========================================                        476300      
006130*ASM 25100-ENVIA-A-SORT4              SECTION.                    476400      
006131*ASM 25100-CONTROL.                                               476500      
006132*=========================================                        476600      
006133*ASM OPEN INPUT  PENDIENTES.                                      476700      
006134*ASM MOVE ZEROS                   TO  WS-FIN-LOG-SORT4.           476800      
006135*ASM PERFORM 25120-LEE-PENDIENTES 2 TIMES.                        476900      
006136*ASM PERFORM 25110-ENVIA-LOG-SORT4 UNTIL FIN-LOG-SORT4.           477000      
006137*ASM CLOSE PENDIENTES      WITH LOCK.                             477100      
006138*ASM GO TO 25190-EXIT-SECTION.                                    477200      
006139*                                                                 477300      
006140*======================                                           477400      
006141*ASM 25110-ENVIA-LOG-SORT4.                                       477500      
006142*======================                                           477600      
006143*ASM MOVE SPACES                  TO REG-SORT4.                   477700      
006144*ASM MOVE WS-RDI-APL-ORI          TO WS-RS4-APL-ORI.              477800      
006145*ASM MOVE WS-RDI-NOM-EST          TO WS-RS4-STA-NAME.             477900      
006146*ASM MOVE WS-RDI-FEC-CON          TO WS-RS4-FEC-CON.              478000      
006147*ASM MOVE WS-REG-DET-INFOICA      TO WS-RS4-RESTO.                478100      
006148*ASM RELEASE REG-SORT4          FROM WS-REG-SORT4.                478200      
006149*ASM PERFORM 25120-LEE-PENDIENTES.                                478300      
006150*                                                                 478400      
006151*====================                                             478500      
006152*ASM 25120-LEE-PENDIENTES.                                        478600      
006153*====================                                             478700      
006154*ASM READ PENDIENTES            INTO WS-REG-DET-INFOICA           478800      
006155*ASM  AT END                                                      478900      
006156*ASM      MOVE 1                  TO  WS-FIN-LOG-SORT4.           479000      
006157*                                                                 479100      
006158*=========================                                        479200      
006159*ASM 25190-EXIT-SECTION. EXIT.                                    479300      
006160*=========================                                        479400      
006161*                                                                 479500      
006162/=========================================                        479600      
006163*ASM 25200-REGRESA-SORT4              SECTION.                    479700      
006164*ASM 25200-CONTROL.                                               479800      
006165*=========================================                        479900      
006166*ASM MOVE ZEROS                   TO WS-FIN-LOG-SORT4.            480000      
006167*ASM MOVE 90                      TO WS-CONT-R5-LIN.              480100      
006168*ASM PERFORM 25260-LEE-SORT4.                                     480200      
006169*ASM MOVE WS-RS4-LLAVE            TO WS-RS4-LLAVE-ANT.            480300      
006170*ASM PERFORM 25210-PROCESA-SORT4 UNTIL  FIN-LOG-SORT4.            480400      
006171*ASM PERFORM 25220-TOTAL-REP5.                                    480500      
006172*ASM GO TO 25290-EXIT-SECTION.                                    480600      
006173*                                                                 480700      
006174*====================                                             480800      
006175*ASM 25210-PROCESA-SORT4.                                         480900      
006176*====================                                             481000      
006177*ASM IF WS-RS4-FEC-CON NOT = WS-RS4-FEC-CON-ANT                   481100      
006178*ASM    PERFORM 25225-CORTE-X-FEC                                 481200      
006179*ASM    MOVE 90                   TO WS-CONT-R5-LIN               481300      
006180*ASM ELSE                                                         481400      
006181*ASM IF WS-RS4-APL-ORI NOT = WS-RS4-APL-ORI-ANT                   481500      
006182*ASM    PERFORM 25230-CORTE-X-APL-ORI                             481600      
006183*ASM    PERFORM 25282-ENCABPEND-PARTE2.                           481700      
006184*                                                                 481800      
006185*ASM PERFORM 25240-SUMA-CARGO-ABONO VARYING PTER-CORTE-WS         481900      
006186*ASM                      FROM 1 BY 1 UNTIL PTER-CORTE-WS > 3.    482000      
006187*ASM PERFORM 25250-IMPRIME-PENDIENTE.                             482100      
006188*ASM PERFORM 25260-LEE-SORT4.                                     482200      
006189*                                                                 482300      
006190*==================                                               482400      
006191*ASM 25220-TOTAL-REP5.                                            482500      
006192*==================                                               482600      
006193*ASM PERFORM 25225-CORTE-X-FEC.                                   482700      
006194*ASM MOVE 3                       TO PTER-CORTE-WS.               482800      
006195*ASM PERFORM 25270-IMPRIME-TOTALES.                               482900      
006196*                                                                 483000      
006197/==================                                               483100      
006198*ASM 25225-CORTE-X-FEC.                                           483200      
006199*==================                                               483300      
006200*ASM PERFORM 25230-CORTE-X-APL-ORI.                               483400      
006201*ASM MOVE 2                       TO PTER-CORTE-WS.               483500      
006202*ASM MOVE WS-RS4-FEC-CON-ANT      TO WS-R5D2-FEC-CON.             483600      
006203*ASM PERFORM 25270-IMPRIME-TOTALES.                               483700      
006204*ASM MOVE WS-RS4-FEC-CON          TO WS-RS4-FEC-CON-ANT.          483800      
006205*                                                                 483900      
006206*======================                                           484000      
006207*ASM 25230-CORTE-X-APL-ORI.                                       484100      
006208*======================                                           484200      
006209*ASM MOVE 1                       TO PTER-CORTE-WS.               484300      
006210***  WRITE LREP5                 FROM REP0-DET5 BEFORE 1.         484400      
006211*ASM ADD 1                        TO WS-CONT-R5-LIN.              484500      
006212*ASM PERFORM 25270-IMPRIME-TOTALES.                               484600      
006213*ASM MOVE WS-RS4-APL-ORI          TO WS-RS4-APL-ORI-ANT.          484700      
006214*                                                                 484800      
006215*=======================                                          484900      
006216*ASM 25240-SUMA-CARGO-ABONO.                                      485000      
006217*=======================                                          485100      
006218*ASM IF RDI-COD-SER-CARGO                                         485200      
006219*ASM    ADD 1             TO NUM-CARGOS-ACUM(PTER-CORTE-WS)       485300      
006220*ASM    ADD WS-RDI-IMP-TRN                                        485400      
006221*ASM                      TO IMP-CARGOS-ACUM(PTER-CORTE-WS)       485500      
006222*ASM ELSE                                                         485600      
006223*ASM IF RDI-COD-SER-ABONO                                         485700      
006224*ASM    ADD 1             TO NUM-ABONOS-ACUM(PTER-CORTE-WS)       485800      
006225*ASM    ADD WS-RDI-IMP-TRN                                        485900      
006226*ASM                      TO IMP-ABONOS-ACUM(PTER-CORTE-WS)       486000      
006227*ASM ELSE                                                         486100      
006228*ASM IF RDI-COD-SER-ELIMCARGO                                     486200      
006229*ASM    SUBTRACT 1      FROM NUM-CARGOS-ACUM(PTER-CORTE-WS)       486300      
006230*ASM    SUBTRACT WS-RDI-IMP-TRN                                   486400      
006231*ASM                    FROM IMP-CARGOS-ACUM(PTER-CORTE-WS)       486500      
006232*ASM ELSE                                                         486600      
006233*    .. RDI-COD-SER-ELIMABONO                                     486700      
006234*ASM    SUBTRACT 1      FROM NUM-ABONOS-ACUM(PTER-CORTE-WS)       486800      
006235*ASM    SUBTRACT WS-RDI-IMP-TRN                                   486900      
006236*ASM                    FROM IMP-ABONOS-ACUM(PTER-CORTE-WS).      487000      
006237*                                                                 487100      
006238/==========================                                       487200      
006239*ASM 25250-IMPRIME-PENDIENTE.                                     487300      
006240*==========================                                       487400      
006241*ASM IF NOT CONT-R5-LIN-60                                        487500      
006242*ASM   PERFORM 25280-ENCABEZADO-PENDIENTE.                        487600      
006243*                                                                 487700      
006244*ASM MOVE SPACES                  TO REP5-DET1.                   487800      
006245*ASM MOVE WS-RDI-APL-DES          TO APL-ORI-WS.                  487900      
006246*ASM MOVE APL-ORI-WS              TO WS-APL-ORI-PTE.              488000      
006247*ASM PERFORM 29000-BUSCA-SIST.                                    488100      
006248*ASM IF WS-SISTEMA-LG = SPACES                                    488200      
006249*ASM    MOVE APL-ORI-WS           TO WS-SIS-CR.                   488300      
006250*ASM MOVE WS-SISTEMA-CR           TO R5D1-APL-DES.                488400      
006251*ASM IF RDI-CSI-DES-VAL                                           488500      
006252*ASM    MOVE ABR-CSI-TC(WS-RDI-CSI-DES)                           488600      
006253*ASM                              TO R5D1-CSI-DES                 488700      
006254*ASM ELSE                                                         488800      
006255*ASM    MOVE WS-RDI-CSI-DES       TO R5D1-CSI-DES.                488900      
006256*ASM MOVE WS-RDI-NOM-EST          TO R5D1-STA-NAME.               489000      
006257*ASM MOVE WS-RDI-CTA-DES          TO WS-PARTE-CTADES.             489100      
006258*ASM MOVE WS-PARTE-SUC            TO WS-SUC-CTADES.               489200      
006259*ASM MOVE WS-PARTE-CTA            TO WS-CTA-CTADES.               489300      
006260*ASM MOVE WS-EDIT-CTADES          TO R5D1-CTA-DES.                489400      
006261*ASM MOVE WS-RDI-IMP-TRN          TO IMPORTE-ENTERO.              489500      
006262*ASM IF   RDI-COD-SER-CARGO      OR RDI-COD-SER-ABONO             489600      
006263*ASM OR   RDI-COD-SER-ELIMCARGO  OR RDI-COD-SER-ELIMABONO         489700      
006264*ASM    MOVE TAB-DNC(WS-RDI-COD-SER)                              489800      
006265*ASM                              TO R5D1-TIPO-MOV                489900      
006266*ASM ELSE                                                         490000      
006267*ASM    MOVE WS-RDI-COD-SER       TO R5D1-TIPO-MOV.               490100      
006268*ASM MOVE IMPORTE-ENTERO          TO R5D1-IMPORTE.                490200      
006269*ASM MOVE WS-RDI-CVE-AUT          TO R5D1-N-AUTOR.                490300      
006270*ASM MOVE WS-RDI-MON-TRN          TO R5D1-MONEDA.                 490400      
006271*ASM MOVE WS-RDI-FEC-CON          TO R5D1-FEC-CON.                490500      
006272*ASM MOVE WS-RDI-HOR-GEN-HHMM     TO R5D1-HORA-GEN.               490600      
006273*ASM MOVE WS-RDI-CTA-ACC          TO R5D1-CTA-ACC.                490700      
006274*ASM MOVE WS-RDI-SUB-SER          TO R5D1-SUB-SER.                490800      
006275***  WRITE LREP5 FROM REP5-DET1    BEFORE 1.                      490900      
006276*ASM ADD 1                        TO WS-CONT-R5-LIN.              491000      
006277*                                                                 491100      
006278/================                                                 491200      
006279*ASM 25260-LEE-SORT4.                                             491300      
006280*================                                                 491400      
006281*ASM RETURN SORT4-PENDIENTES    INTO WS-REG-SORT4                 491500      
006282*ASM  AT END                                                      491600      
006283*ASM      MOVE 1                  TO WS-FIN-LOG-SORT4.            491700      
006284*                                                                 491800      
006285*ASM IF NOT FIN-LOG-SORT4                                         491900      
006286*ASM    MOVE WS-RS4-RESTO         TO WS-REG-DET-INFOICA.          492000      
006287*                                                                 492100      
006288*======================                                           492200      
006289*ASM 25270-IMPRIME-TOTALES.                                       492300      
006290*======================                                           492400      
006291*ASM IF NOT CONT-R5-LIN-63                                        492500      
006292*ASM    PERFORM 25280-ENCABEZADO-PENDIENTE.                       492600      
006293*                                                                 492700      
006294*ASM MOVE WS-R5D2-LEY    (PTER-CORTE-WS) TO R5D2-LEY.             492800      
006295*ASM MOVE NUM-CARGOS-ACUM(PTER-CORTE-WS) TO R5D2-NCAR.            492900      
006296*ASM MOVE IMP-CARGOS-ACUM(PTER-CORTE-WS) TO R5D2-ICAR.            493000      
006297*ASM MOVE NUM-ABONOS-ACUM(PTER-CORTE-WS) TO R5D2-NABO.            493100      
006298*ASM MOVE IMP-ABONOS-ACUM(PTER-CORTE-WS) TO R5D2-IABO.            493200      
006299***  WRITE LREP5 FROM REP5-DET2    BEFORE 2.                      493300      
006300*ASM ADD 2                        TO WS-CONT-R5-LIN.              493400      
006301*                                                                 493500      
006302*ASM MOVE LOW-VALUES              TO ACUMULADOR(PTER-CORTE-WS).   493600      
006303*                                                                 493700      
006304/===========================                                      493800      
006305*ASM 25280-ENCABEZADO-PENDIENTE.                                  493900      
006306*===========================                                      494000      
006307*ASM  PERFORM 25281-ENCABPEND-PARTE1.                             494100      
006308*ASM  PERFORM 25282-ENCABPEND-PARTE2.                             494200      
006309*                                                                 494300      
006310*=======================                                          494400      
006311*ASM 25281-ENCABPEND-PARTE1.                                      494500      
006312*=======================                                          494600      
006313*ASM ADD  1                       TO WS-CONT-R5-HOJAS.            494700      
006314*ASM MOVE WS-CONT-R5-HOJAS        TO RT1-PAG.                     494800      
006315*ASM MOVE WS-RT1-REP5             TO RT1-TITULO.                  494900      
006316*ASM MOVE WS-RT2-REP5             TO RT2-TITULO.                  495000      
006317*ASM MOVE SPACES                  TO RT4-NMONEDA.                 495100      
006318*ASM MOVE ZEROS                   TO RT4-MONEDA.                  495200      
006319*ASM MOVE WS-RS4-FEC-CON-ANT      TO R5S1-FEC-CONT.               495300      
006320***  WRITE LREP5 FROM REP0-DET5    BEFORE PAGE.                   495400      
006321***  WRITE LREP5 FROM REP-TIT1     BEFORE 1.                      495500      
006322***  WRITE LREP5 FROM REP-TIT2     BEFORE 1.                      495600      
006323***  WRITE LREP5 FROM REP-TIT3     BEFORE 2.                      495700      
006324***  WRITE LREP5 FROM REP-TIT4     BEFORE 2.                      495800      
006325***  WRITE LREP5 FROM REP5-SUB1    BEFORE 2.                      495900      
006326***  WRITE LREP5 FROM REP5-SUB3    BEFORE 1.                      496000      
006327***  WRITE LREP5 FROM REP5-SUB4    BEFORE 1.                      496100      
006328***  WRITE LREP5 FROM REP5-SUB5    BEFORE 2.                      496200      
006329*ASM MOVE 12                      TO WS-CONT-R5-LIN.              496300      
006330*                                                                 496400      
006331*======================                                           496500      
006332*ASM 25282-ENCABPEND-PARTE2.                                      496600      
006333*======================                                           496700      
006334*ASM MOVE WS-RS4-APL-ORI-ANT      TO APL-ORI-WS.                  496800      
006335*ASM MOVE APL-ORI-WS              TO WS-APL-ORI-PTE.              496900      
006336*ASM PERFORM 29000-BUSCA-SIST.                                    497000      
006337*ASM IF WS-SISTEMA-LG = SPACES                                    497100      
006338*ASM    MOVE APL-ORI-WS           TO WS-SIS-CR     WS-SIS-LG.     497200      
006339*ASM MOVE WS-SISTEMA-LG           TO R5S2-SISTEMA.                497300      
006340*ASM MOVE WS-SIS-CR               TO WS-R5D2-APL-ORI.             497400      
006341***  WRITE LREP5 FROM REP5-SUB2    BEFORE 2.                      497500      
006342*ASM ADD  2                       TO WS-CONT-R5-LIN.              497600      
006343*                                                                 497700      
006344*=========================                                        497800      
006345*ASM 25290-EXIT-SECTION. EXIT.                                    497900      
006346*=========================                                        498000      
006347*                                                                 498100      
006348/=========================================                        498200      
006349 26100-ENVIA-A-SORT5              SECTION.                        498300      
006350 26100-CONTROL.                                                   498400      
006351*=========================================                        498500      
006352     OPEN INPUT  LOG-ERROR.                                       498600      
006353     MOVE ZEROS                   TO  WS-FIN-LOG-SORT5.           498700      
006354     PERFORM 26120-LEE-LOG-ERROR.                                 498800      
006355     PERFORM 26110-ENVIA-LOG-SORT5 UNTIL FIN-LOG-SORT5.           498900      
006356      CLOSE LOG-ERROR       WITH SAVE.                            499000      
006357     GO TO 26190-EXIT-SECTION.                                    499100      
006358*                                                                 499200      
006359*======================                                           499300      
006360 26110-ENVIA-LOG-SORT5.                                           499400      
006361*======================                                           499500      
006362     MOVE SPACES                  TO REG-SORT5.                   499600      
006363     MOVE WS-RDI-CSI-ORI          TO WS-RS5-CSI-ORI.              499700      
006364     MOVE WS-RDI-APL-ORI          TO WS-RS5-APL-ORI.              499800      
006365     MOVE WS-RDI-CSI-DES          TO WS-RS5-CSI-DES.              499900      
006366     MOVE WS-RDI-APL-DES          TO WS-RS5-APL-DES.              500000      
006367     MOVE WS-RDI-NOM-EST          TO WS-RS5-STA-NAME.             500100      
006368     MOVE WS-RDI-CVE-AUT          TO WS-RS5-N-AUTOR.              500200      
006369     MOVE WS-RDI-MON-TRN          TO WS-RS5-CVE-MON.              500300      
006370     MOVE WS-RDI-STA-TRN          TO WS-RS5-STATUS.               500400      
006371     MOVE RE-REG-ERROR            TO WS-RS5-RESTO    .            500500      
006372     MOVE RE-TIPO-ERROR           TO WS-RS5-TIPO-ERROR.           500600      
006373     RELEASE REG-SORT5          FROM WS-REG-SORT5.                500700      
006374     PERFORM 26120-LEE-LOG-ERROR.                                 500800      
006375*                                                                 500900      
006376*====================                                             501000      
006377 26120-LEE-LOG-ERROR.                                             501100      
006378*====================                                             501200      
006379     READ LOG-ERROR                                               501300      
006380      AT END                                                      501400      
006381          MOVE 1                  TO  WS-FIN-LOG-SORT5.           501500      
006382*                                                                 501600      
006383     IF NOT FIN-LOG-SORT5                                         501700      
006384        MOVE RE-REG-ERROR         TO WS-REG-DET-INFOICA.          501800      
006385*                                                                 501900      
006386*=========================                                        502000      
006387 26190-EXIT-SECTION. EXIT.                                        502100      
006388*=========================                                        502200      
006389*                                                                 502300      
006390/=========================================                        502400      
006391 26200-REGRESA-SORT5              SECTION.                        502500      
006392 26200-CONTROL.                                                   502600      
006393*=========================================                        502700      
006394     MOVE ZEROS                   TO WS-FIN-LOG-SORT5.            502800      
006395     MOVE 90                      TO WS-CONT-R2-LIN.              502900      
006396     PERFORM 26240-LEE-SORT5.                                     503000      
006397     MOVE WS-RS5-LLAVE            TO WS-RS5-LLAVE-ANT.            503100      
006398     PERFORM 26210-PROCESA-SORT5 UNTIL  FIN-LOG-SORT5.            503200      
006399     PERFORM 26211-TOTAL-GRAL.                                    503300      
006400     GO TO 26290-EXIT-SECTION.                                    503400      
006401*                                                                 503500      
006402*====================                                             503600      
006403 26210-PROCESA-SORT5.                                             503700      
006404*====================                                             503800      
006405     PERFORM 26230-MUEVE-DETALLE.                                 503900      
006406     IF WS-RS5-TIPO-ERROR = "...DUPLICADO"                        504000      
006407        PERFORM 26231-IMPRIME-DUPLICADOS                          504100      
006408     ELSE                                                         504200      
006409     IF RDI-STA-TRN-ENVIADO OR RDI-STA-TRN-DENEGADO               504300      
006410        PERFORM 26232-IMPRIME-SIN-PAREJA                          504400      
006411     ELSE                                                         504500      
006412        PERFORM 26210-VERIFICA-CORTES-ELIM                        504600      
006413        PERFORM 26233-IMPRIME-ELIMINACION.                        504700      
006414*                                                                 504800      
006415     MOVE SPACES                  TO REP2-DET1.                   504900      
006416     PERFORM 26240-LEE-SORT5.                                     505000      
006417*                                                                 505100      
006418/===========================                                      505200      
006419 26210-VERIFICA-CORTES-ELIM.                                      505300      
006420*===========================                                      505400      
006421*                                                                 505500      
006422     MOVE ZEROS                   TO IND-SW-SUBTIT.               505600      
006423     MOVE ZEROS                   TO PTER-CORTE-WS.               505700      
006424     IF WS-RS5-CVE-MON NOT = WS-RS5-CVE-MON-ANT                   505800      
006425        PERFORM 26212-CORTE-X-MON                                 505900      
006426        MOVE 90                   TO WS-CONT-R2-LIN               506000      
006427     ELSE                                                         506100      
006428     IF WS-RS5-CSI-ORI NOT = WS-RS5-CSI-ORI-ANT                   506200      
006429        PERFORM 26213-CORTE-X-CSI-ORI                             506300      
006430        MOVE 90                   TO WS-CONT-R2-LIN               506400      
006431     ELSE                                                         506500      
006432     IF WS-RS5-APL-ORI NOT = WS-RS5-APL-ORI-ANT                   506600      
006433        PERFORM 26214-CORTE-X-APL-ORI                             506700      
006434     ELSE                                                         506800      
006435     IF WS-RS5-CSI-DES NOT = WS-RS5-CSI-DES-ANT                   506900      
006436        PERFORM 26215-CORTE-X-CSI-DES                             507000      
006437     ELSE                                                         507100      
006438     IF WS-RS5-STATUS  NOT = WS-RS5-STATUS-ANT                    507200      
006439        PERFORM 26216-CORTE-X-STATUS.                             507300      
006440*                                                                 507400      
006441     IF PTER-CORTE-WS > ZEROS                                     507500      
006442        IF NOT CONT-R2-LIN-60                                     507600      
006443           PERFORM 26260-ENCABEZADO-ELIMINA                       507700      
006444        ELSE                                                      507800      
006445        IF SW-SUBTIT                                              507900      
006446           PERFORM 26262-ENCABELIM-PARTE2                         508000      
006447        ELSE                                                      508100      
006448***        WRITE LREP2 FROM REP0-DET5 BEFORE 1                    508200      
006449           ADD 1                  TO WS-CONT-R2-LIN.              508300      
006450*                                                                 508400      
006451     IF RDI-STA-TRN-OPERADO                                       508500      
006452        MOVE 1                    TO WS-AP-OPER-APL               508600      
006453     ELSE                                                         508700      
006454     IF RDI-STA-TRN-APLICADO                                      508800      
006455        MOVE 2                    TO WS-AP-OPER-APL               508900      
006456     ELSE                                                         509000      
006457        MOVE 3                    TO WS-AP-OPER-APL.              509100      
006458*                                                                 509200      
006459     PERFORM 26220-SUMA-CARGO-ABONO-ELIM VARYING                  509300      
006460             PTER-CORTE-WS FROM 1 BY 1 UNTIL PTER-CORTE-WS > 6.   509400      
006461*                                                                 509500      
006462/=================                                                509600      
006463 26211-TOTAL-GRAL.                                                509700      
006464*=================                                                509800      
006465     PERFORM 26212-CORTE-X-MON                                    509900      
006466     MOVE SPACES                  TO R2D3-LEY.                    510000      
006467     MOVE 6                       TO PTER-CORTE-WS.               510100      
006468     MOVE WS-TOT-LEY(PTER-CORTE-WS) TO R2D3-TOT.                  510200      
006469     PERFORM 26250-IMPRIME-TOTALES.                               510300      
006470*                                                                 510400      
006471*==================                                               510500      
006472 26212-CORTE-X-MON.                                               510600      
006473*==================                                               510700      
006474     PERFORM 26213-CORTE-X-CSI-ORI                                510800      
006475     MOVE SPACES                  TO R2D3-LEY.                    510900      
006476     MOVE 5                       TO PTER-CORTE-WS.               511000      
006477     MOVE WS-TOT-LEY(PTER-CORTE-WS) TO R2D3-TOT.                  511100      
006478     MOVE WS-RS5-CVE-MON-ANT      TO R2D3-CVE-MON.                511200      
006479     PERFORM 26250-IMPRIME-TOTALES.                               511300      
006480     MOVE WS-RS5-CVE-MON          TO WS-RS5-CVE-MON-ANT.          511400      
006481*                                                                 511500      
006482*======================                                           511600      
006483 26213-CORTE-X-CSI-ORI.                                           511700      
006484*======================                                           511800      
006485     PERFORM 26214-CORTE-X-APL-ORI                                511900      
006486     MOVE SPACES                  TO R2D3-LEY.                    512000      
006487     MOVE 4                       TO PTER-CORTE-WS.               512100      
006488     MOVE WS-TOT-LEY(PTER-CORTE-WS) TO R2D3-TOT.                  512200      
006489     IF RS5-CSI-ORI-ANT                                           512300      
006490        MOVE NOM-CSI-TC(WS-RS5-CSI-ORI-ANT)                       512400      
006491                                  TO R2D3-CSI-ORI                 512500      
006492     ELSE                                                         512600      
006493        MOVE WS-RS5-CSI-ORI-ANT   TO R2D3-CSI-ORI.                512700      
006494     PERFORM 26250-IMPRIME-TOTALES.                               512800      
006495     MOVE WS-RS5-CSI-ORI          TO WS-RS5-CSI-ORI-ANT.          512900      
006496*                                                                 513000      
006497*======================                                           513100      
006498 26214-CORTE-X-APL-ORI.                                           513200      
006499*======================                                           513300      
006500     PERFORM 26215-CORTE-X-CSI-DES                                513400      
006501     MOVE SPACES                  TO R2D3-LEY.                    513500      
006502     MOVE 3                       TO PTER-CORTE-WS.               513600      
006503     MOVE WS-TOT-LEY(PTER-CORTE-WS) TO R2D3-TOT.                  513700      
006504     MOVE WS-RS5-APL-ORI-ANT      TO APL-ORI-WS.                  513800      
006505     MOVE APL-ORI-WS              TO WS-APL-ORI-PTE.              513900      
006506     PERFORM 29000-BUSCA-SIST.                                    514000      
006507     IF WS-SISTEMA-LG = SPACES                                    514100      
006508        MOVE APL-ORI-WS           TO WS-SIS-CR.                   514200      
006509     MOVE WS-SISTEMA-CR           TO R2D3-APL-ORI.                514300      
006510     PERFORM 26250-IMPRIME-TOTALES.                               514400      
006511     MOVE WS-RS5-APL-ORI          TO WS-RS5-APL-ORI-ANT.          514500      
006512*                                                                 514600      
006513/======================                                           514700      
006514 26215-CORTE-X-CSI-DES.                                           514800      
006515*======================                                           514900      
006516     PERFORM 26216-CORTE-X-STATUS                                 515000      
006517     MOVE SPACES                  TO R2D3-LEY.                    515100      
006518     MOVE 2                       TO PTER-CORTE-WS.               515200      
006519     MOVE WS-TOT-LEY(PTER-CORTE-WS) TO R2D3-TOT.                  515300      
006520     IF RS5-CSI-DES-ANT                                           515400      
006521        MOVE NOM-CSI-TC(WS-RS5-CSI-DES-ANT)                       515500      
006522                                  TO R2D3-CSI-DES                 515600      
006523     ELSE                                                         515700      
006524        MOVE WS-RS5-CSI-DES-ANT   TO R2D3-CSI-DES.                515800      
006525     PERFORM 26250-IMPRIME-TOTALES.                               515900      
006526     MOVE WS-RS5-CSI-DES          TO WS-RS5-CSI-DES-ANT.          516000      
006527*                                                                 516100      
006528*======================                                           516200      
006529 26216-CORTE-X-STATUS.                                            516300      
006530*======================                                           516400      
006531     MOVE SPACES                  TO R2D3-LEY.                    516500      
006532     MOVE 1                       TO PTER-CORTE-WS.               516600      
006533     MOVE WS-TOT-LEY(PTER-CORTE-WS) TO R2D3-TOT.                  516700      
006534     IF WS-RS5-STATUS-ANT > 0 AND < 6                             516800      
006535        MOVE WS-STA-LEY(WS-RS5-STATUS-ANT)                        516900      
006536                                  TO R2D3-LEY-STATUS              517000      
006537     ELSE                                                         517100      
006538        MOVE WS-STA-LEY(6)        TO R2D3-LEY-STATUS.             517200      
006539     MOVE WS-RS5-STATUS-ANT       TO R2D3-STATUS.                 517300      
006540*                                                                 517400      
006541     IF NOT CONT-R2-LIN-60                                        517500      
006542        MOVE 1                    TO IND-SW-SUBTIT                517600      
006543        PERFORM 26261-ENCABELIM-PARTE1.                           517700      
006544*                                                                 517800      
006545     PERFORM 26250-IMPRIME-TOTALES.                               517900      
006546     MOVE WS-RS5-STATUS           TO WS-RS5-STATUS-ANT.           518000      
006547*                                                                 518100      
006548/============================                                     518200      
006549 26220-SUMA-CARGO-ABONO-ELIM.                                     518300      
006550*============================                                     518400      
006551     IF RDI-COD-SER-CARGO                                         518500      
006552        ADD 1             TO NUM-CARGOS-AELIM(PTER-CORTE-WS)      518600      
006553        ADD WS-RDI-IMP-TRN                                        518700      
006554                          TO IMP-CARGOS-AELIM(PTER-CORTE-WS)      518800      
006555     ELSE                                                         518900      
006556     IF RDI-COD-SER-ABONO                                         519000      
006557        ADD 1             TO NUM-ABONOS-AELIM(PTER-CORTE-WS)      519100      
006558        ADD WS-RDI-IMP-TRN                                        519200      
006559                          TO IMP-ABONOS-AELIM(PTER-CORTE-WS)      519300      
006560     ELSE                                                         519400      
006561     IF RDI-COD-SER-ELIMCARGO                                     519500      
006562        SUBTRACT 1      FROM NUM-CARGOS-AELIM(PTER-CORTE-WS)      519600      
006563        SUBTRACT WS-RDI-IMP-TRN                                   519700      
006564                        FROM IMP-CARGOS-AELIM(PTER-CORTE-WS)      519800      
006565     ELSE                                                         519900      
006566     IF RDI-COD-SER-ELIMABONO                                     520000      
006567        SUBTRACT 1      FROM NUM-ABONOS-AELIM(PTER-CORTE-WS)      520100      
006568        SUBTRACT WS-RDI-IMP-TRN                                   520200      
006569                        FROM IMP-ABONOS-AELIM(PTER-CORTE-WS)      520300      
006570     ELSE                                                         520400      
006571        ADD 1             TO NUM-CARABO-AELIM(PTER-CORTE-WS)      520500      
006572        ADD WS-RDI-IMP-TRN                                        520600      
006573                          TO IMP-CARABO-AELIM(PTER-CORTE-WS).     520700      
006574*                                                                 520800      
006575/====================                                             520900      
006576 26230-MUEVE-DETALLE.                                             521000      
006577*====================                                             521100      
006578     MOVE 1                       TO SI-ELIMINA-WS.               521200      
006579     MOVE WS-RDI-APL-ORI          TO APL-ORI-WS.                  521300      
006580     MOVE APL-ORI-WS              TO WS-APL-ORI-PTE.              521400      
006581     PERFORM 29000-BUSCA-SIST.                                    521500      
006582     IF WS-SISTEMA-LG = SPACES                                    521600      
006583        MOVE APL-ORI-WS           TO WS-SIS-CR.                   521700      
006584     MOVE WS-SISTEMA-CR           TO R2D1-APL-ORI.                521800      
006585     MOVE WS-RDI-APL-DES          TO APL-ORI-WS.                  521900      
006586     MOVE APL-ORI-WS              TO WS-APL-ORI-PTE.              522000      
006587     PERFORM 29000-BUSCA-SIST.                                    522100      
006588     IF WS-SISTEMA-LG = SPACES                                    522200      
006589        MOVE APL-ORI-WS           TO WS-SIS-CR.                   522300      
006590     MOVE WS-SISTEMA-CR           TO R2D1-APL-DES.                522400      
006591     IF RDI-CSI-ORI-VAL                                           522500      
006592        MOVE ABR-CSI-TC(WS-RDI-CSI-ORI)                           522600      
006593                                  TO R2D1-CSI-ORI                 522700      
006594     ELSE                                                         522800      
006595        MOVE WS-RDI-CSI-ORI       TO R2D1-CSI-ORI.                522900      
006596     IF RDI-CSI-DES-VAL                                           523000      
006597        MOVE ABR-CSI-TC(WS-RDI-CSI-DES)                           523100      
006598                                  TO R2D1-CSI-DES                 523200      
006599     ELSE                                                         523300      
006600        MOVE WS-RDI-CSI-DES       TO R2D1-CSI-DES.                523400      
006601     MOVE WS-RDI-NOM-EST          TO R2D1-STA-NAME.               523500      
006602     MOVE WS-RDI-CTA-DES          TO WS-PARTE-CTADES.             523600      
006603     MOVE WS-PARTE-SUC            TO WS-SUC-CTADES.               523700      
006604     MOVE WS-PARTE-CTA            TO WS-CTA-CTADES.               523800      
006605     MOVE WS-EDIT-CTADES          TO R2D1-CTA-DES.                523900      
006606     MOVE WS-RDI-IMP-TRN          TO IMPORTE-ENTERO.              524000      
006607     IF   RDI-COD-SER-CARGO      OR RDI-COD-SER-ABONO             524100      
006608     OR   RDI-COD-SER-ELIMCARGO  OR RDI-COD-SER-ELIMABONO         524200      
006609        MOVE TAB-DNC(WS-RDI-COD-SER)                              524300      
006610                                  TO R2D1-TIPO-MOV                524400      
006611     ELSE                                                         524500      
006612        MOVE WS-RDI-COD-SER       TO R2D1-TIPO-MOV.               524600      
006613     MOVE IMPORTE-ENTERO          TO R2D1-IMPORTE.                524700      
006614     MOVE WS-RDI-STA-TRN          TO R2D1-STATUS.                 524800      
006615     MOVE WS-RDI-CVE-AUT          TO R2D1-N-AUTOR.                524900      
006616     MOVE WS-RDI-MON-TRN          TO R2D1-MONEDA.                 525000      
006617     MOVE WS-RDI-FEC-CON          TO R2D1-FEC-CON.                525100      
006618     MOVE WS-RS5-TIPO-ERROR       TO R2D1-ERRORES.                525200      
006619     MOVE WS-RDI-HOR-GEN-HH       TO R2D1-HH-GEN.                 525300      
006620     MOVE WS-RDI-HOR-GEN-MM       TO R2D1-MM-GEN.                 525350      
006621     MOVE WS-RDI-FEC-GEN          TO R2D2-FEC-GEN.                525400      
006622     MOVE WS-RDI-CTA-ACC          TO R2D2-CTA-ACC.                525500      
006623     MOVE WS-RDI-REF-OPE          TO R2D2-REF-OPE.                525600      
006624     MOVE WS-RDI-SUB-SER          TO R2D2-SUB-SER.                525700      
006625*                                                                 525800      
006626/=========================                                        525900      
006627 26231-IMPRIME-DUPLICADOS.                                        526000      
006628*=========================                                        526100      
006629     IF NOT CONT-R6-LIN-60                                        526200      
006630       PERFORM 26270-ENCABEZADO-ELIMINA.                          526300      
006631***  WRITE LREP6 FROM REP2-DET1    BEFORE 1.                      526400      
006632***  WRITE LREP6 FROM REP2-DET2    BEFORE 2.                      526500      
006633     ADD 3                        TO WS-CONT-R6-LIN.              526600      
006634*                                                                 526700      
006635*=========================                                        526800      
006636 26232-IMPRIME-SIN-PAREJA.                                        526900      
006637*=========================                                        527000      
006638     IF NOT CONT-R7-LIN-60                                        527100      
006639       PERFORM 26280-ENCABEZADO-ELIMINA.                          527200      
006640***  WRITE LREP7 FROM REP2-DET1    BEFORE 1.                      527300      
006641***  WRITE LREP7 FROM REP2-DET2    BEFORE 2.                      527400      
006642     ADD 3                        TO WS-CONT-R7-LIN.              527500      
006643*                                                                 527600      
006644*==========================                                       527700      
006645 26233-IMPRIME-ELIMINACION.                                       527800      
006646*==========================                                       527900      
006647     IF NOT CONT-R2-LIN-60                                        528000      
006648       PERFORM 26260-ENCABEZADO-ELIMINA.                          528100      
006649***  WRITE LREP2 FROM REP2-DET1    BEFORE 1.                      528200      
006650***  WRITE LREP2 FROM REP2-DET2    BEFORE 2.                      528300      
006651     ADD 3                        TO WS-CONT-R2-LIN.              528400      
006652*                                                                 528500      
006653/================                                                 528600      
006654 26240-LEE-SORT5.                                                 528700      
006655*================                                                 528800      
006656     RETURN SORT5-ERRORES       INTO WS-REG-SORT5                 528900      
006657      AT END                                                      529000      
006658          MOVE 1                  TO WS-FIN-LOG-SORT5.            529100      
006659*                                                                 529200      
006660     IF NOT FIN-LOG-SORT5                                         529300      
006661        MOVE WS-RS5-RESTO         TO WS-REG-DET-INFOICA.          529400      
006662*                                                                 529500      
006663*======================                                           529600      
006664 26250-IMPRIME-TOTALES.                                           529700      
006665*======================                                           529800      
006666     IF NOT CONT-R2-LIN-63                                        529900      
006667        PERFORM 26261-ENCABELIM-PARTE1                            530000      
006668        MOVE 1                    TO IND-SW-SUBTIT.               530100      
006669*                                                                 530200      
006670     IF PTER-CORTE-WS = 1                                         530300      
006671***     WRITE LREP2 FROM REP2-SUB5 BEFORE 1                       530400      
006672***     WRITE LREP2 FROM REP2-SUB6 BEFORE 2                       530500      
006673        ADD 3                     TO WS-CONT-R2-LIN               530600      
006674     ELSE                                                         530700      
006675     IF PTER-CORTE-WS = 5                                         530800      
006676***     MOVE ALL "*"               TO LREP2                       530900      
006677***     WRITE LREP2                BEFORE 2                       531000      
006678        ADD 2                     TO WS-CONT-R2-LIN               531100      
006679     ELSE                                                         531200      
006680     IF PTER-CORTE-WS = 4                                         531300      
006681***     WRITE LREP2 FROM REP2-SUB6 BEFORE 2                       531400      
006682        ADD 2                     TO WS-CONT-R2-LIN.              531500      
006683     MOVE NUM-CARGOS-AELIM(PTER-CORTE-WS) TO R2D3-NC.             531600      
006684     MOVE IMP-CARGOS-AELIM(PTER-CORTE-WS) TO R2D3-IC.             531700      
006685     MOVE NUM-ABONOS-AELIM(PTER-CORTE-WS) TO R2D3-NA.             531800      
006686     MOVE IMP-ABONOS-AELIM(PTER-CORTE-WS) TO R2D3-IA.             531900      
006687     MOVE NUM-CARABO-AELIM(PTER-CORTE-WS) TO R2D3-NCA.            532000      
006688     MOVE IMP-CARABO-AELIM(PTER-CORTE-WS) TO R2D3-ICA.            532100      
006689***  WRITE LREP2 FROM REP2-DET3    BEFORE 2.                      532200      
006690     ADD 2                        TO WS-CONT-R2-LIN.              532300      
006691*                                                                 532400      
006692     MOVE LOW-VALUES              TO ACUM-ELIMINA(PTER-CORTE-WS). 532500      
006693*                                                                 532600      
006694/========================                                         532700      
006695 26260-ENCABEZADO-ELIMINA.                                        532800      
006696*========================                                         532900      
006697     PERFORM 26261-ENCABELIM-PARTE1.                              533000      
006698     PERFORM 26262-ENCABELIM-PARTE2.                              533100      
006699*                                                                 533200      
006700*=======================                                          533300      
006701 26261-ENCABELIM-PARTE1.                                          533400      
006702*=======================                                          533500      
006703     ADD  1                       TO WS-CONT-R2-HOJAS.            533600      
006704     MOVE WS-CONT-R2-HOJAS        TO RT1-PAG.                     533700      
006705     MOVE WS-RT1-REP2             TO RT1-TITULO.                  533800      
006706     MOVE WS-RT2-REP2             TO RT2-TITULO.                  533900      
006707     MOVE "   MONEDA: "           TO RT4-NMONEDA.                 534000      
006708     MOVE WS-RS5-CVE-MON-ANT      TO RT4-MONEDA.                  534100      
006709***  WRITE LREP2 FROM REP0-DET5    BEFORE PAGE.                   534200      
006710***  WRITE LREP2 FROM REP-TIT1     BEFORE 1.                      534300      
006711***  WRITE LREP2 FROM REP-TIT2     BEFORE 1.                      534400      
006712***  WRITE LREP2 FROM REP-TIT3     BEFORE 2.                      534500      
006713***  WRITE LREP2 FROM REP-TIT4     BEFORE 2.                      534600      
006714     MOVE 6                       TO WS-CONT-R2-LIN.              534700      
006715*                                                                 534800      
006716*======================                                           534900      
006717 26262-ENCABELIM-PARTE2.                                          535000      
006718*======================                                           535100      
006719***  WRITE LREP2 FROM REP2-SUB1    BEFORE 1.                      535200      
006720***  WRITE LREP2 FROM REP2-SUB2    BEFORE 1.                      535300      
006721***  WRITE LREP2 FROM REP2-SUB3    BEFORE 1.                      535400      
006722***  WRITE LREP2 FROM REP2-SUB4    BEFORE 2.                      535500      
006723     ADD  5                       TO WS-CONT-R2-LIN.              535600      
006724*                                                                 535700      
006725/========================                                         535800      
006726 26270-ENCABEZADO-ELIMINA.                                        535900      
006727*========================                                         536000      
006728     PERFORM 26271-ENCABELIM-PARTE1.                              536100      
006729     PERFORM 26272-ENCABELIM-PARTE2.                              536200      
006730*                                                                 536300      
006731*=======================                                          536400      
006732 26271-ENCABELIM-PARTE1.                                          536500      
006733*=======================                                          536600      
006734     ADD  1                       TO WS-CONT-R6-HOJAS.            536700      
006735     MOVE WS-CONT-R6-HOJAS        TO RT1-PAG.                     536800      
006736     MOVE WS-RT1-REP6             TO RT1-TITULO.                  536900      
006737     MOVE WS-RT2-REP6             TO RT2-TITULO.                  537000      
006738     MOVE "   MONEDA: "           TO RT4-NMONEDA.                 537100      
006739     MOVE WS-RS5-CVE-MON-ANT      TO RT4-MONEDA.                  537200      
006740***  WRITE LREP6 FROM REP0-DET5    BEFORE PAGE.                   537300      
006741***  WRITE LREP6 FROM REP-TIT1     BEFORE 1.                      537400      
006742***  WRITE LREP6 FROM REP-TIT2     BEFORE 1.                      537500      
006743***  WRITE LREP6 FROM REP-TIT3     BEFORE 2.                      537600      
006744***  WRITE LREP6 FROM REP-TIT4     BEFORE 2.                      537700      
006745     MOVE 6                       TO WS-CONT-R6-LIN.              537800      
006746*                                                                 537900      
006747*======================                                           538000      
006748 26272-ENCABELIM-PARTE2.                                          538100      
006749*======================                                           538200      
006750***  WRITE LREP6 FROM REP2-SUB1    BEFORE 1.                      538300      
006751***  WRITE LREP6 FROM REP2-SUB2    BEFORE 1.                      538400      
006752***  WRITE LREP6 FROM REP2-SUB3    BEFORE 1.                      538500      
006753***  WRITE LREP6 FROM REP2-SUB4    BEFORE 2.                      538600      
006754     ADD  5                       TO WS-CONT-R6-LIN.              538700      
006755*                                                                 538800      
006756/========================                                         538900      
006757 26280-ENCABEZADO-ELIMINA.                                        539000      
006758*========================                                         539100      
006759     PERFORM 26281-ENCABELIM-PARTE1.                              539200      
006760     PERFORM 26282-ENCABELIM-PARTE2.                              539300      
006761*                                                                 539400      
006762*=======================                                          539500      
006763 26281-ENCABELIM-PARTE1.                                          539600      
006764*=======================                                          539700      
006765     ADD  1                       TO WS-CONT-R7-HOJAS.            539800      
006766     MOVE WS-CONT-R7-HOJAS        TO RT1-PAG.                     539900      
006767     MOVE WS-RT1-REP7             TO RT1-TITULO.                  540000      
006768     MOVE WS-RT2-REP7             TO RT2-TITULO.                  540100      
006769     MOVE "   MONEDA: "           TO RT4-NMONEDA.                 540200      
006770     MOVE WS-RS5-CVE-MON-ANT      TO RT4-MONEDA.                  540300      
006771***  WRITE LREP7 FROM REP0-DET5    BEFORE PAGE.                   540400      
006772***  WRITE LREP7 FROM REP-TIT1     BEFORE 1.                      540500      
006773***  WRITE LREP7 FROM REP-TIT2     BEFORE 1.                      540600      
006774***  WRITE LREP7 FROM REP-TIT3     BEFORE 2.                      540700      
006775***  WRITE LREP7 FROM REP-TIT4     BEFORE 2.                      540800      
006776     MOVE 6                       TO WS-CONT-R7-LIN.              540900      
006777*                                                                 541000      
006778*======================                                           541100      
006779 26282-ENCABELIM-PARTE2.                                          541200      
006780*======================                                           541300      
006781***  WRITE LREP7 FROM REP2-SUB1    BEFORE 1.                      541400      
006782***  WRITE LREP7 FROM REP2-SUB2    BEFORE 1.                      541500      
006783***  WRITE LREP7 FROM REP2-SUB3    BEFORE 1.                      541600      
006784***  WRITE LREP7 FROM REP2-SUB4    BEFORE 2.                      541700      
006785     ADD  5                       TO WS-CONT-R7-LIN.              541800      
006786*                                                                 541900      
006787 26290-EXIT-SECTION. EXIT.                                        541990      
006788                                                                  541995      
006789 A2K-CPY-SECTION SECTION.                                         542500      
006790*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
006791*   COPY "S151/CRONOS2K/CPY/PD".                                  542600      
006792** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
006793** Unisys has defined for CRONOS2K project                     ** 000200      
006794** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
006795***************************************************************** 000400      
006796***************************************************************** 000600      
006797** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
006798** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
006799** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
006800** date MMDDCCAA, which is returned into the variable          ** 001000      
006801** A2K-FEC-MDCA-001.                                           ** 001100      
006802***************************************************************** 001200      
006803                                                                  001300      
006804 A2K-ACCEPT-TODAYS-DATE.                                          001400      
006805        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
006806*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
006807        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
006808        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
006809        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
006810        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
006811        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
006812                                                                  002200      
006813 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
006814        EXIT.                                                     002240      
006815                                                                  002500      
006816****************************************************************  002600      
006817** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
006818**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
006819**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
006820**baseyear to add the century to the year part.               **  003000      
006821**INPUT is A2K-FEC-AMD-001                                    **  003100      
006822**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
006823****************************************************************  003300      
006824                                                                  003400      
006825 A2K-CONV-AMD-TO-CAMD.                                            003500      
006826         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
006827         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
006828         IF A2K-FEC-AMD-001 = 0                                   003720      
006829            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
006830         ELSE                                                     003741      
006831          IF A2K-FEC-AMD-001 = 999999                             003742      
006832             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
006833         ELSE                                                     003760      
006834         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
006835                 A2K-OBTAIN-CENTURY-EXIT                          003900      
006836         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
006837         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
006838         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
006839         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
006840                                                                  004400      
006841 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
006842         EXIT.                                                    004600      
006843                                                                  004700      
006844******************************************************************004800      
006845**A2K-CONV-MDA-TO-MDCA.                                         **004900      
006846**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
006847** an eight digit format as MMDDCCAA. It use a                  **005100      
006848** baseyear to add century to the yaer.                         **005200      
006849** INPUT is A2K-FEC-MDA-001                                     **005300      
006850** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
006851                                                                  005500      
006852 A2K-CONV-MDA-TO-MDCA.                                            005600      
006853     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
006854     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
006855     IF A2K-FEC-MDA-001 = 0                                       005820      
006856        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
006857     ELSE                                                         005845      
006858      IF A2K-FEC-MDA-001 = 999999                                 005850      
006859         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
006860     ELSE                                                         005860      
006861     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
006862             A2K-OBTAIN-CENTURY-EXIT                              006000      
006863     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
006864     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
006865     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
006866     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
006867                                                                  006500      
006868 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
006869     EXIT.                                                        006700      
006870                                                                  006800      
006871***************************************************************** 006900      
006872**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
006873**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
006874**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
006875**baseyear to add century to the year.                         ** 007300      
006876**INPUT is A2K-FEC-DMA-001                                     ** 007400      
006877**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
006878                                                                  007600      
006879 A2K-CONV-DMA-TO-DMCA.                                            007700      
006880       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
006881       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
006882       IF  A2K-FEC-DMA-001   = 0                                  007920      
006883          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
006884       ELSE                                                       007945      
006885        IF A2K-FEC-DMA-001 = 999999                               007950      
006886          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
006887       ELSE                                                       007960      
006888       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
006889               A2K-OBTAIN-CENTURY-EXIT                            008100      
006890       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
006891       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
006892       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
006893       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
006894                                                                  008600      
006895 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
006896       EXIT.                                                      008800      
006897                                                                  008900      
006898***************************************************************** 009000      
006899** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
006900** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
006901** a 6 digit format as AAMMDD.                                 ** 009300      
006902** It simply removes the century information in the output     ** 009400      
006903** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
006904** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
006905                                                                  009700      
006906 A2K-CONV-CAMD-TO-AMD.                                            009800      
006907     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
006908     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
006909     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
006910     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
006911                                                                  010300      
006912 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
006913      EXIT.                                                       010500      
006914                                                                  010600      
006915******************************************************************010700      
006916******************************************************************010800      
006917** A2K-CONV-MDCA-TO-MDA.                                        **010900      
006918** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
006919** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
006920** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
006921** INPUT is A2K-FEC-MDCA-001                                    **011300      
006922** OUTPUT is A2K-FEC-MDA-001                                    **011400      
006923                                                                  011500      
006924 A2K-CONV-MDCA-TO-MDA.                                            011600      
006925     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
006926     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
006927     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
006928     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
006929                                                                  012100      
006930 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
006931      EXIT.                                                       012300      
006932                                                                  012400      
006933******************************************************************012500      
006934***************************************************************** 012600      
006935** A2K-CONV-DMCA-TO-DMA.                                        **012700      
006936** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
006937** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
006938** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
006939** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
006940** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
006941                                                                  013300      
006942 A2K-CONV-DMCA-TO-DMA.                                            013400      
006943     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
006944     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
006945     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
006946     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
006947                                                                  013900      
006948 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
006949      EXIT.                                                       014100      
006950                                                                  014200      
006951***************************************************************** 014300      
006952 A2K-CONV-MDCA-TO-CAMD.                                           014400      
006953      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
006954      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
006955      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
006956      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
006957      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
006958 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
006959      EXIT.                                                       015100      
006960***************************************************************** 015200      
006961** This paragraph adds century to an year field which is 9(02) ** 015300      
006962** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
006963** Output is A2K-FEC-CCAA-001.                                 ** 015600      
006964***************************************************************** 015700      
006965 A2K-CONV-AA-TO-CCAA.                                             015800      
006966      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
006967      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
006968              A2K-OBTAIN-CENTURY-EXIT.                            016100      
006969      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
006970 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
006971      EXIT.                                                       016400      
006972***************************************************************** 016500      
006973** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
006974** format.                                                     ** 016700      
006975** Input is A2K-FEC-DMCA-001.                                  ** 016800      
006976** Output is A2K-FEC-CAMD-001.                                 ** 016900      
006977***************************************************************** 017000      
006978 A2K-CONV-DMCA-TO-CAMD.                                           017100      
006979      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
006980      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
006981      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
006982      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
006983      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
006984 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
006985      EXIT.                                                       017800      
006986***************************************************************** 017900      
006987** This paragraph desides the Century to be added depending    ** 018000      
006988** on the base year.                                           ** 018100      
006989** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
006990** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
006991***************************************************************** 018400      
006992 A2K-OBTAIN-CENTURY.                                              018500      
006993      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
006994          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
006995      ELSE                                                        018800      
006996          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
006997 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
006998      EXIT.                                                       019100      
006999                                                                  019200      
007000***************************************************************** 019300      
007001** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
007002**  Format                                                     ** 019500      
007003** Input Is A2K-FEC-CAMD-001                                   ** 019600      
007004** Output Is A2K-FEC-DMCA-001                                  ** 019700      
007005***************************************************************** 019800      
007006 A2K-CONV-CAMD-TO-DMCA.                                           019900      
007007      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
007008      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
007009      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
007010      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
007011      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
007012                                                                  020500      
007013 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
007014      EXIT.                                                       020700      
007015                                                                  020800      
007016******************************************************************020900      
007017******************************************************************021000      
007018 A2K-CONV-AM-TO-CAM.                                              021100      
007019      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
007020      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
007021      IF A2K-FEC-AM-001 = 0                                       021220      
007022         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
007023      ELSE                                                        021245      
007024      IF A2K-FEC-AM-001 = 9999                                    021250      
007025         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
007026      ELSE                                                        021260      
007027      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
007028      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
007029      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
007030              A2K-OBTAIN-CENTURY-EXIT                             021600      
007031      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
007032                                                                  021800      
007033 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
007034      EXIT.                                                       022000      
007035                                                                  022100      
007036******************************************************************022200      
007037******************************************************************022300      
007038 A2K-CONV-CAM-TO-AM.                                              022400      
007039      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
007040      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
007041      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
007042                                                                  022800      
007043 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
007044   EXIT.                                                          023000      
007045                                                                  023100      
007046                                                                  023200      
007047                                                                  023500      
007048*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
007049 A2K-CPY-EXIT-PARA.                                               542700      
007050     EXIT.                                                        542800      
