000001$SET LIST XREF  LISTOMITTED                                       000100      
000002*$SET TADS                                                        000200      
000003***********************************************************       000220      
000004* RECOMPILACION POR ELL UPGRADE DEL MCP A 55              *       000222      
000005* 20141205 15MTP001 MJGRG                                 *       000224      
000006***********************************************************       000226      
000007 IDENTIFICATION DIVISION.                                         000300      
000008 ENVIRONMENT DIVISION.                                            000400      
000009 INPUT-OUTPUT SECTION.                                            000500      
000010 FILE-CONTROL.                                                    000600      
000011      SELECT LOG151                 ASSIGN TO DISK.               000700      
000012      SELECT A02-MOVS151            ASSIGN TO DISK.               000800      
000013      SELECT A03-MOV-GCE            ASSIGN TO DISK.               000810      
000014      SELECT DESS151                ASSIGN TO DISK                000900      
000015                                    ACCESS MODE IS RANDOM         001000      
000016                                    ACTUAL KEY  IS W77-NUM-REG.   001100      
000017      SELECT SMOVS151               ASSIGN TO SORT DISK.          001200      
000018      SELECT SALDOS151              ASSIGN TO DISK.               001300      
000019      SELECT E01-INTELLI            ASSIGN TO DISK.               001400      
000020      SELECT E02-INTELLI-UNI        ASSIGN TO DISK.               001500      
000021 DATA DIVISION.                                                   001600      
000022 FILE SECTION.                                                    001700      
000023 FD LOG151                                                        001800      
000024    VALUE OF BUFFERS IS 1                                         001900      
000025    VALUE OF TITLE   IS WKS-TIT-LOG151                            002000      
000026    BLOCK CONTAINS 144 RECORDS.                                   002100      
000027*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000028*  COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS.".                     002200      
000029                                                                  000100      
000030******************************************************************000200      
000031**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
000032**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
000033**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
000034******************************************************************000600      
000035                                                                  000700      
000036 01 A00-R00-HDR-MOV .                                             000800      
000037    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
000038    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
000039    02 FILLER                          PIC  X(08).                001100      
000040    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
000041    02 FILLER                          PIC  X(430).               001300      
000042                                                                  001400      
000043 01 A00-R01-REGMOV .                                              001500      
000044    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
000045    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
000046    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
000047                                                                  001900      
000048    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
000049    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
000050                                       PIC  9(04)      COMP.      002200      
000051    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
000052                                       PIC  9(04)      COMP.      002400      
000053                                                                  002500      
000054    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000055    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
000056                                       PIC  9(02)      COMP.      002800      
000057    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
000058                                       PIC  9(02)      COMP.      003000      
000059    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
000060    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
000061                                       A00-R01-SERVICIO-ALERTA.   003060      
000062       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
000063       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
000064    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
000065    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
000066    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
000067                                       PIC  9(04)      COMP.      003420      
000068    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
000069    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
000070                                       PIC  9(04)      COMP.      003520      
000071    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
000072    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
000073    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
000074                                       PIC  9(02)      COMP.      003900      
000075                                                                  004000      
000076    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
000077    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
000078       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
000079          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
000080          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
000081          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
000082          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
000083          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
000084          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
000085          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
000086                                                                  005100      
000087    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
000088       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
000089       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
000090       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
000091       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
000092       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
000093       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
000094       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
000095                                                                  006000      
000096       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
000097       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
000098       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
000099       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
000100       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
000101       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
000102       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
000103                                                                  006800      
000104       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
000105       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
000106       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
000107       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
000108       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
000109       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
000110       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
000111                                                                  007600      
000112       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
000113       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
000114       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
000115       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
000116       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
000117       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
000118       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
000119                                                                  008400      
000120       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
000121       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
000122       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
000123       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
000124       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
000125       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
000126       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
000127                                                                  009200      
000128    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
000129    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
000130    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
000131    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
000132    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
000133    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
000134       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
000135    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
000136    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
000137    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
000138    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
000139    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
000140    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
000141    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
000142    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
000143       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
000144       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
000145    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
000146    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
000147    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
000148    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
000149    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
000150    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
000151    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
000152    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
000153    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
000154    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
000155    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
000156    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
000157    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
000158    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
000159                                       PIC X(10).                 012600      
000160    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
000161       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
000162       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
000163    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
000164    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
000165    03 A00-R01-FILIAL                  PIC  X(05).                013200      
000166    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
000167       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
000168       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
000169                                                                  013300      
000170    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
000171    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
000172                                       PIC  X(09).                013600      
000173    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
000174                                       PIC  9(18)      COMP.      013800      
000175    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
000176    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
000177                                       PIC  X(9).                 014100      
000178    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
000179    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
000180                                       PIC  X(05).                014400      
000181    03 A00-R01-NIO                     PIC  X(16).                014500      
000182    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
000183    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
000184    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
000185       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
000186    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
000187    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
000188       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
000189    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
000190    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
000191    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
000192    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
000193    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
000194    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
000195                                       PIC  X(04).                015900      
000196    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
000197    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
000198    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
000199                                       PIC  9(04)      COMP.      016300      
000200    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
000201    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
000202    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
000203    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
000204    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
000205                                                                  016900      
000206    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
000207    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
000208       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
000209    03 A00-R01-FILXAPL                 PIC X(165).                017300      
000210                                                                  017400      
000211    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
000212       05 FILLER                       PIC X(96).                 017510      
000213       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
000214       05 FILLER                       PIC X(67).                 017700      
000215                                                                  017702      
000216    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
000217       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
000218       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
000219       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
000220       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
000221       06 WKS-MOV-FILS084              PIC X(154).                017714      
000222                                                                  017800      
000223    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
000224       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
000225       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
000226       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
000227       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
000228       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
000229       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
000230       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
000231       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
000232       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018160      
000233       05 FILLER                       PIC X(62).                 018170      
000234       05 A00-R01-CTE-087              PIC X(07).                 018210      
000235       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
000236          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
000237          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
000238          07 FILLER                    PIC X(01).                 018281      
000239       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
000240       05 FILLER                       PIC X(61).                 018400      
000241                                                                  018500      
000242    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
000243       05 FILLER                       PIC  X(96).                018610      
000244       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
000245       05 FILLER                       PIC  X(65).                018630      
000246                                                                  018640      
000247    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
000248       05 A00-R01-FORMATO0             PIC  9(02).                018700      
000249       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
000250       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
000251       05 FILLER                       PIC  X(141).               018910      
000252                                                                  019100      
000253    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
000254       05 A00-R01-FORMATO1             PIC  9(02).                019300      
000255       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
000256       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
000257       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
000258       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
000259       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
000260       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
000261       05 A00-R01-ENTSAL               PIC  X(01).                020000      
000262       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
000263       05 FILLER                       PIC  X(69).                020200      
000264                                                                  020300      
000265    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
000266       05 A00-R01-FORMATO2             PIC  9(02).                020500      
000267       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
000268       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
000269       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
000270       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
000271       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
000272       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
000273       05 FILLER                       PIC  X(77).                021200      
000274                                                                  021300      
000275    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
000276       05 A00-R01-FORMATO3             PIC  9(02).                021500      
000277       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
000278       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
000279       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
000280       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
000281       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
000282       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
000283       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
000284       05 FILLER                       PIC  X(69).                022300      
000285                                                                  022400      
000286    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
000287       05 A00-R01-FORMATO4             PIC  9(02).                022600      
000288       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
000289       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
000290       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
000291       05 A00-R01-RFCFT04              PIC  X(13).                023000      
000292       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
000293       05 A00-R01-DIRECCION            PIC  X(40).                023200      
000294       05 FILLER                       PIC  X(85).                023300      
000295                                                                  023400      
000296    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
000297       05 A00-R01-COBERTURA            PIC  X(01).                023408      
000298       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
000299       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
000300       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
000301       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
000302       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
000303       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
000304       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
000305       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
000306       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
000307       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
000308       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
000309       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
000310       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
000311       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
000312       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
000313       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
000314       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
000315       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
000316       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
000317       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
000318       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
000319       05 FILLER                       PIC  X(05).                023492      
000320                                                                  023497      
000321    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
000322       05 A00-R01-4CEROS               PIC  9(04).                023600      
000323       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
000324       05 FILLER                       PIC  X(157).               023800      
000325                                                                  023900      
000326    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
000327       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
000328        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
000329       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
000330       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
000331       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
000332       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
000333       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
000334       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
000335       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
000336       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
000337       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
000338       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
000339       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
000340       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
000341       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
000342       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
000343       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
000344       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
000345       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
000346       05 A00-R01-FILLER               PIC  X(41).                025850      
000347       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
000348       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
000349       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
000350       05 A00-R01-INDPAGO              PIC  9(01).                026200      
000351       05 FILLER                       PIC  X(01).                026210      
000352       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
000353       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
000354       05 FILLER                       PIC  X(52).                026300      
000355                                                                  026400      
000356    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
000357       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
000358       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
000359       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
000360       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
000361       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
000362       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
000363       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
000364       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
000365       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
000366       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
000367       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
000368       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
000369       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
000370          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
000371          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
000372       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
000373       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
000374          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
000375       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
000376          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
000377       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
000378          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
000379       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
000380          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
000381       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
000382          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
000383       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
000384          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
000385       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
000386          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
000387       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
000388          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
000389       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
000390          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
000391       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
000392          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
000393          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
000394       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
000395       05 FILLER                       PIC X(01).                 030101      
000396       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
000397       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
000398       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
000399       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
000400       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
000401       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
000402       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
000403       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
000404          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
000405       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
000406       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
000407       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
000408       05 FILLER                       PIC X(14).                 030700      
000409                                                                  030800      
000410    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
000411       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
000412       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
000413       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
000414       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
000415       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
000416       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
000417       05 A00-R01-151-CITI             PIC  9(02)     COMP.       031520      
000418       05 A00-R01-151-IND-BNE          PIC  9(02)     COMP.       031540      
000419       05 FILLER                       PIC  X(140).               031600      
000420                                                                  031700      
000421    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
000422       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
000423       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
000424       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
000425       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
000426       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
000427       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
000428       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
000429       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
000430       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
000431       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
000432          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
000433          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
000434          07 FILLER                    PIC  X(08).                032740      
000435       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
000436       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
000437       05 A00-R01-NOMORD               PIC  X(30).                033000      
000438       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
000439       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
000440       05 A00-R01-REF-CECO             PIC  X(07).                033500      
000441       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
000442       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
000443          A00-R01-NUM-ORD-PAGO.                                   033800      
000444          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
000445          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
000446                                                                  034100      
000447    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
000448       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
000449       05 A00-R01-RFC-S501             PIC  X(13).                034160      
000450       05 FILLER                       PIC  X(151).               034180      
000451                                                                  034190      
000452    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
000453       05 A00-R01-DATOS-S701           PIC X(116).                034300      
000454       05 A00-R01-PAG-SERV             REDEFINES                  034400      
000455                                       A00-R01-DATOS-S701.        034500      
000456          07 A00-R01-ID                PIC X(30).                 034600      
000457          07 A00-R01-FECREC            PIC 9(06).                 034700      
000458          07 A00-R01-REF1              PIC X(20).                 034800      
000459          07 A00-R01-REF2              PIC X(20).                 034900      
000460          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
000461          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
000462                                       A00-R01-TIPOPAGO.          035200      
000463             09 A00-R01-ESTAB          PIC 9(04).                 035300      
000464             09 A00-R01-SEQ            PIC 9(02).                 035400      
000465          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
000466          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
000467          07 A00-R01-EBPP              PIC 9(03).                 035700      
000468          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
000469          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
000470          07 FILLER                    PIC X(01).                 035728      
000471          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
000472          07 FILLER                    PIC X(18).                 035760      
000473       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
000474                                       A00-R01-DATOS-S701.        035900      
000475          07 A00-R01-RFC               PIC X(13).                 036000      
000476          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
000477          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
000478          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
000479          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
000480          07 FILLER                    PIC X(85).                 036200      
000481       05 FILLER                       PIC X(49).                 036300      
000482                                                                  036400      
000483    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
000484       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
000485       05 A00-R01-CTA-S702             PIC X(40).                 036700      
000486       05 FILLER                       PIC X(113).                036710      
000487                                                                  036720      
000488    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
000489       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
000490       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
000491       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
000492       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
000493       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
000494       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
000495       05 FILLER                       PIC X(72).                 036800      
000496                                                                  036810      
000497                                                                  036820      
000498    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
000499       05 A00-R01-TRUI-S711.                                      036915      
000500          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
000501          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
000502          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
000503           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
000504          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
000505       05 A00-R01-MICR-S711.                                      036945      
000506          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
000507          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
000508          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
000509          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
000510          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
000511          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
000512          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
000513          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
000514       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
000515       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
000516       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
000517       05 A00-R01-FIL-S711             PIC X(05).                 036965      
000518       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
000519       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
000520       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
000521                                                                  036990      
000522    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
000523       05 A00-R01-RFC-502              PIC  X(13).                037100      
000524       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
000525          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
000526          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
000527          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
000528          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
000529          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
000530          07 FILLER                    PIC  9(01) COMP.           037650      
000531       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
000532       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
000533       05 FILLER                       PIC  X(06).                038680      
000534                                                                  038682      
000535    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
000536       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
000537       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
000538       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
000539       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
000540       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
000541       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
000542       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
000543       05 FILLER                       PIC  X(81).                038750      
000544                                                                  038755      
000545    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
000546       05 A00-R01-COP                  PIC  9(13)        .        038900      
000547       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
000548       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
000549       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
000550       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
000551       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
000552       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
000553       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
000554       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
000555       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
000556       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
000557       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
000558       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
000559       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
000560       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
000561       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
000562       05 FILLER                       PIC  X(81)        .        040800      
000563                                                                  040810      
000564    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
000565       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
000566       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
000567       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
000568       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
000569       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
000570       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
000571       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
000572       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
000573       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
000574       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
000575       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
000576       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
000577       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
000578       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
000579       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
000580       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
000581       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
000582       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
000583       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
000584       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
000585       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
000586       05 FILLER                       PIC  X(18).                041040      
000587                                                                  041400      
000588    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
000589    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
000590*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000591*                                                                 002300      
000592 FD DESS151                                                       002400      
000593    VALUE OF BUFFERS IS 1                                         002500      
000594    BLOCK CONTAINS 120 RECORDS                                    002600      
000595    VALUE OF TITLE   IS WKS-TIT-LOG151-COMP.                      002700      
000596*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000597*  COPY "(S151)S151/FORMATO/ARCHIVO/DATOSADIC.".                  002800      
000598 01 A01-R00-HDR-DES .                                             000100      
000599     03 A00-R00-HDR-HD                 PIC X(02).                 000200      
000600     03 A00-R00-HDR-FCH                PIC 9(08).                 000300      
000601     03 FILLER                         PIC X(530).                000400      
000602 01 A01-R01-DATOS.                                                000500      
000603     03 A01-R01-AUTS151ORI             PIC 9(08) COMP.            000600      
000604     03 A01-R01-DATOS-1.                                          000610      
000605        05 A01-R01-REF-BANAMEX         PIC X(26).                 000620      
000606        05 A01-R01-CVECON-YREFLOC REDEFINES                       000640      
000607           A01-R01-REF-BANAMEX         PIC X(26).                 000700      
000608        05 A01-R01-CVECON-Y-REFV REDEFINES A01-R01-REF-BANAMEX.   000800      
000609           07 A01-R01-CONT-ORIG        PIC 9(20) COMP.            000900      
000610           07 A01-R01-REFLOC-BNM       PIC X(12).                 001000      
000611           07 A01-R01-REFLOC-23POS REDEFINES A01-R01-REFLOC-BNM.  001100      
000612              09 A01-R01-COMPREF       PIC 9(01) COMP.            001200      
000613              09 A01-R01-REF23POS      PIC 9(23) COMP.            001250      
000614           07 A01-R01-REFALFA REDEFINES A01-R01-REFLOC-BNM        001270      
000615                                       PIC X(12).                 001290      
000616           07 FILLER                   PIC X(04).                 001300      
000617        05 A01-R01-REFLOC7-BNM REDEFINES A01-R01-REF-BANAMEX.     001400      
000618           07 FILLER                   PIC X(02).                 001500      
000619           07 A01-R01-LOC07BNM         PIC X(24).                 001600      
000620        05 A01-R01-NOMINA-FUN1         PIC 9(14) COMP.            003600      
000621        05 A01-R01-NOMINA-FUN2         PIC 9(14) COMP.            003700      
000622        05 A01-R01-SDO-FIN.                                       003720      
000623           07 A01-R01-SDO-FIN-S500     PIC S9(15)V99 COMP.        003740      
000624           07 FILLER                   PIC X(05).                 003760      
000625        05 A01-R01-NOMINAS-MC REDEFINES A01-R01-SDO-FIN.          003780      
000626           07 A01-R01-NOM-MAKER        PIC 9(14) COMP.            003800      
000627           07 A01-R01-NOM-CHECKER      PIC 9(14) COMP.            003900      
000628        05 A01-R01-REF-CLIENTE         PIC X(16).                 004000      
000629        05 A01-R01-REFERENCIA1         PIC X(35).                 004100      
000630        05 A01-R01-REFERENCIA1-S500 REDEFINES A01-R01-REFERENCIA1.004110      
000631           07 A01-R01-ORIG-HRAMOV      PIC 9(06).                 004120      
000632           07 A01-R01-ORIG-FECMOV      PIC 9(06).                 004130      
000633           07 A01-R01-ORIG-FOLIO       PIC X(12).                 004140      
000634           07 A01-R01-ORIG-MDE         PIC 9(02).                 004150      
000635           07 A01-R01-ORIG-FILREF1     PIC X(09).                 004160      
000636        05 A01-R01-REF2-CTE            PIC X(35).                 004200      
000637        05 A01-R01-REF3-CTE            PIC X(35).                 004300      
000638        05 A01-R01-REF4-CTE            PIC X(35).                 004400      
000639        05 A01-R01-DATOS-2.                                       004450      
000640           07 A01-R01-LEY1             PIC X(40).                 004500      
000641           07 A01-R02-LEY2             PIC X(40).                 004600      
000642           07 A01-R02-LEY3             PIC X(40).                 004700      
000643           07 A01-R02-LEY4             PIC X(40).                 004800      
000644           07 A01-R02-LEY5             PIC X(40).                 004900      
000645           07 A01-R01-FILXAPL          PIC X(120).                004910      
000646           07 A01-R01-FILXAPL-S203 REDEFINES A01-R01-FILXAPL.     004912      
000647              09 A01-R01-CVE-IMPTO10   PIC 9(06).                 004914      
000648              09 A01-R01-FORMA-PAG10   PIC 9(03).                 004916      
000649              09 A01-R01-IMP-IMPTO10   PIC 9(12).                 004918      
000650              09 A01-R01-CVE-IMPTO11   PIC 9(06).                 004920      
000651              09 A01-R01-FORMA-PAG11   PIC 9(03).                 004922      
000652              09 A01-R01-IMP-IMPTO11   PIC 9(12).                 004924      
000653              09 A01-R01-CVE-IMPTO12   PIC 9(06).                 004926      
000654              09 A01-R01-FORMA-PAG12   PIC 9(03).                 004928      
000655              09 A01-R01-IMP-IMPTO12   PIC 9(12).                 004930      
000656              09 A01-R01-CVE-IMPTO13   PIC 9(06).                 004932      
000657              09 A01-R01-FORMA-PAG13   PIC 9(03).                 004934      
000658              09 A01-R01-IMP-IMPTO13   PIC 9(12).                 004936      
000659              09 A01-R01-CVE-IMPTO14   PIC 9(06).                 004938      
000660              09 A01-R01-FORMA-PAG14   PIC 9(03).                 004940      
000661              09 A01-R01-IMP-IMPTO14   PIC 9(12).                 004942      
000662              09 FILLER                PIC X(15).                 004944      
000663                                                                  004946      
000664*          07 A01-R01-FILXAPL-S711 REDEFINES A01-R01-FILXAPL.     004948      
000665*             09 A01-R01-TRUI-S711.                               004949      
000666*                11 A01-R01-CSIREC-S711 PIC 9(08) COMP.           004950      
000667*                11 A01-R01-CSIOR-S711  PIC 9(08) COMP.           004951      
000668*                11 A01-R01-NUMOP-S711  PIC 9(08) COMP.           004952      
000669*                11 A01-R01-NUMTR-S711  PIC 9(08) COMP.           004953      
000670*                11 A01-R01-INSMN-S711  PIC 9(02) COMP.           004954      
000671*             09 A01-R01-MICR-S711.                               004955      
000672*                11 A01-R01-CODSEG-S711 PIC 9(04) COMP.           004956      
000673*                11 A01-R01-VERPRE-S711 PIC 9(02) COMP.           004957      
000674*                11 A01-R01-CTRMON-S711 PIC 9(02) COMP.           004958      
000675*                11 A01-R01-PLCEC-S711  PIC 9(04) COMP.           004959      
000676*                11 A01-R01-BNCEM-S711  PIC 9(04) COMP.           004960      
000677*                11 A01-R01-DVEIN-S711  PIC 9(02) COMP.           004961      
000678*                11 A01-R01-CTACH-S711  PIC 9(12) COMP.           004962      
000679*                11 A01-R01-REFCH-S711  PIC 9(08) COMP.           004963      
000680*             09 A01-R01-CTABEN-S711    PIC 9(20) COMP.           004964      
000681*             09 A01-R01-BCREC-S711     PIC 9(04) COMP.           004965      
000682*             09 A01-R01-NOMBEN-S711    PIC X(40).                004966      
000683*             09 A01-R01-RFCBCO-S711    PIC X(13).                004967      
000684*             09 A01-R01-FILLER-S711    PIC X(19).                004968      
000685                                                                  004969      
000686           07 A01-R01-FILXAPL-S701 REDEFINES A01-R01-FILXAPL.     004970      
000687              09 A01-R01-NVAAUT-S701   PIC 9(08).                 004971      
000688              09 A01-R01-NVASUCTR-S701 PIC 9(04).                 004972      
000689              09 A01-R01-NVACAJTR-S701 PIC 9(02).                 004973      
000690              09 A01-R01-NVAFECT-S701  PIC 9(08).                 004974      
000691              09 A01-R01-NVOMDPA-S701  PIC 9(02).                 004975      
000692              09 A01-R01-NVALINC-S701  PIC X(30).                 004976      
000693              09 A01-R01-FILLER2-S701  PIC X(66).                 004977      
000694                                                                  004978      
000695           07 A01-R01-FILXAPL-S702 REDEFINES A01-R01-FILXAPL.     004979      
000696              09 A01-R01-STTRAN-S702   PIC 9(01).                 004980      
000697              09 A01-R01-CTEEMI-S702   PIC 9(12) COMP.            004981      
000698              09 A01-R01-CTADES-S702   PIC 9(20) COMP.            004982      
000699              09 A01-R01-IDEORI-S702   PIC 9(01).                 004983      
000700              09 A01-R01-IDEDES-S702   PIC 9(01).                 004984      
000701              09 A01-R01-TCTAEM-S702   PIC 9(02) COMP.            004985      
000702              09 A01-R01-TIARCH-S702   PIC X(01).                 004986      
000703              09 A01-R01-FECARC-S702   PIC 9(08) COMP.            004987      
000704              09 A01-R01-SECARC-S702   PIC 9(02) COMP.            004988      
000705              09 A01-R01-AUTORI-S702   PIC 9(20) COMP.            004989      
000706              09 A01-R01-NOMUSU-S702   PIC X(40).                 004990      
000707              09 A01-R01-TCTAUS-S702   PIC 9(02) COMP.            004991      
000708              09 A01-R01-SUCCON-S702   PIC 9(04) COMP.            004992      
000709              09 A01-R01-CAJCON-S702   PIC 9(04) COMP.            004993      
000710              09 A01-R01-FILLER-S702   PIC X(39).                 004994      
000711                                                                  004995      
000712           07 A01-R01-FILXAPL-S500 REDEFINES A01-R01-FILXAPL.     004996      
000713              09 A01-R01-NOMB-CTE          PIC  X(36).            004997      
000714              09 A01-R01-NOMB-BENEF        PIC  X(50).            004998      
000715              09 A01-R01-CVE-RASTREO-S500  PIC  X(30).            004999      
000716* INI VML                                                         005000      
000717              09 A01-R01-CVE-RASTREO-S500-R REDEFINES             005001      
000718                              A01-R01-CVE-RASTREO-S500.           005002      
000719                 11 A01-R01-TIP-CTA-TRASP  PIC 9(02).             005004      
000720                 11 A01-R01-BCO-CTA-TRASP  PIC 9(05).             005006      
000721                 11 A01-R01-NUM-CTA-TRASP  PIC 9(18).             005007      
000722                 11 A01-R01-FILLER-TRASP   PIC X(05).             005008      
000723* FIN VML                                                         005009      
000724              09 A01-R01-FECHA-PAGO        PIC  9(08)     COMP.   005010      
000725        05 A01-R01-DATOS-2-S264 REDEFINES A01-R01-DATOS-2.        005012      
000726           07 A01-R01-NOMINA-FUN3      PIC 9(14) COMP.            005014      
000727           07 A01-R01-COMISION         PIC 9(10)V99 COMP.         005016      
000728           07 A01-R01-SITUACION        PIC 9(10)V99 COMP.         005018      
000729           07 A01-R01-IVA-COMIS        PIC 9(08)V99 COMP.         005020      
000730           07 A01-R01-IVA-SITUACION    PIC 9(08)V99 COMP.         005022      
000731           07 A01-R01-IVA-FISCAL       PIC 9(12)V99 COMP.         005024      
000732           07 A01-R01-FOLIO-RECEP      PIC 9(10) COMP.            005026      
000733           07 A01-R01-OCUPACION        PIC X(40).                 005028      
000734           07 A01-R01-POBLACION        PIC X(40).                 005030      
000735           07 A01-R01-TIPO-CTA         PIC 9(02) COMP.            005032      
000736           07 A01-R01-NUM-CTE          PIC 9(12) COMP.            005034      
000737           07 A01-R01-NUM-CTA          PIC 9(20) COMP.            005036      
000738           07 A01-R01-CVE-TIPO-IDEN    PIC 9(02) COMP.            005038      
000739           07 A01-R01-NUM-IDEN-OFIC    PIC X(18).                 005040      
000740           07 A01-R01-FECHA-NAC-BEN    PIC 9(08) COMP.            005042      
000741           07 A01-R01-DOMICILIO        PIC X(55).                 005044      
000742           07 A01-R01-COLONIA          PIC X(30).                 005046      
000743           07 A01-R01-TELEFONO         PIC X(10).                 005048      
000744           07 A01-R01-COD-POS          PIC 9(06) COMP.            005050      
000745           07 A01-R01-REF-EMISOR       PIC X(20).                 005052      
000746           07 A01-R01-PIN              PIC 9(12) COMP.            005054      
000747           07 A01-R01-TIPO-CHQ-ORD     PIC 9(02) COMP.            005056      
000748           07 A01-R01-FECHA-EVENTO     PIC 9(08) COMP.            005058      
000749           07 A01-R01-CVE-RASTREO-S264 PIC X(30).                 005060      
000750     03 A01-R01-DATOS-1-R    REDEFINES A01-R01-DATOS-1.           005062      
000751        05 A01-R01-SUB-STA-DOC         PIC 9(02) COMP.            005064      
000752        05 A01-R01-SUC-DESTINO         PIC 9(04) COMP.            005066      
000753        05 A01-R01-TIPO-PREV           PIC X(01).                 005068      
000754        05 A01-R01-CAUSA-CAN-DEV       PIC 9(04) COMP.            005070      
000755        05 A01-R01-NVO-BCO-ORI         PIC 9(06) COMP.            005072      
000756        05 A01-R01-NVO-BCO-DES         PIC 9(06) COMP.            005074      
000757        05 A01-R01-NOM-BENEF-IDEN      PIC X(55).                 005076      
000758        05 A01-R01-NVO-NOM-BENEF       PIC X(55).                 005078      
000759        05 A01-R01-RFC-CURP-BENEF      PIC X(18).                 005080      
000760        05 A01-R01-GTOS-ORD-PAGO       PIC 9(16)V99 COMP.         005082      
000761        05 A01-R01-TIPO-PAGO-CECO      PIC 9(02) COMP.            005084      
000762        05 A01-R01-TIPO-PAGO-SPEI      PIC 9(02) COMP.            005086      
000763        05 A01-R01-TIPO-CONVENIO       PIC 9(02) COMP.            005088      
000764        05 A01-R01-PZA-EDO             PIC 9(06) COMP.            005090      
000765        05 A01-R01-TIPO-CTA-ABO        PIC 9(02) COMP.            005092      
000766        05 A01-R01-NUM-CTE-ABO         PIC 9(12) COMP.            005094      
000767        05 A01-R01-NUM-CTA-ABO         PIC 9(20) COMP.            005096      
000768        05 FILLER                      PIC X(358).                005098      
000769                                                                  005100      
000770     03 A01-R01-DATOS-2-S500 REDEFINES A01-R01-DATOS-1.           005102      
000771        05 A01-R01-TRUI.                                          005104      
000772           07 A01-R01-CSIID-RECEPTOR   PIC 9(08) COMP.            005106      
000773           07 A01-R01-CSIID-ORIGEN     PIC 9(08) COMP.            005108      
000774           07 A01-R01-NUM-OPERACION    PIC 9(08) COMP.            005110      
000775           07 A01-R01-NUM-TRANSACCI    PIC 9(08) COMP.            005112      
000776           07 A01-R01-INST-MONETARIO   PIC 9(02) COMP.            005114      
000777        05 A01-R01-MICR.                                          005116      
000778           07 A01-R01-COD-SEGURIDAD    PIC 9(04) COMP.            005118      
000779           07 A01-R01-VER-PREMARCADO   PIC 9(02) COMP.            005120      
000780           07 A01-R01-COD-TRANSMONE    PIC 9(02) COMP.            005122      
000781           07 A01-R01-PLAZA-CECOBAN    PIC 9(04) COMP.            005124      
000782           07 A01-R01-COD-BCOEMISOR    PIC 9(04) COMP.            005126      
000783           07 A01-R01-DIG-VINTERCAM    PIC 9(02) COMP.            005128      
000784           07 A01-R01-NUM-CTACHEQUE    PIC 9(12) COMP.            005130      
000785           07 A01-R01-NUM-REFCHEQUE    PIC 9(08) COMP.            005132      
000786        05 A01-R01-CTA-BENEFOTROBCO    PIC 9(20) COMP.            005134      
000787        05 A01-R01-BCO-RECEPOTROBCO    PIC 9(04) COMP.            005136      
000788        05 A01-R01-NOM-BENEFOTROBCO    PIC X(40).                 005138      
000789        05 A01-R01-RFC-OTROBCO         PIC X(13).                 005140      
000790        05 A01-R01-NOMPAN-S500         PIC X(05).                 005142      
000791        05 A01-R01-OPCPAN-S500         PIC X(01).                 005144      
000792        05 A01-R01-NUMCTO1-S500        PIC 9(16) COMP.            005146      
000793        05 A01-R01-NUMCTO2-S500        PIC 9(16) COMP.            005148      
000794        05 A01-R01-NUMCTO3-S500        PIC 9(16) COMP.            005150      
000795        05 A01-R01-INDIC-EST           PIC 9(08) COMP.            005152      
000796        05 A01-R01-IND-SUBC            PIC 9(01) COMP.            005154      
000797        05 A01-R01-PRO-SUBC            PIC 9(04) COMP.            005156      
000798        05 A01-R01-INST-SUBC           PIC 9(04) COMP.            005158      
000799        05 A01-R01-MON-SUBC            PIC 9(03) COMP.            005160      
000800        05 A01-R01-CONT-SUBC           PIC 9(16) COMP.            005162      
000801        05 A01-R01-CTAMDA-SUBC         PIC 9(16) COMP.            005164      
000802        05 A01-R01-STA-SUBC            PIC 9(04) COMP.            005166      
000803        05 A01-R01-INDALER-SUBC        PIC 9(04) COMP.            005168      
000804        05 A01-R01-INDCTACON-SUBC      PIC 9(02) COMP.            005170      
000805        05 A01-R01-LEYENDA-SUBC        PIC X(40).                 005171      
000806        05 A01-R01-VALOR-IND           PIC X(02).                 005172      
000807        05 A01-R01-NOMB-BENEF-AMPLI    PIC X(120).                005173      
000808        05 A01-R01-IND-EXTNET          PIC 9(01) COMP.            005174      
000809        05 A01-R01-FILLER              PIC 9(01) COMP.            005176      
000810        05 A01-R01-FILLER-DATOS2-S500  PIC X(205).                005178      
000811*        05 A01-R01-FILLER-DATOS2-S500  PIC X(328).               005180      
000812*        05 A01-R01-FILLER-DATOS2-S500  PIC X(395).               005182      
000813                                                                  005184      
000814     03 FILLER                         PIC X(01).                 005198      
000815     03 A01-R01-APUDES                 PIC 9(08) COMP.            005200      
000816     03 A01-R01-TIPREG                 PIC 9(02) COMP.            005300      
000817                                                                  005400      
000818******************************************************************005500      
000819*          VARIABLES DE LECTURA DATOS ADICIONALES "2"            *005600      
000820******************************************************************005700      
00082101 A01-R02-TESOFE.                                                005800      
000822    03 A01-R02-AUTS151ORI             PIC 9(08) COMP.             005900      
000823    03 A01-R02-DATOS-2-S500.                                      006000      
000824       05 A01-R02-TRUI.                                           006100      
000825          07 A01-R02-CSIID-RECEPTOR   PIC 9(08) COMP.             006200      
000826          07 A01-R02-CSIID-ORIGEN     PIC 9(08) COMP.             006300      
000827          07 A01-R02-NUM-OPERACION    PIC 9(08) COMP.             006400      
000828          07 A01-R02-NUM-TRANSACCI    PIC 9(08) COMP.             006500      
000829          07 A01-R02-INST-MONETARIO   PIC 9(02) COMP.             006600      
000830       05 A01-R02-MICR.                                           006700      
000831          07 A01-R02-COD-SEGURIDAD    PIC 9(04) COMP.             006800      
000832          07 A01-R02-VER-PREMARCADO   PIC 9(02) COMP.             006900      
000833          07 A01-R02-COD-TRANSMONE    PIC 9(02) COMP.             007000      
000834          07 A01-R02-PLAZA-CECOBAN    PIC 9(04) COMP.             007100      
000835          07 A01-R02-COD-BCOEMISOR    PIC 9(04) COMP.             007200      
000836          07 A01-R02-DIG-VINTERCAM    PIC 9(02) COMP.             007300      
000837          07 A01-R02-NUM-CTACHEQUE    PIC 9(12) COMP.             007400      
000838          07 A01-R02-NUM-REFCHEQUE    PIC 9(08) COMP.             007500      
000839       05 A01-R02-CTA-BENEFOTROBCO    PIC 9(20) COMP.             007600      
000840       05 A01-R02-BCO-RECEPOTROBCO    PIC 9(04) COMP.             007700      
000841       05 A01-R02-NOM-BENEFOTROBCO    PIC X(40).                  007800      
000842       05 A01-R02-RFC-OTROBCO         PIC X(13).                  007900      
000843       05 A01-R02-NOMPAN-S500         PIC X(05).                  008000      
000844       05 A01-R02-OPCPAN-S500         PIC X(01).                  008100      
000845       05 A01-R02-NUMCTO1-S500        PIC 9(16) COMP.             008200      
000846       05 A01-R02-NUMCTO2-S500        PIC 9(16) COMP.             008300      
000847       05 A01-R02-NUMCTO3-S500        PIC 9(16) COMP.             008400      
000848       05 A01-R02-INDIC-EST           PIC 9(08) COMP.             008500      
000849       05 A01-R02-IND-SUBC            PIC 9(01) COMP.             008600      
000850       05 A01-R02-PRO-SUBC            PIC 9(04) COMP.             008700      
000851       05 A01-R02-INST-SUBC           PIC 9(04) COMP.             008800      
000852       05 A01-R02-MON-SUBC            PIC 9(03) COMP.             008900      
000853       05 A01-R02-CONT-SUBC           PIC 9(16) COMP.             009000      
000854       05 A01-R02-CTAMDA-SUBC         PIC 9(16) COMP.             009100      
000855       05 A01-R02-STA-SUBC            PIC 9(04) COMP.             009200      
000856       05 A01-R02-INDALER-SUBC        PIC 9(04) COMP.             009300      
000857       05 A01-R02-INDCTACON-SUBC      PIC 9(02) COMP.             009400      
000858       05 A01-R02-LEYENDA-SUBC        PIC X(40).                  009500      
000859       05 A01-R02-VALOR-IND           PIC X(02).                  009520      
000860       05 A01-R02-NOMB-BENEF-AMPLI    PIC X(120).                 009540      
000861       05 A01-R02-IND-EXTNET          PIC 9(01) COMP.             009545      
000862       05 A01-R02-FILLER              PIC 9(01) COMP.             009550      
000863       05 A01-R02-FILLER-DATOS2-S500  PIC X(205).                 009560      
000864*       05 A01-R02-FILLER-DATOS2-S500  PIC X(327).                009600      
000865                                                                  009700      
000866    03 FILLER                         PIC X(01).                  009800      
000867    03 A01-R02-APUDES                 PIC 9(08) COMP.             009900      
000868    03 A01-R02-TIPREG                 PIC 9(02) COMP.             010000      
000869                                                                  010100      
000870*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000871                                                                  002900      
000872 FD A02-MOVS151                                                   003000      
000873    VALUE OF AREAS 1000                                           003100      
000874    BLOCK CONTAINS 240 RECORDS.                                   003200      
000875    01 A02-MOV-DATOS.                                             003300      
000876       03 A02-MOV-LLAVE.                                          003400      
000877          04 A02-MOV-LLAVE-COMP.                                  003500      
000878             05 A02-MOV-ARCHIVO     PIC 9(02) COMP.               003600      
000879             05 A02-MOV-NUM-CTA-MDA PIC 9(12) COMP.               003700      
000880             05 A02-MOV-NUM-CTA-MDA-R REDEFINES                   003800      
000881                A02-MOV-NUM-CTA-MDA.                              003900      
000882                07 A02-MOV-SUC-CTA  PIC 9(05) COMP.               004000      
000883                07 A02-MOV-NUM-CTA  PIC 9(07) COMP.               004100      
000884          04 A02-MOV-FECOPE         PIC 9(08) COMP.               004200      
000885          04 A02-MOV-HR-OPE         PIC 9(06) COMP.               004300      
000886       03 A02-MOV-SISTEMA           PIC 9(04) COMP.               004400      
000887       03 A02-MOV-FEC-CONTA         PIC 9(08) COMP.               004500      
000888       03 A02-MOV-FEC-VALOR         PIC 9(08) COMP.               004600      
000889       03 A02-MOV-TIPO              PIC X(01).                    004700      
000890       03 A02-MOV-NATURALEZA        PIC X(01).                    004800      
000891       03 A02-MOV-IMPORTE           PIC 9(14)V9(02) COMP.         004900      
000892       03 A02-MOV-REFEREN           PIC 9(16).                    005000      
000893       03 A02-MOV-SUREFER           PIC 9(16).                    005100      
000894       03 A02-MOV-OTRAREF           PIC X(16).                    005200      
000895       03 A02-MOV-DETALLE           PIC X(40).                    005300      
000896       03 FILLER                    PIC X(04).                    005410      
000897                                                                  005500      
000898 FD A03-MOV-GCE                                                   005510      
000899    VALUE OF AREAS 1000                                           005520      
000900    VALUE OF TITLE IS WKS-TIT-GCE                                 005525      
000901    BLOCK CONTAINS 240 RECORDS.                                   005530      
000902    01 A03-REG-GCE                  PIC X(197).                   005540      
000903                                                                  005550      
000904 SD   SMOVS151.                                                   005600      
000905 01   I01-REG-SD.                                                 005700      
000906      03 A02-SD-LLAVE.                                            005800      
000907         04 A02-SD-LLAVE-COMP.                                    005900      
000908            05 A02-SD-ARCHIVO       PIC 9(02) COMP.               006000      
000909            05 A02-SD-NUM-CTA       PIC 9(12) COMP.               006100      
000910         04 A02-SD-FECOPE           PIC 9(08) COMP.               006200      
000911         04 A02-SD-HR-OPE           PIC 9(06) COMP.               006300      
000912      03 A02-SD-SISTEMA             PIC 9(04) COMP.               006400      
000913      03 A02-SD-FEC-CONTA           PIC 9(08) COMP.               006500      
000914      03 A02-SD-FEC-VALOR           PIC 9(08) COMP.               006600      
000915      03 A02-SD-TIPO                PIC X(01).                    006700      
000916      03 A02-SD-NATURALEZA          PIC X(01).                    006800      
000917      03 A02-SD-IMPORTE             PIC 9(14)V9(02) COMP.         006900      
000918      03 A02-SD-REFEREN             PIC X(16).                    007000      
000919      03 A02-SD-SUREFER             PIC X(16).                    007100      
000920      03 A02-SD-OTRAREF             PIC X(16).                    007200      
000921      03 A02-SD-DETALLE             PIC X(40).                    007300      
000922      03 FILLER                     PIC X(04).                    007400      
000923                                                                  007500      
000924 FD SALDOS151                                                     007600      
000925    BLOCK CONTAINS 168 RECORDS                                    007700      
000926    VALUE OF TITLE IS WKS-TIT-SALDOS.                             007800      
000927*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000928*  COPY "(S151)S151/FORMATO/ARCHIVO/SALDOS ON CMEMP.".            007900      
000929******************************************************************000100      
000930*                                                                *000200      
000931*             FORMATO DEL ARCHIVO DE SALDOS                      *000300      
000932*                                                                *000400      
000933******************************************************************000500      
000934                                                                  000600      
000935                                                                  000700      
000936                                                                  000800      
000937 01 A02-R00-SALDOS.                                               000900      
000938    02 A02-R00-TIPO-REG            PIC  9(02)       COMP.         001000      
000939*   02 A02-R00-FILGRAL             PIC  X(179).                   001100      
000940*INICIA CODIGO DE RENOVACION CRONOS 2000                          001101      
000941    02 A02-R00-FILGRAL             PIC  X(389).                   001102      
000942*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001103      
000943                                                                  001200      
000944    02 A02-R00-HEADER              REDEFINES A02-R00-FILGRAL.     001300      
000945       03 A02-R00-HDR-SISTEMA      PIC  9(04)       COMP.         001400      
000946       03 A02-R00-HDR-PRODUCTO     PIC  9(04)       COMP.         001500      
000947*      03 A02-R00-HDR-FECHA        PIC  9(06)       COMP.         001600      
000948*INICIA CODIGO DE RENOVACION CRONOS 2000                          001601      
000949       03 A02-R00-HDR-FECHA        PIC  9(08)       COMP.         001602      
000950*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001603      
000951*      03 FILLER                   PIC  X(172).                   001700      
000952*INICIA CODIGO DE RENOVACION CRONOS 2000                          001701      
000953       03 FILLER                   PIC  X(381).                   001702      
000954*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001703      
000955                                                                  001800      
000956    02 A02-R01-REG-SAL             REDEFINES A02-R00-FILGRAL.     001900      
000957       03 A02-R01-SIS              PIC  9(04)       COMP.         002000      
000958       03 A02-R01-PRD              PIC  9(04)       COMP.         002100      
000959       03 A02-R01-INS              PIC  9(04)       COMP.         002200      
000960       03 A02-R01-CTA              PIC  9(20)       COMP.         002300      
000961       03 A02-R01-CTA-R            REDEFINES A02-R01-CTA.         002400      
000962          05 A02-R01-SUCPRO        PIC  9(04)       COMP.         002500      
000963          05 A02-R01-CNT           PIC  9(16)       COMP.         002600      
000964       03 A02-R01-EDOCTA           PIC  9(02)       COMP.         002700      
000965*      03 A02-R01-FECPRO           PIC  9(06)       COMP.         002800      
000966*INICIA CODIGO DE RENOVACION CRONOS 2000                          002801      
000967       03 A02-R01-FECPRO           PIC  9(08)       COMP.         002802      
000968*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002803      
000969*      03 A02-R01-FECINI           PIC  9(06)       COMP.         002900      
000970*INICIA CODIGO DE RENOVACION CRONOS 2000                          002901      
000971       03 A02-R01-FECINI           PIC  9(08)       COMP.         002902      
000972*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002903      
000973*      03 A02-R01-FECFIN           PIC  9(06)       COMP.         003000      
000974*INICIA CODIGO DE RENOVACION CRONOS 2000                          003001      
000975       03 A02-R01-FECFIN           PIC  9(08)       COMP.         003002      
000976*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003003      
000977*      03 A02-R01-FECULTMOV        PIC  9(06)       COMP.         003100      
000978*INICIA CODIGO DE RENOVACION CRONOS 2000                          003101      
000979       03 A02-R01-FECULTMOV        PIC  9(08)       COMP.         003102      
000980*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003103      
000981       03 A02-R01-STATUS           PIC  9(02)       COMP.         003200      
000982       03 A02-R01-ELEM-IMP         OCCURS 30 TIMES.               003300      
000983          04 A02-R01-CVESDO        PIC  9(04)       COMP.         003400      
000984          04 A02-R01-IMPT          PIC S9(13)V99    COMP.         003500      
000985*      03 A02-R01-FILXAPL          PIC  X(19).                    003600      
000986*INICIA CODIGO DE RENOVACION CRONOS 2000                          003601      
000987       03 A02-R01-FILXAPL          PIC  X(55).                    003602      
000988*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003603      
000989                                                                  003700      
000990       03 A02-R01-S084             REDEFINES A02-R01-FILXAPL.     003800      
000991          04 A02-R01-TASNET        PIC  9(04)V9(04) COMP.         003900      
000992          04 A02-R01-TASBRU        PIC  9(04)V9(04) COMP.         004000      
000993          04 A02-R01-NETPER        PIC  9(04)V9(04) COMP.         004100      
000994          04 A02-R01-NETANU        PIC  9(04)V9(04) COMP.         004200      
000995          04 A02-R01-DIASPER       PIC  9(02)       COMP.         004300      
000996          04 A02-R01-DIASANU       PIC  9(02)       COMP.         004400      
000997          04 A02-R01-MONS084       PIC  9(02)       COMP.         004500      
000998*INICIA CODIGO DE RENOVACION CRONOS 2000                          004520      
000999          04 FILLER                PIC  X(36).                    004540      
001000*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004560      
001001                                                                  004600      
001002       03 A02-R01-S084AVB          REDEFINES A02-R01-FILXAPL.     004700      
001003          04 FILLER                PIC X(03).                     004800      
001004*         04 A02-R01-FECAPE        PIC  9(06)       COMP.         004900      
001005*INICIA CODIGO DE RENOVACION CRONOS 2000                          004901      
001006          04 A02-R01-FECAPE        PIC  9(08)       COMP.         004902      
001007*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004903      
001008*         04 A02-R01-FECSIGPAGO    PIC  9(06)       COMP.         005000      
001009*INICIA CODIGO DE RENOVACION CRONOS 2000                          005001      
001010          04 A02-R01-FECSIGPAGO    PIC  9(08)       COMP.         005002      
001011*TERMINA CODIGO DE RENOVACION CRONOS 2000                         005003      
001012          04 A02-R01-SORTEO        PIC  9(02)       COMP.         005100      
001013          04 A02-R01-RESTANTES     PIC  9(03)       COMP.         005200      
001014          04 A02-R01-ANTICIPADAS   PIC  9(03)       COMP.         005300      
001015          04 A02-R01-OPORTUNAS     PIC  9(02)       COMP.         005400      
001016          04 A02-R01-TOTALES       PIC  9(02)       COMP.         005500      
001017          04 A02-R01-ATRASOS       PIC  9(02)       COMP.         005600      
001018          04 A02-R01-BONOS         PIC  9(02)       COMP.         005700      
001019          04 A02-R01-ESQUEMA       PIC  9(02)       COMP.         005800      
001020          04 A02-R01-MOVEDAAVB     PIC  9(02)       COMP.         005900      
001021          04 FILLER                PIC  X(34).                    005950      
001022                                                                  006000      
001023       03 A02-R01-S087                REDEFINES A02-R01-FILXAPL.  006100      
001024          04 A02-R01-PLAZO            PIC  9(04)       COMP.      006200      
001025          04 A02-R01-TASS087          PIC  9(04)V9(04) COMP.      006300      
001026          04 A02-R01-INSTRUCCIONES    PIC  9(02)       COMP.      006400      
001027          04 A02-R01-TIPOPER          PIC  9(04)       COMP.      006500      
001028          04 A02-R01-PM               PIC  9(02)       COMP.      006600      
001029          04 A02-R01-FILS087          PIC  X(07).                 006700      
001030          04 A02-R01-MON              PIC  9(04)       COMP.      006701      
001031          04 FILLER                   PIC  X(36).                 006702      
001032                                                                  006800      
001033       03 A02-R01-S500             REDEFINES A02-R01-FILXAPL.     006900      
001034          04 A02-R01-DIASCICLO     PIC  9(03)       COMP.         007000      
001035          04 A02-R01-DIASANO       PIC  9(03)       COMP.         007100      
001036          04 A02-R01-TASRENET      PIC  9(04)V9(04) COMP.         007200      
001037          04 A02-R01-TASREBRU      PIC  9(04)V9(04) COMP.         007300      
001038          04 A02-R01-TASREANO      PIC  9(04)V9(04) COMP.         007400      
001039          04 A02-R01-STATION       PIC  9(04)       COMP.         007500      
001040          04 A02-R01-CTACON        PIC  9(02)       COMP.         007600      
001041          04 A02-R01-MONEDA        PIC  9(02)       COMP.         007700      
001042          04 A02-R01-GENEDOCTA     PIC  9(01).                    007702      
001043          04 A02-R01-INDENVCTD     PIC  9(02)       COMP.         007706      
001044          04 A02-R01-P-CTO-ORI     PIC  9(04)       COMP.         007708      
001045          04 A02-R01-I-CTO-ORI     PIC  9(04)       COMP.         007710      
001046          04 A02-R01-M-CTO-ORI     PIC  9(02)       COMP.         007712      
001047          04 A02-R01-C-TAR-ORI     PIC  9(16)       COMP.         007714      
001048          04 A02-R01-FILS500       PIC  X(21).                    007716      
001049                                                                  007800      
001050       03 A02-R01-S408             REDEFINES A02-R01-FILXAPL.     007900      
001051*         04 A02-R01-FECVEN        PIC  9(06)       COMP.         008000      
001052*INICIA CODIGO DE RENOVACION CRONOS 2000                          008001      
001053          04 A02-R01-FECVEN        PIC  9(08)       COMP.         008002      
001054*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008003      
001055          04 A02-R01-TASINT        PIC  9(04)V9(04) COMP.         008100      
001056          04 A02-R01-DIASBG        PIC  9(04)       COMP.         008200      
001057          04 A02-R01-LINEA         PIC  9(04)       COMP.         008300      
001058          04 A02-R01-FOLIO         PIC  9(04)       COMP.         008400      
001059          04 A02-R01-FILS408       PIC  X(06).                    008500      
001060*INICIA CODIGO DE RENOVACION CRONOS 2000                          008501      
001061          04 FILLER                PIC  X(35).                    008502      
001062*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008503      
001063                                                                  008600      
001064    02 A02-R00-TRA-SAL             REDEFINES A02-R00-FILGRAL.     008700      
001065       03 A02-R02-TRA-TOTREG       PIC  9(08)       COMP.         008800      
001066       03 A02-R02-TRA-TOTCON       PIC  9(08)       COMP.         008900      
001067       03 A02-R02-TRA-IMPT         PIC S9(15)V99    COMP.         009000      
001068*      03 FILLER                   PIC  X(162).                   009100      
001069*INICIA CODIGO DE RENOVACION CRONOS 2000                          009101      
001070       03 FILLER                   PIC  X(372).                   009102      
001071*TERMINA CODIGO DE RENOVACION CRONOS 2000                         009103      
001072                                                                  009200      
001073                                                                  009300      
001074*=================================================================009400      
001075*====             DESCRIPCION DE CAMPOS                        ===009500      
001076*=================================================================009600      
001077                                                                  009700      
001078*=A02-R00-TIPO-REG     : 00 = HEADER                              009800      
001079*                        80 = INICIO                              009900      
001080*                        81 = REGISTRO DE SALDOS                  010000      
001081*                        82 = FIN                                 010100      
001082*                        99 = TRAILER                             010200      
001083                                                                  010300      
001084*=================================================================010400      
001085*===                REGISTRO HEADER                            ===010500      
001086*=================================================================010600      
001087                                                                  010700      
001088*=A02-R00-HDR-SISTEMA  : NUMERO DE SISTEMA EJ. 0500               010800      
001089*=A02-R00-HDR-PRODUCTO : NUMERO DE PRODUCTO EJ. 0066              010900      
001090*=A02-R00-HDR-FECHA    : FECHA CONTABLE DE LA APLICACION ORIGEN   011000      
001091                                                                  011100      
001092*=================================================================011200      
001093*===                   REGISTRO DE SALDOS                      ===011300      
001094*=================================================================011400      
001095                                                                  011500      
001096*=A02-R01-SIS          : NUMERO DE SISTEMA     EJ. 0500           011600      
001097*=A02-R01-PRD          : NUMERO DE PRODUCTO    EJ. 0066           011700      
001098*=A02-R01-INS          : NUMERO DE INSTRUMENTO EJ. 0006.          011800      
001099*=A02-R01-CTA          : NUMERO DE CUENTA/CONTRATO                011900      
001100*=A02-R01-EDOCTA       : 00 = NADA MAS ES REGISTRO DE SALDOS      012000      
001101*                        01 = ACTIVOS Y SE GENERA EDO. CTA.       012100      
001102*                        02 = CANCELADOS EN EL MES Y SE GENERA    012200      
001103*                             EDO CTA                             012300      
001104*                        03 = INACTIVOS Y SE GENERA EDO CTA       012400      
001105*                        04 = INACTIVOS Y NO SE GENERA EDO CTA    012500      
001106*=A02-R01-FECPRO       : FECHA CONTABLE DE LA APLICACION          012600      
001107*                        FORMATO AAMMDD                           012700      
001108*=A02-R01-FECINI       : FECHA INICIO DE CICLO PARA CORTE FORMATO 012800      
001109*                        AAMMDD (CAMPO OBLIGATORIO SI             012900      
001110*                        A02-R01-EDOCTA ES MAYOR A CERO)          013000      
001111*=A02-R01-FECFIN       : FECHA FINAL DE CICLO PARA CORTE FORMATO  013100      
001112*                        AAMMDD (CAMPO OBLIGATORIO SI             013200      
001113*                        A02-R01-EDOCTA ES MAYOR A CERO)          013300      
001114*=A02-R01-STATUS       : 00 = ULTIMO REGISTRO DE SALDOS POR       013400      
001115*                             CONTRATO                            013500      
001116*                        01 = SIGUIENTE REGISTRO PERTENECE AL     013600      
001117*                         CONTRATO DE ESTE REGISTRO.              013700      
001118*=A02-R01-CVESDO       : NUMERO DE CONCEPTO DE SALDOS             013800      
001119*                        EJ. 0002 (SALDO ACTUAL)                  013900      
001120*=A02-R01-IMPT         : IMPORTE DEL CONCEPTO DE SALDO            014000      
001121                                                                  014100      
001122*=================================================================014200      
001123*==                FILLER POR APLICACION                       ===014300      
001124*=================================================================014400      
001125                                                                  014500      
001126                                                                  014600      
001127                                                                  014700      
001128                                                                  014800      
001129*=================================================================014900      
001130*==                    SISTEMA S500                            ===015000      
001131*=================================================================015100      
001132                                                                  015200      
001133*=A02-R01-DIASCICLO    : DIAS EN EL CICLO DE CORTE                015300      
001134*=A02-R01-DIASANO      : DIAS EN EL A\O                           015400      
001135*=A02-R01-TASRENET     : TASA DE RENDIMIENTO NETA                 015500      
001136*=A02-R01-TASREBRU     : TASA DE RENDIMIENTO BRUTA                015600      
001137*=A02-R01-TASREANO     : TASA DE RENDIMIENTO NETA EN EL A\O       015700      
001138*=A02-R01-STATION      : IDENTIFICADOR PARA BANCA ELECTRONICA     015800      
001139*=A02-R01-CTACON       : 00 = SUCURSAL 870                        015900      
001140*                        01 = CUENTA CONCENTRADORA                016000      
001141*=A02-R01-MONEDA       : TIPO DE MONEDA                           016010      
001142*=A02-R01-GENEDOCTA    : VALOR PARA GENERACION ESTADO DE CTA      016020      
001143*=A02-R01-INDENVCTD    : VALOR DE INDICADOR DE ENVIO CITIDIRECT   016030      
001144*=A02-R01-P-CTO-ORI    : PROD DEL CTO ORIGINAL SE TRASP BENEF     016040      
001145*=A02-R01-I-CTO-ORI    : INST DEL CTO ORIGINAL SE TRASP BENEF     016050      
001146*=A02-R01-M-CTO-ORI    : MONE DEL CTO ORIGINAL SE TRASP BENEF     016060      
001147*=A02-R01-C-TAR-ORI    : CTO  TARJETA ORIGINAL SE TRASP BENEF     016070      
001148*=A02-R01-FILS500      : FILLER PARA USO FUTURO                   016100      
001149                                                                  016200      
001150*=================================================================016300      
001151*==                    SISTEMA S408                            ===016400      
001152*=================================================================016500      
001153                                                                  016600      
001154*=A02-R01-FECVEN       : FECHA DE VENCIMIENTO DE LA LINEA         016700      
001155*=A02-R01-TASINT       : TASA DE INTERES                          016800      
001156*=A02-R01-DIASBG       : DIAS DE SOBREGIRO                        016900      
001157*=A02-R01-LINEA        : NUMERO DE LINEA                          017000      
001158*=A02-R01-FOLIO        : NUMERO DE FOLIO                          017100      
001159*=A02-R01-FILS408      : FILLER PARA USO FUTURO                   017200      
001160                                                                  017300      
001161*=================================================================017400      
001162*==                   REGISTRO TRAILER                         ===017500      
001163*=================================================================017600      
001164                                                                  017700      
001165*=A02-R02-TRA-TOTREG : TOTAL DE REGISTROS SIN INCLUIR HEADER Y    017800      
001166*                      TRAILER.                                   017900      
001167*=A02-R02-TRA-TOTCON : TOTAL DE CONTRATOS                         018000      
001168*=A02-R02-TRA-IMPT   : SUMA DE TODOS LOS IMPORTES DE LOS CONCEPTOS018100      
001169*                      DE SALDOS.                                 018200      
001170                                                                  018300      
001171*=================================================================018400      
001172*==             NOMBRE EXTERNO DE ARCHIVO                      ===018500      
001173*=================================================================018600      
001174                                                                  018700      
001175*=  (SXXX)S151/FILE/S050/SALDOSYYY/AAMMDD                         018800      
001176                                                                  018900      
001177* XXX   = NUMERO DEL USERCODE EJ. S500                            019000      
001178* YYY   = NUMERO DEL PRODUCTO EJ. S066                            019100      
001179* AAMMDD = FECHA CONTABLE DEL SISTEMA ORIGEN                      019200      
001180*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001181                                                                  008000      
001182 FD E01-INTELLI                                                   008100      
001183    VALUE OF     SECURITYTYPE IS PUBLIC                           008200      
001184                 TITLE WKS-TIT-INTEL.                             008300      
001185 01 E01-R01-INTELLI                 PIC X(197).                   008400      
001186                                                                  008500      
001187 FD E02-INTELLI-UNI                                               008600      
001188    VALUE OF     SECURITYTYPE IS PUBLIC                           008700      
001189                 TITLE WKS-TIT-INTEL-UNI.                         008800      
001190 01 E02-R01-INTELLI-UNI             PIC X(197).                   008900      
001191                                                                  009000      
001192 WORKING-STORAGE SECTION.                                         009100      
001193*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001194* COPY "S151/FORMATO/ARCHIVO/INTELLIMATCH ON CMEMP.".             009200      
001195                                                                  000100      
001196*=================================================================000200      
001197*==       REGISTRO DEL ARCHIVO DE INTERFASE INTELLIMATCH        ==000300      
001198*=================================================================000400      
001199 01 A00-R00-HDR-INTE.                                             000500      
001200    02 A00-R00-INTE-CVE-REG        PIC X(02) VALUE "HS".          000600      
001201    02 A00-R00-INTE-NUM-CTA        PIC X(34).                     000700      
001202    02 FILLER                      PIC X(01) VALUE "S".           000800      
001203    02 A00-R00-INTE-CEROS          PIC 9(09).                     000900      
001204    02 A00-R00-INTE-FEC-APERTURA   PIC 9(06).                     001000      
001205    02 A00-R00-INTE-FEC-CIERRE     PIC 9(06).                     001100      
001206    02 A00-R00-INTE-NAT            PIC X(01).                     001200      
001207    02 A00-R00-INTE-SDO-APERTURA   PIC 9(14)V99.                  001300      
001208    02 FILLER                      PIC X(01) VALUE "F".           001400      
001209    02 A00-R00-INTE-NAT-CIERRE     PIC X(01).                     001500      
001210    02 A00-R00-INTE-SDO-CIERRE     PIC 9(14)V99.                  001600      
001211    02 FILLER                      PIC X(01) VALUE "F".           001700      
001212    02 FILLER                      PIC X(103) VALUE SPACES.       001800      
001213*                                                                 001900      
001214 01 A00-R01-INTE-REGMOV.                                          002000      
001215    02 A00-R01-INTE-CVE-REG        PIC X(01) VALUE "D".           002100      
001216    02 A00-R01-INTE-NUM-CTA        PIC X(35).                     002200      
001217    02 A00-R01-INTE-FEC-CONTA      PIC 9(06).                     002300      
001218    02 A00-R01-INTE-FEC-VALOR      PIC 9(06).                     002400      
001219    02 A00-R01-INTE-TIPO           PIC X(02) VALUE SPACES.        002500      
001220    02 A00-R01-INTE-NAT            PIC X(01).                     002600      
001221    02 A00-R01-INTE-IMPORTE        PIC 9(14)V99.                  002700      
001222    02 A00-R01-INTE-REFEREN        PIC X(16).                     002800      
001223    02 A00-R01-INTE-SUREFER        PIC X(16) VALUE SPACES.        002900      
001224    02 A00-R01-INTE-OTRAREF        PIC X(16) VALUE SPACES.        003000      
001225    02 A00-R01-INTE-DETALLE        PIC X(40) VALUE SPACES.        003100      
001226    02 FILLER                      PIC X(34) VALUE SPACES.        003200      
001227    02 A00-R01-INTE-SIST           PIC 9(04).                     003300      
001228    02 A00-R01-INTE-CVE            PIC 9(04).                     003400      
001229*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001230                                                                  009220      
001231 01 WKS-NULO                        PIC X(01) VALUE @00@.         009240      
001232                                                                  009260      
001233******************************************************************009300      
001234*            NOMBRE EXTERNO DEL ARCHIVO LOG DEL S151             *009400      
001235******************************************************************009500      
001236 01  WKS-TIT-LOG151.                                              009600      
001237     02  FILLER                     PIC X(10) VA "(S151)S151".    009700      
001238     02  FILLER                     PIC X(10) VA "/FILE/MOVS".    009800      
001239     02  WKS-TIT-SISTEMA            PIC 9(03) VALUE 0.            009900      
001240     02  FILLER                     PIC X(01) VALUE "/".          010000      
001241     02  WKS-FEC-LOG                PIC 9(06) VALUE 0.            010100      
001242     02  FILLER                     PIC X(04) VALUE " ON ".       010200      
001243     02  WKS-PACK-LOG               PIC X(12).                    010300      
001244     02  FILLER                     PIC X(01) VALUE ".".          010400      
001245                                                                  010500      
001246******************************************************************010600      
001247****    NOMBRE EXTERNO DEL ARCHIVO DE SALDOS                 *****010700      
001248******************************************************************010800      
001249 01  WKS-TIT-SALDOS.                                              010900      
001250     03  FILLER                     PIC X(20) VALUE               011000      
001251                                    "(S151)S151/FILE/SDOS".       011100      
001252     03  WKS-TIT-SIST-SALDOS        PIC 9(03) VALUE 0.            011200      
001253     03  FILLER                     PIC X(01) VALUE "/".          011300      
001254     03  WKS-FEC-SALDOS             PIC 9(06) VALUE 0.            011400      
001255     03  FILLER                     PIC X(04) VALUE  " ON ".      011500      
001256     03  WKS-PACK-SALDOS            PIC X(12).                    011600      
001257     03  FILLER                     PIC X(01) VALUE ".".          011700      
001258******************************************************************011800      
001259****    NOMBRE EXTERNO DEL ARCHIVO COMPLEMENTARIO DEL LOG    *****011900      
001260******************************************************************012000      
001261 01  WKS-TIT-LOG151-COMP.                                         012100      
001262     03  FILLER                     PIC X(20) VALUE               012200      
001263                                    "(S151)S151/FILE/DESS".       012300      
001264     03  WKS-TIT-SIST-DES           PIC 9(03) VALUE 0.            012400      
001265     03  FILLER                     PIC X(01) VALUE "/".          012500      
001266     03  WKS-FEC-DES                PIC 9(06) VALUE 0.            012600      
001267     03  FILLER                     PIC X(04) VALUE  " ON ".      012700      
001268     03  WKS-PACK-DES               PIC X(12).                    012800      
001269     03  FILLER                     PIC X(01) VALUE ".".          012900      
001270                                                                  013000      
001271  01 WKS-TIT-INTEL.                                               013100      
001272     03 FILLER                      PIC X(20)                     013200      
001273                                    VALUE "(S151)S151/FILE/E01/". 013300      
001274     03 FILLER                      PIC X(07) VALUE "INTELLI".    013400      
001275     03 WKS-INT-SEC                 PIC 9(02) VALUE ZERO.         013500      
001276     03 FILLER                      PIC X(01) VALUE "/".          013600      
001277     03 WKS-INT-CSI                 PIC 9(02) VALUE ZERO.         013700      
001278     03 FILLER                      PIC X(01) VALUE "/".          013800      
001279     03 WKS-INT-FECHA               PIC 9(06).                    013900      
001280     03 FILLER                      PIC X(10) VALUE " ON CMEMP.". 014000      
001281                                                                  014002      
001282   01 WKS-TIT-GCE.                                                014005      
001283      03 FILLER                     PIC X(15)                     014010      
001284                                    VALUE "S151/FILE/INTS/".      014020      
001285      03 FILLER                     PIC X(09) VALUE "15103S01/".  014030      
001286      03 WKS-INT-CSI-GCE            PIC 9(02).                    014040      
001287      03 FILLER                     PIC X(01) VALUE "/".          014050      
001288      03 WKS-INT-FECHA-GCE          PIC 9(08).                    014060      
001289      03 FILLER                     PIC X(04) VALUE "/CHL".       014070      
001290      03 WKS-INT-SEC-GCE            PIC 9(02) VALUE ZERO.         014080      
001291      03 WKS-INT-MMDD-GCE           PIC 9(04) .                   014090      
001292      03 FILLER                     PIC X(10) VALUE " ON CMEMP.". 014092      
001293                                                                  014100      
001294   01 WKS-TIT-INTEL-UNI.                                          014200      
001295      03 FILLER                     PIC X(15)                     014300      
001296                                    VALUE "S151/FILE/INTS/".      014400      
001297      03 FILLER                     PIC X(09) VALUE "15103S01/".  014500      
001298      03 WKS-INT-CSI-UNI            PIC 9(02).                    014520      
001299      03 FILLER                     PIC X(01) VALUE "/".          014700      
001300      03 WKS-INT-FECHA-UNI          PIC 9(08).                    014800      
001301      03 FILLER                     PIC X(04) VALUE "/CHK".       014820      
001302      03 WKS-INT-SEC-UNI            PIC 9(02) VALUE ZERO.         014840      
001303      03 WKS-INT-MMDD               PIC 9(04) .                   014890      
001304      03 FILLER                     PIC X(10) VALUE " ON CMEMP.". 014900      
001305                                                                  014910      
001306*================ VARIABLES PARA ENVIO POR INTELAR ===============014920      
001307   77 W77-INTE-SNT                  PIC S9(11) BINARY.            014930      
001308   01 WKS-INTE-ARCHIVO              PIC X(120).                   014940      
001309                                                                  015000      
001310***************************************************************** 015100      
001311**           PARAMETROS PARA LIBRERIA CLTVERS                  ** 015200      
001312***************************************************************** 015300      
001313*                                                                 015400      
001314 01  WKS-CTLVER-NUMREG              PIC 9(02).                    015500      
001315 01  WKS-CTLVERS-LIBRERIA           PIC X(12).                    015600      
001316 01  WKS-CTLVERS-TITULO             PIC X(72).                    015700      
001317 77  WKS-CTLVERS-STATUS             PIC S9(11) BINARY.            015800      
001318                                                                  015900      
001319******************************************************************016000      
001320*           CATALOGOS PARAMETRICOS  S080                         *016100      
001321******************************************************************016200      
001322 77 S080-CP-SISTEMA                 PIC S9(11) BINARY.            016300      
001323 77 S080-CP-PROGRAMA                PIC S9(11) BINARY.            016400      
001324 77 S080-CP-RESULT                  PIC S9(11) BINARY.            016500      
001325 01 S080-CP-PARAMETRO-ENT.                                        016600      
001326    02 S080-CPPE-CATALOGO           PIC 9(06) COMP.               016700      
001327    02 S080-CPPE-CLAVE              PIC 9(02) COMP.               016800      
001328    02 S080-CPPE-ORDEN-BUSQ         PIC 9(02) COMP.               016900      
001329    02 S080-CPPE-REGISTROS          PIC 9(02) COMP.               017000      
001330    02 S080-CPPE-LLAVE1             PIC 9(12).                    017100      
001331    02 S080-CPPE-LLAVE2             PIC 9(12).                    017200      
001332    02 S080-CPPE-LLAVE3             PIC X(12).                    017300      
001333    02 S080-CPPE-LLAVE4             PIC X(12).                    017400      
001334    02 S080-CPPE-LLAVE5             PIC X(12).                    017500      
001335    02 S080-CPPE-LLAVE6             PIC X(12).                    017600      
001336    02 S080-CPPE-FECHA-VIG          PIC 9(06) COMP.               017700      
001337    02 S080-CPPE-FECHA-CONS         PIC 9(06) COMP.               017800      
001338    02 S080-CPPE-NIVEL-INI          PIC 9(02) COMP.               017900      
001339    02 FILLER                       PIC X(11).                    018000      
001340                                                                  018100      
001341 01 S080-CP-PARAMETRO-SAL.                                        018200      
001342    02 S080-CPPS-NUM-REGISTRO       PIC 9(02) COMP.               018300      
001343    02 S080-CPPS-NUM-CATALOGO       PIC 9(06) COMP.               018400      
001344    02 S080-CPPS-FECHA-CONS         PIC 9(06) COMP.               018500      
001345    02 S080-CPPS-NIVEL-INI          PIC 9(02) COMP.               018600      
001346    02 FILLER                       PIC X(22).                    018700      
001347    02 S080-CPPS-REGISTROS.                                       018800      
001348       04 S080-CPPS-DATOS           OCCURS 28 TIMES PIC 9(12).    018900      
001349       04 S080-CPPS-FECHA-ALTA      PIC 9(06) COMP.               019000      
001350       04 S080-CPPS-FECHA-BAJA      PIC 9(06) COMP.               019100      
001351       04 S080-CPPS-FECHA-ULTMOD    PIC 9(06) COMP.               019200      
001352       04 S080-CPPS-FECHA-VIG       PIC 9(06) COMP.               019300      
001353       04 FILLER                    PIC X(500).                   019400      
001354**************************************************************    019500      
001355*    VARIABLES PARA OBTENER DATOS DEL HOST DONDE SE CORRE    *    019600      
001356**************************************************************    019700      
001357 01  WKS-DATOS-HOST.                                              019800      
001358     03 WKS-NUMCSI                  PIC 9(02).                    019900      
001359     03 WKS-NOMEQUIPO               PIC X(10).                    020000      
001360     03 WKS-NOMCSI                  PIC X(26).                    020100      
001361     03 WKS-LINEABATCH              PIC X(05).                    020200      
001362                                                                  020300      
001363******************************************************************020400      
001364*            PARAMETROS DE LAS CVES DE TRANSACCION               *020500      
001365******************************************************************020600      
001366 01 WKS-TABLA-PARAMETROS-TRANS.                                   020700      
001367    02 WKS-T-PARAMETROS-TRANS       OCCURS 10000 TIMES.           020800      
001368       04 WKS-PT-NAT-ALFA           PIC 9(02) COMP.               020900      
001369       04 WKS-PT-NAT-S028           PIC 9(02) COMP.               021000      
001370       04 WKS-NAT-ALFA-408          PIC 9(02) COMP.               021100      
001371       04 WKS-NAT-S028-408          PIC 9(02) COMP.               021200      
001372       04 WKS-PT-CITI-500           PIC 9(02) COMP.               021300      
001373       04 WKS-PT-CITI-408           PIC 9(02) COMP.               021400      
001374                                                                  021410      
001375 01 WKS-TABLA-GCE.                                                021420      
001376    02 WKS-TAB-GCE                  OCCURS 10000 TIMES.           021430      
001377       04 WKS-PT-GCE-500            PIC 9(02) COMP.               021440      
001378                                                                  021500      
001379******************************************************************023000      
001380*           COPY DEL FORMATO PARA LIBRERIA DE CONTROL            *023100      
001381******************************************************************023200      
001382*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001383*     COPY                                                        023300      
001384*     "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".          023400      
001385*================================================================ 000100      
001386*         ENTRY-POINT CONSISDIA :                               = 000200      
001387*                                                                 000300      
001388* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
001389* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
001390* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
001391* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
001392* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
001393* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
001394* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
001395* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
001396* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
001397* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
001398*                                                               = 001400      
001399*================================================================ 001500      
001400                                                                  001600      
001401                                                                  001700      
001402*================================================================ 001800      
001403* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
001404*                                                               = 002000      
001405* ENTRADA REQUERIDA :                                           = 002100      
001406*                                                               = 002200      
001407*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
001408*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
001409*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
001410*================================================================ 002600      
001411 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
001412    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
001413    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
001414    03 WKS-B01-CSI                 PIC 9(02).                     003000      
001415    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
001416    03 WKS-B01-FECCON              PIC 9(08).                     003202      
001417    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
001418    03 WKS-B01-STAREG              PIC 9(02).                     003400      
001419    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
001420    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
001421    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
001422    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
001423    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
001424    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
001425    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
001426    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
001427    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
001428    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
001429    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
001430    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
001431    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
001432       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
001433       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
001434       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
001435       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
001436*==============================================================   005200      
001437*                                                             =   005300      
001438* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
001439*                                                             =   005500      
001440* CAMPOS REQUERIDOS :                                         =   005600      
001441*                                                             =   005700      
001442* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
001443* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
001444* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
001445* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
001446*==============================================================   006200      
001447 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
001448    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
001449    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
001450    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
001451    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
001452                                                                  006800      
001453*==============================================================   006900      
001454*                                                             =   007000      
001455* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
001456*                                                             =   007200      
001457* CAMPOS REQUERIDOS :                                         =   007300      
001458*                                                             =   007400      
001459* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
001460* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
001461* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
001462* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
001463*==============================================================   007900      
001464 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
001465    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
001466    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
001467    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
001468    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
001469                                                                  008500      
001470*==============================================================   008600      
001471*                                                             =   008700      
001472* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
001473*                                                             =   008900      
001474* CAMPOS REQUERIDOS :                                         =   009000      
001475*                                                             =   009100      
001476* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
001477* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
001478* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
001479* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
001480*==============================================================   009600      
001481 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
001482    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
001483    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
001484    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
001485    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
001486                                                                  010200      
001487*============================================================     010300      
001488* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
001489*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
001490*                                                           =     010600      
001491*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
001492*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
001493*                                                           =     010900      
001494*  ENTRADA REQUERIDA.                                       =     011000      
001495*                                                           =     011100      
001496*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
001497*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
001498*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
001499*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
001500*============================================================     011600      
001501                                                                  011700      
001502 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
001503     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
001504     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
001505     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
001506     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
001507                                                                  012300      
001508*=============================================================    012400      
001509*                                                            =    012500      
001510* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
001511*             B01-SIS-FECARMOV.                              =    012700      
001512*                                                            =    012800      
001513* ENTRADA REQUERIDAD :                                       =    012900      
001514*                                                            =    013000      
001515*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
001516*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
001517*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
001518*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
001519*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
001520*=============================================================    013600      
001521                                                                  013700      
001522 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
001523     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
001524     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
001525     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
001526     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
001527     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
001528*================================================================ 014400      
001529*                                                               = 014500      
001530* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
001531*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
001532*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
001533*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
001534*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
001535*                                                               = 015100      
001536* ENTRADA REQUERIDA :                                           = 015200      
001537*                                                               = 015300      
001538* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
001539* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
001540* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
001541* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
001542* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
001543*================================================================ 015900      
001544 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
001545    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
001546    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
001547    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
001548    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
001549    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
001550                                                                  016600      
001551*============================================================     016700      
001552*                                                           =     016800      
001553* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
001554*                                                           =     017000      
001555* DATOS REQUERIDOS :                                        =     017100      
001556*                                                           =     017200      
001557* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
001558* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
001559* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
001560* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
001561* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
001562*============================================================     017800      
001563                                                                  017900      
001564 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
001565     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
001566     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
001567     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
001568     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
001569     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
001570                                                                  018600      
001571*============================================================     018700      
001572*                                                           =     018800      
001573* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
001574*                                                           =     019000      
001575* DATOS REQUERIDOS :                                        =     019100      
001576*                                                           =     019200      
001577* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
001578* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
001579* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
001580* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
001581* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
001582*============================================================     019800      
001583                                                                  019900      
001584 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
001585     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
001586     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
001587     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
001588     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
001589     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
001590                                                                  020600      
001591*===============================================================  020700      
001592*                                                              =  020800      
001593* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
001594*              MOVIMIENTOS.                                    =  021000      
001595* DATOS REQUERIDOS :                                           =  021100      
001596*                                                              =  021200      
001597* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
001598* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
001599* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
001600* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
001601* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
001602* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
001603*==============================================================   021900      
001604                                                                  022000      
001605 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
001606     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
001607     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
001608     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
001609     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
001610     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
001611     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
001612*==============================================================   022800      
001613*                                                             =   022900      
001614* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
001615*                                                             =   023100      
001616* CAMPOS REQUERIDOS :                                         =   023200      
001617*                                                             =   023300      
001618* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
001619* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
001620* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
001621* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
001622*==============================================================   023800      
001623 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
001624    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
001625    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
001626    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
001627    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
001628                                                                  024304      
001629*=================================================================024306      
001630*                ENTRY POINT CONSISB01                           =024308      
001631*                                                                =024310      
001632*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
001633*                                                                =024314      
001634*  FUNCIONES DISPONIBLES :                                       =024316      
001635*                                                                =024318      
001636*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
001637*                                                                =024322      
001638*  PARAMETROS REQUERIDOS                                         =024324      
001639*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
001640*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
001641*=================================================================024330      
001642                                                                  024332      
001643 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
001644     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
001645     03 WKS-CON-CSI                PIC 9(02).                     024336      
001646     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
001647     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
001648        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
001649        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
001650        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
001651        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
001652        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
001653                                                                  024400      
001654*=================================================================024500      
001655*                ENTRY POINT B02ARCINTER                         =024600      
001656*                                                                =024700      
001657*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
001658*                                                                =024900      
001659*  FUNCIONES DISPONIBLES :                                       =025000      
001660*                                                                =025100      
001661*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
001662* 19.- ALTAS DE ARCHIVOS.                                        =025300      
001663* 22.- BAJAS DE ARCHIVOS.                                        =025400      
001664* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
001665*                                                                =025600      
001666*  PARAMETROS REQUERIDOS                                         =025700      
001667*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
001668*                                                                =025900      
001669*=================================================================026000      
001670 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
001671     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
001672     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
001673     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
001674     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
001675     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
001676     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
001677     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
001678     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
001679     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
001680     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
001681     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
001682     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
001683     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
001684     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
001685     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
001686     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
001687     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
001688     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
001689     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
001690     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
001691     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
001692     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
001693     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
001694     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
001695     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
001696     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
001697     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
001698     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
001699                                                                  029000      
001700*=================================================================029100      
001701*                ENTRY POINT B04SISTEMA                          =029200      
001702*                                                                =029300      
001703*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
001704*                                                                =029500      
001705*  FUNCIONES DISPONIBLES :                                       =029600      
001706*                                                                =029700      
001707*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
001708*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
001709*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
001710*                                                                =030100      
001711*  PARAMETROS REQUERIDOS                                         =030200      
001712*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
001713*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
001714*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
001715*                                                                =030600      
001716*=================================================================030700      
001717 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
001718     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
001719     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
001720     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
001721     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
001722     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
001723     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
001724     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
001725                                                                  031600      
001726*================================================================ 031700      
001727*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
001728*                                                               = 031900      
001729*  FUNCION                                                      = 032000      
001730*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
001731*   19       ALTAS.                                             = 032200      
001732*   22       BAJAS                                              = 032300      
001733*   37       CAMBIOS.                                           = 032400      
001734*                                                               = 032500      
001735*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
001736*                      FECHA DE PROCESO                         = 032700      
001737*                      NUMERO DE PROCESO                        = 032800      
001738*                      FECHA INICIO                             = 032900      
001739*                      REGISTRO INICIAL                         = 033000      
001740*================================================================ 033100      
001741                                                                  033200      
001742 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
001743     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
001744     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
001745     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
001746     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
001747     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
001748     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
001749     03 WKS-B05-MIX                PIC 9(08).                     034000      
001750     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
001751     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
001752     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
001753     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
001754     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
001755     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
001756                                                                  034700      
001757                                                                  034800      
001758*================================================================ 034900      
001759*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
001760*                                                               = 035100      
001761*  FUNCION                                                      = 035200      
001762*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
001763*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
001764*                                                               = 035500      
001765*================================================================ 035600      
001766                                                                  035700      
001767 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
001768     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
001769     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
001770     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
001771     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
001772     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
001773     03 WKS-B09-NOMREN             PIC X(15).                     036400      
001774                                                                  036500      
001775*===============================================================  036600      
001776*                                                              =  036700      
001777*         ENTRY-POINT CONSISMEN                                =  036800      
001778*                                                              =  036900      
001779*   DATOS REQUERIDOS : FUNCION                                 =  037000      
001780*                      SISTEMA                                 =  037100      
001781*                                                              =  037200      
001782*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
001783*                                                              =  037400      
001784*===============================================================  037500      
001785 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
001786     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
001787     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
001788     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
001789     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
001790     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
001791     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
001792     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
001793     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
001794     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
001795     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
001796     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
001797     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
001798     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
001799     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
001800     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
001801        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
001802        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
001803        05 WKS-B03-AAMM            PIC 9(06).                     039402      
001804        05 WKS-B03-SECOK           PIC 9(10).                     039500      
001805        05 WKS-B03-SECINF          PIC 9(10).                     039600      
001806        05 WKS-B03-SECERR          PIC 9(10).                     039700      
001807        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
001808                                                                  039900      
001809*=====================================================            040000      
001810*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
001811*=====================================================            040200      
001812 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
001813     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
001814     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
001815     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
001816                                                                  040700      
001817*=====================================================            040800      
001818*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
001819*=====================================================            041000      
001820 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
001821     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
001822     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
001823     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
001824                                                                  041500      
001825*=====================================================            041600      
001826*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
001827*=====================================================            041800      
001828 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
001829     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
001830     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
001831     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
001832*=====================================================            042300      
001833*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
001834*=====================================================            042500      
001835 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
001836     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
001837     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
001838     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
001839                                                                  043000      
001840*=====================================================            043100      
001841*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
001842*=====================================================            043300      
001843 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
001844     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
001845     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
001846     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
001847                                                                  043800      
001848*=====================================================            043900      
001849*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
001850*=====================================================            044100      
001851 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
001852     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
001853     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
001854     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
001855                                                                  044600      
001856*=====================================================            044700      
001857*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
001858*=====================================================            044900      
001859 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
001860     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
001861     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
001862     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
001863                                                                  045400      
001864*=====================================================            045500      
001865*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
001866*=====================================================            045700      
001867 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
001868     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
001869     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
001870     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
001871                                                                  046200      
001872*=====================================================            046300      
001873*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
001874*=====================================================            046500      
001875 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
001876     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
001877     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
001878     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
001879                                                                  047000      
001880*=====================================================            047100      
001881*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
001882*=====================================================            047300      
001883 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
001884     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
001885     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
001886     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001887                                                                  047800      
001888*=====================================================            047900      
001889*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001890*=====================================================            048100      
001891 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001892     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001893     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001894     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001895                                                                  048600      
001896*=====================================================            048700      
001897*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001898*=====================================================            048900      
001899 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001900     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001901     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001902     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001903                                                                  049400      
001904*=====================================================            049500      
001905*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001906*=====================================================            049700      
001907 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001908     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001909     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001910     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001911     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001912     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001913     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001914     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001915     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001916     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001917     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001918                                                                  050900      
001919*=====================================================            051000      
001920*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001921*=====================================================            051200      
001922 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001923     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001924     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001925     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001926     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001927                                                                  051800      
001928*=====================================================            051900      
001929*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001930*=====================================================            052100      
001931 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001932     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001933     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001934     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001935     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001936                                                                  052700      
001937*=====================================================            052800      
001938*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001939*=====================================================            053000      
001940 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001941     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001942     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001943     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001944     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001945                                                                  053600      
001946*=====================================================            053700      
001947*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001948*=====================================================            053900      
001949 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001950     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001951     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001952     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001953     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001954                                                                  054500      
001955*=====================================================            054600      
001956*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001957*=====================================================            054800      
001958 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001959     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001960     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001961     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001962     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001963                                                                  055400      
001964*=====================================================            055500      
001965*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001966*=====================================================            055700      
001967 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001968     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001969     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001970     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001971     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001972                                                                  056300      
001973*=====================================================            056400      
001974*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001975*=====================================================            056600      
001976 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001977     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001978     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001979     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001980     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001981                                                                  057200      
001982 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001983*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001984 77 WKS-L001-RESULT           PIC S9(11) BINARY.                  023500      
001985****************************************************************  023600      
001986*             VARIABLES PARA EL MANEJO DE CORTES               *  023700      
001987****************************************************************  023800      
001988 77 W77-CVES-408              PIC 9(04).                          023900      
001989 88 W88-CVES-408              VALUE 2202 THRU 2207,               024000      
001990                                    2213 THRU 2217,               024100      
001991                                    2223 THRU 2227,               024200      
001992                                    2401 THRU 2404,               024300      
001993                                    2411 THRU 2414,               024400      
001994                                    2424, 2434, 2444, 2454,       024500      
001995                                    2602 THRU 2609,               024600      
001996                                    2613 THRU 2619,               024700      
001997                                    2622 THRU 2627,               024800      
001998                                    2633 THRU 2637.               024900      
001999                                                                  025000      
002000 01 WKS-CTA-INTELLI.                                              025100      
002001    03 WKS-CTA-SUC-MDA        PIC 9(04).                          025200      
002002    03 WKS-CTA-CTA-MDA        PIC 9(07).                          025300      
002003                                                                  025400      
002004 77 W77-CTA-INTELLI           PIC 9(11).                          025500      
002005    88 W88-CTA-INTELLI        VALUE 00108863005,                  025600      
002006                                    00014110003,                  025650      
002007                                    00259713005,                  025700      
002008                                    00254339008,                  025800      
002009                                    00001864009,                  025900      
002010                                    00121339013,                  026000      
002011                                    00121339005,                  026100      
002012                                    00125865003,                  026200      
002013                                    00048550002,                  026300      
002014                                    02331220003,                  026400      
002015                                    02331219625,                  026500      
002016                                    02336083187,                  026600      
002017                                    00939324830,                  026700      
002018                                    00939311666,                  026800      
002019                                    02336083241,                  026900      
002020                                    00002308002,                  027000      
002021                                    02331336826,                  027100      
002022                                    43370001007,                  027200      
002023                                    43370001015,                  027300      
002024                                    43370030023,                  027400      
002025                                    43370038997,                  027500      
002026                                    43370019933,                  027600      
002027                                    43370035394,                  027700      
002028                                    05090071523,                  027800      
002029                                    01970989141,                  027900      
002030                                    05185733426,                  028000      
002031                                    09476535414,                  028100      
002032                                    09476532970,                  028200      
002033                                    09476545797,                  028300      
002034                                    09476545827,                  028400      
002035                                    09476545835,                  028500      
002036                                    09476545932,                  028600      
002037                                    09476545975,                  028700      
002038                                    09476546033,                  028800      
002039                                    09476546130,                  028900      
002040                                    09476546157,                  029000      
002041                                    09476546165,                  029100      
002042                                    09476546173,                  029200      
002043                                    09476546181,                  029300      
002044                                    09476546238,                  029400      
002045                                    09476546246,                  029500      
002046                                    09476546297,                  029600      
002047                                    09476546440,                  029700      
002048                                    09476546467,                  029800      
002049                                    09476546610.                  029900      
002050 77 W77-INTEL-CONTRATO        PIC 9(11).                          030000      
002051 88 W88-INTEL-CONTRATO        VALUE 09028530712,                  030100      
002052                                    09507585526,                  030150      
002053                                    09032201581,                  030200      
002054                                    10004066177,                  030300      
002055                                    10004066827,                  030400      
002056                                    09028538442,                  030500      
002057                                    09007742734,                  030600      
002058                                    09028539499,                  030700      
002059                                    09028539648,                  030800      
002060                                    09028539654,                  030900      
002061                                    09028539796,                  031000      
002062                                    19700989141,                  031100      
002063                                    09028544803,                  031200      
002064                                    09013761462,                  031300      
002065                                    09020630049,                  031400      
002066                                    09024773854,                  031500      
002067                                    09030899008,                  031600      
002068                                    09028160294,                  031700      
002069                                    09028161011,                  031800      
002070                                    23301219625,                  031900      
002071                                    23301220003,                  032000      
002072                                    23301336826,                  032100      
002073                                    09030781172,                  032200      
002074                                    09030870876,                  032300      
002075                                    09028545678,                  032400      
002076                                    51805733426,                  032500      
002077                                    09031541617,                  032600      
002078                                    09035519492,                  032700      
002079                                    09048542861,                  032800      
002080                                    09048549403,                  032900      
002081                                    09048549460,                  033000      
002082                                    09048552373,                  033100      
002083                                    09048554437,                  033200      
002084                                    09048557372,                  033300      
002085                                    09048557497,                  033400      
002086                                    09048558701,                  033500      
002087                                    09048559162,                  033600      
002088                                    09048561234,                  033700      
002089                                    09048562257,                  033800      
002090                                    09048562778,                  033900      
002091                                    09048564261,                  034000      
002092                                    09048565870,                  034100      
002093                                    09048567785,                  034200      
002094                                    09048568775,                  034300      
002095                                    09048637935.                  034400      
002096                                                                  034500      
002097 01 WKS-TABLA-CUENTAS.                                            034600      
002098    03 FILLER      PIC X(27) VALUE "00001864009 09028530712 010". 034700      
002099    03 FILLER      PIC X(27) VALUE "00002308002 09032201581 010". 034800      
002100    03 FILLER      PIC X(27) VALUE "43370001007 10004066177 010". 034900      
002101    03 FILLER      PIC X(27) VALUE "43370001015 10004066827 010". 035000      
002102    03 FILLER      PIC X(27) VALUE "00048550002 09028538442 010". 035100      
002103    03 FILLER      PIC X(27) VALUE "00108863005 09028539499 010". 035200      
002104    03 FILLER      PIC X(27) VALUE "00121339005 09028539648 010". 035300      
002105    03 FILLER      PIC X(27) VALUE "00121339013 09028539654 010". 035400      
002106    03 FILLER      PIC X(27) VALUE "00125865003 09028539796 010". 035500      
002107    03 FILLER      PIC X(27) VALUE "01970989141 19700989141 010". 035600      
002108    03 FILLER      PIC X(27) VALUE "00254339008 09028544803 010". 035700      
002109    03 FILLER      PIC X(27) VALUE "43370019933 09013761462 010". 035800      
002110    03 FILLER      PIC X(27) VALUE "43370030023 09020630049 010". 035900      
002111    03 FILLER      PIC X(27) VALUE "43370035394 09024773854 010". 036000      
002112    03 FILLER      PIC X(27) VALUE "43370038997 09030899008 010". 036100      
002113    03 FILLER      PIC X(27) VALUE "00939311666 09028160294 010". 036200      
002114    03 FILLER      PIC X(27) VALUE "00939324830 09028161011 010". 036300      
002115    03 FILLER      PIC X(27) VALUE "02331219625 23301219625 010". 036400      
002116    03 FILLER      PIC X(27) VALUE "02331220003 23301220003 010". 036500      
002117    03 FILLER      PIC X(27) VALUE "02331336826 23301336826 010". 036600      
002118    03 FILLER      PIC X(27) VALUE "02336083187 09030781172 010". 036700      
002119    03 FILLER      PIC X(27) VALUE "02336083241 09030870876 010". 036800      
002120    03 FILLER      PIC X(27) VALUE "00259713005 09028545678 010". 036900      
002121    03 FILLER      PIC X(27) VALUE "05090071523 09007742734 010". 037000      
002122    03 FILLER      PIC X(27) VALUE "05185733426 51805733426 010". 037100      
002123    03 FILLER      PIC X(27) VALUE "00014110003 09507585526 020". 037150      
002124    03 FILLER      PIC X(27) VALUE "09476532970 09031541617 020". 037200      
002125    03 FILLER      PIC X(27) VALUE "09476535414 09035519492 020". 037300      
002126    03 FILLER      PIC X(27) VALUE "09476545797 09048542861 020". 037400      
002127    03 FILLER      PIC X(27) VALUE "09476545827 09048549403 020". 037500      
002128    03 FILLER      PIC X(27) VALUE "09476545835 09048549460 020". 037600      
002129    03 FILLER      PIC X(27) VALUE "09476545932 09048552373 020". 037700      
002130    03 FILLER      PIC X(27) VALUE "09476545975 09048554437 020". 037800      
002131    03 FILLER      PIC X(27) VALUE "09476546033 09048557372 020". 037900      
002132    03 FILLER      PIC X(27) VALUE "09476546130 09048557497 020". 038000      
002133    03 FILLER      PIC X(27) VALUE "09476546157 09048558701 020". 038100      
002134    03 FILLER      PIC X(27) VALUE "09476546165 09048559162 020". 038200      
002135    03 FILLER      PIC X(27) VALUE "09476546173 09048561234 020". 038300      
002136    03 FILLER      PIC X(27) VALUE "09476546181 09048562257 020". 038400      
002137    03 FILLER      PIC X(27) VALUE "09476546238 09048562778 020". 038500      
002138    03 FILLER      PIC X(27) VALUE "09476546246 09048564261 020". 038600      
002139    03 FILLER      PIC X(27) VALUE "09476546297 09048565870 020". 038700      
002140    03 FILLER      PIC X(27) VALUE "09476546440 09048567785 020". 038800      
002141    03 FILLER      PIC X(27) VALUE "09476546467 09048568775 020". 038900      
002142    03 FILLER      PIC X(27) VALUE "09476546610 09048637935 020". 039000      
002143                                                                  039100      
002144                                                                  039200      
002145 01 WKS-TABLA-CUENTAS-R             REDEFINES WKS-TABLA-CUENTAS.  039300      
002146    03 WKS-CUENTAS-INTELLI          OCCURS 45 TIMES.              039400      
002147       05 WKS-INTEL-CUENTA          PIC 9(11).                    039500      
002148       05 FILLER                    PIC X(01).                    039600      
002149       05 WKS-INTEL-CTO             PIC 9(11).                    039700      
002150       05 FILLER                    PIC X(01).                    039800      
002151       05 WKS-INTEL-INDMOV          PIC 9(01).                    039900      
002152       05 WKS-INTEL-ARCHIVO         PIC 9(01).                    040000      
002153       05 WKS-INTEL-RESIDE          PIC 9(01).                    040100      
002154*===== SI WKS-IND-MOVCTA    = 0, LA CUENTA NO TUVO MOVIMIENTOS.   040200      
002155*===== SI WKS-INTEL-ARCHIVO = 0 LA CUENTA SE DEBE DE IR EN EL     040300      
002156*=====    ARCHIVO INTELLIMATCH SI NO EM EL ARCHIVO DE CRED. FAM.  040400      
002157*===== SI RESIDENCIA = 1 LA CUENTA PERTENECE AL CSI               040500      
002158                                                                  040600      
002159  01 WKS-SALDOS-CTA.                                              040700      
002160    03 WKS-SDOXCTA                  OCCURS 45 TIMES.              040800      
002161       05 WKS-SDO-INI-DIA           PIC S9(14)V9(02).             040900      
002162       05 WKS-SDO-FIN-DIA           PIC S9(14)V9(02).             041000      
002163       05 WKS-SDO-CALCULADO         PIC S9(14)V9(02).             041100      
002164 77 W77-SALDO                       PIC S9(14)V9(02).             041200      
002165 77 W77-TOTAL-DE-CUENTAS            PIC 9(02) VALUE 45.           041300      
002166 77 W77-CONTADOR-CUENTAS            PIC 9(04) VALUE ZERO.         041400      
002167 77 W77-TOTAL-ARCHIVOS              PIC 9(04) COMP.               041500      
002168 77 W77-CONTROL-ARCHIVOS            PIC 9(04) COMP VALUE ZERO.    041600      
002169 77 W77-DIF-ARCHIVOS                PIC 9(02) COMP.               041700      
002170******************************************************************041800      
002171*                  PARAMETROS LIBRERIA L020 DEL S500             *041900      
002172******************************************************************042000      
002173* FORMATO DE ENTRADA                                              042100      
002174                                                                  042200      
002175 01 WS-S500L020-I-SDO-INI-DIA       WITH LOWER-BOUNDS.            042300      
002176    03 WS-S500L020-I-SID-CTO        PIC 9(12) COMP.               042400      
002177    03 WS-S500L020-I-SID-FEC        PIC 9(08) COMP.               042500      
002178    03 FILLER                       PIC X(80).                    042600      
002179                                                                  042700      
002180 01 WS-S500L020-INPUT               WITH LOWER-BOUNDS.            042800      
002181    03 WS-S500L020-0101-FUNCION     PIC 9(02) COMP.               042900      
002182    03 WS-S500L020-0101-TIPOMDA     PIC 9(02) COMP.               043000      
002183    03 WS-S500L020-0101-MDA         PIC 9(16) COMP.               043100      
002184    03 WS-S500L020-0101-MDA-R       REDEFINES                     043200      
002185       WS-S500L020-0101-MDA.                                      043300      
002186       05 WS-S500L020-0101-SUCPROM  PIC 9(04) COMP.               043400      
002187       05 WS-S500L020-0101-CTA      PIC 9(12) COMP.               043500      
002188    03 WS-S500L020-0101-MOVSAD      PIC 9(02) COMP.               043600      
002189    03 FILLER                       PIC X(79).                    043700      
002190                                                                  043800      
002191* FORMATO DE SALIDA                                               043900      
002192                                                                  044000      
002193 01 WS-S500L020-O-SDO-INI-DIA WITH LOWER-BOUNDS.                  044100      
002194    03 WS-S500L020-O-500-SDO-INIDIA PIC 9(14)V99 COMP.            044200      
002195    03 WS-S500L020-O-408-SDO-INIDIA PIC 9(14)V99 COMP.            044300      
002196    03 FILLER                       PIC X(384).                   044400      
002197                                                                  044500      
002198 01 WS-S500L020-OUTPUT              WITH LOWER-BOUNDS.            044600      
002199    03 FILLER                       PIC X(14).                    044700      
002200    03 WS-S500L020-0201-NUM-PRODUCTO PIC 9(04) COMP.              044800      
002201    03 WS-S500L020-0201-NUM-INSTRUM  PIC 9(04) COMP.              044900      
002202    03 FILLER                        PIC X(382).                  045000      
002203                                                                  045100      
002204* RESULTADO DE LA LLAMADA                                         045200      
002205                                                                  045300      
002206 77 WS-S500L020-RESULT              PIC 9(11) BINARY.             045400      
002207                                                                  045500      
002208 01 WKS-TABLA-MSG.                                                045600      
002209    03 FILLER                       PIC X(46) VALUE               045700      
002210       "REGISTRO DE SALIDA INSUFICIENTE               ".          045800      
002211    03 FILLER                       PIC X(46) VALUE               045900      
002212       "FUNCION INVALIDA                              ".          046000      
002213    03 FILLER                       PIC X(46) VALUE               046100      
002214       "NO EXISTE REGISTRO                            ".          046200      
002215    03 FILLER                       PIC X(46) VALUE               046300      
002216       "ERROR EN DMSII, SE MANDA A LA LOG MIX EL ERROR".          046400      
002217    03 FILLER                       PIC X(46) VALUE               046500      
002218       "REINTENTE MAS TARDE                           ".          046600      
002219    03 FILLER                       PIC X(46) VALUE               046700      
002220       "EL CONTRATO NO PERTENECE AL CSI               ".          046800      
002221    03 FILLER                       PIC X(46) VALUE               046900      
002222       "EL EDOCTA ES SOLO PARA CTOS DE AHORROS        ".          047000      
002223    03 FILLER                       PIC X(46) VALUE               047100      
002224       "ERROR CALL S408                               ".          047200      
002225    03 FILLER                       PIC X(46) VALUE               047300      
002226       "MEDIO DE ACCESO INEXISTENTE                   ".          047400      
002227    03 FILLER                       PIC X(46) VALUE               047500      
002228       "ERROR CALL S151                               ".          047600      
002229    03 FILLER                       PIC X(46) VALUE               047700      
002230       "NO EXISTEN FACTORES DE CG Y CI                ".          047800      
002231    03 FILLER                       PIC X(46) VALUE               047900      
002232       "CTO CON LINCRED Y NO HAY LIGA CON S408        ".          048000      
002233    03 FILLER                       PIC X(46) VALUE               048100      
002234       "NO HAY TIPO DE CAMBIO                         ".          048200      
002235    03 FILLER                       PIC X(46) VALUE               048300      
002236       "ESTA LIBRERIA NO PUEDE GRABAR EL FILECON      ".          048400      
002237    03 FILLER                       PIC X(46) VALUE               048500      
002238       "NO EXISTE REGISTRO DE PAGO PENDIENTE          ".          048600      
002239    03 FILLER                       PIC X(46) VALUE               048700      
002240       "ERROR LLAVES PARA BUSQUEDA DE PAGPEND.        ".          048800      
002241    03 FILLER                       PIC X(46) VALUE               048900      
002242       "REINTENTE MAS TARDE                           ".          049000      
002243*INI - ISILOA                                                     049010      
002244    03 FILLER                    PIC X(46) VALUE                  049020      
002245       "SIN DESCRIPCION                               ".          049030      
002246    03 FILLER                    PIC X(46) VALUE                  049040      
002247       "SIN DESCRIPCION                               ".          049050      
002248    03 FILLER                    PIC X(46) VALUE                  049060      
002249       "CONTRATO EN PROCESO DE MIGRACION              ".          049070      
002250*FIN - ISILOA                                                     049080      
002251                                                                  049100      
002252 01 WKS-TABLA-MSG-R REDEFINES WKS-TABLA-MSG.                      049200      
002253*    02 TABLA-DESCRIPCION            OCCURS 17 TIMES.             049300      
002254*INI - ISILOA                                                     049320      
002255    02 TABLA-DESCRIPCION         OCCURS 20 TIMES.                 049340      
002256*FIN - ISILOA                                                     049360      
002257       03 TABLA-DESC-ERROR          PIC X(46).                    049400      
002258                                                                  049500      
002259 77 W77-ERR-S500                    PIC 9(04).                    049600      
002260                                                                  049700      
002261*===============================================================  049800      
002262* VARIABLES PARA EL SORT                                       =  049900      
002263*===============================================================  050000      
002264                                                                  050100      
002265 77 W77-REGISTROS-SORT              PIC 9(08) COMP.               050200      
002266 77 W77-MEMORIA-SORT                PIC 9(16) COMP.               050300      
002267 77 W77-DISCO-SORT                  PIC 9(16) COMP.               050400      
002268                                                                  050500      
002269***********************************************************       050600      
002270*       VARIABLES DE LECTURA DE LOG DEL S151              *       050700      
002271***********************************************************       050800      
002272                                                                  050900      
002273**** JCNS INI - ALTA DISPONIBILIDAD * IBM 20-01-15                050905      
002274 01 W77-FECHA-PROCESO151               PIC 9(08) .                050910      
002275**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 20-01-15                050915      
002276 01 W77-FECHA-PROCESO               PIC 9(08) .                   051000      
002277 01 WKS-FECHA-PROCESO REDEFINES W77-FECHA-PROCESO.                051020      
002278    03 WKS-FECHA-AAAA               PIC 9(04) .                   051040      
002279    03 WKS-FECHA-MMDD               PIC 9(04) .                   051060      
002280                                                                  051080      
002281 77 W77-BAN-S500                    PIC 9(02).                    051100      
002282 77 W77-FIN                         PIC 9(01) COMP VALUE 0.       051200      
002283    88  W88-FINLOG                  VALUE 1.                      051300      
002284 77 W77-ENCONTRADO                  PIC 9(02) VALUE ZERO.         051400      
002285 77 W77-REINTENTO                   PIC 9(02) COMP.               051500      
002286 77 W77-NUM-REG                     PIC 9(07) VALUE 0.            051600      
002287 77 W77-IND                         PIC 9(04) VALUE 0.            051700      
002288 77 W77-IND2                        PIC 9(04) VALUE 0.            051800      
002289 77 W77-IND-CTA                     PIC 9(02) COMP.               051900      
002290 77 WKS-VALUE                       PIC 9(08) VALUE 0.            052000      
002291 77 W77-ERROR-DES                   PIC 9(02) COMP.               052100      
002292**** JCNS INI - ALTA DISPONIBILIDAD * IBM 20-01-15                052105      
002293 77 W77-ERROR                       PIC 9(02) VALUE 0.            052110      
002294**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 20-01-15                052115      
002295 01 W77-SISTEMA-PARAMETRO           PIC 9(03).                    052200      
002296 77 W77-GCE                         PIC 9(08) VALUE ZERO.         052300      
002297                                                                  052302      
002298 01 A03-REG-HD.                                                   052310      
002299    02 A03-HD-ID                    PIC X(01) VALUE "H".          052320      
002300    02 A03-HD-FECHA                 PIC 9(08).                    052330      
002301    02 FILLER                       PIC X(188).                   052340      
002302                                                                  052350      
002303 01 A03-REG-TR.                                                   052360      
002304    02 A03-TR-ID                    PIC X(01) VALUE "T".          052370      
002305    02 A03-TR-TOTREG                PIC 9(08).                    052380      
002306    02 FILLER                       PIC X(188).                   052382      
002307                                                                  052390      
002308 01 WKS-LLAVE-ANT.                                                052400      
002309    03 WKS-LLAVE-ARCHIVO            PIC 9(02) COMP.               052500      
002310    03 WKS-LLAVE-NUM-CTA            PIC 9(12) COMP.               052600      
002311                                                                  052700      
002312*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002313*    COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".        052800      
002314**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
002315  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
002316  01 MENSAJE-LJ.                                                  100300      
002317     02 SISTEMA-LJ     PIC X(04).                                 100400      
002318     02 FILLER         PIC X VALUE "/".                           100500      
002319     02 PASO-LJ        PIC X(04).                                 100600      
002320     02 FILLER         PIC X VALUE "/".                           100700      
002321     02 MTP-LJ         PIC 9(03).                                 100800      
002322     02 FILLER         PIC X VALUE ":".                           100900      
002323     02 TIPO-LJ        PIC X.                                     101000      
002324     02 FILLER         PIC X VALUE ">".                           101100      
002325     02 CODIGO-LJ      PIC 9(06).                                 101200      
002326     02 FILLER         PIC X VALUE "<".                           101300      
002327     02 TEXTO-LJ       PIC X(250).                                101400      
002328*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002329*                                                                 052900      
002330 01  WKS-TEXTO                      PIC X(30).                    053000      
002331***********************************************************       053010      
002332**          REDEFINE MOTIVO DE DEVOLUCION                **       053020      
002333***********************************************************       053030      
002334 01 R01-MOTIVO-DEV                  PIC X(30).                    053031      
002335 01 R01-MOTIVO-DEV-R REDEFINES R01-MOTIVO-DEV.                    053032      
002336    04 FILLER                       PIC X(10).                    053033      
002337    04 MOTIVO-DEV                   PIC X(10).                    053034      
002338    04 FILLER                       PIC X(10).                    053035      
002339                                                                  053100      
002340/**************************************************************** 054400      
002341*             P R O C E D U R E     D I V I S I O N             * 054500      
002342***************************************************************** 054600      
002343 PROCEDURE DIVISION USING W77-SISTEMA-PARAMETRO.                  054700      
002344 00000-INICIO.                                                    054800      
002345                                                                  054900      
002346     MOVE "S151"                    TO SISTEMA-LJ                 055000      
002347     MOVE "P172"                    TO PASO-LJ                    055100      
002348     MOVE "002"                      TO MTP-LJ                    055200      
002349     PERFORM 01-100-00-LIBRERIAS        .                         055300      
002350**** JCNS INI - ALTA DISPONIBILIDAD * IBM 20-01-15                055305      
002351     IF WKS-VALUE = 0                                             055310      
002352         PERFORM 01-150-00-VERIFICA-B05.                          055315      
002353**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 20-01-15                055320      
002354     MOVE 500                       TO S080-CPPE-LLAVE2.          055400      
002355     PERFORM 02-200-00-CARGA-CATALOGOS  .                         055500      
002356     MOVE 408                       TO S080-CPPE-LLAVE2.          055600      
002357     PERFORM 02-200-00-CARGA-CATALOGOS  .                         055700      
002358     PERFORM 03-300-00-PROCESO          .                         055800      
002359     PERFORM 03-400-GENERA-ARCH-FALTANTES.                        055900      
002360     IF WKS-NUMCSI = 10                                           056000      
002361        PERFORM 03-500-00-UNE-ARCHIVOS                            056100      
002362                VARYING W77-IND FROM 1 BY 1                       056200      
002363                UNTIL   W77-IND > W77-TOTAL-ARCHIVOS              056300      
002364        PERFORM 05-500-00-ENVIA-ARCHIVOS                          056400      
002365                VARYING W77-IND FROM 1 BY 1                       056500      
002366                UNTIL   W77-IND > W77-TOTAL-ARCHIVOS.             056600      
002367**** JCNS INI - ALTA DISPONIBILIDAD * IBM 20-01-15                056605      
002368     IF WKS-VALUE = 0                                             056610      
002369           PERFORM 01-150-30-ACTUALIZA-B05.                       056615      
002370**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 20-01-15                056620      
002371     STOP RUN.                                                    056700      
002372*                                                                 056800      
002373  01-100-00-LIBRERIAS.                                            056900      
002374*=================                                                057000      
002375     CHANGE ATTRIBUTE TITLE         OF "LIB-DISP"    TO           057100      
002376        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          057200      
002377                                                                  057210      
002378     CHANGE ATTRIBUTE LIBACCESS    OF "ADMONXFERS" TO BYFUNCTION. 057220      
002379     CHANGE ATTRIBUTE FUNCTIONNAME OF "ADMONXFERS"                057230      
002380                                   TO "ADMONXFERS".               057240      
002381                                                                  057250      
002382     CHANGE ATTRIBUTE LIBACCESS     OF "SOPORTECOMS" TO BYFUNCTION057300      
002383     CHANGE ATTRIBUTE FUNCTIONNAME  OF "SOPORTECOMS" TO           057400      
002384                                      "SOPORTECOMS".              057500      
002385     CHANGE ATTRIBUTE LIBACCESS     OF "CTRLVERS" TO BYFUNCTION.  057600      
002386     CHANGE ATTRIBUTE FUNCTIONNAME  OF "CTRLVERS" TO "CTLVERS".   057700      
002387                                                                  057800      
002388     MOVE "S151L001CTL"             TO WKS-CTLVERS-LIBRERIA       057900      
002389     CALL "DAME_TIT IN CTRLVERS"                                  058000      
002390          USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO          058100      
002391          GIVING WKS-CTLVERS-STATUS.                              058200      
002392                                                                  058300      
002393     IF WKS-CTLVERS-STATUS < 0                                    058400      
002394        CHANGE ATTRIBUTE TITLE      OF "S151L001"  TO             058500      
002395               "(S151)S151/OBJECT/L001/CONTROL ON CMEMP."         058600      
002396     ELSE                                                         058700      
002397        CHANGE ATTRIBUTE TITLE      OF "S151L001"   TO            058800      
002398               WKS-CTLVERS-TITULO.                                058900      
002399                                                                  059000      
002400     CALL "CSIID OF SOPORTECOMS"    USING WKS-DATOS-HOST.         059100      
002401     MOVE WKS-NUMCSI                TO WKS-B01-CSI                059200      
002402                                       WKS-INT-CSI-UNI            059250      
002403                                       WKS-INT-CSI-GCE            059260      
002404                                       WKS-INT-CSI                059300      
002405                                       WKS-INT-SEC-GCE.           059320      
002406                                                                  059340      
002407     MOVE W77-SISTEMA-PARAMETRO     TO WKS-B01-SISTEMA            059400      
002408     MOVE 01                        TO WKS-B01-FUNCION.           059500      
002409     CALL "CONSISDIA IN S151L001"   USING  WKS-S151B01SISDIA      059600      
002410                                    GIVING WKS-L001-RESULT.       059700      
002411                                                                  059800      
002412     IF WKS-L001-RESULT > 0                                       059900      
002413        MOVE "ERROR EN S151/L001"   TO TEXTO-LJ                   060000      
002414        MOVE "O"                    TO TIPO-LJ                    060100      
002415        MOVE 020901                 TO CODIGO-LJ                  060200      
002416        CALL "LJ IN LIB-DISP"       USING CONTADOR-LJ, MENSAJE-LJ 060300      
002417        SET MYSELF(STATUS)          TO -1                         060400      
002418     ELSE                                                         060500      
002419        MOVE WKS-B01-NOMPACMOV      TO WKS-PACK-LOG               060600      
002420        MOVE WKS-B01-NOMPACDES      TO WKS-PACK-DES               060700      
002421        MOVE WKS-B01-NOMPACSAL      TO WKS-PACK-SALDOS.           060800      
002422                                                                  060900      
002423     MOVE ATTRIBUTE TASKVALUE       OF MYSELF TO WKS-VALUE.       061000      
002424                                                                  061100      
002425     IF WKS-VALUE > 0                                             061200      
002426        MOVE WKS-VALUE              TO W77-FECHA-PROCESO          061300      
002427     ELSE                                                         061400      
002428        MOVE WKS-B01-FECPRO             TO W77-FECHA-PROCESO      061500      
002429**** JCNS INI - ALTA DISPONIBILIDAD * IBM 20-01-15                061505      
002430         MOVE WKS-B01-FECPRO151         TO W77-FECHA-PROCESO151.  061510      
002431**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 20-01-15                061515      
002432     CHANGE ATTRIBUTE VALUE OF MYSELF TO W77-FECHA-PROCESO.       061600      
002433                                                                  061640      
002434     MOVE W77-FECHA-PROCESO         TO WKS-FEC-LOG                061700      
002435                                       WKS-FEC-DES                061800      
002436                                       WKS-FEC-SALDOS             061900      
002437                                       WKS-INT-FECHA              062000      
002438                                       WKS-INT-FECHA-UNI          062100      
002439                                       WKS-INT-FECHA-GCE          062110      
002440                                       A00-R00-INTE-FEC-APERTURA  062200      
002441                                       A00-R00-INTE-FEC-CIERRE  . 062300      
002442     MOVE WKS-FECHA-MMDD            TO WKS-INT-MMDD               062400      
002443                                       WKS-INT-MMDD-GCE.          062450      
002444     MOVE "S080BD01CON"             TO WKS-CTLVERS-LIBRERIA       062500      
002445     CALL "DAME_TIT IN CTRLVERS"    USING  WKS-CTLVERS-LIBRERIA   062600      
002446                                           WKS-CTLVERS-TITULO     062700      
002447                                    GIVING WKS-CTLVERS-STATUS.    062800      
002448                                                                  062900      
002449     IF WKS-CTLVERS-STATUS < 0                                    063000      
002450        MOVE SPACES                 TO TEXTO-LJ                   063100      
002451        MOVE "ERROR AL OBTENER NOMBRE S08BD01CON"                 063200      
002452                                    TO TEXTO-LJ                   063300      
002453        MOVE "O"                    TO TIPO-LJ                    063400      
002454        MOVE 020901                 TO CODIGO-LJ                  063500      
002455        CALL "LJ IN LIB-DISP"       USING CONTADOR-LJ, MENSAJE-LJ 063600      
002456     ELSE                                                         063700      
002457        CHANGE ATTRIBUTE TITLE      OF "S080BD01CON"              063800      
002458                                    TO WKS-CTLVERS-TITULO.        063900      
002459                                                                  064000      
002460     MOVE "S500L020SDOS"            TO WKS-CTLVERS-LIBRERIA       064100      
002461     CALL "DAME_TIT IN CTRLVERS"    USING  WKS-CTLVERS-LIBRERIA   064200      
002462                                           WKS-CTLVERS-TITULO     064300      
002463                                    GIVING WKS-CTLVERS-STATUS.    064400      
002464                                                                  064500      
002465     IF WKS-CTLVERS-STATUS < 0                                    064600      
002466        MOVE SPACES                 TO TEXTO-LJ                   064700      
002467        MOVE "ERROR AL OBTENER NOMBRE S500L020SDOS"               064800      
002468                                    TO TEXTO-LJ                   064900      
002469        MOVE "O"                    TO TIPO-LJ                    065000      
002470        MOVE 020901                 TO CODIGO-LJ                  065100      
002471        CALL "LJ IN LIB-DISP"       USING CONTADOR-LJ, MENSAJE-LJ 065200      
002472     ELSE                                                         065300      
002473        CHANGE ATTRIBUTE TITLE      OF "S500L020SDOS"             065400      
002474                                    TO WKS-CTLVERS-TITULO.        065500      
002475                                                                  066900      
002476 02-200-00-CARGA-CATALOGOS.                                       067000      
002477*==========================                                       067100      
002478     MOVE 151                       TO S080-CP-SISTEMA            067200      
002479     MOVE 177                       TO S080-CP-PROGRAMA           067300      
002480     MOVE 6                         TO S080-CPPE-CATALOGO         067400      
002481     MOVE 20                        TO S080-CPPE-CLAVE            067500      
002482     MOVE 2                         TO S080-CPPE-ORDEN-BUSQ       067600      
002483     MOVE 1                         TO S080-CPPE-REGISTROS        067700      
002484     MOVE 0                         TO S080-CPPE-LLAVE1           067800      
002485                                       S080-CPPE-LLAVE3           067900      
002486                                       S080-CPPE-LLAVE4           068000      
002487                                       S080-CPPE-LLAVE5           068100      
002488                                       S080-CPPE-LLAVE6  .        068200      
002489     MOVE W77-FECHA-PROCESO         TO S080-CPPE-FECHA-VIG        068300      
002490     MOVE 0                         TO S080-CPPE-FECHA-VIG        068400      
002491     MOVE 0                         TO S080-CPPE-FECHA-CONS       068500      
002492                                       S080-CPPE-NIVEL-INI        068600      
002493     MOVE 0                         TO W77-FIN.                   068700      
002494                                                                  068800      
002495     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    068900      
002496           USING  S080-CP-SISTEMA                                 069000      
002497                  S080-CP-PROGRAMA                                069100      
002498                  S080-CP-PARAMETRO-ENT                           069200      
002499                  S080-CP-PARAMETRO-SAL                           069300      
002500           GIVING S080-CP-RESULT           .                      069400      
002501     IF S080-CP-RESULT = 0 OR = 1                                 069500      
002502        PERFORM 02-201-00-CARGA-TRANSACCIONES                     069600      
002503                UNTIL W77-FIN > 0.                                069700      
002504                                                                  069800      
002505 02-201-00-CARGA-TRANSACCIONES.                                   069900      
002506*==============================                                   070000      
002507                                                                  070100      
002508     MOVE S080-CPPS-DATOS(1)        TO S080-CPPE-LLAVE1           070200      
002509                                       W77-IND                    070300      
002510     MOVE S080-CPPS-DATOS(2)        TO S080-CPPE-LLAVE2           070400      
002511     MOVE S080-CPPS-DATOS(3)        TO S080-CPPE-LLAVE3           070500      
002512     MOVE S080-CPPS-DATOS(4)        TO S080-CPPE-LLAVE4           070600      
002513     MOVE S080-CPPS-DATOS(5)        TO S080-CPPE-LLAVE5           070700      
002514     MOVE S080-CPPS-DATOS(6)        TO S080-CPPE-LLAVE6           070800      
002515     MOVE S080-CPPS-NIVEL-INI       TO S080-CPPE-NIVEL-INI        070900      
002516     MOVE S080-CPPS-FECHA-CONS      TO S080-CPPE-FECHA-CONS       071000      
002517     IF S080-CPPE-LLAVE2 = 500                                    071100      
002518        MOVE S080-CPPS-DATOS(6)     TO WKS-PT-NAT-ALFA(W77-IND)   071200      
002519        MOVE S080-CPPS-DATOS(11)    TO WKS-PT-NAT-S028(W77-IND)   071300      
002520        MOVE S080-CPPS-DATOS(17)    TO WKS-PT-CITI-500(W77-IND)   071400      
002521        IF S080-CPPS-DATOS(19) = 3                                071420      
002522           MOVE S080-CPPS-DATOS(19) TO WKS-PT-GCE-500(W77-IND)    071440      
002523        ELSE                                                      071460      
002524           NEXT SENTENCE                                          071480      
002525     ELSE                                                         071500      
002526        MOVE S080-CPPS-DATOS(6)     TO WKS-NAT-ALFA-408(W77-IND)  071600      
002527        MOVE S080-CPPS-DATOS(11)    TO WKS-NAT-S028-408(W77-IND)  071700      
002528        MOVE S080-CPPS-DATOS(17)    TO WKS-PT-CITI-408(W77-IND).  071800      
002529                                                                  071900      
002530     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    072000      
002531           USING  S080-CP-SISTEMA                                 072100      
002532                  S080-CP-PROGRAMA                                072200      
002533                  S080-CP-PARAMETRO-ENT                           072300      
002534                  S080-CP-PARAMETRO-SAL                           072400      
002535           GIVING S080-CP-RESULT          .                       072500      
002536     IF S080-CP-RESULT = 0 OR = 1                                 072600      
002537        NEXT SENTENCE                                             072700      
002538     ELSE                                                         072800      
002539        MOVE 1                      TO W77-FIN.                   072900      
002540                                                                  073000      
002541 03-300-00-PROCESO.                                               073100      
002542*==============                                                   073200      
002543     PERFORM 03-300-00-CUENTA-ARCH                                073300      
002544             VARYING W77-IND        FROM 1 BY 1                   073400      
002545             UNTIL   W77-IND >      W77-TOTAL-DE-CUENTAS.         073500      
002546                                                                  073600      
002547     MOVE W77-SISTEMA-PARAMETRO     TO WKS-TIT-SISTEMA            073700      
002548                                       WKS-TIT-SIST-DES.          073800      
002549     OPEN OUTPUT A02-MOVS151                                      073900      
002550                 A03-MOV-GCE.                                     073910      
002551     MOVE W77-FECHA-PROCESO         TO A03-HD-FECHA.              073920      
002552     WRITE A03-REG-GCE              FROM A03-REG-HD.              073930      
002553                                                                  073940      
002554     PERFORM 03-301-00-SELEC-MOVS    .                            074000      
002555                                                                  074002      
002556     MOVE W77-GCE                   TO A03-TR-TOTREG.             074004      
002557     WRITE A03-REG-GCE              FROM A03-REG-TR.              074006      
002558     CLOSE A03-MOV-GCE  WITH SAVE    .                            074010      
002559                                                                  074020      
002560     MOVE SPACES                  TO WKS-INTE-ARCHIVO.            074030      
002561     UNSTRING WKS-TIT-GCE         DELIMITED BY " "                074040      
002562         INTO WKS-INTE-ARCHIVO.                                   074050      
002563     PERFORM 05-500-10-SEND-INTELAR.                              074060      
002564                                                                  074070      
002565     MOVE 408                       TO WKS-TIT-SISTEMA            074100      
002566                                       WKS-TIT-SIST-DES.          074200      
002567     MOVE 408                       TO WKS-B01-SISTEMA            074205      
002568     MOVE 01                        TO WKS-B01-FUNCION.           074210      
002569     CALL "CONSISDIA IN S151L001"   USING  WKS-S151B01SISDIA      074215      
002570                                    GIVING WKS-L001-RESULT.       074220      
002571                                                                  074225      
002572     IF WKS-L001-RESULT > 0                                       074230      
002573        MOVE "ERROR EN S151/L001"   TO TEXTO-LJ                   074235      
002574        MOVE "O"                    TO TIPO-LJ                    074240      
002575        MOVE 020901                 TO CODIGO-LJ                  074245      
002576        CALL "LJ IN LIB-DISP"       USING CONTADOR-LJ, MENSAJE-LJ 074250      
002577        SET MYSELF(STATUS)          TO -1                         074255      
002578     ELSE                                                         074260      
002579        MOVE WKS-B01-NOMPACMOV      TO WKS-PACK-LOG               074265      
002580        MOVE WKS-B01-NOMPACDES      TO WKS-PACK-DES.              074270      
002581                                                                  074280      
002582     PERFORM 03-301-00-SELEC-MOVS    .                            074300      
002583     CLOSE A02-MOVS151  WITH SAVE    .                            074400      
002584     PERFORM 03-302-00-ORDENA-MOVS   .                            074500      
002585     PERFORM 03-303-00-SELEC-SDOS    .                            074600      
002586     PERFORM 03-304-00-GENERA-ARCH   .                            074700      
002587                                                                  074800      
002588 03-300-00-CUENTA-ARCH .                                          074900      
002589*=======================                                          075000      
002590    IF WKS-INTEL-ARCHIVO(W77-IND) > W77-TOTAL-ARCHIVOS            075100      
002591       MOVE WKS-INTEL-ARCHIVO(W77-IND)                            075200      
002592                                    TO W77-TOTAL-ARCHIVOS.        075300      
002593                                                                  075400      
002594*======   INICIA SELECCION DE MOVIMEINTOS PARA ORDENAR   =====    075500      
002595                                                                  075600      
002596 03-301-00-SELEC-MOVS.                                            075700      
002597*====================                                             075800      
002598     OPEN INPUT  LOG151                                           075900      
002599                 DESS151.                                         076000      
002600     MOVE ZERO                      TO W77-FIN.                   076100      
002601     READ LOG151 INTO A00-R00-HDR-MOV                             076200      
002602                 AT END MOVE 1      TO W77-FIN.                   076300      
002603     IF W77-FIN = 0                                               076400      
002604        READ LOG151 INTO A00-R01-REGMOV                           076500      
002605                    AT END MOVE 1   TO W77-FIN.                   076600      
002606     IF WKS-TIT-SISTEMA = 500                                     076700      
002607        PERFORM 03-301-10-ELIGE-MOVS-500                          076800      
002608                UNTIL W77-FIN = 1                                 076900      
002609     ELSE                                                         077000      
002610        PERFORM 03-301-20-ELIGE-MOVS-408                          077100      
002611                UNTIL W77-FIN = 1.                                077200      
002612     CLOSE LOG151  WITH RELEASE                                   077300      
002613           DESS151 WITH RELEASE.                                  077400      
002614                                                                  077500      
002615 03-301-10-ELIGE-MOVS-500.                                        077600      
002616*=====================                                            077700      
002617     IF A00-R01-ORIGEN = 1 OR 3                                   077800      
002618*MFPD-INI ADECUACION FILTRO DE PROCESOS TELETON                   077810      
002619        IF A00-R01-TIPO-PROC = 40 OR 41 OR 42 OR 43               077820      
002620           NEXT SENTENCE                                          077830      
002621        ELSE                                                      077840      
002622*MFPD-FIN ADECUACION FILTRO DE PROCESOS TELETON                   077850      
002623           PERFORM 03-302-10-VALIDA-CLAVE                         077860      
002624                   VARYING W77-IND FROM 1 BY 1                    077862      
002625                   UNTIL   W77-IND > 5 OR                         077865      
002626                   A00-R01-CVETRAN(W77-IND) = 0                   077866      
002627           MOVE 1                   TO W77-IND                    077868      
002628           MOVE 500                 TO A02-MOV-SISTEMA            077900      
002629           PERFORM 03-303-11-REVISA-MOVTO.                        078000      
002630                                                                  078100      
002631     READ LOG151 INTO A00-R01-REGMOV                              078200      
002632                 AT END MOVE 1      TO W77-FIN.                   078300      
002633     IF A00-R01-FUNCION = 99                                      078400      
002634        MOVE 1                      TO W77-FIN.                   078500      
002635 03-302-10-VALIDA-CLAVE.                                          078600      
002636*=======================                                          078602      
002637     IF WKS-PT-GCE-500(A00-R01-CVETRAN(W77-IND)) = 3       AND    078604      
002638        A00-R01-MONEDA                           = 5       AND    078605      
002639       (WKS-PT-NAT-ALFA(A00-R01-CVETRAN(W77-IND))= 1 OR 2) AND    078606      
002640       (WKS-PT-NAT-S028(A00-R01-CVETRAN(W77-IND))= 1 OR 2) AND    078607      
002641       (A00-R01-CVETRAN(W77-IND) = 1248 OR 1249 OR 1251 OR        078608      
002642        A00-R01-CVETRAN(W77-IND) = 1253 OR 1256 OR 1257 OR        078609      
002643        A00-R01-CVETRAN(W77-IND) = 2499 OR 2500 OR 2502 OR        078610      
002644        A00-R01-CVETRAN(W77-IND) = 2504 OR 2507 OR 2508)          078611      
002645        ADD  1                      TO W77-GCE                    078612      
002646        MOVE A00-R01-MDA-SUC        TO WKS-CTA-SUC-MDA            078613      
002647        MOVE A00-R01-MDA-CTA        TO WKS-CTA-CTA-MDA            078614      
002648        MOVE A00-R01-MOTIVO-DEV     TO R01-MOTIVO-DEV             078615      
002649        PERFORM 03-301-30-GRABA-REG-GCE.                          078616      
002650                                                                  078626      
002651                                                                  078628      
002652 03-303-11-REVISA-MOVTO.                                          078700      
002653*===================                                              078800      
002654     MOVE A00-R01-CONTRATO          TO W77-INTEL-CONTRATO.        078900      
002655     MOVE A00-R01-MDA-SUC           TO WKS-CTA-SUC-MDA            079000      
002656     MOVE A00-R01-MDA-CTA           TO WKS-CTA-CTA-MDA            079100      
002657     MOVE WKS-CTA-INTELLI           TO W77-CTA-INTELLI.           079200      
002658     IF W88-CTA-INTELLI OR W88-INTEL-CONTRATO                     079300      
002659        MOVE ZERO                   TO W77-ENCONTRADO             079400      
002660        PERFORM 03-301-12-BUSCA-CTO                               079500      
002661                VARYING W77-IND     FROM 1 BY 1                   079600      
002662                UNTIL   W77-IND > W77-TOTAL-DE-CUENTAS OR         079700      
002663                        W77-ENCONTRADO = 1                        079800      
002664        IF W77-ENCONTRADO = 1                                     079850      
002665           IF A02-MOV-SISTEMA = 500                               079900      
002666              PERFORM 03-301-14-MUEVE-DATOS-500                   080000      
002667                      VARYING W77-IND  FROM 1 BY 1                080100      
002668                      UNTIL   W77-IND > 5    OR                   080200      
002669                              A00-R01-CVETRAN(W77-IND) = 0        080300      
002670           ELSE                                                   080400      
002671              PERFORM 03-301-16-MUEVE-DATOS-408                   080500      
002672                      VARYING W77-IND  FROM 1 BY 1                080600      
002673                      UNTIL   W77-IND > 5 OR                      080700      
002674                              A00-R01-CVETRAN(W77-IND) = 0.       080800      
002675                                                                  080900      
002676 03-301-12-BUSCA-CTO.                                             081000      
002677*================                                                 081100      
002678     IF A00-R01-CONTRATO =  WKS-INTEL-CTO(W77-IND)                081200      
002679        MOVE 1                      TO W77-ENCONTRADO             081300      
002680        MOVE WKS-INTEL-ARCHIVO(W77-IND)                           081400      
002681                                    TO A02-MOV-ARCHIVO            081500      
002682        MOVE WKS-INTEL-CUENTA(W77-IND)                            081600      
002683                                    TO A02-MOV-NUM-CTA-MDA.       081700      
002684 03-301-14-MUEVE-DATOS-500.                                       081800      
002685*======================                                           081900      
002686     IF A00-R01-CVETRAN(W77-IND) =  15   OR 16   OR 1009 OR       082000      
002687                                    1072 OR 2111 OR 2115          082100      
002688        NEXT SENTENCE                                             082200      
002689     ELSE                                                         082300      
002690        PERFORM 03-301-20-VALIDA-NAT.                             082400      
002691                                                                  082500      
002692 03-301-16-MUEVE-DATOS-408.                                       082600      
002693*==========================                                       082700      
002694     IF A00-R01-CONTRATO =  WKS-INTEL-CTO(W77-IND)                082800      
002695        IF A02-MOV-ARCHIVO = 1                                    082900      
002696           IF (WKS-PT-CITI-408(A00-R01-CVETRAN(W77-IND)) = 1 OR 2)083000      
002697              PERFORM 03-301-22-GRABA-REGISTRO                    083100      
002698           ELSE                                                   083200      
002699             NEXT SENTENCE                                        083300      
002700        ELSE                                                      083400      
002701           MOVE A00-R01-CVETRAN(W77-IND) TO W77-CVES-408          083500      
002702           IF W88-CVES-408                                        083600      
002703              PERFORM 03-301-22-GRABA-REGISTRO.                   083700      
002704                                                                  083800      
002705 03-301-20-VALIDA-NAT.                                            083900      
002706*=====================                                            084000      
002707     IF (WKS-PT-CITI-500(A00-R01-CVETRAN(W77-IND))= 1 OR 2)       084070      
002708        IF (WKS-PT-NAT-ALFA(A00-R01-CVETRAN(W77-IND))= 1 OR 2) OR 084100      
002709           (WKS-PT-NAT-S028(A00-R01-CVETRAN(W77-IND))= 1 OR 2)    084200      
002710           PERFORM 03-301-22-GRABA-REGISTRO.                      084300      
002711                                                                  084400      
002712 03-301-22-GRABA-REGISTRO.                                        084500      
002713*=========================                                        084600      
002714     MOVE A00-R01-MDA-SUC           TO A02-MOV-SUC-CTA  .         084700      
002715     MOVE A00-R01-MDA-CTA           TO A02-MOV-NUM-CTA  .         084800      
002716     MOVE A00-R01-FECMOV            TO A02-MOV-FECOPE   .         084900      
002717     MOVE A00-R01-HORMOV            TO A02-MOV-HR-OPE   .         085000      
002718     MOVE A00-R01-FECCONT           TO A02-MOV-FEC-CONTA.         085100      
002719     MOVE A00-R01-FECVAL            TO A02-MOV-FEC-VALOR.         085200      
002720     MOVE SPACES                    TO A02-MOV-TIPO     .         085300      
002721     MOVE A00-R01-IMPORTE(W77-IND)  TO A02-MOV-IMPORTE  .         085400      
002722     MOVE A00-R01-AUTORIZA          TO A02-MOV-REFEREN  .         085500      
002723     MOVE A00-R01-REFERENCIA        TO A02-MOV-SUREFER  .         085550      
002724     IF A00-R01-SISTEMA= 500                                      085600      
002725        IF WKS-PT-NAT-ALFA(A00-R01-CVETRAN(W77-IND)) = 1          085700      
002726           MOVE "D"                 TO A02-MOV-NATURALEZA         085800      
002727        ELSE                                                      085900      
002728        IF WKS-PT-NAT-ALFA(A00-R01-CVETRAN(W77-IND)) = 2          085910      
002729           MOVE "C"                 TO A02-MOV-NATURALEZA         085920      
002730        ELSE                                                      085930      
002731           IF WKS-PT-NAT-S028(A00-R01-CVETRAN(W77-IND))= 1        085940      
002732              MOVE "D"              TO A02-MOV-NATURALEZA         085950      
002733           ELSE                                                   085960      
002734              MOVE "C"              TO A02-MOV-NATURALEZA         086000      
002735     ELSE                                                         086100      
002736        MOVE "D"                    TO A02-MOV-NATURALEZA.        086200      
002737*=== D = CARGO (DEBITO),     C = ABONO (CREDITO)                  086300      
002738     MOVE ZERO                      TO W77-ERROR-DES              086400      
002739     IF A00-R01-APUDES > 0                                        086500      
002740        COMPUTE W77-NUM-REG = A00-R01-APUDES + 1                  086600      
002741        READ DESS151 INTO A01-R01-DATOS                           086700      
002742             INVALID KEY  MOVE 1    TO  W77-ERROR-DES.            086800      
002743                                                                  086900      
002744     IF W77-ERROR-DES = 1                                         087000      
002745        MOVE ZERO                   TO A02-MOV-SUREFER            087100      
002746                                       A02-MOV-OTRAREF            087200      
002747        MOVE SPACES                 TO A02-MOV-DETALLE            087300      
002748     ELSE                                                         087400      
002749        INSPECT A01-R01-REF-CLIENTE REPLACING ALL WKS-NULO BY " " 087440      
002750        MOVE A01-R01-REF-CLIENTE    TO A02-MOV-OTRAREF            087600      
002751        MOVE SPACES                 TO A02-MOV-DETALLE.           087700      
002752                                                                  087800      
002753     ADD 1                          TO W77-REGISTROS-SORT.        087900      
002754     WRITE A02-MOV-DATOS.                                         088000      
002755                                                                  088100      
002756 03-301-30-GRABA-REG-GCE.                                         088102      
002757*========================                                         088104      
002758     MOVE "D"                       TO A00-R01-INTE-CVE-REG  .    088106      
002759     MOVE A00-R01-MDA-SUC           TO A02-MOV-SUC-CTA       .    088108      
002760     MOVE A00-R01-MDA-CTA           TO A02-MOV-NUM-CTA       .    088110      
002761     MOVE "158224"                  TO A00-R01-INTE-NUM-CTA  .    088111      
002762     MOVE A00-R01-FECMOV            TO A02-MOV-FECOPE        .    088112      
002763     MOVE A00-R01-HORMOV            TO A02-MOV-HR-OPE        .    088114      
002764     MOVE A00-R01-FECCONT           TO A00-R01-INTE-FEC-CONTA.    088116      
002765     IF A00-R01-FECVAL = 0                                        088117      
002766        MOVE A00-R01-FECCONT        TO A00-R01-INTE-FEC-VALOR     088118      
002767     ELSE                                                         088119      
002768        MOVE A00-R01-FECVAL         TO A00-R01-INTE-FEC-VALOR.    088121      
002769     MOVE "OP"                      TO A00-R01-INTE-TIPO     .    088122      
002770     MOVE A00-R01-IMPORTE(W77-IND)  TO A00-R01-INTE-IMPORTE  .    088123      
002771     MOVE WKS-CTA-INTELLI           TO A00-R01-INTE-REFEREN  .    088124      
002772     MOVE MOTIVO-DEV                TO A00-R01-INTE-SUREFER  .    088126      
002773     MOVE A00-R01-CVETRAN(W77-IND)  TO A00-R01-INTE-CVE      .    088128      
002774     IF A00-R01-SISTEMA= 500                                      088130      
002775        IF WKS-PT-NAT-ALFA(A00-R01-CVETRAN(W77-IND)) = 1          088132      
002776           MOVE "C"                 TO A00-R01-INTE-NAT           088134      
002777        ELSE                                                      088136      
002778        IF WKS-PT-NAT-ALFA(A00-R01-CVETRAN(W77-IND)) = 2          088138      
002779           MOVE "D"                 TO A00-R01-INTE-NAT           088140      
002780        ELSE                                                      088142      
002781           IF WKS-PT-NAT-S028(A00-R01-CVETRAN(W77-IND))= 1        088144      
002782              MOVE "C"              TO A00-R01-INTE-NAT           088146      
002783           ELSE                                                   088148      
002784             MOVE "D"               TO A00-R01-INTE-NAT           088150      
002785     ELSE                                                         088152      
002786        MOVE "C"                    TO A00-R01-INTE-NAT.          088154      
002787*=== D = CARGO (DEBITO),     C = ABONO (CREDITO)                  088156      
002788     MOVE ZERO                      TO W77-ERROR-DES              088158      
002789*    IF A00-R01-APUDES > 0                                        088160      
002790*       COMPUTE W77-NUM-REG = A00-R01-APUDES + 1                  088162      
002791*       READ DESS151 INTO A01-R01-DATOS                           088164      
002792*            INVALID KEY  MOVE 1    TO  W77-ERROR-DES.            088166      
002793                                                                  088168      
002794*    IF W77-ERROR-DES = 1                                         088170      
002795*       MOVE SPACES                 TO A00-R01-INTE-SUREFER       088172      
002796*                                      A00-R01-INTE-OTRAREF       088174      
002797*                                      A00-R01-INTE-DETALLE       088176      
002798*    ELSE                                                         088178      
002799*       INSPECT A01-R01-REF-CLIENTE REPLACING ALL WKS-NULO BY " " 088180      
002800*       MOVE A01-R01-REF-CLIENTE    TO A00-R01-INTE-SUREFER       088182      
002801*       MOVE SPACES                 TO A00-R01-INTE-DETALLE.      088184      
002802                                                                  088186      
002803     ADD 1                          TO W77-REGISTROS-SORT.        088188      
002804     WRITE A03-REG-GCE FROM A00-R01-INTE-REGMOV.                  088192      
002805                                                                  088194      
002806 03-301-20-ELIGE-MOVS-408.                                        088200      
002807*=====================                                            088300      
002808     IF A00-R01-ORIGEN = 1 OR 3                                   088400      
002809        MOVE 408                    TO A02-MOV-SISTEMA            088500      
002810        PERFORM 03-303-11-REVISA-MOVTO.                           088600      
002811                                                                  088700      
002812     READ LOG151 INTO A00-R01-REGMOV                              088800      
002813                 AT END MOVE 1      TO W77-FIN.                   088900      
002814     IF A00-R01-FUNCION = 99                                      089000      
002815        MOVE 1                      TO W77-FIN.                   089100      
002816                                                                  089200      
002817*======   FINALIZA SELECCION DE  MOVIMEINTOS PARA ORDENAR   ===== 089300      
002818 03-302-00-ORDENA-MOVS.                                           089500      
002819*======================                                           089600      
002820     COMPUTE W77-MEMORIA-SORT = ( 22 + 3 ) *  2000 + 1500         089700      
002821     COMPUTE W77-DISCO-SORT   =  22 * W77-REGISTROS-SORT * 3.5    089800      
002822     SORT SMOVS151 ON ASCENDING KEY A02-SD-LLAVE                  089900      
002823          USING  A02-MOVS151                                      090000      
002824          GIVING A02-MOVS151                                      090100      
002825          MEMORY SIZE W77-MEMORIA-SORT WORDS                      090200      
002826          DISK   SIZE W77-DISCO-SORT   WORDS.                     090300      
002827                                                                  090400      
002828*=========== EN BASE AL ARCHIVO DE SALDOS SE SELECCIONAN          090500      
002829*            LOS CANTRATOS RESIDENTES DE LA COBERTURA   *======== 090600      
002830                                                                  090700      
002831 03-303-00-SELEC-SDOS.                                            090800      
002832*=====================                                            090900      
002833     MOVE W77-SISTEMA-PARAMETRO     TO WKS-TIT-SIST-SALDOS.       091000      
002834     MOVE ZERO                      TO W77-FIN.                   091100      
002835                                                                  091200      
002836     OPEN INPUT SALDOS151.                                        091300      
002837     READ SALDOS151    AT END MOVE 1 TO W77-FIN.                  091400      
002838     IF W77-FIN = 0                                               091500      
002839        READ SALDOS151 AT END MOVE 1 TO W77-FIN.                  091600      
002840                                                                  091700      
002841     PERFORM 03-303-10-SELEC-SALDOS                               091800      
002842             UNTIL W77-FIN    = 1   OR                            091900      
002843                   W77-CONTADOR-CUENTAS = W77-TOTAL-DE-CUENTAS.   092000      
002844                                                                  092100      
002845     CLOSE SALDOS151 WITH RELEASE.                                092200      
002846                                                                  092300      
002847 03-303-10-SELEC-SALDOS.                                          092400      
002848*====================                                             092500      
002849     MOVE A02-R01-CNT               TO W77-INTEL-CONTRATO.        092600      
002850     IF W88-INTEL-CONTRATO                                        092700      
002851        ADD 1                       TO W77-CONTADOR-CUENTAS       092800      
002852        MOVE ZERO                   TO W77-ENCONTRADO             092900      
002853        PERFORM 03-303-12-BUSCA-CONTRATO                          093000      
002854                VARYING W77-IND     FROM 1  BY 1                  093100      
002855                UNTIL   W77-IND > W77-TOTAL-DE-CUENTAS OR         093200      
002856                        W77-ENCONTRADO = 1                        093300      
002857        IF W77-ENCONTRADO = 1                                     093400      
002858           COMPUTE W77-IND = W77-IND - 1                          093500      
002859           MOVE ZERO                TO W77-BAN-S500               093600      
002860           PERFORM 03-303-20-TRAE-SDO-INICIO                      093700      
002861                   UNTIL W77-BAN-S500  = 1.                       093800      
002862     READ SALDOS151 AT END MOVE 1   TO W77-FIN.                   093900      
002863                                                                  094000      
002864 03-303-12-BUSCA-CONTRATO.                                        094100      
002865*======================                                           094200      
002866     IF A02-R01-CNT =  WKS-INTEL-CTO(W77-IND)                     094300      
002867        MOVE 1                      TO WKS-INTEL-RESIDE(W77-IND)  094400      
002868        PERFORM 03-303-14-BUSCA-SDOFIN                            094500      
002869                VARYING W77-IND2    FROM 1 BY 1                   094600      
002870*                UNTIL   W77-IND2 > 13   OR                       094700      
002871                UNTIL   W77-IND2 > 30   OR                        094750      
002872                        W77-ENCONTRADO = 1                        094800      
002873        IF W77-ENCONTRADO = 0                                     094900      
002874           MOVE ZERO                TO WKS-SDO-FIN-DIA(W77-IND).  095000      
002875                                                                  095100      
002876 03-303-14-BUSCA-SDOFIN.                                          095200      
002877*=======================                                          095300      
002878     IF A02-R01-CVESDO(W77-IND2) = 2                              095400      
002879        MOVE 1                      TO W77-ENCONTRADO             095500      
002880        MOVE A02-R01-IMPT(W77-IND2) TO WKS-SDO-FIN-DIA(W77-IND)   095600      
002881        IF WKS-SDO-FIN-DIA(W77-IND) > 0                           095620      
002882           MOVE "C"                 TO A00-R00-INTE-NAT-CIERRE    095640      
002883        ELSE                                                      095660      
002884           MOVE "D"                 TO A00-R00-INTE-NAT-CIERRE.   095680      
002885                                                                  095700      
002886 03-303-20-TRAE-SDO-INICIO .                                      095800      
002887*===========================                                      095900      
002888     MOVE LOW-VALUES                TO WS-S500L020-O-SDO-INI-DIA  096000      
002889                                       WS-S500L020-I-SDO-INI-DIA. 096100      
002890     MOVE ZERO                      TO WS-S500L020-RESULT.        096200      
002891     MOVE W77-INTEL-CONTRATO        TO WS-S500L020-I-SID-CTO.     096300      
002892     MOVE W77-FECHA-PROCESO         TO WS-S500L020-I-SID-FEC.     096400      
002893                                                                  096500      
002894     CALL "S500L020SDOINIDIA IN S500L020SDOS"                     096600      
002895           USING  WS-S500L020-I-SDO-INI-DIA,                      096700      
002896                  WS-S500L020-O-SDO-INI-DIA                       096800      
002897           GIVING WS-S500L020-RESULT.                             096900      
002898                                                                  097000      
002899     IF WS-S500L020-RESULT = 0                                    097100      
002900        COMPUTE WKS-SDO-INI-DIA(W77-IND) =                        097200      
002901                                 WS-S500L020-O-500-SDO-INIDIA -   097300      
002902                                 WS-S500L020-O-408-SDO-INIDIA     097400      
002903        MOVE 1                      TO      W77-BAN-S500          097500      
002904     ELSE                                                         097600      
002905     IF WS-S500L020-RESULT = 5 OR 17                              097700      
002906        ADD 1                       TO      W77-REINTENTO         097800      
002907        IF W77-REINTENTO = 8                                      097900      
002908           MOVE WS-S500L020-RESULT  TO      W77-ERR-S500          098000      
002909           MOVE "O"                 TO TIPO-LJ                    098100      
002910           MOVE 020901              TO CODIGO-LJ                  098200      
002911                STRING " ERROR : ", W77-ERR-S500                  098300      
002912                " NO CONTESTA LIB. S500L020 FAVOR DE VERIFICAR "  098400      
002913                DELIMITED BY SIZE INTO TEXTO-LJ                   098500      
002914                CALL "LJ IN LIB-DISP"                             098600      
002915                                    USING CONTADOR-LJ,MENSAJE-LJ  098700      
002916                MOVE 0              TO     W77-REINTENTO          098800      
002917        ELSE                                                      098900      
002918           WAIT(30)                                               099000      
002919     ELSE                                                         099100      
002920     IF WS-S500L020-RESULT = 12                                   099200      
002921        MOVE WS-S500L020-RESULT     TO      W77-ERR-S500          099300      
002922        MOVE "O"                    TO TIPO-LJ                    099400      
002923        MOVE 020901                 TO CODIGO-LJ                  099500      
002924        STRING " ERROR : ", W77-ERR-S500 " "                      099600      
002925               TABLA-DESC-ERROR(W77-ERR-S500)                     099700      
002926        DELIMITED BY SIZE INTO TEXTO-LJ                           099800      
002927        CALL "LJ IN LIB-DISP"       USING CONTADOR-LJ,MENSAJE-LJ  099900      
002928        WAIT(5)                                                   100000      
002929     ELSE                                                         100100      
002930*INI - ISILOA                                                     100120      
002931*        IF W77-ERR-S500 < 17                                     100140      
002932        IF WS-S500L020-RESULT < 21                                100160      
002933*FIN - ISILOA                                                     100180      
002934           MOVE WS-S500L020-RESULT  TO      W77-ERR-S500          100300      
002935           MOVE "I"                 TO TIPO-LJ                    100400      
002936           MOVE 020101              TO CODIGO-LJ                  100500      
002937           STRING " ERROR : ", W77-ERR-S500 " "                   100600      
002938                  TABLA-DESC-ERROR(W77-ERR-S500)                  100700      
002939           DELIMITED BY SIZE INTO TEXTO-LJ                        100800      
002940           CALL "LJ IN LIB-DISP"    USING CONTADOR-LJ,MENSAJE-LJ  100900      
002941           MOVE 1                   TO W77-BAN-S500               101000      
002942           MOVE ZERO                TO WKS-SDO-INI-DIA(W77-IND)   101100      
002943        ELSE                                                      101200      
002944*INI - ISILOA                                                     101220      
002945            MOVE WS-S500L020-RESULT        TO      W77-ERR-S500   102115      
002946            MOVE "I"    TO TIPO-LJ                                102120      
002947            MOVE 020101 TO CODIGO-LJ                              102125      
002948            STRING " ERROR : ", W77-ERR-S500                      102130      
002949            DELIMITED BY SIZE INTO TEXTO-LJ                       102135      
002950            CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ   102140      
002951            MOVE 1                            TO      W77-BAN-S500102145      
002952            MOVE ZEROS                        TO      W77-SALDO.  102150      
002953*FIN - ISILOA                                                     102155      
002954                                                                  102200      
002955*====== UNA VEZ QUE SE TIENEN LOS MOVIMIENTOS Y SALDOS            102300      
002956*           SE INICIA LA GENERACION DE ARCHIVOS          *======  102400      
002957                                                                  102500      
002958 03-304-00-GENERA-ARCH.                                           102600      
002959*======================                                           102700      
002960     OPEN INPUT  A02-MOVS151.                                     102800      
002961     MOVE ZERO                      TO W77-FIN                    102900      
002962                                       WKS-LLAVE-ARCHIVO          103000      
002963                                       WKS-LLAVE-NUM-CTA.         103020      
002964     MOVE 1                         TO WKS-INT-SEC                103050      
002965                                       WKS-INT-SEC-UNI.           103051      
002966     CHANGE ATTRIBUTE TITLE         OF E01-INTELLI                103052      
002967                                    TO WKS-TIT-INTEL.             103054      
002968     OPEN OUTPUT E01-INTELLI.                                     103056      
002969                                                                  103058      
002970     READ A02-MOVS151 AT END MOVE 1 TO W77-FIN.                   103100      
002971     PERFORM 03-304-10-LEE-MOV      UNTIL W77-FIN = 1.            103200      
002972     MOVE A02-MOV-NUM-CTA-MDA       TO WKS-CTA-INTELLI.           103300      
002973     PERFORM 03-304-20-GRABA-CTAS-SINMOV                          103400      
002974             VARYING W77-IND        FROM 1 BY 1                   103500      
002975             UNTIL   W77-IND > W77-TOTAL-DE-CUENTAS               103600      
002976     MOVE WKS-CTA-INTELLI           TO A02-MOV-NUM-CTA-MDA.       103700      
002977     CLOSE A02-MOVS151              WITH PURGE.                   103800      
002978     IF WKS-NUMCSI = 10                                           103900      
002979        CHANGE ATTRIBUTE TITLE      OF E01-INTELLI                104000      
002980                                    TO WKS-TIT-INTEL-UNI.         104100      
002981                                                                  104200      
002982     CLOSE E01-INTELLI              WITH SAVE.                    104300      
002983                                                                  104400      
002984 03-304-10-LEE-MOV.                                               104500      
002985*==================                                               104600      
002986     IF A02-MOV-LLAVE-COMP = WKS-LLAVE-ANT                        104700      
002987        IF W77-IND-CTA > 0 AND W77-IND-CTA < 45                   104800      
002988           PERFORM 03-304-12-CALCULA-SALDO                        104900      
002989           PERFORM 03-304-14-ESCRIBE-REG-DETALLE                  105000      
002990        ELSE                                                      105100      
002991          NEXT SENTENCE                                           105200      
002992     ELSE                                                         105300      
002993        MOVE ZERO                   TO W77-SALDO                  105400      
002994        IF A02-MOV-ARCHIVO NOT = WKS-LLAVE-ARCHIVO                105500      
002995           IF WKS-LLAVE-ARCHIVO = 0                               105520      
002996              COMPUTE W77-DIF-ARCHIVOS = A02-MOV-ARCHIVO -        105522      
002997                                         WKS-LLAVE-ARCHIVO        105524      
002998              IF W77-DIF-ARCHIVOS = 1                             105530      
002999                 PERFORM 03-304-18-GRABA-INICIO                   105540      
003000              ELSE                                                105545      
003001                 PERFORM 03-304-16-CAMBIA-ARCHIVO                 105550      
003002                 PERFORM 03-304-18-GRABA-INICIO                   105555      
003003           ELSE                                                   105560      
003004              PERFORM 03-304-16-CAMBIA-ARCHIVO                    105600      
003005              PERFORM 03-304-18-GRABA-INICIO                      105700      
003006        ELSE                                                      105800      
003007           PERFORM 03-304-18-GRABA-INICIO.                        105900      
003008     MOVE A02-MOV-LLAVE-COMP        TO WKS-LLAVE-ANT.             106000      
003009     READ A02-MOVS151 AT END MOVE 1 TO W77-FIN.                   106100      
003010                                                                  106200      
003011 03-304-12-CALCULA-SALDO.                                         106300      
003012*========================                                         106400      
003013     IF A02-MOV-NATURALEZA = "D"                                  106500      
003014        COMPUTE W77-SALDO = W77-SALDO - A02-MOV-IMPORTE           106600      
003015     ELSE                                                         106700      
003016     IF A02-MOV-NATURALEZA = "C"                                  106800      
003017        COMPUTE W77-SALDO  = W77-SALDO + A02-MOV-IMPORTE.         106900      
003018                                                                  107000      
003019 03-304-14-ESCRIBE-REG-DETALLE.                                   107100      
003020*==========================                                       107200      
003021***  IF A02-MOV-NATURALEZA = "C"                                  107300      
003022***     MOVE "D"                    TO A00-R01-INTE-NAT           107400      
003023***  ELSE                                                         107500      
003024***  IF A02-MOV-NATURALEZA = "A"                                  107600      
003025     MOVE A02-MOV-NATURALEZA        TO A00-R01-INTE-NAT      .    107700      
003026     MOVE A02-MOV-NUM-CTA-MDA       TO A00-R01-INTE-NUM-CTA  .    107800      
003027     MOVE A02-MOV-FEC-CONTA         TO A00-R01-INTE-FEC-CONTA.    107900      
003028     IF A02-MOV-FEC-VALOR = 0                                     107920      
003029        MOVE A02-MOV-FEC-CONTA      TO A00-R01-INTE-FEC-VALOR     107940      
003030     ELSE                                                         107960      
003031        MOVE A02-MOV-FEC-VALOR      TO A00-R01-INTE-FEC-VALOR.    108000      
003032     MOVE A02-MOV-TIPO              TO A00-R01-INTE-TIPO     .    108100      
003033     MOVE A02-MOV-IMPORTE           TO A00-R01-INTE-IMPORTE  .    108300      
003034     MOVE A02-MOV-REFEREN           TO A00-R01-INTE-REFEREN  .    108400      
003035     MOVE A02-MOV-SUREFER           TO A00-R01-INTE-SUREFER  .    108500      
003036     MOVE A02-MOV-OTRAREF           TO A00-R01-INTE-OTRAREF  .    108600      
003037     MOVE A02-MOV-DETALLE           TO A00-R01-INTE-DETALLE  .    108700      
003038     MOVE W77-SALDO                 TO                            108800      
003039                               WKS-SDO-CALCULADO(W77-IND-CTA).    108900      
003040     WRITE E01-R01-INTELLI        FROM A00-R01-INTE-REGMOV   .    109000      
003041                                                                  109100      
003042 03-304-16-CAMBIA-ARCHIVO.                                        109200      
003043*=========================                                        109300      
003044     MOVE A02-MOV-NUM-CTA-MDA       TO WKS-CTA-INTELLI            109500      
003045     PERFORM 03-304-20-GRABA-CTAS-SINMOV                          109600      
003046             VARYING W77-IND        FROM 1 BY 1                   109700      
003047             UNTIL   W77-IND > W77-TOTAL-DE-CUENTAS               109800      
003048     MOVE WKS-CTA-INTELLI           TO A02-MOV-NUM-CTA-MDA        109900      
003049     MOVE WKS-INT-SEC               TO W77-CONTROL-ARCHIVOS.      109920      
003050                                                                  110000      
003051     IF WKS-NUMCSI = 10                                           110100      
003052        CHANGE ATTRIBUTE TITLE      OF E01-INTELLI                110200      
003053                                    TO WKS-TIT-INTEL-UNI          110300      
003054        CLOSE E01-INTELLI           WITH SAVE                     110400      
003055     ELSE                                                         110500      
003056        CLOSE E01-INTELLI           WITH SAVE.                    110600      
003057                                                                  110650      
003058     ADD 1                          TO W77-CONTROL-ARCHIVOS.      110700      
003059     MOVE A02-MOV-ARCHIVO           TO WKS-INT-SEC                110800      
003060                                       WKS-INT-SEC-UNI            110850      
003061     IF W77-CONTROL-ARCHIVOS = A02-MOV-ARCHIVO                    110900      
003062        NEXT SENTENCE                                             111000      
003063     ELSE                                                         111200      
003064        PERFORM 03-304-30-ARCH-VACIO                              111500      
003065                VARYING W77-IND2 FROM W77-CONTROL-ARCHIVOS BY 1   111600      
003066                UNTIL   W77-IND2 = A02-MOV-ARCHIVO                111700      
003067        MOVE A02-MOV-ARCHIVO        TO WKS-INT-SEC                111800      
003068                                       WKS-INT-SEC-UNI.           111900      
003069                                                                  112000      
003070     CHANGE ATTRIBUTE TITLE         OF E01-INTELLI                112100      
003071                                    TO WKS-TIT-INTEL.             112200      
003072     OPEN OUTPUT E01-INTELLI.                                     112300      
003073                                                                  112400      
003074 03-304-18-GRABA-INICIO.                                          112500      
003075*=======================                                          112600      
003076     MOVE ZERO                      TO W77-ENCONTRADO             112700      
003077                                       W77-IND-CTA.               112800      
003078     PERFORM 03-304-20-BUSCA-SALDO-INICIO                         112900      
003079             VARYING W77-IND-CTA    FROM 1 BY 1                   113000      
003080             UNTIL   W77-IND-CTA > W77-TOTAL-DE-CUENTAS OR        113100      
003081                     W77-ENCONTRADO = 1.                          113200      
003082     IF W77-ENCONTRADO = 1                                        113300      
003083        COMPUTE W77-IND-CTA = W77-IND-CTA - 1                     113400      
003084        WRITE E01-R01-INTELLI       FROM A00-R00-HDR-INTE         113500      
003085        PERFORM 03-304-12-CALCULA-SALDO                           113600      
003086        PERFORM 03-304-14-ESCRIBE-REG-DETALLE .                   113700      
003087                                                                  113800      
003088                                                                  113900      
003089 03-304-20-BUSCA-SALDO-INICIO.                                    114000      
003090*=========================                                        114100      
003091     IF A02-MOV-NUM-CTA-MDA   = WKS-INTEL-CUENTA(W77-IND-CTA)     114200      
003092        MOVE 1                      TO W77-ENCONTRADO             114300      
003093        MOVE WKS-SDO-INI-DIA(W77-IND-CTA)                         114400      
003094                                    TO W77-SALDO                  114500      
003095                                       A00-R00-INTE-SDO-APERTURA  114600      
003096        MOVE WKS-SDO-FIN-DIA(W77-IND-CTA)                         114700      
003097                                    TO A00-R00-INTE-SDO-CIERRE    114800      
003098        MOVE 1                      TO                            114900      
003099                                   WKS-INTEL-INDMOV(W77-IND-CTA)  115000      
003100        MOVE A02-MOV-NUM-CTA-MDA                                  115100      
003101                                    TO A00-R00-INTE-NUM-CTA       115200      
003102        MOVE ZEROES                 TO A00-R00-INTE-CEROS         115300      
003103        IF WKS-SDO-INI-DIA(W77-IND-CTA) > 0                       115400      
003104           MOVE "C"                 TO A00-R00-INTE-NAT           115500      
003105        ELSE                                                      115600      
003106           MOVE "D"                 TO A00-R00-INTE-NAT.          115700      
003107                                                                  115800      
003108 03-304-20-GRABA-CTAS-SINMOV.                                     115900      
003109*=========================                                        116000      
003110     IF WKS-INTEL-INDMOV (W77-IND)    = 0           AND           116100      
003111        WKS-INTEL-ARCHIVO(W77-IND)    = WKS-INT-SEC AND           116200      
003112        WKS-INTEL-RESIDE (W77-IND)    = 1                         116300      
003113        PERFORM 03-304-25-SIN-MOVTOS.                             116400      
003114                                                                  116500      
003115 03-304-25-SIN-MOVTOS.                                            116600      
003116*=====================                                            116700      
003117     MOVE WKS-SDO-INI-DIA(W77-IND)  TO A00-R00-INTE-SDO-CIERRE    116800      
003118                                       A00-R00-INTE-SDO-APERTURA  116900      
003119     MOVE WKS-SDO-FIN-DIA(W77-IND)                                117000      
003120                                    TO A00-R00-INTE-SDO-CIERRE    117100      
003121     MOVE 1                         TO WKS-INTEL-INDMOV(W77-IND)  117200      
003122     IF WKS-SDO-INI-DIA(W77-IND) > 0                              117300      
003123        MOVE "C"                    TO A00-R00-INTE-NAT           117400      
003124     ELSE                                                         117500      
003125        MOVE "D"                    TO A00-R00-INTE-NAT.          117600      
003126                                                                  117610      
003127     IF WKS-SDO-FIN-DIA(W77-IND) > 0                              117620      
003128        MOVE "C"                    TO A00-R00-INTE-NAT-CIERRE    117630      
003129     ELSE                                                         117640      
003130        MOVE "D"                    TO A00-R00-INTE-NAT-CIERRE.   117650      
003131                                                                  117660      
003132     MOVE ZEROES                    TO A00-R00-INTE-CEROS         117700      
003133     MOVE WKS-INTEL-CUENTA(W77-IND) TO A00-R00-INTE-NUM-CTA       118900      
003134     WRITE E01-R01-INTELLI          FROM A00-R00-HDR-INTE.        119100      
003135                                                                  119200      
003136 03-304-30-ARCH-VACIO.                                            119300      
003137*=====================                                            119400      
003138     CHANGE ATTRIBUTE TITLE         OF E01-INTELLI                119500      
003139                                    TO WKS-TIT-INTEL.             119600      
003140     OPEN OUTPUT E01-INTELLI.                                     119700      
003141     PERFORM 03-304-20-GRABA-CTAS-SINMOV                          119800      
003142             VARYING W77-IND        FROM 1 BY 1                   119900      
003143             UNTIL   W77-IND > W77-TOTAL-DE-CUENTAS.              120000      
003144                                                                  120100      
003145     IF WKS-NUMCSI = 10                                           120200      
003146        CHANGE ATTRIBUTE TITLE      OF E01-INTELLI                120300      
003147                                    TO WKS-TIT-INTEL-UNI          120400      
003148        CLOSE E01-INTELLI           WITH SAVE                     120500      
003149     ELSE                                                         120600      
003150        CLOSE E01-INTELLI           WITH SAVE.                    120700      
003151                                                                  120800      
003152 03-400-GENERA-ARCH-FALTANTES.                                    120900      
003153*=============================                                    121000      
003154     ADD 1                          TO WKS-INT-SEC                121100      
003155                                       WKS-INT-SEC-UNI.           121300      
003156     PERFORM 03-304-30-ARCH-VACIO                                 121400      
003157             VARYING W77-IND2 FROM WKS-INT-SEC BY 1               121500      
003158             UNTIL   W77-IND2 > W77-TOTAL-ARCHIVOS.               121600      
003159                                                                  121700      
003160 03-500-00-UNE-ARCHIVOS.                                          121800      
003161*=======================                                          121900      
003162     MOVE W77-IND                   TO WKS-INT-SEC                122000      
003163                                       WKS-INT-SEC-UNI            122100      
003164     MOVE 4                         TO WKS-INT-CSI.               122200      
003165     CHANGE ATTRIBUTE TITLE         OF E02-INTELLI-UNI            122300      
003166                                    TO WKS-TIT-INTEL-UNI.         122400      
003167     CHANGE ATTRIBUTE TITLE         OF E01-INTELLI                122500      
003168                                    TO WKS-TIT-INTEL.             122600      
003169     OPEN EXTEND E02-INTELLI-UNI.                                 122700      
003170     OPEN INPUT  E01-INTELLI.                                     122800      
003171     MOVE 0                         TO W77-FIN.                   122900      
003172     READ E01-INTELLI AT END MOVE 1 TO W77-FIN.                   123000      
003173     PERFORM 04-400-10-UNEARCH      UNTIL W77-FIN = 1.            123100      
003174                                                                  123200      
003175     CLOSE E02-INTELLI-UNI          WITH SAVE.                    123300      
003176     CLOSE E01-INTELLI              WITH RELEASE.                 123400      
003177                                                                  123500      
003178 04-400-10-UNEARCH.                                               123600      
003179*==================                                               123700      
003180     WRITE E02-R01-INTELLI-UNI      FROM E01-R01-INTELLI.         123800      
003181     READ E01-INTELLI               AT END MOVE 1 TO W77-FIN.     123900      
003182                                                                  124000      
003183 05-500-00-ENVIA-ARCHIVOS.                                        124100      
003184*=========================                                        124200      
003185     MOVE SPACES                  TO WKS-INTE-ARCHIVO.            124202      
003186     MOVE W77-IND                 TO WKS-INT-SEC-UNI .            124204      
003187     UNSTRING WKS-TIT-INTEL-UNI DELIMITED BY " "                  124205      
003188         INTO WKS-INTE-ARCHIVO.                                   124210      
003189     PERFORM 05-500-10-SEND-INTELAR.                              124211      
003190                                                                  124212      
003191 05-500-10-SEND-INTELAR.                                          124213      
003192*======================                                           124214      
003193     MOVE ZERO                    TO W77-INTE-SNT.                124215      
003194     CALL "INTELARSND IN ADMONXFERS" USING  WKS-INTE-ARCHIVO      124220      
003195                                     GIVING W77-INTE-SNT.         124225      
003196     IF W77-INTE-SNT = 0                                          124230      
003197        NEXT SENTENCE                                             124235      
003198     ELSE                                                         124240      
003199        MOVE SPACES                TO TEXTO-LJ                    124245      
003200        MOVE "E"                   TO TIPO-LJ                     124250      
003201        MOVE 020901                TO CODIGO-LJ                   124255      
003202        STRING "ERROR EN EL ENVIO DEL ARCHIVO "                   124260      
003203               WKS-INTE-ARCHIVO                                   124265      
003204               " A INTELLIMATCH"                                  124270      
003205        DELIMITED BY SIZE                                         124275      
003206        INTO TEXTO-LJ                                             124280      
003207        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      124285      
003208                                                                  124300      
003209**** JCNS INI - ALTA DISPONIBILIDAD * IBM 20-01-15                124400      
003210                                                                  124500      
003211 01-150-00-VERIFICA-B05.                                          124600      
003212***** CONSULTAR SI EXISTE B05 CON LA FECHA DE PROCESO             124700      
003213     MOVE 01                      TO WKS-B05-FUNCION              124800      
003214     MOVE W77-SISTEMA-PARAMETRO   TO WKS-B05-SISTEMA              124900      
003215     MOVE W77-FECHA-PROCESO151    TO WKS-B05-FCHPRO               125000      
003216     MOVE 172                     TO WKS-B05-NUMPRO               125100      
003217     MOVE ZEROS                   TO WKS-B05-FCHINI               125200      
003218                                     WKS-B05-NUMREGINI.           125300      
003219                                                                  125400      
003220     CALL "B05PROCESOS IN S151L001" USING WKS-B05PROCESOS         125500      
003221                                    GIVING W77-RESULT-LIBCON.     125600      
003222                                                                  125700      
003223     IF W77-RESULT-LIBCON = 0                                     125800      
003224          IF WKS-B05-STAPGM = 0                                   125900      
003225              NEXT SENTENCE                                       126000      
003226          ELSE                                                    126100      
003227              STOP RUN                                            126200      
003228     ELSE                                                         126300      
003229          PERFORM 01-150-20-CREA-B05.                             126400      
003230                                                                  126500      
003231                                                                  126600      
003232 01-150-20-CREA-B05.                                              126700      
003233     MOVE 19                      TO WKS-B05-FUNCION              126800      
003234     MOVE W77-SISTEMA-PARAMETRO   TO WKS-B05-SISTEMA              126900      
003235     MOVE W77-FECHA-PROCESO151    TO WKS-B05-FCHPRO               127000      
003236     MOVE 172                     TO WKS-B05-NUMPRO               127100      
003237     MOVE ZEROS                   TO WKS-B05-FCHINI               127200      
003238                                     WKS-B05-NUMREGINI.           127300      
003239                                                                  127400      
003240     CALL "B05PROCESOS IN S151L001" USING WKS-B05PROCESOS         127500      
003241                                    GIVING W77-RESULT-LIBCON.     127600      
003242                                                                  127700      
003243     IF W77-RESULT-LIBCON = 0                                     127800      
003244         NEXT SENTENCE                                            127900      
003245     ELSE                                                         128000      
003246         MOVE "I" TO TIPO-LJ                                      128100      
003247         MOVE 051010 TO CODIGO-LJ                                 128200      
003248         MOVE W77-RESULT-LIBCON            TO W77-ERROR           128300      
003249                                                                  128400      
003250         STRING "FUNCION " WKS-B05-FUNCION " ERROR # " W77-ERROR  128500      
003251         "ERROR AL LLAMADO DE B05PROCESOS" WKS-B05-SISTEMA " "    128600      
003252                       WKS-B05-NUMPRO " " W77-FECHA-PROCESO151    128700      
003253         DELIMITED BY SIZE INTO TEXTO-LJ                          128800      
003254         CALL "LJ IN LIB-DISP"       USING CONTADOR-LJ,           128900      
003255                                           MENSAJE-LJ.            129000      
003256                                                                  129100      
003257 01-150-30-ACTUALIZA-B05.                                         129200      
003258     MOVE 37                      TO WKS-B05-FUNCION              129300      
003259     MOVE W77-SISTEMA-PARAMETRO   TO WKS-B05-SISTEMA              129400      
003260     MOVE W77-FECHA-PROCESO151    TO WKS-B05-FCHPRO               129500      
003261     MOVE 172                     TO WKS-B05-NUMPRO               129600      
003262     MOVE ZEROS                   TO WKS-B05-FCHINI               129700      
003263                                     WKS-B05-NUMREGINI            129800      
003264****** ESTATUS DE TERMINACION DEL PROCESO                         129900      
003265     MOVE 01                      TO WKS-B05-STAPGM.              130000      
003266                                                                  130100      
003267     CALL "B05PROCESOS IN S151L001" USING WKS-B05PROCESOS         130200      
003268                                    GIVING W77-RESULT-LIBCON.     130300      
003269     IF W77-RESULT-LIBCON = 0                                     130400      
003270          NEXT SENTENCE                                           130500      
003271     ELSE                                                         130600      
003272         MOVE "I" TO TIPO-LJ                                      130700      
003273         MOVE 051010 TO CODIGO-LJ                                 130800      
003274         MOVE W77-RESULT-LIBCON            TO W77-ERROR           130900      
003275                                                                  131000      
003276         STRING "FUNCION " WKS-B05-FUNCION " ERROR # " W77-ERROR  131100      
003277         "ERROR AL LLAMADO DE B05PROCESOS" WKS-B05-SISTEMA " "    131200      
003278                       WKS-B05-NUMPRO " " W77-FECHA-PROCESO151    131300      
003279         DELIMITED BY SIZE INTO TEXTO-LJ                          131400      
003280         CALL "LJ IN LIB-DISP"       USING CONTADOR-LJ,           131500      
003281                                           MENSAJE-LJ.            131600      
003282                                                                  131700      
003283**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 20-01-15                131800      
