000001$$ SET LIST STACK FREE LINEINFO NEWID "S151LIB020"                000100      
000002$$ SET OPTIMIZE FEDLEVEL = 5                                      000200      
000003$$ SHARING = SHAREDBYRUNUNIT TEMPORARY                            000300      
000004%**********************************************************       000320      
000005% RECOMPILACION POR EL UPGRADE DEL MCP A 55               *       000322      
000006% 20141205 05MTP001 MJGRG                                 *       000324      
000007%**********************************************************       000326      
000008 IDENTIFICATION DIVISION.                                         000400      
000009 PROGRAM-ID.             S151LIB020.                              000500      
000010 AUTHOR.                 RICARDO MORENO A.                        000600      
000011 INSTALLATION.           BANAMEX                                  000700      
000012                         INGENIERIA DE SISTEMAS                   000800      
000013                         CENTRO DE DESARROLLO LEON.               000900      
000014 DATE-WRITTEN.           ABRIL     1996.                          001000      
000015 DATE-COMPILED.                                                   001100      
000016 SECURITY.               COPYRIGHT 1996 BY THE AUTHOR.            001200      
000017 ENVIRONMENT DIVISION.                                            001300      
000018 CONFIGURATION SECTION.                                           001400      
000019 SOURCE-COMPUTER.        A10.                                     001500      
000020 OBJECT-COMPUTER.        A10.                                     001600      
000021 INPUT-OUTPUT SECTION.                                            001700      
000022 FILE-CONTROL.                                                    001800      
000023 DATA DIVISION.                                                   001900      
000024 FILE SECTION.                                                    002000      
000025 DATA-BASE SECTION.                                               002100      
000026*DB          S151BD99CONTROL.                                     002200      
000027 DB SDODB = S151BD11SDOS151.                                      002300      
000028 DB MOVDB = S151BD12MC001S151.                                    002400      
000029 WORKING-STORAGE SECTION.                                         002500      
000030*===============================================                  002600      
000031*       PARAMETROS LIBRERIA DE ESTRUCTURA      =                  002700      
000032*===============================================                  002800      
000033 77  W77-L710-SISTEMA              PIC S9(11) BINARY.             002900      
000034 77  W77-L710-PROGRAMA             PIC S9(11) BINARY.             003000      
000035 01  WKS-L710-ENT.                                                003100      
000036     03 WKS-EL710-CAT              PIC 9(06) COMP.                003200      
000037     03 WKS-EL710-CLAVE            PIC 9(02) COMP.                003300      
000038     03 WKS-EL710-BUSQUEDA         PIC 9(02) COMP.                003400      
000039     03 WKS-EL710-REGISTROS        PIC 9(02) COMP.                003500      
000040     03 WKS-EL710-LLAVE1           PIC 9(12).                     003600      
000041     03 WKS-EL710-LLAVE2           PIC 9(12).                     003700      
000042     03 WKS-EL710-LLAVE3           PIC 9(12).                     003800      
000043     03 WKS-EL710-LLAVE4           PIC 9(12).                     003900      
000044     03 WKS-EL710-LLAVE5           PIC 9(12).                     004000      
000045     03 WKS-EL710-LLAVE6           PIC 9(12).                     004100      
000046     03 WKS-EL710-FEC-VIG          PIC 9(06) COMP.                004200      
000047     03 WKS-EL710-FECINI           PIC 9(06) COMP.                004300      
000048     03 WKS-EL710-NIVINI           PIC 9(02) COMP.                004400      
000049     03 FILLER                     PIC X(11).                     004500      
000050 01  WKS-L710-SAL.                                                004600      
000051     03 WKS-SL710-NUMREG           PIC 9(02) COMP.                004700      
000052     03 WKS-SL710-CAT              PIC 9(06) COMP.                004800      
000053     03 WKS-SL710-FECINI           PIC 9(06) COMP.                004900      
000054     03 WKS-SL710-NIVINI           PIC 9(02) COMP.                005000      
000055     03 FILLER                     PIC X(22).                     005100      
000056     03 WKS-SL710-REG.                                            005200      
000057        05 WKS-SL710-DAT           PIC 9(12) OCCURS 28 TIMES.     005300      
000058        05 WKS-SL710-FECALTA       PIC 9(06) COMP.                005400      
000059        05 WKS-SL710-FECBAJA       PIC 9(06) COMP.                005500      
000060        05 WKS-SL710-FECMOD        PIC 9(06) COMP.                005600      
000061        05 FILLER                  PIC X(42).                     005700      
000062 77  W77-L710-RESULT               PIC S9(11) BINARY.             005800      
000063 77  W77-EOF                       PIC 9(02) COMP.                005900      
000064*===============================================                  006000      
000065*       PARAMETROS LIBRERIA CTLVERS            =                  006100      
000066*===============================================                  006200      
000067 01  WKS-LIBID                     PIC X(12).                     006300      
000068 01  WKS-NOMBLIB                   PIC X(72).                     006400      
000069 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             006500      
000070*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000071*   COPY "(S151)S151/FORMATO/ENVIO/P025.".                        006600      
000072                                                                  001000      
000073                                                                  002000      
000074                                                                  003000      
000075                                                                  004000      
000076******************************************************************005000      
000077*                                                                *006000      
000078*   FORMATO DE LLAMADO DE MOVIMIENTOS AL S151 PARA TODOS         *007000      
000079*   LOS SISTEMAS:                                                *008000      
000080*   - LONGITUD DEL REGISTRO 540 CARACTERES                       *009000      
000081*     - LONGITUD DE DATOS GENERALES   180 CARACTERES             *010000      
000082*     - LONGITUD DE DATOS ADICIONALES 360 CARACTERES             *011000      
000083*                                                                *012000      
000084******************************************************************013000      
000085                                                                  014000      
000086 01 WKS-MOV-DATOS WITH LOWER-BOUNDS.                              015000      
000087*01 WKS-MOV-DATOS.                                                015010      
000088    03 WKS-MOV-FUNCION                 PIC  9(02)      COMP.      016000      
000089    03 WKS-MOV-SISTEMA                 PIC  9(04)      COMP.      017000      
000090    03 WKS-MOV-PRODUCTO                PIC  9(04)      COMP.      018000      
000091    03 WKS-MOV-TIPOCREDITO REDEFINES WKS-MOV-PRODUCTO             018100      
000092                                       PIC  9(04)      COMP.      018200      
000093    03 WKS-MOV-INSTRUMENTO             PIC  9(02)      COMP.      019000      
000094    03 WKS-MOV-FONDO       REDEFINES WKS-MOV-INSTRUMENTO          019100      
000095                                       PIC  9(02)      COMP.      019200      
000096    03 WKS-MOV-SUCPROM                 PIC  9(04)      COMP.      020000      
000097    03 WKS-MOV-CONTRATO                PIC  9(16)      COMP.      021000      
000098                                                                  022000      
000099    03 WKS-TAB-CVEIMP                  OCCURS 5 TIMES.            023000      
000100       04 WKS-MOV-CVETRAN              PIC  9(04)      COMP.      024000      
000101       04 WKS-MOV-INDLEY               PIC  9(02)      COMP.      025000      
000102       04 WKS-MOV-ESQCON               PIC  9(04)      COMP.      026000      
000103       04 WKS-MOV-TM REDEFINES WKS-MOV-ESQCON                     026100      
000104                                       PIC  9(04)      COMP.      026200      
000105       04 WKS-MOV-IMPORTE              PIC  9(14)V99   COMP.      027000      
000106                                                                  028000      
000107    03 WKS-MOV-FECMOV                  PIC  9(08)      COMP.      029000      
000108    03 WKS-MOV-HORMOV                  PIC  9(06)      COMP.      030000      
000109    03 WKS-MOV-FECCONT                 PIC  9(08)      COMP.      031000      
000110    03 WKS-MOV-FECCONT-R               REDEFINES WKS-MOV-FECCONT. 032000      
000111       04 WKS-MOV-FECCONT-AAMM         PIC  9(06)      COMP.      033000      
000112       04 WKS-MOV-FECCONT-DD           PIC  9(02)      COMP.      034000      
000113    03 WKS-MOV-FECVAL                  PIC  9(08)      COMP.      035000      
000114    03 WKS-MOV-AUTORIZA                PIC  9(08)      COMP.      036000      
000115    03 WKS-MOV-AUT3ER                  PIC  9(08)      COMP.      037000      
000116    03 WKS-MOV-REFNUM                  PIC  9(20)      COMP.      038000      
000117    03 WKS-MOV-REFNUM-S500             REDEFINES WKS-MOV-REFNUM.  038200      
000118         04 WKS-MOV-EFEC-S500          PIC  9(02)      COMP.      038300      
000119         04 WKS-MOV-CHVV               PIC  9(04)      COMP.      038400      
000120         04 WKS-MOV-REFERENCIA         PIC  9(14)      COMP.      038500      
000121    03 WKS-MOV-REFNUM-S087             REDEFINES WKS-MOV-REFNUM.  038552      
000122       04 FILLER                       PIC  9(04)      COMP.      038554      
000123       04 WKS-MOV-PM                   PIC  9(02)      COMP.      038556      
000124       04 WKS-MOV-REF                  PIC  9(14)      COMP.      038558      
000125    03 WKS-MOV-REFNUM-S404             REDEFINES WKS-MOV-REFNUM.  038658      
000126       04 WKS-MOV-IND-EFECTIVO         PIC  9(02)      COMP.      038758      
000127       04 WKS-MOV-PORCENTAJE-DESCUENTO PIC  99V99      COMP.      038808      
000128       04 WKS-MOV-ZEROS                PIC  9(08)      COMP.      038858      
000129       04 WKS-MOV-REF-S404             PIC  9(06)      COMP.      038958      
000130    03 WKS-MOV-CVEMDA                  PIC  9(02)      COMP.      039000      
000131    03 WKS-MOV-NUMMDA                  PIC  9(20)      COMP.      040000      
000132    03 WKS-MOV-NUMMDA-R                REDEFINES WKS-MOV-NUMMDA.  041000      
000133       05 WKS-MOV-MDA-SUC              PIC  9(04)      COMP.      042000      
000134       05 WKS-MOV-MDA-CTA              PIC  9(16)      COMP.      043000      
000135    03 WKS-MOV-CVEMDE                  PIC  9(02)      COMP.      044000      
000136    03 WKS-MOV-SUC-INIC                PIC  9(04)      COMP.      045000      
000137    03 WKS-MOV-CAJA-INIC               PIC  9(02)      COMP.      046000      
000138    03 WKS-MOV-SUCOPER                 PIC  9(04)      COMP.      047000      
000139    03 WKS-MOV-CAJAOPER                PIC  9(02)      COMP.      048000      
000140    03 WKS-MOV-SUCTRAN                 PIC  9(04)      COMP.      049000      
000141    03 WKS-MOV-CAJATRAN                PIC  9(02)      COMP.      050000      
000142    03 WKS-MOV-NOMINA-OPE              PIC  9(08)      COMP.      051000      
000143    03 WKS-MOV-ORIGEN                  PIC  9(02)      COMP.      052000      
000144    03 WKS-MOV-MONEDA                  PIC  9(04)      COMP.      053000      
000145    03 WKS-MOV-AUT-S151                PIC  9(08)      COMP.      054000      
000146    03 WKS-MOV-AUT-AELIM-S151          PIC  9(08)      COMP.      055000      
000147    03 WKS-MOV-AUT-ANT-S151            PIC  9(08)      COMP.      056000      
000148    03 WKS-MOV-TIPO-PROC               PIC  9(02)      COMP.      057000      
000149    03 WKS-MOV-SOBREGIRO               PIC  9(02)      COMP.      058000      
000150    03 WKS-MOV-CVEAVISO                PIC  9(04)      COMP.      059000      
000151    03 WKS-MOV-IND-EDOCTA              PIC  9(02)      COMP.      060000      
000152    03 WKS-MOV-IND-DATOS-ADIC          PIC  9(02)      COMP.      061000      
000153    03 WKS-MOV-IND-CONTA               PIC  9(02)      COMP.      062000      
000154    03 WKS-MOV-FEC-ULTMOV              PIC  9(08)      COMP.      062100      
000155    03 WKS-MOV-FEC-ULTMOV-R REDEFINES WKS-MOV-FEC-ULTMOV.         062200      
000156       05 WKS-MOV-IND-NUMREN           PIC  9(02)      COMP.      063000      
000157       05 WKS-MOV-ACTIVIDAD            PIC  9(06)      COMP.      064000      
000158    03 WKS-MOV-SECTOR                  PIC  9(02)      COMP.      065000      
000159    03 WKS-MOV-BANCA                   PIC  9(02)      COMP.      066000      
000160    03 WKS-MOV-FIL-FUTURO              PIC  X(07).                067000      
000161    03 WKS-MOV-REDEF-S264 REDEFINES WKS-MOV-FIL-FUTURO.           067010      
000162       05 WKS-BCO-S264                 PIC  9(08) COMP.           067050      
000163       05 WKS-MOV-BORI-S264            PIC  9(03) COMP.           067070      
000164       05 WKS-MOV-BDES-S264            PIC  9(03) COMP.           067090      
000165    03 WKS-MOV-REDEF-S087 REDEFINES WKS-MOV-FIL-FUTURO.           067100      
000166       05 WKS-MOV-FEC-VEN              PIC  9(08)      COMP.      067400      
000167       05 FILLER                       PIC  X(03).                067500      
000168    03 WKS-MOV-REDEF-S500 REDEFINES WKS-MOV-FIL-FUTURO.           067520      
000169       05 WKS-MOV-S015                 PIC  9(08) COMP.           067560      
000170       05 WKS-MOV-BCO-ORI              PIC  9(03) COMP.           067580      
000171       05 WKS-MOV-BCO-DES              PIC  9(03) COMP.           067600      
000172    03 WKS-MOV-REDEF-S501 REDEFINES WKS-MOV-FIL-FUTURO.           067620      
000173       05 WKS-MOV-CAJA-S501            PIC  9(04)      COMP.      067660      
000174       05 FILLER                       PIC  X(05).                067680      
000175    03 WKS-MOV-REDEF-S403 REDEFINES WKS-MOV-FIL-FUTURO.           067700      
000176       05 WKS-MOV-FOLIO-S403           PIC  9(04)       COMP.     067740      
000177       05 WKS-MOV-RENGLON-S403         PIC  9(02)       COMP.     067760      
000178       05 WKS-MOV-SCVECON-S403         PIC  9(04)       COMP.     067780      
000179       05 FILLER                       PIC  X(02).                067800      
000180    03 WKS-MOV-REDEF-S252 REDEFINES WKS-MOV-FIL-FUTURO.           067810      
000181       05 WKS-MOV-FEC-PARTIDA          PIC  9(08)       COMP.     067820      
000182       05 FILLER                       PIC  X(03).                067830      
000183    03 WKS-MOV-NODO-ORIG               PIC  9(02)      COMP.      068000      
000184    03 WKS-MOV-APU-DESC                PIC  9(08)      COMP.      069000      
000185    03 WKS-MOV-STATUS                  PIC  9(02)      COMP.      070000      
000186                                                                  071000      
000187    03 WKS-MOV-DATOS-ADIC              PIC  X(354).               072000      
000188    03 WKS-MOV-MOV-DATOS-ADIC-R   REDEFINES WKS-MOV-DATOS-ADIC.   073000      
000189       05 WKS-MOV-NOMINA-FUN1          PIC  9(08)      COMP.      074000      
000190       05 WKS-MOV-NOMINA-FUN2          PIC  9(08)      COMP.      075000      
000191       05 WKS-MOV-SIST-ORIG            PIC  9(04)      COMP.      076000      
000192       05 WKS-MOV-PROD-ORIG            PIC  9(04)      COMP.      077000      
000193       05 WKS-MOV-INST-ORIG            PIC  9(02)      COMP.      078000      
000194       05 WKS-MOV-CVECON-YREFLOC       PIC  X(26).                078100      
000195       05 WKS-MOV-CVECON-REF-R REDEFINES WKS-MOV-CVECON-YREFLOC.  078200      
000196          06 WKS-MOV-CVETR-ORIG        PIC  9(04)      COMP.      079000      
000197          06 WKS-MOV-CONT-ORIG         PIC  9(20)      COMP.      080000      
000198          06 WKS-MOV-REFLOC-BNM        PIC  X(14).                081000      
000199          06 WKS-MOV-REFLOC-OC         REDEFINES                  081100      
000200             WKS-MOV-REFLOC-BNM.                                  081200      
000201             07 WKS-MOV-REFLOC-PZA     PIC  9(03)      COMP.      081300      
000202             07 WKS-MOV-REFLOC-SUC     PIC  9(03)      COMP.      081400      
000203             07 WKS-MOV-REFLOC-TERM    PIC  X(04).                081500      
000204             07 WKS-MOV-REFLOC-AUT     PIC  9(06)      COMP.      081600      
000205             07 WKS-MOV-REFLOC-VF      PIC  9(01)      COMP.      081700      
000206             07 WKS-MOV-REFLOC-TCHQ    PIC  9(01)      COMP.      081800      
000207             07 FILLER                 PIC  X(03).                081900      
000208       05 WKS-MOV-FILLERXAPLI          PIC  X(96).                082000      
000209                                                                  083000      
000210       05 WKS-MOV-REDS084          REDEFINES WKS-MOV-FILLERXAPLI. 083100      
000211          06 WKS-MOV-SUCEJE            PIC 9(04)       COMP.      083200      
000212          06 WKS-MOV-CTAEJE            PIC 9(12)       COMP.      083300      
000213          06 WKS-MOV-MENSUALIDAD       PIC 9(04)       COMP.      083350      
000214          06 WKS-MOV-FILS084           PIC X(86).                 083400      
000215                                                                  083500      
000216       05 WKS-MOV-REDS087          REDEFINES WKS-MOV-FILLERXAPLI. 084000      
000217          06 WKS-MOV-PZO               PIC 9(04)       COMP.      085000      
000218          06 WKS-MOV-EMISION           PIC 9(08)       COMP.      086000      
000219          06 WKS-MOV-FILS087           PIC X(90).                 087000      
000220                                                                  088000      
000221       05 WKS-MOV-REDS408          REDEFINES WKS-MOV-FILLERXAPLI. 089000      
000222          06 WKS-MOV-FOLIO             PIC  9(04)      COMP.      090000      
000223          06 WKS-MOV-NUMLIN            PIC  9(04)      COMP.      091000      
000224          06 WKS-MOV-BCOS              PIC  9(04)      COMP.      091100      
000225          06 WKS-MOV-FILS408           PIC  X(90).                092000      
000226                                                                  093000      
000227       05 WKS-MOV-REDS500          REDEFINES WKS-MOV-FILLERXAPLI. 094000      
000228          06 WKS-MOV-CVECAUSA          PIC  9(04)      COMP.      095000      
000229          06 WKS-MOV-FECDEV            PIC  9(08)      COMP.      096000      
000230          06 WKS-MOV-BCO               PIC  9(04)      COMP.      097000      
000231          06 WKS-MOV-NOMORD            PIC  X(30).                098000      
000232          06 WKS-MOV-CAUSAORD          PIC  X(50).                099000      
000233          06 WKS-MOV-SUCORD            PIC  9(04)      COMP.      100000      
000234          06 WKS-MOV-CTACON            PIC  9(02)      COMP.      100100      
000235          06 WKS-MOV-FILS500           PIC  X(05).                101000      
000236                                                                  102000      
000237       05 WKS-MOV-REDS403           REDEFINES WKS-MOV-FILLERXAPLI.102050      
000238          06 WKS-MOV-OPCION         PIC  9(02)    COMP.           102100      
000239          06 WKS-MOV-FECCOTI        PIC  9(06)    COMP.           102150      
000240          06 WKS-MOV-FIDEICO        PIC  9(06)    COMP.           102200      
000241          06 WKS-MOV-IMPVAL         PIC  9(14)V99 COMP.           102250      
000242          06 WKS-MOV-SUCADIC        PIC  9(04)    COMP.           102300      
000243          06 WKS-MOV-CAJAADIC       PIC  9(02)    COMP.           102350      
000244          06 WKS-MOV-PROGRAMA       PIC  9(04)    COMP.           102400      
000245          06 WKS-MOV-PLAZO          PIC  9(04)    COMP.           102450      
000246          06 WKS-MOV-TIPOPLAZO      PIC  9(02)    COMP.           102500      
000247          06 WKS-MOV-TASAREF        PIC  9(06)V99 COMP.           102550      
000248          06 WKS-MOV-TASAREAL       PIC  9(04)V9999 COMP.         102600      
000249          06 WKS-MOV-CTE            PIC  9(12)    COMP.           102650      
000250          06 WKS-MOV-TIPOCREALFA    PIC  X(08).                   102670      
000251          06 WKS-MOV-AUTS151ORI     PIC  9(08)    COMP.           102690      
000252          06 WKS-MOV-TIPOCON        PIC  9(02)    COMP.           102710      
000253          06 WKS-MOV-INDCONTABLE    PIC  9(02)    COMP.           102730      
000254          06 FILLER                 PIC  X(45).                   102750      
000255                                                                  102800      
000256      05 WKS-MOV-REDS404           REDEFINES WKS-MOV-FILLERXAPLI. 102805      
000257         06 WKS-MOV-PRODUCTONAT    PIC  9(04)    COMP.            102810      
000258         06 WKS-MOV-NUMPAGO        PIC  9(04)    COMP.            102812      
000259         06 WKS-MOV-FIDEICOMISO    PIC  9(06)    COMP.            102815      
000260         06 WKS-MOV-VAL-UDI        PIC  9(02)V9(06) COMP.         102820      
000261         06 WKS-MOV-PRODGEN        PIC  9(03)    COMP.            102825      
000262         06 WKS-MOV-SUBPRODGEN     PIC  9(03)    COMP.            102830      
000263         06 WKS-MOV-ESTATUS-CRED   PIC  9(02)    COMP.            102840      
000264         06 WKS-MOV-FASE-CRED      PIC  9(02)    COMP.            102845      
000265         06 WKS-MOV-TRAS-CARVEN    PIC  9(02)    COMP.            102850      
000266         06 WKS-MOV-ESTATUS-PAGO   PIC  9(02)    COMP.            102855      
000267         06 WKS-MOV-ESTATUS-MEN    PIC  9(02)    COMP.            102860      
000268         06 WKS-MOV-ESTATUS-CARVEN PIC  9(02)    COMP.            102865      
000269         06 WKS-MOV-CONCEPTOS     OCCURS 5 TIMES.                 102870      
000270            08 WKS-MOV-CONCEPTO    PIC  9(04)    COMP.            102875      
000271         06 WKS-MOV-ESQUEMAS-CONT OCCURS 5 TIMES.                 102880      
000272            08 WKS-MOV-ESQ-CONT    PIC  9(02)    COMP.            102885      
000273         06 WKS-MOV-MOVIMIENTOS   OCCURS 5 TIMES.                 102890      
000274            08 WKS-MOV-MOVIMIENTO  PIC  9(04)    COMP.            102895      
000275         06 WKS-MOV-CONSECUTIVO   OCCURS 5 TIMES.                 102897      
000276            08 WKS-MOV-CONSEC      PIC  9(10)    COMP.            102899      
000277         06 WKS-MOV-FOLIO-S404     PIC  9(04)    COMP.            102905      
000278         06 WKS-MOV-NUM-PROG       PIC  9(04)    COMP.            102915      
000279         06 WKS-MOV-CVE-ESPECIAL   PIC  9(02)    COMP.            102920      
000280         06 WKS-MOV-STATION        PIC  X(08).                    102925      
000281         06 WKS-MOV-PANTALLA       PIC  X(05).                    102935      
000282         06 FILLER                 PIC  X(08).                    102945      
000283                                                                  102955      
000284      05 WKS-MOV-REDS701          REDEFINES WKS-MOV-FILLERXAPLI.  103000      
000285          06 WKS-MOV-DATOS-S701        PIC  X(95).                104000      
000286          06 MOV-MOV-PAG-SERV      REDEFINES WKS-MOV-DATOS-S701.  105000      
000287             07 WKS-MOV-S701-ID        PIC  X(30).                106000      
000288             07 WKS-MOV-S701-FCHREC    PIC  9(06).                107000      
000289             07 WKS-MOV-S701-REF1      PIC  X(20).                108000      
000290             07 WKS-MOV-S701-REF2      PIC  X(20).                109000      
000291             07 WKS-MOV-S701-TIPPAG    PIC  9(06).                110000      
000292             07 WKS-MOV-S701-TIPPAG-R  REDEFINES                  111000      
000293                WKS-MOV-S701-TIPPAG.                              112000      
000294                08 WKS-MOV-S701-ESTAB  PIC  9(04).                113000      
000295                08 WKS-MOV-S701-SEQ    PIC  9(02).                114000      
000296             07 WKS-MOV-S701-AUT       PIC  9(08).                114050      
000297             07 WKS-MOV-S701-FPAGO     PIC  9(02).                114100      
000298             07 WKS-MOV-S701-EBPP      PIC  9(03).                114200      
000299          06 WKS-MOV-PAG-IMPT       REDEFINES WKS-MOV-DATOS-S701. 115000      
000300             07 WKS-MOV-S701-RFC       PIC  X(13).                116000      
000301             07 WKS-MOV-S701-FORMULARI PIC  X(10).                117000      
000302             07 FILLER                 PIC  X(72).                118000      
000303          06 WKS-MOV-FILS701           PIC  X(01).                119000      
000304      05 WKS-MOV-REDS702          REDEFINES WKS-MOV-FILLERXAPLI.  119020      
000305         06 WKS-MOV-S702-CTE           PIC  9(12).                119040      
000306         06 WKS-MOV-S702-CTA           PIC  X(40).                119050      
000307         06 FILLER                     PIC  X(44).                119060      
000308       05 WKS-MOV-LEYENDAS             PIC  X(200).               119100      
000309       05 WKS-MOV-LEYENDAS-R           REDEFINES WKS-MOV-LEYENDAS.119200      
000310          06 WKS-MOV-LEY1              PIC  X(40).                120000      
000311          06 WKS-MOV-LEY2              PIC  X(40).                121000      
000312          06 WKS-MOV-LEY3              PIC  X(40).                122000      
000313          06 WKS-MOV-LEY4              PIC  X(40).                123000      
000314          06 WKS-MOV-LEY5              PIC  X(40).                124000      
000315       05 WKS-MOV-LEYENDAS-R1          REDEFINES WKS-MOV-LEYENDAS.124100      
000316          06 WKS-MOV-ELEM-LEY          OCCURS 5 TIMES.            124200      
000317             07 WKS-MOV-LEY            PIC  X(40).                124300      
000318             07 WKS-MOV-LEY-R          REDEFINES WKS-MOV-LEY.     124400      
000319                08 WKS-MOV-CHQEXE      PIC  9(10).                124500      
000320                08 WKS-MOV-CHQGIR      PIC  9(10).                124600      
000321                08 WKS-MOV-FILL        PIC  X(20).                124700      
000322       05 WKS-MOV-SALDO                PIC S9(15)V99 COMP.        124800      
000323       05 WKS-MOV-IMPBASE-ESQFINAN     PIC  9(14)V99 COMP.        124900      
000324       05 FILLER                       PIC  X(02).                125000      
000325                                                                  126000      
000326******************************************************************127000      
000327* DATOS REQUERIDOS PARA:                                          128000      
000328*                                                                 129000      
000329* INICIO, FIN Y ELIMINACION DE PROCESO:                           130000      
000330*    WKS-MOV-FUNCION                                              131000      
000331*    WKS-MOV-SISTEMA                                              132000      
000332*    WKS-MOV-TIPO-PROC                                            133000      
000333*    WKS-MOV-FECCONT                                              134000      
000334*                                                                 135000      
000335*                                                                 136000      
000336* ELIMINACION A PARTIR DE UNA AUTORIZACION DEL S151               137000      
000337*    WKS-MOV-FUNCION                                              138000      
000338*    WKS-MOV-SISTEMA                                              139000      
000339*    WKS-MOV-FECCONT                                              140000      
000340*    WKS-MOV-AUT-AELIM-S151                                       141000      
000341*    NUMERO DE AUTORIZACION INICIAL A ELIMINAR                    142000      
000342*    WKS-MOV-AUT-ANT-S151                                         143000      
000343*    NUMERO DE AUTORIZACION FINAL   A ELIMINAR                    144000      
000344*    (SI ESTE CAMPO ES IGUAL A CEROS LA ELIMINACION ES DESDE EL   145000      
000345*     AUTORIZACION INICIAL A ELIMINAR HASTA EL FIN DE ARCHIVO)    146000      
000346*                                                                 147000      
000347******************************************************************148000      
000348*    MOVE "S151L002R" TO WKS-LIBID-NOMB.                          148050      
000349*    ACCEPT LOG-SISTEMA                                           148100      
000350*    MOVE LOG-SISTEMA TO WKS-LIBID-SIST.                          148150      
000351*    CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID           148200      
000352*                                     WKS-CTLVER-NOMLIB           148250      
000353*                              GIVING W77-CTLVER-RSLT.            148300      
000354*    IF W77-CTLVER-RSLT = 0                                       148350      
000355*       CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA" TO               148400      
000356*                                 WKS-CTLVER-NOMLIB               148450      
000357*    ELSE                                                         148500      
000358*       CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA" TO               148550      
000359*       "(S151)S151/OBJECT/L002/REGISTRASNNN/01MTP00  ON CMEMP.". 148600      
000360*                                                                 148650      
000361*                                                                 148700      
000362*    CALL "CARGAMOV1 IN LIB-REGISTRA"  USING LOG-DATOS            149000      
000363*                               GIVING WS-151-RESULT              150000      
000364*                                                                 151000      
000365                                                                  152000      
000366                                                                  153000      
000367                                                                  154000      
000368                                                                  155000      
000369                                                                  156000      
000370*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000371******************************************************************006700      
000372*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000373*   COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".         006800      
000374**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000375  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000376  01 MENSAJE-LJ.                                                  100300      
000377     02 SISTEMA-LJ     PIC X(04).                                 100400      
000378     02 FILLER         PIC X VALUE "/".                           100500      
000379     02 PASO-LJ        PIC X(04).                                 100600      
000380     02 FILLER         PIC X VALUE "/".                           100700      
000381     02 MTP-LJ         PIC 9(03).                                 100800      
000382     02 FILLER         PIC X VALUE ":".                           100900      
000383     02 TIPO-LJ        PIC X.                                     101000      
000384     02 FILLER         PIC X VALUE ">".                           101100      
000385     02 CODIGO-LJ      PIC 9(06).                                 101200      
000386     02 FILLER         PIC X VALUE "<".                           101300      
000387     02 TEXTO-LJ       PIC X(250).                                101400      
000388*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000389******************************************************************006900      
000390 77  WKS-TIPOERR-DMSII             PIC 9(06) VALUE ZEROS.         007000      
000391 77  WKS-STRUCTU-DMSII             PIC 9(06) VALUE ZEROS.         007100      
000392 01  WKS-RESULTADO                 PIC 9(11).                     007200      
000393 01  WKS-RESULTADO-R               REDEFINES WKS-RESULTADO.       007300      
000394     02  W77-ULT-LEC               PIC  9(08).                    007400      
000395     02  W77-RES-MOV               PIC  9(03).                    007500      
000396 77  W77-RES-LIB                   PIC S9(11) BINARY.             007600      
000397 77  W77-RES-FIL                   PIC S9(11) BINARY.             007700      
000398 77  W77-OPEN-SDO                  PIC 9(02) COMP VALUE ZEROS.    007800      
000399 77  W77-OPEN-MOV                  PIC 9(02) COMP VALUE ZEROS.    007900      
000400 77  W77-ACT-SDO                   PIC 9(02) COMP VALUE ZEROS.    008000      
000401 77  W77-ACT-MOV                   PIC 9(02) COMP VALUE ZEROS.    008100      
000402 77  W77-IND                       PIC 9(04) COMP VALUE ZEROS.    008200      
000403 77  W77-APUN-CVETRA               PIC 9(06) COMP VALUE ZEROS.    008300      
000404 77  W77-APUN-AFE                  PIC 9(04) COMP VALUE ZEROS.    008400      
000405 77  W77-I                         PIC 9(04) COMP VALUE ZEROS.    008500      
000406 77  W77-J                         PIC 9(04) COMP VALUE ZEROS.    008600      
000407 77  W77-K                         PIC 9(04) COMP VALUE ZEROS.    008700      
000408 77  W77-D                         PIC 9(02) COMP VALUE ZEROS.    008800      
000409 77  W77-NOTFOUND-SDOMES           PIC 9(02) COMP VALUE ZEROS.    008900      
000410 77  W77-NOTFOUND-SDODIA           PIC 9(02) COMP VALUE ZEROS.    009000      
000411 77  W77-NOTFOUND-SDODIAANT        PIC 9(02) COMP VALUE ZEROS.    009100      
000412 77  W77-NOTFOUND-MOVDIA           PIC 9(02) COMP VALUE ZEROS.    009200      
000413 77  W77-RESULTADO                 PIC 9(02) COMP VALUE ZEROS.    009300      
000414 77  W77-REMANENTE                 PIC 9(02) COMP VALUE ZEROS.    009400      
000415 77  W77-DIV-CVE                   PIC 9(04) COMP VALUE ZEROS.    009500      
000416 77  W77-NIV-MOVOK                 PIC 9(10) COMP VALUE ZEROS.    009600      
000417 77  W77-NIV-MOVIN                 PIC 9(10) COMP VALUE ZEROS.    009700      
000418 77  W77-NIV-MOVER                 PIC 9(10) COMP VALUE ZEROS.    009800      
000419 77  W77-ELIM-AUT                  PIC 9(02) COMP VALUE ZEROS.    009900      
000420 77  W77-ELIM-PROC                 PIC 9(02) COMP VALUE ZEROS.    010000      
000421 77  W77-FIN                       PIC 9(02) COMP VALUE ZEROS.    010100      
000422 77  W77-DISP                      PIC 9(02) COMP VALUE ZEROS.    010200      
000423 77  W77-STATUS                    PIC 9(04).                     010300      
000424 77  WKK-MOV-LECARCDIA             PIC 9(08).                     010400      
000425 77  WKK-MOV-SISTEMA               PIC 9(04).                     010500      
000426 77  WKK-MOV-CONTRATO              PIC 9(16).                     010600      
000427 77  WKK-MOV-SUCPROM               PIC 9(04).                     010700      
000428*77  WKK-MOV-FECCONT               PIC 9(06).                     010800      
000429*INICIA CODIGO DE RENOVACION CRONOS 2000                          010900      
000430  77  WKK-MOV-FECCONT               PIC 9(08).                    011000      
000431*TERMINA CODIGO DE RENOVACION CRONOS 2000                         011100      
000432 77  WKK-MOV-MONEDA                PIC 9(04).                     011200      
000433 77  WKK-MOV-PRODUCTO              PIC 9(04).                     011300      
000434 77  WKK-MOV-INSTRUMENTO           PIC 9(02).                     011400      
000435 77  WKK-MOV-CVETRAN               PIC 9(04).                     011500      
000436 77  WKK-ULT-LEC                   PIC S9(11).                    011600      
000437 77  WKK-SDO-KEYCSI                PIC 9(04).                     011700      
000438*77  WKK-SDO-KEYFEC                PIC 9(06).                     011800      
000439*INICIA CODIGO DE RENOVACION CRONOS 2000                          011900      
000440  77  WKK-SDO-KEYFEC                PIC 9(08).                    012000      
000441*TERMINA CODIGO DE RENOVACION CRONOS 2000                         012100      
000442 77  WKK-SDO-KEYPRD                PIC 9(04).                     012200      
000443 77  WKK-SDO-KEYINS                PIC 9(04).                     012300      
000444 77  WKK-SDO-KEYMON                PIC 9(04).                     012400      
000445 77  WKK-SDO-LECARCDIA             PIC 9(08).                     012500      
000446 77  WKK-J                         PIC 9(04).                     012600      
000447 01  WKK-SDO-SD1                   PIC S9(17).                    012700      
000448 01  WKK-SDO-SD1-R                 REDEFINES WKK-SDO-SD1.         012800      
000449     03  WKK-SDO-ENT1              PIC 9(15).                     012900      
000450     03  WKK-SDO-DEC1              PIC 9(02).                     013000      
000451 01  WKK-SDO-SD2                   PIC S9(17).                    013100      
000452 01  WKK-SDO-SD2-R                 REDEFINES WKK-SDO-SD2.         013200      
000453     03  WKK-SDO-ENT2              PIC 9(15).                     013300      
000454     03  WKK-SDO-DEC2              PIC 9(02).                     013400      
000455 01  WKK-SDO-SD3                   PIC S9(19).                    013500      
000456 01  WKK-SDO-SD3-R                 REDEFINES WKK-SDO-SD3.         013600      
000457     03  WKK-SDO-ENT3              PIC 9(17).                     013700      
000458     03  WKK-SDO-DEC3              PIC 9(02).                     013800      
000459 01  WKK-SDO-SD4                   PIC S9(19).                    013900      
000460 01  WKK-SDO-SD4-R                 REDEFINES WKK-SDO-SD4.         014000      
000461     03  WKK-SDO-ENT4              PIC 9(17).                     014100      
000462     03  WKK-SDO-DEC4              PIC 9(02).                     014200      
000463 01  WKK-MOV-IMPORTE               PIC 9(16).                     014300      
000464 01  WKK-MOV-IMPORTE-R             REDEFINES WKK-MOV-IMPORTE.     014400      
000465     03  WKK-MOV-IMPENT            PIC 9(14).                     014500      
000466     03  WKK-MOV-IMPDEC            PIC 9(02).                     014600      
000467*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000468*   COPY "(S151)S151/FORMATO/ERROR/DMSII." FROM 1000 TO 59000.    014700      
000469                                                                  001000      
000470                                                                  002000      
000471                                                                  003000      
000472*=================================================================004000      
000473*==            FORMATO PARA MANEJO DE ERRORES DE DMSII         ===005000      
000474*=================================================================006000      
000475                                                                  007000      
000476                                                                  008000      
000477                                                                  009000      
000478 01 WKS-NOM-BDERR-DMSII            PIC  X(20).                    010000      
000479 77 WKS-ERR-DMSII                  PIC  9(02)    VALUE ZEROS.     011000      
000480 01 WKS-TAB-ERRDMSII.                                             012000      
000481    02 FILLER                      PIC X(20)     VALUE            013000      
000482    "NOTFOUND          01".                                       014000      
000483    02 FILLER                      PIC X(20)     VALUE            015000      
000484    "DUPLICATES        02".                                       016000      
000485    02 FILLER                      PIC X(20)     VALUE            017000      
000486    "DEADLOCK          03".                                       018000      
000487    02 FILLER                      PIC X(20)     VALUE            019000      
000488    "DATAERROR         04".                                       020000      
000489    02 FILLER                      PIC X(20)     VALUE            021000      
000490    "NOTLOCKED         05".                                       022000      
000491    02 FILLER                      PIC X(20)     VALUE            023000      
000492    "KEYCHANGE         06".                                       024000      
000493    02 FILLER                      PIC X(20)     VALUE            025000      
000494    "SYSTEMERROR       07".                                       026000      
000495    02 FILLER                      PIC X(20)     VALUE            027000      
000496    "READONLY          08".                                       028000      
000497    02 FILLER                      PIC X(20)     VALUE            029000      
000498    "IOERROR           09".                                       030000      
000499    02 FILLER                      PIC X(20)     VALUE            031000      
000500    "LIMITERROR        10".                                       032000      
000501    02 FILLER                      PIC X(20)     VALUE            033000      
000502    "OPENERROR         11".                                       034000      
000503    02 FILLER                      PIC X(20)     VALUE            035000      
000504    "CLOSEERROR        12".                                       036000      
000505    02 FILLER                      PIC X(20)     VALUE            037000      
000506    "NORECORD          13".                                       038000      
000507    02 FILLER                      PIC X(20)     VALUE            039000      
000508    "INUSE             14".                                       040000      
000509    02 FILLER                      PIC X(20)     VALUE            041000      
000510    "AUDITERROR        15".                                       042000      
000511    02 FILLER                      PIC X(20)     VALUE            043000      
000512    "ABORT             16".                                       044000      
000513    02 FILLER                      PIC X(20)     VALUE            045000      
000514    "SECURITYERROR     17".                                       046000      
000515    02 FILLER                      PIC X(20)     VALUE            047000      
000516    "VERSIONERROR      18".                                       048000      
000517    02 FILLER                      PIC X(20)     VALUE            049000      
000518    "FATALERROR        19".                                       050000      
000519    02 FILLER                      PIC X(20)     VALUE            051000      
000520    "INTEGRITY ERROR   20".                                       052000      
000521    02 FILLER                      PIC X(20)     VALUE            053000      
000522    "INTLIBERROR       21".                                       054000      
000523 01 WKS-TAB-ERRDMSII-R REDEFINES WKS-TAB-ERRDMSII.                055000      
000524    02 WKS-ELETAB-ERRDMSII         OCCURS 21 TIMES.               056000      
000525       03 WKS-LEY-ERR-DMSII        PIC X(18).                     057000      
000526       03 WKS-NUM-ERR-DMSII        PIC 99.                        058000      
000527                                                                  059000      
000528*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000529                                                                  014800      
000530*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000531*   COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL".                 014900      
000532*================================================================ 000100      
000533*         ENTRY-POINT CONSISDIA :                               = 000200      
000534*                                                                 000300      
000535* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000536* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000537* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000538* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000539* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000540* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000541* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000542* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000543* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000544* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000545*                                                               = 001400      
000546*================================================================ 001500      
000547                                                                  001600      
000548                                                                  001700      
000549*================================================================ 001800      
000550* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000551*                                                               = 002000      
000552* ENTRADA REQUERIDA :                                           = 002100      
000553*                                                               = 002200      
000554*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000555*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000556*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000557*================================================================ 002600      
000558 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000559    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000560    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000561    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000562    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000563    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000564    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000565    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000566    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000567    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000568    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000569    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000570    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000571    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000572    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000573    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000574    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000575    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000576    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000577    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000578    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000579       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000580       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000581       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000582       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000583*==============================================================   005200      
000584*                                                             =   005300      
000585* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000586*                                                             =   005500      
000587* CAMPOS REQUERIDOS :                                         =   005600      
000588*                                                             =   005700      
000589* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000590* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000591* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000592* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000593*==============================================================   006200      
000594 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000595    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000596    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000597    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000598    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000599                                                                  006800      
000600*==============================================================   006900      
000601*                                                             =   007000      
000602* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000603*                                                             =   007200      
000604* CAMPOS REQUERIDOS :                                         =   007300      
000605*                                                             =   007400      
000606* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000607* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000608* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000609* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000610*==============================================================   007900      
000611 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000612    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000613    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000614    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000615    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000616                                                                  008500      
000617*==============================================================   008600      
000618*                                                             =   008700      
000619* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000620*                                                             =   008900      
000621* CAMPOS REQUERIDOS :                                         =   009000      
000622*                                                             =   009100      
000623* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000624* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000625* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000626* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000627*==============================================================   009600      
000628 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000629    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000630    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000631    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000632    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000633                                                                  010200      
000634*============================================================     010300      
000635* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000636*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000637*                                                           =     010600      
000638*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000639*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000640*                                                           =     010900      
000641*  ENTRADA REQUERIDA.                                       =     011000      
000642*                                                           =     011100      
000643*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000644*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000645*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000646*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000647*============================================================     011600      
000648                                                                  011700      
000649 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000650     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000651     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000652     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000653     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000654                                                                  012300      
000655*=============================================================    012400      
000656*                                                            =    012500      
000657* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000658*             B01-SIS-FECARMOV.                              =    012700      
000659*                                                            =    012800      
000660* ENTRADA REQUERIDAD :                                       =    012900      
000661*                                                            =    013000      
000662*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000663*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000664*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000665*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000666*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000667*=============================================================    013600      
000668                                                                  013700      
000669 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000670     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000671     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000672     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000673     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000674     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000675*================================================================ 014400      
000676*                                                               = 014500      
000677* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000678*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000679*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000680*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000681*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000682*                                                               = 015100      
000683* ENTRADA REQUERIDA :                                           = 015200      
000684*                                                               = 015300      
000685* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000686* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000687* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000688* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000689* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000690*================================================================ 015900      
000691 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000692    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000693    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000694    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000695    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000696    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000697                                                                  016600      
000698*============================================================     016700      
000699*                                                           =     016800      
000700* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000701*                                                           =     017000      
000702* DATOS REQUERIDOS :                                        =     017100      
000703*                                                           =     017200      
000704* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000705* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000706* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000707* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000708* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000709*============================================================     017800      
000710                                                                  017900      
000711 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000712     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000713     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000714     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000715     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000716     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000717                                                                  018600      
000718*============================================================     018700      
000719*                                                           =     018800      
000720* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000721*                                                           =     019000      
000722* DATOS REQUERIDOS :                                        =     019100      
000723*                                                           =     019200      
000724* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000725* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000726* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000727* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000728* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000729*============================================================     019800      
000730                                                                  019900      
000731 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000732     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000733     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000734     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000735     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000736     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000737                                                                  020600      
000738*===============================================================  020700      
000739*                                                              =  020800      
000740* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000741*              MOVIMIENTOS.                                    =  021000      
000742* DATOS REQUERIDOS :                                           =  021100      
000743*                                                              =  021200      
000744* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000745* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000746* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000747* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000748* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000749* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000750*==============================================================   021900      
000751                                                                  022000      
000752 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000753     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000754     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000755     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000756     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000757     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000758     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000759*==============================================================   022800      
000760*                                                             =   022900      
000761* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000762*                                                             =   023100      
000763* CAMPOS REQUERIDOS :                                         =   023200      
000764*                                                             =   023300      
000765* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000766* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000767* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000768* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000769*==============================================================   023800      
000770 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000771    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000772    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000773    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000774    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000775                                                                  024304      
000776*=================================================================024306      
000777*                ENTRY POINT CONSISB01                           =024308      
000778*                                                                =024310      
000779*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000780*                                                                =024314      
000781*  FUNCIONES DISPONIBLES :                                       =024316      
000782*                                                                =024318      
000783*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000784*                                                                =024322      
000785*  PARAMETROS REQUERIDOS                                         =024324      
000786*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000787*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000788*=================================================================024330      
000789                                                                  024332      
000790 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000791     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000792     03 WKS-CON-CSI                PIC 9(02).                     024336      
000793     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000794     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000795        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000796        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000797        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000798        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000799        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000800                                                                  024400      
000801*=================================================================024500      
000802*                ENTRY POINT B02ARCINTER                         =024600      
000803*                                                                =024700      
000804*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000805*                                                                =024900      
000806*  FUNCIONES DISPONIBLES :                                       =025000      
000807*                                                                =025100      
000808*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000809* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000810* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000811* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000812*                                                                =025600      
000813*  PARAMETROS REQUERIDOS                                         =025700      
000814*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000815*                                                                =025900      
000816*=================================================================026000      
000817 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000818     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000819     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000820     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000821     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000822     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000823     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000824     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000825     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000826     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000827     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000828     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000829     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000830     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000831     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000832     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000833     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000834     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000835     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000836     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000837     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000838     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000839     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000840     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000841     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000842     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000843     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000844     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000845     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000846                                                                  029000      
000847*=================================================================029100      
000848*                ENTRY POINT B04SISTEMA                          =029200      
000849*                                                                =029300      
000850*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000851*                                                                =029500      
000852*  FUNCIONES DISPONIBLES :                                       =029600      
000853*                                                                =029700      
000854*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000855*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000856*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000857*                                                                =030100      
000858*  PARAMETROS REQUERIDOS                                         =030200      
000859*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000860*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000861*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000862*                                                                =030600      
000863*=================================================================030700      
000864 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000865     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000866     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000867     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000868     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000869     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000870     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000871     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000872                                                                  031600      
000873*================================================================ 031700      
000874*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000875*                                                               = 031900      
000876*  FUNCION                                                      = 032000      
000877*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000878*   19       ALTAS.                                             = 032200      
000879*   22       BAJAS                                              = 032300      
000880*   37       CAMBIOS.                                           = 032400      
000881*                                                               = 032500      
000882*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000883*                      FECHA DE PROCESO                         = 032700      
000884*                      NUMERO DE PROCESO                        = 032800      
000885*                      FECHA INICIO                             = 032900      
000886*                      REGISTRO INICIAL                         = 033000      
000887*================================================================ 033100      
000888                                                                  033200      
000889 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000890     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000891     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000892     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000893     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000894     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000895     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000896     03 WKS-B05-MIX                PIC 9(08).                     034000      
000897     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000898     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000899     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000900     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000901     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000902     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000903                                                                  034700      
000904                                                                  034800      
000905*================================================================ 034900      
000906*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000907*                                                               = 035100      
000908*  FUNCION                                                      = 035200      
000909*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000910*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000911*                                                               = 035500      
000912*================================================================ 035600      
000913                                                                  035700      
000914 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000915     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000916     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000917     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000918     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000919     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000920     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000921                                                                  036500      
000922*===============================================================  036600      
000923*                                                              =  036700      
000924*         ENTRY-POINT CONSISMEN                                =  036800      
000925*                                                              =  036900      
000926*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000927*                      SISTEMA                                 =  037100      
000928*                                                              =  037200      
000929*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000930*                                                              =  037400      
000931*===============================================================  037500      
000932 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000933     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000934     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000935     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000936     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000937     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000938     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000939     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000940     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000941     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000942     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000943     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000944     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000945     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000946     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000947     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000948        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000949        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000950        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000951        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000952        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000953        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000954        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000955                                                                  039900      
000956*=====================================================            040000      
000957*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000958*=====================================================            040200      
000959 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000960     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000961     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000962     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000963                                                                  040700      
000964*=====================================================            040800      
000965*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000966*=====================================================            041000      
000967 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000968     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000969     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000970     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000971                                                                  041500      
000972*=====================================================            041600      
000973*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000974*=====================================================            041800      
000975 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000976     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000977     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000978     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000979*=====================================================            042300      
000980*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000981*=====================================================            042500      
000982 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000983     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000984     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000985     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000986                                                                  043000      
000987*=====================================================            043100      
000988*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000989*=====================================================            043300      
000990 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000991     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000992     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000993     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000994                                                                  043800      
000995*=====================================================            043900      
000996*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000997*=====================================================            044100      
000998 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000999     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
001000     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
001001     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
001002                                                                  044600      
001003*=====================================================            044700      
001004*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
001005*=====================================================            044900      
001006 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
001007     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
001008     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
001009     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
001010                                                                  045400      
001011*=====================================================            045500      
001012*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
001013*=====================================================            045700      
001014 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
001015     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
001016     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
001017     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
001018                                                                  046200      
001019*=====================================================            046300      
001020*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
001021*=====================================================            046500      
001022 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
001023     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
001024     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
001025     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
001026                                                                  047000      
001027*=====================================================            047100      
001028*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
001029*=====================================================            047300      
001030 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
001031     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
001032     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
001033     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001034                                                                  047800      
001035*=====================================================            047900      
001036*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001037*=====================================================            048100      
001038 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001039     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001040     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001041     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001042                                                                  048600      
001043*=====================================================            048700      
001044*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001045*=====================================================            048900      
001046 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001047     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001048     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001049     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001050                                                                  049400      
001051*=====================================================            049500      
001052*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001053*=====================================================            049700      
001054 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001055     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001056     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001057     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001058     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001059     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001060     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001061     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001062     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001063     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001064     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001065                                                                  050900      
001066*=====================================================            051000      
001067*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001068*=====================================================            051200      
001069 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001070     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001071     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001072     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001073     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001074                                                                  051800      
001075*=====================================================            051900      
001076*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001077*=====================================================            052100      
001078 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001079     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001080     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001081     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001082     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001083                                                                  052700      
001084*=====================================================            052800      
001085*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001086*=====================================================            053000      
001087 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001088     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001089     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001090     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001091     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001092                                                                  053600      
001093*=====================================================            053700      
001094*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001095*=====================================================            053900      
001096 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001097     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001098     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001099     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001100     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001101                                                                  054500      
001102*=====================================================            054600      
001103*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001104*=====================================================            054800      
001105 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001106     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001107     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001108     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001109     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001110                                                                  055400      
001111*=====================================================            055500      
001112*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001113*=====================================================            055700      
001114 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001115     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001116     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001117     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001118     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001119                                                                  056300      
001120*=====================================================            056400      
001121*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001122*=====================================================            056600      
001123 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001124     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001125     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001126     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001127     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001128                                                                  057200      
001129 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001130*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001131                                                                  015000      
001132 01 WKS-TAB-APUNCVES.                                             015100      
001133    02 WKS-ELEMTAB-APUNCVES        OCCURS 9999 TIMES.             015200      
001134       03 WKS-APUN-CVE             PIC 9(04) COMP.                015300      
001135 01 WKS-TAB-AFECSDOS.                                             015400      
001136    02 WKS-ELEMTAB-CVES            OCCURS 5000 TIMES.             015500      
001137       03 WKS-ELEMTAB-AFECSDOS     OCCURS 6    TIMES.             015600      
001138          04 WKS-TIP-CVE           PIC 9(03) COMP.                015700      
001139          04 WKS-TIP-AFEC          PIC 9(01) COMP.                015800      
001140 01 WKS-TAB-SDOS.                                                 015900      
001141    02 WKS-ELEM-SDOS               OCCURS 10 TIMES.               016000      
001142       03 WKS-NUM-SDOS             PIC 9(08) COMP.                016100      
001143       03 WKS-IMP-SDOS             PIC S9(13)V99 COMP.            016200      
001144 01 WKS-DATOS-HOST.                                               016300      
001145    03 WKS-NUMCSI-HOST             PIC 9(02).                     016400      
001146    03 WKS-NOMEQUIPO               PIC X(10).                     016500      
001147    03 WKS-NOMCSI                  PIC X(26).                     016600      
001148    03 WKS-LINEA-BATCH             PIC X(05).                     016700      
001149 01 WKS-SDO-BD.                                                   016800      
001150    02 FILLER                      PIC X(06) VALUE "(S151)".      016900      
001151    02 WKS-NOM-SDOBD               PIC X(17).                     017000      
001152    02 FILLER                      PIC X(10) VALUE " ON CMEMP.".  017100      
001153 01 WKS-MOV-BD.                                                   017200      
001154    02 FILLER                      PIC X(06) VALUE "(S151)".      017300      
001155    02 WKS-NOM-MOVBD               PIC X(17).                     017400      
001156    02 FILLER                      PIC X(10) VALUE " ON CMEMP.".  017500      
001157 PROCEDURE DIVISION USING WKS-MOV-DATOS, W77-RES-FIL, W77-RES-LIB.017600      
001158 000000-INIC-PROGRAMA.                                            017700      
001159     IF WKS-MOV-FUNCION = ZEROS                                   017800      
001160        PERFORM 999999-DISPLAY-INICIO                             017900      
001161        PERFORM 200000-INICIO                                     018000      
001162     ELSE                                                         018100      
001163        IF WKS-MOV-FUNCION = 1 OR 2                               018200      
001164           PERFORM 300000-PROCESO-SDOMOV                          018300      
001165        ELSE                                                      018400      
001166           PERFORM 100100-GRABA-NIVEL-SDOMOV                      018500      
001167           MOVE 98                 TO W77-RES-MOV.                018600      
001168     MOVE WKS-RESULTADO         TO W77-RES-LIB.                   018700      
001169     EXIT PROGRAM.                                                018800      
001170*=================================================================018900      
001171*====                     RUT-100100-GRABA-NIVEL-SDOMOV           019000      
001172*=================================================================019100      
001173 100100-GRABA-NIVEL-SDOMOV.                                       019200      
001174     IF W77-OPEN-MOV = 1                                          019300      
001175        MOVE "BASE DE MOVTOS "        TO WKS-NOM-BDERR-DMSII      019400      
001176        PERFORM 300100-GRABA-NIVMOVS.                             019500      
001177     IF W77-OPEN-SDO = 1                                          019600      
001178        MOVE "BASE DE SALDOS "        TO WKS-NOM-BDERR-DMSII      019700      
001179        PERFORM 300200-GRABA-NIVSDOS.                             019800      
001180     MOVE ZEROS                    TO W77-ULT-LEC.                019900      
001181*=================================================================020000      
001182*====                     RUT-200000-INICIO                       020100      
001183*=================================================================020200      
001184 200000-INICIO.                                                   020300      
001185     CHANGE ATTRIBUTE LIBACCESS OF "CTLVER" TO BYFUNCTION.        020400      
001186     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO                 020500      
001187                                      "CTLVERS".                  020600      
001188     MOVE "S080BD01CON"            TO WKS-LIBID.                  020700      
001189     CALL "DAME_TIT IN CTLVER" USING    WKS-LIBID, WKS-NOMBLIB    020800      
001190                               GIVING W77-ERR-CTLVER.             020900      
001191     IF W77-ERR-CTLVER = 0                                        021000      
001192        CHANGE ATTRIBUTE TITLE OF "ESTRUCTURA"   TO WKS-NOMBLIB.  021100      
001193                                                                  021200      
001194     MOVE 0                        TO W77-ERR-CTLVER.             021300      
001195     MOVE "S151L001CTL"            TO WKS-LIBID.                  021400      
001196     CALL "DAME_TIT IN CTLVER" USING  WKS-LIBID                   021500      
001197                                      WKS-NOMBLIB                 021600      
001198                               GIVING W77-ERR-CTLVER.             021700      
001199     IF W77-ERR-CTLVER = 0                                        021800      
001200        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                021900      
001201                                  WKS-NOMBLIB                     022000      
001202     ELSE                                                         022100      
001203        MOVE 020901       TO      CODIGO-LJ                       022200      
001204        STRING "ERROR EN CTLVERS, NO ENCONTRO ID DE LIB-CONTROL " 022300      
001205        DELIMITED BY SIZE INTO TEXTO-LJ                           022400      
001206        PERFORM 999999-DESPLIEGA                                  022500      
001207        SET MYSELF(STATUS)  TO  -1.                               022600      
001208                                                                  022700      
001209     MOVE WKS-MOV-SISTEMA      TO WKS-B03-SISTEMA                 022800      
001210     MOVE 1                    TO WKS-B03-FUNCION.                022900      
001211     CALL "CONSISMEN IN LIB-CONTROL" USING WKS-S151B03SISMEN      023000      
001212                                    GIVING W77-STATUS.            023100      
001213     IF W77-STATUS > 0                                            023200      
001214        MOVE 020901         TO      CODIGO-LJ                     023300      
001215        STRING "ERROR AL CONSULTAR B03 LIB-CONTROL : ",           023400      
001216                         W77-STATUS                               023500      
001217        DELIMITED BY SIZE INTO TEXTO-LJ                           023600      
001218        PERFORM 999999-DESPLIEGA                                  023700      
001219        SET MYSELF(STATUS)  TO  -1.                               023800      
001220                                                                  023900      
001221     MOVE "BASE DE SALDOS "        TO WKS-NOM-BDERR-DMSII         024000      
001222*    IF B03-SIS-NOMBDSAL = SPACES                                 024100      
001223     IF WKS-B03-NOMBDSAL = SPACES                                 024200      
001224        MOVE WKS-MOV-SISTEMA      TO      WKK-MOV-SISTEMA         024300      
001225        STRING "NO EXISTE BD DE SALDOS SISTEMA ", WKK-MOV-SISTEMA 024400      
001226        DELIMITED BY SIZE INTO TEXTO-LJ                           024500      
001227        PERFORM 999999-DESPLIEGA                                  024600      
001228     ELSE                                                         024700      
001229        MOVE 1                    TO W77-OPEN-SDO                 024800      
001230*       MOVE B03-SIS-NOMBDSAL     TO WKS-NOM-SDOBD                024900      
001231        MOVE WKS-B03-NOMBDSAL     TO WKS-NOM-SDOBD                025000      
001232        CHANGE ATTRIBUTE TITLE OF SDODB TO WKS-SDO-BD             025100      
001233        OPEN UPDATE SDODB                                         025200      
001234             ON EXCEPTION                                         025300      
001235                PERFORM 900000-CHECA-STATUS.                      025400      
001236     IF (WKS-MOV-SISTEMA = 500 OR 555)                            025500      
001237        PERFORM 210000-BUSCA-BDMOVTOS VARYING W77-IND FROM 1 BY 1 025600      
001238                                UNTIL W77-IND > WKS-B03-NUMCICDIA 025700      
001239                             OR W77-OPEN-MOV = 1.                 025800      
001240     IF W77-OPEN-MOV = ZEROS AND (WKS-MOV-SISTEMA = 500 OR 555)   025900      
001241        MOVE WKS-MOV-SISTEMA      TO      WKK-MOV-SISTEMA         026000      
001242        STRING "NO EXISTE BD DE MOVTOS. SISTEMA ",                026100      
001243                                 WKK-MOV-SISTEMA                  026200      
001244        DELIMITED BY SIZE INTO TEXTO-LJ                           026300      
001245        PERFORM 999999-DESPLIEGA.                                 026400      
001246     IF W77-OPEN-SDO = 1                                          026500      
001247        FIND SDODB                                                026600      
001248             ON EXCEPTION                                         026700      
001249                PERFORM 900000-CHECA-STATUS.                      026800      
001250     IF W77-OPEN-MOV = 1                                          026900      
001251        FIND MOVDB                                                027000      
001252             ON EXCEPTION                                         027100      
001253                PERFORM 900000-CHECA-STATUS.                      027200      
001254     IF (WKS-MOV-SISTEMA = 500 OR 555)                            027300      
001255        IF W77-OPEN-SDO = 1 AND W77-OPEN-MOV = 1                  027400      
001256           MOVE WKS-MOV-FECCONT-DD       TO W77-D                 027500      
001257           IF B00-SDO-LECARCDIA(W77-D) = B00-MOV-LECARCDIA(W77-D) 027600      
001258          AND B00-SDO-MOVCICDIA(W77-D) = B00-MOV-MOVCICDIA(W77-D) 027700      
001259          AND B00-SDO-SDOCICDIA(W77-D) = B00-MOV-SDOCICDIA(W77-D) 027800      
001260              MOVE B00-MOV-LECARCDIA(W77-D) TO W77-ULT-LEC        027900      
001261              MOVE B00-MOV-LECARCDIA(W77-D) TO WKS-MOV-AUT-S151   028000      
001262           ELSE                                                   028100      
001263           IF B00-SDO-LECARCDIA(W77-D) < B00-MOV-LECARCDIA(W77-D) 028200      
001264              MOVE B00-SDO-LECARCDIA(W77-D) TO W77-ULT-LEC        028300      
001265              MOVE B00-SDO-LECARCDIA(W77-D) TO WKS-MOV-AUT-S151   028400      
001266           ELSE                                                   028500      
001267              MOVE B00-MOV-LECARCDIA(W77-D) TO W77-ULT-LEC        028600      
001268              MOVE B00-MOV-LECARCDIA(W77-D) TO WKS-MOV-AUT-S151   028700      
001269        ELSE                                                      028800      
001270           NEXT SENTENCE                                          028900      
001271     ELSE                                                         029000      
001272        MOVE WKS-MOV-FECCONT-DD       TO W77-D                    029100      
001273        MOVE B00-SDO-LECARCDIA(W77-D) TO W77-ULT-LEC              029200      
001274                                         WKS-MOV-AUT-S151.        029300      
001275     MOVE ZERO                     TO W77-EOF                     029400      
001276                                      W77-IND.                    029500      
001277     MOVE 151                      TO W77-L710-SISTEMA.           029600      
001278     MOVE 30                       TO W77-L710-PROGRAMA.          029700      
001279     MOVE 8                        TO WKS-EL710-CAT.              029800      
001280     MOVE 20                       TO WKS-EL710-CLAVE.            029900      
001281     MOVE 1                        TO WKS-EL710-BUSQUEDA.         030000      
001282     MOVE 1                        TO WKS-EL710-REGISTROS.        030100      
001283     MOVE WKS-MOV-SISTEMA          TO WKS-EL710-LLAVE1            030200      
001284     MOVE ZEROS                    TO WKS-EL710-LLAVE2            030300      
001285                                      WKS-EL710-LLAVE3            030400      
001286                                      WKS-EL710-LLAVE4            030500      
001287                                      WKS-EL710-LLAVE5            030600      
001288                                      WKS-EL710-LLAVE6            030700      
001289                                      WKS-EL710-FECINI            030800      
001290                                      WKS-EL710-NIVINI            030900      
001291                                      WKS-EL710-FEC-VIG.          031000      
001292     PERFORM 230100-CARGA-CVES      UNTIL W77-EOF = 1.            031100      
001293     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.031200      
001294     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS"               031300      
001295                                   TO "SOPORTECOMS".              031400      
001296     CALL "CSIID OF SOPORTECOMS" USING WKS-DATOS-HOST.            031500      
001297     CANCEL "SOPORTECOMS".                                        031600      
001298*=================================================================031700      
001299*====             RUT-210000-BUSCA-BDMOVTOS                       031800      
001300*=================================================================031900      
001301 210000-BUSCA-BDMOVTOS.                                           032000      
001302     MOVE "BASE DE MOVTOS "        TO WKS-NOM-BDERR-DMSII         032100      
001303*    IF WKS-B03-NOMBDMOV(W77-IND) NOT = SPACES AND                032200      
001304     IF WKS-B03-NOMBDMOV(W77-IND) NOT = SPACES AND                032300      
001305*       B03-SIS-AAMM    (W77-IND) = WKS-MOV-FECCONT-AAMM          032400      
001306        WKS-B03-AAMM    (W77-IND) = WKS-MOV-FECCONT-AAMM          032500      
001307        MOVE 1                     TO W77-OPEN-MOV                032600      
001308        MOVE WKS-B03-NOMBDMOV(W77-IND) TO WKS-NOM-MOVBD           032700      
001309        MOVE WKS-B03-NOMBDMOV(W77-IND) TO WKS-NOM-MOVBD           032800      
001310        CHANGE ATTRIBUTE TITLE OF MOVDB TO WKS-MOV-BD             032900      
001311        OPEN UPDATE MOVDB                                         033000      
001312             ON EXCEPTION                                         033100      
001313                PERFORM 900000-CHECA-STATUS.                      033200      
001314     IF W77-OPEN-MOV = 1                                          033300      
001315        FIND MOVDB                                                033400      
001316             ON EXCEPTION                                         033500      
001317                PERFORM 900000-CHECA-STATUS.                      033600      
001318     IF W77-OPEN-MOV = 1                                          033700      
001319        MOVE B00-MOV-SECOK         TO W77-NIV-MOVOK               033800      
001320        MOVE B00-MOV-SECINF        TO W77-NIV-MOVIN               033900      
001321        MOVE B00-MOV-SECERR        TO W77-NIV-MOVER.              034000      
001322*=================================================================034100      
001323*====             RUT-230100-CARGA-CVES                           034200      
001324*=================================================================034300      
001325 230100-CARGA-CVES.                                               034400      
001326     CALL "L710_CONSUL_DETALLE IN ESTRUCTURA"                     034500      
001327          USING  W77-L710-SISTEMA,                                034600      
001328                 W77-L710-PROGRAMA,                               034700      
001329                 WKS-L710-ENT,                                    034800      
001330                 WKS-L710-SAL,                                    034900      
001331          GIVING W77-L710-RESULT.                                 035000      
001332     IF W77-L710-RESULT = 0 OR 1                                  035100      
001333        MOVE WKS-SL710-DAT(1)      TO WKS-EL710-LLAVE1            035200      
001334        MOVE WKS-SL710-DAT(2)      TO WKS-EL710-LLAVE2            035300      
001335        MOVE WKS-SL710-DAT(3)      TO WKS-EL710-LLAVE3            035400      
001336        MOVE WKS-SL710-NIVINI      TO WKS-EL710-NIVINI            035500      
001337        MOVE WKS-SL710-FECINI      TO WKS-EL710-FECINI            035600      
001338        IF WKS-MOV-SISTEMA = WKS-SL710-DAT(1)                     035700      
001339           IF WKS-APUN-CVE(WKS-SL710-DAT(2)) = ZEROS              035800      
001340              ADD 1                       TO W77-APUN-CVETRA      035900      
001341              MOVE W77-APUN-CVETRA        TO                      036000      
001342                   WKS-APUN-CVE(WKS-SL710-DAT(2)).                036100      
001343     IF W77-L710-RESULT = 0                                       036200      
001344        IF W77-APUN-CVETRA = 0                                    036300      
001345           MOVE 2                TO W77-OPEN-SDO                  036400      
001346           MOVE 999              TO W77-RES-MOV                   036500      
001347        ELSE                                                      036600      
001348           NEXT SENTENCE                                          036700      
001349     ELSE                                                         036800      
001350     IF W77-L710-RESULT = 1                                       036900      
001351        NEXT SENTENCE                                             037000      
001352     ELSE                                                         037100      
001353     IF W77-L710-RESULT = 20                                      037200      
001354        MOVE 2                   TO W77-OPEN-SDO                  037300      
001355        MOVE 1                   TO W77-EOF                       037400      
001356        MOVE 999                 TO W77-RES-MOV                   037500      
001357     ELSE                                                         037600      
001358        MOVE W77-L710-RESULT      TO      WKK-MOV-SISTEMA         037700      
001359        STRING "ERROR EN LIB710 DEL S080 DESC. PROC",             037800      
001360               WKK-MOV-SISTEMA                                    037900      
001361        DELIMITED BY SIZE INTO TEXTO-LJ                           038000      
001362        PERFORM 999999-DESPLIEGA                                  038100      
001363        SET MYSELF(STATUS) TO -1.                                 038200      
001364                                                                  038300      
001365     IF WKS-MOV-SISTEMA = WKS-SL710-DAT(1)                        038400      
001366        IF W77-EOF = ZEROS                                        038500      
001367           MOVE WKS-APUN-CVE(WKS-SL710-DAT(2)) TO W77-APUN-AFE    038600      
001368           PERFORM 230110-BUSCA-SPC VARYING W77-K FROM 1 BY 1     038700      
001369                                      UNTIL W77-K > 6.            038800      
001370     IF W77-L710-RESULT = 0                                       038900      
001371        MOVE 1                   TO W77-EOF.                      039000      
001372                                                                  039100      
001373  230110-BUSCA-SPC.                                               039200      
001374     IF WKS-TIP-CVE(W77-APUN-AFE W77-K) = ZEROS                   039300      
001375        MOVE WKS-SL710-DAT(3) TO                                  039400      
001376             WKS-TIP-CVE(W77-APUN-AFE W77-K)                      039500      
001377        MOVE WKS-SL710-DAT(4) TO                                  039600      
001378                 WKS-TIP-AFEC(W77-APUN-AFE W77-K)                 039700      
001379        MOVE 7                     TO W77-K.                      039800      
001380*=================================================================039900      
001381*===              RUT-300000-PROCESO-SDOMOV                       040000      
001382*=================================================================040100      
001383 300000-PROCESO-SDOMOV.                                           040200      
001384     MOVE ZEROS                    TO W77-ACT-SDO  W77-ACT-MOV    040300      
001385     IF W77-OPEN-SDO = 1                                          040400      
001386        LOCK SDODB                                                040500      
001387             ON EXCEPTION                                         040600      
001388                PERFORM 900000-CHECA-STATUS.                      040700      
001389     IF W77-OPEN-MOV = 1                                          040800      
001390        LOCK MOVDB                                                040900      
001391             ON EXCEPTION                                         041000      
001392                PERFORM 900000-CHECA-STATUS.                      041100      
001393     IF (WKS-MOV-SISTEMA = 500 OR 555)                            041200      
001394        IF B00-SDO-LECARCDIA(W77-D) = B00-MOV-LECARCDIA(W77-D)    041300      
001395           MOVE 1                     TO W77-ACT-SDO  W77-ACT-MOV 041400      
001396        ELSE                                                      041500      
001397        IF B00-SDO-LECARCDIA(W77-D) < B00-MOV-LECARCDIA(W77-D)    041600      
001398           MOVE 1                     TO W77-ACT-SDO              041700      
001399        ELSE                                                      041800      
001400           MOVE 1                     TO W77-ACT-MOV              041900      
001401     ELSE                                                         042000      
001402        MOVE 1                        TO W77-ACT-SDO.             042100      
001403     IF W77-ACT-MOV = 1                                           042200      
001404        IF WKS-MOV-SISTEMA = 84                                   042300      
001405           IF WKS-MOV-INSTRUMENTO = 15 OR 17                      042400      
001406              PERFORM 310000-PROCESA-MOVTOS                       042500      
001407              PERFORM 300100-GRABA-NIVMOVS                        042600      
001408           ELSE                                                   042700      
001409              PERFORM 300100-GRABA-NIVMOVS                        042800      
001410        ELSE                                                      042900      
001411           PERFORM 310000-PROCESA-MOVTOS                          043000      
001412           PERFORM 300100-GRABA-NIVMOVS.                          043100      
001413     IF W77-ACT-SDO > ZEROS                                       043200      
001414        MOVE "BASE DE SALDOS "        TO WKS-NOM-BDERR-DMSII      043300      
001415        IF W77-ACT-SDO = 1                                        043400      
001416           PERFORM 510000-PROCESA-SDOS                            043500      
001417           PERFORM 300200-GRABA-NIVSDOS                           043600      
001418        ELSE                                                      043700      
001419        IF W77-ACT-SDO = 2                                        043800      
001420           PERFORM 300200-GRABA-NIVSDOS.                          043900      
001421     IF (WKS-MOV-SISTEMA = 500 OR 555)                            044000      
001422        IF W77-ACT-MOV = 1 AND W77-ACT-SDO > ZEROS                044100      
001423        IF B00-SDO-LECARCDIA(W77-D) = B00-MOV-LECARCDIA(W77-D) AND044200      
001424           B00-SDO-MOVCICDIA(W77-D) = B00-MOV-MOVCICDIA(W77-D) AND044300      
001425           B00-SDO-SDOCICDIA(W77-D) = B00-MOV-SDOCICDIA(W77-D)    044400      
001426           MOVE ZEROS                 TO W77-ULT-LEC              044500      
001427        ELSE                                                      044600      
001428           MOVE WKS-MOV-AUT-S151      TO W77-ULT-LEC              044700      
001429        ELSE                                                      044800      
001430           NEXT SENTENCE                                          044900      
001431     ELSE                                                         045000      
001432        MOVE ZEROS                 TO W77-ULT-LEC.                045100      
001433*=================================================================045200      
001434*===              RUT-300100-GRABA-NIVMOVS                        045300      
001435*=================================================================045400      
001436 300100-GRABA-NIVMOVS.                                            045500      
001437     MOVE W77-NIV-MOVOK            TO B00-MOV-SECOK               045600      
001438     MOVE W77-NIV-MOVIN            TO B00-MOV-SECINF              045700      
001439     MOVE W77-NIV-MOVER            TO B00-MOV-SECERR              045800      
001440     IF WKS-MOV-AUT-S151 > B00-MOV-LECARCDIA(W77-D) OR            045900      
001441                           B00-MOV-MOVCICDIA(W77-D) OR            046000      
001442                           B00-MOV-SDOCICDIA(W77-D)               046100      
001443        MOVE WKS-MOV-AUT-S151         TO B00-MOV-LECARCDIA(W77-D) 046200      
001444                                         B00-MOV-MOVCICDIA(W77-D) 046300      
001445                                         B00-MOV-SDOCICDIA(W77-D).046400      
001446     STORE MOVDB                                                  046500      
001447           ON EXCEPTION                                           046600      
001448              PERFORM 900000-CHECA-STATUS.                        046700      
001449*=================================================================046800      
001450*===              RUT-300200-GRABA-NIVSDOS                        046900      
001451*=================================================================047000      
001452 300200-GRABA-NIVSDOS.                                            047100      
001453     IF WKS-MOV-AUT-S151 > B00-SDO-LECARCDIA(W77-D) OR            047200      
001454                           B00-SDO-MOVCICDIA(W77-D) OR            047300      
001455                           B00-SDO-SDOCICDIA(W77-D)               047400      
001456        MOVE WKS-MOV-AUT-S151         TO B00-SDO-LECARCDIA(W77-D) 047500      
001457                                         B00-SDO-MOVCICDIA(W77-D) 047600      
001458                                         B00-SDO-SDOCICDIA(W77-D) 047700      
001459        STORE SDODB                                               047800      
001460              ON EXCEPTION                                        047900      
001461                 PERFORM 900000-CHECA-STATUS.                     048000      
001462*=================================================================048100      
001463*===              RUT-310000-PROCESA-MOVTOS                       048200      
001464*=================================================================048300      
001465 310000-PROCESA-MOVTOS.                                           048400      
001466     IF WKS-MOV-FUNCION = 1                                       048500      
001467        IF WKS-MOV-PRODUCTO = 1 AND WKS-MOV-INSTRUMENTO = 3       048600      
001468           PERFORM 311000-CREATE-MOVTOS                           048700      
001469        ELSE                                                      048800      
001470           NEXT SENTENCE                                          048900      
001471     ELSE                                                         049000      
001472        PERFORM 312000-DELETE-MOVTOS.                             049100      
001473*=================================================================049200      
001474*===              RUT-311000-CREATE-MOVTOS                        049300      
001475*=================================================================049400      
001476 311000-CREATE-MOVTOS.                                            049500      
001477     ADD 1                         TO W77-NIV-MOVOK               049600      
001478     CREATE S151B01MOVCTO                                         049700      
001479     MOVE W77-NIV-MOVOK            TO B01-MOV-SEC                 049800      
001480     MOVE WKS-MOV-PRODUCTO         TO B01-MOV-PRD                 049900      
001481     MOVE WKS-MOV-INSTRUMENTO      TO B01-MOV-INS                 050000      
001482     MOVE WKS-MOV-SUCPROM          TO B01-MOV-SUCPRO              050100      
001483     MOVE WKS-MOV-CONTRATO         TO B01-MOV-KEYCON              050200      
001484     MOVE WKS-MOV-CVETRAN (1)      TO B01-MOV-CVETRA              050300      
001485     MOVE WKS-MOV-INDLEY  (1)      TO B01-MOV-INDLEY              050400      
001486     MOVE WKS-MOV-ESQCON  (1)      TO B01-MOV-ESQCON              050500      
001487     MOVE WKS-MOV-IMPORTE (1)      TO B01-MOV-IMP                 050600      
001488     MOVE WKS-MOV-FECMOV           TO B01-MOV-FECMOV              050700      
001489     MOVE WKS-MOV-HORMOV           TO B01-MOV-HORMOV              050800      
001490     MOVE WKS-MOV-FECCONT          TO B01-MOV-FECCON              050900      
001491     MOVE WKS-MOV-FECVAL           TO B01-MOV-FECVAL              051000      
001492     IF B01-MOV-FECVAL = ZEROS                                    051100      
001493        MOVE B01-MOV-FECCON        TO B01-MOV-FECVAL.             051200      
001494     MOVE WKS-MOV-AUTORIZA         TO B01-MOV-AUTORI              051300      
001495                                      B01-MOV-AUT                 051400      
001496     MOVE WKS-MOV-AUT3ER           TO B01-MOV-AUT3ERNIV           051500      
001497     IF B01-MOV-AUT3ERNIV > ZEROS                                 051600      
001498       MOVE B01-MOV-AUT3ERNIV      TO B01-MOV-AUT.                051700      
001499     MOVE WKS-MOV-REFNUM           TO B01-MOV-REFMOV              051800      
001500     MOVE WKS-MOV-CVEMDA           TO B01-MOV-CVEMDA              051900      
001501     MOVE WKS-MOV-MDA-SUC          TO B01-MOV-SUCPROMDA           052000      
001502     MOVE WKS-MOV-MDA-CTA          TO B01-MOV-NUMCTAMDA           052100      
001503     MOVE WKS-MOV-CVEMDE           TO B01-MOV-CVEMDE              052200      
001504     MOVE WKS-MOV-SUC-INIC         TO B01-MOV-SUCINI              052300      
001505     MOVE WKS-MOV-CAJA-INIC        TO B01-MOV-CAJINI              052400      
001506     MOVE WKS-MOV-SUCOPER          TO B01-MOV-SUCOPE              052500      
001507     MOVE WKS-MOV-CAJAOPER         TO B01-MOV-CAJOPE              052600      
001508     MOVE WKS-MOV-SUCTRAN          TO B01-MOV-SUCTRA              052700      
001509     MOVE WKS-MOV-CAJATRAN         TO B01-MOV-CAJTRA              052800      
001510     MOVE WKS-MOV-NOMINA-OPE       TO B01-MOV-NUMOPE              052900      
001511     MOVE WKS-MOV-ORIGEN           TO B01-MOV-ORIMOV              053000      
001512     MOVE WKS-MOV-MONEDA           TO B01-MOV-MON                 053100      
001513     MOVE WKS-MOV-AUT-S151         TO B01-MOV-AUTS151             053200      
001514     MOVE WKS-MOV-AUT-AELIM-S151   TO B01-MOV-AELIS151            053300      
001515     MOVE WKS-MOV-AUT-ANT-S151     TO B01-MOV-AANTS151            053400      
001516     MOVE WKS-MOV-TIPO-PROC        TO B01-MOV-PROCESO             053500      
001517     MOVE WKS-MOV-SOBREGIRO        TO B01-MOV-SOBGIRO             053600      
001518     MOVE WKS-MOV-CVEAVISO         TO B01-MOV-CVEAVISO            053700      
001519     MOVE WKS-MOV-IND-EDOCTA       TO B01-MOV-INDEDOCTA           053800      
001520     MOVE WKS-MOV-IND-DATOS-ADIC   TO B01-MOV-INDDATADI           053900      
001521     MOVE WKS-MOV-IND-CONTA        TO B01-MOV-INDCONTA            054000      
001522     MOVE WKS-MOV-IND-NUMREN       TO B01-MOV-INDNUMREN           054100      
001523     MOVE WKS-MOV-ACTIVIDAD        TO B01-MOV-ACTIVIDAD           054200      
001524     MOVE WKS-MOV-SECTOR           TO B01-MOV-SECTOR              054300      
001525     MOVE WKS-MOV-BANCA            TO B01-MOV-BANCA               054400      
001526     MOVE WKS-MOV-NODO-ORIG        TO B01-MOV-NODOORI             054500      
001527     MOVE WKS-MOV-APU-DESC         TO B01-MOV-APUDESC             054600      
001528     MOVE WKS-MOV-STATUS           TO B01-MOV-STAMOV              054700      
001529     PERFORM 311100-VERIFICA-IMPORTES VARYING W77-I FROM 2 BY 1   054800      
001530                                        UNTIL W77-I > 5           054900      
001531     IF B01-MOV-APUDESC > ZEROS                                   055000      
001532        PERFORM 311200-CARGA-DATOS-ADIC.                          055100      
001533     STORE S151B01MOVCTO                                          055200      
001534           ON EXCEPTION                                           055300      
001535              MOVE "E"    TO      TIPO-LJ                         055400      
001536              MOVE 010105 TO      CODIGO-LJ                       055500      
001537              STRING "ERROR EN STORE S151B01MOVCTO"               055600      
001538              DELIMITED BY SIZE INTO TEXTO-LJ                     055700      
001539              PERFORM 999999-DESPLIEGA                            055800      
001540              PERFORM 900000-CHECA-STATUS                         055900      
001541              SET MYSELF(STATUS) TO -1.                           056000      
001542*=================================================================056100      
001543*===              RUT-311100-VERIFICA-IMPORTES                    056200      
001544*=================================================================056300      
001545 311100-VERIFICA-IMPORTES.                                        056400      
001546     IF WKS-MOV-CVETRAN(W77-I) > ZEROS                            056500      
001547        PERFORM 311110-GRABA-IMPORTES-ADIC                        056600      
001548        MOVE 1                     TO B01-MOV-INDIMP.             056700      
001549*=================================================================056800      
001550*===              RUT-311110-GRABA-IMPORTES-ADIC                  056900      
001551*=================================================================057000      
001552 311110-GRABA-IMPORTES-ADIC.                                      057100      
001553     LOCK B02SXIMPADICIC AT B02-MOV-SEC = W77-NIV-MOVOK           057200      
001554          ON EXCEPTION                                            057300      
001555             IF DMSTATUS(NOTFOUND)                                057400      
001556                CREATE S151B02IMPADI                              057500      
001557                MOVE W77-NIV-MOVOK TO B02-MOV-SEC                 057600      
001558             ELSE                                                 057700      
001559                PERFORM 900000-CHECA-STATUS.                      057800      
001560     SUBTRACT 1 FROM W77-I GIVING W77-J                           057900      
001561     MOVE WKS-MOV-CVETRAN (W77-I)  TO B02-MOV-CVETRA (W77-J)      058000      
001562     MOVE WKS-MOV-INDLEY  (W77-I)  TO B02-MOV-INDLEY (W77-J)      058100      
001563     MOVE WKS-MOV-ESQCON  (W77-I)  TO B02-MOV-ESQCON (W77-J)      058200      
001564     MOVE WKS-MOV-IMPORTE (W77-I)  TO B02-MOV-IMP    (W77-J)      058300      
001565     STORE S151B02IMPADI                                          058400      
001566           ON EXCEPTION                                           058500      
001567              PERFORM 900000-CHECA-STATUS.                        058600      
001568*=================================================================058700      
001569*===              RUT-311200-CARGA-DATOS-ADIC                     058800      
001570*=================================================================058900      
001571 311200-CARGA-DATOS-ADIC.                                         059000      
001572     LOCK B03SXDATADIC AT B03-MOV-SEC = W77-NIV-MOVOK             059100      
001573          ON EXCEPTION                                            059200      
001574             IF DMSTATUS(NOTFOUND)                                059300      
001575                CREATE S151B03DATADI                              059400      
001576                MOVE W77-NIV-MOVOK         TO B03-MOV-SEC         059500      
001577             ELSE                                                 059600      
001578                PERFORM 900000-CHECA-STATUS.                      059700      
001579     MOVE WKS-MOV-NOMINA-FUN1      TO B03-MOV-FUN1                059800      
001580     MOVE WKS-MOV-NOMINA-FUN2      TO B03-MOV-FUN2                059900      
001581     MOVE WKS-MOV-SIST-ORIG        TO B03-MOV-SISORI              060000      
001582     MOVE WKS-MOV-PROD-ORIG        TO B03-MOV-PRDORI              060100      
001583     MOVE WKS-MOV-INST-ORIG        TO B03-MOV-INSORI              060200      
001584     MOVE WKS-MOV-CVETR-ORIG       TO B03-MOV-CVEORI              060300      
001585     MOVE WKS-MOV-CONT-ORIG        TO B03-MOV-CONORI              060400      
001586     MOVE WKS-MOV-REFLOC-BNM       TO B03-MOV-REFLOCBNM           060500      
001587     MOVE WKS-MOV-LEY1             TO B03-MOV-LEY1                060600      
001588     MOVE WKS-MOV-FILLERXAPLI      TO B03-MOV-FILXAPL             060700      
001589     IF WKS-MOV-LEY2 > SPACES OR WKS-MOV-LEY3 > SPACES OR         060800      
001590        WKS-MOV-LEY4 > SPACES OR WKS-MOV-LEY5 > SPACES            060900      
001591        MOVE 1                     TO B03-MOV-CONDES              061000      
001592        PERFORM 311210-CONT-DATOS-ADIC.                           061100      
001593     STORE S151B03DATADI                                          061200      
001594          ON EXCEPTION                                            061300      
001595             PERFORM 900000-CHECA-STATUS.                         061400      
001596*=================================================================061500      
001597*===              RUT-311210-CONT-DATOS-ADIC                      061600      
001598*=================================================================061700      
001599 311210-CONT-DATOS-ADIC.                                          061800      
001600     LOCK B04SXCONDATADI AT B04-MOV-SEC    = W77-NIV-MOVOK AND    061900      
001601                            B04-MOV-NUMDES = B03-MOV-CONDES       062000      
001602          ON EXCEPTION                                            062100      
001603             IF DMSTATUS(NOTFOUND)                                062200      
001604                CREATE S151B04CONDATADI                           062300      
001605                MOVE W77-NIV-MOVOK  TO B04-MOV-SEC                062400      
001606                MOVE B03-MOV-CONDES TO B04-MOV-NUMDES             062500      
001607             ELSE                                                 062600      
001608                PERFORM 900000-CHECA-STATUS.                      062700      
001609     MOVE WKS-MOV-LEY2             TO B04-MOV-LEY2                062800      
001610     MOVE WKS-MOV-LEY3             TO B04-MOV-LEY3                062900      
001611     MOVE WKS-MOV-LEY4             TO B04-MOV-LEY4                063000      
001612     MOVE WKS-MOV-LEY5             TO B04-MOV-LEY5                063100      
001613     STORE S151B04CONDATADI                                       063200      
001614           ON EXCEPTION                                           063300      
001615              PERFORM 900000-CHECA-STATUS.                        063400      
001616*=================================================================063500      
001617*===              RUT-311300-CARGA-DATOS-INFO                     063600      
001618*=================================================================063700      
001619 311300-CARGA-DATOS-INFO.                                         063800      
001620     ADD 1                         TO W77-NIV-MOVIN               063900      
001621     CREATE S151B11MOVINFCTO                                      064000      
001622     MOVE W77-NIV-MOVIN            TO B11-MOV-SEC                 064100      
001623     MOVE WKS-MOV-PRODUCTO         TO B11-MOV-PRD                 064200      
001624     MOVE WKS-MOV-INSTRUMENTO      TO B11-MOV-INS                 064300      
001625     MOVE WKS-MOV-SUCPROM          TO B11-MOV-SUCPRO              064400      
001626     MOVE WKS-MOV-CONTRATO         TO B11-MOV-KEYCON              064500      
001627     MOVE WKS-MOV-CVETRAN (1)      TO B11-MOV-CVETRA              064600      
001628     MOVE WKS-MOV-INDLEY  (1)      TO B11-MOV-INDLEY              064700      
001629     MOVE WKS-MOV-ESQCON  (1)      TO B11-MOV-ESQCON              064800      
001630     MOVE WKS-MOV-IMPORTE (1)      TO B11-MOV-IMP                 064900      
001631     MOVE WKS-MOV-FECMOV           TO B11-MOV-FECMOV              065000      
001632     MOVE WKS-MOV-HORMOV           TO B11-MOV-HORMOV              065100      
001633     MOVE WKS-MOV-FECCONT          TO B11-MOV-FECCON              065200      
001634     MOVE WKS-MOV-FECVAL           TO B11-MOV-FECVAL              065300      
001635     MOVE WKS-MOV-AUTORIZA         TO B11-MOV-AUTORI              065400      
001636     MOVE WKS-MOV-AUT3ER           TO B11-MOV-AUT3ERNIV           065500      
001637     MOVE WKS-MOV-REFNUM           TO B11-MOV-REFMOV              065600      
001638     MOVE WKS-MOV-CVEMDA           TO B11-MOV-CVEMDA              065700      
001639     MOVE WKS-MOV-MDA-SUC          TO B11-MOV-SUCPROMDA           065800      
001640     MOVE WKS-MOV-MDA-CTA          TO B11-MOV-NUMCTAMDA           065900      
001641     MOVE WKS-MOV-CVEMDE           TO B11-MOV-CVEMDE              066000      
001642     MOVE WKS-MOV-SUC-INIC         TO B11-MOV-SUCINI              066100      
001643     MOVE WKS-MOV-CAJA-INIC        TO B11-MOV-CAJINI              066200      
001644     MOVE WKS-MOV-SUCOPER          TO B11-MOV-SUCOPE              066300      
001645     MOVE WKS-MOV-CAJAOPER         TO B11-MOV-CAJOPE              066400      
001646     MOVE WKS-MOV-SUCTRAN          TO B11-MOV-SUCTRA              066500      
001647     MOVE WKS-MOV-CAJATRAN         TO B11-MOV-CAJTRA              066600      
001648     MOVE WKS-MOV-NOMINA-OPE       TO B11-MOV-NUMOPE              066700      
001649     MOVE WKS-MOV-ORIGEN           TO B11-MOV-ORIMOV              066800      
001650     MOVE WKS-MOV-MONEDA           TO B11-MOV-MON                 066900      
001651     MOVE WKS-MOV-AUT-S151         TO B11-MOV-AUTS151             067000      
001652     MOVE WKS-MOV-AUT-AELIM-S151   TO B11-MOV-AELIS151            067100      
001653     MOVE WKS-MOV-AUT-ANT-S151     TO B11-MOV-AANTS151            067200      
001654     MOVE WKS-MOV-TIPO-PROC        TO B11-MOV-PROCESO             067300      
001655     MOVE WKS-MOV-SOBREGIRO        TO B11-MOV-SOBGIRO             067400      
001656     MOVE WKS-MOV-CVEAVISO         TO B11-MOV-CVEAVISO            067500      
001657     MOVE WKS-MOV-IND-EDOCTA       TO B11-MOV-INDEDOCTA           067600      
001658     MOVE WKS-MOV-IND-DATOS-ADIC   TO B11-MOV-INDDATADI           067700      
001659     MOVE WKS-MOV-IND-CONTA        TO B11-MOV-INDCONTA            067800      
001660     MOVE WKS-MOV-IND-NUMREN       TO B11-MOV-INDNUMREN           067900      
001661     MOVE WKS-MOV-ACTIVIDAD        TO B11-MOV-ACTIVIDAD           068000      
001662     MOVE WKS-MOV-SECTOR           TO B11-MOV-SECTOR              068100      
001663     MOVE WKS-MOV-BANCA            TO B11-MOV-BANCA               068200      
001664     MOVE WKS-MOV-NODO-ORIG        TO B11-MOV-NODOORI             068300      
001665     MOVE WKS-MOV-APU-DESC         TO B11-MOV-APUDESC             068400      
001666     MOVE WKS-MOV-STATUS           TO B11-MOV-STAMOV              068500      
001667     PERFORM 311310-VERIFICA-IMPORTES VARYING W77-I FROM 2 BY 1   068600      
001668                                        UNTIL W77-I > 5           068700      
001669     IF B11-MOV-APUDESC > ZEROS                                   068800      
001670        PERFORM 311320-CARGA-DATOS-ADIC.                          068900      
001671     STORE S151B11MOVINFCTO                                       069000      
001672           ON EXCEPTION                                           069100      
001673              PERFORM 900000-CHECA-STATUS.                        069200      
001674*=================================================================069300      
001675*===              RUT-311310-VERIFICA-IMPORTES                    069400      
001676*=================================================================069500      
001677 311310-VERIFICA-IMPORTES.                                        069600      
001678     IF WKS-MOV-CVETRAN(W77-I) > ZEROS                            069700      
001679        PERFORM 311315-GRABA-IMPORTES-ADIC                        069800      
001680        MOVE 1                     TO B11-MOV-INDIMP.             069900      
001681*=================================================================070000      
001682*===              RUT-311315-GRABA-IMPORTES-ADIC                  070100      
001683*=================================================================070200      
001684 311315-GRABA-IMPORTES-ADIC.                                      070300      
001685     LOCK B12SXIMPINFADI AT B12-MOV-SEC = W77-NIV-MOVIN           070400      
001686          ON EXCEPTION                                            070500      
001687             IF DMSTATUS(NOTFOUND)                                070600      
001688                CREATE S151B12IMPINFADI                           070700      
001689                MOVE W77-NIV-MOVIN TO B12-MOV-SEC                 070800      
001690             ELSE                                                 070900      
001691                PERFORM 900000-CHECA-STATUS.                      071000      
001692     SUBTRACT 1 FROM W77-I GIVING W77-J                           071100      
001693     MOVE WKS-MOV-CVETRAN (W77-I)  TO B12-MOV-CVETRA (W77-J)      071200      
001694     MOVE WKS-MOV-INDLEY  (W77-I)  TO B12-MOV-INDLEY (W77-J)      071300      
001695     MOVE WKS-MOV-ESQCON  (W77-I)  TO B12-MOV-ESQCON (W77-J)      071400      
001696     MOVE WKS-MOV-IMPORTE (W77-I)  TO B12-MOV-IMP    (W77-J)      071500      
001697     STORE S151B12IMPINFADI                                       071600      
001698           ON EXCEPTION                                           071700      
001699              PERFORM 900000-CHECA-STATUS.                        071800      
001700*=================================================================071900      
001701*===              RUT-311320-CARGA-DATOS-ADIC                     072000      
001702*=================================================================072100      
001703 311320-CARGA-DATOS-ADIC.                                         072200      
001704     LOCK B13SXDATINFADI AT B13-MOV-SEC = W77-NIV-MOVIN           072300      
001705          ON EXCEPTION                                            072400      
001706             IF DMSTATUS(NOTFOUND)                                072500      
001707                CREATE S151B13DATINFADI                           072600      
001708                MOVE W77-NIV-MOVIN         TO B13-MOV-SEC         072700      
001709             ELSE                                                 072800      
001710                PERFORM 900000-CHECA-STATUS.                      072900      
001711     MOVE WKS-MOV-NOMINA-FUN1      TO B13-MOV-FUN1                073000      
001712     MOVE WKS-MOV-NOMINA-FUN2      TO B13-MOV-FUN2                073100      
001713     MOVE WKS-MOV-SIST-ORIG        TO B13-MOV-SISORI              073200      
001714     MOVE WKS-MOV-PROD-ORIG        TO B13-MOV-PRDORI              073300      
001715     MOVE WKS-MOV-INST-ORIG        TO B13-MOV-INSORI              073400      
001716     MOVE WKS-MOV-CVETR-ORIG       TO B13-MOV-CVEORI              073500      
001717     MOVE WKS-MOV-CONT-ORIG        TO B13-MOV-CONORI              073600      
001718     MOVE WKS-MOV-REFLOC-BNM       TO B13-MOV-REFLOCBNM           073700      
001719     MOVE WKS-MOV-LEY1             TO B13-MOV-LEY1                073800      
001720     MOVE WKS-MOV-FILLERXAPLI      TO B13-MOV-FILXAPL             073900      
001721     IF WKS-MOV-LEY2 > SPACES OR WKS-MOV-LEY3 > SPACES OR         074000      
001722        WKS-MOV-LEY4 > SPACES OR WKS-MOV-LEY5 > SPACES            074100      
001723        MOVE 1                     TO B13-MOV-CONDES              074200      
001724        PERFORM 311330-CONT-DATOS-ADIC.                           074300      
001725     STORE S151B13DATINFADI                                       074400      
001726          ON EXCEPTION                                            074500      
001727             PERFORM 900000-CHECA-STATUS.                         074600      
001728*=================================================================074700      
001729*===              RUT-311330-CONT-DATOS-ADIC                      074800      
001730*=================================================================074900      
001731 311330-CONT-DATOS-ADIC.                                          075000      
001732     LOCK B14SXCONDATADI AT B14-MOV-SEC    = W77-NIV-MOVIN AND    075100      
001733                            B14-MOV-NUMDES = B13-MOV-CONDES       075200      
001734          ON EXCEPTION                                            075300      
001735             IF DMSTATUS(NOTFOUND)                                075400      
001736                CREATE S151B14CONDATADI                           075500      
001737                MOVE W77-NIV-MOVIN  TO B14-MOV-SEC                075600      
001738                MOVE B13-MOV-CONDES TO B14-MOV-NUMDES             075700      
001739             ELSE                                                 075800      
001740                PERFORM 900000-CHECA-STATUS.                      075900      
001741     MOVE WKS-MOV-LEY2             TO B14-MOV-LEY2                076000      
001742     MOVE WKS-MOV-LEY3             TO B14-MOV-LEY3                076100      
001743     MOVE WKS-MOV-LEY4             TO B14-MOV-LEY4                076200      
001744     MOVE WKS-MOV-LEY5             TO B14-MOV-LEY5                076300      
001745     STORE S151B14CONDATADI                                       076400      
001746           ON EXCEPTION                                           076500      
001747              PERFORM 900000-CHECA-STATUS.                        076600      
001748*=================================================================076700      
001749*===              RUT-312000-DELETE-MOVTOS                        076800      
001750*=================================================================076900      
001751 312000-DELETE-MOVTOS.                                            077000      
001752     MOVE ZEROS                    TO W77-NOTFOUND-MOVDIA         077100      
001753     LOCK B01SXMOVCTO AT B01-MOV-FECCON = WKS-MOV-FECCONT AND     077200      
001754                         B01-MOV-KEYCON = WKS-MOV-CONTRATO        077300      
001755          ON EXCEPTION                                            077400      
001756             IF DMSTATUS(NOTFOUND)                                077500      
001757                MOVE 1             TO W77-NOTFOUND-MOVDIA         077600      
001758             ELSE                                                 077700      
001759                PERFORM 900000-CHECA-STATUS.                      077800      
001760     IF W77-NOTFOUND-MOVDIA = ZEROS                               077900      
001761        PERFORM 430000-EXTRAE-INF                                 078000      
001762        MOVE 2                        TO B01-MOV-STAMOV           078100      
001763        STORE S151B01MOVCTO                                       078200      
001764              ON EXCEPTION                                        078300      
001765                 PERFORM 900000-CHECA-STATUS.                     078400      
001766     IF W77-NOTFOUND-MOVDIA = ZEROS AND                           078500      
001767        B01-MOV-CVEAVISO > ZEROS                                  078600      
001768           PERFORM 312200-BAJA-MOV-INF.                           078700      
001769*=================================================================078800      
001770*===              RUT-312200-BAJA-MOV-INF                         078900      
001771*=================================================================079000      
001772 312200-BAJA-MOV-INF.                                             079100      
001773     MOVE ZEROS                    TO W77-NOTFOUND-MOVDIA         079200      
001774     LOCK B11SXMOVINFCTO AT B11-MOV-KEYCON = WKS-MOV-CONTRATO AND 079300      
001775                            B11-MOV-FECCON  = WKS-MOV-FECCONT  AND079400      
001776                            B11-MOV-AUTS151 = WKS-MOV-AUT-S151    079500      
001777          ON EXCEPTION                                            079600      
001778             IF DMSTATUS(NOTFOUND)                                079700      
001779                MOVE 1             TO W77-NOTFOUND-MOVDIA         079800      
001780             ELSE                                                 079900      
001781                PERFORM 900000-CHECA-STATUS.                      080000      
001782     IF W77-NOTFOUND-MOVDIA = ZEROS                               080100      
001783        MOVE WKS-MOV-STATUS        TO B11-MOV-STAMOV              080200      
001784        STORE S151B11MOVINFCTO                                    080300      
001785              ON EXCEPTION                                        080400      
001786                 PERFORM 900000-CHECA-STATUS.                     080500      
001787*=================================================================080600      
001788*===              RUT-400000-ELIMINACION-PROCESO                  080700      
001789*=================================================================080800      
001790 400000-ELIMINACION-PROCESO.                                      080900      
001791     MOVE ZEROS                    TO W77-FIN                     081000      
001792     IF W77-ELIM-PROC = 1 AND W77-FIN = ZEROS                     081100      
001793        PERFORM 410000-ELIM-PROCESO UNTIL W77-FIN = 1             081200      
001794        PERFORM 300100-GRABA-NIVMOVS                              081300      
001795        PERFORM 300200-GRABA-NIVSDOS.                             081400      
001796     IF W77-ELIM-AUT = 1 AND W77-FIN = ZEROS                      081500      
001797        PERFORM 420000-ELIM-AUTORI  UNTIL W77-FIN = 1             081600      
001798        PERFORM 300100-GRABA-NIVMOVS                              081700      
001799        PERFORM 300200-GRABA-NIVSDOS.                             081800      
001800*=================================================================081900      
001801*===              RUT-410000-ELIM-PROCESO                         082000      
001802*=================================================================082100      
001803 410000-ELIM-PROCESO.                                             082200      
001804     IF B01-MOV-STAMOV = 1 OR 2                                   082300      
001805        MOVE 3                  TO WKS-MOV-STATUS                 082400      
001806        IF B01-MOV-STAMOV = 1                                     082500      
001807           MOVE 2               TO WKS-MOV-FUNCION                082600      
001808           PERFORM 430000-EXTRAE-INF                              082700      
001809           MOVE 3               TO B01-MOV-STAMOV                 082800      
001810        ELSE                                                      082900      
001811           MOVE 3               TO B01-MOV-STAMOV.                083000      
001812     IF WKS-MOV-STATUS  = 3                                       083100      
001813        STORE S151B01MOVCTO                                       083200      
001814              ON EXCEPTION                                        083300      
001815              PERFORM 900000-CHECA-STATUS.                        083400      
001816     IF WKS-MOV-FUNCION = 2                                       083500      
001817        PERFORM 510000-PROCESA-SDOS.                              083600      
001818*=================================================================083700      
001819*===              RUT-420000-ELIM-AUTORI                          083800      
001820*=================================================================083900      
001821 420000-ELIM-AUTORI.                                              084000      
001822     IF B01-MOV-STAMOV = 1 OR 2                                   084100      
001823        IF B01-MOV-STAMOV = 1                                     084200      
001824           MOVE 3                  TO WKS-MOV-STATUS              084300      
001825                                      B01-MOV-STAMOV              084400      
001826           MOVE 2                  TO WKS-MOV-FUNCION             084500      
001827           PERFORM 430000-EXTRAE-INF                              084600      
001828        ELSE                                                      084700      
001829           MOVE 1                  TO WKS-MOV-FUNCION             084800      
001830           MOVE 1                  TO WKS-MOV-STATUS              084900      
001831                                      B01-MOV-STAMOV              085000      
001832           PERFORM 430000-EXTRAE-INF.                             085100      
001833     IF WKS-MOV-FUNCION = 1 OR 2                                  085200      
001834        STORE S151B01MOVCTO                                       085300      
001835              ON EXCEPTION                                        085400      
001836              PERFORM 900000-CHECA-STATUS.                        085500      
001837     IF WKS-MOV-FUNCION = 1 OR 2                                  085600      
001838        PERFORM 510000-PROCESA-SDOS.                              085700      
001839*=================================================================085800      
001840*===              RUT-430000-EXTRAE-INF                           085900      
001841*=================================================================086000      
001842 430000-EXTRAE-INF.                                               086100      
001843     MOVE B01-MOV-PRD              TO WKS-MOV-PRODUCTO            086200      
001844     MOVE B01-MOV-INS              TO WKS-MOV-INSTRUMENTO         086300      
001845     MOVE B01-MOV-SUCPRO           TO WKS-MOV-SUCPROM             086400      
001846     MOVE B01-MOV-KEYCON           TO WKS-MOV-CONTRATO            086500      
001847     MOVE B01-MOV-CVETRA           TO WKS-MOV-CVETRAN(1)          086600      
001848     MOVE B01-MOV-INDLEY           TO WKS-MOV-INDLEY (1)          086700      
001849     MOVE B01-MOV-ESQCON           TO WKS-MOV-ESQCON (1)          086800      
001850     MOVE B01-MOV-IMP              TO WKS-MOV-IMPORTE(1)          086900      
001851     MOVE B01-MOV-FECCON           TO WKS-MOV-FECCONT             087000      
001852     MOVE B01-MOV-CVEMDA           TO WKS-MOV-CVEMDA              087100      
001853     MOVE B01-MOV-SUCPROMDA        TO WKS-MOV-MDA-SUC             087200      
001854     MOVE B01-MOV-NUMCTAMDA        TO WKS-MOV-MDA-CTA             087300      
001855     MOVE B01-MOV-CVEMDE           TO WKS-MOV-CVEMDE              087400      
001856     MOVE B01-MOV-SUCINI           TO WKS-MOV-SUC-INIC            087500      
001857     MOVE B01-MOV-CAJINI           TO WKS-MOV-CAJA-INIC           087600      
001858     MOVE B01-MOV-SUCOPE           TO WKS-MOV-SUCOPER             087700      
001859     MOVE B01-MOV-CAJOPE           TO WKS-MOV-CAJAOPER            087800      
001860     MOVE B01-MOV-SUCTRA           TO WKS-MOV-SUCTRAN             087900      
001861     MOVE B01-MOV-CAJTRA           TO WKS-MOV-CAJATRAN            088000      
001862     MOVE B01-MOV-NUMOPE           TO WKS-MOV-NOMINA-OPE          088100      
001863     MOVE B01-MOV-ORIMOV           TO WKS-MOV-ORIGEN              088200      
001864     MOVE B01-MOV-MON              TO WKS-MOV-MONEDA.             088300      
001865     MOVE B01-MOV-AELIS151         TO WKS-MOV-AUT-AELIM-S151      088400      
001866     MOVE B01-MOV-AANTS151         TO WKS-MOV-AUT-ANT-S151        088500      
001867     IF B01-MOV-INDIMP > 0                                        088600      
001868        PERFORM 430100-EXTRAE-IMPADI.                             088700      
001869     MOVE WKS-MOV-STATUS           TO B01-MOV-STAMOV.             088800      
001870*=================================================================088900      
001871*===              RUT-430100-EXTRAE-IMPADI                        089000      
001872*=================================================================089100      
001873 430100-EXTRAE-IMPADI.                                            089200      
001874     FIND B02SXIMPADICIC AT B02-MOV-SEC = B01-MOV-SEC             089300      
001875          ON EXCEPTION                                            089400      
001876             PERFORM 900000-CHECA-STATUS.                         089500      
001877     PERFORM 430110-MOVE-IMPADI VARYING W77-I FROM 1 BY 1 UNTIL   089600      
001878                                        W77-I > 4.                089700      
001879*=================================================================089800      
001880*===              RUT-430110-MOVE-IMPADI                          089900      
001881*=================================================================090000      
001882 430110-MOVE-IMPADI.                                              090100      
001883     COMPUTE W77-J = W77-I + 1                                    090200      
001884     MOVE B02-MOV-CVETRA(W77-I)    TO WKS-MOV-CVETRAN(W77-J)      090300      
001885     MOVE B02-MOV-INDLEY(W77-I)    TO WKS-MOV-INDLEY (W77-J)      090400      
001886     MOVE B02-MOV-ESQCON(W77-I)    TO WKS-MOV-ESQCON (W77-J)      090500      
001887     MOVE B02-MOV-IMP   (W77-I)    TO WKS-MOV-IMPORTE(W77-J).     090600      
001888*=================================================================090700      
001889*===              RUT-510000-PROCESA-SDOS                         090800      
001890*=================================================================090900      
001891 510000-PROCESA-SDOS.                                             091000      
001892     MOVE ZEROS                    TO W77-NOTFOUND-SDOMES         091100      
001893                                      W77-NOTFOUND-SDODIA         091200      
001894                                      W77-NOTFOUND-SDODIAANT      091300      
001895                                      W77-NOTFOUND-MOVDIA.        091400      
001896     IF WKS-MOV-SISTEMA = 87                                      091500      
001897        IF WKS-MOV-INSTRUMENTO = 4 OR 7                           091600      
001898           IF WKS-MOV-PRODUCTO > 0 AND < 7                        091700      
001899              MOVE 1                      TO WKS-MOV-PRODUCTO     091800      
001900           ELSE                                                   091900      
001901           IF WKS-MOV-PRODUCTO > 6 AND < 14                       092000      
001902              MOVE 7                      TO WKS-MOV-PRODUCTO     092100      
001903           ELSE                                                   092200      
001904           IF WKS-MOV-PRODUCTO > 13 AND < 21                      092300      
001905              MOVE 14                     TO WKS-MOV-PRODUCTO     092400      
001906           ELSE                                                   092500      
001907           IF WKS-MOV-PRODUCTO > 20 AND < 28                      092600      
001908              MOVE 21                    TO WKS-MOV-PRODUCTO      092700      
001909           ELSE                                                   092800      
001910           IF WKS-MOV-PRODUCTO > 27 AND < 42                      092900      
001911              MOVE 28                     TO WKS-MOV-PRODUCTO     093000      
001912           ELSE                                                   093100      
001913           IF WKS-MOV-PRODUCTO > 41 AND < 63                      093200      
001914              MOVE 42                     TO WKS-MOV-PRODUCTO     093300      
001915           ELSE                                                   093400      
001916           IF WKS-MOV-PRODUCTO > 62 AND < 91                      093500      
001917              MOVE 63                     TO WKS-MOV-PRODUCTO     093600      
001918           ELSE                                                   093700      
001919           IF WKS-MOV-PRODUCTO > 90 AND < 182                     093800      
001920              MOVE 91                     TO WKS-MOV-PRODUCTO     093900      
001921           ELSE                                                   094000      
001922           IF WKS-MOV-PRODUCTO > 181 AND < 273                    094100      
001923              MOVE 182                    TO WKS-MOV-PRODUCTO     094200      
001924           ELSE                                                   094300      
001925           IF WKS-MOV-PRODUCTO > 272 AND < 378                    094400      
001926              MOVE 273                   TO WKS-MOV-PRODUCTO      094500      
001927           ELSE                                                   094600      
001928              MOVE 378                    TO WKS-MOV-PRODUCTO     094700      
001929        ELSE                                                      094800      
001930        IF WKS-MOV-INSTRUMENTO = 3 OR 5                           094900      
001931           IF WKS-MOV-PRODUCTO > 89 AND < 120                     095000      
001932              MOVE 90                     TO WKS-MOV-PRODUCTO     095100      
001933           ELSE                                                   095200      
001934           IF WKS-MOV-PRODUCTO > 119 AND < 150                    095300      
001935              MOVE 120                    TO WKS-MOV-PRODUCTO     095400      
001936           ELSE                                                   095500      
001937           IF WKS-MOV-PRODUCTO > 149 AND < 180                    095600      
001938              MOVE 150                   TO WKS-MOV-PRODUCTO      095700      
001939           ELSE                                                   095800      
001940           IF WKS-MOV-PRODUCTO > 179 AND < 368                    095900      
001941              MOVE 180                    TO WKS-MOV-PRODUCTO     096000      
001942           ELSE                                                   096100      
001943           IF WKS-MOV-PRODUCTO > 369 AND < 720                    096200      
001944              MOVE 370                    TO WKS-MOV-PRODUCTO     096300      
001945           ELSE                                                   096400      
001946              MOVE 720                    TO WKS-MOV-PRODUCTO     096500      
001947        ELSE                                                      096600      
001948        IF WKS-MOV-INSTRUMENTO = 1                                096700      
001949           IF WKS-MOV-PRODUCTO > 0  AND < 7                       096800      
001950              MOVE 1                      TO WKS-MOV-PRODUCTO     096900      
001951           ELSE                                                   097000      
001952           IF WKS-MOV-PRODUCTO > 6   AND < 14                     097100      
001953              MOVE 7                      TO WKS-MOV-PRODUCTO     097200      
001954           ELSE                                                   097300      
001955           IF WKS-MOV-PRODUCTO > 13  AND < 30                     097400      
001956              MOVE 14                    TO WKS-MOV-PRODUCTO      097500      
001957           ELSE                                                   097600      
001958           IF WKS-MOV-PRODUCTO > 29  AND < 60                     097700      
001959              MOVE 30                     TO WKS-MOV-PRODUCTO     097800      
001960           ELSE                                                   097900      
001961           IF WKS-MOV-PRODUCTO > 59  AND < 91                     098000      
001962              MOVE 60                     TO WKS-MOV-PRODUCTO     098100      
001963           ELSE                                                   098200      
001964           IF WKS-MOV-PRODUCTO > 90  AND < 120                    098300      
001965              MOVE 91                     TO WKS-MOV-PRODUCTO     098400      
001966           ELSE                                                   098500      
001967           IF WKS-MOV-PRODUCTO > 119 AND < 180                    098600      
001968              MOVE 120                    TO WKS-MOV-PRODUCTO     098700      
001969           ELSE                                                   098800      
001970              MOVE 180                    TO WKS-MOV-PRODUCTO.    098900      
001971                                                                  099000      
001972     IF (WKS-MOV-SISTEMA = 500 OR 555)                            099100      
001973        IF WKS-MOV-ORIGEN = 1 OR 3                                099200      
001974           IF WKS-MOV-PRODUCTO = 1 AND WKS-MOV-INSTRUMENTO = 3    099300      
001975              PERFORM 510200-LOCK-SDOSXCONT-MES.                  099400      
001976     IF WKS-MOV-ORIGEN = 1 OR 3                                   099500      
001977        PERFORM 511000-LOCK-POSICION.                             099600      
001978     PERFORM 520000-ACTUALIZA-SDOS VARYING W77-I FROM 1 BY 1      099700      
001979                                     UNTIL W77-I > 5.             099800      
001980     IF W77-DISP NOT = ZEROS                                      099900      
001981        STRING "MAS INFORMACION A DESPLEGAR 01 = SI, 00 = NO"     100000      
001982        DELIMITED BY SIZE INTO TEXTO-LJ                           100100      
001983        PERFORM 999999-DESPLIEGA                                  100200      
001984        ACCEPT W77-DISP.                                          100300      
001985*=================================================================100400      
001986*===              RUT-510200-LOCK-SDOSXCONT-MES                   100500      
001987*=================================================================100600      
001988 510200-LOCK-SDOSXCONT-MES.                                       100700      
001989     IF W77-DISP = 2                                              100800      
001990        MOVE WKS-MOV-CONTRATO     TO      WKK-MOV-CONTRATO        100900      
001991        STRING "510200-LOCK-SDOSXCONT-MES ", WKK-MOV-CONTRATO     101000      
001992        DELIMITED BY SIZE INTO TEXTO-LJ                           101100      
001993        PERFORM 999999-DESPLIEGA.                                 101200      
001994     MOVE ZEROS                    TO W77-NOTFOUND-SDOMES         101300      
001995                                      W77-NOTFOUND-SDODIA         101400      
001996                                      W77-NOTFOUND-SDODIAANT.     101500      
001997     LOCK B20SXSDOMENCON AT B20-SDO-KEYAM  =                      101600      
001998                            WKS-MOV-FECCONT-AAMM               AND101700      
001999                            B20-SDO-KEYCON = WKS-MOV-CONTRATO  AND101800      
002000                            B20-SDO-KEYMON = WKS-MOV-MONEDA    AND101900      
002001                            B20-SDO-KEYPRD = WKS-MOV-PRODUCTO  AND102000      
002002                            B20-SDO-KEYINS = WKS-MOV-INSTRUMENTO  102100      
002003          ON EXCEPTION                                            102200      
002004             IF DMSTATUS(NOTFOUND)                                102300      
002005                MOVE 1                   TO W77-NOTFOUND-SDOMES   102400      
002006             ELSE                                                 102500      
002007                PERFORM 900000-CHECA-STATUS.                      102600      
002008     IF W77-NOTFOUND-SDOMES = 1                                   102700      
002009        CREATE S151B20SDOMENCON                                   102800      
002010        MOVE WKS-MOV-CONTRATO      TO B20-SDO-KEYCON              102900      
002011        MOVE WKS-MOV-FECCONT-AAMM  TO B20-SDO-KEYAM               103000      
002012        MOVE WKS-MOV-MONEDA        TO B20-SDO-KEYMON              103100      
002013        MOVE WKS-MOV-PRODUCTO      TO B20-SDO-KEYPRD              103200      
002014        MOVE WKS-MOV-INSTRUMENTO   TO B20-SDO-KEYINS              103300      
002015        MOVE WKS-MOV-SUCPROM       TO B20-SDO-SUCPRO              103400      
002016        MOVE ZEROS                 TO B20-SDO-STAMOV              103500      
002017        MOVE ZEROS                 TO B20-SDO-APUIMP              103600      
002018        MOVE SPACES                TO B20-SDO-FILLER              103700      
002019        MOVE ZEROS                 TO B20-SDO-SD(1)               103800      
002020                                      B20-SDO-SD(2)               103900      
002021                                      WKK-SDO-ENT1 WKK-SDO-DEC1   104000      
002022                                      WKK-SDO-ENT2 WKK-SDO-DEC2.  104100      
002023     IF W77-DISP = 2                                              104200      
002024        MOVE B20-SDO-SD(1)         TO WKK-SDO-SD1                 104300      
002025        MOVE B20-SDO-SD(2)         TO WKK-SDO-SD2                 104400      
002026        STRING "SALDO ANTERIOR DEL MES ", WKK-SDO-ENT1            104500      
002027                                     "."  WKK-SDO-DEC1            104600      
002028               "SALDO ACTUAL   DEL MES ", WKK-SDO-ENT2            104700      
002029                                     "."  WKK-SDO-DEC2            104800      
002030        DELIMITED BY SIZE INTO TEXTO-LJ.                          104900      
002031*ASM    PERFORM 999999-DESPLIEGA.                                 105000      
002032*=================================================================105100      
002033*===              RUT-511000-LOCK-POSICION                        105200      
002034*=================================================================105300      
002035 511000-LOCK-POSICION.                                            105400      
002036     IF W77-DISP = 1                                              105500      
002037        MOVE WKS-MOV-FECCONT       TO     WKK-MOV-FECCONT         105600      
002038        MOVE WKS-MOV-MONEDA        TO     WKK-MOV-MONEDA          105700      
002039        MOVE WKS-MOV-PRODUCTO      TO     WKK-MOV-PRODUCTO        105800      
002040        MOVE WKS-MOV-INSTRUMENTO   TO     WKK-MOV-INSTRUMENTO     105900      
002041        STRING "511000-LOCK-POSICION "                            106000      
002042                 WKS-NUMCSI-HOST " "WKK-MOV-FECCONT " "           106100      
002043                 WKK-MOV-MONEDA " "WKK-MOV-PRODUCTO " "           106200      
002044                 WKK-MOV-INSTRUMENTO                              106300      
002045        DELIMITED BY SIZE INTO TEXTO-LJ.                          106400      
002046*ASM    PERFORM 999999-DESPLIEGA.                                 106500      
002047     MOVE ZEROS                    TO W77-NOTFOUND-SDOMES         106600      
002048                                      W77-NOTFOUND-SDODIA         106700      
002049                                      W77-NOTFOUND-SDODIAANT      106800      
002050                                      WKS-IMP-SDOS(1).            106900      
002051     LOCK B70SXPOSICION  AT B70-SDO-KEYCSI = WKS-NUMCSI-HOST   AND107000      
002052                            B70-SDO-KEYFEC = WKS-MOV-FECCONT   AND107100      
002053                            B70-SDO-KEYMON = WKS-MOV-MONEDA    AND107200      
002054                            B70-SDO-KEYPRD = WKS-MOV-PRODUCTO  AND107300      
002055                            B70-SDO-KEYINS = WKS-MOV-INSTRUMENTO  107400      
002056          ON EXCEPTION                                            107500      
002057             IF DMSTATUS(NOTFOUND)                                107600      
002058                MOVE 1             TO W77-NOTFOUND-SDODIA         107700      
002059             ELSE                                                 107800      
002060                PERFORM 900000-CHECA-STATUS.                      107900      
002061     IF W77-NOTFOUND-SDODIA = 1                                   108000      
002062        FIND LAST B70SXPOSICION AT B70-SDO-KEYCSI  =              108100      
002063                                   WKS-NUMCSI-HOST                108200      
002064                          AND B70-SDO-KEYMON = WKS-MOV-MONEDA     108300      
002065                          AND B70-SDO-KEYPRD = WKS-MOV-PRODUCTO   108400      
002066                          AND B70-SDO-KEYINS = WKS-MOV-INSTRUMENTO108500      
002067             ON EXCEPTION                                         108600      
002068                IF DMSTATUS(NOTFOUND)                             108700      
002069                   MOVE 1          TO W77-NOTFOUND-SDOMES         108800      
002070                ELSE                                              108900      
002071                   PERFORM 900000-CHECA-STATUS.                   109000      
002072     IF W77-NOTFOUND-SDOMES = ZEROS AND W77-NOTFOUND-SDODIA = 1   109100      
002073        MOVE B70-SDO-KEYCSI        TO WKK-SDO-KEYCSI              109200      
002074        MOVE B70-SDO-KEYFEC        TO WKK-SDO-KEYFEC              109300      
002075        MOVE B70-SDO-KEYMON        TO WKK-SDO-KEYMON              109400      
002076        MOVE B70-SDO-KEYPRD        TO WKK-SDO-KEYPRD              109500      
002077        MOVE B70-SDO-KEYINS        TO WKK-SDO-KEYINS              109600      
002078        MOVE B70-SDO-SD(2)         TO WKK-SDO-SD4                 109700      
002079        MOVE B70-SDO-SD(2)         TO WKS-IMP-SDOS(1).            109800      
002080     IF (W77-NOTFOUND-SDOMES = ZEROS AND W77-NOTFOUND-SDODIA = 1) 109900      
002081     OR (W77-NOTFOUND-SDOMES = 1     AND W77-NOTFOUND-SDODIA = 1) 110000      
002082        MOVE ZEROS                 TO W77-NOTFOUND-SDODIA         110100      
002083        LOCK B70SXPOSICION  AT B70-SDO-KEYCSI  = ZEROS         AND110200      
002084                            B70-SDO-KEYFEC = WKS-MOV-FECCONT   AND110300      
002085                            B70-SDO-KEYMON = WKS-MOV-MONEDA    AND110400      
002086                            B70-SDO-KEYPRD = WKS-MOV-PRODUCTO  AND110500      
002087                            B70-SDO-KEYINS = WKS-MOV-INSTRUMENTO  110600      
002088          ON EXCEPTION                                            110700      
002089             IF DMSTATUS(NOTFOUND)                                110800      
002090                MOVE 1             TO W77-NOTFOUND-SDODIA         110900      
002091                CREATE S151B70POSICION                            111000      
002092             ELSE                                                 111100      
002093                PERFORM 900000-CHECA-STATUS.                      111200      
002094     IF (W77-NOTFOUND-SDOMES = ZEROS AND W77-NOTFOUND-SDODIA = 1) 111300      
002095     OR (W77-NOTFOUND-SDOMES = 1     AND W77-NOTFOUND-SDODIA = 1) 111400      
002096        MOVE WKS-NUMCSI-HOST       TO B70-SDO-KEYCSI              111500      
002097        MOVE WKS-MOV-FECCONT       TO B70-SDO-KEYFEC              111600      
002098        MOVE WKS-MOV-MONEDA        TO B70-SDO-KEYMON              111700      
002099        MOVE WKS-MOV-PRODUCTO      TO B70-SDO-KEYPRD              111800      
002100        MOVE WKS-MOV-INSTRUMENTO   TO B70-SDO-KEYINS              111900      
002101        MOVE ZEROS                 TO B70-SDO-APUIMP              112000      
002102        MOVE WKS-IMP-SDOS(1)       TO B70-SDO-SD(1)               112100      
002103                                      B70-SDO-SD(2)               112200      
002104        MOVE B70-SDO-SD(1)         TO WKK-SDO-SD3                 112300      
002105        MOVE B70-SDO-SD(2)         TO WKK-SDO-SD4.                112400      
002106     IF W77-DISP = 1                                              112500      
002107        MOVE B70-SDO-SD(1)         TO WKK-SDO-SD3                 112600      
002108        MOVE B70-SDO-SD(2)         TO WKK-SDO-SD4                 112700      
002109        STRING "SALDO ANTERIOR DEL DIA ", WKK-SDO-ENT3            112800      
002110                                     "."  WKK-SDO-DEC3            112900      
002111               "SALDO ACTUAL   DEL DIA ", WKK-SDO-ENT4            113000      
002112                                     "."  WKK-SDO-DEC4            113100      
002113        DELIMITED BY SIZE INTO TEXTO-LJ.                          113200      
002114*ASM    PERFORM 999999-DESPLIEGA.                                 113300      
002115*=================================================================113400      
002116*===              RUT-520000-ACTUALIZA-SDOS                       113500      
002117*=================================================================113600      
002118 520000-ACTUALIZA-SDOS.                                           113700      
002119     IF (WKS-MOV-ORIGEN = 1 OR 3) AND                             113800      
002120         WKS-MOV-CVETRAN(W77-I) > ZEROS                           113900      
002121        MOVE WKS-APUN-CVE(WKS-MOV-CVETRAN(W77-I)) TO W77-J.       114000      
002122*        IF W77-J = ZEROS                                         114100      
002123*           PERFORM 531000-GRABA-ERROR-CVETRA.                    114200      
002124     IF (WKS-MOV-ORIGEN = 1 OR 3) AND                             114300      
002125         WKS-MOV-CVETRAN(W77-I) > ZEROS                           114400      
002126        MOVE WKS-APUN-CVE(WKS-MOV-CVETRAN(W77-I)) TO W77-J        114500      
002127        IF W77-J = ZEROS                                          114600      
002128           NEXT SENTENCE                                          114700      
002129        ELSE                                                      114800      
002130        IF (WKS-MOV-SISTEMA = 500 OR 555) AND                     114900      
002131           WKS-MOV-PRODUCTO = 1 AND WKS-MOV-INSTRUMENTO = 3       115000      
002132           PERFORM 522000-ACT-SDOSXCONT-MES VARYING               115100      
002133                   W77-K FROM 1 BY 1 UNTIL W77-K > 6 OR           115200      
002134                   WKS-TIP-CVE(W77-J W77-K) = ZEROS               115300      
002135           MOVE 1                             TO B20-SDO-STAMOV   115400      
002136           STORE S151B20SDOMENCON                                 115500      
002137                 ON EXCEPTION                                     115600      
002138                    PERFORM 900000-CHECA-STATUS.                  115700      
002139     IF (WKS-MOV-ORIGEN = 1 OR 3) AND                             115800      
002140         WKS-MOV-CVETRAN(W77-I) > ZEROS                           115900      
002141        MOVE WKS-APUN-CVE(WKS-MOV-CVETRAN(W77-I)) TO W77-J        116000      
002142        IF W77-J = ZEROS                                          116100      
002143           NEXT SENTENCE                                          116200      
002144        ELSE                                                      116300      
002145        PERFORM 530000-ACT-POSICION      VARYING W77-K FROM 1 BY 1116400      
002146                                           UNTIL W77-K > 6 OR     116500      
002147                                 WKS-TIP-CVE(W77-J W77-K) = ZEROS 116600      
002148        STORE S151B70POSICION                                     116700      
002149              ON EXCEPTION                                        116800      
002150                 PERFORM 900000-CHECA-STATUS.                     116900      
002151     MOVE ZEROS                 TO W77-J.                         117000      
002152*=================================================================117100      
002153*===              RUT-512000-ACT-SDOSXCONT-MES                    117200      
002154*=================================================================117300      
002155 522000-ACT-SDOSXCONT-MES.                                        117400      
002156     IF WKS-TIP-CVE(W77-J W77-K) < 11                             117500      
002157        IF WKS-MOV-FUNCION = 1                                    117600      
002158           IF WKS-TIP-AFEC (W77-J W77-K) = 1                      117700      
002159              ADD 1    TO B20-SDO-CNTMOV(WKS-TIP-CVE(W77-J W77-K))117800      
002160              SUBTRACT WKS-MOV-IMPORTE(W77-I) FROM                117900      
002161                           B20-SDO-SD(WKS-TIP-CVE(W77-J W77-K))   118000      
002162              IF W77-DISP = 2                                     118100      
002163                 MOVE WKS-MOV-CVETRAN(W77-I) TO WKK-MOV-CVETRAN   118200      
002164                 MOVE WKS-MOV-IMPORTE(W77-I) TO WKK-MOV-IMPORTE   118300      
002165                 MOVE W77-J               TO WKK-J                118400      
002166                 MOVE B20-SDO-SD(1)       TO WKK-SDO-SD1          118500      
002167                 MOVE B20-SDO-SD(2)       TO WKK-SDO-SD2          118600      
002168                 STRING "CVE TRA ", WKK-MOV-CVETRAN               118700      
002169                        "IMPORTE ", WKK-MOV-IMPENT                118800      
002170                               "."  WKK-MOV-IMPDEC                118900      
002171                        "APU CVE ", WKK-J                         119000      
002172                        "SALDO ANTERIOR DEL DIA ", WKK-SDO-ENT1   119100      
002173                                              "."  WKK-SDO-DEC1   119200      
002174                        "SALDO ACTUAL   DEL DIA ", WKK-SDO-ENT2   119300      
002175                                              "."  WKK-SDO-DEC2   119400      
002176                 DELIMITED BY SIZE INTO TEXTO-LJ                  119500      
002177*ASM             PERFORM 999999-DESPLIEGA                         119600      
002178              ELSE                                                119700      
002179                 NEXT SENTENCE                                    119800      
002180           ELSE                                                   119900      
002181           IF WKS-TIP-AFEC (W77-J W77-K) = 2                      120000      
002182              ADD 1    TO B20-SDO-CNTMOV(WKS-TIP-CVE(W77-J W77-K))120100      
002183              ADD WKS-MOV-IMPORTE(W77-I) TO                       120200      
002184                           B20-SDO-SD(WKS-TIP-CVE(W77-J W77-K))   120300      
002185              IF W77-DISP = 2                                     120400      
002186                 MOVE WKS-MOV-CVETRAN(W77-I) TO WKK-MOV-CVETRAN   120500      
002187                 MOVE WKS-MOV-IMPORTE(W77-I) TO WKK-MOV-IMPORTE   120600      
002188                 MOVE W77-J               TO WKK-J                120700      
002189                 MOVE B20-SDO-SD(1)       TO WKK-SDO-SD1          120800      
002190                 MOVE B20-SDO-SD(2)       TO WKK-SDO-SD2          120900      
002191                 STRING "CVE TRA ", WKK-MOV-CVETRAN               121000      
002192                        "IMPORTE ", WKK-MOV-IMPENT                121100      
002193                               "."  WKK-MOV-IMPDEC                121200      
002194                        "APU CVE ", WKK-J                         121300      
002195                        "SALDO ANTERIOR DEL DIA ", WKK-SDO-ENT1   121400      
002196                                              "."  WKK-SDO-DEC1   121500      
002197                        "SALDO ACTUAL   DEL DIA ", WKK-SDO-ENT2   121600      
002198                                              "."  WKK-SDO-DEC2   121700      
002199                 DELIMITED BY SIZE INTO TEXTO-LJ                  121800      
002200*ASM             PERFORM 999999-DESPLIEGA                         121900      
002201              ELSE                                                122000      
002202                 NEXT SENTENCE                                    122100      
002203           ELSE                                                   122200      
002204              NEXT SENTENCE                                       122300      
002205        ELSE                                                      122400      
002206        IF WKS-MOV-FUNCION = 2                                    122500      
002207           IF WKS-TIP-AFEC (W77-J W77-K) = 1                      122600      
002208              SUBTRACT 1 FROM                                     122700      
002209                         B20-SDO-CNTMOV(WKS-TIP-CVE(W77-J W77-K)) 122800      
002210              ADD WKS-MOV-IMPORTE(W77-I) TO                       122900      
002211                           B20-SDO-SD(WKS-TIP-CVE(W77-J W77-K))   123000      
002212           ELSE                                                   123100      
002213           IF WKS-TIP-AFEC (W77-J W77-K) = 2                      123200      
002214              SUBTRACT 1 FROM                                     123300      
002215                         B20-SDO-CNTMOV(WKS-TIP-CVE(W77-J W77-K)) 123400      
002216              SUBTRACT WKS-MOV-IMPORTE(W77-I) FROM                123500      
002217                           B20-SDO-SD(WKS-TIP-CVE(W77-J W77-K))   123600      
002218           ELSE                                                   123700      
002219              NEXT SENTENCE                                       123800      
002220        ELSE                                                      123900      
002221           NEXT SENTENCE                                          124000      
002222     ELSE                                                         124100      
002223        COMPUTE W77-DIV-CVE = WKS-TIP-CVE(W77-J W77-K) + 1        124200      
002224        DIVIDE W77-DIV-CVE BY   12 GIVING W77-RESULTADO           124300      
002225                                   REMAINDER W77-REMANENTE        124400      
002226        ADD 1                      TO  W77-REMANENTE              124500      
002227        PERFORM 522100-ACT-SDOSXCONT-MES                          124600      
002228        IF WKS-MOV-CVETRAN(W77-I) = 18 AND                        124700      
002229           WKS-MOV-PRODUCTO       = 84 AND                        124800      
002230           WKS-MOV-INSTRUMENTO    = 15                            124900      
002231           PERFORM 522200-ACT-SDOSXCONT-MES084.                   125000      
002232*=================================================================125100      
002233*===              RUT-522100-ACT-SDOSXCONT-MES                    125200      
002234*=================================================================125300      
002235 522100-ACT-SDOSXCONT-MES.                                        125400      
002236     MOVE ZEROS                    TO W77-NOTFOUND-SDODIA         125500      
002237     LOCK B21SXSDMENCON1 AT B21-SDO-KEYAM  =                      125600      
002238                            WKS-MOV-FECCONT-AAMM               AND125700      
002239                            B21-SDO-KEYCON = WKS-MOV-CONTRATO  AND125800      
002240                            B21-SDO-KEYPRD = WKS-MOV-PRODUCTO  AND125900      
002241                            B21-SDO-KEYINS = WKS-MOV-INSTRUMENTO  126000      
002242                        AND B21-SDO-KEYIND = W77-RESULTADO        126100      
002243          ON EXCEPTION                                            126200      
002244             IF DMSTATUS(NOTFOUND)                                126300      
002245                MOVE 1             TO W77-NOTFOUND-SDODIA         126400      
002246             ELSE                                                 126500      
002247                PERFORM 900000-CHECA-STATUS.                      126600      
002248     IF W77-NOTFOUND-SDODIA = 1                                   126700      
002249        CREATE S151B21SDMENCON1                                   126800      
002250        MOVE WKS-MOV-CONTRATO      TO B21-SDO-KEYCON              126900      
002251        MOVE WKS-MOV-FECCONT-AAMM  TO B21-SDO-KEYAM               127000      
002252        MOVE WKS-MOV-PRODUCTO      TO B21-SDO-KEYPRD              127100      
002253        MOVE WKS-MOV-INSTRUMENTO   TO B21-SDO-KEYINS              127200      
002254        MOVE W77-RESULTADO         TO B21-SDO-KEYIND              127300      
002255        IF W77-RESULTADO > B20-SDO-APUIMP                         127400      
002256           MOVE W77-RESULTADO      TO B20-SDO-APUIMP.             127500      
002257     IF WKS-MOV-FUNCION = 1                                       127600      
002258        IF WKS-MOV-CVETRAN(W77-I) = 505 AND                       127700      
002259           (WKS-MOV-SISTEMA = 500 OR 555)                         127800      
002260           ADD WKS-MOV-CHQEXE (W77-I) TO                          127900      
002261               B21-SDO-CNTMOV(W77-REMANENTE)                      128000      
002262           ADD WKS-MOV-IMPORTE(W77-I) TO                          128100      
002263               B21-SDO-SD(W77-REMANENTE)                          128200      
002264        ELSE                                                      128300      
002265        IF WKS-TIP-AFEC (W77-J W77-K) = 1                         128400      
002266           IF WKS-MOV-PRODUCTO       = 84 AND                     128500      
002267              WKS-MOV-INSTRUMENTO    = 15 AND                     128600      
002268              ((W77-REMANENTE          = 11 AND                   128700      
002269                W77-RESULTADO          = 25) OR                   128800      
002270               (W77-REMANENTE          = 3 AND                    128900      
002271                W77-RESULTADO          = 26)) AND                 129000      
002272              B21-SDO-CNTMOV(W77-REMANENTE) > ZEROS               129100      
002273              SUBTRACT 1 FROM B21-SDO-CNTMOV(W77-REMANENTE)       129200      
002274              SUBTRACT WKS-MOV-IMPORTE(W77-I) FROM                129300      
002275                          B21-SDO-SD(W77-REMANENTE)               129400      
002276           ELSE                                                   129500      
002277              ADD 1      TO B21-SDO-CNTMOV(W77-REMANENTE)         129600      
002278              SUBTRACT WKS-MOV-IMPORTE(W77-I) FROM                129700      
002279                          B21-SDO-SD(W77-REMANENTE)               129800      
002280        ELSE                                                      129900      
002281        IF WKS-TIP-AFEC (W77-J W77-K) = 2                         130000      
002282           ADD 1    TO B21-SDO-CNTMOV(W77-REMANENTE)              130100      
002283           ADD WKS-MOV-IMPORTE(W77-I) TO                          130200      
002284                        B21-SDO-SD(W77-REMANENTE)                 130300      
002285        ELSE                                                      130400      
002286           NEXT SENTENCE                                          130500      
002287     ELSE                                                         130600      
002288     IF WKS-MOV-FUNCION = 2                                       130700      
002289        IF WKS-MOV-CVETRAN(W77-I) = 505 AND                       130800      
002290           (WKS-MOV-SISTEMA = 500 OR 555)                         130900      
002291           SUBTRACT WKS-MOV-CHQEXE (W77-I) FROM                   131000      
002292                    B21-SDO-CNTMOV(W77-REMANENTE)                 131100      
002293           SUBTRACT WKS-MOV-IMPORTE(W77-I) FROM                   131200      
002294                    B21-SDO-SD(W77-REMANENTE)                     131300      
002295        ELSE                                                      131400      
002296        IF WKS-TIP-AFEC (W77-J W77-K) = 1                         131500      
002297           SUBTRACT 1 FROM                                        131600      
002298                      B21-SDO-CNTMOV(W77-REMANENTE)               131700      
002299           ADD WKS-MOV-IMPORTE(W77-I) TO                          131800      
002300                        B21-SDO-SD(W77-REMANENTE)                 131900      
002301        ELSE                                                      132000      
002302        IF WKS-TIP-AFEC (W77-J W77-K) = 2                         132100      
002303           SUBTRACT 1 FROM                                        132200      
002304                      B21-SDO-CNTMOV(W77-REMANENTE)               132300      
002305           SUBTRACT WKS-MOV-IMPORTE(W77-I) FROM                   132400      
002306                        B21-SDO-SD(W77-REMANENTE).                132500      
002307     STORE S151B21SDMENCON1                                       132600      
002308           ON EXCEPTION                                           132700      
002309              PERFORM 900000-CHECA-STATUS.                        132800      
002310*=================================================================132900      
002311*===              RUT-522200-ACT-SDOSXCONT-MES084                 133000      
002312*=================================================================133100      
002313 522200-ACT-SDOSXCONT-MES084.                                     133200      
002314     MOVE ZEROS                    TO W77-NOTFOUND-SDODIA         133300      
002315     LOCK B21SXSDMENCON1 AT B21-SDO-KEYAM  =                      133400      
002316                            WKS-MOV-FECCONT-AAMM               AND133500      
002317                            B21-SDO-KEYCON = WKS-MOV-CONTRATO  AND133600      
002318                            B21-SDO-KEYPRD = WKS-MOV-PRODUCTO  AND133700      
002319                            B21-SDO-KEYINS = WKS-MOV-INSTRUMENTO  133800      
002320                        AND B21-SDO-KEYIND = 25                   133900      
002321          ON EXCEPTION                                            134000      
002322             IF DMSTATUS(NOTFOUND)                                134100      
002323                MOVE 1             TO W77-NOTFOUND-SDODIA         134200      
002324             ELSE                                                 134300      
002325                PERFORM 900000-CHECA-STATUS.                      134400      
002326     IF W77-NOTFOUND-SDODIA = 1                                   134500      
002327        CREATE S151B21SDMENCON1                                   134600      
002328        MOVE WKS-MOV-CONTRATO      TO B21-SDO-KEYCON              134700      
002329        MOVE WKS-MOV-FECCONT-AAMM  TO B21-SDO-KEYAM               134800      
002330        MOVE WKS-MOV-PRODUCTO      TO B21-SDO-KEYPRD              134900      
002331        MOVE WKS-MOV-INSTRUMENTO   TO B21-SDO-KEYINS              135000      
002332        MOVE 25                    TO B21-SDO-KEYIND              135100      
002333        IF B20-SDO-APUIMP < 25                                    135200      
002334           MOVE 25                 TO B20-SDO-APUIMP.             135300      
002335     IF WKS-MOV-FUNCION = 1                                       135400      
002336        IF WKS-MOV-MENSUALIDAD > ZEROS                            135500      
002337           COMPUTE B21-SDO-CNTMOV(11) = WKS-MOV-MENSUALIDAD - 1.  135600      
002338     STORE S151B21SDMENCON1                                       135700      
002339           ON EXCEPTION                                           135800      
002340              PERFORM 900000-CHECA-STATUS.                        135900      
002341     MOVE ZEROS                    TO W77-NOTFOUND-SDODIA         136000      
002342     LOCK B21SXSDMENCON1 AT B21-SDO-KEYAM  =                      136100      
002343                            WKS-MOV-FECCONT-AAMM               AND136200      
002344                            B21-SDO-KEYCON = WKS-MOV-CONTRATO  AND136300      
002345                            B21-SDO-KEYPRD = WKS-MOV-PRODUCTO  AND136400      
002346                            B21-SDO-KEYINS = WKS-MOV-INSTRUMENTO  136500      
002347                        AND B21-SDO-KEYIND = 26                   136600      
002348          ON EXCEPTION                                            136700      
002349             IF DMSTATUS(NOTFOUND)                                136800      
002350                MOVE 1             TO W77-NOTFOUND-SDODIA         136900      
002351             ELSE                                                 137000      
002352                PERFORM 900000-CHECA-STATUS.                      137100      
002353     IF W77-NOTFOUND-SDODIA = 1                                   137200      
002354        CREATE S151B21SDMENCON1                                   137300      
002355        MOVE WKS-MOV-CONTRATO      TO B21-SDO-KEYCON              137400      
002356        MOVE WKS-MOV-FECCONT-AAMM  TO B21-SDO-KEYAM               137500      
002357        MOVE WKS-MOV-PRODUCTO      TO B21-SDO-KEYPRD              137600      
002358        MOVE WKS-MOV-INSTRUMENTO   TO B21-SDO-KEYINS              137700      
002359        MOVE 26                    TO B21-SDO-KEYIND              137800      
002360        IF B20-SDO-APUIMP < 26                                    137900      
002361           MOVE 26                 TO B20-SDO-APUIMP.             138000      
002362     IF WKS-MOV-FUNCION = 1                                       138100      
002363        IF WKS-MOV-MENSUALIDAD > ZEROS                            138200      
002364           MOVE WKS-MOV-MENSUALIDAD TO B21-SDO-CNTMOV(1).         138300      
002365     STORE S151B21SDMENCON1                                       138400      
002366           ON EXCEPTION                                           138500      
002367              PERFORM 900000-CHECA-STATUS.                        138600      
002368*=================================================================138700      
002369*===              RUT-530000-ACT-POSICION                         138800      
002370*=================================================================138900      
002371 530000-ACT-POSICION.                                             139000      
002372     IF WKS-TIP-CVE(W77-J W77-K) < 11                             139100      
002373        IF WKS-MOV-FUNCION = 1                                    139200      
002374           IF WKS-TIP-AFEC (W77-J W77-K) = 1                      139300      
002375              ADD 1    TO B70-SDO-CNTMOV(WKS-TIP-CVE(W77-J W77-K))139400      
002376              SUBTRACT WKS-MOV-IMPORTE(W77-I) FROM                139500      
002377                           B70-SDO-SD(WKS-TIP-CVE(W77-J W77-K))   139600      
002378              IF W77-DISP = 1                                     139700      
002379                 MOVE WKS-MOV-CVETRAN(W77-I) TO WKK-MOV-CVETRAN   139800      
002380                 MOVE WKS-MOV-IMPORTE(W77-I) TO WKK-MOV-IMPORTE   139900      
002381                 MOVE W77-J               TO WKK-J                140000      
002382                 MOVE B70-SDO-SD(1)       TO WKK-SDO-SD3          140100      
002383                 MOVE B70-SDO-SD(2)       TO WKK-SDO-SD4          140200      
002384                 STRING "CVE TRA ", WKK-MOV-CVETRAN               140300      
002385                        "IMPORTE ", WKK-MOV-IMPENT                140400      
002386                               "."  WKK-MOV-IMPDEC                140500      
002387                        "APU CVE ", WKK-J                         140600      
002388                        "SDO ANT POSICI DEL DIA ", WKK-SDO-ENT3   140700      
002389                                              "."  WKK-SDO-DEC3   140800      
002390                        "SDO ACT POSICI DEL DIA ", WKK-SDO-ENT4   140900      
002391                                              "."  WKK-SDO-DEC4   141000      
002392                 DELIMITED BY SIZE INTO TEXTO-LJ                  141100      
002393*ASM             PERFORM 999999-DESPLIEGA                         141200      
002394              ELSE                                                141300      
002395                 NEXT SENTENCE                                    141400      
002396           ELSE                                                   141500      
002397           IF WKS-TIP-AFEC (W77-J W77-K) = 2                      141600      
002398              ADD 1    TO B70-SDO-CNTMOV(WKS-TIP-CVE(W77-J W77-K))141700      
002399              ADD WKS-MOV-IMPORTE(W77-I) TO                       141800      
002400                           B70-SDO-SD(WKS-TIP-CVE(W77-J W77-K))   141900      
002401              IF W77-DISP = 1                                     142000      
002402                 MOVE WKS-MOV-CVETRAN(W77-I) TO WKK-MOV-CVETRAN   142100      
002403                 MOVE WKS-MOV-IMPORTE(W77-I) TO WKK-MOV-IMPORTE   142200      
002404                 MOVE W77-J               TO WKK-J                142300      
002405                 MOVE B70-SDO-SD(1)       TO WKK-SDO-SD3          142400      
002406                 MOVE B70-SDO-SD(2)       TO WKK-SDO-SD4          142500      
002407                 STRING "CVE TRA ", WKK-MOV-CVETRAN               142600      
002408                        "IMPORTE ", WKK-MOV-IMPENT                142700      
002409                               "."  WKK-MOV-IMPDEC                142800      
002410                        "APU CVE ", WKK-J                         142900      
002411                        "SALDO ANTERIOR DEL DIA ", WKK-SDO-ENT3   143000      
002412                                              "."  WKK-SDO-DEC3   143100      
002413                        "SALDO ACTUAL   DEL DIA ", WKK-SDO-ENT4   143200      
002414                                              "."  WKK-SDO-DEC4   143300      
002415                 DELIMITED BY SIZE INTO TEXTO-LJ                  143400      
002416*ASM             PERFORM 999999-DESPLIEGA                         143500      
002417              ELSE                                                143600      
002418                 NEXT SENTENCE                                    143700      
002419           ELSE                                                   143800      
002420              NEXT SENTENCE                                       143900      
002421        ELSE                                                      144000      
002422        IF WKS-MOV-FUNCION = 2                                    144100      
002423           IF WKS-TIP-AFEC (W77-J W77-K) = 1                      144200      
002424              SUBTRACT 1 FROM                                     144300      
002425                         B70-SDO-CNTMOV(WKS-TIP-CVE(W77-J W77-K)) 144400      
002426              ADD WKS-MOV-IMPORTE(W77-I) TO                       144500      
002427                           B70-SDO-SD(WKS-TIP-CVE(W77-J W77-K))   144600      
002428           ELSE                                                   144700      
002429           IF WKS-TIP-AFEC (W77-J W77-K) = 2                      144800      
002430              SUBTRACT 1 FROM                                     144900      
002431                         B70-SDO-CNTMOV(WKS-TIP-CVE(W77-J W77-K)) 145000      
002432              SUBTRACT WKS-MOV-IMPORTE(W77-I) FROM                145100      
002433                           B70-SDO-SD(WKS-TIP-CVE(W77-J W77-K))   145200      
002434           ELSE                                                   145300      
002435              NEXT SENTENCE                                       145400      
002436        ELSE                                                      145500      
002437           NEXT SENTENCE                                          145600      
002438     ELSE                                                         145700      
002439        COMPUTE W77-DIV-CVE = WKS-TIP-CVE(W77-J W77-K) + 1        145800      
002440        DIVIDE W77-DIV-CVE BY   12 GIVING W77-RESULTADO           145900      
002441                                   REMAINDER W77-REMANENTE        146000      
002442        ADD 1                      TO  W77-REMANENTE              146100      
002443        PERFORM 530100-ACT-POSICION                               146200      
002444        IF WKS-MOV-CVETRAN(W77-I) = 18 AND                        146300      
002445           WKS-MOV-PRODUCTO       = 84 AND                        146400      
002446           WKS-MOV-INSTRUMENTO    = 15                            146500      
002447           PERFORM 532200-ACT-POSICION-MES084.                    146600      
002448*=================================================================146700      
002449*===              RUT-530100-ACT-POSICION                         146800      
002450*=================================================================146900      
002451 530100-ACT-POSICION.                                             147000      
002452     MOVE ZEROS                    TO W77-NOTFOUND-SDODIA         147100      
002453     LOCK B71SXPOSDIAAD1 AT B71-SDO-KEYCSI = ZEROS             AND147200      
002454                            B71-SDO-KEYFEC = WKS-MOV-FECCONT   AND147300      
002455                            B71-SDO-KEYMON = WKS-MOV-MONEDA    AND147400      
002456                            B71-SDO-KEYPRD = WKS-MOV-PRODUCTO  AND147500      
002457                            B71-SDO-KEYINS = WKS-MOV-INSTRUMENTO  147600      
002458                        AND B71-SDO-KEYIND = W77-RESULTADO        147700      
002459          ON EXCEPTION                                            147800      
002460             IF DMSTATUS(NOTFOUND)                                147900      
002461                MOVE 1             TO W77-NOTFOUND-SDODIA         148000      
002462             ELSE                                                 148100      
002463                PERFORM 900000-CHECA-STATUS.                      148200      
002464     IF W77-NOTFOUND-SDODIA = 1                                   148300      
002465        CREATE S151B71POSDIAAD1                                   148400      
002466        MOVE ZEROS                 TO B71-SDO-KEYCSI              148500      
002467        MOVE WKS-MOV-FECCONT       TO B71-SDO-KEYFEC              148600      
002468        MOVE WKS-MOV-MONEDA        TO B71-SDO-KEYMON              148700      
002469        MOVE WKS-MOV-PRODUCTO      TO B71-SDO-KEYPRD              148800      
002470        MOVE WKS-MOV-INSTRUMENTO   TO B71-SDO-KEYINS              148900      
002471        MOVE W77-RESULTADO         TO B71-SDO-KEYIND.             149000      
002472        IF W77-RESULTADO > B70-SDO-APUIMP                         149100      
002473           MOVE W77-RESULTADO      TO B70-SDO-APUIMP.             149200      
002474     IF WKS-MOV-FUNCION = 1                                       149300      
002475        IF WKS-MOV-CVETRAN(W77-I) = 505 AND                       149400      
002476           (WKS-MOV-SISTEMA = 500 OR 555)                         149500      
002477           ADD WKS-MOV-CHQEXE (W77-I) TO                          149600      
002478               B71-SDO-CNTMOV(W77-REMANENTE)                      149700      
002479           ADD WKS-MOV-IMPORTE(W77-I) TO                          149800      
002480               B71-SDO-SD(W77-REMANENTE)                          149900      
002481        ELSE                                                      150000      
002482        IF WKS-TIP-AFEC (W77-J W77-K) = 1                         150100      
002483           IF WKS-MOV-PRODUCTO       = 84 AND                     150200      
002484              WKS-MOV-INSTRUMENTO    = 15 AND                     150300      
002485              ((W77-REMANENTE          = 11 AND                   150400      
002486                W77-RESULTADO          = 25) OR                   150500      
002487               (W77-REMANENTE          = 3 AND                    150600      
002488                W77-RESULTADO          = 26)) AND                 150700      
002489              B71-SDO-CNTMOV(W77-REMANENTE) > ZEROS               150800      
002490              SUBTRACT 1 FROM B71-SDO-CNTMOV(W77-REMANENTE)       150900      
002491              SUBTRACT WKS-MOV-IMPORTE(W77-I) FROM                151000      
002492                          B71-SDO-SD(W77-REMANENTE)               151100      
002493           ELSE                                                   151200      
002494              ADD 1      TO B71-SDO-CNTMOV(W77-REMANENTE)         151300      
002495              SUBTRACT WKS-MOV-IMPORTE(W77-I) FROM                151400      
002496                          B71-SDO-SD(W77-REMANENTE)               151500      
002497        ELSE                                                      151600      
002498        IF WKS-TIP-AFEC (W77-J W77-K) = 2                         151700      
002499           ADD 1    TO B71-SDO-CNTMOV(W77-REMANENTE)              151800      
002500           ADD WKS-MOV-IMPORTE(W77-I) TO                          151900      
002501                        B71-SDO-SD(W77-REMANENTE)                 152000      
002502        ELSE                                                      152100      
002503           NEXT SENTENCE                                          152200      
002504     ELSE                                                         152300      
002505     IF WKS-MOV-FUNCION = 2                                       152400      
002506        IF WKS-MOV-CVETRAN(W77-I) = 505 AND                       152500      
002507           (WKS-MOV-SISTEMA = 500 OR 555)                         152600      
002508           SUBTRACT WKS-MOV-CHQEXE (W77-I) FROM                   152700      
002509                    B71-SDO-CNTMOV(W77-REMANENTE)                 152800      
002510           SUBTRACT WKS-MOV-IMPORTE(W77-I) FROM                   152900      
002511                    B71-SDO-SD(W77-REMANENTE)                     153000      
002512        ELSE                                                      153100      
002513        IF WKS-TIP-AFEC (W77-J W77-K) = 1                         153200      
002514           SUBTRACT 1 FROM                                        153300      
002515                      B71-SDO-CNTMOV(W77-REMANENTE)               153400      
002516           ADD WKS-MOV-IMPORTE(W77-I) TO                          153500      
002517                        B71-SDO-SD(W77-REMANENTE)                 153600      
002518        ELSE                                                      153700      
002519        IF WKS-TIP-AFEC (W77-J W77-K) = 2                         153800      
002520           SUBTRACT 1 FROM                                        153900      
002521                      B71-SDO-CNTMOV(W77-REMANENTE)               154000      
002522           SUBTRACT WKS-MOV-IMPORTE(W77-I) FROM                   154100      
002523                        B71-SDO-SD(W77-REMANENTE).                154200      
002524     STORE S151B71POSDIAAD1                                       154300      
002525           ON EXCEPTION                                           154400      
002526              PERFORM 900000-CHECA-STATUS.                        154500      
002527 532200-ACT-POSICION-MES084.                                      154600      
002528     MOVE ZEROS                    TO W77-NOTFOUND-SDODIA         154700      
002529     LOCK B71SXPOSDIAAD1 AT B71-SDO-KEYCSI = ZEROS             AND154800      
002530                            B71-SDO-KEYFEC = WKS-MOV-FECCONT   AND154900      
002531                            B71-SDO-KEYMON = WKS-MOV-MONEDA    AND155000      
002532                            B71-SDO-KEYPRD = WKS-MOV-PRODUCTO  AND155100      
002533                            B71-SDO-KEYINS = WKS-MOV-INSTRUMENTO  155200      
002534                        AND B71-SDO-KEYIND = 25                   155300      
002535          ON EXCEPTION                                            155400      
002536             IF DMSTATUS(NOTFOUND)                                155500      
002537                MOVE 1             TO W77-NOTFOUND-SDODIA         155600      
002538             ELSE                                                 155700      
002539                PERFORM 900000-CHECA-STATUS.                      155800      
002540     IF W77-NOTFOUND-SDODIA = 1                                   155900      
002541        CREATE S151B71POSDIAAD1                                   156000      
002542        MOVE ZEROS                 TO B71-SDO-KEYCSI              156100      
002543        MOVE WKS-MOV-FECCONT       TO B71-SDO-KEYFEC              156200      
002544        MOVE WKS-MOV-MONEDA        TO B71-SDO-KEYMON              156300      
002545        MOVE WKS-MOV-PRODUCTO      TO B71-SDO-KEYPRD              156400      
002546        MOVE WKS-MOV-INSTRUMENTO   TO B71-SDO-KEYINS              156500      
002547        MOVE ZEROS                 TO B71-SDO-CNTMOV(11)          156600      
002548        MOVE 25                    TO B71-SDO-KEYIND              156700      
002549        IF B71-SDO-KEYIND < 25                                    156800      
002550           MOVE 25                 TO B70-SDO-APUIMP.             156900      
002551     IF WKS-MOV-FUNCION = 1                                       157000      
002552        IF WKS-MOV-MENSUALIDAD > ZEROS                            157100      
002553           COMPUTE B71-SDO-CNTMOV(11) = B71-SDO-CNTMOV(11) +      157200      
002554                                       (WKS-MOV-MENSUALIDAD - 1). 157300      
002555     STORE S151B71POSDIAAD1                                       157400      
002556           ON EXCEPTION                                           157500      
002557              PERFORM 900000-CHECA-STATUS.                        157600      
002558     MOVE ZEROS                    TO W77-NOTFOUND-SDODIA         157700      
002559     LOCK B71SXPOSDIAAD1 AT B71-SDO-KEYCSI = ZEROS             AND157800      
002560                            B71-SDO-KEYFEC = WKS-MOV-FECCONT   AND157900      
002561                            B71-SDO-KEYMON = WKS-MOV-MONEDA    AND158000      
002562                            B71-SDO-KEYPRD = WKS-MOV-PRODUCTO  AND158100      
002563                            B71-SDO-KEYINS = WKS-MOV-INSTRUMENTO  158200      
002564                        AND B71-SDO-KEYIND = 26                   158300      
002565          ON EXCEPTION                                            158400      
002566             IF DMSTATUS(NOTFOUND)                                158500      
002567                MOVE 1             TO W77-NOTFOUND-SDODIA         158600      
002568             ELSE                                                 158700      
002569                PERFORM 900000-CHECA-STATUS.                      158800      
002570     IF W77-NOTFOUND-SDODIA = 1                                   158900      
002571        CREATE S151B71POSDIAAD1                                   159000      
002572        MOVE ZEROS                 TO B71-SDO-KEYCSI              159100      
002573        MOVE WKS-MOV-FECCONT       TO B71-SDO-KEYFEC              159200      
002574        MOVE WKS-MOV-MONEDA        TO B71-SDO-KEYMON              159300      
002575        MOVE WKS-MOV-PRODUCTO      TO B71-SDO-KEYPRD              159400      
002576        MOVE WKS-MOV-INSTRUMENTO   TO B71-SDO-KEYINS              159500      
002577        MOVE ZEROS                 TO B71-SDO-CNTMOV(1)           159600      
002578        MOVE 26                    TO B71-SDO-KEYIND              159700      
002579        IF B71-SDO-KEYIND < 26                                    159800      
002580           MOVE 26                 TO B70-SDO-APUIMP.             159900      
002581     IF WKS-MOV-FUNCION = 1                                       160000      
002582        IF WKS-MOV-MENSUALIDAD > ZEROS                            160100      
002583           ADD WKS-MOV-MENSUALIDAD TO B71-SDO-CNTMOV(1).          160200      
002584     STORE S151B71POSDIAAD1                                       160300      
002585           ON EXCEPTION                                           160400      
002586              PERFORM 900000-CHECA-STATUS.                        160500      
002587*=================================================================160600      
002588*===              RUT-531000-GRABA-ERROR-SDOS                     160700      
002589*=================================================================160800      
002590 531000-GRABA-ERROR-CVETRA.                                       160900      
002591     ADD 1                         TO W77-NIV-MOVER               161000      
002592     CREATE S151B51MOVERRCTO                                      161100      
002593     MOVE W77-NIV-MOVER            TO B51-MOV-SEC                 161200      
002594     MOVE WKS-MOV-PRODUCTO         TO B51-MOV-PRD                 161300      
002595     MOVE WKS-MOV-INSTRUMENTO      TO B51-MOV-INS                 161400      
002596     MOVE WKS-MOV-SUCPROM          TO B51-MOV-SUCPRO              161500      
002597     MOVE WKS-MOV-CONTRATO         TO B51-MOV-KEYCON              161600      
002598     MOVE WKS-MOV-CVETRAN(W77-I)   TO B51-MOV-CVETRA              161700      
002599     MOVE WKS-MOV-INDLEY (W77-I)   TO B51-MOV-INDLEY              161800      
002600     MOVE WKS-MOV-ESQCON (W77-I)   TO B51-MOV-ESQCON              161900      
002601     MOVE WKS-MOV-IMPORTE(W77-I)   TO B51-MOV-IMP                 162000      
002602     MOVE WKS-MOV-FECMOV           TO B51-MOV-FECMOV              162100      
002603     MOVE WKS-MOV-HORMOV           TO B51-MOV-HORMOV              162200      
002604     MOVE WKS-MOV-FECCONT          TO B51-MOV-FECCON              162300      
002605     MOVE WKS-MOV-FECVAL           TO B51-MOV-FECVAL              162400      
002606     MOVE WKS-MOV-AUTORIZA         TO B51-MOV-AUTORI              162500      
002607     MOVE WKS-MOV-AUT3ER           TO B51-MOV-AUT3ERNIV           162600      
002608     MOVE WKS-MOV-REFNUM           TO B51-MOV-REFMOV              162700      
002609     MOVE WKS-MOV-CVEMDA           TO B51-MOV-CVEMDA              162800      
002610     MOVE WKS-MOV-MDA-SUC          TO B51-MOV-SUCPROMDA           162900      
002611     MOVE WKS-MOV-MDA-CTA          TO B51-MOV-NUMCTAMDA           163000      
002612     MOVE WKS-MOV-CVEMDE           TO B51-MOV-CVEMDE              163100      
002613     MOVE WKS-MOV-SUC-INIC         TO B51-MOV-SUCINI              163200      
002614     MOVE WKS-MOV-CAJA-INIC        TO B51-MOV-CAJINI              163300      
002615     MOVE WKS-MOV-SUCOPER          TO B51-MOV-SUCOPE              163400      
002616     MOVE WKS-MOV-CAJAOPER         TO B51-MOV-CAJOPE              163500      
002617     MOVE WKS-MOV-SUCTRAN          TO B51-MOV-SUCTRA              163600      
002618     MOVE WKS-MOV-CAJATRAN         TO B51-MOV-CAJTRA              163700      
002619     MOVE WKS-MOV-NOMINA-OPE       TO B51-MOV-NUMOPE              163800      
002620     MOVE WKS-MOV-ORIGEN           TO B51-MOV-ORIMOV              163900      
002621     MOVE WKS-MOV-MONEDA           TO B51-MOV-MON                 164000      
002622     MOVE WKS-MOV-AUT-S151         TO B51-MOV-AUTS151             164100      
002623     MOVE WKS-MOV-AUT-AELIM-S151   TO B51-MOV-AELIS151            164200      
002624     MOVE WKS-MOV-AUT-ANT-S151     TO B51-MOV-AANTS151            164300      
002625     MOVE WKS-MOV-TIPO-PROC        TO B51-MOV-PROCESO             164400      
002626     MOVE WKS-MOV-SOBREGIRO        TO B51-MOV-SOBGIRO             164500      
002627     MOVE WKS-MOV-CVEAVISO         TO B51-MOV-CVEAVISO            164600      
002628     MOVE WKS-MOV-IND-EDOCTA       TO B51-MOV-INDEDOCTA           164700      
002629     MOVE WKS-MOV-IND-DATOS-ADIC   TO B51-MOV-INDDATADI           164800      
002630     MOVE WKS-MOV-IND-CONTA        TO B51-MOV-INDCONTA            164900      
002631     MOVE WKS-MOV-IND-NUMREN       TO B51-MOV-INDNUMREN           165000      
002632     MOVE WKS-MOV-ACTIVIDAD        TO B51-MOV-ACTIVIDAD           165100      
002633     MOVE WKS-MOV-SECTOR           TO B51-MOV-SECTOR              165200      
002634     MOVE WKS-MOV-BANCA            TO B51-MOV-BANCA               165300      
002635     MOVE WKS-MOV-NODO-ORIG        TO B51-MOV-NODOORI             165400      
002636     MOVE WKS-MOV-APU-DESC         TO B51-MOV-APUDESC             165500      
002637     MOVE WKS-MOV-STATUS           TO B51-MOV-STAMOV              165600      
002638     IF B51-MOV-APUDESC > ZEROS                                   165700      
002639        PERFORM 531200-CARGA-DATOS-ADIC.                          165800      
002640     STORE S151B51MOVERRCTO                                       165900      
002641           ON EXCEPTION                                           166000      
002642              MOVE "E"    TO      TIPO-LJ                         166100      
002643              MOVE 010105 TO      CODIGO-LJ                       166200      
002644              STRING "ERROR EN STORE S151B51MOVERRCTO"            166300      
002645              DELIMITED BY SIZE INTO TEXTO-LJ                     166400      
002646              PERFORM 999999-DESPLIEGA                            166500      
002647              PERFORM 900000-CHECA-STATUS                         166600      
002648              SET MYSELF(STATUS) TO -1.                           166700      
002649*=================================================================166800      
002650*===              RUT-531200-CARGA-DATOS-ADIC                     166900      
002651*=================================================================167000      
002652 531200-CARGA-DATOS-ADIC.                                         167100      
002653     LOCK B53SXDATADIERR AT B53-MOV-SEC = W77-NIV-MOVER           167200      
002654          ON EXCEPTION                                            167300      
002655             IF DMSTATUS(NOTFOUND)                                167400      
002656                CREATE S151B53DATADIERR                           167500      
002657                MOVE W77-NIV-MOVER         TO B53-MOV-SEC         167600      
002658             ELSE                                                 167700      
002659                PERFORM 900000-CHECA-STATUS.                      167800      
002660     MOVE WKS-MOV-NOMINA-FUN1      TO B53-MOV-FUN1                167900      
002661     MOVE WKS-MOV-NOMINA-FUN2      TO B53-MOV-FUN2                168000      
002662     MOVE WKS-MOV-SIST-ORIG        TO B53-MOV-SISORI              168100      
002663     MOVE WKS-MOV-PROD-ORIG        TO B53-MOV-PRDORI              168200      
002664     MOVE WKS-MOV-INST-ORIG        TO B53-MOV-INSORI              168300      
002665     MOVE WKS-MOV-CVETR-ORIG       TO B53-MOV-CVEORI              168400      
002666     MOVE WKS-MOV-CONT-ORIG        TO B53-MOV-CONORI              168500      
002667     MOVE WKS-MOV-REFLOC-BNM       TO B53-MOV-REFLOCBNM           168600      
002668     MOVE WKS-MOV-LEY(W77-I)       TO B53-MOV-LEY1                168700      
002669     MOVE WKS-MOV-FILLERXAPLI      TO B53-MOV-FILXAPL             168800      
002670     STORE S151B53DATADIERR                                       168900      
002671          ON EXCEPTION                                            169000      
002672             PERFORM 900000-CHECA-STATUS.                         169100      
002673*=================================================================169200      
002674*==         RUTINA DE VERIFICACION DE ERRORES DE DMSII         ===169300      
002675*=================================================================169400      
002676 900000-CHECA-STATUS.                                             169500      
002677     MOVE DMSTATUS(DMCATEGORY)            TO WKS-ERR-DMSII        169600      
002678     MOVE DMSTATUS(DMERRORTYPE)           TO WKS-TIPOERR-DMSII    169700      
002679     MOVE DMSTATUS(DMSTRUCTURE)           TO WKS-STRUCTU-DMSII    169800      
002680     IF WKS-ERR-DMSII > ZEROS                                     169900      
002681        MOVE "E"          TO      TIPO-LJ                         170000      
002682        MOVE 010101       TO      CODIGO-LJ                       170100      
002683        STRING "BASE DATOS  ", WKS-NOM-BDERR-DMSII                170200      
002684               "ERROR EN BD ", WKS-LEY-ERR-DMSII(WKS-ERR-DMSII)   170300      
002685                          " "  WKS-ERR-DMSII                      170400      
002686               "TIPO        ", WKS-TIPOERR-DMSII                  170500      
002687               "ESTRUCTURA  ", WKS-STRUCTU-DMSII                  170600      
002688        DELIMITED BY SIZE INTO TEXTO-LJ                           170700      
002689        PERFORM 999999-DESPLIEGA.                                 170800      
002690      MOVE WKS-ERR-DMSII            TO W77-RES-MOV.               170900      
002691      MOVE B00-SDO-LECARCDIA(W77-D)        TO WKK-SDO-LECARCDIA   171000      
002692      MOVE B00-MOV-LECARCDIA(W77-D)        TO WKK-MOV-LECARCDIA   171100      
002693      MOVE W77-ULT-LEC    TO      WKK-ULT-LEC                     171200      
002694      STRING " B00-SDO-LECARCDIA(W77-D) ", WKK-SDO-LECARCDIA      171300      
002695             " B00-MOV-LECARCDIA(W77-D) ", WKK-MOV-LECARCDIA      171400      
002696             " ULTIMA LEC ", WKK-ULT-LEC                          171500      
002697      DELIMITED BY SIZE INTO TEXTO-LJ                             171600      
002698      PERFORM 999999-DESPLIEGA                                    171700      
002699      STOP "DAR OK PARA CONT".                                    171800      
002700 999999-DISPLAY-INICIO.                                           171900      
002701*======================                                           172000      
002702     MOVE "S151"  TO      SISTEMA-LJ.                             172100      
002703     MOVE "L020"  TO      PASO-LJ.                                172200      
002704     MOVE "002"   TO      MTP-LJ.                                 172300      
002705     CHANGE ATTRIBUTE TITLE OF "LIB-DISP" TO                      172400      
002706        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          172500      
002707     MOVE "I"     TO      TIPO-LJ.                                172600      
002708     MOVE 020101  TO      CODIGO-LJ.                              172700      
002709 999999-DESPLIEGA.                                                172800      
002710*=================                                                172900      
002711     CALL "LJ IN LIB-DISP"                                        173000      
002712              USING CONTADOR-LJ, MENSAJE-LJ.                      173100      
