000001$SET LIST ERRORLIMIT = 30                                         000100      
000002*$SET TADS                                                        000200      
000003 IDENTIFICATION DIVISION.                                         000300      
000004 AUTHOR. ING. LINO HECTOR TORRES CORONADO                         000400      
000005******************************************************************000500      
000006* PROGRAMA QUE GENERA PUNTEO DE TOTALES POR CLAVE CON LAS APLI-  *000600      
000007* CACIONES QUE ENVIAN MOVIMIENTOS AL S151. EL PROGRAMA MANEJA    *000700      
000008* DOS TIPOS DE PUNTEO: 1)TOTALES POR CLAVE. EN CASO DE ENCONTRAR *000800      
000009* DIFERENCIAS SE REALIZA UN SEGUNDO PUNTEO, 2)PUNTEO A DETALLE   *000900      
000010* POR CONTRATO-CLAVE.                                            *001000      
000011*                                                                *001090      
000012* RECOMPILACION POR EL UPGRADE DEL MCP A 55                      *001092      
000013* 20141208 15MTP001 MJGRG                                        *001094      
000014******************************************************************001100      
000015 ENVIRONMENT DIVISION.                                            001200      
000016 INPUT-OUTPUT SECTION.                                            001300      
000017 FILE-CONTROL.                                                    001400      
000018                                                                  001500      
000019      SELECT CVETRAN        ASSIGN TO DISK                        001600      
000020                            RESERVE 0 AREAS                       001700      
000021                            ORGANIZATION IS SEQUENTIAL            001800      
000022                            ACCESS MODE  IS SEQUENTIAL            001900      
000023                            ACTUAL KEY IS W77-APUCVE.             002000      
000024                                                                  002100      
000025      SELECT CVETRANS151    ASSIGN TO DISK                        002200      
000026                            RESERVE 0 AREAS                       002300      
000027                            ORGANIZATION IS SEQUENTIAL            002400      
000028                            ACCESS MODE  IS SEQUENTIAL            002500      
000029                            ACTUAL KEY IS W77-APUCVES151.         002600      
000030                                                                  002612      
000031      SELECT A00-SPUNTEO1   ASSIGN TO DISK                        002614      
000032                            ORGANIZATION IS SEQUENTIAL            002616      
000033                            ACCESS MODE  IS SEQUENTIAL            002618      
000034                            ACTUAL KEY IS W77-LLAVE-PUN1.         002620      
000035      SELECT A00-SPUNTEO2   ASSIGN TO DISK                        002622      
000036                            ORGANIZATION IS SEQUENTIAL            002624      
000037                            ACCESS MODE  IS SEQUENTIAL            002626      
000038                            ACTUAL KEY IS W77-LLAVE-PUN2.         002700      
000039      SELECT SCVETRAN       ASSIGN TO SORT DISK.                  002800      
000040                                                                  002900      
000041      SELECT CVESNNNDIF     ASSIGN TO DISK                        003000      
000042                            ACCESS MODE IS SEQUENTIAL.            003100      
000043                                                                  003200      
000044      SELECT CVES151DIF     ASSIGN TO DISK                        003300      
000045                            ACCESS MODE IS SEQUENTIAL.            003400      
000046                                                                  003500      
000047      SELECT SCVEDIF        ASSIGN TO SORT DISK.                  003600      
000048                                                                  003700      
000049      SELECT TOTCVETRAN     ASSIGN TO DISK                        003800      
000050                            ACCESS MODE IS SEQUENTIAL.            003900      
000051                                                                  004000      
000052      SELECT DETCVETRAN     ASSIGN TO DISK                        004100      
000053                            ACCESS MODE IS SEQUENTIAL.            004200      
000054                                                                  004300      
000055      SELECT V00-REP-CVES   ASSIGN TO PRINTER.                    004400      
000056                                                                  004500      
000057      SELECT V00-REP-DETCVES ASSIGN TO PRINTER.                   004600      
000058                                                                  004700      
000059 DATA DIVISION.                                                   004800      
000060 FILE SECTION.                                                    004900      
000061                                                                  005000      
000062 FD CVETRAN                                                       005100      
000063*==========                                                       005200      
000064    VALUE OF TITLE IS WKS-TIT-CVES                                005300      
000065    VALUE OF MAXRECSIZE     IS 8                                  005400      
000066             FRAMESIZE      IS 48                                 005500      
000067             AREAS IS 1000                                        005600      
000068             AREASIZE IS 9000                                     005700      
000069    BLOCK CONTAINS            15 RECORDS.                         005800      
000070                                                                  005900      
000071 01 REG-CVETRAN                           PIC X(48).              006000      
000072                                                                  006100      
000073 FD CVETRANS151                                                   006200      
000074*==============                                                   006300      
000075    VALUE OF TITLE IS WKS-TIT-CVES151                             006400      
000076    VALUE OF MAXRECSIZE     IS 8                                  006500      
000077             FRAMESIZE      IS 48                                 006600      
000078             AREAS IS 1000                                        006700      
000079             AREASIZE IS 9000                                     006800      
000080    BLOCK CONTAINS            15 RECORDS.                         006900      
000081                                                                  007000      
000082 01 REG-CVETRANS151.                                              007100      
000083    02 R00-S151-CVEREG         PIC 9(02) COMP.                    007200      
000084    02 R00-S151-LIBRO          PIC 9(02) COMP.                    007300      
000085    02 R00-S151-CONTRATO       PIC 9(16) COMP.                    007400      
000086    02 R00-S151-MONEDA         PIC 9(04) COMP.                    007500      
000087    02 R00-S151-CVETRA         PIC 9(04) COMP.                    007600      
000088    02 R00-S151-TM             PIC 9(04) COMP.                    007700      
000089    02 R00-S151-IMPORTE        PIC 9(14)V99 COMP.                 007800      
000090    02 R00-S151-AUTS151        PIC 9(08) COMP.                    007900      
000091    02 R00-S151-AUTAPL         PIC 9(08) COMP.                    008000      
000092    02 R00-S151-SUCINI         PIC 9(04) COMP.                    008100      
000093    02 R00-S151-CAJAINI        PIC 9(02) COMP.                    008200      
000094    02 R00-S151-PRODUCTO       PIC 9(04) COMP.                    008300      
000095    02 R00-S151-INST           PIC 9(04) COMP.                    008400      
000096    02 FILLER                  PIC X(9).                          008500      
000097                                                                  008600      
000098 FD A00-SPUNTEO1                                                  008602      
000099*===============                                                  008604      
000100    VALUE OF MAXRECSIZE        IS 8                               008606      
000101             FRAMESIZE         IS 48                              008608      
000102             AREAS             IS 1000                            008610      
000103             AREASIZE          IS 9000                            008612      
000104    BLOCK CONTAINS             15 RECORDS.                        008614      
000105                                                                  008616      
000106 01 A00-R00-SPUNTEO1           PIC X(48).                         008618      
000107                                                                  008620      
000108 FD A00-SPUNTEO2                                                  008632      
000109*===============                                                  008634      
000110    VALUE OF MAXRECSIZE        IS 8                               008636      
000111             FRAMESIZE         IS 48                              008638      
000112             AREAS             IS 1000                            008640      
000113             AREASIZE          IS 9000                            008642      
000114    BLOCK CONTAINS             15 RECORDS.                        008644      
000115                                                                  008646      
000116 01 A00-R00-SPUNTEO2           PIC X(48).                         008648      
000117                                                                  008650      
000118 SD SCVETRAN.                                                     008700      
000119*============                                                     008800      
000120 01 SREG-CVETRAN.                                                 008900      
000121    02 S00-PUN-CVEREG         PIC 9(02) COMP.                     009000      
000122    02 S00-PUN-LIBRO          PIC 9(02) COMP.                     009100      
000123    02 S00-PUN-CONTRATO       PIC 9(16) COMP.                     009200      
000124    02 S00-PUN-MONEDA         PIC 9(04) COMP.                     009300      
000125    02 S00-PUN-CVETRA         PIC 9(04) COMP.                     009400      
000126    02 S00-PUN-TM             PIC 9(04) COMP.                     009500      
000127    02 S00-PUN-IMPORTE        PIC 9(14)V99 COMP.                  009600      
000128    02 S00-PUN-AUTS151        PIC 9(08) COMP.                     009700      
000129    02 S00-PUN-AUTAPL         PIC 9(08) COMP.                     009800      
000130    02 S00-PUN-SUCINI         PIC 9(04) COMP.                     009900      
000131    02 S00-PUN-CAJAINI        PIC 9(02) COMP.                     010000      
000132    02 S00-PUN-PRODUCTO       PIC 9(04) COMP.                     010100      
000133    02 S00-PUN-INST           PIC 9(04) COMP.                     010200      
000134    02 FILLER                 PIC X(9).                           010300      
000135                                                                  010400      
000136 FD CVESNNNDIF                                                    010500      
000137*=============                                                    010600      
000138    VALUE OF MAXRECSIZE     IS 7                                  010700      
000139             FRAMESIZE      IS 48                                 010800      
000140             AREAS IS 1000                                        010900      
000141             AREASIZE IS 9000                                     011000      
000142    BLOCK CONTAINS            30 RECORDS.                         011100      
000143                                                                  011200      
000144 01 REG-CVESNNNDIF.                                               011300      
000145    02 R01-LLAVE-REGSNNN.                                         011400      
000146       03 R01-SNNN-CONTRATO       PIC 9(16) COMP.                 011500      
000147       03 R01-SNNN-LIBRO          PIC 9(02) COMP.                 011600      
000148       03 R01-SNNN-MONEDA         PIC 9(04) COMP.                 011700      
000149       03 R01-SNNN-CVETRA         PIC 9(04) COMP.                 011800      
000150       03 R01-SNNN-TM             PIC 9(04) COMP.                 011900      
000151       03 R01-SNNN-IMPORTE        PIC 9(14)V99 COMP.              012000      
000152       03 R01-SNNN-AUTS151        PIC 9(08) COMP.                 012100      
000153    02 R01-SNNN-SUCINI         PIC 9(04) COMP.                    012200      
000154    02 R01-SNNN-CAJAINI        PIC 9(04) COMP.                    012300      
000155    02 R01-SNNN-PRODUCTO       PIC 9(04) COMP.                    012400      
000156    02 R01-SNNN-INST           PIC 9(04) COMP.                    012500      
000157    02 R01-SNNN-AUTAPL         PIC 9(08) COMP.                    012600      
000158    02 FILLER                  PIC X(03).                         012700      
000159                                                                  012800      
000160 FD CVES151DIF                                                    012900      
000161*=============                                                    013000      
000162    VALUE OF MAXRECSIZE     IS 7                                  013100      
000163             FRAMESIZE      IS 48                                 013200      
000164             AREAS IS 1000                                        013300      
000165             AREASIZE IS 9000                                     013400      
000166    BLOCK CONTAINS            30 RECORDS.                         013500      
000167                                                                  013600      
000168 01 REG-CVES151DIF.                                               013700      
000169    02 R01-LLAVE-REGS151.                                         013800      
000170       03 R01-S151-CONTRATO       PIC 9(16) COMP.                 013900      
000171       03 R01-S151-LIBRO          PIC 9(02) COMP.                 014000      
000172       03 R01-S151-MONEDA         PIC 9(04) COMP.                 014100      
000173       03 R01-S151-CVETRA         PIC 9(04) COMP.                 014200      
000174       03 R01-S151-TM             PIC 9(04) COMP.                 014300      
000175       03 R01-S151-IMPORTE        PIC 9(14)V99 COMP.              014400      
000176       03 R01-S151-AUTS151        PIC 9(08) COMP.                 014500      
000177    02 R01-S151-SUCINI         PIC 9(04) COMP.                    014600      
000178    02 R01-S151-CAJAINI        PIC 9(04) COMP.                    014700      
000179    02 R01-S151-PRODUCTO       PIC 9(04) COMP.                    014800      
000180    02 R01-S151-INST           PIC 9(04) COMP.                    014900      
000181    02 R01-S151-AUTAPL         PIC 9(08) COMP.                    015000      
000182    02 FILLER                  PIC X(03).                         015100      
000183                                                                  015200      
000184 SD SCVEDIF.                                                      015300      
000185*============                                                     015400      
000186 01 SREG-CVETRAN.                                                 015500      
000187    02 S02-LLAVE-REGSNNN.                                         015600      
000188       03 S02-PUN-CONTRATO       PIC 9(16) COMP.                  015700      
000189       03 S02-PUN-LIBRO          PIC 9(02) COMP.                  015800      
000190       03 S02-PUN-MONEDA         PIC 9(04) COMP.                  015900      
000191       03 S02-PUN-CVETRA         PIC 9(04) COMP.                  016000      
000192       03 S02-PUN-TM             PIC 9(04) COMP.                  016100      
000193       03 S02-PUN-IMPORTE        PIC 9(14)V99 COMP.               016200      
000194       03 S02-PUN-AUTS151        PIC 9(08) COMP.                  016300      
000195    02 S02-PUN-SUCINI         PIC 9(04) COMP.                     016400      
000196    02 S02-PUN-CAJAINI        PIC 9(04) COMP.                     016500      
000197    02 S02-PUN-PRODUCTO       PIC 9(04) COMP.                     016600      
000198    02 S02-PUN-INST           PIC 9(04) COMP.                     016700      
000199    02 S02-PUN-AUTAPL         PIC 9(08) COMP.                     016800      
000200    02 FILLER                 PIC X(03).                          016900      
000201                                                                  017000      
000202 FD TOTCVETRAN                                                    017100      
000203*=============                                                    017200      
000204    VALUE OF TITLE IS WKS-TIT-TOTCVES                             017300      
000205    BLOCK CONTAINS        9 RECORDS.                              017400      
000206                                                                  017500      
000207 01 REG-TOTCVETRAN                        PIC X(80).              017600      
000208                                                                  017700      
000209 FD DETCVETRAN                                                    017800      
000210*=============                                                    017900      
000211    VALUE OF TITLE IS WKS-TIT-DETCVES                             018000      
000212    BLOCK CONTAINS        10 RECORDS.                             018100      
000213                                                                  018200      
000214 01 REG-DETCVETRAN                        PIC X(90).              018300      
000215                                                                  018400      
000216 FD V00-REP-CVES.                                                 018500      
000217*================                                                 018600      
000218 01 V00-R00-CVES                          PIC X(132).             018700      
000219                                                                  018800      
000220 FD V00-REP-DETCVES.                                              018900      
000221*===================                                              019000      
000222 01 V00-R00-DETCVES                       PIC X(132).             019100      
000223                                                                  019200      
000224*                                                                 019300      
000225 WORKING-STORAGE SECTION.                                         019400      
000226                                                                  019500      
000227*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000228* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         019600      
000229*================================================================ 000100      
000230*         ENTRY-POINT CONSISDIA :                               = 000200      
000231*                                                                 000300      
000232* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000233* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000234* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000235* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000236* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000237* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000238* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000239* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000240* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000241* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000242*                                                               = 001400      
000243*================================================================ 001500      
000244                                                                  001600      
000245                                                                  001700      
000246*================================================================ 001800      
000247* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000248*                                                               = 002000      
000249* ENTRADA REQUERIDA :                                           = 002100      
000250*                                                               = 002200      
000251*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000252*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000253*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000254*================================================================ 002600      
000255 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000256    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000257    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000258    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000259    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000260    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000261    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000262    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000263    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000264    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000265    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000266    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000267    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000268    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000269    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000270    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000271    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000272    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000273    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000274    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000275    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000276       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000277       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000278       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000279       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000280*==============================================================   005200      
000281*                                                             =   005300      
000282* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000283*                                                             =   005500      
000284* CAMPOS REQUERIDOS :                                         =   005600      
000285*                                                             =   005700      
000286* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000287* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000288* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000289* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000290*==============================================================   006200      
000291 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000292    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000293    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000294    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000295    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000296                                                                  006800      
000297*==============================================================   006900      
000298*                                                             =   007000      
000299* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000300*                                                             =   007200      
000301* CAMPOS REQUERIDOS :                                         =   007300      
000302*                                                             =   007400      
000303* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000304* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000305* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000306* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000307*==============================================================   007900      
000308 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000309    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000310    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000311    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000312    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000313                                                                  008500      
000314*==============================================================   008600      
000315*                                                             =   008700      
000316* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000317*                                                             =   008900      
000318* CAMPOS REQUERIDOS :                                         =   009000      
000319*                                                             =   009100      
000320* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000321* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000322* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000323* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000324*==============================================================   009600      
000325 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000326    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000327    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000328    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000329    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000330                                                                  010200      
000331*============================================================     010300      
000332* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000333*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000334*                                                           =     010600      
000335*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000336*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000337*                                                           =     010900      
000338*  ENTRADA REQUERIDA.                                       =     011000      
000339*                                                           =     011100      
000340*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000341*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000342*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000343*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000344*============================================================     011600      
000345                                                                  011700      
000346 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000347     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000348     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000349     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000350     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000351                                                                  012300      
000352*=============================================================    012400      
000353*                                                            =    012500      
000354* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000355*             B01-SIS-FECARMOV.                              =    012700      
000356*                                                            =    012800      
000357* ENTRADA REQUERIDAD :                                       =    012900      
000358*                                                            =    013000      
000359*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000360*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000361*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000362*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000363*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000364*=============================================================    013600      
000365                                                                  013700      
000366 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000367     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000368     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000369     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000370     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000371     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000372*================================================================ 014400      
000373*                                                               = 014500      
000374* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000375*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000376*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000377*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000378*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000379*                                                               = 015100      
000380* ENTRADA REQUERIDA :                                           = 015200      
000381*                                                               = 015300      
000382* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000383* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000384* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000385* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000386* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000387*================================================================ 015900      
000388 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000389    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000390    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000391    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000392    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000393    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000394                                                                  016600      
000395*============================================================     016700      
000396*                                                           =     016800      
000397* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000398*                                                           =     017000      
000399* DATOS REQUERIDOS :                                        =     017100      
000400*                                                           =     017200      
000401* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000402* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000403* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000404* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000405* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000406*============================================================     017800      
000407                                                                  017900      
000408 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000409     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000410     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000411     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000412     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000413     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000414                                                                  018600      
000415*============================================================     018700      
000416*                                                           =     018800      
000417* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000418*                                                           =     019000      
000419* DATOS REQUERIDOS :                                        =     019100      
000420*                                                           =     019200      
000421* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000422* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000423* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000424* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000425* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000426*============================================================     019800      
000427                                                                  019900      
000428 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000429     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000430     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000431     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000432     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000433     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000434                                                                  020600      
000435*===============================================================  020700      
000436*                                                              =  020800      
000437* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000438*              MOVIMIENTOS.                                    =  021000      
000439* DATOS REQUERIDOS :                                           =  021100      
000440*                                                              =  021200      
000441* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000442* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000443* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000444* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000445* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000446* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000447*==============================================================   021900      
000448                                                                  022000      
000449 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000450     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000451     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000452     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000453     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000454     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000455     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000456*==============================================================   022800      
000457*                                                             =   022900      
000458* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000459*                                                             =   023100      
000460* CAMPOS REQUERIDOS :                                         =   023200      
000461*                                                             =   023300      
000462* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000463* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000464* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000465* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000466*==============================================================   023800      
000467 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000468    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000469    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000470    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000471    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000472                                                                  024304      
000473*=================================================================024306      
000474*                ENTRY POINT CONSISB01                           =024308      
000475*                                                                =024310      
000476*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000477*                                                                =024314      
000478*  FUNCIONES DISPONIBLES :                                       =024316      
000479*                                                                =024318      
000480*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000481*                                                                =024322      
000482*  PARAMETROS REQUERIDOS                                         =024324      
000483*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000484*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000485*=================================================================024330      
000486                                                                  024332      
000487 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000488     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000489     03 WKS-CON-CSI                PIC 9(02).                     024336      
000490     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000491     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000492        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000493        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000494        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000495        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000496        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000497                                                                  024400      
000498*=================================================================024500      
000499*                ENTRY POINT B02ARCINTER                         =024600      
000500*                                                                =024700      
000501*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000502*                                                                =024900      
000503*  FUNCIONES DISPONIBLES :                                       =025000      
000504*                                                                =025100      
000505*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000506* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000507* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000508* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000509*                                                                =025600      
000510*  PARAMETROS REQUERIDOS                                         =025700      
000511*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000512*                                                                =025900      
000513*=================================================================026000      
000514 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000515     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000516     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000517     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000518     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000519     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000520     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000521     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000522     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000523     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000524     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000525     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000526     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000527     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000528     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000529     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000530     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000531     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000532     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000533     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000534     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000535     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000536     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000537     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000538     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000539     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000540     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000541     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000542     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000543                                                                  029000      
000544*=================================================================029100      
000545*                ENTRY POINT B04SISTEMA                          =029200      
000546*                                                                =029300      
000547*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000548*                                                                =029500      
000549*  FUNCIONES DISPONIBLES :                                       =029600      
000550*                                                                =029700      
000551*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000552*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000553*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000554*                                                                =030100      
000555*  PARAMETROS REQUERIDOS                                         =030200      
000556*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000557*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000558*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000559*                                                                =030600      
000560*=================================================================030700      
000561 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000562     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000563     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000564     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000565     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000566     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000567     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000568     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000569                                                                  031600      
000570*================================================================ 031700      
000571*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000572*                                                               = 031900      
000573*  FUNCION                                                      = 032000      
000574*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000575*   19       ALTAS.                                             = 032200      
000576*   22       BAJAS                                              = 032300      
000577*   37       CAMBIOS.                                           = 032400      
000578*                                                               = 032500      
000579*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000580*                      FECHA DE PROCESO                         = 032700      
000581*                      NUMERO DE PROCESO                        = 032800      
000582*                      FECHA INICIO                             = 032900      
000583*                      REGISTRO INICIAL                         = 033000      
000584*================================================================ 033100      
000585                                                                  033200      
000586 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000587     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000588     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000589     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000590     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000591     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000592     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000593     03 WKS-B05-MIX                PIC 9(08).                     034000      
000594     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000595     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000596     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000597     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000598     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000599     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000600                                                                  034700      
000601                                                                  034800      
000602*================================================================ 034900      
000603*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000604*                                                               = 035100      
000605*  FUNCION                                                      = 035200      
000606*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000607*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000608*                                                               = 035500      
000609*================================================================ 035600      
000610                                                                  035700      
000611 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000612     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000613     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000614     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000615     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000616     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000617     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000618                                                                  036500      
000619*===============================================================  036600      
000620*                                                              =  036700      
000621*         ENTRY-POINT CONSISMEN                                =  036800      
000622*                                                              =  036900      
000623*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000624*                      SISTEMA                                 =  037100      
000625*                                                              =  037200      
000626*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000627*                                                              =  037400      
000628*===============================================================  037500      
000629 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000630     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000631     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000632     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000633     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000634     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000635     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000636     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000637     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000638     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000639     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000640     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000641     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000642     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000643     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000644     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000645        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000646        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000647        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000648        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000649        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000650        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000651        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000652                                                                  039900      
000653*=====================================================            040000      
000654*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000655*=====================================================            040200      
000656 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000657     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000658     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000659     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000660                                                                  040700      
000661*=====================================================            040800      
000662*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000663*=====================================================            041000      
000664 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000665     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000666     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000667     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000668                                                                  041500      
000669*=====================================================            041600      
000670*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000671*=====================================================            041800      
000672 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000673     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000674     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000675     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000676*=====================================================            042300      
000677*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000678*=====================================================            042500      
000679 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000680     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000681     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000682     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000683                                                                  043000      
000684*=====================================================            043100      
000685*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000686*=====================================================            043300      
000687 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000688     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000689     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000690     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000691                                                                  043800      
000692*=====================================================            043900      
000693*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000694*=====================================================            044100      
000695 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000696     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000697     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000698     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000699                                                                  044600      
000700*=====================================================            044700      
000701*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000702*=====================================================            044900      
000703 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000704     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000705     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000706     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000707                                                                  045400      
000708*=====================================================            045500      
000709*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000710*=====================================================            045700      
000711 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000712     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000713     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000714     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000715                                                                  046200      
000716*=====================================================            046300      
000717*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000718*=====================================================            046500      
000719 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000720     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000721     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000722     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000723                                                                  047000      
000724*=====================================================            047100      
000725*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000726*=====================================================            047300      
000727 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000728     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000729     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000730     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000731                                                                  047800      
000732*=====================================================            047900      
000733*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000734*=====================================================            048100      
000735 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000736     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000737     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000738     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000739                                                                  048600      
000740*=====================================================            048700      
000741*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000742*=====================================================            048900      
000743 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000744     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000745     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000746     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000747                                                                  049400      
000748*=====================================================            049500      
000749*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000750*=====================================================            049700      
000751 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000752     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000753     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000754     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000755     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000756     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000757     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000758     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000759     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000760     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000761     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000762                                                                  050900      
000763*=====================================================            051000      
000764*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000765*=====================================================            051200      
000766 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000767     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000768     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000769     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000770     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000771                                                                  051800      
000772*=====================================================            051900      
000773*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000774*=====================================================            052100      
000775 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000776     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000777     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000778     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000779     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000780                                                                  052700      
000781*=====================================================            052800      
000782*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000783*=====================================================            053000      
000784 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000785     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000786     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000787     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000788     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
000789                                                                  053600      
000790*=====================================================            053700      
000791*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
000792*=====================================================            053900      
000793 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
000794     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
000795     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
000796     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
000797     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
000798                                                                  054500      
000799*=====================================================            054600      
000800*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
000801*=====================================================            054800      
000802 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
000803     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
000804     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
000805     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
000806     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
000807                                                                  055400      
000808*=====================================================            055500      
000809*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
000810*=====================================================            055700      
000811 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
000812     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
000813     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
000814     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
000815     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
000816                                                                  056300      
000817*=====================================================            056400      
000818*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
000819*=====================================================            056600      
000820 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
000821     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
000822     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
000823     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
000824     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
000825                                                                  057200      
000826 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
000827*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000828*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000829* COPY "(S151)S151/FORMATO/ARCHIVO/PUNTEO ON CMEMP.".             019700      
000830*=================================================================000100      
000831*== NOMBRE DEL ARCHIVO                                          ==000200      
000832*==       SNNN/FILE/E01/CO/CD/S151/PUNTEO#/AAAAMMDD             ==000300      
000833*=================================================================000400      
000834*==       REGISTRO DEL ARCHIVO PARA PUNTEO CON LOS SNNN         ==000500      
000835*=================================================================000600      
000836 01 A00-R00-HDR-PUNTEO.                                           000700      
000837    02 A00-R00-PUN-CVEREG         PIC 9(02) COMP.                 000800      
000838    02 A00-R00-PUN-SIST           PIC 9(04) COMP.                 001000      
000839    02 A00-R00-PUN-FECPRO         PIC 9(08) COMP.                 001100      
000840    02 FILLER                     PIC X(41).                      001200      
000841*                                                                 001300      
000842 01 A00-R01-PUN-DETALLE.                                          001400      
000843    02 A00-R01-PUN-CVEREG         PIC 9(02) COMP.                 001420      
000844    02 A00-R01-PUN-LIBRO          PIC 9(02) COMP.                 001450      
000845**L3 13JUL                                                        001460      
000846    02 A00-R01-PUN-ORIG-264 REDEFINES A00-R01-PUN-LIBRO           001470      
000847                                  PIC 9(02) COMP.                 001480      
000848    02 A00-R01-PUN-CONTRATO       PIC 9(16) COMP.                 001500      
000849    02 A00-R01-PUN-SUC-264 REDEFINES A00-R01-PUN-CONTRATO.        001510      
000850        03 A00-R01-PUN-SUCTRAN    PIC 9(04) COMP.                 001520      
000851        03 A00-R01-PUN-SUCOPE     PIC 9(04) COMP.                 001530      
000852        03 A00-R01-PUN-PROM       PIC 9(04) COMP.                 001540      
000853        03 A00-R01-PUN-HHMM       PIC 9(04) COMP.                 001550      
000854**L3                                                              001560      
000855    02 A00-R01-PUN-MONEDA         PIC 9(04) COMP.                 001600      
000856    02 A00-R01-PUN-CVETRA         PIC 9(04) COMP.                 001700      
000857    02 A00-R01-PUN-TM             PIC 9(04) COMP.                 001800      
000858*L3 21 SEP                                                        001810      
000859    02 A00-R01-PUN-TM-R REDEFINES A00-R01-PUN-TM.                 001820      
000860        03 A00-R01-PUN-IND-S028   PIC 9(02) COMP.                 001830      
000861        03 A00-R01-PUN-IND-S250   PIC 9(01) COMP.                 001840      
000862        03 A00-R01-PUN-NAT-S250   PIC 9(01) COMP.                 001845      
000863*L3                                                               001850      
000864    02 A00-R01-PUN-IMPORTE        PIC 9(14)V99 COMP.              001900      
000865    02 A00-R01-PUN-AUTS151        PIC 9(08) COMP.                 002000      
000866    02 A00-R01-PUN-AUTAPL         PIC 9(08) COMP.                 002100      
000867    02 A00-R01-PUN-SUCINI         PIC 9(04) COMP.                 002200      
000868    02 A00-R01-PUN-CAJAINI        PIC 9(02) COMP.                 002300      
000869    02 A00-R01-PUN-PRODUCTO       PIC 9(04) COMP.                 002400      
000870    02 A00-R01-PUN-INST           PIC 9(04) COMP.                 002500      
000871    02 A00-R01-PUN-FILXAPLIC      PIC X(09).                      002600      
000872    02 A00-R01-PUN-REDS404 REDEFINES A00-R01-PUN-FILXAPLIC.       002700      
000873       05 A00-R01-PUN-FOLIO       PIC 9(04) COMP.                 002800      
000874       05 A00-R01-PUN-CONCEPTO    PIC 9(04) COMP.                 002900      
000875       05 A00-R01-PUN-MOVI        PIC 9(04) COMP.                 003000      
000876       05 FILLER                  PIC X(03).                      003100      
000877    02 A00-R01-PUN-REDS501 REDEFINES A00-R01-PUN-FILXAPLIC.       003102      
000878       05 A00-R01-PUN-CAJA-501    PIC 9(04) COMP.                 003104      
000879       05 FILLER                  PIC X(07).                      003106      
000880**L3 21MAY                                                        003120      
000881    02 A00-R01-PUN-REDS264 REDEFINES A00-R01-PUN-FILXAPLIC.       003140      
000882       05 A00-R01-REFS264         PIC 9(18) COMP.                 003160      
000883**L3                                                              003180      
000884 01 A00-R02-TR-PUNTEO.                                            003200      
000885    02 A00-R02-PUN-CVEREG         PIC 9(02) COMP.                 003300      
000886    02 A00-R02-PUN-TOTREG         PIC 9(08) COMP.                 003400      
000887    02 FILLER                     PIC X(43).                      003500      
000888*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000889*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000890* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           019800      
000891**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000892  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000893  01 MENSAJE-LJ.                                                  100300      
000894     02 SISTEMA-LJ     PIC X(04).                                 100400      
000895     02 FILLER         PIC X VALUE "/".                           100500      
000896     02 PASO-LJ        PIC X(04).                                 100600      
000897     02 FILLER         PIC X VALUE "/".                           100700      
000898     02 MTP-LJ         PIC 9(03).                                 100800      
000899     02 FILLER         PIC X VALUE ":".                           100900      
000900     02 TIPO-LJ        PIC X.                                     101000      
000901     02 FILLER         PIC X VALUE ">".                           101100      
000902     02 CODIGO-LJ      PIC 9(06).                                 101200      
000903     02 FILLER         PIC X VALUE "<".                           101300      
000904     02 TEXTO-LJ       PIC X(250).                                101400      
000905*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000906*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000907* COPY "S151/CRONOS2K/CPY/WS".                                    019801      
000908******************************************************************000100      
000909** This copyBook defines all the additional variables that      **000200      
000910** Unisys has defined for the CRONOS2K project                  **000300      
000911** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000912******************************************************************000500      
000913                                                                  000600      
000914******************************************************************000700      
000915** These Variables are used to Accept the system date in long   **000800      
000916** format and get the century information                       **000900      
000917** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000918 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000919 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000920    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000921    05 FILLER      PIC X(1).                                      001400      
000922    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000923    05 FILLER      PIC X(1).                                      001600      
000924    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000925    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000926      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000927      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000928******************************************************************002100      
000929                                                                  002200      
000930******************************************************************002300      
000931** This variable defines a date in the format MMDDCCAA          **002400      
000932**                                                              **002500      
000933 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000934 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000935    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000936    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000937    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000938    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000939      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000940      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000941******************************************************************003400      
000942                                                                  003500      
000943******************************************************************003600      
000944** This variable defines a date in the format CCAAMMDD          **003700      
000945**                                                              **003800      
000946 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000947 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000948    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000949    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000950      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000951      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000952    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000953    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000954******************************************************************004700      
000955                                                                  004800      
000956******************************************************************004900      
000957** This variable defines a date in the format DDMMCCAA          **005000      
000958**                                                              **005100      
000959 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000960 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000961    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000962    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000963    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000964    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000965      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000966      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000967******************************************************************006000      
000968                                                                  006100      
000969******************************************************************006200      
000970** This variable defines a date in the Julian Format CCAADDD    **006300      
000971**                                                              **006400      
000972 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000973 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000974    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000975    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000976                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000977      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000978      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000979    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000980******************************************************************007300      
000981                                                                  007400      
000982******************************************************************007500      
000983** This variable defines a date in the format AAMMDD            **007600      
000984**                                                              **007700      
000985 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000986 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000987    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000988    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000989    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000990******************************************************************008300      
000991                                                                  008400      
000992******************************************************************008500      
000993** This variable defines a date in the format MMDDAA            **008600      
000994**                                                              **008700      
000995 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000996 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000997    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000998    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000999    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
001000******************************************************************009300      
001001                                                                  009400      
001002******************************************************************009500      
001003** This variable defines a date in the format DDMMAA            **009600      
001004**                                                              **009700      
001005 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
001006 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
001007    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
001008    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
001009    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
001010******************************************************************010300      
001011                                                                  010400      
001012******************************************************************010500      
001013** These variables are defined to be used for CALL bridge logic **010600      
001014**                                                              **010700      
001015 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
001016 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
001017 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
001018 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
001019 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
001020 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
001021******************************************************************011400      
001022                                                                  011500      
001023******************************************************************011600      
001024** This variable is used for converting only a year field AA to **011700      
001025** CCAA and a CCAA to AA                                        **011800      
001026 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
001027 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
001028    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
001029    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
001030 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
001031 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
001032******************************************************************012300      
001033                                                                  012400      
001034******************************************************************012500      
001035** These variables are Bridge Variables for Intercambio files   **012600      
001036** para EDOCTA                                                  **012700      
001037 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
001038 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
001039 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
001040 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
001041 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
001042 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
001043 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
001044******************************************************************013500      
001045* Para MODULO                                                     013600      
001046 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
001047******************************************************************013800      
001048******************************************************************013900      
001049** Para FMOVSCHABO                                                014000      
001050 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
001051******************************************************************014200      
001052                                                                  014300      
001053******************************************************************014400      
001054***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
001055******************************************************************014600      
001056                                                                  014700      
001057 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
001058 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
001059     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
001060     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
001061     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
001062******************************************************************015300      
001063                                                                  015400      
001064******************************************************************015500      
001065***  These Variables Are Defined For Date In AAMM Format       ***015600      
001066******************************************************************015700      
001067                                                                  015800      
001068 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
001069 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
001070     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
001071     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
001072******************************************************************016300      
001073                                                                  016400      
001074                                                                  016500      
001075*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001076*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001077* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP002 ON CMEMP."         019805      
001078*                                    FROM 000100 TO 099999      . 019806      
001079                                                                  000100      
001080*----------------------------------------------------------------*000200      
001081*     VARIABLES PARA EL CALCULO DINAMICO DE ESPACIO PARA SORT    *000300      
001082*----------------------------------------------------------------*000400      
001083 77  W77-FRAMESIZE                PIC  9(002) COMP.               000500      
001084 77  W77-LASTRECORD               PIC  9(012) COMP.               000600      
001085 77  W77-MAXRECSIZE               PIC  9(012) COMP.               000700      
001086 77  W77-DISK-SIZE                PIC  9(018) COMP.               000800      
001087 77  W77-MEMORY-SIZE              PIC  9(018) COMP.               000900      
001088 77  W77-MEMORY-65K               PIC  9(018) COMP.               001000      
001089 01  WS-CALC-WORD                 PIC  9(012)V99.                 001100      
001090 01  WS-CALC-WORD-RED   REDEFINES WS-CALC-WORD.                   001200      
001091     02 WS-WORD-ENT               PIC  9(012).                    001300      
001092     02 WS-WORD-RES               PIC  9(002).                    001400      
001093                                                                  001500      
001094*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001095 01 WKS-CLAVES.                                                   019810      
001096    03 WKS-CVE-LEYENDA              PIC 9(04) OCCURS 10000 TIMES. 019815      
001097 01 WKS-CLAVES-MC.                                                019820      
001098    03 WKS-OCC-TIPO                 OCCURS 2    TIMES.            019825      
001099       05 WKS-OCC-LEY               OCCURS 10000 TIMES.           019830      
001100          07 WKS-CVE-LEY-MC         PIC 9(04) COMP.               019835      
001101                                                                  019840      
001102******************************************************************019850      
001103*                LEYENDAS DE LAS TRANSACCIONES                   *019852      
001104******************************************************************019854      
001105                                                                  019856      
001106  01 WKS-TABLA-LEYENDAS-TRANS1.                                   019858      
001107     02 WKS-T-LEYENDAS-TRANS1 OCCURS 3000 TIMES.                  019860      
001108        04 WS-LEY-TRAN1               PIC X(20).                  019862      
001109                                                                  019864      
001110  01 WKS-TABLA-LEYENDAS-TRANS2.                                   019866      
001111     02 WKS-T-LEYENDAS-TRANS2 OCCURS 3000 TIMES.                  019868      
001112        04 WS-LEY-TRAN2               PIC X(20).                  019870      
001113                                                                  019872      
001114  01 WKS-TABLA-LEYENDAS-TRANS3.                                   019874      
001115     02 WKS-T-LEYENDAS-TRANS3 OCCURS 3000 TIMES.                  019900      
001116        04 WS-LEY-TRAN3               PIC X(20).                  019902      
001117                                                                  019904      
001118  01 WKS-TABLA-LEYENDAS-TRANS4.                                   019905      
001119     02 WKS-T-LEYENDAS-TRANS4 OCCURS 1000 TIMES.                  019906      
001120        04 WS-LEY-TRAN4               PIC X(20).                  019907      
001121                                                                  019908      
001122                                                                  019909      
001123                                                                  019910      
001124 77 W77-TM                          PIC 9(02).                    019912      
001125*===============================================                  019914      
001126*       PARAMETROS LIBRERIA DE ESTRUCTURA      =                  019916      
001127*===============================================                  019918      
001128 77  W77-L710-SISTEMA              PIC S9(11) BINARY.             019920      
001129 77  W77-L710-PROGRAMA             PIC S9(11) BINARY.             019922      
001130 01  WKS-L710-ENT.                                                019924      
001131     03 WKS-EL710-CAT              PIC 9(06) COMP.                019926      
001132     03 WKS-EL710-CLAVE            PIC 9(02) COMP.                019928      
001133     03 WKS-EL710-BUSQUEDA         PIC 9(02) COMP.                019930      
001134     03 WKS-EL710-REGISTROS        PIC 9(02) COMP.                019932      
001135     03 WKS-EL710-LLAVE1           PIC 9(12).                     019934      
001136     03 WKS-EL710-LLAVE2           PIC 9(12).                     019936      
001137     03 WKS-EL710-LLAVE3           PIC 9(12).                     019938      
001138     03 WKS-EL710-LLAVE4           PIC 9(12).                     019940      
001139     03 WKS-EL710-LLAVE5           PIC 9(12).                     019942      
001140     03 WKS-EL710-LLAVE6           PIC 9(12).                     019944      
001141     03 WKS-EL710-FEC-VIG          PIC 9(06) COMP.                019946      
001142     03 WKS-EL710-FECINI           PIC 9(06) COMP.                019948      
001143     03 WKS-EL710-NIVINI           PIC 9(02) COMP.                019950      
001144     03 FILLER                     PIC X(11).                     019952      
001145 01  WKS-L710-SAL.                                                019954      
001146     03 WKS-SL710-NUMREG           PIC 9(02) COMP.                019956      
001147     03 WKS-SL710-CAT              PIC 9(06) COMP.                019958      
001148     03 WKS-SL710-FECINI           PIC 9(06) COMP.                019960      
001149     03 WKS-SL710-NIVINI           PIC 9(02) COMP.                019962      
001150     03 FILLER                     PIC X(22).                     019964      
001151     03 WKS-SL710-REG.                                            019966      
001152        05 WKS-SL710-DAT           PIC 9(12) OCCURS 28 TIMES.     019968      
001153        05 WKS-SL710-FECALTA       PIC 9(06) COMP.                019970      
001154        05 WKS-SL710-FECBAJA       PIC 9(06) COMP.                019972      
001155        05 WKS-SL710-FECMOD        PIC 9(06) COMP.                019974      
001156        05 FILLER                  PIC X(42).                     019976      
001157 77  W77-L710-RESULT               PIC S9(11) BINARY.             019978      
001158 77  W77-CVE                       PIC 9(04).                     019980      
001159 77  W77-L700-SISTEMA              PIC S9(11) BINARY.             019982      
001160 77  W77-L700-PROGRAMA             PIC S9(11) BINARY.             019984      
001161 01  WKS-L700-ENT.                                                019986      
001162     03 WKS-EL700-CAT              PIC 9(06) COMP.                019988      
001163     03 WKS-EL700-CLAVE            PIC 9(02) COMP.                019990      
001164     03 WKS-EL700-BUSQUEDA         PIC 9(02) COMP.                019992      
001165     03 WKS-EL700-REGISTROS        PIC 9(02) COMP.                019994      
001166     03 WKS-EL700-CVEREG           PIC 9(12).                     019996      
001167     03 WKS-EL700-REGASO           PIC 9(12).                     019998      
001168     03 WKS-EL700-NIVINI           PIC 9(02) COMP.                020000      
001169     03 WKS-EL700-FECINI           PIC 9(06) COMP.                020004      
001170     03 FILLER                     PIC X(14).                     020006      
001171 01  WKS-L700-SAL.                                                020008      
001172     03 WKS-SL700-NUMREG           PIC 9(02) COMP.                020010      
001173     03 WKS-SL700-CAT              PIC 9(06) COMP.                020012      
001174     03 WKS-SL700-FECINI           PIC 9(06) COMP.                020014      
001175     03 WKS-SL700-NIVINI           PIC 9(02) COMP.                020016      
001176     03 WKS-SL700-SAL-REGISTROS.                                  020018      
001177        05 WKS-SL700-CVEREG        PIC 9(12).                     020020      
001178        05 WKS-SL700-REGASO        PIC 9(12).                     020022      
001179        05 WKS-SL700-TLARGO        PIC X(40).                     020024      
001180        05 WKS-SL700-TCORTO        PIC X(20).                     020026      
001181        05 WKS-SL700-TPANT         PIC X(12).                     020028      
001182        05 WKS-SL700-TABREV        PIC X(05).                     020030      
001183        05 WKS-SL700-FECALTA       PIC 9(06) COMP.                020032      
001184        05 WKS-SL700-FECBAJA       PIC 9(06) COMP.                020034      
001185        05 WKS-SL700-FECMOD        PIC 9(06) COMP.                020036      
001186        05 FILLER                  PIC X(10).                     020038      
001187 77  W77-L700-RESULT               PIC S9(11) BINARY.             020040      
001188                                                                  020042      
001189 77  W77-CAT-FORMATO               PIC 9(02).                     020044      
001190 77  W77-CAT-NUMCAT                PIC 9(06).                     020046      
001191 77  W77-ERROR                     PIC 9(02).                     020048      
001192 01  A2K-BASE-YEAR                 PIC 9(02) VALUE 50.            020050      
001193 77  W77-LAST-RECORD               PIC 9(08).                     020052      
001194 77  W77-TOTREG-PUNTEO             PIC 9(08).                     020054      
001195***************************************************************   020100      
001196*          LIBRERIA CTLVERS       ( S006)                     *   020200      
001197***************************************************************   020300      
001198 01  WKS-CTLVERS-LIBRERIA            PIC X(12).                   020400      
001199 01  WKS-CTLVERS-TITULO              PIC X(72).                   020500      
001200 01  WKS-CTLVERS-STATUS              PIC S9(11) BINARY.           020600      
001201                                                                  020700      
001202 01  WKS-CTLVERS-NUMREG              PIC 9(02).                   020800      
001203 01  WKS-CTLVERS-LIBID               PIC X(12).                   020900      
001204 01  WKS-CTLVERS-LIBID-R REDEFINES WKS-CTLVERS-LIBID.             021000      
001205     03 WKS-LIBID-NOMB               PIC X(09).                   021100      
001206     03 WKS-LIBID-SIST               PIC X(03).                   021200      
001207***************************************************************   021300      
001208*          LIBRERIA SOPORTECOMS                               *   021400      
001209***************************************************************   021500      
001210 01  WKS-DATOSHOST.                                               021600      
001211     02 WKS-DH-NUMCSI                PIC 9(02).                   021700      
001212     02 WKS-DH-NOMEQUIPO             PIC X(10).                   021800      
001213     02 WKS-DH-NOMCSI                PIC X(26).                   021900      
001214     02 WKS-DH-LINEABATCH            PIC X(05).                   022000      
001215                                                                  022100      
001216******************************************************************022200      
001217*            NOMBRE DE LOS ARCHIVOS                              *022300      
001218******************************************************************022400      
001219  01 WKS-TIT-CVES.                                                022500      
001220     03 WKS-PLATAFORMA-1       PIC X(01).                         022600      
001221     03 WKS-CVE-SISTEMA        PIC 9(03) VALUE 0.                 022700      
001222     03 FILLER                 PIC X(10) VALUE "/FILE/E01/".      022800      
001223     03 WKS-CVE-CSIO           PIC 9(02) VALUE 0.                 022900      
001224     03 FILLER                 PIC X(01) VALUE "/".               023000      
001225     03 WKS-CVE-CSID           PIC 9(02) VALUE 0.                 023100      
001226     03 FILLER                 PIC X(12) VALUE "/S151/PUNTEO".    023200      
001227     03 WKS-CVE-NUMARCH        PIC 9(01) VALUE 0.                 023300      
001228     03 FILLER                 PIC X(01) VALUE "/".               023400      
001229     03 WKS-CVE-FECHA          PIC 9(08).                         023500      
001230     03 FILLER                 PIC X(01) VALUE ".".               023600      
001231                                                                  023700      
001232  01 WKS-TIT-CVES151.                                             023800      
001233     03 WKS-PLATAFORMA-2       PIC X(01).                         023900      
001234     03 WKS-CVE-SISTEMA2       PIC 9(03) VALUE 0.                 024000      
001235     03 FILLER                 PIC X(10) VALUE "/FILE/E01/".      024100      
001236     03 WKS-CVE-CSIO2          PIC 9(02) VALUE 0.                 024200      
001237     03 FILLER                 PIC X(01) VALUE "/".               024300      
001238     03 WKS-CVE-CSID2          PIC 9(02) VALUE 0.                 024400      
001239     03 FILLER                 PIC X(12) VALUE "/S151/PUNTEO".    024500      
001240     03 WKS-CVE-NUMARCH2       PIC 9(01) VALUE 0.                 024600      
001241     03 FILLER                 PIC X(01) VALUE "/".               024700      
001242     03 WKS-CVE-FECHA2         PIC 9(08).                         024800      
001243     03 FILLER                 PIC X(01) VALUE ".".               024900      
001244                                                                  025000      
001245 01 WKS-TIT-TOTCVES.                                              025100      
001246     02  FILLER                    PIC X(17) VALUE                025200      
001247                                   "(S151)S151/FILE/S".           025300      
001248     02  WKS-TCVE-SISTEMA          PIC 9(03).                     025400      
001249     02  FILLER                    PIC X(01) VALUE "/".           025500      
001250     02  WKS-TCVE-CSI              PIC 9(02).                     025600      
001251     02  FILLER                    PIC X(16) VALUE                025700      
001252                                   "/REPORTE/CLAVES/".            025800      
001253     02  WKS-TCVE-FECHA            PIC 9(08).                     025900      
001254     02  FILLER                    PIC X(10) VALUE " ON CMEMP.".  026000      
001255                                                                  026100      
001256 01 WKS-TIT-DETCVES.                                              026200      
001257     02  FILLER                    PIC X(17) VALUE                026300      
001258                                   "(S151)S151/FILE/S".           026400      
001259     02  WKS-DCVE-SISTEMA          PIC 9(03).                     026500      
001260     02  FILLER                    PIC X(01) VALUE "/".           026600      
001261     02  WKS-DCVE-CSI              PIC 9(02).                     026700      
001262     02  FILLER                    PIC X(17) VALUE                026800      
001263                                   "/REPORTE/DETALLE/".           026900      
001264     02  WKS-DCVE-FECHA            PIC 9(08).                     027000      
001265     02  FILLER                    PIC X(10) VALUE " ON CMEMP.".  027100      
001266                                                                  027200      
001267******************************************************************027300      
001268*                     NOMBRE DE LOS LISTADOS                     *027400      
001269******************************************************************027500      
001270                                                                  027600      
001271 01 WKS-TIT-LISTOTXCVE.                                           027700      
001272    02 FILLER                      PIC X(01) VALUE "S".           027800      
001273    02 WKS-SIS-TOTXCVE             PIC 9(03).                     027900      
001274    02 FILLER                      PIC X(11) VALUE "/LIST/P104/". 028000      
001275    02 WKS-CSI-TOTXCVE             PIC 9(02) VALUE 0.             028100      
001276    02 FILLER                      PIC X(03) VALUE "00/".         028200      
001277    02 WKS-REP-TOTXCVE             PIC X(01) VALUE SPACES.        028300      
001278    02 FILLER                      PIC X(04) VALUE "000/".        028400      
001279    02 WKS-FECHA-TOTXCVE           PIC 9(06).                     028500      
001280    02 FILLER                      PIC X(01) VALUE "/".           028600      
001281    02 WKS-MIX-TOTXCVE             PIC 9(07).                     028700      
001282    02 FILLER                      PIC X(01) VALUE "/".           028800      
001283    02 WKS-NOMB-REPORTE.                                          028900      
001284       04 WKS-NUM-BACK             PIC 9(03) VALUE 0.             029000      
001285       04 FILLER                   PIC X(04) VALUE "S151".        029100      
001286       04 WKS-NOMBRE-BACK          PIC X(10).                     029200      
001287    02 FILLER                      PIC X(01) VALUE ".".           029300      
001288                                                                  029400      
001289******************************************************************029500      
001290*                     CONTADOR DE HOJAS                          *029600      
001291******************************************************************029700      
001292 01 CONTADOR.                                                     029800      
001293    02 WKS-NUM-HOJAS                   PIC 9(6) COMP VALUE 0.     029900      
001294******************************************************************030000      
001295*            VARIABLES PARA EL CONTROL DE CORTES                 *030100      
001296******************************************************************030200      
001297                                                                  030300      
001298 77 W77-NODO-ANT                   PIC 9(04) COMP.                030400      
001299 77 W77-SUC-ANT                    PIC 9(04) COMP.                030500      
001300 77 W77-CAJA-ANT                   PIC 9(04) COMP.                030600      
001301                                                                  030700      
001302 01 WKS-LLAVES-ANT.                                               030800      
001303    02 WKS-LIBRO-ANT               PIC 9(02)    COMP.             030900      
001304    02 WKS-PROD-ANT                PIC 9(04)    COMP.             031000      
001305    02 WKS-INST-ANT                PIC 9(04)    COMP.             031100      
001306    02 WKS-MON-ANT                 PIC 9(04)    COMP.             031200      
001307    02 WKS-CVE-ANT                 PIC 9(04)    COMP.             031300      
001308    02 WKS-TM-ANT                  PIC 9(04)    COMP.             031400      
001309    02 WKS-CONTRATO-ANT            PIC 9(16)    COMP.             031500      
001310    02 WKS-IMPORTE-ANT             PIC 9(14)V99 COMP.             031600      
001311    02 WKS-AUTS151-ANT             PIC 9(08)    COMP.             031700      
001312                                                                  031800      
001313******************************************************************031900      
001314*                  CAMPOS DE FECHAS Y HORAS                      *032000      
001315******************************************************************032100      
001316                                                                  032200      
001317 01  WKS-FECHA-COMP                PIC 9(08).                     032300      
001318 01  WKS-FECHA-COMP-R              REDEFINES WKS-FECHA-COMP.      032400      
001319     02  WKS-FECHA-COMP-AA         PIC 9(04).                     032500      
001320     02  WKS-FECHA-COMP-MM         PIC 9(02).                     032600      
001321     02  WKS-FECHA-COMP-DD         PIC 9(02).                     032700      
001322                                                                  032800      
001323 01  WKS-HORA-COMP-HHMMSS          PIC 9(06).                     032900      
001324 01  WKS-HORA-COMP-HHMMSS-R REDEFINES WKS-HORA-COMP-HHMMSS.       033000      
001325     02  WKS-HORA-COMP-HH          PIC 9(02).                     033100      
001326     02  WKS-HORA-COMP-MM          PIC 9(02).                     033200      
001327     02  WKS-HORA-COMP-SS          PIC 9(02).                     033300      
001328                                                                  033400      
001329 01  WKS-HORA-COMPILACION.                                        033500      
001330     02  WKS-HORA-COMP             PIC 9(13).                     033600      
001331     02  FILLER                    PIC X(187).                    033700      
001332 01  WKS-FECHA-COMPILACION         PIC 9(08).                     033800      
001333                                                                  033900      
001334 01 WKS-FECHA-MAQ                  PIC 9(08).                     034000      
001335 01 WKS-FECHA-MAQ-R REDEFINES WKS-FECHA-MAQ.                      034100      
001336     03 WKS-FM-AMO                 PIC 9(4).                      034200      
001337     03 WKS-FM-MES                 PIC 9(2).                      034300      
001338     03 WKS-FM-DIA                 PIC 9(2).                      034400      
001339                                                                  034500      
001340 01 WKS-FECHA-PROCESO              PIC 9(08).                     034600      
001341 01 WKS-FECHA-PROCESO-R REDEFINES WKS-FECHA-PROCESO.              034700      
001342    03  WKS-FP-AMO                 PIC 9(4).                      034800      
001343    03  WKS-FP-MES                 PIC 9(2).                      034900      
001344    03  WKS-FP-DIA                 PIC 9(2).                      035000      
001345 01 WKS-FEC-PROCA6D REDEFINES WKS-FECHA-PROCESO.                  035100      
001346    03  WKS-FPRO-AA1               PIC 9(02).                     035200      
001347    03  WKS-FPROCESO-A6            PIC 9(06).                     035300      
001348                                                                  035330      
001349 01 WKS-FECHA-PRO151               PIC 9(08).                     035360      
001350                                                                  035400      
001351 01 WKS-FECHA-TEMP                 PIC 9(08).                     035500      
001352 01 WKS-FECHA-TEMP-R REDEFINES WKS-FECHA-TEMP.                    035600      
001353     03  WKS-MES-TEMP              PIC 9(2).                      035700      
001354     03  WKS-DIA-TEMP              PIC 9(2).                      035800      
001355     03  WKS-AMO-TEMP              PIC 9(4).                      035900      
001356                                                                  036000      
001357 01 WKS-HORA-MAQ                   PIC 9(08).                     036100      
001358 01 WKS-HORA-MAQ-R REDEFINES WKS-HORA-MAQ.                        036200      
001359    03  WKS-HORA-HHMMSS            PIC 9(06).                     036300      
001360    03  FILLER                     PIC 9(02).                     036400      
001361 01 WKS-HORAM-MAQ-R REDEFINES WKS-HORA-MAQ.                       036500      
001362    03  WKS-HORA-HHMM              PIC 9(02).                     036600      
001363    03  WKS-MINU-HHMM              PIC 9(02).                     036700      
001364    03  FILLER                     PIC 9(04).                     036800      
001365******************************************************************036900      
001366*                       HORA DE PROCESO                          *037000      
001367******************************************************************037100      
001368 01  WKS-HORA-PROCESO              PIC 9(08).                     037200      
001369                                                                  037300      
001370 01  WKS-HORA-R REDEFINES WKS-HORA-PROCESO.                       037400      
001371     03  WKS-HORA-HMS              PIC 9(06).                     037500      
001372     03  FILLER                    PIC X(02).                     037600      
001373******************************************************************037700      
001374*                ENCABEZADO COMUN PARA REPORTES.                 *037800      
001375******************************************************************037900      
001376 01  WLI-TIT1-ENCAB.                                              038000      
001377     03 FILLER                     PIC X(10) VALUE "S151-P104-".  038100      
001378     03 WLI-ENC-SUPDER             PIC X(11).                     038250      
001379     03 FILLER                     PIC X(22) VALUE SPACES.        038300      
001380     03 FILLER                     PIC X(42) VALUE                038400      
001381                   "       ADMINISTRACION DE MOVIMIENTOS      ".  038500      
001382     03 FILLER                     PIC X(11) VALUE SPACES.        038600      
001383     03 FILLER                     PIC X(26) VALUE                038700      
001384                                   "FECHA DE LA INFORMACION : ".  038800      
001385     03 WLI-RP-E1-FECHA-INF        PIC 9999/99/99.                038900      
001386******************************************************************039000      
001387*  ENCABEZADO DEL REPORTE DE TOTALES POR CLAVES DE TRANSACCION.  *039100      
001388******************************************************************039200      
001389 01  WLI-TIT2-ENCAB.                                              039300      
001390     03 FILLER                     PIC X(11) VALUE                039400      
001391                                   "F.PROCESO: ".                 039500      
001392     03 WLI-RP-E2-FECHA-PROC       PIC 9999/99/99.                039600      
001393     03 FILLER                     PIC X      VALUE SPACE.        039700      
001394     03 WLI-RP-E2-HORA-TIT         PIC 999999.                    039800      
001395     03 FILLER                     PIC X(22) VALUE SPACES.        039900      
001396     03 FILLER                     PIC X(27) VALUE                040000      
001397                                   "PUNTEO DE TOTALES POR CLAVE". 040100      
001398     03 FILLER                     PIC X(29) VALUE SPACES.        040200      
001399     03 FILLER                     PIC X(24) VALUE                040300      
001400                                   "TIPO DE PROCESO : DIARIO".    040400      
001401******************************************************************040500      
001402*                ENCABEZADO COMUN PARA REPORTES.                 *040600      
001403******************************************************************040700      
001404 01  WLI-TIT3-ENCAB.                                              040800      
001405     03 FILLER                     PIC X(11) VALUE                040900      
001406                                   "VERSION  : ".                 041000      
001407     03 WSR-RP-E3-VERSION          PIC 9999/99/99.                041100      
001408     03 FILLER                     PIC X(31) VALUE SPACES.        041200      
001409     03 FILLER                     PIC X(13) VALUE                041300      
001410                                   "DEL SISTEMA S".               041400      
001411     03 WSR-RP-E3-SISTEMA          PIC 9(03).                     041500      
001412     03 FILLER                     PIC X(10) VALUE                041600      
001413                                   "  VS  S151".                  041700      
001414     03 FILLER                     PIC X(41) VALUE SPACES.        041800      
001415     03 FILLER                     PIC X(07) VALUE "HOJA : ".     041900      
001416     03 WSR-RP-E3-HOJA             PIC ZZZZZ9.                    042000      
001417******************************************************************042100      
001418*          ENCABEZADO DEL REPORTE DE PUNTEO A DETALLE.           *042200      
001419******************************************************************042300      
001420 01  WLI-TIT4-ENCAB.                                              042400      
001421     03 FILLER                     PIC X(11) VALUE                042500      
001422                                   "F.PROCESO: ".                 042600      
001423     03 WLI-RP-E4-FECHA-PROC       PIC 9999/99/99.                042700      
001424     03 FILLER                     PIC X(01) VALUE SPACE.         042800      
001425     03 WLI-RP-E4-HORA-TIT         PIC 999999.                    042900      
001426     03 FILLER                     PIC X(22) VALUE SPACES.        043000      
001427     03 FILLER                     PIC X(27) VALUE                043100      
001428                                   "     PUNTEO A DETALLE      ". 043200      
001429     03 FILLER                     PIC X(29) VALUE SPACES.        043300      
001430     03 FILLER                     PIC X(24) VALUE                043400      
001431                                   "TIPO DE PROCESO : DIARIO".    043500      
001432******************************************************************043600      
001433*    TITULOS DEL REPORTE DE TOTALES POR CLAVES DE TRANSACCION.   *043700      
001434******************************************************************043800      
001435 01  WLI-TIT5-CVES.                                               043900      
001436     03 FILLER                     PIC X(60) VALUE SPACES.        044000      
001437     03 FILLER                     PIC X(01) VALUE "S".           044100      
001438     03 WLI-CVES-SISTEMA           PIC 9(03).                     044200      
001439     03 FILLER                     PIC X(36) VALUE SPACES.        044300      
001440     03 FILLER                     PIC X(04) VALUE "S151".        044400      
001441     03 FILLER                     PIC X(28) VALUE SPACES.        044500      
001442                                                                  044600      
001443 01  WLI-TIT6-CVES.                                               044700      
001444     03 FILLER                     PIC X(02) VALUE SPACES.        044800      
001445     03 FILLER                     PIC X(05) VALUE "LIBRO".       044900      
001446     03 FILLER                     PIC X(02) VALUE SPACES.        045000      
001447     03 FILLER                     PIC X(05) VALUE "PROD.".       045100      
001448     03 FILLER                     PIC X(02) VALUE SPACES.        045200      
001449     03 FILLER                     PIC X(05) VALUE "INST.".       045300      
001450     03 FILLER                     PIC X(02) VALUE SPACES.        045400      
001451     03 FILLER                     PIC X(04) VALUE "MON.".        045500      
001452     03 FILLER                     PIC X(02) VALUE SPACES.        045600      
001453     03 FILLER                     PIC X(05) VALUE "CLAVE".       045700      
001454     03 FILLER                     PIC X(05) VALUE SPACES.        045800      
001455     03 FILLER                     PIC X(13) VALUE                045810      
001456                                             "L E Y E N D A".     045820      
001457     03 FILLER                     PIC X(05) VALUE SPACES.        045830      
001458     03 FILLER                     PIC X(02) VALUE "TM".          045900      
001459     03 FILLER                     PIC X(05) VALUE SPACES.        046000      
001460     03 FILLER                     PIC X(04) VALUE "NUM.".        046100      
001461     03 FILLER                     PIC X(07) VALUE SPACES.        046200      
001462     03 FILLER                     PIC X(13) VALUE                046300      
001463                                             "I M P O R T E".     046400      
001464     03 FILLER                     PIC X(13) VALUE SPACES.        046500      
001465     03 FILLER                     PIC X(04) VALUE "NUM.".        046600      
001466     03 FILLER                     PIC X(07) VALUE SPACES.        046700      
001467     03 FILLER                     PIC X(13) VALUE                046800      
001468                                   "I M P O R T E".               046900      
001469     03 FILLER                     PIC X(05) VALUE SPACES.        047000      
001470                                                                  047100      
001471 01 WLI-REP-TOTCVES.                                              047200      
001472    03 FILLER                      PIC X(05) VALUE SPACES.        047300      
001473    03 WLI-TOT-LIBRO               PIC Z9.                        047400      
001474    03 FILLER                      PIC X(03) VALUE SPACES.        047500      
001475    03 WLI-TOT-PROD                PIC ZZZ9.                      047600      
001476    03 FILLER                      PIC X(03) VALUE SPACES.        047700      
001477    03 WLI-TOT-INST                PIC ZZZ9.                      047800      
001478    03 FILLER                      PIC X(02) VALUE SPACES.        047900      
001479    03 WLI-TOT-MON                 PIC ZZZ9.                      048000      
001480    03 FILLER                      PIC X(03) VALUE SPACES.        048100      
001481    03 WLI-TOT-CVETRA              PIC ZZZ9.                      048200      
001482    03 FILLER                      PIC X(01) VALUE SPACES.        048300      
001483    03 WLI-TOT-LEY                 PIC X(20).                     048310      
001484    03 FILLER                      PIC X(01) VALUE SPACES.        048320      
001485    03 WLI-TOT-TMSNNN              PIC ZZZ9.                      048400      
001486    03 FILLER                      PIC X(02) VALUE SPACES.        048500      
001487    03 WLI-TOT-MOVSNNN             PIC ZZZZZZZ9.                  048600      
001488    03 FILLER                      PIC X(02) VALUE SPACES.        048700      
001489    03 WLI-TOT-IMPSNNN             PIC ZZZ,ZZZ,ZZZ,ZZ9.99.        048800      
001490    03 FILLER                      PIC X(02) VALUE SPACES.        048900      
001491    03 WLI-TOT-CONCEPTO            PIC X(04).                     049000      
001492    03 FILLER                      PIC X(03) VALUE SPACES.        049100      
001493    03 WLI-TOT-MOVS151             PIC ZZZZZZZ9.                  049200      
001494    03 FILLER                      PIC X(02) VALUE SPACES.        049300      
001495    03 WLI-TOT-IMPS151             PIC ZZZ,ZZZ,ZZZ,ZZ9.99.        049400      
001496    03 FILLER                      PIC X(03) VALUE SPACES.        049500      
001497                                                                  049600      
001498 01 WKS-ARCH-TOTCVES.                                             049700      
001499    03 FILLER                      PIC X     VALUE ",".           049800      
001500    03 WKS-TOT-LIBRO               PIC 99.                        049900      
001501    03 FILLER                      PIC X     VALUE ",".           050000      
001502    03 WKS-TOT-PROD                PIC 9999.                      050100      
001503    03 FILLER                      PIC X     VALUE ",".           050200      
001504    03 WKS-TOT-INST                PIC 9999.                      050300      
001505    03 FILLER                      PIC X     VALUE ",".           050400      
001506    03 WKS-TOT-MON                 PIC 9999.                      050500      
001507    03 FILLER                      PIC X     VALUE ",".           050600      
001508    03 WKS-TOT-CVETRA              PIC 9999.                      050700      
001509    03 FILLER                      PIC X     VALUE ",".           050800      
001510    03 WKS-TOT-TMSNNN              PIC 9999.                      050900      
001511    03 FILLER                      PIC X     VALUE ",".           051000      
001512    03 WKS-TOT-MOVSNNN             PIC 99999999.                  051100      
001513    03 FILLER                      PIC X     VALUE ",".           051200      
001514    03 WKS-TOT-IMPSNNN             PIC 999999999999.99.           051300      
001515    03 FILLER                      PIC X     VALUE ",".           051400      
001516    03 WKS-TOT-CONCEPTO            PIC XX    VALUE SPACES.        051500      
001517    03 FILLER                      PIC X     VALUE ",".           051600      
001518    03 WKS-TOT-MOVS151             PIC 99999999.                  051700      
001519    03 FILLER                      PIC X     VALUE ",".           051800      
001520    03 WKS-TOT-IMPS151             PIC 999999999999.99.           051900      
001521    03 FILLER                      PIC X     VALUE ",".           052000      
001522                                                                  052100      
001523******************************************************************052200      
001524*           TITULOS DEL REPORTE DE PUNTEO A DETALLE.             *052300      
001525******************************************************************052400      
001526                                                                  052500      
001527 01 WLI-TIT7-DET.                                                 052600      
001528    03 FILLER                      PIC X(16) VALUE                052800      
001529                                             "    CONTRATO    ".  052900      
001530    03 FILLER                      PIC X(02) VALUE SPACES.        053000      
001531    03 FILLER                      PIC X(04) VALUE "MON.".        053100      
001532    03 FILLER                      PIC X(02) VALUE SPACES.        053200      
001533    03 FILLER                      PIC X(05) VALUE "CLAVE".       053300      
001534    03 FILLER                      PIC X(03) VALUE SPACES.        053400      
001535    03 FILLER                      PIC X(13) VALUE                053410      
001536                                            "L E Y E N D A".      053415      
001537    03 FILLER                      PIC X(07) VALUE SPACES.        053420      
001538    03 FILLER                      PIC X(02) VALUE "TM".          053500      
001539    03 FILLER                      PIC X(06) VALUE SPACES.        053600      
001540    03 FILLER                      PIC X(13) VALUE                053700      
001541                                             "I M P O R T E".     053800      
001542    03 FILLER                      PIC X(02) VALUE SPACES.        053900      
001543    03 FILLER                      PIC X(04) VALUE "S151".        054000      
001544    03 FILLER                      PIC X(01) VALUE SPACES.        054100      
001545    03 FILLER                      PIC X(01) VALUE "S".           054200      
001546    03 WLI-DET-SISTEMA             PIC 9(03).                     054300      
001547    03 FILLER                      PIC X(02) VALUE SPACES.        054400      
001548    03 FILLER                      PIC X(08) VALUE "AUT/S151".    054500      
001549    03 FILLER                      PIC X(02) VALUE SPACES.        054600      
001550    03 FILLER                      PIC X(07) VALUE "AUT/APL".     054700      
001551    03 FILLER                      PIC X(02) VALUE SPACES.        054800      
001552    03 FILLER                      PIC X(04) VALUE "SUC.".        054900      
001553    03 FILLER                      PIC X(02) VALUE SPACES.        055000      
001554    03 FILLER                      PIC X(04) VALUE "CAJA".        055100      
001555    03 FILLER                      PIC X(02) VALUE SPACES.        055200      
001556    03 FILLER                      PIC X(05) VALUE "PROD.".       055300      
001557    03 FILLER                      PIC X(01) VALUE SPACES.        055400      
001558    03 FILLER                      PIC X(05) VALUE "INST.".       055500      
001559    03 FILLER                      PIC X(04) VALUE " LIB".        055600      
001560 01 WLI-TIT8-DET.                                                 055610      
001561    03 FILLER                      PIC X(104) VALUE SPACES.       055620      
001562    03 FILLER                      PIC X(12) VALUE "TRANS  TRANS".055630      
001563                                                                  055700      
001564 01 WLI-REP-DETCVE.                                               055800      
001565    03 WLI-DET-CONTRATO            PIC ZZZZZZZZZZZZZZZ9.          056000      
001566    03 FILLER                      PIC X(02) VALUE SPACES.        056100      
001567    03 WLI-DET-MONEDA              PIC ZZZ9.                      056200      
001568    03 FILLER                      PIC X(02) VALUE SPACES.        056300      
001569    03 WLI-DET-CVETRANS            PIC ZZZ9.                      056400      
001570    03 FILLER                      PIC X(01) VALUE SPACES.        056410      
001571    03 WLI-DET-LEY                 PIC X(20).                     056420      
001572    03 FILLER                      PIC X(01) VALUE SPACES.        056500      
001573    03 WLI-DET-TM                  PIC ZZZ9.                      056600      
001574    03 FILLER                      PIC X(01) VALUE SPACES.        056700      
001575    03 WLI-DET-IMPORTE             PIC ZZZ,ZZZ,ZZZ,ZZ9.99.        056800      
001576    03 FILLER                      PIC X(03) VALUE SPACES.        056900      
001577    03 WLI-DET-VER-S151            PIC X(02).                     057000      
001578    03 FILLER                      PIC X(03) VALUE SPACES.        057100      
001579    03 WLI-DET-VER-SNNN            PIC X(02).                     057200      
001580    03 FILLER                      PIC X(02) VALUE SPACES.        057300      
001581    03 WLI-DET-AUT-S151            PIC ZZZZZZZ9.                  057400      
001582    03 FILLER                      PIC X(01) VALUE SPACES.        057500      
001583    03 WLI-DET-AUT-APLI            PIC ZZZZZZZ9.                  057600      
001584    03 FILLER                      PIC X(02) VALUE SPACES.        057700      
001585    03 WLI-DET-SUC-TRANS           PIC ZZZ9.                      057800      
001586    03 FILLER                      PIC X(03) VALUE SPACES.        057900      
001587    03 WLI-DET-CAJ-TRANS           PIC ZZ99.                      058000      
001588    03 FILLER                      PIC X(02) VALUE SPACES.        058100      
001589    03 WLI-DET-PRODUCTO            PIC ZZZ9.                      058200      
001590    03 FILLER                      PIC X(05) VALUE SPACES.        058300      
001591    03 WLI-DET-INSTRUMENTO         PIC Z9.                        058400      
001592    03 FILLER                      PIC XX    VALUE SPACES.        058500      
001593    03 WLI-DET-LIBRO               PIC Z9.                        058600      
001594                                                                  058800      
001595 01 WKS-ARCH-DETCVES.                                             058900      
001596    03 FILLER                      PIC X     VALUE ",".           059000      
001597    03 WKS-DET-CONTRATO            PIC 9(16).                     059100      
001598    03 FILLER                      PIC X     VALUE ",".           059200      
001599    03 WKS-DET-MONEDA              PIC 9999.                      059300      
001600    03 FILLER                      PIC X     VALUE ",".           059400      
001601    03 WKS-DET-CVETRANS            PIC 9999.                      059500      
001602    03 FILLER                      PIC X     VALUE ",".           059600      
001603    03 WKS-DET-TM                  PIC 9999.                      059700      
001604    03 FILLER                      PIC X     VALUE ",".           059800      
001605    03 WKS-DET-IMPORTE             PIC 999999999999.99.           059900      
001606    03 FILLER                      PIC X     VALUE ",".           060000      
001607    03 WKS-DET-VER-S151            PIC XX    VALUE SPACES.        060100      
001608    03 FILLER                      PIC X     VALUE ",".           060200      
001609    03 WKS-DET-VER-SNNN            PIC XX    VALUE SPACES.        060300      
001610    03 FILLER                      PIC X     VALUE ",".           060400      
001611    03 WKS-DET-AUT-S151            PIC 9(08).                     060500      
001612    03 FILLER                      PIC X     VALUE ",".           060600      
001613    03 WKS-DET-AUT-APLI            PIC 9(08).                     060700      
001614    03 FILLER                      PIC X     VALUE ",".           060800      
001615    03 WKS-DET-SUC-TRANS           PIC 9999.                      060900      
001616    03 FILLER                      PIC X     VALUE ",".           061000      
001617    03 WKS-DET-CAJ-TRANS           PIC ZZ99.                      061100      
001618    03 FILLER                      PIC X     VALUE ",".           061200      
001619    03 WKS-DET-PRODUCTO            PIC 9999.                      061300      
001620    03 FILLER                      PIC X     VALUE ",".           061400      
001621    03 WKS-DET-INSTRUMENTO         PIC 99.                        061500      
001622    03 FILLER                      PIC X     VALUE ",".           061600      
001623    03 WKS-DET-LIBRO               PIC 99.                        061700      
001624    03 FILLER                      PIC X     VALUE ",".           061800      
001625******************************************************************061900      
001626*            VARIABLES MISCELANEAS                               *062000      
001627******************************************************************062100      
001628 77 W77-EOF                               PIC 9.                  062200      
001629 77 W77-EOF2                              PIC 9.                  062300      
001630 77 W77-EOF3                              PIC 9.                  062400      
001631 77 W77-EOF4                              PIC 9.                  062500      
001632 77 W77-EOF5                              PIC 9.                  062600      
001633 77 W77-CSI-PROCESO                       PIC 9(02).              062700      
001634 77 W77-RESULT                            PIC S9(11) BINARY.      062800      
001635 77 W77-IND                               PIC 9(06).              062900      
001636 77 W77-IND2                              PIC 9(06).              062910      
001637 77 W77-DET1                              PIC 9(01).              063000      
001638 77 W77-DET2                              PIC 9(01).              063100      
001639 77 W77-DET3                              PIC 9(01).              063200      
001640 77 W77-DET4                              PIC 9(01).              063300      
001641 77 W77-DET5                              PIC 9(01).              063400      
001642 77 W77-SISTEMA-PARAM                     PIC 9(03).              063500      
001643 77 W77-APUCVE                            PIC 9(08) COMP.         063600      
001644 77 W77-APUCVES151                        PIC 9(08) COMP.         063700      
001645 77 W77-LLAVE-PUN1                        PIC 9(08).              063710      
001646 77 W77-LLAVE-PUN2                        PIC 9(08).              063720      
001647 77 W77-BAN-DIFSNNN                       PIC 9.                  063800      
001648 77 W77-BAN-DIFS151                       PIC 9.                  063900      
001649 77 W77-RANGO1-SNNN                       PIC 9(08) COMP.         064000      
001650 77 W77-RANGO2-SNNN                       PIC 9(08) COMP.         064100      
001651 77 W77-RANGO1-S151                       PIC 9(08) COMP.         064200      
001652 77 W77-RANGO2-S151                       PIC 9(08) COMP.         064300      
001653 77 W77-INDCVE                            PIC 9(01).              064400      
001654 77 W77-NUM-LINEAS                        PIC 9(02) VALUE 0.      064500      
001655 01 WKS-VAR-DISPLAY.                                              064600      
001656    03 WKS-SIS-DISP                       PIC 9(04).              064700      
001657    03 WKS-FEC-DISP                       PIC 9(08).              064800      
001658 01 WKS-TOT-ARCHIVOS.                                             064900      
001659    03 WKS-NUM-ARCHSNNN                   PIC 9(08)    COMP.      065000      
001660    03 WKS-IMP-ARCHSNNN                   PIC 9(16)V99 COMP.      065100      
001661    03 WKS-NUM-ARCHS151                   PIC 9(08)    COMP.      065200      
001662    03 WKS-IMP-ARCHS151                   PIC 9(16)V99 COMP.      065300      
001663 77 W77-FIN-PUNTEO                        PIC 9(02).              065310      
001664                                                                  065320      
001665 77 WKS-SISTEMA-NVOESQ                      PIC 9(03).            065330      
001666    88  WKS-SISTEMA-F4                      VALUE 804, 404, 707,  065340      
001667                                                  203.            065345      
001668                                                                  065350      
001669 01 WKS-SISTEMA.                                                  065360      
001670    03 WKS-SISTEMA-LETRA                     PIC X(01).           065370      
001671    03 WKS-SISTEMA-NUMERO                    PIC 9(03).           065380      
001672                                                                  065390      
001673******************************************************************065400      
001674*       REGISTROS PARA LA COMPARACION DE TOTALES POR CLAVE       *065500      
001675******************************************************************065600      
001676 01 WKS-LLAVE-SNNN.                                               065700      
001677    03 WKS-LIB-SNNN                       PIC 9(02) COMP.         065800      
001678    03 WKS-MON-SNNN                       PIC 9(04) COMP.         065900      
001679    03 WKS-PRO-SNNN                       PIC 9(04) COMP.         066000      
001680    03 WKS-INS-SNNN                       PIC 9(04) COMP.         066100      
001681    03 WKS-CVE-SNNN                       PIC 9(04) COMP.         066200      
001682    03 WKS-TM-SNNN                        PIC 9(04) COMP.         066300      
001683                                                                  066400      
001684 01 WKS-LLAVE-S151.                                               066500      
001685    03 WKS-LIB-S151                       PIC 9(02) COMP.         066600      
001686    03 WKS-MON-S151                       PIC 9(04) COMP.         066700      
001687    03 WKS-PRO-S151                       PIC 9(04) COMP.         066800      
001688    03 WKS-INS-S151                       PIC 9(04) COMP.         066900      
001689    03 WKS-CVE-S151                       PIC 9(04) COMP.         067000      
001690    03 WKS-TM-S151                        PIC 9(04) COMP.         067100      
001691                                                                  067200      
001692/**************************************************************** 067300      
001693*             P R O C E D U R E     D I V I S I O N             * 067400      
001694***************************************************************** 067500      
001695 PROCEDURE DIVISION USING W77-SISTEMA-PARAM.                      067600      
001696 000000-PROGRAMA.                                                 067700      
001697*================                                                 067800      
001698                                                                  067900      
001699     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   068000      
001700        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          068100      
001701                                                                  068200      
001702     CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION.     068220      
001703     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP".       068240      
001704                                                                  068260      
001705     MOVE "S151" TO SISTEMA-LJ                                    068300      
001706     MOVE "P104" TO PASO-LJ                                       068400      
001707     MOVE "001"  TO MTP-LJ                                        068500      
001708     PERFORM 10000-INICIO-PROGRAMA.                               068600      
001709     PERFORM 20000-SORTEA-ARCHIVOS-TOTXCVE.                       068700      
001710     PERFORM 30000-COMPARA-TOTXCVE.                               068800      
001711     IF W77-BAN-DIFSNNN = 1 OR W77-BAN-DIFS151 = 1                068900      
001712        PERFORM 40000-SORTEA-ARCHIVO-CONTRATO                     069000      
001713        PERFORM 50000-COMPARA-DETALLE                             069100      
001714     ELSE                                                         069200      
001715        PERFORM 50000-COMPARA-DETALLE.                            069300      
001716     CLOSE A00-SPUNTEO1  WITH PURGE                               069400      
001717           A00-SPUNTEO2  WITH PURGE.                              069410      
001718*HSC INI ALTA DISPONIBILIDAD IBM 06/02/2015                       069420      
001719     IF(W77-SISTEMA-PARAM = 804 OR 203)                           069430      
001720        AND ATTRIBUTE VALUE OF MYSELF = 0                         069440      
001721            PERFORM 010200-ACTUALIZA-B05.                         069450      
001722*HSC FIN ALTA DISPONIBILIDAD IBM 06/02/2015                       069460      
001723     STOP RUN.                                                    069500      
001724                                                                  069600      
001725 10000-INICIO-PROGRAMA.                                           069700      
001726*======================                                           069800      
001727     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.069900      
001728     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            070000      
001729                                      "SOPORTECOMS".              070100      
001730     CALL "CSIID OF SOPORTECOMS"                                  070200      
001731          USING WKS-DATOSHOST                                     070300      
001732                                                                  070400      
001733     CHANGE ATTRIBUTE LIBACCESS    OF "CTRLVERS" TO BYFUNCTION.   070500      
001734     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".    070600      
001735                                                                  070700      
001736     MOVE "S151L001CTL"         TO WKS-CTLVERS-LIBRERIA           070800      
001737     CALL "DAME_TIT IN CTRLVERS"                                  070900      
001738          USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO          071000      
001739          GIVING WKS-CTLVERS-STATUS.                              071100      
001740                                                                  071200      
001741     IF WKS-CTLVERS-STATUS < 0                                    071300      
001742        MOVE "I"    TO TIPO-LJ                                    071400      
001743        MOVE 020101 TO CODIGO-LJ                                  071500      
001744        STRING "ERROR EN CTLVERS, USO LICBRERIA DE CONTROL SIN ", 071600      
001745               "RELEASE NI MTP." DELIMITED BY SIZE INTO TEXTO-LJ  071700      
001746        CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ       071800      
001747        CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL"   TO           071900      
001748            "(S151)S151/OBJECT/L001/CONTROL          ON CMEMP."   072000      
001749     ELSE                                                         072100      
001750        CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL" TO             072200      
001751               WKS-CTLVERS-TITULO.                                072300      
001752                                                                  072400      
001753                                                                  072402      
001754     MOVE "S080BD01CON"         TO WKS-CTLVERS-LIBRERIA           072404      
001755     CALL "DAME_TIT IN CTRLVERS"                                  072406      
001756          USING  WKS-CTLVERS-LIBRERIA,                            072408      
001757                 WKS-CTLVERS-TITULO                               072410      
001758          GIVING WKS-CTLVERS-STATUS.                              072412      
001759                                                                  072414      
001760     IF WKS-CTLVERS-STATUS < 0                                    072416      
001761        MOVE "I"    TO TIPO-LJ                                    072418      
001762        MOVE 020101 TO CODIGO-LJ                                  072420      
001763        STRING "ERROR EN CTLVERS, NO EXISTE IDENTIFICADOR "       072422      
001764               "(S080BD01CON)"                                    072424      
001765        DELIMITED BY SIZE INTO TEXTO-LJ                           072426      
001766        CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ       072428      
001767        CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL"   TO           072430      
001768            "(S080)S080/OBJECT/L700 "                             072432      
001769     ELSE                                                         072434      
001770        CHANGE ATTRIBUTE TITLE OF "CATALOGOS" TO                  072436      
001771               WKS-CTLVERS-TITULO.                                072438      
001772                                                                  072439      
001773     PERFORM 10050-LIMPIA-ARREGLO.                                072440      
001774                                                                  072442      
001775     IF W77-SISTEMA-PARAM = 402 OR 600                            072444      
001776        MOVE "C"                      TO WKS-PLATAFORMA-1         072449      
001777                                         WKS-PLATAFORMA-2         072454      
001778                                         WKS-SISTEMA-LETRA        072456      
001779     ELSE                                                         072459      
001780        MOVE "S"                      TO WKS-PLATAFORMA-1         072464      
001781                                         WKS-PLATAFORMA-2         072469      
001782                                         WKS-SISTEMA-LETRA.       072472      
001783                                                                  072474      
001784     MOVE W77-SISTEMA-PARAM           TO WKS-CVE-SISTEMA          072500      
001785                                         WKS-CVE-SISTEMA2         072600      
001786                                         WKS-TCVE-SISTEMA         072700      
001787                                         WKS-DCVE-SISTEMA         072800      
001788                                         WKS-SIS-TOTXCVE          072900      
001789                                         WSR-RP-E3-SISTEMA        073000      
001790                                         WLI-CVES-SISTEMA         073100      
001791                                         WLI-DET-SISTEMA          073200      
001792                                         WKS-SISTEMA-NUMERO       073230      
001793                                         WKS-SISTEMA-NVOESQ       073240      
001794                                         WKS-B01-SISTEMA.         073250      
001795                                                                  073252      
001796     MOVE 1                               TO WKS-B01-FUNCION      073254      
001797     MOVE WKS-DH-NUMCSI                   TO WKS-CVE-CSIO,        073256      
001798                                             WKS-CVE-CSID,        073258      
001799                                             WKS-CVE-CSIO2,       073260      
001800                                             WKS-CVE-CSID2,       073262      
001801                                             W77-CSI-PROCESO.     073264      
001802                                                                  073266      
001803*HSC INI ALTA DISPONIBILIDAD IBM 06/02/2015                       073268      
001804     CALL "CONSISDIA IN S151LIBCONTROL"                           073270      
001805          USING  WKS-S151B01SISDIA                                073272      
001806          GIVING W77-RESULT                                       073274      
001807                                                                  073276      
001808     IF ATTRIBUTE VALUE OF MYSELF = 0                             073278      
001809        MOVE WKS-B01-FECPRO               TO WKS-FECHA-PROCESO    073280      
001810        MOVE WKS-B01-FECPRO151            TO WKS-FECHA-PRO151     073282      
001811     ELSE                                                         073284      
001812        MOVE ATTRIBUTE VALUE OF MYSELF    TO WKS-FECHA-PROCESO.   073286      
001813                                                                  073288      
001814     IF (W77-SISTEMA-PARAM = 804 OR 203)                          073290      
001815        AND ATTRIBUTE VALUE OF MYSELF = 0                         073292      
001816            PERFORM 010000-VERIFICA-B05.                          073294      
001817*HSC FIN ALTA DISPONIBILIDAD IBM 06/02/2015                       073296      
001818                                                                  073300      
001819     PERFORM 10100-CARGA-CATALOGOS.                               073350      
001820                                                                  073400      
001821     MOVE 1                               TO WKS-B01-FUNCION      073500      
001822     MOVE WKS-DH-NUMCSI                   TO WKS-CVE-CSIO,        073600      
001823                                             WKS-CVE-CSID,        073700      
001824                                             WKS-CVE-CSIO2,       073800      
001825                                             WKS-CVE-CSID2,       073900      
001826                                             W77-CSI-PROCESO.     074000      
001827*                                                                 074100      
001828*     CALL "CONSISDIA IN S151LIBCONTROL"                          074200      
001829*          USING  WKS-S151B01SISDIA                               074300      
001830*          GIVING W77-RESULT                                      074400      
001831*                                                                 074500      
001832*     IF ATTRIBUTE VALUE OF MYSELF = 0                            074600      
001833*        MOVE WKS-B01-FECPRO               TO WKS-FECHA-PROCESO   074700      
001834*     ELSE                                                        074900      
001835*        MOVE ATTRIBUTE VALUE OF MYSELF    TO WKS-FECHA-PROCESO.  075000      
001836                                                                  075200      
001837     MOVE WKS-FECHA-PROCESO TO   WKS-CVE-FECHA, WKS-CVE-FECHA2.   075250      
001838     ACCEPT   WKS-HORA-MAQ         FROM TIME                      075300      
001839                                                                  075400      
001840******************************************************************075500      
001841*                  FECHA  Y  HORA DE COMPILACION                 *075600      
001842******************************************************************075700      
001843                                                                  075800      
001844     MOVE ATTRIBUTE NAME OF MYSELF TO WKS-HORA-COMPILACION        076400      
001845                                                                  076500      
001846     CALL "CONVERT-DATE OF LOCSUP"                                076600      
001847          USING WKS-HORA-COMPILACION    A2K-FEC-DMA-001           076700      
001848        PERFORM A2K-CONV-DMA-TO-DMCA THRU                         076800      
001849                A2K-CONV-DMA-TO-DMCA-EXIT                         076900      
001850        MOVE A2K-FEC-DMCA-001 TO WKS-FECHA-COMPILACION            077000      
001851                                                                  077100      
001852     MOVE WKS-FECHA-COMPILACION    TO WKS-FECHA-TEMP              077200      
001853     MOVE WKS-DIA-TEMP             TO WKS-FECHA-COMP-DD           077300      
001854     MOVE WKS-MES-TEMP             TO WKS-FECHA-COMP-MM           077400      
001855     MOVE WKS-AMO-TEMP             TO WKS-FECHA-COMP-AA           077500      
001856                                                                  077600      
001857     COMPUTE WKS-HORA-COMP = WKS-HORA-COMP / 60                   077700      
001858     COMPUTE WKS-HORA-COMP-HH    =                                077800      
001859             FUNCTION DIV (WKS-HORA-COMP, 3600 )                  077900      
001860     COMPUTE W77-IND          =                                   078000      
001861             FUNCTION DIV (WKS-HORA-COMP, 60 )                    078100      
001862     COMPUTE WKS-HORA-COMP-MM    =                                078200      
001863             FUNCTION MOD (W77-IND   , 60 )                       078300      
001864     COMPUTE WKS-HORA-COMP-SS    =                                078400      
001865             FUNCTION MOD (WKS-HORA-COMP, 60 )                    078500      
001866                                                                  078600      
001867     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          078610      
001868             A2K-ACCEPT-TODAYS-DATE-EXIT.                         078620      
001869            MOVE A2K-FEC-MDCA-001 TO WKS-FECHA-TEMP.              078630      
001870                                                                  078635      
001871     MOVE WKS-AMO-TEMP      TO    WKS-FM-AMO                      078640      
001872     MOVE WKS-MES-TEMP      TO    WKS-FM-MES                      078650      
001873     MOVE WKS-DIA-TEMP      TO    WKS-FM-DIA                      078670      
001874     MOVE WKS-FPROCESO-A6          TO WKS-FECHA-TOTXCVE.          078700      
001875                                                                  078800      
001876     MOVE WKS-FECHA-MAQ            TO WLI-RP-E2-FECHA-PROC        078900      
001877                                      WLI-RP-E4-FECHA-PROC.       079000      
001878                                                                  079100      
001879     MOVE WKS-FECHA-PROCESO        TO WKS-DCVE-FECHA              079200      
001880                                      WKS-TCVE-FECHA              079300      
001881                                      WLI-RP-E1-FECHA-INF.        079400      
001882                                                                  079500      
001883     MOVE ATTRIBUTE STACKNO OF MYSELF     TO WKS-MIX-TOTXCVE.     079600      
001884                                                                  079700      
001885     MOVE W77-CSI-PROCESO          TO WKS-CSI-TOTXCVE             079800      
001886                                      WKS-TCVE-CSI                079900      
001887                                      WKS-DCVE-CSI.               080000      
001888                                                                  080100      
001889     ACCEPT WKS-HORA-PROCESO       FROM TIME.                     080200      
001890                                                                  080300      
001891     MOVE WKS-HORA-HMS             TO WLI-RP-E2-HORA-TIT          080400      
001892                                      WLI-RP-E4-HORA-TIT.         080500      
001893                                                                  080600      
001894     MOVE WKS-FECHA-COMP           TO WSR-RP-E3-VERSION.          080700      
001895                                                                  080800      
001896     MOVE 1       TO      WKS-CVE-NUMARCH.                        080900      
001897     MOVE 2       TO      WKS-CVE-NUMARCH2.                       081000      
001898     MOVE 1       TO      W77-APUCVE, W77-APUCVES151.             081050      
001899                                                                  081100      
001900     STRING "INICIO PROCESO CON FECHA ",                          081200      
001901            WKS-CVE-FECHA                                         081300      
001902            DELIMITED BY SIZE                                     081400      
001903            INTO TEXTO-LJ                                         081500      
001904     CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         081600      
001905                                                                  081700      
001906     OPEN INPUT CVETRAN.                                          081800      
001907     MOVE ATTRIBUTE LASTRECORD OF CVETRAN TO W77-LAST-RECORD.     081900      
001908     READ CVETRAN INTO A00-R00-HDR-PUNTEO.                        082000      
001909                                                                  082100      
001910     MOVE A00-R00-PUN-SIST        TO      WKS-SIS-DISP            082200      
001911     MOVE A00-R00-PUN-FECPRO      TO      WKS-FEC-DISP            082300      
001912                                                                  082400      
001913     IF A00-R00-PUN-FECPRO = WKS-CVE-FECHA                        082500      
001914        IF A00-R00-PUN-SIST = W77-SISTEMA-PARAM                   082600      
001915           NEXT SENTENCE                                          082700      
001916        ELSE                                                      082800      
001917           MOVE "E"               TO TIPO-LJ                      082900      
001918           MOVE 020202            TO CODIGO-LJ                    083000      
001919           STRING "ERROR EN HD ARCHIVO PUNTEO DEL SIST ",         083100      
001920                  W77-SISTEMA-PARAM,                              083200      
001921                  " <> ", WKS-SIS-DISP                            083300      
001922           DELIMITED BY SIZE INTO TEXTO-LJ                        083400      
001923           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ    083500      
001924           SET MYSELF(STATUS)     TO -1                           083600      
001925     ELSE                                                         083700      
001926        MOVE "E"               TO TIPO-LJ                         083800      
001927        MOVE 020202            TO CODIGO-LJ                       083900      
001928        STRING "ERROR EN HD ARCHIVO PUNTEO DEL SIST ",            084000      
001929                W77-SISTEMA-PARAM,                                084100      
001930               " FECHA ERRONEA : ", WKS-FEC-DISP                  084200      
001931        DELIMITED BY SIZE INTO TEXTO-LJ                           084300      
001932        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       084400      
001933        SET MYSELF(STATUS)     TO -1.                             084500      
001934                                                                  084600      
001935    COMPUTE W77-APUCVE = W77-LAST-RECORD + 1.                     084620      
001936    SEEK CVETRAN RECORD.                                          084624      
001937    READ CVETRAN INTO A00-R02-TR-PUNTEO.                          084628      
001938    COMPUTE W77-LAST-RECORD = W77-LAST-RECORD - 1.                084632      
001939    IF A00-R02-PUN-CVEREG = 1                                     084636      
001940       MOVE A00-R02-PUN-TOTREG   TO W77-LAST-RECORD               084638      
001941       IF A00-R02-PUN-TOTREG = W77-LAST-RECORD                    084640      
001942          NEXT SENTENCE                                           084644      
001943       ELSE                                                       084648      
001944          MOVE "E"               TO TIPO-LJ                       084652      
001945          MOVE 020202            TO CODIGO-LJ                     084656      
001946          STRING "ERROR EN NUM. DE REGISTROS DEL TRAILER "        084660      
001947                 W77-LAST-RECORD " VS " W77-LAST-RECORD           084664      
001948                 " ARCHIVO PUNTEO1 S"W77-SISTEMA-PARAM,           084668      
001949          DELIMITED BY SIZE INTO TEXTO-LJ                         084672      
001950          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ     084676      
001951          SET MYSELF(STATUS)     TO -1                            084680      
001952    ELSE                                                          084682      
001953       MOVE "E"               TO TIPO-LJ                          084684      
001954       MOVE 020202            TO CODIGO-LJ                        084686      
001955       STRING "ERROR ARCHIVO PUNTEO1 S"W77-SISTEMA-PARAM,         084688      
001956              " SIN TRAILER"                                      084690      
001957       DELIMITED BY SIZE INTO TEXTO-LJ                            084692      
001958       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        084694      
001959       SET MYSELF(STATUS)     TO -1.                              084696      
001960     CLOSE CVETRAN WITH RELEASE.                                  084700      
001961                                                                  084800      
001962     OPEN INPUT CVETRANS151.                                      084900      
001963     MOVE ATTRIBUTE LASTRECORD OF CVETRANS151 TO W77-LAST-RECORD. 085000      
001964     READ CVETRANS151 INTO A00-R00-HDR-PUNTEO.                    085100      
001965                                                                  085200      
001966     IF A00-R00-PUN-FECPRO = WKS-CVE-FECHA                        085300      
001967        IF A00-R00-PUN-SIST = W77-SISTEMA-PARAM                   085400      
001968           NEXT SENTENCE                                          085500      
001969        ELSE                                                      085600      
001970           MOVE "E"               TO TIPO-LJ                      085700      
001971           MOVE 020202            TO CODIGO-LJ                    085800      
001972           STRING "ERROR EN HD ARCHIVO PUNTEO DEL S151 DEL SIST ",085900      
001973                  W77-SISTEMA-PARAM,                              086000      
001974                  " <> ", WKS-SIS-DISP                            086100      
001975           DELIMITED BY SIZE INTO TEXTO-LJ                        086200      
001976           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ    086300      
001977           SET MYSELF(STATUS)     TO -1                           086400      
001978     ELSE                                                         086500      
001979        MOVE "E"               TO TIPO-LJ                         086600      
001980        MOVE 020202            TO CODIGO-LJ                       086700      
001981        STRING "ERROR EN HD ARCHIVO PUNTEO DEL S151 DEL SIST ",   086800      
001982                W77-SISTEMA-PARAM,                                086900      
001983               " FECHA ERRONEA : ", WKS-FEC-DISP                  087000      
001984        DELIMITED BY SIZE INTO TEXTO-LJ                           087100      
001985        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       087200      
001986        SET MYSELF(STATUS)     TO -1.                             087300      
001987     COMPUTE W77-APUCVES151 = W77-LAST-RECORD + 1.                087302      
001988     SEEK CVETRANS151 RECORD.                                     087304      
001989     READ CVETRANS151 INTO A00-R02-TR-PUNTEO.                     087306      
001990     COMPUTE W77-LAST-RECORD = W77-LAST-RECORD - 1.               087308      
001991     IF A00-R02-PUN-CVEREG = 1                                    087310      
001992        MOVE A00-R02-PUN-TOTREG   TO W77-LAST-RECORD              087312      
001993        IF A00-R02-PUN-TOTREG = W77-LAST-RECORD                   087314      
001994           NEXT SENTENCE                                          087316      
001995        ELSE                                                      087318      
001996           MOVE "E"               TO TIPO-LJ                      087320      
001997           MOVE 020202            TO CODIGO-LJ                    087322      
001998           STRING "ERROR EN NUM. DE REGISTROS DEL TRAILER "       087324      
001999                  W77-LAST-RECORD " VS " W77-LAST-RECORD          087326      
002000                  " ARCHIVO PUNTEO1 S"W77-SISTEMA-PARAM,          087328      
002001           DELIMITED BY SIZE INTO TEXTO-LJ                        087330      
002002           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ    087332      
002003           SET MYSELF(STATUS)     TO -1                           087334      
002004     ELSE                                                         087336      
002005        MOVE "E"               TO TIPO-LJ                         087338      
002006        MOVE 020202            TO CODIGO-LJ                       087340      
002007        STRING "NO EXISTE TRAILER EN EL ARCHIVO S151/PUNTEO1 ",   087342      
002008               "PARA EL S",W77-SISTEMA-PARAM                      087347      
002009        DELIMITED BY SIZE INTO TEXTO-LJ                           087352      
002010        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       087362      
002011        SET MYSELF(STATUS)     TO -1.                             087372      
002012                                                                  087400      
002013     CLOSE CVETRANS151 WITH RELEASE.                              087450      
002014                                                                  087452      
002015 10050-LIMPIA-ARREGLO.                                            087454      
002016*=====================                                            087456      
002017     PERFORM 10050-LIMPIA-ARRCVE                                  087458      
002018             VARYING W77-IND FROM 1 BY 1 UNTIL W77-IND > 10000.   087460      
002019                                                                  087462      
002020     PERFORM 10050-LIMPIA-ARRLEY                                  087464      
002021             VARYING W77-IND FROM 1 BY 1 UNTIL W77-IND > 10000.   087466      
002022                                                                  087468      
002023 10050-LIMPIA-ARRCVE.                                             087470      
002024*====================                                             087472      
002025     MOVE ZERO                    TO WKS-CVE-LEYENDA(W77-IND).    087474      
002026                                                                  087476      
002027 10050-LIMPIA-ARRLEY.                                             087478      
002028*====================                                             087480      
002029                                                                  087482      
002030     MOVE SPACES                  TO WKS-TABLA-LEYENDAS-TRANS1    087484      
002031                                     WKS-TABLA-LEYENDAS-TRANS2    087486      
002032                                     WKS-TABLA-LEYENDAS-TRANS3    087488      
002033                                     WKS-TABLA-LEYENDAS-TRANS4.   087490      
002034                                                                  087501      
002035 10100-CARGA-CATALOGOS.                                           087502      
002036*======================                                           087504      
002037     PERFORM 10110-CARGA-CLAVES.                                  087506      
002038     PERFORM 10120-CARGA-LEYENDAS.                                087508      
002039                                                                  087510      
002040 10110-CARGA-CLAVES.                                              087512      
002041*===================                                              087514      
002042     MOVE 523                      TO WKS-EL710-CAT.              087515      
002043                                                                  087516      
002044     IF WKS-SISTEMA-F4                                            087517      
002045        MOVE 1059                  TO WKS-EL710-CAT.              087518      
002046     MOVE 2                        TO WKS-EL710-BUSQUEDA.         087519      
002047     MOVE W77-SISTEMA-PARAM        TO WKS-EL710-LLAVE1.           087520      
002048     IF W77-SISTEMA-PARAM = 804 OR 404 OR 707 OR 203              087521      
002049        MOVE WKS-SISTEMA           TO WKS-EL710-LLAVE1.           087522      
002050     MOVE 1                        TO WKS-EL710-LLAVE2.           087523      
002051     MOVE 151                      TO W77-L710-SISTEMA.           087524      
002052     MOVE 104                      TO W77-L710-PROGRAMA.          087526      
002053     MOVE 20                       TO WKS-EL710-CLAVE.            087528      
002054     MOVE 1                        TO WKS-EL710-REGISTROS.        087530      
002055     MOVE ZERO                     TO WKS-EL710-LLAVE3            087532      
002056                                      WKS-EL710-LLAVE4            087534      
002057                                      WKS-EL710-LLAVE5            087536      
002058                                      WKS-EL710-LLAVE6            087538      
002059                                      WKS-EL710-FECINI            087540      
002060                                      WKS-EL710-NIVINI            087542      
002061                                      WKS-EL710-FEC-VIG.          087544      
002062     PERFORM 10150-LLAMA-L710.                                    087546      
002063     MOVE WKS-SL710-DAT(4)         TO W77-CAT-NUMCAT.             087548      
002064     MOVE WKS-SL710-DAT(5)         TO W77-CAT-FORMATO             087550      
002065                                      WKS-EL710-CAT.              087552      
002066                                                                  087554      
002067     IF W77-CAT-FORMATO = 2                                       087600      
002068        MOVE W77-CAT-NUMCAT        TO WKS-EL710-CAT               087602      
002069        MOVE 1                     TO WKS-EL710-BUSQUEDA          087604      
002070        MOVE W77-SISTEMA-PARAM     TO WKS-EL710-LLAVE1            087606      
002071        MOVE ZERO                  TO WKS-EL710-LLAVE2            087608      
002072     ELSE                                                         087610      
002073     IF W77-CAT-FORMATO = 3 OR W77-CAT-FORMATO = 4                087612      
002074        MOVE W77-CAT-NUMCAT        TO WKS-EL710-CAT               087614      
002075        MOVE 1                     TO WKS-EL710-BUSQUEDA          087616      
002076        MOVE ZERO                  TO WKS-EL710-LLAVE1            087618      
002077                                      WKS-EL710-LLAVE2            087620      
002078     ELSE                                                         087622      
002079     IF W77-CAT-FORMATO = 1                                       087624      
002080        MOVE 6                     TO WKS-EL710-CAT               087626      
002081        MOVE 2                     TO WKS-EL710-BUSQUEDA          087628      
002082        MOVE W77-SISTEMA-PARAM     TO WKS-EL710-LLAVE2            087630      
002083        MOVE ZERO                  TO WKS-EL710-LLAVE1.           087632      
002084                                                                  087634      
002085     MOVE ZERO                     TO W77-EOF.                    087636      
002086                                                                  087638      
002087     MOVE 151                      TO W77-L710-SISTEMA.           087640      
002088     MOVE 104                      TO W77-L710-PROGRAMA.          087644      
002089     MOVE 20                       TO WKS-EL710-CLAVE.            087646      
002090     MOVE 1                        TO WKS-EL710-REGISTROS.        087648      
002091     MOVE ZERO                     TO WKS-EL710-LLAVE3            087650      
002092                                      WKS-EL710-LLAVE4            087652      
002093                                      WKS-EL710-LLAVE5            087654      
002094                                      WKS-EL710-LLAVE6            087656      
002095                                      WKS-EL710-FECINI            087658      
002096                                      WKS-EL710-NIVINI            087660      
002097                                      WKS-EL710-FEC-VIG.          087662      
002098     PERFORM 10150-LLAMA-L710.                                    087664      
002099     IF W77-L710-RESULT = 0 OR 1                                  087666      
002100        PERFORM 10112-CLAVES       UNTIL W77-L710-RESULT > 1      087668      
002101     ELSE                                                         087670      
002102        MOVE W77-L710-RESULT       TO W77-ERROR                   087700      
002103        MOVE "E"                   TO TIPO-LJ                     087702      
002104        MOVE 020202                TO CODIGO-LJ                   087704      
002105        STRING "ERROR EN CATALOGO PARAMETRICO # "                 087706      
002106               W77-CAT-NUMCAT                                     087708      
002107               " ERR. NO. " W77-ERROR                             087710      
002108        DELIMITED BY SIZE INTO TEXTO-LJ                           087712      
002109        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      087714      
002110                                                                  087716      
002111 10112-CLAVES.                                                    087718      
002112*=============                                                    087720      
002113     MOVE WKS-SL710-DAT(1)         TO WKS-EL710-LLAVE1.           087722      
002114     MOVE WKS-SL710-DAT(2)         TO WKS-EL710-LLAVE2.           087724      
002115     MOVE WKS-SL710-DAT(3)         TO WKS-EL710-LLAVE3.           087726      
002116     MOVE WKS-SL710-DAT(4)         TO WKS-EL710-LLAVE4.           087728      
002117     MOVE WKS-SL710-DAT(5)         TO WKS-EL710-LLAVE5.           087730      
002118     MOVE WKS-SL710-DAT(6)         TO WKS-EL710-LLAVE6.           087732      
002119     MOVE WKS-SL710-NIVINI         TO WKS-EL710-NIVINI.           087734      
002120     MOVE WKS-SL710-FECINI         TO WKS-EL710-FECINI.           087736      
002121     IF W77-CAT-FORMATO = 1                                       087738      
002122        MOVE WKS-SL710-DAT(1)      TO W77-CVE                     087740      
002123        MOVE WKS-SL710-DAT(3)      TO WKS-CVE-LEYENDA(W77-CVE)    087744      
002124     ELSE                                                         087746      
002125     IF W77-CAT-FORMATO = 2                                       087747      
002126        MOVE WKS-SL710-DAT(2)      TO W77-CVE                     087748      
002127        MOVE WKS-SL710-DAT(3)      TO WKS-CVE-LEYENDA(W77-CVE)    087749      
002128     ELSE                                                         087750      
002129     IF W77-CAT-FORMATO = 4                                       087751      
002130        MOVE WKS-SL710-DAT(1)      TO W77-CVE                     087752      
002131        MOVE WKS-SL710-DAT(2)      TO WKS-CVE-LEYENDA(W77-CVE)    087753      
002132     ELSE                                                         087754      
002133     IF W77-CAT-FORMATO = 3                                       087756      
002134        MOVE WKS-SL710-DAT(1)      TO W77-CVE                     087758      
002135        MOVE WKS-SL710-DAT(2)      TO W77-TM                      087760      
002136        IF W77-TM = 1 OR 2                                        087761      
002137         MOVE WKS-SL710-DAT(3)  TO WKS-CVE-LEY-MC(W77-TM,W77-CVE) 087762      
002138        ELSE                                                      087763      
002139         MOVE ZERO              TO WKS-CVE-LEY-MC(1,W77-CVE)      087764      
002140                                   WKS-CVE-LEY-MC(2,W77-CVE).     087765      
002141     PERFORM 10150-LLAMA-L710.                                    087766      
002142                                                                  087767      
002143 10120-CARGA-LEYENDAS.                                            087768      
002144*=====================                                            087769      
002145     MOVE 523                      TO WKS-EL710-CAT.              087770      
002146                                                                  087771      
002147     IF WKS-SISTEMA-F4                                            087772      
002148        MOVE 1059                  TO WKS-EL710-CAT.              087773      
002149     MOVE 2                        TO WKS-EL710-BUSQUEDA.         087774      
002150     MOVE W77-SISTEMA-PARAM        TO WKS-EL710-LLAVE1.           087775      
002151     IF W77-SISTEMA-PARAM = 804 OR 404 OR 707 OR 203              087776      
002152        MOVE WKS-SISTEMA           TO WKS-EL710-LLAVE1.           087777      
002153     MOVE 5                        TO WKS-EL710-LLAVE2.           087778      
002154     MOVE 151                      TO W77-L710-SISTEMA.           087780      
002155     MOVE 104                      TO W77-L710-PROGRAMA.          087782      
002156     MOVE 20                       TO WKS-EL710-CLAVE.            087784      
002157     MOVE 1                        TO WKS-EL710-REGISTROS.        087786      
002158     MOVE ZERO                     TO WKS-EL710-LLAVE3            087788      
002159                                      WKS-EL710-LLAVE4            087790      
002160                                      WKS-EL710-LLAVE5            087792      
002161                                      WKS-EL710-LLAVE6            087794      
002162                                      WKS-EL710-FECINI            087796      
002163                                      WKS-EL710-NIVINI            087798      
002164                                      WKS-EL710-FEC-VIG.          087800      
002165     PERFORM 10150-LLAMA-L710.                                    087802      
002166     MOVE WKS-SL710-DAT(4)         TO W77-CAT-NUMCAT.             087804      
002167     MOVE WKS-SL710-DAT(5)         TO W77-CAT-FORMATO.            087806      
002168     IF W77-CAT-FORMATO = 1                                       087808      
002169        MOVE 174                   TO WKS-EL700-CAT               087810      
002170        MOVE 2                     TO WKS-EL700-BUSQUEDA          087812      
002171        MOVE W77-SISTEMA-PARAM     TO WKS-EL700-REGASO            087814      
002172     ELSE                                                         087816      
002173        MOVE W77-CAT-NUMCAT        TO WKS-EL700-CAT               087818      
002174        MOVE 1                     TO WKS-EL700-BUSQUEDA.         087820      
002175                                                                  087822      
002176     MOVE ZERO                     TO W77-EOF.                    087824      
002177     MOVE 151                      TO W77-L700-SISTEMA.           087826      
002178     MOVE 104                      TO W77-L700-PROGRAMA.          087828      
002179     MOVE 20                       TO WKS-EL700-CLAVE.            087830      
002180     MOVE 1                        TO WKS-EL700-REGISTROS.        087832      
002181     MOVE 0                        TO WKS-EL700-NIVINI.           087834      
002182     MOVE 0                        TO WKS-EL700-FECINI.           087836      
002183     PERFORM 10160-LLAMA-L700.                                    087838      
002184     IF W77-L700-RESULT = 0 OR 1                                  087840      
002185        PERFORM 10122-LEYENDAS     UNTIL W77-EOF = 1 OR           087842      
002186                                         W77-L700-RESULT > 1      087844      
002187     ELSE                                                         087846      
002188        MOVE W77-L710-RESULT       TO W77-ERROR                   087848      
002189        MOVE "E"                   TO TIPO-LJ                     087850      
002190        MOVE 020202                TO CODIGO-LJ                   087852      
002191        STRING "ERROR EN CATALOGO DESCRIPTIVO # "                 087854      
002192               W77-CAT-NUMCAT                                     087856      
002193               " ERR. NO. " W77-ERROR                             087858      
002194        DELIMITED BY SIZE INTO TEXTO-LJ                           087860      
002195        CALL "LJ IN LIB-DISP"      USING CONTADOR-LJ,             087862      
002196                                         MENSAJE-LJ.              087864      
002197                                                                  087866      
002198 10122-LEYENDAS.                                                  087868      
002199*===============                                                  087870      
002200     IF WKS-SL700-CVEREG < 10001                                  087872      
002201        MOVE WKS-SL700-CVEREG      TO WKS-EL700-CVEREG            087874      
002202        MOVE WKS-SL700-REGASO      TO WKS-EL700-REGASO            087876      
002203        MOVE WKS-SL700-CVEREG      TO W77-IND2                    087878      
002204        MOVE WKS-SL700-NIVINI      TO WKS-EL700-NIVINI            087880      
002205        MOVE WKS-SL700-FECINI      TO WKS-EL700-FECINI            087882      
002206        PERFORM 10200-MUEVE-LEYENDA                               087884      
002207     ELSE                                                         087886      
002208        MOVE 1                     TO W77-EOF.                    087888      
002209     PERFORM 10160-LLAMA-L700.                                    087890      
002210                                                                  087892      
002211 10150-LLAMA-L710.                                                087894      
002212*=================                                                087896      
002213     CALL  "L710_CONSUL_DETALLE IN CATALOGOS"                     087898      
002214     USING  W77-L710-SISTEMA ,                                    087900      
002215            W77-L710-PROGRAMA,                                    087902      
002216            WKS-L710-ENT     ,                                    087904      
002217            WKS-L710-SAL     ,                                    087906      
002218     GIVING W77-L710-RESULT.                                      087908      
002219                                                                  087910      
002220 10160-LLAMA-L700.                                                087912      
002221*=================                                                087914      
002222     CALL "L700_CONSUL_DESC IN CATALOGOS"                         087916      
002223     USING  W77-L700-SISTEMA ,                                    087918      
002224            W77-L700-PROGRAMA,                                    087920      
002225            WKS-L700-ENT     ,                                    087922      
002226            WKS-L700-SAL                                          087924      
002227     GIVING W77-L700-RESULT.                                      087926      
002228                                                                  087928      
002229                                                                  087930      
002230 10200-MUEVE-LEYENDA.                                             087932      
002231*====================                                             087934      
002232                                                                  087936      
002233     IF W77-IND2 > ZERO  AND < 10001                              087938      
002234        IF W77-IND2 > 9000                                        087940      
002235           COMPUTE W77-IND2 = W77-IND2 - 9000                     087942      
002236           MOVE WKS-SL700-TCORTO  TO                              087944      
002237                                  WS-LEY-TRAN4(W77-IND2)          087946      
002238        ELSE                                                      087948      
002239           IF W77-IND2 > 6000                                     087950      
002240              COMPUTE W77-IND2 = W77-IND2 - 6000                  087952      
002241              MOVE WKS-SL700-TCORTO  TO                           087954      
002242                                     WS-LEY-TRAN3(W77-IND2)       087956      
002243           ELSE                                                   087958      
002244              IF W77-IND2 > 3000                                  087960      
002245                 COMPUTE W77-IND2 = W77-IND2 - 3000               087962      
002246                 MOVE WKS-SL700-TCORTO  TO                        087964      
002247                                        WS-LEY-TRAN2(W77-IND2)    087966      
002248              ELSE                                                087968      
002249                 MOVE WKS-SL700-TCORTO  TO                        087970      
002250                                        WS-LEY-TRAN1(W77-IND2).   087972      
002251                                                                  087974      
002252******************************************************************087980      
002253*           SORTEA ARCHIVOS DEL SNNN Y DEL S151                  *087985      
002254*               A NIVEL DE TOTALES POR CLAVE                     *087990      
002255******************************************************************088000      
002256                                                                  088050      
002257 20000-SORTEA-ARCHIVOS-TOTXCVE.                                   088100      
002258*==============================                                   088200      
002259     PERFORM 20010-GENERA-ARCHIVO1.                               088210      
002260     OPEN INPUT A00-SPUNTEO1                                      088215      
002261     COMPUTE W77-FRAMESIZE        =                               088220      
002262            (ATTRIBUTE FRAMESIZE  OF A00-SPUNTEO1)                088225      
002263     COMPUTE W77-MAXRECSIZE       =                               088230      
002264            (ATTRIBUTE MAXRECSIZE OF A00-SPUNTEO1)                088235      
002265     COMPUTE W77-LASTRECORD       =                               088240      
002266            (ATTRIBUTE LASTRECORD OF A00-SPUNTEO1                 088245      
002267                                  +   1)                          088250      
002268     CLOSE A00-SPUNTEO1 SAVE                                      088255      
002269     PERFORM                      70000-CALCULA-ESPACIO           088260      
002270     SORT SCVETRAN                                                088300      
002271          ON ASCENDING KEY                                        088400      
002272             S00-PUN-CVEREG                                       088500      
002273             S00-PUN-LIBRO                                        088600      
002274             S00-PUN-MONEDA                                       088700      
002275             S00-PUN-PRODUCTO                                     088800      
002276             S00-PUN-INST                                         088900      
002277             S00-PUN-CVETRA                                       089000      
002278             S00-PUN-TM                                           089100      
002279          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    089200      
002280          DISK   SIZE IS W77-DISK-SIZE   WORDS                    089300      
002281          USING  A00-SPUNTEO1                                     089400      
002282          GIVING A00-SPUNTEO1.                                    089500      
002283     PERFORM 20050-GENERA-ARCHIVO2.                               089600      
002284     OPEN INPUT A00-SPUNTEO2                                      089605      
002285     COMPUTE W77-FRAMESIZE        =                               089610      
002286            (ATTRIBUTE FRAMESIZE  OF A00-SPUNTEO2)                089615      
002287     COMPUTE W77-MAXRECSIZE       =                               089620      
002288            (ATTRIBUTE MAXRECSIZE OF A00-SPUNTEO2)                089625      
002289     COMPUTE W77-LASTRECORD       =                               089630      
002290            (ATTRIBUTE LASTRECORD OF A00-SPUNTEO2                 089635      
002291                                  +   1)                          089640      
002292     CLOSE A00-SPUNTEO2 SAVE                                      089645      
002293     PERFORM                      70000-CALCULA-ESPACIO           089650      
002294     SORT SCVETRAN                                                089700      
002295          ON ASCENDING KEY                                        089800      
002296             S00-PUN-CVEREG                                       089900      
002297             S00-PUN-LIBRO                                        090000      
002298             S00-PUN-MONEDA                                       090100      
002299             S00-PUN-PRODUCTO                                     090200      
002300             S00-PUN-INST                                         090300      
002301             S00-PUN-CVETRA                                       090400      
002302             S00-PUN-TM                                           090500      
002303          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    090600      
002304          DISK   SIZE IS W77-DISK-SIZE   WORDS                    090700      
002305          USING  A00-SPUNTEO2                                     090800      
002306          GIVING A00-SPUNTEO2.                                    090900      
002307                                                                  090902      
002308 20010-GENERA-ARCHIVO1.                                           090904      
002309*======================                                           090906      
002310     MOVE ZERO                     TO W77-FIN-PUNTEO.             090908      
002311     OPEN INPUT  CVETRAN     .                                    090910      
002312     OPEN OUTPUT A00-SPUNTEO1.                                    090912      
002313     READ CVETRAN INTO A00-R01-PUN-DETALLE                        090914      
002314                  AT END MOVE 1    TO W77-FIN-PUNTEO.             090916      
002315     PERFORM 20020-ARCHIVO-1       UNTIL W77-FIN-PUNTEO = 1.      090918      
002316     CLOSE CVETRAN      WITH RELEASE                              090920      
002317           A00-SPUNTEO1 WITH SAVE.                                090921      
002318 20020-ARCHIVO-1.                                                 090922      
002319*================                                                 090924      
002320     IF A00-R01-PUN-CVEREG = 2                                    090926      
002321        WRITE A00-R00-SPUNTEO1     FROM A00-R01-PUN-DETALLE.      090928      
002322     READ CVETRAN INTO A00-R01-PUN-DETALLE                        090930      
002323                  AT END MOVE 1    TO W77-FIN-PUNTEO.             090932      
002324                                                                  090940      
002325 20050-GENERA-ARCHIVO2.                                           090944      
002326*======================                                           090946      
002327     MOVE ZERO                     TO W77-FIN-PUNTEO.             090948      
002328     OPEN INPUT  CVETRANS151 .                                    090950      
002329     OPEN OUTPUT A00-SPUNTEO2.                                    090952      
002330     READ CVETRANS151 INTO A00-R01-PUN-DETALLE                    090954      
002331                      AT END MOVE 1    TO W77-FIN-PUNTEO.         090956      
002332     PERFORM 20020-ARCHIVO-2       UNTIL W77-FIN-PUNTEO = 1.      090958      
002333     CLOSE CVETRANS151  WITH RELEASE                              090959      
002334           A00-SPUNTEO2 WITH SAVE.                                090960      
002335                                                                  090961      
002336 20020-ARCHIVO-2.                                                 090962      
002337*================                                                 090964      
002338     IF A00-R01-PUN-CVEREG = 2                                    090966      
002339        WRITE A00-R00-SPUNTEO2     FROM A00-R01-PUN-DETALLE.      090968      
002340     READ CVETRANS151 INTO A00-R01-PUN-DETALLE                    090970      
002341                      AT END MOVE 1    TO W77-FIN-PUNTEO.         090972      
002342                                                                  091000      
002343 30000-COMPARA-TOTXCVE.                                           091100      
002344*======================                                           091200      
002345     MOVE "C"                      TO WKS-REP-TOTXCVE.            091300      
002346     IF W77-SISTEMA-PARAM = 500                                   091310      
002347        MOVE 31                    TO WKS-NUM-BACK                091320      
002348        MOVE "031TOTXCVE"          TO WLI-ENC-SUPDER              091325      
002349     ELSE                                                         091330      
002350        MOVE  1                    TO WKS-NUM-BACK                091400      
002351        MOVE "001TOTXCVE"          TO WLI-ENC-SUPDER.             091450      
002352     MOVE "TOTXCVE"                TO WKS-NOMBRE-BACK.            091500      
002353     SET V00-REP-CVES(USERBACKUPNAME)                             091600      
002354                                   TO VALUE TRUE                  091700      
002355     CHANGE ATTRIBUTE TITLE OF V00-REP-CVES TO                    091800      
002356                                   WKS-TIT-LISTOTXCVE.            091900      
002357     MOVE 56                       TO W77-NUM-LINEAS              091950      
002358     OPEN OUTPUT V00-REP-CVES,TOTCVETRAN,CVESNNNDIF,CVES151DIF.   092000      
002359                                                                  092100      
002360     OPEN INPUT A00-SPUNTEO1.                                     092200      
002361     MOVE 0 TO W77-EOF, W77-EOF2, W77-EOF3, W77-EOF4, W77-EOF5,   092300      
002362               W77-BAN-DIFSNNN, W77-BAN-DIFS151.                  092400      
002363     MOVE 1 TO W77-APUCVE, W77-RANGO1-SNNN                        092500      
002364     READ A00-SPUNTEO1  INTO A00-R01-PUN-DETALLE                  093000      
002365          AT END MOVE 1 TO W77-EOF.                               093100      
002366                                                                  093200      
002367     PERFORM 30100-LEE-ARCHSNNN.                                  093300      
002368                                                                  093400      
002369     OPEN INPUT A00-SPUNTEO2.                                     093500      
002370                                                                  093600      
002371     MOVE 1 TO W77-APUCVES151, W77-RANGO1-S151                    093700      
002372     READ A00-SPUNTEO2 INTO REG-CVETRANS151                       094200      
002373                      AT END MOVE 1 TO W77-EOF2.                  094210      
002374                                                                  094300      
002375     PERFORM 30200-LEE-ARCHS151.                                  094400      
002376                                                                  094500      
002377     IF W77-EOF = 1 AND W77-EOF2 = 1 AND                          094600      
002378        WKS-NUM-ARCHSNNN = 1         AND                          094620      
002379        WKS-NUM-ARCHS151 = 1                                      094640      
002380        MOVE 1             TO   WKS-NUM-HOJAS                     094700      
002381        MOVE WKS-NUM-HOJAS TO   WSR-RP-E3-HOJA                    094800      
002382        WRITE V00-R00-CVES FROM WLI-TIT1-ENCAB AFTER PAGE         094900      
002383        WRITE V00-R00-CVES FROM WLI-TIT2-ENCAB                    095000      
002384        WRITE V00-R00-CVES FROM WLI-TIT3-ENCAB                    095100      
002385        MOVE SPACES       TO      V00-R00-CVES                    095200      
002386        WRITE V00-R00-CVES                                        095300      
002387        MOVE "                              NO HUBO INFORMACION " 095400      
002388                          TO    V00-R00-CVES                      095500      
002389        WRITE V00-R00-CVES                                        095600      
002390     ELSE                                                         095700      
002391        PERFORM 30300-COMPARA-GLOBAL UNTIL W77-EOF3 = 1.          095800      
002392                                                                  095900      
002393     CLOSE V00-REP-CVES WITH SAVE.                                096000      
002394     CLOSE TOTCVETRAN   WITH SAVE.                                096100      
002395     CLOSE CVESNNNDIF   WITH SAVE.                                096200      
002396     CLOSE CVES151DIF   WITH SAVE.                                096300      
002397                                                                  096400      
002398 30100-LEE-ARCHSNNN.                                              096500      
002399*===================                                              096600      
002400     MOVE 0                       TO      WKS-NUM-ARCHSNNN,       096700      
002401                                          WKS-IMP-ARCHSNNN.       096800      
002402     MOVE A00-R01-PUN-LIBRO       TO      WKS-LIB-SNNN            096900      
002403     MOVE A00-R01-PUN-MONEDA      TO      WKS-MON-SNNN            097000      
002404     MOVE A00-R01-PUN-PRODUCTO    TO      WKS-PRO-SNNN            097100      
002405     MOVE A00-R01-PUN-INST        TO      WKS-INS-SNNN            097200      
002406     MOVE A00-R01-PUN-CVETRA      TO      WKS-CVE-SNNN            097300      
002407     MOVE A00-R01-PUN-TM          TO      WKS-TM-SNNN             097400      
002408                                                                  097500      
002409     PERFORM 30150-SUMA-ARCHSNNN  UNTIL                           097600      
002410             A00-R01-PUN-LIBRO    NOT =   WKS-LIB-SNNN OR         097700      
002411             A00-R01-PUN-MONEDA   NOT =   WKS-MON-SNNN OR         097800      
002412             A00-R01-PUN-PRODUCTO NOT =   WKS-PRO-SNNN OR         097900      
002413             A00-R01-PUN-INST     NOT =   WKS-INS-SNNN OR         098000      
002414             A00-R01-PUN-CVETRA   NOT =   WKS-CVE-SNNN OR         098100      
002415             A00-R01-PUN-TM       NOT =   WKS-TM-SNNN  OR         098200      
002416             W77-EOF              =       1.                      098300      
002417                                                                  098400      
002418 30150-SUMA-ARCHSNNN.                                             098500      
002419*====================                                             098600      
002420     ADD 1                        TO      WKS-NUM-ARCHSNNN        098700      
002421     ADD A00-R01-PUN-IMPORTE      TO      WKS-IMP-ARCHSNNN        098800      
002422                                                                  098900      
002423     ADD  1 TO W77-APUCVE                                         099000      
002424     READ A00-SPUNTEO1 INTO A00-R01-PUN-DETALLE                   099100      
002425          AT END MOVE 1 TO W77-EOF.                               099200      
002426                                                                  099300      
002427 30200-LEE-ARCHS151.                                              099400      
002428*===================                                              099500      
002429     MOVE 0                       TO      WKS-NUM-ARCHS151,       099600      
002430                                          WKS-IMP-ARCHS151.       099700      
002431     MOVE R00-S151-LIBRO          TO      WKS-LIB-S151            099800      
002432     MOVE R00-S151-MONEDA         TO      WKS-MON-S151            099900      
002433     MOVE R00-S151-PRODUCTO       TO      WKS-PRO-S151            100000      
002434     MOVE R00-S151-INST           TO      WKS-INS-S151            100100      
002435     MOVE R00-S151-CVETRA         TO      WKS-CVE-S151            100200      
002436     MOVE R00-S151-TM             TO      WKS-TM-S151             100300      
002437                                                                  100400      
002438     PERFORM 30250-SUMA-ARCHS151  UNTIL                           100500      
002439             R00-S151-LIBRO       NOT =   WKS-LIB-S151 OR         100600      
002440             R00-S151-MONEDA      NOT =   WKS-MON-S151 OR         100700      
002441             R00-S151-PRODUCTO    NOT =   WKS-PRO-S151 OR         100800      
002442             R00-S151-INST        NOT =   WKS-INS-S151 OR         100900      
002443             R00-S151-CVETRA      NOT =   WKS-CVE-S151 OR         101000      
002444             R00-S151-TM          NOT =   WKS-TM-S151  OR         101100      
002445             W77-EOF2             =       1.                      101200      
002446                                                                  101300      
002447 30250-SUMA-ARCHS151.                                             101400      
002448*====================                                             101500      
002449     ADD 1                        TO      WKS-NUM-ARCHS151        101600      
002450     ADD R00-S151-IMPORTE         TO      WKS-IMP-ARCHS151        101700      
002451                                                                  101800      
002452     ADD  1 TO W77-APUCVES151                                     101900      
002453     READ A00-SPUNTEO2 INTO REG-CVETRANS151                       102000      
002454                       AT END MOVE 1 TO W77-EOF2.                 102010      
002455                                                                  102100      
002456                                                                  102200      
002457 30300-COMPARA-GLOBAL.                                            102300      
002458*=====================                                            102400      
002459     IF W77-EOF = 1 AND W77-EOF2 = 1                              102500      
002460        MOVE 1 TO W77-EOF3.                                       102600      
002461                                                                  102700      
002462     MOVE 0 TO W77-DET1,W77-DET2,W77-DET3,W77-DET4                102800      
002463                                                                  102900      
002464     IF WKS-LLAVE-SNNN = WKS-LLAVE-S151                           104200      
002465        IF WKS-IMP-ARCHSNNN = WKS-IMP-ARCHS151                    104300      
002466           MOVE 1 TO W77-DET1                                     104400      
002467           PERFORM 30400-IMPRIME-TOTXCVE                          104500      
002468           MOVE W77-APUCVE     TO W77-RANGO1-SNNN                 104600      
002469           MOVE W77-APUCVES151 TO W77-RANGO1-S151                 104700      
002470           PERFORM 30100-LEE-ARCHSNNN                             104800      
002471           PERFORM 30200-LEE-ARCHS151                             104900      
002472        ELSE                                                      105000      
002473           MOVE 1 TO W77-DET2                                     105100      
002474           PERFORM 30400-IMPRIME-TOTXCVE                          105200      
002475           PERFORM 30600-GRABA-DIFSNNN                            105300      
002476           PERFORM 30800-GRABA-DIFS151                            105400      
002477           PERFORM 30100-LEE-ARCHSNNN                             105500      
002478           PERFORM 30200-LEE-ARCHS151                             105600      
002479     ELSE                                                         105700      
002480        IF WKS-LLAVE-SNNN > WKS-LLAVE-S151                        105800      
002481           IF W77-EOF2 = 1                                        105802      
002482              MOVE 1 TO W77-DET4                                  105804      
002483              PERFORM 30400-IMPRIME-TOTXCVE                       105806      
002484              PERFORM 30600-GRABA-DIFSNNN                         105808      
002485              PERFORM 30100-LEE-ARCHSNNN                          105810      
002486           ELSE                                                   105812      
002487              MOVE 1 TO W77-DET3                                  105820      
002488              PERFORM 30400-IMPRIME-TOTXCVE                       105840      
002489              PERFORM 30800-GRABA-DIFS151                         105860      
002490              PERFORM 30200-LEE-ARCHS151                          105880      
002491        ELSE                                                      106300      
002492           IF W77-EOF = 1                                         106310      
002493              MOVE 1 TO W77-DET3                                  106320      
002494              PERFORM 30400-IMPRIME-TOTXCVE                       106330      
002495              PERFORM 30800-GRABA-DIFS151                         106340      
002496              PERFORM 30200-LEE-ARCHS151                          106350      
002497           ELSE                                                   106360      
002498              MOVE 1 TO W77-DET4                                  106400      
002499              PERFORM 30400-IMPRIME-TOTXCVE                       106500      
002500              PERFORM 30600-GRABA-DIFSNNN                         106600      
002501              PERFORM 30100-LEE-ARCHSNNN.                         106700      
002502                                                                  106800      
002503 30400-IMPRIME-TOTXCVE.                                           106900      
002504*======================                                           107000      
002505                                                                  107100      
002506     IF W77-NUM-LINEAS > 53                                       107200      
002507        PERFORM 36300-IMP-ENCABEZADO.                             107300      
002508                                                                  107400      
002509     IF W77-DET1 = 1                                              107500      
002510        MOVE "=   "       TO      WLI-TOT-CONCEPTO                107600      
002511        MOVE "= "         TO      WKS-TOT-CONCEPTO                107650      
002512        MOVE WKS-LIB-SNNN TO      WLI-TOT-LIBRO,  WKS-TOT-LIBRO   107700      
002513        MOVE WKS-PRO-SNNN TO      WLI-TOT-PROD,   WKS-TOT-PROD    107800      
002514        MOVE WKS-INS-SNNN TO      WLI-TOT-INST,   WKS-TOT-INST    107900      
002515        MOVE WKS-MON-SNNN TO      WLI-TOT-MON,    WKS-TOT-MON     108000      
002516        MOVE WKS-CVE-SNNN TO      WLI-TOT-CVETRA, WKS-TOT-CVETRA  108100      
002517                                  W77-CVE                         108110      
002518        MOVE WKS-TM-SNNN  TO      WLI-TOT-TMSNNN, WKS-TOT-TMSNNN  108112      
002519                                  W77-TM                          108114      
002520        PERFORM 30500-LEY-TOT-TRAN                                108120      
002521        MOVE WKS-NUM-ARCHSNNN TO WLI-TOT-MOVSNNN,WKS-TOT-MOVSNNN  108300      
002522        MOVE WKS-IMP-ARCHSNNN TO WLI-TOT-IMPSNNN,WKS-TOT-IMPSNNN  108400      
002523        MOVE WKS-NUM-ARCHS151 TO WLI-TOT-MOVS151,WKS-TOT-MOVS151  108500      
002524        MOVE WKS-IMP-ARCHS151 TO WLI-TOT-IMPS151,WKS-TOT-IMPS151  108600      
002525     ELSE                                                         108700      
002526     IF W77-DET2 = 1                                              108800      
002527        MOVE "*<>*"       TO      WLI-TOT-CONCEPTO                108900      
002528        MOVE "<>"         TO      WKS-TOT-CONCEPTO                108950      
002529        MOVE WKS-LIB-SNNN TO      WLI-TOT-LIBRO,  WKS-TOT-LIBRO   109000      
002530        MOVE WKS-PRO-SNNN TO      WLI-TOT-PROD,   WKS-TOT-PROD    109100      
002531        MOVE WKS-INS-SNNN TO      WLI-TOT-INST,   WKS-TOT-INST    109200      
002532        MOVE WKS-MON-SNNN TO      WLI-TOT-MON,    WKS-TOT-MON     109300      
002533        MOVE WKS-CVE-SNNN TO      WLI-TOT-CVETRA, WKS-TOT-CVETRA  109400      
002534                                  W77-CVE                         109410      
002535        MOVE WKS-TM-SNNN  TO      WLI-TOT-TMSNNN, WKS-TOT-TMSNNN  109412      
002536                                  W77-TM                          109414      
002537        PERFORM 30500-LEY-TOT-TRAN                                109420      
002538        MOVE WKS-NUM-ARCHSNNN TO WLI-TOT-MOVSNNN,WKS-TOT-MOVSNNN  109600      
002539        MOVE WKS-IMP-ARCHSNNN TO WLI-TOT-IMPSNNN,WKS-TOT-IMPSNNN  109700      
002540        MOVE WKS-NUM-ARCHS151 TO WLI-TOT-MOVS151,WKS-TOT-MOVS151  109800      
002541        MOVE WKS-IMP-ARCHS151 TO WLI-TOT-IMPS151,WKS-TOT-IMPS151  109900      
002542     ELSE                                                         110000      
002543     IF W77-DET3 = 1                                              110100      
002544        MOVE "*<>*"       TO      WLI-TOT-CONCEPTO                110200      
002545        MOVE "<>"         TO      WKS-TOT-CONCEPTO                110250      
002546        MOVE WKS-LIB-S151 TO      WLI-TOT-LIBRO,  WKS-TOT-LIBRO   110300      
002547        MOVE WKS-PRO-S151 TO      WLI-TOT-PROD,   WKS-TOT-PROD    110400      
002548        MOVE WKS-INS-S151 TO      WLI-TOT-INST,   WKS-TOT-INST    110500      
002549        MOVE WKS-MON-S151 TO      WLI-TOT-MON,    WKS-TOT-MON     110600      
002550        MOVE WKS-CVE-S151 TO      WLI-TOT-CVETRA, WKS-TOT-CVETRA  110700      
002551                                  W77-CVE                         110710      
002552        MOVE WKS-TM-S151  TO      WLI-TOT-TMSNNN, WKS-TOT-TMSNNN  110712      
002553                                  W77-TM                          110714      
002554        PERFORM 30500-LEY-TOT-TRAN                                110720      
002555        MOVE 0                TO WLI-TOT-MOVSNNN,WKS-TOT-MOVSNNN  110900      
002556        MOVE 0                TO WLI-TOT-IMPSNNN,WKS-TOT-IMPSNNN  111000      
002557        MOVE WKS-NUM-ARCHS151 TO WLI-TOT-MOVS151,WKS-TOT-MOVS151  111100      
002558        MOVE WKS-IMP-ARCHS151 TO WLI-TOT-IMPS151,WKS-TOT-IMPS151  111200      
002559     ELSE                                                         111300      
002560     IF W77-DET4 = 1                                              111400      
002561        MOVE "*<>*"       TO      WLI-TOT-CONCEPTO                111500      
002562        MOVE "<>"         TO      WKS-TOT-CONCEPTO                111550      
002563        MOVE WKS-LIB-SNNN TO      WLI-TOT-LIBRO,  WKS-TOT-LIBRO   111600      
002564        MOVE WKS-PRO-SNNN TO      WLI-TOT-PROD,   WKS-TOT-PROD    111700      
002565        MOVE WKS-INS-SNNN TO      WLI-TOT-INST,   WKS-TOT-INST    111800      
002566        MOVE WKS-MON-SNNN TO      WLI-TOT-MON,    WKS-TOT-MON     111900      
002567        MOVE WKS-CVE-SNNN TO      WLI-TOT-CVETRA, WKS-TOT-CVETRA  112000      
002568                                  W77-CVE                         112010      
002569        MOVE WKS-TM-SNNN  TO      WLI-TOT-TMSNNN, WKS-TOT-TMSNNN  112012      
002570                                  W77-TM                          112014      
002571        PERFORM 30500-LEY-TOT-TRAN                                112020      
002572        MOVE WKS-NUM-ARCHSNNN TO WLI-TOT-MOVSNNN,WKS-TOT-MOVSNNN  112200      
002573        MOVE WKS-IMP-ARCHSNNN TO WLI-TOT-IMPSNNN,WKS-TOT-IMPSNNN  112300      
002574        MOVE 0                TO WLI-TOT-MOVS151,WKS-TOT-MOVS151  112400      
002575        MOVE 0                TO WLI-TOT-IMPS151,WKS-TOT-IMPS151. 112500      
002576                                                                  112600      
002577     WRITE V00-R00-CVES   FROM WLI-REP-TOTCVES.                   112700      
002578     WRITE REG-TOTCVETRAN FROM WKS-ARCH-TOTCVES.                  112800      
002579     ADD 1 TO W77-NUM-LINEAS.                                     112900      
002580                                                                  113000      
002581 30500-LEY-TOT-TRAN.                                              113010      
002582*===================                                              113012      
002583     IF W77-CVE = 0                                               113014      
002584        MOVE "CLAVE TRANSACCION INVALIDA" TO WLI-TOT-LEY          113016      
002585     ELSE                                                         113018      
002586        IF W77-CAT-FORMATO = 1 OR 2 OR 4                          113020      
002587           IF WKS-CVE-LEYENDA(W77-CVE) = 0                        113032      
002588              MOVE "CLAVE LEYENDA INVALIDA"  TO WLI-TOT-LEY       113034      
002589           ELSE                                                   113036      
002590              MOVE WKS-CVE-LEYENDA(W77-CVE)  TO W77-IND2          113038      
002591              IF W77-IND2 > 9000                                  113039      
002592                 COMPUTE W77-IND2 = W77-IND2 - 9000               113040      
002593                 MOVE WS-LEY-TRAN4(W77-IND2) TO WLI-TOT-LEY       113041      
002594              ELSE                                                113042      
002595                 IF W77-IND2 > 6000                               113043      
002596                    COMPUTE W77-IND2 = W77-IND2 - 6000            113044      
002597                    MOVE WS-LEY-TRAN3(W77-IND2) TO WLI-TOT-LEY    113045      
002598                 ELSE                                             113046      
002599                    IF W77-IND2 > 3000                            113047      
002600                       COMPUTE W77-IND2 = W77-IND2 - 3000         113048      
002601                       MOVE WS-LEY-TRAN2(W77-IND2) TO WLI-TOT-LEY 113049      
002602                    ELSE                                          113050      
002603                       MOVE WS-LEY-TRAN1(W77-IND2) TO WLI-TOT-LEY 113051      
002604        ELSE                                                      113052      
002605           IF W77-CAT-FORMATO = 3 AND (W77-TM = 1 OR 2)           113054      
002606              IF WKS-CVE-LEY-MC(W77-TM,W77-CVE) = 0               113055      
002607                 MOVE "CLAVE LEYENDA INVALIDA"  TO WLI-TOT-LEY    113056      
002608              ELSE                                                113058      
002609                MOVE WKS-CVE-LEY-MC(W77-TM,W77-CVE) TO W77-IND2   113060      
002610                IF W77-IND2 > 9000                                113064      
002611                   COMPUTE W77-IND2 = W77-IND2 - 9000             113065      
002612                   MOVE WS-LEY-TRAN4(W77-IND2)  TO WLI-TOT-LEY    113066      
002613                ELSE                                              113067      
002614                   IF W77-IND2 > 6000                             113068      
002615                      COMPUTE W77-IND2 = W77-IND2 - 6000          113069      
002616                      MOVE WS-LEY-TRAN3(W77-IND2) TO WLI-TOT-LEY  113070      
002617                   ELSE                                           113071      
002618                      IF W77-IND2 > 3000                          113072      
002619                        COMPUTE W77-IND2 = W77-IND2 - 3000        113073      
002620                        MOVE WS-LEY-TRAN2(W77-IND2) TO WLI-TOT-LEY113074      
002621                      ELSE                                        113075      
002622                        MOVE WS-LEY-TRAN1(W77-IND2) TO WLI-TOT-LEY113076      
002623           ELSE                                                   113077      
002624                 MOVE "LEYENDA INVALIDA (TM)"  TO WLI-TOT-LEY.    113078      
002625                                                                  113079      
002626 36300-IMP-ENCABEZADO.                                            113100      
002627*=====================                                            113200      
002628    ADD  1                TO       WKS-NUM-HOJAS                  113300      
002629    MOVE WKS-NUM-HOJAS    TO       WSR-RP-E3-HOJA                 113400      
002630    WRITE V00-R00-CVES    FROM     WLI-TIT1-ENCAB  AFTER PAGE.    113500      
002631    WRITE V00-R00-CVES    FROM     WLI-TIT2-ENCAB                 113600      
002632    WRITE V00-R00-CVES    FROM     WLI-TIT3-ENCAB                 113700      
002633    MOVE SPACES           TO       V00-R00-CVES                   113800      
002634    WRITE V00-R00-CVES                                            113900      
002635    WRITE V00-R00-CVES    FROM     WLI-TIT5-CVES                  114000      
002636    MOVE SPACES           TO       V00-R00-CVES                   114100      
002637    WRITE V00-R00-CVES                                            114200      
002638    WRITE V00-R00-CVES    FROM     WLI-TIT6-CVES.                 114300      
002639    MOVE SPACES           TO       V00-R00-CVES                   114400      
002640    WRITE V00-R00-CVES.                                           114500      
002641    MOVE 8 TO W77-NUM-LINEAS.                                     114600      
002642                                                                  114700      
002643 30600-GRABA-DIFSNNN.                                             114800      
002644*====================                                             114900      
002645     MOVE 1               TO W77-BAN-DIFSNNN.                     115000      
002646     COMPUTE W77-RANGO2-SNNN = W77-APUCVE - 1                     115100      
002647*     COMPUTE W77-LLAVE-PUN1 = W77-RANGO1-SNNN - 1.               115200      
002648     MOVE W77-RANGO1-SNNN TO W77-LLAVE-PUN1.                      115210      
002649     SEEK A00-SPUNTEO1 RECORD.                                    115300      
002650     PERFORM 30700-GRABA-DIFSNNN2 VARYING W77-APUCVE              115400      
002651             FROM W77-RANGO1-SNNN BY 1 UNTIL                      115500      
002652             W77-APUCVE > W77-RANGO2-SNNN.                        115550      
002653*             W77-APUCVE > W77-RANGO2-SNNN OR                     115600      
002654*             W77-EOF = 1.                                        115700      
002655     IF W77-EOF = 0                                               115710      
002656        MOVE W77-APUCVE      TO W77-RANGO1-SNNN                   115800      
002657        READ A00-SPUNTEO1    INTO A00-R01-PUN-DETALLE             115900      
002658             AT END MOVE 1   TO W77-EOF.                          116000      
002659                                                                  116100      
002660 30700-GRABA-DIFSNNN2.                                            116200      
002661*====================                                             116300      
002662     READ A00-SPUNTEO1  INTO A00-R01-PUN-DETALLE                  116400      
002663          AT END MOVE 1 TO W77-EOF.                               116500      
002664                                                                  116505      
002665     MOVE A00-R01-PUN-CAJAINI     TO   R01-SNNN-CAJAINI.          116600      
002666     IF W77-EOF = 0 OR 1                                          116700      
002667        MOVE A00-R01-PUN-LIBRO    TO      R01-SNNN-LIBRO          116800      
002668        MOVE A00-R01-PUN-CONTRATO TO      R01-SNNN-CONTRATO       116900      
002669        MOVE A00-R01-PUN-MONEDA   TO      R01-SNNN-MONEDA         117000      
002670        MOVE A00-R01-PUN-PRODUCTO TO      R01-SNNN-PRODUCTO       117100      
002671        MOVE A00-R01-PUN-INST     TO      R01-SNNN-INST           117200      
002672        MOVE A00-R01-PUN-CVETRA   TO      R01-SNNN-CVETRA         117300      
002673        MOVE A00-R01-PUN-TM       TO      R01-SNNN-TM             117400      
002674        MOVE A00-R01-PUN-IMPORTE  TO      R01-SNNN-IMPORTE        117500      
002675        MOVE A00-R01-PUN-AUTS151  TO      R01-SNNN-AUTS151        117600      
002676        MOVE A00-R01-PUN-AUTAPL   TO      R01-SNNN-AUTAPL         117700      
002677        MOVE A00-R01-PUN-SUCINI   TO      R01-SNNN-SUCINI         117800      
002678                                                                  118000      
002679        WRITE REG-CVESNNNDIF.                                     118100      
002680                                                                  118200      
002681 30800-GRABA-DIFS151.                                             118300      
002682*====================                                             118400      
002683     MOVE 1 TO W77-BAN-DIFS151.                                   118500      
002684     COMPUTE W77-RANGO2-S151 = W77-APUCVES151 - 1                 118600      
002685*     COMPUTE W77-LLAVE-PUN2 = W77-RANGO1-S151 - 1.               118700      
002686     MOVE W77-RANGO1-S151         TO W77-LLAVE-PUN2.              118710      
002687     SEEK A00-SPUNTEO2 RECORD.                                    118800      
002688     PERFORM 30900-GRABA-DIFS1512 VARYING W77-APUCVES151          118900      
002689             FROM W77-RANGO1-S151 BY 1 UNTIL                      119000      
002690             W77-APUCVES151 > W77-RANGO2-S151.                    119050      
002691*             W77-APUCVES151 > W77-RANGO2-S151 OR                 119100      
002692*             W77-EOF2 = 1.                                       119200      
002693     IF W77-EOF2 = 0                                              119210      
002694        MOVE W77-APUCVES151  TO W77-RANGO1-S151                   119300      
002695        READ A00-SPUNTEO2 INTO REG-CVETRANS151                    119400      
002696                          AT END MOVE 1 TO W77-EOF2.              119410      
002697                                                                  119500      
002698 30900-GRABA-DIFS1512.                                            119600      
002699*=====================                                            119700      
002700     READ A00-SPUNTEO2 INTO REG-CVETRANS151                       119800      
002701                       AT END MOVE 1 TO W77-EOF2.                 119810      
002702                                                                  119820      
002703     MOVE A00-R01-PUN-CAJAINI     TO   R01-S151-CAJAINI.          119828      
002704     IF W77-EOF2 = 0 OR 1                                         120000      
002705        MOVE R00-S151-LIBRO       TO      R01-S151-LIBRO          120100      
002706        MOVE R00-S151-CONTRATO    TO      R01-S151-CONTRATO       120200      
002707        MOVE R00-S151-MONEDA      TO      R01-S151-MONEDA         120300      
002708        MOVE R00-S151-PRODUCTO    TO      R01-S151-PRODUCTO       120400      
002709        MOVE R00-S151-INST        TO      R01-S151-INST           120500      
002710        MOVE R00-S151-CVETRA      TO      R01-S151-CVETRA         120600      
002711        MOVE R00-S151-TM          TO      R01-S151-TM             120700      
002712        MOVE R00-S151-IMPORTE     TO      R01-S151-IMPORTE        120800      
002713        MOVE R00-S151-AUTS151     TO      R01-S151-AUTS151        120900      
002714        MOVE R00-S151-AUTAPL      TO      R01-S151-AUTAPL         121000      
002715        MOVE R00-S151-SUCINI      TO      R01-S151-SUCINI         121100      
002716                                                                  121300      
002717        WRITE REG-CVES151DIF.                                     121400      
002718                                                                  121500      
002719 40000-SORTEA-ARCHIVO-CONTRATO.                                   121600      
002720*==============================                                   121700      
002721     OPEN INPUT CVESNNNDIF                                        121705      
002722     COMPUTE W77-FRAMESIZE        =                               121710      
002723            (ATTRIBUTE FRAMESIZE  OF CVESNNNDIF)                  121715      
002724     COMPUTE W77-MAXRECSIZE       =                               121720      
002725            (ATTRIBUTE MAXRECSIZE OF CVESNNNDIF)                  121725      
002726     COMPUTE W77-LASTRECORD       =                               121730      
002727            (ATTRIBUTE LASTRECORD OF CVESNNNDIF                   121735      
002728                                  +   1)                          121740      
002729     CLOSE CVESNNNDIF SAVE                                        121745      
002730     PERFORM                      70000-CALCULA-ESPACIO           121750      
002731     SORT SCVEDIF                                                 121800      
002732          ON ASCENDING KEY                                        121900      
002733          S02-LLAVE-REGSNNN                                       122000      
002734          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    122100      
002735          DISK   SIZE IS W77-DISK-SIZE   WORDS                    122200      
002736          USING  CVESNNNDIF                                       122300      
002737          GIVING CVESNNNDIF.                                      122400      
002738     OPEN INPUT CVES151DIF                                        122500      
002739     COMPUTE W77-FRAMESIZE        =                               122510      
002740            (ATTRIBUTE FRAMESIZE  OF CVES151DIF)                  122520      
002741     COMPUTE W77-MAXRECSIZE       =                               122530      
002742            (ATTRIBUTE MAXRECSIZE OF CVES151DIF)                  122540      
002743     COMPUTE W77-LASTRECORD       =                               122550      
002744            (ATTRIBUTE LASTRECORD OF CVES151DIF                   122560      
002745                                  +   1)                          122570      
002746     CLOSE CVES151DIF SAVE                                        122580      
002747     PERFORM                      70000-CALCULA-ESPACIO           122590      
002748     SORT SCVEDIF                                                 122600      
002749          ON ASCENDING KEY                                        122700      
002750          S02-LLAVE-REGSNNN                                       122800      
002751          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    122900      
002752          DISK   SIZE IS W77-DISK-SIZE   WORDS                    123000      
002753          USING  CVES151DIF                                       123100      
002754          GIVING CVES151DIF.                                      123200      
002755                                                                  123300      
002756 50000-COMPARA-DETALLE.                                           123400      
002757*======================                                           123500      
002758     MOVE 0       TO      W77-EOF.                                123600      
002759                                                                  123700      
002760     MOVE "C"                      TO WKS-REP-TOTXCVE.            123800      
002761     IF W77-SISTEMA-PARAM = 500                                   123810      
002762        MOVE 32                    TO WKS-NUM-BACK                123820      
002763        MOVE "032PUNTDET"          TO WLI-ENC-SUPDER              123825      
002764     ELSE                                                         123830      
002765        MOVE  2                    TO WKS-NUM-BACK                123900      
002766        MOVE "002PUNTDET"          TO WLI-ENC-SUPDER.             123950      
002767     MOVE "PUNTDET"                TO WKS-NOMBRE-BACK.            124000      
002768     SET V00-REP-DETCVES(USERBACKUPNAME)                          124200      
002769                                   TO VALUE TRUE                  124300      
002770     CHANGE ATTRIBUTE TITLE OF V00-REP-DETCVES TO                 124400      
002771                                   WKS-TIT-LISTOTXCVE.            124500      
002772                                                                  124600      
002773     OPEN OUTPUT V00-REP-DETCVES.                                 124700      
002774     OPEN OUTPUT DETCVETRAN.                                      124800      
002775     OPEN INPUT  CVESNNNDIF.                                      124900      
002776     OPEN INPUT  CVES151DIF.                                      125000      
002777     MOVE 0 TO W77-EOF, W77-EOF2, W77-EOF3.                       125100      
002778     MOVE 56 TO W77-NUM-LINEAS.                                   125200      
002779                                                                  125300      
002780     READ CVESNNNDIF AT END MOVE 1 TO W77-EOF.                    125400      
002781     READ CVES151DIF AT END MOVE 1 TO W77-EOF2.                   125500      
002782                                                                  125600      
002783     IF W77-BAN-DIFSNNN = 0 AND W77-BAN-DIFS151 = 0               125700      
002784        MOVE 1             TO   WKS-NUM-HOJAS                     125800      
002785        MOVE WKS-NUM-HOJAS TO   WSR-RP-E3-HOJA                    125900      
002786        WRITE V00-R00-DETCVES FROM WLI-TIT1-ENCAB AFTER PAGE      126000      
002787        WRITE V00-R00-DETCVES FROM WLI-TIT4-ENCAB                 126100      
002788        WRITE V00-R00-DETCVES FROM WLI-TIT3-ENCAB                 126200      
002789        MOVE SPACES       TO      V00-R00-DETCVES                 126300      
002790        WRITE V00-R00-DETCVES                                     126400      
002791        MOVE "                              NO HUBO INFORMACION " 126500      
002792                          TO    V00-R00-DETCVES                   126600      
002793        WRITE V00-R00-DETCVES                                     126700      
002794     ELSE                                                         126800      
002795        MOVE 0             TO   WKS-NUM-HOJAS                     126850      
002796        PERFORM 50100-COMPARA-DETALLE UNTIL W77-EOF = 1 AND       126900      
002797                                            W77-EOF2 = 1.         127000      
002798     CLOSE V00-REP-DETCVES WITH SAVE.                             127100      
002799     CLOSE DETCVETRAN      WITH SAVE.                             127200      
002800     CLOSE CVES151DIF      WITH PURGE                             127210      
002801           CVESNNNDIF      WITH PURGE.                            127220      
002802                                                                  127300      
002803 50100-COMPARA-DETALLE.                                           127400      
002804*=====================                                            127500      
002805     MOVE 0 TO W77-DET1,W77-DET2.                                 127600      
002806                                                                  127700      
002807     IF R01-LLAVE-REGSNNN = R01-LLAVE-REGS151                     128800      
002808*        PERFORM 50500-IMPRIME-PUNTEODET                          128840      
002809        PERFORM 50200-LEE-ARCHSNNNDIF                             128900      
002810        PERFORM 50300-LEE-ARCHS151DIF                             129000      
002811     ELSE                                                         129100      
002812        IF R01-LLAVE-REGSNNN > R01-LLAVE-REGS151                  129200      
002813           IF W77-EOF2 = 1                                        129210      
002814              MOVE 1 TO W77-DET2                                  129220      
002815              PERFORM 50500-IMPRIME-PUNTEODET                     129230      
002816              PERFORM 50200-LEE-ARCHSNNNDIF                       129240      
002817           ELSE                                                   129250      
002818              MOVE 1 TO W77-DET1                                  129300      
002819              PERFORM 50500-IMPRIME-PUNTEODET                     129400      
002820              PERFORM 50300-LEE-ARCHS151DIF                       129500      
002821        ELSE                                                      129600      
002822           IF W77-EOF = 1                                         129610      
002823              MOVE 1 TO W77-DET1                                  129620      
002824              PERFORM 50500-IMPRIME-PUNTEODET                     129630      
002825              PERFORM 50300-LEE-ARCHS151DIF                       129640      
002826           ELSE                                                   129650      
002827              MOVE 1 TO W77-DET2                                  129700      
002828              PERFORM 50500-IMPRIME-PUNTEODET                     129800      
002829              PERFORM 50200-LEE-ARCHSNNNDIF.                      129900      
002830                                                                  130000      
002831 50200-LEE-ARCHSNNNDIF.                                           130100      
002832*======================                                           130200      
002833     IF W77-EOF = 0                                               130300      
002834        READ CVESNNNDIF AT END MOVE 1 TO W77-EOF.                 130400      
002835                                                                  130500      
002836 50300-LEE-ARCHS151DIF.                                           130600      
002837*======================                                           130700      
002838     IF W77-EOF2 = 0                                              130800      
002839        READ CVES151DIF AT END MOVE 1 TO W77-EOF2.                130900      
002840                                                                  131000      
002841 50500-IMPRIME-PUNTEODET.                                         131100      
002842*========================                                         131200      
002843     IF W77-NUM-LINEAS > 53                                       131300      
002844        PERFORM 50600-IMP-ENCABEZADO.                             131400      
002845                                                                  131500      
002846     IF W77-DET1 = 1                                              131600      
002847        MOVE R01-S151-CONTRATO    TO WLI-DET-CONTRATO             131700      
002848                                     WKS-DET-CONTRATO             131800      
002849        MOVE R01-S151-MONEDA      TO WLI-DET-MONEDA               131900      
002850                                     WKS-DET-MONEDA               132000      
002851        MOVE R01-S151-CVETRA      TO WLI-DET-CVETRANS             132100      
002852                                     WKS-DET-CVETRANS             132200      
002853                                     W77-CVE                      132210      
002854        MOVE R01-S151-TM          TO WLI-DET-TM                   132220      
002855                                     WKS-DET-TM                   132230      
002856                                     W77-TM                       132240      
002857        PERFORM 50550-LEY-DET                                     132250      
002858        MOVE R01-S151-IMPORTE     TO WLI-DET-IMPORTE              132500      
002859                                     WKS-DET-IMPORTE              132600      
002860        MOVE "SI"                 TO WLI-DET-VER-S151             132700      
002861                                     WKS-DET-VER-S151             132800      
002862        MOVE "NO"                 TO WLI-DET-VER-SNNN             132900      
002863                                     WKS-DET-VER-SNNN             133000      
002864        MOVE R01-S151-AUTS151     TO WLI-DET-AUT-S151             133100      
002865                                     WKS-DET-AUT-S151             133200      
002866        MOVE R01-S151-AUTAPL      TO WLI-DET-AUT-APLI             133300      
002867                                     WKS-DET-AUT-APLI             133400      
002868        MOVE R01-S151-SUCINI      TO WLI-DET-SUC-TRANS            133500      
002869                                     WKS-DET-SUC-TRANS            133600      
002870        MOVE R01-S151-CAJAINI     TO WLI-DET-CAJ-TRANS            133700      
002871                                     WKS-DET-CAJ-TRANS            133800      
002872        MOVE R01-S151-PRODUCTO    TO WLI-DET-PRODUCTO             133900      
002873                                     WKS-DET-PRODUCTO             134000      
002874        MOVE R01-S151-INST        TO WLI-DET-INSTRUMENTO          134100      
002875                                     WKS-DET-INSTRUMENTO          134200      
002876        MOVE R01-S151-LIBRO       TO WLI-DET-LIBRO                134220      
002877                                     WKS-DET-LIBRO                134240      
002878     ELSE                                                         134300      
002879        MOVE R01-SNNN-CONTRATO    TO WLI-DET-CONTRATO             134400      
002880                                     WKS-DET-CONTRATO             134500      
002881        MOVE R01-SNNN-MONEDA      TO WLI-DET-MONEDA               134600      
002882                                     WKS-DET-MONEDA               134700      
002883        MOVE R01-SNNN-CVETRA      TO WLI-DET-CVETRANS             134800      
002884                                     WKS-DET-CVETRANS             134900      
002885                                     W77-CVE                      134910      
002886        MOVE R01-SNNN-TM          TO WLI-DET-TM                   134912      
002887                                     WKS-DET-TM                   134914      
002888                                     W77-TM                       134916      
002889        PERFORM 50550-LEY-DET                                     134920      
002890                                                                  134930      
002891        MOVE R01-SNNN-IMPORTE     TO WLI-DET-IMPORTE              135200      
002892                                     WKS-DET-IMPORTE              135300      
002893        MOVE "NO"                 TO WLI-DET-VER-S151             135400      
002894                                     WKS-DET-VER-S151             135500      
002895        MOVE "SI"                 TO WLI-DET-VER-SNNN             135600      
002896                                     WKS-DET-VER-SNNN             135700      
002897        MOVE R01-SNNN-AUTS151     TO WLI-DET-AUT-S151             135800      
002898                                     WKS-DET-AUT-S151             135900      
002899        MOVE R01-SNNN-AUTAPL      TO WLI-DET-AUT-APLI             136000      
002900                                     WKS-DET-AUT-APLI             136100      
002901        MOVE R01-SNNN-SUCINI      TO WLI-DET-SUC-TRANS            136200      
002902                                     WKS-DET-SUC-TRANS            136300      
002903        MOVE R01-SNNN-CAJAINI     TO WLI-DET-CAJ-TRANS            136400      
002904                                     WKS-DET-CAJ-TRANS            136500      
002905        MOVE R01-SNNN-PRODUCTO    TO WLI-DET-PRODUCTO             136600      
002906                                     WKS-DET-PRODUCTO             136700      
002907        MOVE R01-SNNN-INST        TO WLI-DET-INSTRUMENTO          136800      
002908                                     WKS-DET-INSTRUMENTO          136900      
002909        MOVE R01-S151-LIBRO       TO WLI-DET-LIBRO                136920      
002910                                     WKS-DET-LIBRO.               136940      
002911                                                                  137000      
002912     WRITE V00-R00-DETCVES FROM WLI-REP-DETCVE.                   137100      
002913     WRITE REG-DETCVETRAN  FROM WKS-ARCH-DETCVES.                 137200      
002914     ADD 1 TO W77-NUM-LINEAS.                                     137300      
002915                                                                  137400      
002916 50550-LEY-DET.                                                   137410      
002917*==============                                                   137412      
002918     IF W77-CVE = 0                                               137414      
002919        MOVE "CLAVE TRANSACCION INVALIDA" TO WLI-DET-LEY          137416      
002920     ELSE                                                         137418      
002921        IF W77-CAT-FORMATO = 1 OR 2 OR 4                          137420      
002922           IF WKS-CVE-LEYENDA(W77-CVE) = 0                        137432      
002923              MOVE "CLAVE LEYENDA INVALIDA"  TO WLI-DET-LEY       137434      
002924           ELSE                                                   137436      
002925              MOVE WKS-CVE-LEYENDA(W77-CVE)  TO W77-IND2          137438      
002926              IF W77-IND2 > 9000                                  137439      
002927                 COMPUTE W77-IND2 = W77-IND2 - 9000               137440      
002928                 MOVE WS-LEY-TRAN4(W77-IND2) TO WLI-DET-LEY       137441      
002929              ELSE                                                137442      
002930                 IF W77-IND2 > 6000                               137443      
002931                    COMPUTE W77-IND2 = W77-IND2 - 6000            137444      
002932                    MOVE WS-LEY-TRAN3(W77-IND2) TO WLI-DET-LEY    137445      
002933                 ELSE                                             137446      
002934                    IF W77-IND2 > 3000                            137447      
002935                       COMPUTE W77-IND2 = W77-IND2 - 3000         137448      
002936                       MOVE WS-LEY-TRAN2(W77-IND2) TO WLI-DET-LEY 137449      
002937                    ELSE                                          137450      
002938                       MOVE WS-LEY-TRAN1(W77-IND2) TO WLI-DET-LEY 137451      
002939        ELSE                                                      137452      
002940           IF W77-CAT-FORMATO = 3 AND (W77-TM = 1 OR 2)           137454      
002941              IF WKS-CVE-LEY-MC(W77-TM,W77-CVE) = 0               137455      
002942                 MOVE "CLAVE LEYENDA INVALIDA"  TO WLI-DET-LEY    137456      
002943              ELSE                                                137458      
002944                MOVE WKS-CVE-LEY-MC(W77-TM,W77-CVE) TO W77-IND2   137462      
002945                IF W77-IND2 > 9000                                137464      
002946                   COMPUTE W77-IND2 = W77-IND2 - 9000             137465      
002947                   MOVE WS-LEY-TRAN4(W77-IND2) TO WLI-DET-LEY     137466      
002948                ELSE                                              137467      
002949                   IF W77-IND2 > 6000                             137468      
002950                      COMPUTE W77-IND2 = W77-IND2 - 6000          137469      
002951                      MOVE WS-LEY-TRAN3(W77-IND2) TO WLI-DET-LEY  137470      
002952                   ELSE                                           137471      
002953                      IF W77-IND2 > 3000                          137472      
002954                        COMPUTE W77-IND2 = W77-IND2 - 3000        137473      
002955                        MOVE WS-LEY-TRAN2(W77-IND2) TO WLI-DET-LEY137474      
002956                      ELSE                                        137475      
002957                        MOVE WS-LEY-TRAN1(W77-IND2) TO WLI-DET-LEY137476      
002958           ELSE                                                   137477      
002959              MOVE "LEYENDA INVALIDA (TM)"  TO WLI-DET-LEY.       137478      
002960                                                                  137480      
002961 50600-IMP-ENCABEZADO.                                            137500      
002962*=====================                                            137600      
002963                                                                  137700      
002964    ADD  1                TO       WKS-NUM-HOJAS                  137800      
002965    MOVE WKS-NUM-HOJAS    TO       WSR-RP-E3-HOJA                 137900      
002966    WRITE V00-R00-DETCVES FROM     WLI-TIT1-ENCAB  AFTER PAGE.    138000      
002967    WRITE V00-R00-DETCVES FROM     WLI-TIT4-ENCAB                 138100      
002968    WRITE V00-R00-DETCVES FROM     WLI-TIT3-ENCAB                 138200      
002969    MOVE SPACES           TO       V00-R00-DETCVES                138300      
002970    WRITE V00-R00-DETCVES                                         138400      
002971    WRITE V00-R00-DETCVES FROM     WLI-TIT7-DET.                  138500      
002972    WRITE V00-R00-DETCVES FROM     WLI-TIT8-DET.                  138510      
002973    MOVE SPACES           TO       V00-R00-DETCVES                138600      
002974    WRITE V00-R00-DETCVES.                                        138700      
002975    MOVE 7 TO W77-NUM-LINEAS.                                     138800      
002976                                                                  138820      
002977*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002978* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP002 ON CMEMP."         138840      
002979*                                      FROM 100000 TO 999999      138860      
002980                                                                  100000      
002981*----------------------------------------------------------------*100100      
002982*   PROCEDIMIENTO DE CALCULO DINAMICO DE ESPACIO PARA EL SORT    *100200      
002983*----------------------------------------------------------------*100300      
002984 70000-CALCULA-ESPACIO.                                           100400      
002985*======================                                           100500      
002986     IF W77-FRAMESIZE             =   8                           100600      
002987        COMPUTE WS-CALC-WORD      =   W77-MAXRECSIZE              100700      
002988                                  /   6                           100800      
002989        IF WS-WORD-RES            >   ZEROS                       100900      
002990           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                 101000      
002991                                  +   1                           101100      
002992        ELSE                                                      101200      
002993           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                .101300      
002994     COMPUTE W77-MEMORY-65K  =   66000 * W77-MAXRECSIZE     .     101400      
002995                                                                  101402      
002996     COMPUTE W77-MEMORY-SIZE ROUNDED                              101500      
002997                                  =   (W77-MAXRECSIZE + 3)        101600      
002998                                  *   (W77-LASTRECORD / 16)       101700      
002999                                  +   1500                       .101750      
003000                                                                  101770      
003001     IF W77-MEMORY-SIZE > 258435000                               101800      
003002        MOVE 258435000              TO W77-MEMORY-SIZE            101820      
003003     ELSE                                                         101850      
003004     IF W77-MEMORY-SIZE < 400000                                  101870      
003005        MOVE W77-MEMORY-65K         TO W77-MEMORY-SIZE.           101900      
003006                                                                  101990      
003007     COMPUTE W77-DISK-SIZE ROUNDED                                102000      
003008                                  =  (W77-MAXRECSIZE + 3)         102100      
003009                                  *   W77-LASTRECORD              102200      
003010                                  *   3.5                        .102300      
003011                                                                  102400      
003012*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003013                                                                  138900      
003014*==============================                                   139000      
003015*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003016*    COPY "S151/CRONOS2K/CPY/PD".                                 139100      
003017** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
003018** Unisys has defined for CRONOS2K project                     ** 000200      
003019** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
003020***************************************************************** 000400      
003021***************************************************************** 000600      
003022** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
003023** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
003024** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
003025** date MMDDCCAA, which is returned into the variable          ** 001000      
003026** A2K-FEC-MDCA-001.                                           ** 001100      
003027***************************************************************** 001200      
003028                                                                  001300      
003029 A2K-ACCEPT-TODAYS-DATE.                                          001400      
003030        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
003031*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
003032        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
003033        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
003034        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
003035        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
003036        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
003037                                                                  002200      
003038 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
003039        EXIT.                                                     002240      
003040                                                                  002500      
003041****************************************************************  002600      
003042** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
003043**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
003044**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
003045**baseyear to add the century to the year part.               **  003000      
003046**INPUT is A2K-FEC-AMD-001                                    **  003100      
003047**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
003048****************************************************************  003300      
003049                                                                  003400      
003050 A2K-CONV-AMD-TO-CAMD.                                            003500      
003051         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
003052         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
003053         IF A2K-FEC-AMD-001 = 0                                   003720      
003054            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
003055         ELSE                                                     003741      
003056          IF A2K-FEC-AMD-001 = 999999                             003742      
003057             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
003058         ELSE                                                     003760      
003059         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
003060                 A2K-OBTAIN-CENTURY-EXIT                          003900      
003061         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
003062         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
003063         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
003064         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
003065                                                                  004400      
003066 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
003067         EXIT.                                                    004600      
003068                                                                  004700      
003069******************************************************************004800      
003070**A2K-CONV-MDA-TO-MDCA.                                         **004900      
003071**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
003072** an eight digit format as MMDDCCAA. It use a                  **005100      
003073** baseyear to add century to the yaer.                         **005200      
003074** INPUT is A2K-FEC-MDA-001                                     **005300      
003075** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
003076                                                                  005500      
003077 A2K-CONV-MDA-TO-MDCA.                                            005600      
003078     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
003079     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
003080     IF A2K-FEC-MDA-001 = 0                                       005820      
003081        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
003082     ELSE                                                         005845      
003083      IF A2K-FEC-MDA-001 = 999999                                 005850      
003084         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
003085     ELSE                                                         005860      
003086     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
003087             A2K-OBTAIN-CENTURY-EXIT                              006000      
003088     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
003089     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
003090     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
003091     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
003092                                                                  006500      
003093 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
003094     EXIT.                                                        006700      
003095                                                                  006800      
003096***************************************************************** 006900      
003097**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
003098**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
003099**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
003100**baseyear to add century to the year.                         ** 007300      
003101**INPUT is A2K-FEC-DMA-001                                     ** 007400      
003102**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
003103                                                                  007600      
003104 A2K-CONV-DMA-TO-DMCA.                                            007700      
003105       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
003106       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
003107       IF  A2K-FEC-DMA-001   = 0                                  007920      
003108          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
003109       ELSE                                                       007945      
003110        IF A2K-FEC-DMA-001 = 999999                               007950      
003111          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
003112       ELSE                                                       007960      
003113       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
003114               A2K-OBTAIN-CENTURY-EXIT                            008100      
003115       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
003116       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
003117       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
003118       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
003119                                                                  008600      
003120 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
003121       EXIT.                                                      008800      
003122                                                                  008900      
003123***************************************************************** 009000      
003124** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
003125** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
003126** a 6 digit format as AAMMDD.                                 ** 009300      
003127** It simply removes the century information in the output     ** 009400      
003128** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
003129** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
003130                                                                  009700      
003131 A2K-CONV-CAMD-TO-AMD.                                            009800      
003132     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
003133     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
003134     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
003135     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
003136                                                                  010300      
003137 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
003138      EXIT.                                                       010500      
003139                                                                  010600      
003140******************************************************************010700      
003141******************************************************************010800      
003142** A2K-CONV-MDCA-TO-MDA.                                        **010900      
003143** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
003144** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
003145** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
003146** INPUT is A2K-FEC-MDCA-001                                    **011300      
003147** OUTPUT is A2K-FEC-MDA-001                                    **011400      
003148                                                                  011500      
003149 A2K-CONV-MDCA-TO-MDA.                                            011600      
003150     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
003151     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
003152     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
003153     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
003154                                                                  012100      
003155 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
003156      EXIT.                                                       012300      
003157                                                                  012400      
003158******************************************************************012500      
003159***************************************************************** 012600      
003160** A2K-CONV-DMCA-TO-DMA.                                        **012700      
003161** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
003162** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
003163** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
003164** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
003165** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
003166                                                                  013300      
003167 A2K-CONV-DMCA-TO-DMA.                                            013400      
003168     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
003169     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
003170     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
003171     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
003172                                                                  013900      
003173 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
003174      EXIT.                                                       014100      
003175                                                                  014200      
003176***************************************************************** 014300      
003177 A2K-CONV-MDCA-TO-CAMD.                                           014400      
003178      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
003179      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
003180      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
003181      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
003182      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
003183 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
003184      EXIT.                                                       015100      
003185***************************************************************** 015200      
003186** This paragraph adds century to an year field which is 9(02) ** 015300      
003187** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
003188** Output is A2K-FEC-CCAA-001.                                 ** 015600      
003189***************************************************************** 015700      
003190 A2K-CONV-AA-TO-CCAA.                                             015800      
003191      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
003192      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
003193              A2K-OBTAIN-CENTURY-EXIT.                            016100      
003194      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
003195 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
003196      EXIT.                                                       016400      
003197***************************************************************** 016500      
003198** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
003199** format.                                                     ** 016700      
003200** Input is A2K-FEC-DMCA-001.                                  ** 016800      
003201** Output is A2K-FEC-CAMD-001.                                 ** 016900      
003202***************************************************************** 017000      
003203 A2K-CONV-DMCA-TO-CAMD.                                           017100      
003204      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
003205      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
003206      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
003207      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
003208      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
003209 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
003210      EXIT.                                                       017800      
003211***************************************************************** 017900      
003212** This paragraph desides the Century to be added depending    ** 018000      
003213** on the base year.                                           ** 018100      
003214** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
003215** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
003216***************************************************************** 018400      
003217 A2K-OBTAIN-CENTURY.                                              018500      
003218      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
003219          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
003220      ELSE                                                        018800      
003221          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
003222 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
003223      EXIT.                                                       019100      
003224                                                                  019200      
003225***************************************************************** 019300      
003226** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
003227**  Format                                                     ** 019500      
003228** Input Is A2K-FEC-CAMD-001                                   ** 019600      
003229** Output Is A2K-FEC-DMCA-001                                  ** 019700      
003230***************************************************************** 019800      
003231 A2K-CONV-CAMD-TO-DMCA.                                           019900      
003232      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
003233      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
003234      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
003235      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
003236      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
003237                                                                  020500      
003238 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
003239      EXIT.                                                       020700      
003240                                                                  020800      
003241******************************************************************020900      
003242******************************************************************021000      
003243 A2K-CONV-AM-TO-CAM.                                              021100      
003244      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
003245      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
003246      IF A2K-FEC-AM-001 = 0                                       021220      
003247         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
003248      ELSE                                                        021245      
003249      IF A2K-FEC-AM-001 = 9999                                    021250      
003250         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
003251      ELSE                                                        021260      
003252      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
003253      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
003254      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
003255              A2K-OBTAIN-CENTURY-EXIT                             021600      
003256      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
003257                                                                  021800      
003258 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
003259      EXIT.                                                       022000      
003260                                                                  022100      
003261******************************************************************022200      
003262******************************************************************022300      
003263 A2K-CONV-CAM-TO-AM.                                              022400      
003264      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
003265      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
003266      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
003267                                                                  022800      
003268 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
003269   EXIT.                                                          023000      
003270                                                                  023100      
003271                                                                  023200      
003272                                                                  023500      
003273*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003274*HSC INI ALTA DISPONIBILIDAD IBM 06/02/2015                       139200      
003275** CONSULTAR SI EXISTE B05 CON LA FECHA DEL DIA                   139300      
003276 010000-VERIFICA-B05.                                             139400      
003277     MOVE 01                      TO WKS-B05-FUNCION              139500      
003278     MOVE W77-SISTEMA-PARAM       TO WKS-B05-SISTEMA              139600      
003279     MOVE WKS-FECHA-PRO151        TO WKS-B05-FCHPRO               139700      
003280     MOVE 104                     TO WKS-B05-NUMPRO               139800      
003281     MOVE ZEROS                   TO WKS-B05-FCHINI               139900      
003282                                     WKS-B05-NUMREGINI.           140000      
003283                                                                  140100      
003284     CALL "B05PROCESOS IN S151LIBCONTROL" USING WKS-B05PROCESOS   140200      
003285                                    GIVING W77-RESULT.            140300      
003286                                                                  140400      
003287     IF W77-RESULT = 0                                            140500      
003288          IF WKS-B05-STAPGM = 0                                   140600      
003289              NEXT SENTENCE                                       140700      
003290          ELSE                                                    140800      
003291              STOP RUN                                            141000      
003292     ELSE                                                         141100      
003293          PERFORM 010100-CREA-B05.                                141200      
003294                                                                  141300      
003295 010100-CREA-B05.                                                 141400      
003296     MOVE 19                      TO WKS-B05-FUNCION              141500      
003297     MOVE W77-SISTEMA-PARAM       TO WKS-B05-SISTEMA              141600      
003298     MOVE WKS-FECHA-PRO151        TO WKS-B05-FCHPRO               141700      
003299     MOVE 104                     TO WKS-B05-NUMPRO               141800      
003300     MOVE ZEROS                   TO WKS-B05-FCHINI               141900      
003301                                     WKS-B05-NUMREGINI.           142000      
003302                                                                  142100      
003303     CALL "B05PROCESOS IN S151LIBCONTROL" USING WKS-B05PROCESOS   142200      
003304                                    GIVING W77-RESULT.            142300      
003305                                                                  142400      
003306     IF W77-RESULT = 0                                            142500      
003307         NEXT SENTENCE                                            142600      
003308     ELSE                                                         142700      
003309         MOVE "I" TO TIPO-LJ                                      142800      
003310         MOVE 051010 TO CODIGO-LJ                                 142900      
003311         MOVE W77-RESULT            TO W77-ERROR                  143000      
003312                                                                  143100      
003313         STRING "FUNCION " WKS-B05-FUNCION " ERROR # " W77-ERROR  143200      
003314         "ERROR AL LLAMADO DE B05PROCESOS" WKS-B05-SISTEMA " "    143300      
003315                       WKS-B05-NUMPRO " " WKS-FECHA-PRO151        143400      
003316         DELIMITED BY SIZE INTO TEXTO-LJ                          143500      
003317         CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ.     143600      
003318                                                                  143700      
003319                                                                  143800      
003320 010200-ACTUALIZA-B05.                                            143900      
003321     MOVE 37                              TO WKS-B05-FUNCION      144000      
003322     MOVE W77-SISTEMA-PARAM               TO WKS-B05-SISTEMA      144100      
003323     MOVE WKS-FECHA-PRO151                TO WKS-B05-FCHPRO       144200      
003324     MOVE 104                             TO WKS-B05-NUMPRO       144300      
003325     MOVE ZEROS                           TO WKS-B05-FCHINI       144400      
003326                                             WKS-B05-NUMREGINI    144500      
003327****** ESTATUS DE TERMINACION DEL PROCESO                         144600      
003328     MOVE 01                              TO WKS-B05-STAPGM.      144700      
003329                                                                  144800      
003330     CALL "B05PROCESOS IN S151LIBCONTROL" USING WKS-B05PROCESOS   144900      
003331                                    GIVING W77-RESULT.            145000      
003332     IF W77-RESULT = 0                                            145100      
003333          NEXT SENTENCE                                           145200      
003334     ELSE                                                         145300      
003335         MOVE "I" TO TIPO-LJ                                      145400      
003336         MOVE 051010 TO CODIGO-LJ                                 145500      
003337         MOVE W77-RESULT            TO W77-ERROR                  145600      
003338                                                                  145700      
003339         STRING "FUNCION " WKS-B05-FUNCION " ERROR # " W77-ERROR  145800      
003340         "ERROR AL LLAMADO DE B05PROCESOS" WKS-B05-SISTEMA " "    145900      
003341                       WKS-B05-NUMPRO " " WKS-FECHA-PRO151        146000      
003342         DELIMITED BY SIZE INTO TEXTO-LJ                          146100      
003343         CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ.     146200      
003344                                                                  146300      
003345**** HSC FIN - ALTA DISPONIBILIDAD * IBM 06-02-15                 146400      
