000001$SET LIST  LINEINFO                                               000100      
000002$SET OPTIMIZE                                                     000200      
000003                                                                  000300      
000004 IDENTIFICATION DIVISION.                                         000400      
000005******************************************************************000500      
000006*                                                                *000600      
000007* FUNCION :  PROCESO DE EXTRACCION DE LAS ESTRUCTURAS B20, B21,  *000700      
000008*            B70, B71, B72 Y B80 DE LA BASE S151BD11SDOSXXX      *000800      
000009*            GENERANDO UN ARCHIVO PLANO POR CADA DATASET.        *000900      
000010*                                                                *001000      
000011*            XXX ---> SE PASA POR PARAMETRO EL NUMERO DE SISTEMA *001100      
000012*            DE LA BASE A EXTRAER Y ENSEGUIDA EL NOMBRE DEL PACK *001200      
000013*            EN DONDE DESEAMOS QUE QUEDEN RESIDENTES LOS ARCHI-  *001300      
000014*            VOS PLANOS.                                         *001400      
000015*                                                                *001500      
000016******************************************************************001600      
000017******************************************************************001605      
000018**JNRB 251112 SE LIBERA NUEVA VERSION POR PROCESO DE             *001610      
000019**RECOMPILACION                                                  *001615      
000020*                                                                *001620      
000021*                                                                *001625      
000022*                                                                *001630      
000023*                                                                *001635      
000024*                                                                *001640      
000025*                                                                *001645      
000026*                                                                *001650      
000027*                                                                *001655      
000028*                                                                *001660      
000029*                                                                *001665      
000030*                                                                *001670      
000031******************************************************************001675      
000032                                                                  001680      
000033                                                                  001700      
000034 ENVIRONMENT DIVISION.                                            001800      
000035 INPUT-OUTPUT SECTION.                                            001900      
000036 FILE-CONTROL.                                                    002000      
000037                                                                  002100      
000038     SELECT R20SDOMENCON  ASSIGN TO DISK.                         002200      
000039     SELECT R21SDMENCON1  ASSIGN TO DISK.                         002300      
000040     SELECT R70POSICION   ASSIGN TO DISK.                         002400      
000041     SELECT R71POSDIAAD1  ASSIGN TO DISK.                         002500      
000042     SELECT R72POSCONTA   ASSIGN TO DISK.                         002600      
000043     SELECT R80EDOCTA     ASSIGN TO DISK.                         002700      
000044                                                                  002800      
000045     SELECT IMPRESION     ASSIGN TO PRINTER.                      002900      
000046                                                                  003000      
000047 DATA DIVISION.                                                   003100      
000048 FILE SECTION.                                                    003200      
000049                                                                  003300      
000050                                                                  003400      
000051 FD  IMPRESION                                                    003500      
000052     VALUE OF TITLE IS WS-REPORTE-EXTRACCION                      003600      
000053     DATA RECORD IS LINEA-REP.                                    003700      
000054                                                                  003800      
000055 01  LINEA-REP            PIC X(132).                             003900      
000056                                                                  004000      
000057                                                                  004100      
000058 FD  R20SDOMENCON                                                 004200      
000059     VALUE OF TITLE IS WS-TITLE-B20SDOMENCON                      004300      
000060     BLOCK CONTAINS 30 RECORDS                                    004400      
000061     VALUE OF AREAS 1000                                          004500      
000062     VALUE OF AREASIZE IS 12000                                   004600      
000063     DATA RECORD IS REG-B20SDOMENCON.                             004700      
000064                                                                  004800      
000065 01  REG-B20SDOMENCON.                                            004900      
000066     03 R20-SDO-KEYMENCON.                                        005000      
000067        05 R20-SDO-KEYAM           PIC 9(06) COMP.                005100      
000068        05 R20-SDO-KEYCON          PIC 9(20) COMP.                005200      
000069        05 R20-SDO-KEYPRD          PIC 9(04) COMP.                005300      
000070        05 R20-SDO-KEYINS          PIC 9(04) COMP.                005400      
000071        05 R20-SDO-KEYMON          PIC 9(04) COMP.                005500      
000072     03 R20-SDO-SUCPRO             PIC 9(04) COMP.                005600      
000073     03 R20-SDO-STAMOV             PIC 9(02) COMP.                005700      
000074     03 R20-SDO-APUIMP             PIC 9(02) COMP.                005800      
000075     03 R20-SDO-FILLER             PIC X(14).                     005900      
000076     03 R20-SDO-SDO                OCCURS   10 TIMES.             006000      
000077        05 R20-SDO-CNTMOV          PIC 9(08) COMP.                006100      
000078        05 R20-SDO-SD              PIC S9(13)V9(02) COMP.         006200      
000079                                                                  006300      
000080                                                                  006400      
000081 FD  R21SDMENCON1                                                 006500      
000082     VALUE OF TITLE IS WS-TITLE-B21SDMENCON1                      006600      
000083     BLOCK CONTAINS 45 RECORDS                                    006700      
000084     VALUE OF AREAS 1000                                          006800      
000085     VALUE OF AREASIZE IS 12000                                   006900      
000086     DATA RECORD IS REG-B21SDMENCON1.                             007000      
000087                                                                  007100      
000088 01  REG-B21SDMENCON1.                                            007200      
000089     03 R21-SDO-KEYMENCON.                                        007300      
000090        05 R21-SDO-KEYAM           PIC 9(06) COMP.                007400      
000091        05 R21-SDO-KEYCON          PIC 9(20) COMP.                007500      
000092        05 R21-SDO-KEYPRD          PIC 9(04) COMP.                007600      
000093        05 R21-SDO-KEYINS          PIC 9(04) COMP.                007700      
000094        05 R21-SDO-KEYIND          PIC 9(04) COMP.                007800      
000095     03 R21-SDO-FILLER             PIC X(06).                     007900      
000096     03 R21-SDO-SDO                OCCURS   12 TIMES.             008000      
000097        05 R21-SDO-CNTMOV          PIC 9(08) COMP.                008100      
000098        05 R21-SDO-SD              PIC S9(13)V9(02) COMP.         008200      
000099                                                                  008300      
000100                                                                  008400      
000101 FD  R70POSICION                                                  008500      
000102     VALUE OF TITLE IS WS-TITLE-B70POSICION                       008600      
000103     BLOCK CONTAINS 30 RECORDS                                    008700      
000104     VALUE OF AREAS 1000                                          008800      
000105     VALUE OF AREASIZE IS 12000                                   008900      
000106     DATA RECORD IS REG-B70POSICION.                              009000      
000107                                                                  009100      
000108 01  REG-B70POSICION.                                             009200      
000109     03 R70-SDO-KEYPOS.                                           009300      
000110        05 R70-SDO-KEYCSI          PIC 9(04) COMP.                009400      
000111        05 R70-SDO-KEYFEC          PIC 9(08) COMP.                009500      
000112        05 R70-SDO-KEYPRD          PIC 9(04) COMP.                009600      
000113        05 R70-SDO-KEYINS          PIC 9(04) COMP.                009700      
000114        05 R70-SDO-KEYMON          PIC 9(04) COMP.                009800      
000115     03 R70-SDO-APUIMP             PIC 9(02) COMP.                009900      
000116     03 R70-SDO-FILLER             PIC X(16).                     010000      
000117     03 R70-SDO-SDO                OCCURS   10 TIMES.             010100      
000118        05 R70-SDO-CNTMOV          PIC 9(10) COMP.                010200      
000119        05 R70-SDO-SD              PIC S9(15)V9(02) COMP.         010300      
000120                                                                  010400      
000121                                                                  010500      
000122 FD  R71POSDIAAD1                                                 010600      
000123     VALUE OF TITLE IS WS-TITLE-B71POSDIAAD1                      010700      
000124     BLOCK CONTAINS 30 RECORDS                                    010800      
000125     VALUE OF AREAS 1000                                          010900      
000126     VALUE OF AREASIZE IS 12000                                   011000      
000127     DATA RECORD IS REG-B71POSDIAAD1.                             011100      
000128                                                                  011200      
000129 01  REG-B71POSDIAAD1.                                            011300      
000130     03 R71-SDO-KEYPOS.                                           011400      
000131        05 R71-SDO-KEYCSI          PIC 9(02) COMP.                011500      
000132        05 R71-SDO-KEYFEC          PIC 9(08) COMP.                011600      
000133        05 R71-SDO-KEYPRD          PIC 9(04) COMP.                011700      
000134        05 R71-SDO-KEYINS          PIC 9(04) COMP.                011800      
000135        05 R71-SDO-KEYMON          PIC 9(04) COMP.                011900      
000136        05 R71-SDO-KEYIND          PIC 9(04) COMP.                012000      
000137     03 R71-SDO-SDO                OCCURS   12 TIMES.             012100      
000138        05 R71-SDO-CNTMOV          PIC 9(08) COMP.                012200      
000139        05 R71-SDO-SD              PIC S9(15)V9(02) COMP.         012300      
000140                                                                  012400      
000141                                                                  012500      
000142 FD  R72POSCONTA                                                  012600      
000143     VALUE OF TITLE IS WS-TITLE-B72POSCONTA                       012700      
000144     BLOCK CONTAINS 30 RECORDS                                    012800      
000145     VALUE OF AREAS 1000                                          012900      
000146     VALUE OF AREASIZE IS 12000                                   013000      
000147     DATA RECORD IS REG-B72POSCONTA.                              013100      
000148                                                                  013200      
000149 01  REG-B72POSCONTA.                                             013300      
000150     03 R72-SDO-KEYPOS.                                           013400      
000151        05 R72-SDO-KEYCSI          PIC 9(04) COMP.                013500      
000152        05 R72-SDO-KEYFEC          PIC 9(08) COMP.                013600      
000153        05 R72-SDO-KEYBCO          PIC 9(04) COMP.                013700      
000154        05 R72-SDO-KEYMON          PIC 9(04) COMP.                013800      
000155        05 R72-SDO-KEYFID          PIC 9(04) COMP.                013900      
000156        05 R72-SDO-KEYPRD          PIC 9(04) COMP.                014000      
000157        05 R72-SDO-KEYINS          PIC 9(04) COMP.                014100      
000158        05 R72-SDO-KEYCTA          PIC 9(12) COMP.                014200      
000159        05 R72-SDO-KEYCVEC         PIC 9(06) COMP.                014300      
000160        05 R72-SDO-KEYSEC          PIC 9(02) COMP.                014400      
000161     03 R72-SDO-NATCTA             PIC 9(02) COMP.                014500      
000162     03 R72-SDO-SDOANT             PIC S9(15)V9(02) COMP.         014600      
000163     03 R72-SDO-CARGOS             PIC S9(15)V9(02) COMP.         014700      
000164     03 R72-SDO-ABONOS             PIC S9(15)V9(02) COMP.         014800      
000165     03 R72-SDO-SDOACT             PIC S9(15)V9(02) COMP.         014900      
000166                                                                  015000      
000167                                                                  015100      
000168 FD  R80EDOCTA                                                    015200      
000169     VALUE OF TITLE IS WS-TITLE-B80EDOCTA                         015300      
000170     BLOCK CONTAINS 30 RECORDS                                    015400      
000171     VALUE OF AREAS 1000                                          015500      
000172     VALUE OF AREASIZE IS 12000                                   015600      
000173     DATA RECORD IS REG-B80EDOCTA.                                015700      
000174                                                                  015800      
000175 01  REG-B80EDOCTA.                                               015900      
000176     03 R80-SDO-KEYCONT.                                          016000      
000177        05 R80-SDO-KEYCON          PIC 9(20) COMP.                016100      
000178     03 R80-SDO-FECCON             PIC 9(08) COMP.                016200      
000179     03 R80-SDO-PRD                PIC 9(04) COMP.                016300      
000180     03 R80-SDO-INS                PIC 9(02) COMP.                016400      
000181     03 R80-SDO-FCHINI             PIC 9(08) COMP.                016500      
000182     03 R80-SDO-FCHFIN             PIC 9(08) COMP.                016600      
000183     03 R80-SDO-DATOS              PIC X(146).                    016700      
000184                                                                  016800      
000185                                                                  016900      
000186 DATA-BASE SECTION.                                               017000      
000187                                                                  017100      
000188 DB  SALDOS = S151BD11SDOS151.                                    017200      
000189                                                                  017300      
000190                                                                  017400      
000191 WORKING-STORAGE SECTION.                                         017500      
000192                                                                  017600      
000193                                                                  017700      
000194*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000195* COPY "S151/CRONOS2K/CPY/WS".                                    017800      
000196******************************************************************000100      
000197** This copyBook defines all the additional variables that      **000200      
000198** Unisys has defined for the CRONOS2K project                  **000300      
000199** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000200******************************************************************000500      
000201                                                                  000600      
000202******************************************************************000700      
000203** These Variables are used to Accept the system date in long   **000800      
000204** format and get the century information                       **000900      
000205** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000206 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000207 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000208    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000209    05 FILLER      PIC X(1).                                      001400      
000210    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000211    05 FILLER      PIC X(1).                                      001600      
000212    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000213    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000214      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000215      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000216******************************************************************002100      
000217                                                                  002200      
000218******************************************************************002300      
000219** This variable defines a date in the format MMDDCCAA          **002400      
000220**                                                              **002500      
000221 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000222 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000223    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000224    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000225    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000226    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000227      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000228      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000229******************************************************************003400      
000230                                                                  003500      
000231******************************************************************003600      
000232** This variable defines a date in the format CCAAMMDD          **003700      
000233**                                                              **003800      
000234 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000235 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000236    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000237    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000238      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000239      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000240    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000241    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000242******************************************************************004700      
000243                                                                  004800      
000244******************************************************************004900      
000245** This variable defines a date in the format DDMMCCAA          **005000      
000246**                                                              **005100      
000247 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000248 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000249    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000250    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000251    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000252    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000253      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000254      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000255******************************************************************006000      
000256                                                                  006100      
000257******************************************************************006200      
000258** This variable defines a date in the Julian Format CCAADDD    **006300      
000259**                                                              **006400      
000260 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000261 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000262    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000263    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000264                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000265      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000266      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000267    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000268******************************************************************007300      
000269                                                                  007400      
000270******************************************************************007500      
000271** This variable defines a date in the format AAMMDD            **007600      
000272**                                                              **007700      
000273 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000274 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000275    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000276    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000277    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000278******************************************************************008300      
000279                                                                  008400      
000280******************************************************************008500      
000281** This variable defines a date in the format MMDDAA            **008600      
000282**                                                              **008700      
000283 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000284 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000285    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000286    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000287    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000288******************************************************************009300      
000289                                                                  009400      
000290******************************************************************009500      
000291** This variable defines a date in the format DDMMAA            **009600      
000292**                                                              **009700      
000293 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000294 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000295    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000296    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000297    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000298******************************************************************010300      
000299                                                                  010400      
000300******************************************************************010500      
000301** These variables are defined to be used for CALL bridge logic **010600      
000302**                                                              **010700      
000303 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000304 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000305 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000306 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000307 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000308 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000309******************************************************************011400      
000310                                                                  011500      
000311******************************************************************011600      
000312** This variable is used for converting only a year field AA to **011700      
000313** CCAA and a CCAA to AA                                        **011800      
000314 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000315 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000316    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000317    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000318 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000319 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000320******************************************************************012300      
000321                                                                  012400      
000322******************************************************************012500      
000323** These variables are Bridge Variables for Intercambio files   **012600      
000324** para EDOCTA                                                  **012700      
000325 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000326 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000327 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000328 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000329 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000330 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000331 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000332******************************************************************013500      
000333* Para MODULO                                                     013600      
000334 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000335******************************************************************013800      
000336******************************************************************013900      
000337** Para FMOVSCHABO                                                014000      
000338 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000339******************************************************************014200      
000340                                                                  014300      
000341******************************************************************014400      
000342***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000343******************************************************************014600      
000344                                                                  014700      
000345 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000346 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000347     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000348     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000349     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000350******************************************************************015300      
000351                                                                  015400      
000352******************************************************************015500      
000353***  These Variables Are Defined For Date In AAMM Format       ***015600      
000354******************************************************************015700      
000355                                                                  015800      
000356 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000357 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000358     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000359     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000360******************************************************************016300      
000361                                                                  016400      
000362                                                                  016500      
000363*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000364  01  A2K-BASE-YEAR     PIC 9(02) VALUE 50.                       017900      
000365                                                                  018000      
000366                                                                  018100      
000367 77  WS-EOF-B20                    PIC 9(02) COMP VALUE ZEROS.    018200      
000368 77  WS-EOF-B21                    PIC 9(02) COMP VALUE ZEROS.    018300      
000369 77  WS-EOF-B70                    PIC 9(02) COMP VALUE ZEROS.    018400      
000370 77  WS-EOF-B71                    PIC 9(02) COMP VALUE ZEROS.    018500      
000371 77  WS-EOF-B72                    PIC 9(02) COMP VALUE ZEROS.    018600      
000372 77  WS-EOF-B80                    PIC 9(02) COMP VALUE ZEROS.    018700      
000373                                                                  018800      
000374 77  WS-ACUM-B20                   PIC 9(08) VALUE ZEROS.         018900      
000375 77  WS-ACUM-B21                   PIC 9(08) VALUE ZEROS.         019000      
000376 77  WS-ACUM-B70                   PIC 9(08) VALUE ZEROS.         019100      
000377 77  WS-ACUM-B71                   PIC 9(08) VALUE ZEROS.         019200      
000378 77  WS-ACUM-B72                   PIC 9(08) VALUE ZEROS.         019300      
000379 77  WS-ACUM-B80                   PIC 9(08) VALUE ZEROS.         019400      
000380                                                                  019500      
000381 77  WS-TOTALB20SDOSD2             PIC 9(18)V9(02).               019600      
000382 77  WS-TOTALB21SDOSD2             PIC 9(18)V9(02).               019700      
000383 77  WS-TOTALB70SDOSD2             PIC 9(18)V9(02).               019800      
000384 77  WS-TOTALB71SDOSD2             PIC 9(18)V9(02).               019900      
000385 77  WS-TOTALB72SDOACT             PIC 9(18)V9(02).               020000      
000386                                                                  020100      
000387 77  WS-PAGINA                     PIC 9(03) VALUE ZEROS.         020200      
000388 77  WS-LINEAS                     PIC 9(02) VALUE 65.            020300      
000389                                                                  020400      
000390                                                                  020500      
000391*=======================  NOMBRE DEL LISTADO   ==================*020600      
000392                                                                  020700      
000393 01  WS-REPORTE-EXTRACCION.                                       020800      
000394     02 FILLER                     PIC X(01) VALUE "S".           020900      
000395     02 SIST-REP                   PIC 9(03).                     021000      
000396     02 FILLER                     PIC X(11) VALUE "/LIST/P330/". 021100      
000397     02 NUMCSIREP                  PIC 9(02).                     021200      
000398     02 SUBNODOREP                 PIC X(02) VALUE "00".          021300      
000399     02 FILLER                     PIC X(06) VALUE "/C000/".      021400      
000400     02 FECHAREPOR                 PIC 9(06).                     021500      
000401     02 FILLER                     PIC X(01) VALUE "/".           021600      
000402     02 NUMBERMIX                  PIC 9(07).                     021700      
000403     02 FILLER                     PIC X(01) VALUE "/".           021800      
000404     02 FILLER                     PIC X(13) VALUE                021900      
000405        "001EXTRACCION".                                          022000      
000406     02 FILLER                     PIC X(01) VALUE ".".           022100      
000407                                                                  022200      
000408                                                                  022300      
000409*======== NOMBRES DE LOS ARCHIVOS PLANOS DE LA EXTRACCION =======*022400      
000410                                                                  022500      
000411                                                                  022600      
000412 01  WS-TITLE-B20SDOMENCON.                                       022700      
000413     02 FILLER                     PIC X(01) VALUE "S".           022800      
000414     02 WS-SIS-B20                 PIC 9(03).                     022900      
000415     02 FILLER                     PIC X(27) VALUE                023000      
000416        "/FILE/EXTR/B20SDOMENCON ON ".                            023100      
000417     02 WKS-B20-PACK               PIC X(12).                     023200      
000418     02 FILLER                     PIC X(01) VALUE ".".           023300      
000419                                                                  023400      
000420 01  WS-TITLE-B21SDMENCON1.                                       023500      
000421     02 FILLER                     PIC X(01) VALUE "S".           023600      
000422     02 WS-SIS-B21                 PIC 9(03).                     023700      
000423     02 FILLER                     PIC X(27) VALUE                023800      
000424        "/FILE/EXTR/B21SDMENCON1 ON ".                            023900      
000425     02 WKS-B21-PACK               PIC X(12).                     024000      
000426     02 FILLER                     PIC X(01) VALUE ".".           024100      
000427                                                                  024200      
000428 01  WS-TITLE-B70POSICION.                                        024300      
000429     02 FILLER                     PIC X(01) VALUE "S".           024400      
000430     02 WS-SIS-B70                 PIC 9(03).                     024500      
000431     02 FILLER                     PIC X(26) VALUE                024600      
000432        "/FILE/EXTR/B70POSICION ON ".                             024700      
000433     02 WKS-B70-PACK               PIC X(12).                     024800      
000434     02 FILLER                     PIC X(01) VALUE ".".           024900      
000435                                                                  025000      
000436 01  WS-TITLE-B71POSDIAAD1.                                       025100      
000437     02 FILLER                     PIC X(01) VALUE "S".           025200      
000438     02 WS-SIS-B71                 PIC 9(03).                     025300      
000439     02 FILLER                     PIC X(27) VALUE                025400      
000440        "/FILE/EXTR/B71POSDIAAD1 ON ".                            025500      
000441     02 WKS-B71-PACK               PIC X(12).                     025600      
000442     02 FILLER                     PIC X(01) VALUE ".".           025700      
000443                                                                  025800      
000444 01  WS-TITLE-B72POSCONTA.                                        025900      
000445     02 FILLER                     PIC X(01) VALUE "S".           026000      
000446     02 WS-SIS-B72                 PIC 9(03).                     026100      
000447     02 FILLER                     PIC X(26) VALUE                026200      
000448        "/FILE/EXTR/B72POSCONTA ON ".                             026300      
000449     02 WKS-B72-PACK               PIC X(12).                     026400      
000450     02 FILLER                     PIC X(01) VALUE ".".           026500      
000451                                                                  026600      
000452 01  WS-TITLE-B80EDOCTA.                                          026700      
000453     02 FILLER                     PIC X(01) VALUE "S".           026800      
000454     02 WS-SIS-B80                 PIC 9(03).                     026900      
000455     02 FILLER                     PIC X(24) VALUE                027000      
000456        "/FILE/EXTR/B80EDOCTA ON ".                               027100      
000457     02 WKS-B80-PACK               PIC X(12).                     027200      
000458     02 FILLER                     PIC X(01) VALUE ".".           027300      
000459                                                                  027400      
000460*================  VARIABLES LIBRERIA DE CONTROL  ===============*027500      
000461                                                                  027600      
000462                                                                  027700      
000463*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000464* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL.".                  027800      
000465*================================================================ 000100      
000466*         ENTRY-POINT CONSISDIA :                               = 000200      
000467*                                                                 000300      
000468* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000469* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000470* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000471* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000472* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000473* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000474* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000475* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000476* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000477* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000478*                                                               = 001400      
000479*================================================================ 001500      
000480                                                                  001600      
000481                                                                  001700      
000482*================================================================ 001800      
000483* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000484*                                                               = 002000      
000485* ENTRADA REQUERIDA :                                           = 002100      
000486*                                                               = 002200      
000487*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000488*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000489*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000490*================================================================ 002600      
000491 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000492    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000493    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000494    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000495    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000496    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000497    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000498    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000499    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000500    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000501    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000502    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000503    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000504    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000505    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000506    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000507    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000508    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000509    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000510    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000511    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000512       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000513       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000514       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000515       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000516*==============================================================   005200      
000517*                                                             =   005300      
000518* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000519*                                                             =   005500      
000520* CAMPOS REQUERIDOS :                                         =   005600      
000521*                                                             =   005700      
000522* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000523* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000524* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000525* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000526*==============================================================   006200      
000527 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000528    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000529    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000530    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000531    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000532                                                                  006800      
000533*==============================================================   006900      
000534*                                                             =   007000      
000535* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000536*                                                             =   007200      
000537* CAMPOS REQUERIDOS :                                         =   007300      
000538*                                                             =   007400      
000539* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000540* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000541* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000542* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000543*==============================================================   007900      
000544 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000545    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000546    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000547    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000548    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000549                                                                  008500      
000550*==============================================================   008600      
000551*                                                             =   008700      
000552* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000553*                                                             =   008900      
000554* CAMPOS REQUERIDOS :                                         =   009000      
000555*                                                             =   009100      
000556* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000557* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000558* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000559* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000560*==============================================================   009600      
000561 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000562    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000563    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000564    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000565    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000566                                                                  010200      
000567*============================================================     010300      
000568* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000569*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000570*                                                           =     010600      
000571*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000572*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000573*                                                           =     010900      
000574*  ENTRADA REQUERIDA.                                       =     011000      
000575*                                                           =     011100      
000576*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000577*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000578*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000579*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000580*============================================================     011600      
000581                                                                  011700      
000582 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000583     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000584     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000585     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000586     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000587                                                                  012300      
000588*=============================================================    012400      
000589*                                                            =    012500      
000590* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000591*             B01-SIS-FECARMOV.                              =    012700      
000592*                                                            =    012800      
000593* ENTRADA REQUERIDAD :                                       =    012900      
000594*                                                            =    013000      
000595*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000596*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000597*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000598*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000599*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000600*=============================================================    013600      
000601                                                                  013700      
000602 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000603     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000604     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000605     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000606     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000607     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000608*================================================================ 014400      
000609*                                                               = 014500      
000610* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000611*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000612*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000613*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000614*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000615*                                                               = 015100      
000616* ENTRADA REQUERIDA :                                           = 015200      
000617*                                                               = 015300      
000618* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000619* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000620* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000621* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000622* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000623*================================================================ 015900      
000624 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000625    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000626    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000627    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000628    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000629    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000630                                                                  016600      
000631*============================================================     016700      
000632*                                                           =     016800      
000633* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000634*                                                           =     017000      
000635* DATOS REQUERIDOS :                                        =     017100      
000636*                                                           =     017200      
000637* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000638* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000639* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000640* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000641* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000642*============================================================     017800      
000643                                                                  017900      
000644 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000645     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000646     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000647     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000648     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000649     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000650                                                                  018600      
000651*============================================================     018700      
000652*                                                           =     018800      
000653* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000654*                                                           =     019000      
000655* DATOS REQUERIDOS :                                        =     019100      
000656*                                                           =     019200      
000657* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000658* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000659* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000660* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000661* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000662*============================================================     019800      
000663                                                                  019900      
000664 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000665     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000666     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000667     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000668     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000669     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000670                                                                  020600      
000671*===============================================================  020700      
000672*                                                              =  020800      
000673* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000674*              MOVIMIENTOS.                                    =  021000      
000675* DATOS REQUERIDOS :                                           =  021100      
000676*                                                              =  021200      
000677* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000678* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000679* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000680* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000681* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000682* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000683*==============================================================   021900      
000684                                                                  022000      
000685 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000686     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000687     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000688     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000689     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000690     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000691     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000692*==============================================================   022800      
000693*                                                             =   022900      
000694* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000695*                                                             =   023100      
000696* CAMPOS REQUERIDOS :                                         =   023200      
000697*                                                             =   023300      
000698* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000699* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000700* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000701* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000702*==============================================================   023800      
000703 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000704    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000705    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000706    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000707    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000708                                                                  024304      
000709*=================================================================024306      
000710*                ENTRY POINT CONSISB01                           =024308      
000711*                                                                =024310      
000712*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000713*                                                                =024314      
000714*  FUNCIONES DISPONIBLES :                                       =024316      
000715*                                                                =024318      
000716*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000717*                                                                =024322      
000718*  PARAMETROS REQUERIDOS                                         =024324      
000719*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000720*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000721*=================================================================024330      
000722                                                                  024332      
000723 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000724     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000725     03 WKS-CON-CSI                PIC 9(02).                     024336      
000726     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000727     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000728        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000729        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000730        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000731        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000732        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000733                                                                  024400      
000734*=================================================================024500      
000735*                ENTRY POINT B02ARCINTER                         =024600      
000736*                                                                =024700      
000737*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000738*                                                                =024900      
000739*  FUNCIONES DISPONIBLES :                                       =025000      
000740*                                                                =025100      
000741*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000742* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000743* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000744* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000745*                                                                =025600      
000746*  PARAMETROS REQUERIDOS                                         =025700      
000747*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000748*                                                                =025900      
000749*=================================================================026000      
000750 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000751     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000752     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000753     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000754     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000755     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000756     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000757     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000758     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000759     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000760     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000761     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000762     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000763     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000764     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000765     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000766     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000767     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000768     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000769     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000770     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000771     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000772     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000773     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000774     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000775     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000776     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000777     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000778     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000779                                                                  029000      
000780*=================================================================029100      
000781*                ENTRY POINT B04SISTEMA                          =029200      
000782*                                                                =029300      
000783*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000784*                                                                =029500      
000785*  FUNCIONES DISPONIBLES :                                       =029600      
000786*                                                                =029700      
000787*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000788*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000789*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000790*                                                                =030100      
000791*  PARAMETROS REQUERIDOS                                         =030200      
000792*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000793*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000794*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000795*                                                                =030600      
000796*=================================================================030700      
000797 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000798     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000799     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000800     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000801     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000802     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000803     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000804     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000805                                                                  031600      
000806*================================================================ 031700      
000807*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000808*                                                               = 031900      
000809*  FUNCION                                                      = 032000      
000810*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000811*   19       ALTAS.                                             = 032200      
000812*   22       BAJAS                                              = 032300      
000813*   37       CAMBIOS.                                           = 032400      
000814*                                                               = 032500      
000815*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000816*                      FECHA DE PROCESO                         = 032700      
000817*                      NUMERO DE PROCESO                        = 032800      
000818*                      FECHA INICIO                             = 032900      
000819*                      REGISTRO INICIAL                         = 033000      
000820*================================================================ 033100      
000821                                                                  033200      
000822 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000823     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000824     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000825     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000826     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000827     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000828     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000829     03 WKS-B05-MIX                PIC 9(08).                     034000      
000830     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000831     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000832     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000833     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000834     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000835     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000836                                                                  034700      
000837                                                                  034800      
000838*================================================================ 034900      
000839*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000840*                                                               = 035100      
000841*  FUNCION                                                      = 035200      
000842*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000843*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000844*                                                               = 035500      
000845*================================================================ 035600      
000846                                                                  035700      
000847 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000848     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000849     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000850     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000851     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000852     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000853     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000854                                                                  036500      
000855*===============================================================  036600      
000856*                                                              =  036700      
000857*         ENTRY-POINT CONSISMEN                                =  036800      
000858*                                                              =  036900      
000859*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000860*                      SISTEMA                                 =  037100      
000861*                                                              =  037200      
000862*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000863*                                                              =  037400      
000864*===============================================================  037500      
000865 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000866     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000867     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000868     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000869     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000870     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000871     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000872     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000873     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000874     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000875     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000876     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000877     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000878     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000879     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000880     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000881        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000882        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000883        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000884        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000885        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000886        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000887        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000888                                                                  039900      
000889*=====================================================            040000      
000890*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000891*=====================================================            040200      
000892 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000893     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000894     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000895     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000896                                                                  040700      
000897*=====================================================            040800      
000898*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000899*=====================================================            041000      
000900 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000901     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000902     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000903     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000904                                                                  041500      
000905*=====================================================            041600      
000906*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000907*=====================================================            041800      
000908 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000909     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000910     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000911     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000912*=====================================================            042300      
000913*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000914*=====================================================            042500      
000915 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000916     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000917     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000918     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000919                                                                  043000      
000920*=====================================================            043100      
000921*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000922*=====================================================            043300      
000923 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000924     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000925     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000926     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000927                                                                  043800      
000928*=====================================================            043900      
000929*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000930*=====================================================            044100      
000931 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000932     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000933     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000934     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000935                                                                  044600      
000936*=====================================================            044700      
000937*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000938*=====================================================            044900      
000939 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000940     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000941     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000942     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000943                                                                  045400      
000944*=====================================================            045500      
000945*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000946*=====================================================            045700      
000947 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000948     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000949     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000950     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000951                                                                  046200      
000952*=====================================================            046300      
000953*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000954*=====================================================            046500      
000955 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000956     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000957     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000958     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000959                                                                  047000      
000960*=====================================================            047100      
000961*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000962*=====================================================            047300      
000963 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000964     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000965     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000966     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000967                                                                  047800      
000968*=====================================================            047900      
000969*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000970*=====================================================            048100      
000971 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000972     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000973     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000974     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000975                                                                  048600      
000976*=====================================================            048700      
000977*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000978*=====================================================            048900      
000979 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000980     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000981     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000982     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000983                                                                  049400      
000984*=====================================================            049500      
000985*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000986*=====================================================            049700      
000987 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000988     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000989     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000990     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000991     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000992     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000993     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000994     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000995     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000996     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000997     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000998                                                                  050900      
000999*=====================================================            051000      
001000*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001001*=====================================================            051200      
001002 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001003     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001004     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001005     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001006     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001007                                                                  051800      
001008*=====================================================            051900      
001009*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001010*=====================================================            052100      
001011 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001012     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001013     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001014     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001015     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001016                                                                  052700      
001017*=====================================================            052800      
001018*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001019*=====================================================            053000      
001020 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001021     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001022     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001023     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001024     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001025                                                                  053600      
001026*=====================================================            053700      
001027*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001028*=====================================================            053900      
001029 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001030     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001031     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001032     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001033     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001034                                                                  054500      
001035*=====================================================            054600      
001036*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001037*=====================================================            054800      
001038 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001039     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001040     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001041     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001042     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001043                                                                  055400      
001044*=====================================================            055500      
001045*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001046*=====================================================            055700      
001047 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001048     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001049     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001050     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001051     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001052                                                                  056300      
001053*=====================================================            056400      
001054*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001055*=====================================================            056600      
001056 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001057     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001058     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001059     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001060     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001061                                                                  057200      
001062 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001063*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001064                                                                  027900      
001065                                                                  028000      
001066 01  WKS-NOMBD-SALDOS.                                            028100      
001067     03 WKS-BD-SALDOS              PIC X(17).                     028200      
001068     03 FILLER                     PIC X(01) VALUE ".".           028300      
001069                                                                  028400      
001070 01  WKS-BLANCOS                   PIC X(17) VALUE SPACES.        028500      
001071 01  WKS-NULOS                     PIC X(17).                     028600      
001072                                                                  028700      
001073                                                                  028800      
001074*================  VARIABLE PARA LA LIBRERIA LJ   ===============*028900      
001075                                                                  029000      
001076*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001077* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           029100      
001078**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
001079  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
001080  01 MENSAJE-LJ.                                                  100300      
001081     02 SISTEMA-LJ     PIC X(04).                                 100400      
001082     02 FILLER         PIC X VALUE "/".                           100500      
001083     02 PASO-LJ        PIC X(04).                                 100600      
001084     02 FILLER         PIC X VALUE "/".                           100700      
001085     02 MTP-LJ         PIC 9(03).                                 100800      
001086     02 FILLER         PIC X VALUE ":".                           100900      
001087     02 TIPO-LJ        PIC X.                                     101000      
001088     02 FILLER         PIC X VALUE ">".                           101100      
001089     02 CODIGO-LJ      PIC 9(06).                                 101200      
001090     02 FILLER         PIC X VALUE "<".                           101300      
001091     02 TEXTO-LJ       PIC X(250).                                101400      
001092*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001093                                                                  029200      
001094                                                                  029300      
001095*=========== VARIABLES PARA LIBRERIA CONTROL DE VERSIONES =======*029400      
001096                                                                  029500      
001097 01  WKS-LIBID                     PIC X(12).                     029600      
001098 01  WKS-NOMBLIB                   PIC X(72).                     029700      
001099 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             029800      
001100                                                                  029900      
001101                                                                  030000      
001102*====================  ERRORES  DE  DMSII  ======================*030100      
001103                                                                  030200      
001104*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001105* COPY "S151/FORMATO/ERROR/DMSII." FROM 1000 TO 60000.            030300      
001106                                                                  001000      
001107                                                                  002000      
001108                                                                  003000      
001109*=================================================================004000      
001110*==            FORMATO PARA MANEJO DE ERRORES DE DMSII         ===005000      
001111*=================================================================006000      
001112                                                                  007000      
001113                                                                  008000      
001114                                                                  009000      
001115 01 WKS-NOM-BDERR-DMSII            PIC  X(20).                    010000      
001116 77 WKS-ERR-DMSII                  PIC  9(02)    VALUE ZEROS.     011000      
001117 01 WKS-TAB-ERRDMSII.                                             012000      
001118    02 FILLER                      PIC X(20)     VALUE            013000      
001119    "NOTFOUND          01".                                       014000      
001120    02 FILLER                      PIC X(20)     VALUE            015000      
001121    "DUPLICATES        02".                                       016000      
001122    02 FILLER                      PIC X(20)     VALUE            017000      
001123    "DEADLOCK          03".                                       018000      
001124    02 FILLER                      PIC X(20)     VALUE            019000      
001125    "DATAERROR         04".                                       020000      
001126    02 FILLER                      PIC X(20)     VALUE            021000      
001127    "NOTLOCKED         05".                                       022000      
001128    02 FILLER                      PIC X(20)     VALUE            023000      
001129    "KEYCHANGE         06".                                       024000      
001130    02 FILLER                      PIC X(20)     VALUE            025000      
001131    "SYSTEMERROR       07".                                       026000      
001132    02 FILLER                      PIC X(20)     VALUE            027000      
001133    "READONLY          08".                                       028000      
001134    02 FILLER                      PIC X(20)     VALUE            029000      
001135    "IOERROR           09".                                       030000      
001136    02 FILLER                      PIC X(20)     VALUE            031000      
001137    "LIMITERROR        10".                                       032000      
001138    02 FILLER                      PIC X(20)     VALUE            033000      
001139    "OPENERROR         11".                                       034000      
001140    02 FILLER                      PIC X(20)     VALUE            035000      
001141    "CLOSEERROR        12".                                       036000      
001142    02 FILLER                      PIC X(20)     VALUE            037000      
001143    "NORECORD          13".                                       038000      
001144    02 FILLER                      PIC X(20)     VALUE            039000      
001145    "INUSE             14".                                       040000      
001146    02 FILLER                      PIC X(20)     VALUE            041000      
001147    "AUDITERROR        15".                                       042000      
001148    02 FILLER                      PIC X(20)     VALUE            043000      
001149    "ABORT             16".                                       044000      
001150    02 FILLER                      PIC X(20)     VALUE            045000      
001151    "SECURITYERROR     17".                                       046000      
001152    02 FILLER                      PIC X(20)     VALUE            047000      
001153    "VERSIONERROR      18".                                       048000      
001154    02 FILLER                      PIC X(20)     VALUE            049000      
001155    "FATALERROR        19".                                       050000      
001156    02 FILLER                      PIC X(20)     VALUE            051000      
001157    "INTEGRITY ERROR   20".                                       052000      
001158    02 FILLER                      PIC X(20)     VALUE            053000      
001159    "INTLIBERROR       21".                                       054000      
001160 01 WKS-TAB-ERRDMSII-R REDEFINES WKS-TAB-ERRDMSII.                055000      
001161    02 WKS-ELETAB-ERRDMSII         OCCURS 21 TIMES.               056000      
001162       03 WKS-LEY-ERR-DMSII        PIC X(18).                     057000      
001163       03 WKS-NUM-ERR-DMSII        PIC 99.                        058000      
001164                                                                  059000      
001165 01 WKS-ERR-BD                     PIC 9(04).                     059100      
001166 01 WKS-ESTRUCT-BD                 PIC X(17).                     059200      
001167                                                                  060000      
001168*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001169                                                                  030400      
001170                                                                  030500      
001171*=====================  DATOS DEL EQUIPO  =======================*030600      
001172                                                                  030700      
001173 01 WKS-HOST.                                                     030800      
001174    03 WKS-NUMCSI                  PIC 9(02).                     030900      
001175    03 WKS-NOM-HOST                PIC X(10).                     031000      
001176    03 WKS-NOM-CSI                 PIC X(26).                     031100      
001177    03 WKS-LINEA-BATCH             PIC X(05).                     031200      
001178                                                                  031300      
001179*===============  DATOS GENERALES PARA EL PROCESO  ==============*031400      
001180                                                                  031500      
001181 01  WKS-PARAMETROS.                                              031600      
001182     03 WKS-PARAM-SIS-NOMPACK.                                    031700      
001183        05 WKS-PARAM-SIS           PIC 9(03).                     031800      
001184        05 WKS-NOMBRE-PACK         PIC X(12).                     031900      
001185                                                                  032000      
001186                                                                  032100      
001187 01  WKS-FECHA-PROCESO             PIC 9(08).                     032200      
001188 01  WKS-FECHA-PROCESO-R REDEFINES WKS-FECHA-PROCESO.             032300      
001189     03 WKS-FECPRO-AAAAMM          PIC 9(06).                     032400      
001190     03 WKS-FECPRO-AAAAMM-R REDEFINES WKS-FECPRO-AAAAMM.          032500      
001191        05 WKS-FECPRO-AAAA         PIC 9(04).                     032600      
001192        05 WKS-FECPRO-MM           PIC 9(02).                     032700      
001193     03 WKS-FECPRO-DD              PIC 9(02).                     032800      
001194                                                                  032900      
001195                                                                  033000      
001196*=================  FECHA Y HORA DE EJECUCION  ==================*033100      
001197                                                                  033200      
001198 01  WKS-FECHA-EJECUCION-MDA.                                     033300      
001199     03 WKS-FECHA-EJE-MM           PIC 9(02).                     033400      
001200     03 WKS-FECHA-EJE-DD           PIC 9(02).                     033500      
001201     03 WKS-FECHA-EJE-AA           PIC 9(02).                     033600      
001202                                                                  033700      
001203 01  WKS-FECHA-EJECUCION-AMD.                                     033800      
001204     03 WKS-FECHA-EJEC-AA          PIC 9(02).                     033900      
001205     03 WKS-FECHA-EJEC-MM          PIC 9(02).                     034000      
001206     03 WKS-FECHA-EJEC-DD          PIC 9(02).                     034100      
001207                                                                  034200      
001208 01  WKS-FECHA-CORRIDA.                                           034300      
001209     03 WKS-FECHA-CORR-AAAA        PIC 9(04).                     034400      
001210     03 WKS-FECHA-CORR-MM          PIC 9(02).                     034500      
001211     03 WKS-FECHA-CORR-DD          PIC 9(02).                     034600      
001212                                                                  034700      
001213 01  WKS-HORA                      PIC X(08) TYPE NUMERIC-TIME.   034800      
001214                                                                  034900      
001215                                                                  035000      
001216* LINEAS DE IMPRESION.                                            035100      
001217*=====================                                            035200      
001218                                                                  035300      
001219 01  BLANCOS                       PIC X(132) VALUE SPACES.       035400      
001220                                                                  035500      
001221*===================  ENCABEZADOS DEL LISTADO  ==================*035600      
001222                                                                  035700      
001223 01 WLI-LINEA1.                                                   035800      
001224    02  FILLER                     PIC X(04) VALUE SPACES.        035900      
001225    02  FILLER                     PIC X(17) VALUE                036000      
001226        "R/S151-EXTRACCION".                                      036100      
001227    02  FILLER                     PIC X(20) VALUE SPACES.        036200      
001228    02  FILLER                     PIC X(54) VALUE                036300      
001229        "B A N C O  N A C I O N A L  D E  M E X I C O,  S . A .". 036400      
001230    02  FILLER                     PIC X(22) VALUE SPACES.        036500      
001231    02  FILLER                     PIC X(09) VALUE "PAGINA : ".   036600      
001232    02  WLI-PAGINA                 PIC ZZ9.                       036700      
001233    02  FILLER                     PIC X(03) VALUE SPACES.        036800      
001234                                                                  036900      
001235 01 WLI-LINEA2.                                                   037000      
001236    02  FILLER                     PIC X(04) VALUE SPACES.        037100      
001237    02  FILLER                     PIC X(19) VALUE                037200      
001238        "FECHA DE CORRIDA : ".                                    037300      
001239    02  WLI-FECHA.                                                037400      
001240        03 WLI-FECHA-DD            PIC 9(02).                     037500      
001241        03 FILLER                  PIC X(01) VALUE "/".           037600      
001242        03 WLI-FECHA-MM            PIC 9(02).                     037700      
001243        03 FILLER                  PIC X(01) VALUE "/".           037800      
001244        03 WLI-FECHA-AAAA          PIC 9(04).                     037900      
001245    02  FILLER                     PIC X(10) VALUE SPACES.        038000      
001246    02  FILLER                     PIC X(46) VALUE                038100      
001247        "PROCESO DE EXTRACCION DE LA BD11 DEL SISTEMA S".         038200      
001248    02  WLI-SISTEMA                PIC 9(03).                     038300      
001249    02  FILLER                     PIC X(08) VALUE SPACES.        038400      
001250    02  FILLER                     PIC X(19) VALUE                038500      
001251        "FECHA DE PROCESO : ".                                    038600      
001252    02  WLI-FECPRO.                                               038700      
001253        03 WLI-FECPRO-AAAA         PIC 9(04).                     038800      
001254        03 FILLER                  PIC X(01) VALUE "/".           038900      
001255        03 WLI-FECPRO-MM           PIC 9(02).                     039000      
001256        03 FILLER                  PIC X(01) VALUE "/".           039100      
001257        03 WLI-FECPRO-DD           PIC 9(02).                     039200      
001258    02  FILLER                     PIC X(03) VALUE SPACES.        039300      
001259                                                                  039400      
001260 01 WLI-LINEA3.                                                   039500      
001261    02  FILLER                     PIC X(04) VALUE SPACES.        039600      
001262    02  FILLER                     PIC X(19) VALUE                039700      
001263        "HORA DE CORRIDA  : ".                                    039800      
001264    02  WLI-HORA                   PIC X(08).                     039900      
001265    02  FILLER                     PIC X(101) VALUE SPACES.       040000      
001266                                                                  040100      
001267 01 WLI-LINEA4.                                                   040200      
001268    02  FILLER                     PIC X(04) VALUE SPACES.        040300      
001269    02  FILLER                     PIC X(20) VALUE                040400      
001270        "PROCESO : EXTRACCION".                                   040500      
001271    02  FILLER                     PIC X(23) VALUE SPACES.        040600      
001272    02  FILLER                     PIC X(41) VALUE                040700      
001273        " ** TOTALES DEL PROCESO DE EXTRACCION ** ".              040800      
001274    02  FILLER                     PIC X(44) VALUE SPACES.        040900      
001275                                                                  041000      
001276                                                                  041100      
001277* DETALLES PARA IMPRESION.                                        041200      
001278*=========================                                        041300      
001279                                                                  041400      
001280 01 REP-TITULO1.                                                  041500      
001281    02  FILLER                     PIC X(12) VALUE SPACES.        041600      
001282    02  FILLER                     PIC X(27) VALUE                041700      
001283        "TOTAL DE CONTRATOS (B20) : ".                            041800      
001284    02  TOTB20SDOMENCON            PIC Z(08).                     041900      
001285    02  FILLER                     PIC X(20) VALUE SPACES.        042000      
001286    02  FILLER                     PIC X(27) VALUE                042100      
001287        "TOTAL IMPORTE DEL SALDO  : ".                            042200      
001288    02  TOTALB20SDOSD2             PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.042300      
001289    02  FILLER                     PIC X(12) VALUE SPACES.        042400      
001290                                                                  042500      
001291 01 REP-TITULO2.                                                  042600      
001292    02  FILLER                     PIC X(12) VALUE SPACES.        042700      
001293    02  FILLER                     PIC X(27) VALUE                042800      
001294        "TOTAL DE CONTRATOS (B21) : ".                            042900      
001295    02  TOTB21SDMENCON1            PIC Z(08).                     043000      
001296    02  FILLER                     PIC X(20) VALUE SPACES.        043100      
001297    02  FILLER                     PIC X(27) VALUE                043200      
001298        "TOTAL IMPORTE DEL SALDO  : ".                            043300      
001299    02  TOTALB21SDOSD2             PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.043400      
001300    02  FILLER                     PIC X(12) VALUE SPACES.        043500      
001301                                                                  043600      
001302 01 REP-TITULO3.                                                  043700      
001303    02  FILLER                     PIC X(12) VALUE SPACES.        043800      
001304    02  FILLER                     PIC X(27) VALUE                043900      
001305        "TOTAL DE REGISTROS (B70) : ".                            044000      
001306    02  TOTB70POSICION             PIC Z(08).                     044100      
001307    02  FILLER                     PIC X(20) VALUE SPACES.        044200      
001308    02  FILLER                     PIC X(27) VALUE                044300      
001309        "TOTAL IMPORTE DEL SALDO  : ".                            044400      
001310    02  TOTALB70SDOSD2             PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.044500      
001311    02  FILLER                     PIC X(12) VALUE SPACES.        044600      
001312                                                                  044700      
001313 01 REP-TITULO4.                                                  044800      
001314    02  FILLER                     PIC X(12) VALUE SPACES.        044900      
001315    02  FILLER                     PIC X(27) VALUE                045000      
001316        "TOTAL DE REGISTROS (B71) : ".                            045100      
001317    02  TOTB71POSDIAAD1            PIC Z(08).                     045200      
001318    02  FILLER                     PIC X(20) VALUE SPACES.        045300      
001319    02  FILLER                     PIC X(27) VALUE                045400      
001320        "TOTAL IMPORTE DEL SALDO  : ".                            045500      
001321    02  TOTALB71SDOSD2             PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.045600      
001322    02  FILLER                     PIC X(12) VALUE SPACES.        045700      
001323                                                                  045800      
001324 01 REP-TITULO5.                                                  045900      
001325    02  FILLER                     PIC X(12) VALUE SPACES.        046000      
001326    02  FILLER                     PIC X(27) VALUE                046100      
001327        "TOTAL DE REGISTROS (B72) : ".                            046200      
001328    02  TOTB72POSCONTA             PIC Z(08).                     046300      
001329    02  FILLER                     PIC X(20) VALUE SPACES.        046400      
001330    02  FILLER                     PIC X(27) VALUE                046500      
001331        "TOTAL IMPORTE DEL SALDO  : ".                            046600      
001332    02  TOTALB72SDOACT             PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.046700      
001333    02  FILLER                     PIC X(12) VALUE SPACES.        046800      
001334                                                                  046900      
001335 01 REP-TITULO6.                                                  047000      
001336    02  FILLER                     PIC X(12) VALUE SPACES.        047100      
001337    02  FILLER                     PIC X(27) VALUE                047200      
001338        "TOTAL DE CONTRATOS (B80) : ".                            047300      
001339    02  TOTB80EDOCTA               PIC Z(08).                     047400      
001340    02  FILLER                     PIC X(85) VALUE SPACES.        047500      
001341                                                                  047600      
001342                                                                  047700      
001343                                                                  047800      
001344  PROCEDURE DIVISION USING WKS-PARAMETROS.                        047900      
001345*===================                                              048000      
001346                                                                  048100      
001347 00-0000-INICIO SECTION.                                          048200      
001348                                                                  048300      
001349*=========== INICIO DEL PROGRAMA                                  048400      
001350                                                                  048500      
001351 00-0100-CTL-PROCESO.                                             048600      
001352                                                                  048700      
001353     MOVE WKS-NOMBRE-PACK         TO  WKS-B20-PACK, WKS-B21-PACK, 048800      
001354                                      WKS-B70-PACK, WKS-B71-PACK, 048900      
001355                                      WKS-B72-PACK, WKS-B80-PACK. 049000      
001356                                                                  049100      
001357     CHANGE ATTRIBUTE TITLE OF "LIB-DISP" TO                      049200      
001358        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          049300      
001359                                                                  049400      
001360     MOVE "S151"  TO  SISTEMA-LJ                                  049500      
001361     MOVE "P330"  TO  PASO-LJ                                     049600      
001362     MOVE "002"   TO  MTP-LJ                                      049700      
001363     MOVE "I"     TO  TIPO-LJ                                     049800      
001364     MOVE 020101  TO  CODIGO-LJ.                                  049900      
001365                                                                  050000      
001366*    MOVE "I"                      TO TIPO-LJ.                    050100      
001367*    MOVE 020101                   TO CODIGO-LJ.                  050200      
001368*    STRING "INICIO PROCESO DE EXTRACCION DE BASE S151BD11SDOS"   050300      
001369*    DELIMITED BY SIZE                                            050400      
001370*    INTO TEXTO-LJ.                                               050500      
001371*    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                     050600      
001372*                                MENSAJE-LJ.                      050700      
001373                                                                  050800      
001374     PERFORM 01-0000-VERIFICACION.                                050900      
001375     PERFORM 02-0000-PROC-STRUCTURE-B20.                          051000      
001376     PERFORM 03-0000-PROC-STRUCTURE-B21.                          051100      
001377     PERFORM 04-0000-PROC-STRUCTURE-B70.                          051200      
001378     PERFORM 05-0000-PROC-STRUCTURE-B71.                          051300      
001379     PERFORM 06-0000-PROC-STRUCTURE-B72.                          051400      
001380     PERFORM 07-0000-PROC-STRUCTURE-B80.                          051500      
001381     PERFORM 09-0000-PROC-IMPRESION.                              051600      
001382     PERFORM 10-0000-PROC-TERMINA.                                051700      
001383                                                                  051800      
001384     STOP RUN.                                                    051900      
001385                                                                  052000      
001386                                                                  052100      
001387*=================================================================052200      
001388*                       APERTURA DE BASE                         =052300      
001389*=================================================================052400      
001390                                                                  052500      
001391 01-0000-VERIFICACION SECTION.                                    052600      
001392                                                                  052700      
001393 01-0100-VERIFICA-DATOS.                                          052800      
001394*=======================                                          052900      
001395                                                                  053000      
001396     PERFORM 01-0110-LIBRERIAS.                                   053100      
001397*    MOVE "I"                      TO TIPO-LJ.                    053200      
001398*    MOVE 020101                   TO CODIGO-LJ.                  053300      
001399*    STRING "INICIO DE PROCESO FECHA : "                          053400      
001400*           WKS-FECHA-PROCESO                                     053500      
001401*    DELIMITED BY SIZE                                            053600      
001402*    INTO TEXTO-LJ.                                               053700      
001403*    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                     053800      
001404*                                MENSAJE-LJ.                      053900      
001405     CANCEL "CTLVER".                                             054000      
001406     CANCEL "SOPORTECOMS".                                        054100      
001407     MOVE WKS-PARAM-SIS            TO WS-SIS-B20, WS-SIS-B21,     054200      
001408                                      WS-SIS-B70, WS-SIS-B71,     054300      
001409                                      WS-SIS-B72, WS-SIS-B80,     054400      
001410                                      SIST-REP.                   054500      
001411                                                                  054600      
001412     PERFORM 01-0130-ABRE-SALDOS.                                 054700      
001413     PERFORM 01-0140-ABRE-LISTADO.                                054800      
001414                                                                  054900      
001415     GO TO 01-0900-EXIT.                                          055000      
001416                                                                  055100      
001417 01-0110-LIBRERIAS.                                               055200      
001418*==================                                               055300      
001419                                                                  055400      
001420     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.055500      
001421     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS"               055600      
001422                                   TO "SOPORTECOMS".              055700      
001423                                                                  055800      
001424     CALL "CSIID OF SOPORTECOMS" USING WKS-HOST.                  055900      
001425                                                                  056000      
001426     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     056100      
001427     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      056200      
001428                                                                  056300      
001429     MOVE "S080BD01CON"            TO WKS-LIBID.                  056400      
001430     CALL "DAME_TIT IN CTLVER" USING  WKS-LIBID, WKS-NOMBLIB      056500      
001431                               GIVING W77-ERR-CTLVER.             056600      
001432     IF W77-ERR-CTLVER = 0                                        056700      
001433        CHANGE ATTRIBUTE TITLE OF "ESTRUCTURA"   TO WKS-NOMBLIB.  056800      
001434                                                                  056900      
001435     MOVE "S151L001CTL"            TO WKS-LIBID.                  057000      
001436     CALL "DAME_TIT IN CTLVER" USING  WKS-LIBID, WKS-NOMBLIB      057100      
001437                               GIVING W77-ERR-CTLVER.             057200      
001438     IF W77-ERR-CTLVER = 0                                        057300      
001439        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO WKS-NOMBLIB    057400      
001440     ELSE                                                         057500      
001441        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                057600      
001442               "(S151)S151/OBJECT/L001/CONTROL ON CMEMP".         057700      
001443                                                                  057800      
001444     MOVE WKS-PARAM-SIS            TO WKS-B01-SISTEMA.            057900      
001445                                                                  058000      
001446     MOVE 1                        TO WKS-B01-FUNCION.            058100      
001447                                                                  058200      
001448     MOVE WKS-NUMCSI               TO WKS-B01-CSI.                058300      
001449                                                                  058400      
001450     IF ATTRIBUTE VALUE OF MYSELF = 0                             058500      
001451        CALL "CONSISDIA IN LIB-CONTROL"                           058600      
001452             USING  WKS-S151B01SISDIA                             058700      
001453             GIVING W77-RESULT-LIBCON                             058800      
001454        MOVE WKS-B01-FECPRO               TO WKS-FECHA-PROCESO    058900      
001455     ELSE                                                         059000      
001456        MOVE ATTRIBUTE VALUE OF MYSELF    TO WKS-FECHA-PROCESO.   059100      
001457                                                                  059200      
001458                                                                  059300      
001459 01-0130-ABRE-SALDOS.                                             059400      
001460*====================                                             059500      
001461                                                                  059600      
001462     MOVE WKS-PARAM-SIS            TO WKS-B04-SISTEMA             059700      
001463     MOVE 1                        TO WKS-B04-FUNCION             059800      
001464     CALL "B04SISTEM IN LIB-CONTROL" USING WKS-B04SISTEMA         059900      
001465                                     GIVING W77-RESULT-LIBCON.    060000      
001466                                                                  060100      
001467     IF W77-RESULT-LIBCON = 0                                     060200      
001468      IF WKS-B04-ESTATUS = 3                                      060300      
001469                                                                  060400      
001470*============== CONSULTA EL DATA SET S151B03SISMEN ==============*060500      
001471                                                                  060600      
001472                                                                  060700      
001473       MOVE LOW-VALUES             TO WKS-NULOS                   060800      
001474       MOVE WKS-PARAM-SIS          TO WKS-B03-SISTEMA             060900      
001475       MOVE 1                      TO WKS-B03-FUNCION             061000      
001476       CALL "CONSISMEN IN  LIB-CONTROL" USING WKS-S151B03SISMEN   061100      
001477                                        GIVING W77-RESULT-LIBCON  061200      
001478       IF W77-RESULT-LIBCON = 0                                   061300      
001479         IF WKS-B03-TIPBD = 1 OR 2 OR 5 OR 6                      061400      
001480            MOVE WKS-B03-NOMBDSAL   TO WKS-BD-SALDOS              061500      
001481            IF WKS-BD-SALDOS = WKS-BLANCOS OR                     061600      
001482               WKS-BD-SALDOS = WKS-NULOS                          061700      
001483               MOVE "NO EXISTE EN NOMB. DE BD SALDOS" TO TEXTO-LJ 061800      
001484               MOVE "I"             TO TIPO-LJ                    061900      
001485               MOVE 020205          TO CODIGO-LJ                  062000      
001486               CALL "LJ IN LIB-DISP"   USING CONTADOR-LJ,         062100      
001487                                             MENSAJE-LJ           062200      
001488               CHANGE ATTRIBUTE STATUS OF MYSELF TO -1            062300      
001489            ELSE                                                  062400      
001490              CHANGE ATTRIBUTE TITLE OF SALDOS TO WKS-NOMBD-SALDOS062500      
001491              OPEN INQUIRY SALDOS                                 062600      
001492                   ON EXCEPTION                                   062700      
001493                      PERFORM 900000-CHE-STA                      062800      
001494                      CHANGE ATTRIBUTE STATUS OF MYSELF TO -1     062900      
001495         ELSE                                                     063000      
001496           MOVE "I"                TO TIPO-LJ                     063100      
001497           MOVE "EL SISTEMA NO UTILIZA BASE DE SALDOS" TO TEXTO-LJ063200      
001498           MOVE 020205             TO CODIGO-LJ                   063300      
001499           CALL "LJ IN LIB-DISP"   USING CONTADOR-LJ,             063400      
001500                                         MENSAJE-LJ               063500      
001501           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                063600      
001502       ELSE                                                       063700      
001503          IF W77-RESULT-LIBCON = 1                                063800      
001504             MOVE "I"              TO TIPO-LJ                     063900      
001505             MOVE "NO EXITE EL NUMERO DE SISTEMA EN BASE MENSUAL" 064000      
001506                                   TO TEXTO-LJ                    064100      
001507             MOVE 020205           TO CODIGO-LJ                   064200      
001508             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,             064300      
001509                                         MENSAJE-LJ               064400      
001510             CHANGE ATTRIBUTE STATUS OF MYSELF TO -1              064500      
001511          ELSE                                                    064600      
001512             MOVE "I"              TO TIPO-LJ                     064700      
001513             MOVE "ERROR EN BASE DE CONTROL"                      064800      
001514                                   TO TEXTO-LJ                    064900      
001515             MOVE 020205           TO CODIGO-LJ                   065000      
001516             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,             065100      
001517                                         MENSAJE-LJ               065200      
001518             CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.             065300      
001519                                                                  065400      
001520                                                                  065500      
001521 01-0140-ABRE-LISTADO.                                            065600      
001522*=====================                                            065700      
001523                                                                  065800      
001524     ACCEPT WKS-FECHA-EJECUCION-MDA FROM TODAYS-DATE.             065900      
001525     MOVE WKS-FECHA-EJE-MM        TO      WKS-FECHA-EJEC-MM.      066000      
001526     MOVE WKS-FECHA-EJE-DD        TO      WKS-FECHA-EJEC-DD.      066100      
001527     MOVE WKS-FECHA-EJE-AA        TO      WKS-FECHA-EJEC-AA.      066200      
001528                                                                  066300      
001529     MOVE WKS-FECHA-EJECUCION-AMD  TO A2K-FEC-AMD-001.            066400      
001530     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            066500      
001531             A2K-CONV-AMD-TO-CAMD-EXIT                            066600      
001532     MOVE A2K-FEC-CAMD-001         TO WKS-FECHA-CORRIDA.          066700      
001533                                                                  066800      
001534     ACCEPT WKS-HORA               FROM TIME.                     066900      
001535     MOVE WKS-HORA                 TO WLI-HORA.                   067000      
001536     MOVE WKS-NUMCSI               TO NUMCSIREP.                  067100      
001537                                                                  067200      
001538     MOVE WKS-FECHA-CORR-DD        TO WLI-FECHA-DD.               067300      
001539     MOVE WKS-FECHA-CORR-MM        TO WLI-FECHA-MM.               067400      
001540     MOVE WKS-FECHA-CORR-AAAA      TO WLI-FECHA-AAAA.             067500      
001541                                                                  067600      
001542     MOVE ZEROS  TO  A2K-FEC-CAMD-001                             067700      
001543     MOVE WKS-FECHA-PROCESO        TO A2K-FEC-CAMD-001            067800      
001544     PERFORM A2K-CONV-CAMD-TO-AMD THRU                            067900      
001545             A2K-CONV-CAMD-TO-AMD-EXIT                            068000      
001546     MOVE A2K-FEC-AMD-001          TO FECHAREPOR.                 068100      
001547                                                                  068200      
001548     MOVE WKS-PARAM-SIS            TO WLI-SISTEMA.                068300      
001549                                                                  068400      
001550     MOVE WKS-FECPRO-AAAA          TO WLI-FECPRO-AAAA.            068500      
001551     MOVE WKS-FECPRO-MM            TO WLI-FECPRO-MM.              068600      
001552     MOVE WKS-FECPRO-DD            TO WLI-FECPRO-DD.              068700      
001553                                                                  068800      
001554     MOVE ZERO                     TO WS-PAGINA.                  068900      
001555     MOVE ATTRIBUTE STACKNO OF MYSELF TO NUMBERMIX.               069000      
001556     SET IMPRESION(USERBACKUPNAME) TO VALUE TRUE.                 069100      
001557     CHANGE ATTRIBUTE TITLE OF IMPRESION TO WS-REPORTE-EXTRACCION.069200      
001558     OPEN OUTPUT IMPRESION.                                       069300      
001559                                                                  069400      
001560                                                                  069500      
001561 01-0900-EXIT.                                                    069600      
001562*=============                                                    069700      
001563     EXIT.                                                        069800      
001564                                                                  069900      
001565                                                                  070000      
001566 02-0000-PROC-STRUCTURE-B20 SECTION.                              070100      
001567                                                                  070200      
001568 02-0100-PROCESO-B20.                                             070300      
001569*====================                                             070400      
001570                                                                  070500      
001571     SET R20SDOMENCON(USERBACKUPNAME) TO VALUE TRUE.              070600      
001572     CHANGE ATTRIBUTE TITLE OF R20SDOMENCON TO                    070700      
001573            WS-TITLE-B20SDOMENCON.                                070800      
001574     OPEN OUTPUT R20SDOMENCON.                                    070900      
001575     MOVE 0                        TO WS-EOF-B20.                 071000      
001576     SET S151B20SDOMENCON            TO BEGINNING.                071100      
001577                                                                  071200      
001578     IF WKS-PARAM-SIS = 500                                       071300      
001579        FIND FIRST B20SXSDOMENCON AT                              071400      
001580                   B20-SDO-KEYAM  = WKS-FECPRO-AAAAMM  AND        071500      
001581                   B20-SDO-KEYPRD = 1 AND                         071600      
001582                   B20-SDO-KEYINS = 3                             071700      
001583             ON EXCEPTION                                         071800      
001584                IF DMSTATUS(NOTFOUND)                             071900      
001585                   MOVE 1             TO WS-EOF-B20               072000      
001586*                  MOVE "I"           TO TIPO-LJ                  072100      
001587*                  MOVE 010106        TO CODIGO-LJ                072200      
001588*                  MOVE " >> DATASET B20 VACIO           << "     072300      
001589*                                     TO TEXTO-LJ                 072400      
001590*                  CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       072500      
001591*                                              MENSAJE-LJ         072600      
001592                ELSE                                              072700      
001593                   MOVE "I"           TO TIPO-LJ                  072800      
001594                   MOVE 010106        TO CODIGO-LJ                072900      
001595                   MOVE " >> ERROR AL LEER B20SDOMENCON. << "     073000      
001596                                      TO TEXTO-LJ                 073100      
001597                   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       073200      
001598                                               MENSAJE-LJ         073300      
001599                   CALL SYSTEM DMTERMINATE                        073400      
001600     ELSE                                                         073500      
001601        FIND FIRST S151B20SDOMENCON                               073600      
001602             ON EXCEPTION                                         073700      
001603                IF DMSTATUS(NOTFOUND)                             073800      
001604                   MOVE 1             TO WS-EOF-B20               073900      
001605*                  MOVE "I"           TO TIPO-LJ                  074000      
001606*                  MOVE 010106        TO CODIGO-LJ                074100      
001607*                  MOVE " >> DATASET B20 VACIO           << "     074200      
001608*                                     TO TEXTO-LJ                 074300      
001609*                  CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       074400      
001610*                                              MENSAJE-LJ         074500      
001611                ELSE                                              074600      
001612                   MOVE "I"           TO TIPO-LJ                  074700      
001613                   MOVE 010106        TO CODIGO-LJ                074800      
001614                   MOVE " >> ERROR AL LEER B20SDOMENCON. << "     074900      
001615                                      TO TEXTO-LJ                 075000      
001616                   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       075100      
001617                                               MENSAJE-LJ         075200      
001618                   CALL SYSTEM DMTERMINATE.                       075300      
001619                                                                  075400      
001620                                                                  075500      
001621     PERFORM 02-0150-EXTRAE-B20SDOMEN UNTIL WS-EOF-B20 = 1.       075600      
001622                                                                  075700      
001623     CLOSE R20SDOMENCON WITH LOCK.                                075800      
001624                                                                  075900      
001625     GO TO 02-0900-EXIT.                                          076000      
001626                                                                  076100      
001627 02-0150-EXTRAE-B20SDOMEN.                                        076200      
001628*=========================                                        076300      
001629                                                                  076400      
001630     MOVE LOW-VALUES               TO REG-B20SDOMENCON.           076500      
001631                                                                  076600      
001632                                                                  076700      
001633     MOVE S151B20SDOMENCON         TO REG-B20SDOMENCON.           076800      
001634     WRITE REG-B20SDOMENCON                                       076900      
001635           INVALID KEY                                            077000      
001636               MOVE "I"            TO TIPO-LJ                     077100      
001637               MOVE 010105         TO CODIGO-LJ                   077200      
001638               MOVE " >> ERROR AL ESCRIBIR B20SDOMENCON. << "     077300      
001639                                   TO TEXTO-LJ                    077400      
001640               CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,           077500      
001641                                           MENSAJE-LJ             077600      
001642               SET MYSELF(STATUS)  TO  -1.                        077700      
001643                                                                  077800      
001644     ADD 1                TO       WS-ACUM-B20.                   077900      
001645     ADD B20-SDO-SD(2)    TO       WS-TOTALB20SDOSD2.             078000      
001646                                                                  078100      
001647                                                                  078200      
001648     IF WKS-PARAM-SIS = 500                                       078300      
001649        FIND NEXT B20SXSDOMENCON AT                               078400      
001650                  B20-SDO-KEYAM  = WKS-FECPRO-AAAAMM  AND         078500      
001651                  B20-SDO-KEYPRD = 1 AND                          078600      
001652                  B20-SDO-KEYINS = 3                              078700      
001653             ON EXCEPTION                                         078800      
001654                IF DMSTATUS(NOTFOUND)                             078900      
001655                   MOVE 1             TO WS-EOF-B20               079000      
001656                ELSE                                              079100      
001657                   MOVE "I"           TO TIPO-LJ                  079200      
001658                   MOVE 010106        TO CODIGO-LJ                079300      
001659                   MOVE " >> ERROR AL LEER B20SDOMENCON. << "     079400      
001660                                      TO TEXTO-LJ                 079500      
001661                   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       079600      
001662                                               MENSAJE-LJ         079700      
001663                   CALL SYSTEM DMTERMINATE                        079800      
001664     ELSE                                                         079900      
001665        FIND NEXT S151B20SDOMENCON                                080000      
001666             ON EXCEPTION                                         080100      
001667                IF DMSTATUS(NOTFOUND)                             080200      
001668                   MOVE 1             TO WS-EOF-B20               080300      
001669                ELSE                                              080400      
001670                   MOVE "I"           TO TIPO-LJ                  080500      
001671                   MOVE 010106        TO CODIGO-LJ                080600      
001672                   MOVE " >> ERROR AL LEER B20SDOMENCON. << "     080700      
001673                                      TO TEXTO-LJ                 080800      
001674                   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       080900      
001675                                               MENSAJE-LJ         081000      
001676                   CALL SYSTEM DMTERMINATE.                       081100      
001677                                                                  081200      
001678                                                                  081300      
001679 02-0900-EXIT.                                                    081400      
001680*=============                                                    081500      
001681     EXIT.                                                        081600      
001682                                                                  081700      
001683                                                                  081800      
001684 03-0000-PROC-STRUCTURE-B21 SECTION.                              081900      
001685                                                                  082000      
001686 03-0100-PROCESO-B21.                                             082100      
001687*====================                                             082200      
001688                                                                  082300      
001689     SET R21SDMENCON1(USERBACKUPNAME) TO VALUE TRUE.              082400      
001690     CHANGE ATTRIBUTE TITLE OF R21SDMENCON1 TO                    082500      
001691            WS-TITLE-B21SDMENCON1.                                082600      
001692     OPEN OUTPUT R21SDMENCON1.                                    082700      
001693     MOVE 0                        TO WS-EOF-B21.                 082800      
001694     SET S151B21SDMENCON1            TO BEGINNING.                082900      
001695                                                                  083000      
001696     IF WKS-PARAM-SIS = 500                                       083100      
001697        FIND FIRST B21SXSDMENCON1 AT                              083200      
001698                   B21-SDO-KEYAM  = WKS-FECPRO-AAAAMM AND         083300      
001699                   B21-SDO-KEYPRD = 1 AND                         083400      
001700                   B21-SDO-KEYINS = 3                             083500      
001701             ON EXCEPTION                                         083600      
001702                IF DMSTATUS(NOTFOUND)                             083700      
001703                   MOVE 1             TO WS-EOF-B21               083800      
001704*                  MOVE "I"           TO TIPO-LJ                  083900      
001705*                  MOVE 010106        TO CODIGO-LJ                084000      
001706*                  MOVE " >> DATASET B21 VACIO           << "     084100      
001707*                                     TO TEXTO-LJ                 084200      
001708*                  CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       084300      
001709*                                              MENSAJE-LJ         084400      
001710                ELSE                                              084500      
001711                   MOVE "I"           TO TIPO-LJ                  084600      
001712                   MOVE 010106        TO CODIGO-LJ                084700      
001713                   MOVE " >> ERROR AL LEER B21SDMENCON1. << "     084800      
001714                                      TO TEXTO-LJ                 084900      
001715                   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       085000      
001716                                               MENSAJE-LJ         085100      
001717                   CALL SYSTEM DMTERMINATE                        085200      
001718     ELSE                                                         085300      
001719        FIND FIRST S151B21SDMENCON1                               085400      
001720             ON EXCEPTION                                         085500      
001721                IF DMSTATUS(NOTFOUND)                             085600      
001722                   MOVE 1             TO WS-EOF-B21               085700      
001723*                  MOVE "I"           TO TIPO-LJ                  085800      
001724*                  MOVE 010106        TO CODIGO-LJ                085900      
001725*                  MOVE " >> DATASET B21 VACIO           << "     086000      
001726*                                     TO TEXTO-LJ                 086100      
001727*                  CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       086200      
001728*                                              MENSAJE-LJ         086300      
001729                ELSE                                              086400      
001730                   MOVE "I"           TO TIPO-LJ                  086500      
001731                   MOVE 010106        TO CODIGO-LJ                086600      
001732                   MOVE " >> ERROR AL LEER B21SDMENCON1. << "     086700      
001733                                      TO TEXTO-LJ                 086800      
001734                   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       086900      
001735                                               MENSAJE-LJ         087000      
001736                   CALL SYSTEM DMTERMINATE.                       087100      
001737                                                                  087200      
001738     PERFORM 03-0150-EXTRAE-B21SDMEN UNTIL WS-EOF-B21 = 1.        087300      
001739                                                                  087400      
001740     CLOSE R21SDMENCON1 WITH LOCK.                                087500      
001741                                                                  087600      
001742     GO TO 03-0900-EXIT.                                          087700      
001743                                                                  087800      
001744 03-0150-EXTRAE-B21SDMEN.                                         087900      
001745*========================                                         088000      
001746                                                                  088100      
001747     MOVE LOW-VALUES               TO REG-B21SDMENCON1.           088200      
001748                                                                  088300      
001749                                                                  088400      
001750     MOVE S151B21SDMENCON1         TO REG-B21SDMENCON1.           088500      
001751     WRITE REG-B21SDMENCON1                                       088600      
001752           INVALID KEY                                            088700      
001753               MOVE "I"            TO TIPO-LJ                     088800      
001754               MOVE 010105         TO CODIGO-LJ                   088900      
001755               MOVE " >> ERROR AL ESCRIBIR B21SDMENCON1. << "     089000      
001756                                   TO TEXTO-LJ                    089100      
001757               CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,           089200      
001758                                           MENSAJE-LJ             089300      
001759               CALL SYSTEM DMTERMINATE.                           089400      
001760                                                                  089500      
001761     ADD 1                TO       WS-ACUM-B21.                   089600      
001762     ADD B21-SDO-SD(2)    TO       WS-TOTALB21SDOSD2.             089700      
001763                                                                  089800      
001764                                                                  089900      
001765     IF WKS-PARAM-SIS = 500                                       090000      
001766        FIND NEXT B21SXSDMENCON1 AT                               090100      
001767                  B21-SDO-KEYAM  = WKS-FECPRO-AAAAMM AND          090200      
001768                  B21-SDO-KEYPRD = 1 AND                          090300      
001769                  B21-SDO-KEYINS = 3                              090400      
001770             ON EXCEPTION                                         090500      
001771                IF DMSTATUS(NOTFOUND)                             090600      
001772                   MOVE 1             TO WS-EOF-B21               090700      
001773                ELSE                                              090800      
001774                   MOVE "I"           TO TIPO-LJ                  090900      
001775                   MOVE 010106        TO CODIGO-LJ                091000      
001776                   MOVE " >> ERROR AL LEER B21SDMENCON1. << "     091100      
001777                                      TO TEXTO-LJ                 091200      
001778                   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       091300      
001779                                               MENSAJE-LJ         091400      
001780                   CALL SYSTEM DMTERMINATE                        091500      
001781     ELSE                                                         091600      
001782        FIND NEXT S151B21SDMENCON1                                091700      
001783             ON EXCEPTION                                         091800      
001784                IF DMSTATUS(NOTFOUND)                             091900      
001785                   MOVE 1             TO WS-EOF-B21               092000      
001786                ELSE                                              092100      
001787                   MOVE "I"           TO TIPO-LJ                  092200      
001788                   MOVE 010106        TO CODIGO-LJ                092300      
001789                   MOVE " >> ERROR AL LEER B21SDMENCON1. << "     092400      
001790                                      TO TEXTO-LJ                 092500      
001791                   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       092600      
001792                                               MENSAJE-LJ         092700      
001793                   CALL SYSTEM DMTERMINATE.                       092800      
001794                                                                  092900      
001795                                                                  093000      
001796 03-0900-EXIT.                                                    093100      
001797*=============                                                    093200      
001798     EXIT.                                                        093300      
001799                                                                  093400      
001800                                                                  093500      
001801 04-0000-PROC-STRUCTURE-B70 SECTION.                              093600      
001802                                                                  093700      
001803 04-0100-PROCESO-B70.                                             093800      
001804*====================                                             093900      
001805                                                                  094000      
001806     SET R70POSICION(USERBACKUPNAME) TO VALUE TRUE.               094100      
001807     CHANGE ATTRIBUTE TITLE OF R70POSICION TO                     094200      
001808            WS-TITLE-B70POSICION.                                 094300      
001809     OPEN OUTPUT R70POSICION.                                     094400      
001810     MOVE 0                        TO WS-EOF-B70.                 094500      
001811     SET B70SXPOSICION             TO BEGINNING.                  094600      
001812                                                                  094700      
001813     FIND FIRST B70SXPOSICION                                     094800      
001814          ON EXCEPTION                                            094900      
001815             IF DMSTATUS(NOTFOUND)                                095000      
001816                MOVE 1             TO WS-EOF-B70                  095100      
001817*               MOVE "I"           TO TIPO-LJ                     095200      
001818*               MOVE 010106        TO CODIGO-LJ                   095300      
001819*               MOVE " >> DATASET B70 VACIO           << "        095400      
001820*                                  TO TEXTO-LJ                    095500      
001821*               CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,          095600      
001822*                                           MENSAJE-LJ            095700      
001823             ELSE                                                 095800      
001824                MOVE "I"           TO TIPO-LJ                     095900      
001825                MOVE 010106        TO CODIGO-LJ                   096000      
001826                MOVE " >> ERROR AL LEER B70POSICION. << "         096100      
001827                                   TO TEXTO-LJ                    096200      
001828                CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,          096300      
001829                                            MENSAJE-LJ            096400      
001830                CALL SYSTEM DMTERMINATE.                          096500      
001831                                                                  096600      
001832     PERFORM 04-0150-EXTRAE-B70POSIC UNTIL WS-EOF-B70 = 1.        096700      
001833                                                                  096800      
001834     CLOSE R70POSICION WITH LOCK.                                 096900      
001835                                                                  097000      
001836     GO TO 04-0900-EXIT.                                          097100      
001837                                                                  097200      
001838 04-0150-EXTRAE-B70POSIC.                                         097300      
001839*========================                                         097400      
001840                                                                  097500      
001841     MOVE LOW-VALUES               TO REG-B70POSICION.            097600      
001842                                                                  097700      
001843                                                                  097800      
001844     MOVE S151B70POSICION          TO REG-B70POSICION.            097900      
001845     WRITE REG-B70POSICION                                        098000      
001846           INVALID KEY                                            098100      
001847               MOVE "I"            TO TIPO-LJ                     098200      
001848               MOVE 010105         TO CODIGO-LJ                   098300      
001849               MOVE " >> ERROR AL ESCRIBIR B70POSICION. << "      098400      
001850                                   TO TEXTO-LJ                    098500      
001851               CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,           098600      
001852                                           MENSAJE-LJ             098700      
001853               CALL SYSTEM DMTERMINATE.                           098800      
001854                                                                  098900      
001855     ADD 1                TO       WS-ACUM-B70.                   099000      
001856     ADD B70-SDO-SD(2)    TO       WS-TOTALB70SDOSD2.             099100      
001857                                                                  099200      
001858                                                                  099300      
001859     FIND NEXT B70SXPOSICION                                      099400      
001860          ON EXCEPTION                                            099500      
001861             IF DMSTATUS(NOTFOUND)                                099600      
001862                MOVE 1             TO WS-EOF-B70                  099700      
001863             ELSE                                                 099800      
001864                MOVE "I"           TO TIPO-LJ                     099900      
001865                MOVE 010106        TO CODIGO-LJ                   100000      
001866                MOVE " >> ERROR AL LEER B70POSICION. << "         100100      
001867                                   TO TEXTO-LJ                    100200      
001868                CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,          100300      
001869                                            MENSAJE-LJ            100400      
001870                CALL SYSTEM DMTERMINATE.                          100500      
001871                                                                  100600      
001872                                                                  100700      
001873 04-0900-EXIT.                                                    100800      
001874*=============                                                    100900      
001875     EXIT.                                                        101000      
001876                                                                  101100      
001877                                                                  101200      
001878 05-0000-PROC-STRUCTURE-B71 SECTION.                              101300      
001879                                                                  101400      
001880 05-0100-PROCESO-B71.                                             101500      
001881*====================                                             101600      
001882                                                                  101700      
001883     SET R71POSDIAAD1(USERBACKUPNAME) TO VALUE TRUE.              101800      
001884     CHANGE ATTRIBUTE TITLE OF R71POSDIAAD1 TO                    101900      
001885            WS-TITLE-B71POSDIAAD1.                                102000      
001886     OPEN OUTPUT R71POSDIAAD1.                                    102100      
001887     MOVE 0                        TO WS-EOF-B71.                 102200      
001888     SET B71SXPOSDIAAD1            TO BEGINNING.                  102300      
001889                                                                  102400      
001890     FIND FIRST B71SXPOSDIAAD1                                    102500      
001891          ON EXCEPTION                                            102600      
001892             IF DMSTATUS(NOTFOUND)                                102700      
001893                MOVE 1             TO WS-EOF-B71                  102800      
001894*               MOVE "I"           TO TIPO-LJ                     102900      
001895*               MOVE 010106        TO CODIGO-LJ                   103000      
001896*               MOVE " >> DATASET B71 VACIO           << "        103100      
001897*                                  TO TEXTO-LJ                    103200      
001898*               CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,          103300      
001899*                                           MENSAJE-LJ            103400      
001900             ELSE                                                 103500      
001901                MOVE "I"           TO TIPO-LJ                     103600      
001902                MOVE 010106        TO CODIGO-LJ                   103700      
001903                MOVE " >> ERROR AL LEER B71POSDIAAD1. << "        103800      
001904                                   TO TEXTO-LJ                    103900      
001905                CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,          104000      
001906                                            MENSAJE-LJ            104100      
001907                CALL SYSTEM DMTERMINATE.                          104200      
001908                                                                  104300      
001909     PERFORM 05-0150-EXTRAE-B71POSDIA UNTIL WS-EOF-B71 = 1.       104400      
001910                                                                  104500      
001911     CLOSE R71POSDIAAD1 WITH LOCK.                                104600      
001912                                                                  104700      
001913     GO TO 05-0900-EXIT.                                          104800      
001914                                                                  104900      
001915 05-0150-EXTRAE-B71POSDIA.                                        105000      
001916*=========================                                        105100      
001917                                                                  105200      
001918     MOVE LOW-VALUES               TO REG-B71POSDIAAD1.           105300      
001919                                                                  105400      
001920                                                                  105500      
001921     MOVE S151B71POSDIAAD1         TO REG-B71POSDIAAD1.           105600      
001922     WRITE REG-B71POSDIAAD1                                       105700      
001923           INVALID KEY                                            105800      
001924               MOVE "I"            TO TIPO-LJ                     105900      
001925               MOVE 010105         TO CODIGO-LJ                   106000      
001926               MOVE " >> ERROR AL ESCRIBIR B71POSDIAAD1. << "     106100      
001927                                   TO TEXTO-LJ                    106200      
001928               CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,           106300      
001929                                           MENSAJE-LJ             106400      
001930               CALL SYSTEM DMTERMINATE.                           106500      
001931                                                                  106600      
001932     ADD 1                TO       WS-ACUM-B71.                   106700      
001933     ADD B71-SDO-SD(2)    TO       WS-TOTALB71SDOSD2.             106800      
001934                                                                  106900      
001935                                                                  107000      
001936     FIND NEXT B71SXPOSDIAAD1                                     107100      
001937          ON EXCEPTION                                            107200      
001938             IF DMSTATUS(NOTFOUND)                                107300      
001939                MOVE 1             TO WS-EOF-B71                  107400      
001940             ELSE                                                 107500      
001941                MOVE "I"           TO TIPO-LJ                     107600      
001942                MOVE 010106        TO CODIGO-LJ                   107700      
001943                MOVE " >> ERROR AL LEER B71POSDIAAD1. << "        107800      
001944                                   TO TEXTO-LJ                    107900      
001945                CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,          108000      
001946                                            MENSAJE-LJ            108100      
001947                CALL SYSTEM DMTERMINATE.                          108200      
001948                                                                  108300      
001949                                                                  108400      
001950 05-0900-EXIT.                                                    108500      
001951*=============                                                    108600      
001952     EXIT.                                                        108700      
001953                                                                  108800      
001954                                                                  108900      
001955 06-0000-PROC-STRUCTURE-B72 SECTION.                              109000      
001956                                                                  109100      
001957 06-0100-PROCESO-B72.                                             109200      
001958*====================                                             109300      
001959                                                                  109400      
001960     SET R72POSCONTA(USERBACKUPNAME) TO VALUE TRUE.               109500      
001961     CHANGE ATTRIBUTE TITLE OF R72POSCONTA TO                     109600      
001962            WS-TITLE-B72POSCONTA.                                 109700      
001963     OPEN OUTPUT R72POSCONTA.                                     109800      
001964     MOVE 0                        TO WS-EOF-B72.                 109900      
001965     SET B72SXPOSCONTA             TO BEGINNING.                  110000      
001966                                                                  110100      
001967     FIND FIRST B72SXPOSCONTA                                     110200      
001968          ON EXCEPTION                                            110300      
001969             IF DMSTATUS(NOTFOUND)                                110400      
001970                MOVE 1             TO WS-EOF-B72                  110500      
001971*               MOVE "I"           TO TIPO-LJ                     110600      
001972*               MOVE 010106        TO CODIGO-LJ                   110700      
001973*               MOVE " >> DATASET B72 VACIO           << "        110800      
001974*                                  TO TEXTO-LJ                    110900      
001975*               CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,          111000      
001976*                                           MENSAJE-LJ            111100      
001977             ELSE                                                 111200      
001978                MOVE "I"           TO TIPO-LJ                     111300      
001979                MOVE 010106        TO CODIGO-LJ                   111400      
001980                MOVE " >> ERROR AL LEER B72POSCONTA. << "         111500      
001981                                   TO TEXTO-LJ                    111600      
001982                CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,          111700      
001983                                            MENSAJE-LJ            111800      
001984                CALL SYSTEM DMTERMINATE.                          111900      
001985                                                                  112000      
001986     PERFORM 06-0150-EXTRAE-B72POS UNTIL WS-EOF-B72 = 1.          112100      
001987                                                                  112200      
001988     CLOSE R72POSCONTA WITH LOCK.                                 112300      
001989                                                                  112400      
001990     GO TO 06-0900-EXIT.                                          112500      
001991                                                                  112600      
001992 06-0150-EXTRAE-B72POS.                                           112700      
001993*======================                                           112800      
001994                                                                  112900      
001995     MOVE LOW-VALUES               TO REG-B72POSCONTA.            113000      
001996                                                                  113100      
001997                                                                  113200      
001998     MOVE S151B72POSCONTA          TO REG-B72POSCONTA.            113300      
001999     WRITE REG-B72POSCONTA                                        113400      
002000           INVALID KEY                                            113500      
002001               MOVE "I"            TO TIPO-LJ                     113600      
002002               MOVE 010105         TO CODIGO-LJ                   113700      
002003               MOVE " >> ERROR AL ESCRIBIR B72POSCONTA. << "      113800      
002004                                   TO TEXTO-LJ                    113900      
002005               CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,           114000      
002006                                           MENSAJE-LJ             114100      
002007               CALL SYSTEM DMTERMINATE.                           114200      
002008                                                                  114300      
002009     ADD 1                TO       WS-ACUM-B72.                   114400      
002010     ADD B72-SDO-SDOACT   TO       WS-TOTALB72SDOACT.             114500      
002011                                                                  114600      
002012                                                                  114700      
002013     FIND NEXT B72SXPOSCONTA                                      114800      
002014          ON EXCEPTION                                            114900      
002015             IF DMSTATUS(NOTFOUND)                                115000      
002016                MOVE 1             TO WS-EOF-B72                  115100      
002017             ELSE                                                 115200      
002018                MOVE "I"           TO TIPO-LJ                     115300      
002019                MOVE 010106        TO CODIGO-LJ                   115400      
002020                MOVE " >> ERROR AL LEER B72POSCONTA. << "         115500      
002021                                   TO TEXTO-LJ                    115600      
002022                CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,          115700      
002023                                            MENSAJE-LJ            115800      
002024                CALL SYSTEM DMTERMINATE.                          115900      
002025                                                                  116000      
002026                                                                  116100      
002027 06-0900-EXIT.                                                    116200      
002028*=============                                                    116300      
002029     EXIT.                                                        116400      
002030                                                                  116500      
002031                                                                  116600      
002032 07-0000-PROC-STRUCTURE-B80 SECTION.                              116700      
002033                                                                  116800      
002034 07-0100-PROCESO-B80.                                             116900      
002035*====================                                             117000      
002036                                                                  117100      
002037     SET R80EDOCTA(USERBACKUPNAME) TO VALUE TRUE.                 117200      
002038     CHANGE ATTRIBUTE TITLE OF R80EDOCTA TO                       117300      
002039            WS-TITLE-B80EDOCTA.                                   117400      
002040     OPEN OUTPUT R80EDOCTA.                                       117500      
002041     MOVE 0                        TO WS-EOF-B80.                 117600      
002042     SET S151B80EDOCTA               TO BEGINNING.                117700      
002043                                                                  117800      
002044     MOVE 1       TO      WKS-FECPRO-DD.                          117900      
002045                                                                  118000      
002046     IF WKS-PARAM-SIS = 500                                       118100      
002047        FIND FIRST B80SXEDOCTA AT                                 118200      
002048                   B80-SDO-FECCON NOT < WKS-FECHA-PROCESO AND     118300      
002049                   B80-SDO-PRD = 1 AND                            118400      
002050                   B80-SDO-INS = 3                                118500      
002051             ON EXCEPTION                                         118600      
002052                IF DMSTATUS(NOTFOUND)                             118700      
002053                   MOVE 1             TO WS-EOF-B80               118800      
002054*                  MOVE "I"           TO TIPO-LJ                  118900      
002055*                  MOVE 010106        TO CODIGO-LJ                119000      
002056*                  MOVE " >> DATASET B80 VACIO           << "     119100      
002057*                                     TO TEXTO-LJ                 119200      
002058*                  CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       119300      
002059*                                              MENSAJE-LJ         119400      
002060                ELSE                                              119500      
002061                   MOVE "I"           TO TIPO-LJ                  119600      
002062                   MOVE 010106        TO CODIGO-LJ                119700      
002063                   MOVE " >> ERROR AL LEER B80EDOCTA. << "        119800      
002064                                      TO TEXTO-LJ                 119900      
002065                   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       120000      
002066                                               MENSAJE-LJ         120100      
002067                   CALL SYSTEM DMTERMINATE                        120200      
002068     ELSE                                                         120300      
002069        FIND FIRST S151B80EDOCTA                                  120400      
002070             ON EXCEPTION                                         120500      
002071                IF DMSTATUS(NOTFOUND)                             120600      
002072                   MOVE 1             TO WS-EOF-B80               120700      
002073*                  MOVE "I"           TO TIPO-LJ                  120800      
002074*                  MOVE 010106        TO CODIGO-LJ                120900      
002075*                  MOVE " >> DATASET B80 VACIO           << "     121000      
002076*                                     TO TEXTO-LJ                 121100      
002077*                  CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       121200      
002078*                                              MENSAJE-LJ         121300      
002079                ELSE                                              121400      
002080                   MOVE "I"           TO TIPO-LJ                  121500      
002081                   MOVE 010106        TO CODIGO-LJ                121600      
002082                   MOVE " >> ERROR AL LEER B80EDOCTA. << "        121700      
002083                                      TO TEXTO-LJ                 121800      
002084                   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       121900      
002085                                               MENSAJE-LJ         122000      
002086                   CALL SYSTEM DMTERMINATE.                       122100      
002087                                                                  122200      
002088     PERFORM 07-0150-EXTRAE-B80EDO UNTIL WS-EOF-B80 = 1.          122300      
002089                                                                  122400      
002090     CLOSE R80EDOCTA WITH LOCK.                                   122500      
002091                                                                  122600      
002092     GO TO 07-0900-EXIT.                                          122700      
002093                                                                  122800      
002094 07-0150-EXTRAE-B80EDO.                                           122900      
002095*======================                                           123000      
002096                                                                  123100      
002097     MOVE LOW-VALUES               TO REG-B80EDOCTA.              123200      
002098                                                                  123300      
002099                                                                  123400      
002100     MOVE S151B80EDOCTA            TO REG-B80EDOCTA.              123500      
002101     WRITE REG-B80EDOCTA                                          123600      
002102           INVALID KEY                                            123700      
002103               MOVE "I"            TO TIPO-LJ                     123800      
002104               MOVE 010105         TO CODIGO-LJ                   123900      
002105               MOVE " >> ERROR AL ESCRIBIR B80EDOCTA. << "        124000      
002106                                   TO TEXTO-LJ                    124100      
002107               CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,           124200      
002108                                           MENSAJE-LJ             124300      
002109               CALL SYSTEM DMTERMINATE.                           124400      
002110                                                                  124500      
002111     ADD 1                TO       WS-ACUM-B80.                   124600      
002112                                                                  124700      
002113                                                                  124800      
002114     MOVE 1       TO      WKS-FECPRO-DD.                          124900      
002115                                                                  125000      
002116     IF WKS-PARAM-SIS = 500                                       125100      
002117        FIND NEXT B80SXEDOCTA AT                                  125200      
002118                  B80-SDO-FECCON NOT < WKS-FECHA-PROCESO AND      125300      
002119                  B80-SDO-PRD = 1 AND                             125400      
002120                  B80-SDO-INS = 3                                 125500      
002121             ON EXCEPTION                                         125600      
002122                IF DMSTATUS(NOTFOUND)                             125700      
002123                   MOVE 1             TO WS-EOF-B80               125800      
002124                ELSE                                              125900      
002125                   MOVE "I"           TO TIPO-LJ                  126000      
002126                   MOVE 010106        TO CODIGO-LJ                126100      
002127                   MOVE " >> ERROR AL LEER B80EDOCTA. << "        126200      
002128                                      TO TEXTO-LJ                 126300      
002129                   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       126400      
002130                                               MENSAJE-LJ         126500      
002131                   CALL SYSTEM DMTERMINATE                        126600      
002132     ELSE                                                         126700      
002133        FIND NEXT S151B80EDOCTA                                   126800      
002134             ON EXCEPTION                                         126900      
002135                IF DMSTATUS(NOTFOUND)                             127000      
002136                   MOVE 1             TO WS-EOF-B80               127100      
002137                ELSE                                              127200      
002138                   MOVE "I"           TO TIPO-LJ                  127300      
002139                   MOVE 010106        TO CODIGO-LJ                127400      
002140                   MOVE " >> ERROR AL LEER B80EDOCTA. << "        127500      
002141                                      TO TEXTO-LJ                 127600      
002142                   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,       127700      
002143                                               MENSAJE-LJ         127800      
002144                   CALL SYSTEM DMTERMINATE.                       127900      
002145                                                                  128000      
002146                                                                  128100      
002147 07-0900-EXIT.                                                    128200      
002148*=============                                                    128300      
002149     EXIT.                                                        128400      
002150                                                                  128500      
002151                                                                  128600      
002152 08-0000-ERROR-DMSII SECTION.                                     128700      
002153                                                                  128800      
002154*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002155* COPY "S151/FORMATO/ERROR/DMSII." FROM 68000 TO 77000.           128900      
002156 900000-CHE-STA.                                                  068000      
002157     MOVE DMSTATUS(DMCATEGORY)            TO WKS-ERR-DMSII        069000      
002158     MOVE DMSTATUS(DMERRORTYPE)           TO WKS-ERR-BD           069100      
002159     MOVE DMSTATUS(DMSTRUCTURE)           TO WKS-ESTRUCT-BD       069200      
002160                                                                  069300      
002161     IF WKS-ERR-DMSII > ZEROS                                     070000      
002162        STRING  "BASE DATOS  " WKS-NOM-BDERR-DMSII                071000      
002163                "ERROR EN BD " WKS-LEY-ERR-DMSII(WKS-ERR-DMSII)   072000      
002164                           " " WKS-ERR-DMSII                      073000      
002165                "TIPO        " WKS-ERR-BD                         074000      
002166                "ESTRUCTURA  " WKS-ESTRUCT-BD                     075000      
002167        DELIMITED BY SIZE INTO TEXTO-LJ                           076000      
002168        CALL "LJ IN LIB-DISP" USING  CONTADOR-LJ, MENSAJE-LJ.     077000      
002169*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002170                                                                  129000      
002171                                                                  129100      
002172 09-0000-PROC-IMPRESION SECTION.                                  129200      
002173                                                                  129300      
002174 09-0100-PROCESO-IMPRESION.                                       129400      
002175*==========================                                       129500      
002176                                                                  129600      
002177     IF WS-LINEAS > 55                                            129700      
002178        PERFORM 09-0200-ENCABEZADOS.                              129800      
002179                                                                  129900      
002180     MOVE WS-ACUM-B20              TO TOTB20SDOMENCON.            130000      
002181     MOVE WS-TOTALB20SDOSD2        TO TOTALB20SDOSD2.             130100      
002182     MOVE WS-ACUM-B21              TO TOTB21SDMENCON1.            130200      
002183     MOVE WS-TOTALB21SDOSD2        TO TOTALB21SDOSD2.             130300      
002184     MOVE WS-ACUM-B70              TO TOTB70POSICION.             130400      
002185     MOVE WS-TOTALB70SDOSD2        TO TOTALB70SDOSD2.             130500      
002186     MOVE WS-ACUM-B71              TO TOTB71POSDIAAD1.            130600      
002187     MOVE WS-TOTALB71SDOSD2        TO TOTALB71SDOSD2.             130700      
002188     MOVE WS-ACUM-B72              TO TOTB72POSCONTA.             130800      
002189     MOVE WS-TOTALB72SDOACT        TO TOTALB72SDOACT.             130900      
002190     MOVE WS-ACUM-B80              TO TOTB80EDOCTA.               131000      
002191     WRITE LINEA-REP FROM REP-TITULO1  AFTER 15.                  131100      
002192     WRITE LINEA-REP FROM REP-TITULO2  AFTER 3.                   131200      
002193     WRITE LINEA-REP FROM REP-TITULO3  AFTER 3.                   131300      
002194     WRITE LINEA-REP FROM REP-TITULO4  AFTER 3.                   131400      
002195     WRITE LINEA-REP FROM REP-TITULO5  AFTER 3.                   131500      
002196     WRITE LINEA-REP FROM REP-TITULO6  AFTER 3.                   131600      
002197     ADD 30       TO      WS-LINEAS.                              131700      
002198                                                                  131800      
002199     GO TO 09-0900-EXIT.                                          131900      
002200                                                                  132000      
002201 09-0200-ENCABEZADOS.                                             132100      
002202*====================                                             132200      
002203                                                                  132300      
002204     ADD 1                         TO WS-PAGINA.                  132400      
002205     MOVE WS-PAGINA                TO WLI-PAGINA.                 132500      
002206     WRITE LINEA-REP     FROM BLANCOS AFTER CHANNEL 1.            132600      
002207     WRITE LINEA-REP     FROM WLI-LINEA1 AFTER 2.                 132700      
002208     WRITE LINEA-REP     FROM WLI-LINEA2 AFTER 1.                 132800      
002209     WRITE LINEA-REP     FROM WLI-LINEA3 AFTER 1.                 132900      
002210     WRITE LINEA-REP     FROM WLI-LINEA4 AFTER 4.                 133000      
002211     MOVE SPACES                   TO LINEA-REP.                  133100      
002212     WRITE LINEA-REP.                                             133200      
002213     MOVE 10                       TO WS-LINEAS.                  133300      
002214                                                                  133400      
002215                                                                  133500      
002216 09-0900-EXIT.                                                    133600      
002217*=============                                                    133700      
002218     EXIT.                                                        133800      
002219                                                                  133900      
002220                                                                  134000      
002221 10-0000-PROC-TERMINA SECTION.                                    134100      
002222                                                                  134200      
002223 10-0100-PROCESO-TERMINA.                                         134300      
002224*========================                                         134400      
002225                                                                  134500      
002226     CLOSE SALDOS                                                 134600      
002227           ON EXCEPTION                                           134700      
002228              NEXT SENTENCE.                                      134800      
002229                                                                  134900      
002230     CLOSE IMPRESION.                                             135000      
002231                                                                  135100      
002232                                                                  135200      
002233     CANCEL "LIB-CONTROL".                                        135300      
002234*    MOVE "I"                      TO TIPO-LJ.                    135400      
002235*    MOVE 020201                   TO CODIGO-LJ.                  135500      
002236*    MOVE "FIN NORMAL DE PROCESO"  TO TEXTO-LJ.                   135600      
002237*    CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ,             135700      
002238*                                         MENSAJE-LJ.             135800      
002239*                                                                 135900      
002240                                                                  136000      
002241*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002242*    COPY "S151/CRONOS2K/CPY/PD".                                 136100      
002243** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
002244** Unisys has defined for CRONOS2K project                     ** 000200      
002245** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
002246***************************************************************** 000400      
002247***************************************************************** 000600      
002248** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
002249** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
002250** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
002251** date MMDDCCAA, which is returned into the variable          ** 001000      
002252** A2K-FEC-MDCA-001.                                           ** 001100      
002253***************************************************************** 001200      
002254                                                                  001300      
002255 A2K-ACCEPT-TODAYS-DATE.                                          001400      
002256        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
002257*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
002258        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
002259        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
002260        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
002261        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
002262        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
002263                                                                  002200      
002264 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
002265        EXIT.                                                     002240      
002266                                                                  002500      
002267****************************************************************  002600      
002268** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
002269**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
002270**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
002271**baseyear to add the century to the year part.               **  003000      
002272**INPUT is A2K-FEC-AMD-001                                    **  003100      
002273**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
002274****************************************************************  003300      
002275                                                                  003400      
002276 A2K-CONV-AMD-TO-CAMD.                                            003500      
002277         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
002278         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
002279         IF A2K-FEC-AMD-001 = 0                                   003720      
002280            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
002281         ELSE                                                     003741      
002282          IF A2K-FEC-AMD-001 = 999999                             003742      
002283             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
002284         ELSE                                                     003760      
002285         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
002286                 A2K-OBTAIN-CENTURY-EXIT                          003900      
002287         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
002288         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
002289         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
002290         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
002291                                                                  004400      
002292 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
002293         EXIT.                                                    004600      
002294                                                                  004700      
002295******************************************************************004800      
002296**A2K-CONV-MDA-TO-MDCA.                                         **004900      
002297**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
002298** an eight digit format as MMDDCCAA. It use a                  **005100      
002299** baseyear to add century to the yaer.                         **005200      
002300** INPUT is A2K-FEC-MDA-001                                     **005300      
002301** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
002302                                                                  005500      
002303 A2K-CONV-MDA-TO-MDCA.                                            005600      
002304     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
002305     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
002306     IF A2K-FEC-MDA-001 = 0                                       005820      
002307        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
002308     ELSE                                                         005845      
002309      IF A2K-FEC-MDA-001 = 999999                                 005850      
002310         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
002311     ELSE                                                         005860      
002312     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
002313             A2K-OBTAIN-CENTURY-EXIT                              006000      
002314     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
002315     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
002316     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
002317     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
002318                                                                  006500      
002319 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
002320     EXIT.                                                        006700      
002321                                                                  006800      
002322***************************************************************** 006900      
002323**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
002324**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
002325**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
002326**baseyear to add century to the year.                         ** 007300      
002327**INPUT is A2K-FEC-DMA-001                                     ** 007400      
002328**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
002329                                                                  007600      
002330 A2K-CONV-DMA-TO-DMCA.                                            007700      
002331       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
002332       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
002333       IF  A2K-FEC-DMA-001   = 0                                  007920      
002334          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
002335       ELSE                                                       007945      
002336        IF A2K-FEC-DMA-001 = 999999                               007950      
002337          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
002338       ELSE                                                       007960      
002339       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
002340               A2K-OBTAIN-CENTURY-EXIT                            008100      
002341       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
002342       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
002343       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
002344       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
002345                                                                  008600      
002346 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
002347       EXIT.                                                      008800      
002348                                                                  008900      
002349***************************************************************** 009000      
002350** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
002351** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
002352** a 6 digit format as AAMMDD.                                 ** 009300      
002353** It simply removes the century information in the output     ** 009400      
002354** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
002355** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
002356                                                                  009700      
002357 A2K-CONV-CAMD-TO-AMD.                                            009800      
002358     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
002359     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
002360     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
002361     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
002362                                                                  010300      
002363 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
002364      EXIT.                                                       010500      
002365                                                                  010600      
002366******************************************************************010700      
002367******************************************************************010800      
002368** A2K-CONV-MDCA-TO-MDA.                                        **010900      
002369** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
002370** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
002371** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
002372** INPUT is A2K-FEC-MDCA-001                                    **011300      
002373** OUTPUT is A2K-FEC-MDA-001                                    **011400      
002374                                                                  011500      
002375 A2K-CONV-MDCA-TO-MDA.                                            011600      
002376     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
002377     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
002378     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
002379     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
002380                                                                  012100      
002381 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
002382      EXIT.                                                       012300      
002383                                                                  012400      
002384******************************************************************012500      
002385***************************************************************** 012600      
002386** A2K-CONV-DMCA-TO-DMA.                                        **012700      
002387** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
002388** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
002389** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
002390** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
002391** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
002392                                                                  013300      
002393 A2K-CONV-DMCA-TO-DMA.                                            013400      
002394     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
002395     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
002396     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
002397     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
002398                                                                  013900      
002399 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
002400      EXIT.                                                       014100      
002401                                                                  014200      
002402***************************************************************** 014300      
002403 A2K-CONV-MDCA-TO-CAMD.                                           014400      
002404      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
002405      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
002406      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
002407      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
002408      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
002409 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
002410      EXIT.                                                       015100      
002411***************************************************************** 015200      
002412** This paragraph adds century to an year field which is 9(02) ** 015300      
002413** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
002414** Output is A2K-FEC-CCAA-001.                                 ** 015600      
002415***************************************************************** 015700      
002416 A2K-CONV-AA-TO-CCAA.                                             015800      
002417      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
002418      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
002419              A2K-OBTAIN-CENTURY-EXIT.                            016100      
002420      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
002421 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
002422      EXIT.                                                       016400      
002423***************************************************************** 016500      
002424** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
002425** format.                                                     ** 016700      
002426** Input is A2K-FEC-DMCA-001.                                  ** 016800      
002427** Output is A2K-FEC-CAMD-001.                                 ** 016900      
002428***************************************************************** 017000      
002429 A2K-CONV-DMCA-TO-CAMD.                                           017100      
002430      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
002431      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
002432      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
002433      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
002434      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
002435 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
002436      EXIT.                                                       017800      
002437***************************************************************** 017900      
002438** This paragraph desides the Century to be added depending    ** 018000      
002439** on the base year.                                           ** 018100      
002440** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
002441** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
002442***************************************************************** 018400      
002443 A2K-OBTAIN-CENTURY.                                              018500      
002444      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
002445          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
002446      ELSE                                                        018800      
002447          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
002448 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
002449      EXIT.                                                       019100      
002450                                                                  019200      
002451***************************************************************** 019300      
002452** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
002453**  Format                                                     ** 019500      
002454** Input Is A2K-FEC-CAMD-001                                   ** 019600      
002455** Output Is A2K-FEC-DMCA-001                                  ** 019700      
002456***************************************************************** 019800      
002457 A2K-CONV-CAMD-TO-DMCA.                                           019900      
002458      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
002459      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
002460      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
002461      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
002462      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
002463                                                                  020500      
002464 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
002465      EXIT.                                                       020700      
002466                                                                  020800      
002467******************************************************************020900      
002468******************************************************************021000      
002469 A2K-CONV-AM-TO-CAM.                                              021100      
002470      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
002471      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
002472      IF A2K-FEC-AM-001 = 0                                       021220      
002473         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
002474      ELSE                                                        021245      
002475      IF A2K-FEC-AM-001 = 9999                                    021250      
002476         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
002477      ELSE                                                        021260      
002478      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
002479      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
002480      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
002481              A2K-OBTAIN-CENTURY-EXIT                             021600      
002482      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
002483                                                                  021800      
002484 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
002485      EXIT.                                                       022000      
002486                                                                  022100      
002487******************************************************************022200      
002488******************************************************************022300      
002489 A2K-CONV-CAM-TO-AM.                                              022400      
002490      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
002491      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
002492      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
002493                                                                  022800      
002494 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
002495   EXIT.                                                          023000      
002496                                                                  023100      
002497                                                                  023200      
002498                                                                  023500      
002499*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002500 A2K-CPY-EXIT-PARA.                                               136200      
002501    EXIT.                                                         136300      
002502                                                                  136400      
002503                                                                  136500      
002504                                                                  136600      
002505                                                                  136700      
002506                                                                  136800      
