000001$SET LIST                                                         100000      
000002*$$SET TADS                                                       100100      
000003*INICIA CODIGO DE RENOVACION CRONOS 2000                          100200      
000004$SET LISTOMITTED                                                  100300      
000005$SET OLDCODE                                                      100400      
000006*TERMINA CODIGO DE RENOVACION CRONOS 2000                         100500      
000007 IDENTIFICATION DIVISION.                                         100600      
000008 PROGRAM-ID.                                            S151-P110.100700      
000009******************************************************************100800      
000010*  PROGRAMA QUE GENERA EL ARCHIVO PARA LA BIT, ESTE ARCHIVO SE   *100900      
000011*  GENERABA EN EL PASO 108 QUE POR INCREMENTO  DE  MOVIMIENTOS   *101000      
000012*  Y PARA NO ENTREGAR FUERA DE HORARIO LA INFORMACION CONTABLE   *101100      
000013*  SE CREO ESTE PROCESO.                                         *101200      
000014*                                                                *101300      
000015*  SE CONSIDERA EL ARCHIVO DEL S016 CLASIFICADO EN EL PASO 108   *101400      
000016*                                                   ENERO 2006   *101500      
000017******************************************************************101600      
000018 AUTHOR. FABRICA DE SOFTWARE                      AURELIO BARBOSA.101700      
000019******************************************************************101800      
000020*       B I T A C O R A   D E   M O D I F I C A C I O N E S      *101900      
000021*----------------------------------------------------------------*102000      
000022*  FECHA  INI  MTP  DESCRIPCION                                  *102100      
000023*----------------------------------------------------------------*102200      
000024*                                                                *102300      
000025*20080804 R08  001  CAMBIO PARA ENTREGAR A LA BIT ORIGEN 1 Y 3.  *102400      
000026*                                                                *102500      
000027*                                                                *102600      
000028*                                                                *102700      
000029*                                                                *102800      
000030*                                                                *102900      
000031*                                                                *103000      
000032******************************************************************103100      
000033                                                                  103200      
000034 DATE-WRITTEN.                                          ENE, 2006.103300      
000035 DATE-COMPILED.                                         ENE, 2006.103400      
000036                                                                  103500      
000037 ENVIRONMENT DIVISION.                                            103600      
000038 INPUT-OUTPUT SECTION.                                            103700      
000039 FILE-CONTROL.                                                    103800      
000040                                                                  103900      
000041      SELECT LOG151         ASSIGN TO DISK                        104000      
000042                            ACCESS MODE IS SEQUENTIAL.            104100      
000043      SELECT LOG151-COMP    ASSIGN TO DISK                        104200      
000044                            RESERVE 0 AREAS                       104300      
000045                            ORGANIZATION IS SEQUENTIAL            104400      
000046                            ACCESS MODE IS RANDOM                 104500      
000047                            ACTUAL KEY IS LOG-KEY.                104600      
000048      SELECT ARCH-S016      ASSIGN TO DISK.                       104610      
000049      SELECT ARS016-SORTED  ASSIGN TO DISK.                       104700      
000050      SELECT SD-ARCS016     ASSIGN TO SORT DISK.                  104710      
000051      SELECT ARCH-KEY-S016  ASSIGN TO DISK                        104800      
000052                            ORGANIZATION IS SEQUENTIAL            104900      
000053                            ACCESS MODE  IS RANDOM                105000      
000054                            ACTUAL KEY   IS WS-S016-LLAVE.        105100      
000055      SELECT MOVSCIG        ASSIGN TO DISK.                       105200      
000056                                                                  105300      
000057 DATA DIVISION.                                                   105400      
000058 FILE SECTION.                                                    105500      
000059                                                                  105600      
000060 FD LOG151                                                        105700      
000061*=========                                                        105800      
000062    BLOCK CONTAINS             144 RECORDS                        105900      
000063    VALUE OF TITLE          IS WKS-TIT-LOGS151.                   106000      
000064                                                                  106100      
000065 01 REG-LOGS151                   PIC  X(450).                    106200      
000066                                                                  106300      
000067 FD ARCH-S016                                                     106310      
000068    VALUE OF DEPENDENTSPECS IS TRUE                               106320      
000069    VALUE OF TITLE          IS  WKS-TIT-ARCH-S016.                106330      
000070                                                                  106340      
000071*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000072* COPY "S151/FORMATO/ARCHIVO/S016.".                              106350      
000073****************************************************************  000116      
000074*        REGISTRO DEL ARCHIVO DE INTERFASE PARA S016           *  000216      
000075****************************************************************  000316      
000076 01 A00-R00-S016-HDR.                                             000416      
000077*============= TIPO DE REGISTRO 1 SISTEMA S016                    000466      
000078    02 A00-R00-S016-TIPREG         PIC X(01).                     000516      
000079    02 A00-R00-S016-SISORI         PIC X(04).                     000616      
000080    02 A00-R00-S016-FECPRO         PIC 9(08) COMP.                000716      
000081    02 A00-R00-S016-NUMCSI         PIC 9(02) COMP.                000816      
000082    02 FILLER                      PIC X(12).                     000916      
000083                                                                  001016      
000084 01 A00-R01-S016-REGMOV.                                          001116      
000085*============= TIPO REGISTRO 2                                    001166      
000086    02 A00-R01-S016-TIPREG         PIC X(01).                     001216      
000087    02 A00-R01-S016-CLIENTE        PIC 9(12) COMP.                001316      
000088    02 A00-R01-S016-PROD           PIC 9(04) COMP.                001416      
000089    02 A00-R01-S016-INST           PIC 9(02) COMP.                001516      
000090    02 A00-R01-S016-CONTRATO.                                     001616      
000091       04 A00-R01-S016-PREF        PIC 9(04) COMP.                001716      
000092       04 A00-R01-S016-NUMERO      PIC 9(12) COMP.                001816      
000093    02 A00-R01-S016-INTERCIA       PIC 9(06) COMP.                001916      
000094    02 FILLER                      PIC X(06).                     002016      
000095                                                                  002116      
000096 01 A00-R02-S016-TRAILER.                                         002216      
000097*============= TIPO DE REGISTRO 3                                 002266      
000098    02 A00-R02-S016-TIPREG         PIC X(1).                      002316      
000099    02 A00-R02-S016-TOTREG         PIC 9(08) COMP.                002416      
000100    02 FILLER                      PIC X(15).                     002516      
000101*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000102                                                                  106360      
000103 FD ARS016-SORTED                                                 106400      
000104    VALUE OF MAXRECSIZE     IS  15                                106500      
000105    BLOCK CONTAINS          300 RECORDS                           106600      
000106    VALUE OF TITLE          IS  WKS-TIT-SDLOG-S151.               106700      
000107 01 REG-CTO-S016.                                                 106800      
000108    03 WKS-CTO-LLAVE.                                             106900      
000109       05 WKS-CTO-PROD            PIC  9(004) COMP.               107000      
000110       05 WKS-CTO-INST            PIC  9(002) COMP.               107100      
000111       05 WKS-CTO-S016.                                           107200      
000112          07 WKS-NUM-SUC          PIC  9(004) COMP.               107300      
000113          07 WKS-NUM-CTO          PIC  9(012) COMP.               107400      
000114    03 WKS-CTO-INTERCIA           PIC  9(006) COMP.               107500      
000115    03 FILLER                     PIC  X(001).                    107600      
000116                                                                  107700      
000117  SD SD-ARCS016                                                   107702      
000118*=============                                                    107704      
000119  VALUE OF MAXRECSIZE     IS 15                                   107706      
000120  BLOCK CONTAINS          300 RECORDS.                            107708      
000121                                                                  107710      
000122  01 REG-SD-MOVS.                                                 107712      
000123     03 WKS-SD-LLAVE.                                             107714      
000124        05 WKS-SD-PROD                  PIC 9(04) COMP.           107716      
000125        05 WKS-SD-INST                  PIC 9(02) COMP.           107718      
000126        05 WKS-SD-S016                  PIC 9(16) COMP.           107720      
000127     03 WKS-SD-INTERCOMPANY             PIC 9(06) COMP.           107722      
000128     03 FILLER                          PIC X(01).                107724      
000129                                                                  107726      
000130 FD ARCH-KEY-S016                                                 107800      
000131    VALUE OF MAXRECSIZE     IS  15                                107900      
000132    BLOCK CONTAINS          300 RECORDS                           108000      
000133    VALUE OF TITLE          IS  WKS-TIT-ARCHS016.                 108100      
000134 01 S016-CONTRATOS.                                               108200      
000135    03 S016-LLAVE.                                                108300      
000136      05 S016-CTO-PROD            PIC  9(004) COMP.               108400      
000137      05 S016-CTO-INST            PIC  9(002) COMP.               108500      
000138      05 S016-CTO-S016.                                           108600      
000139         07 S016-NUM-SUC          PIC  9(004) COMP.               108700      
000140         07 S016-NUM-CTO          PIC  9(012) COMP.               108800      
000141    03 S016-CTO-INTERCOMPANY      PIC  9(006) COMP.               108900      
000142    03 FILLER                     PIC  X(001).                    109000      
000143 FD LOG151-COMP                                                   109100      
000144*==============                                                   109200      
000145    BLOCK CONTAINS         120 RECORDS                            109300      
000146    VALUE OF TITLE WKS-TIT-DES151.                                109400      
000147                                                                  109500      
000148 01 REG-LOG-COMP                  PIC  X(540).                    109600      
000149                                                                  109700      
000150 FD MOVSCIG                                                       109800      
000151*==========                                                       109900      
000152    VALUE OF AREAS IS 1000                                        110000      
000153    VALUE OF AREASIZE IS 6750                                     110100      
000154    BLOCK CONTAINS 27 RECORDS                                     110200      
000155    VALUE OF TITLE IS WKS-TIT-MOVSCIG.                            110300      
000156 01 REG-MOVSCIG                   PIC  X(1900).                   110400      
000157                                                                  110500      
000158 WORKING-STORAGE SECTION.                                         110600      
000159 77  W77-ERROR-BIT                PIC  9(002).                    110700      
000160 77  W77-BIT-SALIDA               PIC  9(001).                    110800      
000161 01  WKS-LEY-ARCH                 PIC  X(040).                    110900      
000162 01  WKS-RED-LEY        REDEFINES WKS-LEY-ARCH.                   111000      
000163     03 WKS-LEY-P1                PIC  X(015).                    111100      
000164     03 WKS-LEY-P2                PIC  X(025).                    111200      
000165                                                                  111300      
000166*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000167* COPY "S151/CRONOS2K/CPY/WS".                                    111400      
000168******************************************************************000100      
000169** This copyBook defines all the additional variables that      **000200      
000170** Unisys has defined for the CRONOS2K project                  **000300      
000171** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000172******************************************************************000500      
000173                                                                  000600      
000174******************************************************************000700      
000175** These Variables are used to Accept the system date in long   **000800      
000176** format and get the century information                       **000900      
000177** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000178 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000179 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000180    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000181    05 FILLER      PIC X(1).                                      001400      
000182    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000183    05 FILLER      PIC X(1).                                      001600      
000184    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000185    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000186      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000187      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000188******************************************************************002100      
000189                                                                  002200      
000190******************************************************************002300      
000191** This variable defines a date in the format MMDDCCAA          **002400      
000192**                                                              **002500      
000193 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000194 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000195    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000196    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000197    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000198    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000199      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000200      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000201******************************************************************003400      
000202                                                                  003500      
000203******************************************************************003600      
000204** This variable defines a date in the format CCAAMMDD          **003700      
000205**                                                              **003800      
000206 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000207 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000208    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000209    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000210      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000211      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000212    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000213    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000214******************************************************************004700      
000215                                                                  004800      
000216******************************************************************004900      
000217** This variable defines a date in the format DDMMCCAA          **005000      
000218**                                                              **005100      
000219 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000220 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000221    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000222    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000223    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000224    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000225      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000226      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000227******************************************************************006000      
000228                                                                  006100      
000229******************************************************************006200      
000230** This variable defines a date in the Julian Format CCAADDD    **006300      
000231**                                                              **006400      
000232 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000233 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000234    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000235    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000236                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000237      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000238      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000239    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000240******************************************************************007300      
000241                                                                  007400      
000242******************************************************************007500      
000243** This variable defines a date in the format AAMMDD            **007600      
000244**                                                              **007700      
000245 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000246 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000247    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000248    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000249    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000250******************************************************************008300      
000251                                                                  008400      
000252******************************************************************008500      
000253** This variable defines a date in the format MMDDAA            **008600      
000254**                                                              **008700      
000255 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000256 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000257    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000258    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000259    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000260******************************************************************009300      
000261                                                                  009400      
000262******************************************************************009500      
000263** This variable defines a date in the format DDMMAA            **009600      
000264**                                                              **009700      
000265 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000266 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000267    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000268    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000269    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000270******************************************************************010300      
000271                                                                  010400      
000272******************************************************************010500      
000273** These variables are defined to be used for CALL bridge logic **010600      
000274**                                                              **010700      
000275 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000276 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000277 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000278 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000279 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000280 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000281******************************************************************011400      
000282                                                                  011500      
000283******************************************************************011600      
000284** This variable is used for converting only a year field AA to **011700      
000285** CCAA and a CCAA to AA                                        **011800      
000286 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000287 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000288    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000289    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000290 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000291 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000292******************************************************************012300      
000293                                                                  012400      
000294******************************************************************012500      
000295** These variables are Bridge Variables for Intercambio files   **012600      
000296** para EDOCTA                                                  **012700      
000297 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000298 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000299 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000300 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000301 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000302 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000303 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000304******************************************************************013500      
000305* Para MODULO                                                     013600      
000306 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000307******************************************************************013800      
000308******************************************************************013900      
000309** Para FMOVSCHABO                                                014000      
000310 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000311******************************************************************014200      
000312                                                                  014300      
000313******************************************************************014400      
000314***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000315******************************************************************014600      
000316                                                                  014700      
000317 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000318 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000319     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000320     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000321     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000322******************************************************************015300      
000323                                                                  015400      
000324******************************************************************015500      
000325***  These Variables Are Defined For Date In AAMM Format       ***015600      
000326******************************************************************015700      
000327                                                                  015800      
000328 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000329 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000330     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000331     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000332******************************************************************016300      
000333                                                                  016400      
000334                                                                  016500      
000335*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000336 01  A2K-BASE-YEAR                PIC  9(002) VALUE 50.           111500      
000337 77  WS-S016-LLAVE                PIC  9(008) COMP.               111600      
000338 77  W77-ACCESO                   PIC  9(002) VALUE ZERO.         111700      
000339     88 W88-ACCESA-MEMORIA                    VALUE 1.            111800      
000340     88 W88-ACCESA-DISCO                      VALUE 2.            111900      
000341 77  W77-MEM                      PIC  9(006).                    112000      
000342 77  W77-TOT-REG-MEM              PIC  9(006).                    112100      
000343                                                                  112200      
000344 01  WKS-REG-MEM.                                                 112300      
000345     02 WKS-S016-OCURRENCIAS  OCCURS 4500 TIMES.                  112400      
000346        03 WKS-MEM-LLAVE.                                         112500      
000347           05 WKS-MEM-PROD        PIC  9(004) COMP.               112600      
000348           05 WKS-MEM-INST        PIC  9(002) COMP.               112700      
000349           05 WKS-MEM-S016.                                       112800      
000350              07 WKS-NUM-SUC-MEM  PIC  9(004) COMP.               112900      
000351              07 WKS-NUM-CTO-MEM  PIC  9(012) COMP.               113000      
000352        03 WKS-MEM-INTERCIA       PIC  9(006) COMP.               113100      
000353                                                                  113110      
000354 01 A01-REF-TEMP   PIC X(35).                                     113120      
000355 01 A01-REF-TEMP1 REDEFINES   A01-REF-TEMP.                       113130      
000356    03 A01-REF-DOC PIC X(12).                                     113140      
000357    03 A01-REF-DOC-NUM REDEFINES A01-REF-DOC PIC 9(12).           113145      
000358    03 A01-REF-RES PIC X(23).                                     113150      
000359*    03 A01-REF-DOC2 PIC X(12).                                   113160      
000360*    03 A01-REF-DOC2-NUM REDEFINES A01-REF-DOC2 PIC 9(12).        113170      
000361                                                                  113200      
000362*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000363* COPY                                                            113500      
000364*   "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".            113600      
000365*================================================================ 000100      
000366*         ENTRY-POINT CONSISDIA :                               = 000200      
000367*                                                                 000300      
000368* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000369* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000370* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000371* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000372* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000373* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000374* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000375* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000376* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000377* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000378*                                                               = 001400      
000379*================================================================ 001500      
000380                                                                  001600      
000381                                                                  001700      
000382*================================================================ 001800      
000383* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000384*                                                               = 002000      
000385* ENTRADA REQUERIDA :                                           = 002100      
000386*                                                               = 002200      
000387*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000388*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000389*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000390*================================================================ 002600      
000391 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000392    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000393    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000394    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000395    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000396    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000397    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000398    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000399    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000400    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000401    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000402    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000403    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000404    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000405    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000406    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000407    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000408    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000409    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000410    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000411    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000412       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000413       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000414       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000415       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000416*==============================================================   005200      
000417*                                                             =   005300      
000418* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000419*                                                             =   005500      
000420* CAMPOS REQUERIDOS :                                         =   005600      
000421*                                                             =   005700      
000422* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000423* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000424* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000425* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000426*==============================================================   006200      
000427 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000428    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000429    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000430    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000431    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000432                                                                  006800      
000433*==============================================================   006900      
000434*                                                             =   007000      
000435* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000436*                                                             =   007200      
000437* CAMPOS REQUERIDOS :                                         =   007300      
000438*                                                             =   007400      
000439* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000440* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000441* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000442* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000443*==============================================================   007900      
000444 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000445    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000446    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000447    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000448    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000449                                                                  008500      
000450*==============================================================   008600      
000451*                                                             =   008700      
000452* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000453*                                                             =   008900      
000454* CAMPOS REQUERIDOS :                                         =   009000      
000455*                                                             =   009100      
000456* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000457* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000458* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000459* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000460*==============================================================   009600      
000461 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000462    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000463    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000464    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000465    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000466                                                                  010200      
000467*============================================================     010300      
000468* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000469*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000470*                                                           =     010600      
000471*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000472*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000473*                                                           =     010900      
000474*  ENTRADA REQUERIDA.                                       =     011000      
000475*                                                           =     011100      
000476*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000477*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000478*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000479*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000480*============================================================     011600      
000481                                                                  011700      
000482 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000483     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000484     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000485     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000486     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000487                                                                  012300      
000488*=============================================================    012400      
000489*                                                            =    012500      
000490* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000491*             B01-SIS-FECARMOV.                              =    012700      
000492*                                                            =    012800      
000493* ENTRADA REQUERIDAD :                                       =    012900      
000494*                                                            =    013000      
000495*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000496*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000497*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000498*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000499*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000500*=============================================================    013600      
000501                                                                  013700      
000502 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000503     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000504     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000505     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000506     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000507     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000508*================================================================ 014400      
000509*                                                               = 014500      
000510* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000511*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000512*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000513*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000514*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000515*                                                               = 015100      
000516* ENTRADA REQUERIDA :                                           = 015200      
000517*                                                               = 015300      
000518* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000519* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000520* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000521* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000522* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000523*================================================================ 015900      
000524 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000525    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000526    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000527    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000528    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000529    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000530                                                                  016600      
000531*============================================================     016700      
000532*                                                           =     016800      
000533* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000534*                                                           =     017000      
000535* DATOS REQUERIDOS :                                        =     017100      
000536*                                                           =     017200      
000537* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000538* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000539* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000540* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000541* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000542*============================================================     017800      
000543                                                                  017900      
000544 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000545     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000546     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000547     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000548     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000549     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000550                                                                  018600      
000551*============================================================     018700      
000552*                                                           =     018800      
000553* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000554*                                                           =     019000      
000555* DATOS REQUERIDOS :                                        =     019100      
000556*                                                           =     019200      
000557* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000558* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000559* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000560* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000561* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000562*============================================================     019800      
000563                                                                  019900      
000564 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000565     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000566     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000567     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000568     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000569     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000570                                                                  020600      
000571*===============================================================  020700      
000572*                                                              =  020800      
000573* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000574*              MOVIMIENTOS.                                    =  021000      
000575* DATOS REQUERIDOS :                                           =  021100      
000576*                                                              =  021200      
000577* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000578* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000579* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000580* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000581* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000582* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000583*==============================================================   021900      
000584                                                                  022000      
000585 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000586     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000587     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000588     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000589     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000590     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000591     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000592*==============================================================   022800      
000593*                                                             =   022900      
000594* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000595*                                                             =   023100      
000596* CAMPOS REQUERIDOS :                                         =   023200      
000597*                                                             =   023300      
000598* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000599* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000600* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000601* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000602*==============================================================   023800      
000603 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000604    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000605    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000606    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000607    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000608                                                                  024304      
000609*=================================================================024306      
000610*                ENTRY POINT CONSISB01                           =024308      
000611*                                                                =024310      
000612*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000613*                                                                =024314      
000614*  FUNCIONES DISPONIBLES :                                       =024316      
000615*                                                                =024318      
000616*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000617*                                                                =024322      
000618*  PARAMETROS REQUERIDOS                                         =024324      
000619*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000620*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000621*=================================================================024330      
000622                                                                  024332      
000623 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000624     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000625     03 WKS-CON-CSI                PIC 9(02).                     024336      
000626     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000627     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000628        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000629        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000630        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000631        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000632        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000633                                                                  024400      
000634*=================================================================024500      
000635*                ENTRY POINT B02ARCINTER                         =024600      
000636*                                                                =024700      
000637*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000638*                                                                =024900      
000639*  FUNCIONES DISPONIBLES :                                       =025000      
000640*                                                                =025100      
000641*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000642* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000643* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000644* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000645*                                                                =025600      
000646*  PARAMETROS REQUERIDOS                                         =025700      
000647*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000648*                                                                =025900      
000649*=================================================================026000      
000650 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000651     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000652     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000653     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000654     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000655     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000656     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000657     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000658     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000659     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000660     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000661     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000662     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000663     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000664     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000665     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000666     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000667     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000668     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000669     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000670     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000671     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000672     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000673     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000674     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000675     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000676     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000677     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000678     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000679                                                                  029000      
000680*=================================================================029100      
000681*                ENTRY POINT B04SISTEMA                          =029200      
000682*                                                                =029300      
000683*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000684*                                                                =029500      
000685*  FUNCIONES DISPONIBLES :                                       =029600      
000686*                                                                =029700      
000687*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000688*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000689*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000690*                                                                =030100      
000691*  PARAMETROS REQUERIDOS                                         =030200      
000692*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000693*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000694*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000695*                                                                =030600      
000696*=================================================================030700      
000697 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000698     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000699     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000700     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000701     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000702     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000703     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000704     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000705                                                                  031600      
000706*================================================================ 031700      
000707*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000708*                                                               = 031900      
000709*  FUNCION                                                      = 032000      
000710*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000711*   19       ALTAS.                                             = 032200      
000712*   22       BAJAS                                              = 032300      
000713*   37       CAMBIOS.                                           = 032400      
000714*                                                               = 032500      
000715*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000716*                      FECHA DE PROCESO                         = 032700      
000717*                      NUMERO DE PROCESO                        = 032800      
000718*                      FECHA INICIO                             = 032900      
000719*                      REGISTRO INICIAL                         = 033000      
000720*================================================================ 033100      
000721                                                                  033200      
000722 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000723     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000724     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000725     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000726     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000727     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000728     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000729     03 WKS-B05-MIX                PIC 9(08).                     034000      
000730     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000731     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000732     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000733     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000734     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000735     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000736                                                                  034700      
000737                                                                  034800      
000738*================================================================ 034900      
000739*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000740*                                                               = 035100      
000741*  FUNCION                                                      = 035200      
000742*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000743*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000744*                                                               = 035500      
000745*================================================================ 035600      
000746                                                                  035700      
000747 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000748     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000749     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000750     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000751     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000752     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000753     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000754                                                                  036500      
000755*===============================================================  036600      
000756*                                                              =  036700      
000757*         ENTRY-POINT CONSISMEN                                =  036800      
000758*                                                              =  036900      
000759*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000760*                      SISTEMA                                 =  037100      
000761*                                                              =  037200      
000762*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000763*                                                              =  037400      
000764*===============================================================  037500      
000765 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000766     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000767     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000768     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000769     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000770     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000771     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000772     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000773     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000774     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000775     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000776     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000777     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000778     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000779     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000780     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000781        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000782        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000783        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000784        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000785        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000786        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000787        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000788                                                                  039900      
000789*=====================================================            040000      
000790*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000791*=====================================================            040200      
000792 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000793     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000794     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000795     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000796                                                                  040700      
000797*=====================================================            040800      
000798*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000799*=====================================================            041000      
000800 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000801     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000802     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000803     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000804                                                                  041500      
000805*=====================================================            041600      
000806*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000807*=====================================================            041800      
000808 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000809     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000810     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000811     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000812*=====================================================            042300      
000813*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000814*=====================================================            042500      
000815 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000816     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000817     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000818     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000819                                                                  043000      
000820*=====================================================            043100      
000821*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000822*=====================================================            043300      
000823 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000824     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000825     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000826     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000827                                                                  043800      
000828*=====================================================            043900      
000829*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000830*=====================================================            044100      
000831 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000832     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000833     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000834     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000835                                                                  044600      
000836*=====================================================            044700      
000837*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000838*=====================================================            044900      
000839 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000840     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000841     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000842     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000843                                                                  045400      
000844*=====================================================            045500      
000845*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000846*=====================================================            045700      
000847 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000848     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000849     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000850     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000851                                                                  046200      
000852*=====================================================            046300      
000853*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000854*=====================================================            046500      
000855 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000856     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000857     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000858     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000859                                                                  047000      
000860*=====================================================            047100      
000861*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000862*=====================================================            047300      
000863 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000864     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000865     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000866     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000867                                                                  047800      
000868*=====================================================            047900      
000869*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000870*=====================================================            048100      
000871 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000872     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000873     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000874     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000875                                                                  048600      
000876*=====================================================            048700      
000877*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000878*=====================================================            048900      
000879 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000880     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000881     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000882     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000883                                                                  049400      
000884*=====================================================            049500      
000885*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000886*=====================================================            049700      
000887 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000888     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000889     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000890     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000891     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000892     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000893     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000894     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000895     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000896     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000897     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000898                                                                  050900      
000899*=====================================================            051000      
000900*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000901*=====================================================            051200      
000902 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000903     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000904     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000905     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000906     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000907                                                                  051800      
000908*=====================================================            051900      
000909*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000910*=====================================================            052100      
000911 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000912     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000913     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000914     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000915     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000916                                                                  052700      
000917*=====================================================            052800      
000918*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000919*=====================================================            053000      
000920 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000921     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000922     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000923     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000924     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
000925                                                                  053600      
000926*=====================================================            053700      
000927*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
000928*=====================================================            053900      
000929 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
000930     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
000931     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
000932     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
000933     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
000934                                                                  054500      
000935*=====================================================            054600      
000936*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
000937*=====================================================            054800      
000938 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
000939     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
000940     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
000941     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
000942     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
000943                                                                  055400      
000944*=====================================================            055500      
000945*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
000946*=====================================================            055700      
000947 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
000948     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
000949     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
000950     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
000951     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
000952                                                                  056300      
000953*=====================================================            056400      
000954*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
000955*=====================================================            056600      
000956 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
000957     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
000958     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
000959     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
000960     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
000961                                                                  057200      
000962 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
000963*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000964*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000965* COPY                                                            113700      
000966*   "(S151)S151/FORMATO/ARCHIVO/MOVTOS  ON CMEMP.".               113800      
000967                                                                  000100      
000968******************************************************************000200      
000969**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
000970**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
000971**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
000972******************************************************************000600      
000973                                                                  000700      
000974 01 A00-R00-HDR-MOV .                                             000800      
000975    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
000976    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
000977    02 FILLER                          PIC  X(08).                001100      
000978    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
000979    02 FILLER                          PIC  X(430).               001300      
000980                                                                  001400      
000981 01 A00-R01-REGMOV .                                              001500      
000982    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
000983    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
000984    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
000985                                                                  001900      
000986    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
000987    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
000988                                       PIC  9(04)      COMP.      002200      
000989    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
000990                                       PIC  9(04)      COMP.      002400      
000991                                                                  002500      
000992    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000993    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
000994                                       PIC  9(02)      COMP.      002800      
000995    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
000996                                       PIC  9(02)      COMP.      003000      
000997    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
000998    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
000999                                       A00-R01-SERVICIO-ALERTA.   003060      
001000       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
001001       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
001002    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
001003    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
001004    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
001005                                       PIC  9(04)      COMP.      003420      
001006    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
001007    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
001008                                       PIC  9(04)      COMP.      003520      
001009    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
001010    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
001011    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
001012                                       PIC  9(02)      COMP.      003900      
001013                                                                  004000      
001014    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
001015    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
001016       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
001017          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
001018          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
001019          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
001020          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
001021          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
001022          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
001023          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
001024                                                                  005100      
001025    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
001026       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
001027       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
001028       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
001029       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
001030       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
001031       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
001032       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
001033                                                                  006000      
001034       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
001035       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
001036       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
001037       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
001038       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
001039       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
001040       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
001041                                                                  006800      
001042       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
001043       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
001044       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
001045       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
001046       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
001047       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
001048       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
001049                                                                  007600      
001050       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
001051       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
001052       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
001053       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
001054       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
001055       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
001056       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
001057                                                                  008400      
001058       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
001059       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
001060       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
001061       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
001062       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
001063       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
001064       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
001065                                                                  009200      
001066    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
001067    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
001068    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
001069    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
001070    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
001071    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
001072       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
001073    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
001074    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
001075    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
001076    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
001077    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
001078    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
001079    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
001080    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
001081       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
001082       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
001083    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
001084    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
001085    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
001086    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
001087    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
001088    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
001089    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
001090    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
001091    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
001092    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
001093    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
001094    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
001095    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
001096    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
001097                                       PIC X(10).                 012600      
001098    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
001099       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
001100       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
001101    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
001102    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
001103    03 A00-R01-FILIAL                  PIC  X(05).                013200      
001104    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
001105       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
001106       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
001107                                                                  013300      
001108    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
001109    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
001110                                       PIC  X(09).                013600      
001111    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
001112                                       PIC  9(18)      COMP.      013800      
001113    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
001114    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
001115                                       PIC  X(9).                 014100      
001116    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
001117    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
001118                                       PIC  X(05).                014400      
001119    03 A00-R01-NIO                     PIC  X(16).                014500      
001120    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
001121    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
001122    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
001123       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
001124    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
001125    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
001126       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
001127    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
001128    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
001129    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
001130    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
001131    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
001132    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
001133                                       PIC  X(04).                015900      
001134    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
001135    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
001136    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
001137                                       PIC  9(04)      COMP.      016300      
001138    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
001139    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
001140    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
001141    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
001142    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
001143                                                                  016900      
001144    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
001145    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
001146       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
001147    03 A00-R01-FILXAPL                 PIC X(165).                017300      
001148                                                                  017400      
001149    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
001150       05 FILLER                       PIC X(96).                 017510      
001151       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
001152       05 FILLER                       PIC X(67).                 017700      
001153                                                                  017702      
001154    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
001155       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
001156       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
001157       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
001158       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
001159       06 WKS-MOV-FILS084              PIC X(154).                017714      
001160                                                                  017800      
001161    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
001162       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
001163       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
001164       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
001165       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
001166       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
001167       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
001168       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
001169       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
001170       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018160      
001171       05 FILLER                       PIC X(62).                 018170      
001172       05 A00-R01-CTE-087              PIC X(07).                 018210      
001173       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
001174          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
001175          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
001176          07 FILLER                    PIC X(01).                 018281      
001177       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
001178       05 FILLER                       PIC X(61).                 018400      
001179                                                                  018500      
001180    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
001181       05 FILLER                       PIC  X(96).                018610      
001182       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
001183       05 FILLER                       PIC  X(65).                018630      
001184                                                                  018640      
001185    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
001186       05 A00-R01-FORMATO0             PIC  9(02).                018700      
001187       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
001188       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
001189       05 FILLER                       PIC  X(141).               018910      
001190                                                                  019100      
001191    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
001192       05 A00-R01-FORMATO1             PIC  9(02).                019300      
001193       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
001194       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
001195       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
001196       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
001197       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
001198       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
001199       05 A00-R01-ENTSAL               PIC  X(01).                020000      
001200       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
001201       05 FILLER                       PIC  X(69).                020200      
001202                                                                  020300      
001203    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
001204       05 A00-R01-FORMATO2             PIC  9(02).                020500      
001205       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
001206       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
001207       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
001208       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
001209       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
001210       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
001211       05 FILLER                       PIC  X(77).                021200      
001212                                                                  021300      
001213    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
001214       05 A00-R01-FORMATO3             PIC  9(02).                021500      
001215       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
001216       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
001217       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
001218       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
001219       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
001220       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
001221       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
001222       05 FILLER                       PIC  X(69).                022300      
001223                                                                  022400      
001224    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
001225       05 A00-R01-FORMATO4             PIC  9(02).                022600      
001226       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
001227       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
001228       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
001229       05 A00-R01-RFCFT04              PIC  X(13).                023000      
001230       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
001231       05 A00-R01-DIRECCION            PIC  X(40).                023200      
001232       05 FILLER                       PIC  X(85).                023300      
001233                                                                  023400      
001234    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
001235       05 A00-R01-COBERTURA            PIC  X(01).                023408      
001236       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
001237       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
001238       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
001239       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
001240       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
001241       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
001242       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
001243       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
001244       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
001245       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
001246       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
001247       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
001248       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
001249       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
001250       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
001251       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
001252       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
001253       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
001254       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
001255       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
001256       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
001257       05 FILLER                       PIC  X(05).                023492      
001258                                                                  023497      
001259    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
001260       05 A00-R01-4CEROS               PIC  9(04).                023600      
001261       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
001262       05 FILLER                       PIC  X(157).               023800      
001263                                                                  023900      
001264    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
001265       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
001266        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
001267       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
001268       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
001269       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
001270       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
001271       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
001272       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
001273       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
001274       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
001275       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
001276       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
001277       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
001278       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
001279       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
001280       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
001281       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
001282       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
001283       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
001284       05 A00-R01-FILLER               PIC  X(41).                025850      
001285       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
001286       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
001287       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
001288       05 A00-R01-INDPAGO              PIC  9(01).                026200      
001289       05 FILLER                       PIC  X(01).                026210      
001290       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
001291       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
001292       05 FILLER                       PIC  X(52).                026300      
001293                                                                  026400      
001294    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
001295       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
001296       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
001297       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
001298       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
001299       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
001300       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
001301       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
001302       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
001303       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
001304       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
001305       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
001306       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
001307       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
001308          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
001309          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
001310       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
001311       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
001312          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
001313       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
001314          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
001315       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
001316          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
001317       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
001318          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
001319       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
001320          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
001321       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
001322          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
001323       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
001324          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
001325       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
001326          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
001327       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
001328          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
001329       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
001330          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
001331          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
001332       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
001333       05 FILLER                       PIC X(01).                 030101      
001334       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
001335       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
001336       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
001337       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
001338       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
001339       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
001340       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
001341       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
001342          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
001343       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
001344       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
001345       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
001346       05 FILLER                       PIC X(14).                 030700      
001347                                                                  030800      
001348    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
001349       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
001350       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
001351       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
001352       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
001353       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
001354       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
001355       05 A00-R01-151-CITI             PIC  9(02)     COMP.       031520      
001356       05 A00-R01-151-IND-BNE          PIC  9(02)     COMP.       031540      
001357       05 FILLER                       PIC  X(140).               031600      
001358                                                                  031700      
001359    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
001360       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
001361       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
001362       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
001363       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
001364       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
001365       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
001366       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
001367       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
001368       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
001369       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
001370          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
001371          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
001372          07 FILLER                    PIC  X(08).                032740      
001373       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
001374       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
001375       05 A00-R01-NOMORD               PIC  X(30).                033000      
001376       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
001377       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
001378       05 A00-R01-REF-CECO             PIC  X(07).                033500      
001379       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
001380       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
001381          A00-R01-NUM-ORD-PAGO.                                   033800      
001382          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
001383          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
001384                                                                  034100      
001385    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
001386       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
001387       05 A00-R01-RFC-S501             PIC  X(13).                034160      
001388       05 FILLER                       PIC  X(151).               034180      
001389                                                                  034190      
001390    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
001391       05 A00-R01-DATOS-S701           PIC X(116).                034300      
001392       05 A00-R01-PAG-SERV             REDEFINES                  034400      
001393                                       A00-R01-DATOS-S701.        034500      
001394          07 A00-R01-ID                PIC X(30).                 034600      
001395          07 A00-R01-FECREC            PIC 9(06).                 034700      
001396          07 A00-R01-REF1              PIC X(20).                 034800      
001397          07 A00-R01-REF2              PIC X(20).                 034900      
001398          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
001399          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
001400                                       A00-R01-TIPOPAGO.          035200      
001401             09 A00-R01-ESTAB          PIC 9(04).                 035300      
001402             09 A00-R01-SEQ            PIC 9(02).                 035400      
001403          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
001404          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
001405          07 A00-R01-EBPP              PIC 9(03).                 035700      
001406          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
001407          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
001408          07 FILLER                    PIC X(01).                 035728      
001409          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
001410          07 FILLER                    PIC X(18).                 035760      
001411       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
001412                                       A00-R01-DATOS-S701.        035900      
001413          07 A00-R01-RFC               PIC X(13).                 036000      
001414          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
001415          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
001416          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
001417          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
001418          07 FILLER                    PIC X(85).                 036200      
001419       05 FILLER                       PIC X(49).                 036300      
001420                                                                  036400      
001421    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
001422       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
001423       05 A00-R01-CTA-S702             PIC X(40).                 036700      
001424       05 FILLER                       PIC X(113).                036710      
001425                                                                  036720      
001426    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
001427       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
001428       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
001429       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
001430       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
001431       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
001432       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
001433       05 FILLER                       PIC X(72).                 036800      
001434                                                                  036810      
001435                                                                  036820      
001436    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
001437       05 A00-R01-TRUI-S711.                                      036915      
001438          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
001439          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
001440          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
001441           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
001442          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
001443       05 A00-R01-MICR-S711.                                      036945      
001444          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
001445          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
001446          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
001447          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
001448          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
001449          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
001450          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
001451          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
001452       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
001453       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
001454       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
001455       05 A00-R01-FIL-S711             PIC X(05).                 036965      
001456       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
001457       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
001458       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
001459                                                                  036990      
001460    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
001461       05 A00-R01-RFC-502              PIC  X(13).                037100      
001462       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
001463          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
001464          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
001465          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
001466          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
001467          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
001468          07 FILLER                    PIC  9(01) COMP.           037650      
001469       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
001470       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
001471       05 FILLER                       PIC  X(06).                038680      
001472                                                                  038682      
001473    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
001474       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
001475       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
001476       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
001477       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
001478       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
001479       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
001480       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
001481       05 FILLER                       PIC  X(81).                038750      
001482                                                                  038755      
001483    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
001484       05 A00-R01-COP                  PIC  9(13)        .        038900      
001485       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
001486       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
001487       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
001488       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
001489       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
001490       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
001491       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
001492       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
001493       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
001494       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
001495       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
001496       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
001497       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
001498       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
001499       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
001500       05 FILLER                       PIC  X(81)        .        040800      
001501                                                                  040810      
001502    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
001503       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
001504       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
001505       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
001506       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
001507       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
001508       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
001509       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
001510       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
001511       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
001512       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
001513       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
001514       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
001515       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
001516       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
001517       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
001518       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
001519       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
001520       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
001521       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
001522       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
001523       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
001524       05 FILLER                       PIC  X(18).                041040      
001525                                                                  041400      
001526    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
001527    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
001528*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001529*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001530* COPY "(S151)S151/FORMATO/ARCHIVO/DATOSADIC ON CMEMP.".          113900      
001531 01 A01-R00-HDR-DES .                                             000100      
001532     03 A00-R00-HDR-HD                 PIC X(02).                 000200      
001533     03 A00-R00-HDR-FCH                PIC 9(08).                 000300      
001534     03 FILLER                         PIC X(530).                000400      
001535 01 A01-R01-DATOS.                                                000500      
001536     03 A01-R01-AUTS151ORI             PIC 9(08) COMP.            000600      
001537     03 A01-R01-DATOS-1.                                          000610      
001538        05 A01-R01-REF-BANAMEX         PIC X(26).                 000620      
001539        05 A01-R01-CVECON-YREFLOC REDEFINES                       000640      
001540           A01-R01-REF-BANAMEX         PIC X(26).                 000700      
001541        05 A01-R01-CVECON-Y-REFV REDEFINES A01-R01-REF-BANAMEX.   000800      
001542           07 A01-R01-CONT-ORIG        PIC 9(20) COMP.            000900      
001543           07 A01-R01-REFLOC-BNM       PIC X(12).                 001000      
001544           07 A01-R01-REFLOC-23POS REDEFINES A01-R01-REFLOC-BNM.  001100      
001545              09 A01-R01-COMPREF       PIC 9(01) COMP.            001200      
001546              09 A01-R01-REF23POS      PIC 9(23) COMP.            001250      
001547           07 A01-R01-REFALFA REDEFINES A01-R01-REFLOC-BNM        001270      
001548                                       PIC X(12).                 001290      
001549           07 FILLER                   PIC X(04).                 001300      
001550        05 A01-R01-REFLOC7-BNM REDEFINES A01-R01-REF-BANAMEX.     001400      
001551           07 FILLER                   PIC X(02).                 001500      
001552           07 A01-R01-LOC07BNM         PIC X(24).                 001600      
001553        05 A01-R01-NOMINA-FUN1         PIC 9(14) COMP.            003600      
001554        05 A01-R01-NOMINA-FUN2         PIC 9(14) COMP.            003700      
001555        05 A01-R01-SDO-FIN.                                       003720      
001556           07 A01-R01-SDO-FIN-S500     PIC S9(15)V99 COMP.        003740      
001557           07 FILLER                   PIC X(05).                 003760      
001558        05 A01-R01-NOMINAS-MC REDEFINES A01-R01-SDO-FIN.          003780      
001559           07 A01-R01-NOM-MAKER        PIC 9(14) COMP.            003800      
001560           07 A01-R01-NOM-CHECKER      PIC 9(14) COMP.            003900      
001561        05 A01-R01-REF-CLIENTE         PIC X(16).                 004000      
001562        05 A01-R01-REFERENCIA1         PIC X(35).                 004100      
001563        05 A01-R01-REFERENCIA1-S500 REDEFINES A01-R01-REFERENCIA1.004110      
001564           07 A01-R01-ORIG-HRAMOV      PIC 9(06).                 004120      
001565           07 A01-R01-ORIG-FECMOV      PIC 9(06).                 004130      
001566           07 A01-R01-ORIG-FOLIO       PIC X(12).                 004140      
001567           07 A01-R01-ORIG-MDE         PIC 9(02).                 004150      
001568           07 A01-R01-ORIG-FILREF1     PIC X(09).                 004160      
001569        05 A01-R01-REF2-CTE            PIC X(35).                 004200      
001570        05 A01-R01-REF3-CTE            PIC X(35).                 004300      
001571        05 A01-R01-REF4-CTE            PIC X(35).                 004400      
001572        05 A01-R01-DATOS-2.                                       004450      
001573           07 A01-R01-LEY1             PIC X(40).                 004500      
001574           07 A01-R02-LEY2             PIC X(40).                 004600      
001575           07 A01-R02-LEY3             PIC X(40).                 004700      
001576           07 A01-R02-LEY4             PIC X(40).                 004800      
001577           07 A01-R02-LEY5             PIC X(40).                 004900      
001578           07 A01-R01-FILXAPL          PIC X(120).                004910      
001579           07 A01-R01-FILXAPL-S203 REDEFINES A01-R01-FILXAPL.     004912      
001580              09 A01-R01-CVE-IMPTO10   PIC 9(06).                 004914      
001581              09 A01-R01-FORMA-PAG10   PIC 9(03).                 004916      
001582              09 A01-R01-IMP-IMPTO10   PIC 9(12).                 004918      
001583              09 A01-R01-CVE-IMPTO11   PIC 9(06).                 004920      
001584              09 A01-R01-FORMA-PAG11   PIC 9(03).                 004922      
001585              09 A01-R01-IMP-IMPTO11   PIC 9(12).                 004924      
001586              09 A01-R01-CVE-IMPTO12   PIC 9(06).                 004926      
001587              09 A01-R01-FORMA-PAG12   PIC 9(03).                 004928      
001588              09 A01-R01-IMP-IMPTO12   PIC 9(12).                 004930      
001589              09 A01-R01-CVE-IMPTO13   PIC 9(06).                 004932      
001590              09 A01-R01-FORMA-PAG13   PIC 9(03).                 004934      
001591              09 A01-R01-IMP-IMPTO13   PIC 9(12).                 004936      
001592              09 A01-R01-CVE-IMPTO14   PIC 9(06).                 004938      
001593              09 A01-R01-FORMA-PAG14   PIC 9(03).                 004940      
001594              09 A01-R01-IMP-IMPTO14   PIC 9(12).                 004942      
001595              09 FILLER                PIC X(15).                 004944      
001596                                                                  004946      
001597*          07 A01-R01-FILXAPL-S711 REDEFINES A01-R01-FILXAPL.     004948      
001598*             09 A01-R01-TRUI-S711.                               004949      
001599*                11 A01-R01-CSIREC-S711 PIC 9(08) COMP.           004950      
001600*                11 A01-R01-CSIOR-S711  PIC 9(08) COMP.           004951      
001601*                11 A01-R01-NUMOP-S711  PIC 9(08) COMP.           004952      
001602*                11 A01-R01-NUMTR-S711  PIC 9(08) COMP.           004953      
001603*                11 A01-R01-INSMN-S711  PIC 9(02) COMP.           004954      
001604*             09 A01-R01-MICR-S711.                               004955      
001605*                11 A01-R01-CODSEG-S711 PIC 9(04) COMP.           004956      
001606*                11 A01-R01-VERPRE-S711 PIC 9(02) COMP.           004957      
001607*                11 A01-R01-CTRMON-S711 PIC 9(02) COMP.           004958      
001608*                11 A01-R01-PLCEC-S711  PIC 9(04) COMP.           004959      
001609*                11 A01-R01-BNCEM-S711  PIC 9(04) COMP.           004960      
001610*                11 A01-R01-DVEIN-S711  PIC 9(02) COMP.           004961      
001611*                11 A01-R01-CTACH-S711  PIC 9(12) COMP.           004962      
001612*                11 A01-R01-REFCH-S711  PIC 9(08) COMP.           004963      
001613*             09 A01-R01-CTABEN-S711    PIC 9(20) COMP.           004964      
001614*             09 A01-R01-BCREC-S711     PIC 9(04) COMP.           004965      
001615*             09 A01-R01-NOMBEN-S711    PIC X(40).                004966      
001616*             09 A01-R01-RFCBCO-S711    PIC X(13).                004967      
001617*             09 A01-R01-FILLER-S711    PIC X(19).                004968      
001618                                                                  004969      
001619           07 A01-R01-FILXAPL-S701 REDEFINES A01-R01-FILXAPL.     004970      
001620              09 A01-R01-NVAAUT-S701   PIC 9(08).                 004971      
001621              09 A01-R01-NVASUCTR-S701 PIC 9(04).                 004972      
001622              09 A01-R01-NVACAJTR-S701 PIC 9(02).                 004973      
001623              09 A01-R01-NVAFECT-S701  PIC 9(08).                 004974      
001624              09 A01-R01-NVOMDPA-S701  PIC 9(02).                 004975      
001625              09 A01-R01-NVALINC-S701  PIC X(30).                 004976      
001626              09 A01-R01-FILLER2-S701  PIC X(66).                 004977      
001627                                                                  004978      
001628           07 A01-R01-FILXAPL-S702 REDEFINES A01-R01-FILXAPL.     004979      
001629              09 A01-R01-STTRAN-S702   PIC 9(01).                 004980      
001630              09 A01-R01-CTEEMI-S702   PIC 9(12) COMP.            004981      
001631              09 A01-R01-CTADES-S702   PIC 9(20) COMP.            004982      
001632              09 A01-R01-IDEORI-S702   PIC 9(01).                 004983      
001633              09 A01-R01-IDEDES-S702   PIC 9(01).                 004984      
001634              09 A01-R01-TCTAEM-S702   PIC 9(02) COMP.            004985      
001635              09 A01-R01-TIARCH-S702   PIC X(01).                 004986      
001636              09 A01-R01-FECARC-S702   PIC 9(08) COMP.            004987      
001637              09 A01-R01-SECARC-S702   PIC 9(02) COMP.            004988      
001638              09 A01-R01-AUTORI-S702   PIC 9(20) COMP.            004989      
001639              09 A01-R01-NOMUSU-S702   PIC X(40).                 004990      
001640              09 A01-R01-TCTAUS-S702   PIC 9(02) COMP.            004991      
001641              09 A01-R01-SUCCON-S702   PIC 9(04) COMP.            004992      
001642              09 A01-R01-CAJCON-S702   PIC 9(04) COMP.            004993      
001643              09 A01-R01-FILLER-S702   PIC X(39).                 004994      
001644                                                                  004995      
001645           07 A01-R01-FILXAPL-S500 REDEFINES A01-R01-FILXAPL.     004996      
001646              09 A01-R01-NOMB-CTE          PIC  X(36).            004997      
001647              09 A01-R01-NOMB-BENEF        PIC  X(50).            004998      
001648              09 A01-R01-CVE-RASTREO-S500  PIC  X(30).            004999      
001649* INI VML                                                         005000      
001650              09 A01-R01-CVE-RASTREO-S500-R REDEFINES             005001      
001651                              A01-R01-CVE-RASTREO-S500.           005002      
001652                 11 A01-R01-TIP-CTA-TRASP  PIC 9(02).             005004      
001653                 11 A01-R01-BCO-CTA-TRASP  PIC 9(05).             005006      
001654                 11 A01-R01-NUM-CTA-TRASP  PIC 9(18).             005007      
001655                 11 A01-R01-FILLER-TRASP   PIC X(05).             005008      
001656* FIN VML                                                         005009      
001657              09 A01-R01-FECHA-PAGO        PIC  9(08)     COMP.   005010      
001658        05 A01-R01-DATOS-2-S264 REDEFINES A01-R01-DATOS-2.        005012      
001659           07 A01-R01-NOMINA-FUN3      PIC 9(14) COMP.            005014      
001660           07 A01-R01-COMISION         PIC 9(10)V99 COMP.         005016      
001661           07 A01-R01-SITUACION        PIC 9(10)V99 COMP.         005018      
001662           07 A01-R01-IVA-COMIS        PIC 9(08)V99 COMP.         005020      
001663           07 A01-R01-IVA-SITUACION    PIC 9(08)V99 COMP.         005022      
001664           07 A01-R01-IVA-FISCAL       PIC 9(12)V99 COMP.         005024      
001665           07 A01-R01-FOLIO-RECEP      PIC 9(10) COMP.            005026      
001666           07 A01-R01-OCUPACION        PIC X(40).                 005028      
001667           07 A01-R01-POBLACION        PIC X(40).                 005030      
001668           07 A01-R01-TIPO-CTA         PIC 9(02) COMP.            005032      
001669           07 A01-R01-NUM-CTE          PIC 9(12) COMP.            005034      
001670           07 A01-R01-NUM-CTA          PIC 9(20) COMP.            005036      
001671           07 A01-R01-CVE-TIPO-IDEN    PIC 9(02) COMP.            005038      
001672           07 A01-R01-NUM-IDEN-OFIC    PIC X(18).                 005040      
001673           07 A01-R01-FECHA-NAC-BEN    PIC 9(08) COMP.            005042      
001674           07 A01-R01-DOMICILIO        PIC X(55).                 005044      
001675           07 A01-R01-COLONIA          PIC X(30).                 005046      
001676           07 A01-R01-TELEFONO         PIC X(10).                 005048      
001677           07 A01-R01-COD-POS          PIC 9(06) COMP.            005050      
001678           07 A01-R01-REF-EMISOR       PIC X(20).                 005052      
001679           07 A01-R01-PIN              PIC 9(12) COMP.            005054      
001680           07 A01-R01-TIPO-CHQ-ORD     PIC 9(02) COMP.            005056      
001681           07 A01-R01-FECHA-EVENTO     PIC 9(08) COMP.            005058      
001682           07 A01-R01-CVE-RASTREO-S264 PIC X(30).                 005060      
001683     03 A01-R01-DATOS-1-R    REDEFINES A01-R01-DATOS-1.           005062      
001684        05 A01-R01-SUB-STA-DOC         PIC 9(02) COMP.            005064      
001685        05 A01-R01-SUC-DESTINO         PIC 9(04) COMP.            005066      
001686        05 A01-R01-TIPO-PREV           PIC X(01).                 005068      
001687        05 A01-R01-CAUSA-CAN-DEV       PIC 9(04) COMP.            005070      
001688        05 A01-R01-NVO-BCO-ORI         PIC 9(06) COMP.            005072      
001689        05 A01-R01-NVO-BCO-DES         PIC 9(06) COMP.            005074      
001690        05 A01-R01-NOM-BENEF-IDEN      PIC X(55).                 005076      
001691        05 A01-R01-NVO-NOM-BENEF       PIC X(55).                 005078      
001692        05 A01-R01-RFC-CURP-BENEF      PIC X(18).                 005080      
001693        05 A01-R01-GTOS-ORD-PAGO       PIC 9(16)V99 COMP.         005082      
001694        05 A01-R01-TIPO-PAGO-CECO      PIC 9(02) COMP.            005084      
001695        05 A01-R01-TIPO-PAGO-SPEI      PIC 9(02) COMP.            005086      
001696        05 A01-R01-TIPO-CONVENIO       PIC 9(02) COMP.            005088      
001697        05 A01-R01-PZA-EDO             PIC 9(06) COMP.            005090      
001698        05 A01-R01-TIPO-CTA-ABO        PIC 9(02) COMP.            005092      
001699        05 A01-R01-NUM-CTE-ABO         PIC 9(12) COMP.            005094      
001700        05 A01-R01-NUM-CTA-ABO         PIC 9(20) COMP.            005096      
001701        05 FILLER                      PIC X(358).                005098      
001702                                                                  005100      
001703     03 A01-R01-DATOS-2-S500 REDEFINES A01-R01-DATOS-1.           005102      
001704        05 A01-R01-TRUI.                                          005104      
001705           07 A01-R01-CSIID-RECEPTOR   PIC 9(08) COMP.            005106      
001706           07 A01-R01-CSIID-ORIGEN     PIC 9(08) COMP.            005108      
001707           07 A01-R01-NUM-OPERACION    PIC 9(08) COMP.            005110      
001708           07 A01-R01-NUM-TRANSACCI    PIC 9(08) COMP.            005112      
001709           07 A01-R01-INST-MONETARIO   PIC 9(02) COMP.            005114      
001710        05 A01-R01-MICR.                                          005116      
001711           07 A01-R01-COD-SEGURIDAD    PIC 9(04) COMP.            005118      
001712           07 A01-R01-VER-PREMARCADO   PIC 9(02) COMP.            005120      
001713           07 A01-R01-COD-TRANSMONE    PIC 9(02) COMP.            005122      
001714           07 A01-R01-PLAZA-CECOBAN    PIC 9(04) COMP.            005124      
001715           07 A01-R01-COD-BCOEMISOR    PIC 9(04) COMP.            005126      
001716           07 A01-R01-DIG-VINTERCAM    PIC 9(02) COMP.            005128      
001717           07 A01-R01-NUM-CTACHEQUE    PIC 9(12) COMP.            005130      
001718           07 A01-R01-NUM-REFCHEQUE    PIC 9(08) COMP.            005132      
001719        05 A01-R01-CTA-BENEFOTROBCO    PIC 9(20) COMP.            005134      
001720        05 A01-R01-BCO-RECEPOTROBCO    PIC 9(04) COMP.            005136      
001721        05 A01-R01-NOM-BENEFOTROBCO    PIC X(40).                 005138      
001722        05 A01-R01-RFC-OTROBCO         PIC X(13).                 005140      
001723        05 A01-R01-NOMPAN-S500         PIC X(05).                 005142      
001724        05 A01-R01-OPCPAN-S500         PIC X(01).                 005144      
001725        05 A01-R01-NUMCTO1-S500        PIC 9(16) COMP.            005146      
001726        05 A01-R01-NUMCTO2-S500        PIC 9(16) COMP.            005148      
001727        05 A01-R01-NUMCTO3-S500        PIC 9(16) COMP.            005150      
001728        05 A01-R01-INDIC-EST           PIC 9(08) COMP.            005152      
001729        05 A01-R01-IND-SUBC            PIC 9(01) COMP.            005154      
001730        05 A01-R01-PRO-SUBC            PIC 9(04) COMP.            005156      
001731        05 A01-R01-INST-SUBC           PIC 9(04) COMP.            005158      
001732        05 A01-R01-MON-SUBC            PIC 9(03) COMP.            005160      
001733        05 A01-R01-CONT-SUBC           PIC 9(16) COMP.            005162      
001734        05 A01-R01-CTAMDA-SUBC         PIC 9(16) COMP.            005164      
001735        05 A01-R01-STA-SUBC            PIC 9(04) COMP.            005166      
001736        05 A01-R01-INDALER-SUBC        PIC 9(04) COMP.            005168      
001737        05 A01-R01-INDCTACON-SUBC      PIC 9(02) COMP.            005170      
001738        05 A01-R01-LEYENDA-SUBC        PIC X(40).                 005171      
001739        05 A01-R01-VALOR-IND           PIC X(02).                 005172      
001740        05 A01-R01-NOMB-BENEF-AMPLI    PIC X(120).                005173      
001741        05 A01-R01-IND-EXTNET          PIC 9(01) COMP.            005174      
001742        05 A01-R01-FILLER              PIC 9(01) COMP.            005176      
001743        05 A01-R01-FILLER-DATOS2-S500  PIC X(205).                005178      
001744*        05 A01-R01-FILLER-DATOS2-S500  PIC X(328).               005180      
001745*        05 A01-R01-FILLER-DATOS2-S500  PIC X(395).               005182      
001746                                                                  005184      
001747     03 FILLER                         PIC X(01).                 005198      
001748     03 A01-R01-APUDES                 PIC 9(08) COMP.            005200      
001749     03 A01-R01-TIPREG                 PIC 9(02) COMP.            005300      
001750                                                                  005400      
001751******************************************************************005500      
001752*          VARIABLES DE LECTURA DATOS ADICIONALES "2"            *005600      
001753******************************************************************005700      
00175401 A01-R02-TESOFE.                                                005800      
001755    03 A01-R02-AUTS151ORI             PIC 9(08) COMP.             005900      
001756    03 A01-R02-DATOS-2-S500.                                      006000      
001757       05 A01-R02-TRUI.                                           006100      
001758          07 A01-R02-CSIID-RECEPTOR   PIC 9(08) COMP.             006200      
001759          07 A01-R02-CSIID-ORIGEN     PIC 9(08) COMP.             006300      
001760          07 A01-R02-NUM-OPERACION    PIC 9(08) COMP.             006400      
001761          07 A01-R02-NUM-TRANSACCI    PIC 9(08) COMP.             006500      
001762          07 A01-R02-INST-MONETARIO   PIC 9(02) COMP.             006600      
001763       05 A01-R02-MICR.                                           006700      
001764          07 A01-R02-COD-SEGURIDAD    PIC 9(04) COMP.             006800      
001765          07 A01-R02-VER-PREMARCADO   PIC 9(02) COMP.             006900      
001766          07 A01-R02-COD-TRANSMONE    PIC 9(02) COMP.             007000      
001767          07 A01-R02-PLAZA-CECOBAN    PIC 9(04) COMP.             007100      
001768          07 A01-R02-COD-BCOEMISOR    PIC 9(04) COMP.             007200      
001769          07 A01-R02-DIG-VINTERCAM    PIC 9(02) COMP.             007300      
001770          07 A01-R02-NUM-CTACHEQUE    PIC 9(12) COMP.             007400      
001771          07 A01-R02-NUM-REFCHEQUE    PIC 9(08) COMP.             007500      
001772       05 A01-R02-CTA-BENEFOTROBCO    PIC 9(20) COMP.             007600      
001773       05 A01-R02-BCO-RECEPOTROBCO    PIC 9(04) COMP.             007700      
001774       05 A01-R02-NOM-BENEFOTROBCO    PIC X(40).                  007800      
001775       05 A01-R02-RFC-OTROBCO         PIC X(13).                  007900      
001776       05 A01-R02-NOMPAN-S500         PIC X(05).                  008000      
001777       05 A01-R02-OPCPAN-S500         PIC X(01).                  008100      
001778       05 A01-R02-NUMCTO1-S500        PIC 9(16) COMP.             008200      
001779       05 A01-R02-NUMCTO2-S500        PIC 9(16) COMP.             008300      
001780       05 A01-R02-NUMCTO3-S500        PIC 9(16) COMP.             008400      
001781       05 A01-R02-INDIC-EST           PIC 9(08) COMP.             008500      
001782       05 A01-R02-IND-SUBC            PIC 9(01) COMP.             008600      
001783       05 A01-R02-PRO-SUBC            PIC 9(04) COMP.             008700      
001784       05 A01-R02-INST-SUBC           PIC 9(04) COMP.             008800      
001785       05 A01-R02-MON-SUBC            PIC 9(03) COMP.             008900      
001786       05 A01-R02-CONT-SUBC           PIC 9(16) COMP.             009000      
001787       05 A01-R02-CTAMDA-SUBC         PIC 9(16) COMP.             009100      
001788       05 A01-R02-STA-SUBC            PIC 9(04) COMP.             009200      
001789       05 A01-R02-INDALER-SUBC        PIC 9(04) COMP.             009300      
001790       05 A01-R02-INDCTACON-SUBC      PIC 9(02) COMP.             009400      
001791       05 A01-R02-LEYENDA-SUBC        PIC X(40).                  009500      
001792       05 A01-R02-VALOR-IND           PIC X(02).                  009520      
001793       05 A01-R02-NOMB-BENEF-AMPLI    PIC X(120).                 009540      
001794       05 A01-R02-IND-EXTNET          PIC 9(01) COMP.             009545      
001795       05 A01-R02-FILLER              PIC 9(01) COMP.             009550      
001796       05 A01-R02-FILLER-DATOS2-S500  PIC X(205).                 009560      
001797*       05 A01-R02-FILLER-DATOS2-S500  PIC X(327).                009600      
001798                                                                  009700      
001799    03 FILLER                         PIC X(01).                  009800      
001800    03 A01-R02-APUDES                 PIC 9(08) COMP.             009900      
001801    03 A01-R02-TIPREG                 PIC 9(02) COMP.             010000      
001802                                                                  010100      
001803*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001804                                                                  114000      
001805                                                                  114050      
001806* COPY "(S151)S151/FORMATO/ARCHIVO/MOVSCIG/NF ON CMEMP.".         114100      
001807*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001808* COPY "(S151)S151/FORMATO/ARCHIVO/MOVSCIG500 ON CMEMP.".         114110      
001809******************************************************************000100      
001810**        NUEVO LAYOUT PARA EL S500 DE ARCHIVO INTERFACE        **000200      
001811**        DEL S151 PARA LA BIT DATOTECA :                       **000300      
001812**        S151/FORMATO/ARCHIVO/MOVSCIG500                       **000400      
001813**        TAMAµO DEL REGISTRO 1900 CARACTERES                   **000500      
001814**        CON UN BLOQUEAJE DE 36 RECORDS                        **000600      
001815******************************************************************000700      
001816                                                                  000800      
001817 01 WKS-HD500-CIG.                                                000900      
001818    03 WKS-HD500-TIPO-REG               PIC  X(01) VALUE "1".     001000      
001819    03 WKS-HD500-SISTEMA                PIC  X(04) VALUE "S151".  001100      
001820    03 WKS-HD500-FECHA-PROC             PIC  9(08).               001200      
001821    03 WKS-HD500-HORA-PROC              PIC  9(06).               001300      
001822    03 WKS-HD500-FECHA-INF              PIC  9(08).               001400      
001823    03 WKS-HD500-FECHA-FIN              PIC  9(08).               001500      
001824    03 WKS-HD500-NUM-ARCH               PIC  9(02) VALUE 1.       001600      
001825    03 WKS-HD500-CSI                    PIC  9(03).               001700      
001826    03 WKS-HD500-S-C                    PIC  X(01) VALUE "S".     001800      
001827    03 WKS-HD500-SIST-ORI               PIC  X(03).               001900      
001828    03 FILLER                           PIC  X(1856) VALUE SPACES.002000      
001829                                                                  002100      
001830 01 A00-BIT500-REGMOV.                                            002200      
001831    03 A00-BIT500-TIPO-REG              PIC  9(01).               002300      
001832    03 A00-BIT500-FUNCION               PIC  9(02).               002400      
001833    03 A00-BIT500-SISTEMA               PIC  9(04).               002500      
001834    03 A00-BIT500-PRODUCTO              PIC  9(04).               002600      
001835    03 A00-BIT500-INSTRUMENTO           PIC  9(02).               002700      
001836    03 A00-BIT500-SUCPROM               PIC  9(04).               002800      
001837    03 A00-BIT500-CONTRATO              PIC  9(16).               002900      
001838    03 A00-BIT500-CVEIMP                PIC  X(140).              003000      
001839    03 A00-BIT500-CVEIMP-OC           REDEFINES A00-BIT500-CVEIMP.003100      
001840       04 A00-BIT500-ELE-CVEIMP         OCCURS 5 TIMES.           003200      
001841          05 A00-BIT500-CVETRAN         PIC  9(04).               003300      
001842          05 A00-BIT500-INDALFA         PIC  9(02).               003400      
001843          05 A00-BIT500-INDLEY          PIC  9(02).               003500      
001844          05 A00-BIT500-ESQCON          PIC  9(04).               003600      
001845          05 A00-BIT500-TM            REDEFINES A00-BIT500-ESQCON 003700      
001846                                        PIC  9(04).               003800      
001847          05 A00-BIT500-IMPORTE         PIC  9(14)V99.            003900      
001848    03 A00-BIT500-FECMOV                PIC  9(08).               004000      
001849    03 A00-BIT500-HORMOV                PIC  9(06).               004100      
001850    03 A00-BIT500-FECCONT               PIC  9(08).               004200      
001851    03 A00-BIT500-FECVAL                PIC  9(08).               004300      
001852    03 A00-BIT500-AUTORIZA              PIC  9(18).               004400      
001853    03 A00-BIT500-AUT3ER                PIC  9(10).               004500      
001854    03 A00-BIT500-REFNUM-01.                                      004600      
001855       05 A00-BIT500-REFNUM             PIC  9(20).               004700      
001856    03 A00-BIT500-REFNUM-R         REDEFINES A00-BIT500-REFNUM-01.004800      
001857       05 A00-BIT500-IND-EFEC           PIC  9(02).               004900      
001858       05 A00-BIT500-REF-SIS            PIC  X(18).               005000      
001859       05 A00-BIT500-REFNUM-S500   REDEFINES A00-BIT500-REF-SIS.  005500      
001860          07 A00-BIT500-CHVV            PIC  9(04).               005600      
001861          07 A00-BIT500-REFERENCIA      PIC  9(14).               005700      
001862    03 A00-BIT500-CVEMDA                PIC  9(02).               006200      
001863    03 A00-BIT500-NUMMDA                PIC  9(20).               006300      
001864    03 A00-BIT500-NUMMDA-R         REDEFINES A00-BIT500-NUMMDA.   006400      
001865       05 A00-BIT500-MDA-SUC            PIC  9(04).               006500      
001866       05 A00-BIT500-MDA-CTA            PIC  9(16).               006600      
001867    03 A00-BIT500-CVEMDE                PIC  9(02).               006700      
001868    03 A00-BIT500-SUC-INIC              PIC  9(04).               006800      
001869    03 A00-BIT500-CAJA-INIC             PIC  9(04).               006900      
001870    03 A00-BIT500-SUCOPER               PIC  9(04).               007000      
001871    03 A00-BIT500-CAJAOPER              PIC  9(04).               007100      
001872    03 A00-BIT500-SUCTRAN               PIC  9(04).               007200      
001873    03 A00-BIT500-CAJATRAN              PIC  9(04).               007300      
001874    03 A00-BIT500-NOMINA-OPE            PIC  9(14).               007400      
001875    03 A00-BIT500-ORIGEN                PIC  9(02).               007500      
001876    03 A00-BIT500-MONEDA                PIC  9(04).               007600      
001877    03 A00-BIT500-AUT-S151              PIC  9(08).               007700      
001878    03 A00-BIT500-AUTELI-S151           PIC  9(08).               007800      
001879    03 A00-BIT500-AUTELI-ANT-S151       PIC  9(08).               007900      
001880    03 A00-BIT500-TIPO-PROC             PIC  9(02).               008000      
001881    03 A00-BIT500-SOBREGIRO             PIC  9(02).               008100      
001882    03 A00-BIT500-CVEAVISO              PIC  9(04).               008200      
001883    03 A00-BIT500-IND-EDOCTA            PIC  9(02).               008300      
001884    03 A00-BIT500-IND-DATOS-ADIC        PIC  9(02).               008400      
001885    03 A00-BIT500-FECUM-NDIAS           PIC  9(10).               008500      
001886    03 A00-BIT500-NDIAS-R        REDEFINES A00-BIT500-FECUM-NDIAS.008600      
001887       05 A00-BIT500-NUMDIAS            PIC  9(04).               008700      
001888       05 A00-BIT500-NUMDIAS-R     REDEFINES A00-BIT500-NUMDIAS.  008800      
001889          07 A00-BIT500-IND-CONTA       PIC  9(02).               008900      
001890          07 A00-BIT500-IND-NUMREN      PIC  9(02).               009000      
001891       05 A00-BIT500-ACTIVIDAD          PIC  9(06).               009100      
001892    03 A00-BIT500-FECUM-R        REDEFINES A00-BIT500-FECUM-NDIAS.009200      
001893       05 A00-RO1-INDCONTA              PIC  9(02).               009300      
001894       05 A00-BIT500-FEC-ULTMOV         PIC  9(08).               009400      
001895       05 A00-BIT500-FEC-ULT-MOV-R REDEFINES                      009500      
001896                                        A00-BIT500-FEC-ULTMOV.    009550      
001897          07  A00-BIT500-INDNUMREN      PIC  9(02).               009600      
001898          07  A00-BIT500-ACTIVIDAD-R    PIC  9(06).               009700      
001899    03 A00-BIT500-SECTOR                PIC  9(02).               009800      
001900    03 A00-BIT500-BANCA                 PIC  9(02).               009900      
001901    03 WKS-BIT500-MOV-DATOS-CONT-DESV.                            010000      
001902       05  WKS-BIT500-DATAGRUP1-PROD-TPR  PIC  9(04).             010100      
001903       05  WKS-BIT500-DATAGRUP2-INST-TCR  PIC  9(04).             010200      
001904       05  WKS-BIT500-SIRH-DEPTO        PIC  9(04).               010300      
001905       05  WKS-BIT500-LIBRO-CONTABLE    PIC  9(02).               010400      
001906       05  WKS-BIT500-CVES-DESVIO       OCCURS 5 TIMES.           010500      
001907           07 WKS-BIT500-CVE-DESVIO     PIC  9(04).               010600      
001908           07 WKS-BIT500-GUIA-DESVIO    PIC  9(04).               010700      
001909    03 A00-BIT500-FIL-FUTURO            PIC  X(18).               010720      
001910    03 A00-BIT500-REDEF-S087      REDEFINES A00-BIT500-FIL-FUTURO.010900      
001911       05 A00-BIT500-CLIENTE            PIC  9(14).               011000      
001912       05 FILLER                        PIC  X(04).               011850      
001913    03 A00-BIT500-REDEF-S500    REDEFINES A00-BIT500-FIL-FUTURO.  012500      
001914       05 A00-BIT500-S015               PIC  9(08).               012600      
001915       05 A00-BIT500-BCOS.                                        012700      
001916          06 A00-BIT500-BCO-ORI         PIC  9(03).               012800      
001917          06 A00-BIT500-BCO-DES         PIC  9(03).               012900      
001918          06 FILLER                     PIC  X(04).               013000      
001919    03 A00-BIT500-NODO-ORIG             PIC  9(02).               015200      
001920    03 A00-BIT500-STATUS                PIC  9(02).               015300      
001921    03 A00-BIT500-NOMINA-FUN1           PIC  9(14).               015400      
001922    03 A00-BIT500-NOMINA-FUN2           PIC  9(14).               015500      
001923    03 A00-BIT500-SIST-ORIG             PIC  9(04).               015600      
001924    03 A00-BIT500-PROD-ORIG             PIC  9(04).               015700      
001925    03 A00-BIT500-INST-ORIG             PIC  9(02).               015800      
001926    03 A00-BIT500-CVECON-YREFLOC        PIC  X(52).               015900      
001927    03 A00-BIT500-CVECON-Y-REFV REDEFINES                         016000      
001928                                        A00-BIT500-CVECON-YREFLOC.016050      
001929       05 A00-BIT500-CVETR-ORIG         PIC  9(06).               016100      
001930       05 A00-BIT500-CONT-ORIG          PIC  9(20).               016200      
001931       05 A00-BIT500-REFLOC-BNM         PIC  X(24).               016300      
001932       05 A00-BIT500-REFLOC-23POS REDEFINES A00-BIT500-REFLOC-BNM.016400      
001933          06 A00-BIT500-REFALFA         PIC  X(24).               016500      
001934          06 A00-BIT500-REFALFA-R REDEFINES A00-BIT500-REFALFA.   016600      
001935             07 A00-BIT500-REF23POS     PIC  9(23).               016700      
001936             07 A00-BIT500-COMPREF      PIC  9(01).               016800      
001937          06 A00-BIT500-REFALFA-R1 REDEFINES A00-BIT500-REFALFA.  016900      
001938             07 A00-BIT500-REF14POS     PIC  9(14).               017000      
001939             07 A00-BIT500-REF10POS     PIC  9(10).               017100      
001940       05 FILLER                        PIC  X(02).               017200      
001941                                                                  018000      
001942    03 A00-BIT500-FILXAPL               PIC  X(192).              018100      
001943                                                                  018200      
001944    03 A00-BIT500-REDS500            REDEFINES A00-BIT500-FILXAPL.019700      
001945       05 A00-BIT500-CVECAUSA           PIC  9(04).               019800      
001946       05 A00-BIT500-FECDEV             PIC  9(08).               019900      
001947       05 A00-BIT500-BANCO              PIC  9(04).               020000      
001948       05 A00-BIT500-NOMORD             PIC  X(30).               020100      
001949       05 A00-BIT500-CAUSAORD           PIC  X(50).               020200      
001950       05 A00-BIT500-SUCORD             PIC  9(04).               020300      
001951       05 A00-BIT500-CTACON             PIC  9(02).               020400      
001952       05 FILLER                        PIC  X(90).               020500      
001953                                                                  020600      
001954    03 A00-BIT500-SALDO                 PIC  S9(15)V99.           038300      
001955    03 A00-BIT500-LEYENDA               PIC  X(40).               038325      
001956    03 A00-BIT500-INF-CBII              PIC  X(25).               038350      
001957    03 A00-BIT500-INF-CBII-R1       REDEFINES A00-BIT500-INF-CBII.038400      
001958       05 A00-BIT500-REF-CBII           PIC  X(15).               038500      
001959       05 FILLER                        PIC  X(10).               038600      
001960    03 A00-BIT500-INF-CBII-R2       REDEFINES A00-BIT500-INF-CBII.038700      
001961       05 A00-BIT500-REFNUM-CBII        PIC  X(10).               038800      
001962       05 A00-BIT500-REFALFA-CBII       PIC  X(15).               038900      
001963    03 A00-BIT500-INTERCOMPANY          PIC  9(06).               039000      
001964    03 A00-BIT500-IMPBASE-ESQFINAN      PIC  9(14)V99.            039100      
001965    03 A00-BIT500-SIN-USO               PIC  X(15).               039200      
001966    03 A00-BIT500-ESTATUS-REG           PIC  9(02).               039300      
001967    03 A00-BIT500-CAMPOS-NUEVOS         PIC  X(1052).             039400      
001968    03 A00-BIT500-CAMPOSN-S500 REDEFINES A00-BIT500-CAMPOS-NUEVOS.039500      
001969       05 A00-BIT500-SERVICIO           PIC  9(02).               039600      
001970       05 A00-BIT500-TIPO-OPER          PIC  X(01).               039700      
001971       05 A00-BIT500-TIPO-MOV           PIC  9(02).               039800      
001972       05 A00-BIT500-AGRUP-DESVIO       PIC  9(04).               039900      
001973       05 A00-BIT500-AGRUP-INST         PIC  9(04).               040000      
001974       05 A00-BIT500-AGRUP-SIRH         PIC  9(04).               040100      
001975       05 A00-BIT500-IND-ENVIO-CITI     PIC  9(02).               040200      
001976       05 A00-BIT500-CVE-FILIAL         PIC  X(05).               040300      
001977       05 A00-BIT500-AUT-NIO-S500       PIC  X(16).               040400      
001978       05 A00-BIT500-NOMINA-MAKER       PIC  9(14).               040500      
001979       05 A00-BIT500-NOMINA-CHECKER     PIC  9(14).               040600      
001980       05 A00-BIT500-REF-CLIENTE        PIC  X(16).               040700      
001981       05 A00-BIT500-REFERENCIA1-CTE    PIC  X(35).               040800      
001982       05 A00-BIT500-REFERENCIA2-CTE    PIC  X(35).               040900      
001983       05 A00-BIT500-REFERENCIA3-CTE    PIC  X(35).               041000      
001984       05 A00-BIT500-REFERENCIA4-CTE    PIC  X(35).               041100      
001985       05 A00-BIT500-LEYENDA2           PIC  X(40).               041200      
001986       05 A00-BIT500-LEYENDA3           PIC  X(40).               041300      
001987       05 A00-BIT500-LEYENDA4           PIC  X(40).               041400      
001988       05 A00-BIT500-LEYENDA5           PIC  X(40).               041500      
001989       05 A00-BIT500-MOTIVO-DEV         PIC  X(30).               041600      
001990       05 A00-BIT500-NOM-BCO-EMISOR     PIC  X(20).               041700      
001991       05 A00-BIT500-REF-CECOBAN        PIC  X(07).               041800      
001992       05 A00-BIT500-NUM-ORD-PAGO       PIC  9(18).               041900      
001993       05 A00-BIT500-NOM-BENEFICIARIO   PIC  X(50).               042000      
001994       05 A00-BIT500-CVE-RASTREO        PIC  X(30).               042100      
001995       05 A00-BIT500-FEC-PAGO           PIC  9(08).               042200      
001996       05 A00-BIT500-NOM-CLIENTE        PIC  X(36).               042300      
001997       05 A00-BIT500-VER-FIRMA          PIC  9(03).               042400      
001998       05 A00-BIT500-TIPO-CHEQUE        PIC  9(03).               042500      
001999       05 A00-BIT500-CLIENTE-S500       PIC  9(12).               042550      
002000       05 A00-BIT500-SERVICIO-ALERTA    PIC  9(04).               042560      
002001       05 A00-BIT500-GRUPO-SOC          PIC  9(04).               042570      
002002       05 A00-BIT500-BIN-TAR            PIC  9(06).               042580      
002003       05 A00-BIT500-SDO-FIN-S500       PIC  S9(15)V99.           042590      
002004       05 A00-BIT500-TRUI-S500.                                   042605      
002005          07 A00-BIT500-CSIREC-S500     PIC  9(07).               042610      
002006          07 A00-BIT500-CSIOR-S500      PIC  9(07).               042615      
002007          07 A00-BIT500-NUMOP-S500      PIC  9(07).               042620      
002008          07 A00-BIT500-NUMTR-S500      PIC  9(07).               042625      
002009          07 A00-BIT500-INSMN-S500      PIC  9(02).               042630      
002010       05 A00-BIT500-MICR-S500.                                   042635      
002011          07 A00-BIT500-CODSEG-S500     PIC  9(03).               042637      
002012          07 A00-BIT500-VERPRE-S500     PIC  9(01).               042639      
002013          07 A00-BIT500-CTRMON-S500     PIC  9(02).               042640      
002014          07 A00-BIT500-PLCEC-S500      PIC  9(03).               042645      
002015          07 A00-BIT500-BNCEM-S500      PIC  9(03).               042650      
002016          07 A00-BIT500-DVEIN-S500      PIC  9(01).               042652      
002017          07 A00-BIT500-CTACH-S500      PIC  9(11).               042655      
002018          07 A00-BIT500-REFCH-S500      PIC  9(07).               042660      
002019       05 A00-BIT500-CTABEN-S500        PIC  9(20).               042665      
002020       05 A00-BIT500-BCREC-S500         PIC  9(03).               042670      
002021       05 A00-BIT500-NOMBEN-S500        PIC  X(40).               042675      
002022       05 A00-BIT500-RFCBCO-S500        PIC  X(13).               042680      
002023       05 A00-BIT500-NOMPAN-S500        PIC  X(05).               042685      
002024       05 A00-BIT500-OPCPAN-S500        PIC  X(01).               042690      
002025       05 A00-BIT500-NUMCTO1-S500       PIC  9(16).               042695      
002026       05 A00-BIT500-NUMCTO2-S500       PIC  9(16).               042700      
002027       05 A00-BIT500-NUMCTO3-S500       PIC  9(16).               042705      
002028*INICIO CJMG TESOFE 2019                                          042900      
002029       05 A00-BIT500-IND-SUBC           PIC  9(01).               043000      
002030       05 A00-BIT500-PRO-SUBC           PIC  9(04).               043100      
002031       05 A00-BIT500-INST-SUBC          PIC  9(04).               043200      
002032       05 A00-BIT500-MON-SUBC           PIC  9(03).               043300      
002033       05 A00-BIT500-CONT-SUBC          PIC  9(16).               043400      
002034       05 A00-BIT500-CTAMDA-SUBC        PIC  9(16).               043500      
002035       05 A00-BIT500-STA-SUBC           PIC  9(04).               043600      
002036       05 A00-BIT500-INDALER-SUBC       PIC  9(04).               043700      
002037       05 A00-BIT500-INDCTACON-SUBC     PIC  9(02).               043800      
002038       05 A00-BIT500-LEYENDA-SUBC       PIC  X(40).               043900      
002039       05 A01-BIT500-VALOR-IND          PIC  X(02).               043920      
002040       05 A00-BIT500-NOM-BENEF-AMPL     PIC  X(120).              043940      
002041       05 A00-BIT500-IND-EXTNET         PIC  9(01).               043950      
002042       05 FILLER                        PIC  X(12).               044000      
002043*       05 FILLER                        PIC  X(201).             044100      
002044*FIN CJMG TESOFE 2019                                             044200      
002045                                                                  049000      
002046*    03 FILLER                           PIC  X(28).              049900      
002047                                                                  049950      
002048 01 WKS-TR500-CIG.                                                050000      
002049    03 WKS-TR500-TIPO-REG            PIC  X(01)      VALUE "9".   050100      
002050    03 WKS-TR500-TOT-REG             PIC  9(13)      VALUE ZEROES.050200      
002051    03 WKS-TR500-TOT-IMP             PIC  9(16)V9(2) VALUE ZEROES.050300      
002052    03 WKS-TR500-TOT-CVES            PIC  9(08)      VALUE ZEROES.050400      
002053    03 FILLER                        PIC  X(1860)    VALUE SPACES.050500      
002054*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002055*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002056* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP001 ON CMEMP."         114200      
002057*                            FROM 000100 TO 099999      .         114210      
002058                                                                  000100      
002059*----------------------------------------------------------------*000200      
002060*     VARIABLES PARA EL CALCULO DINAMICO DE ESPACIO PARA SORT    *000300      
002061*----------------------------------------------------------------*000400      
002062 77  W77-FRAMESIZE                PIC  9(002) COMP.               000500      
002063 77  W77-LASTRECORD               PIC  9(012) COMP.               000600      
002064 77  W77-MAXRECSIZE               PIC  9(012) COMP.               000700      
002065 77  W77-DISK-SIZE                PIC  9(018) COMP.               000800      
002066 77  W77-MEMORY-SIZE              PIC  9(018) COMP.               000900      
002067                                                                  001000      
002068 01  WS-CALC-WORD                 PIC  9(012)V99.                 001100      
002069 01  WS-CALC-WORD-RED   REDEFINES WS-CALC-WORD.                   001200      
002070     02 WS-WORD-ENT               PIC  9(012).                    001300      
002071     02 WS-WORD-RES               PIC  9(002).                    001400      
002072                                                                  001500      
002073*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002074                                                                  114300      
002075***************************************************************   114305      
002076*  VARIABLES PARA CARGA DEL CATALOGO DE CLIENTES INTERCOMPANY *   114310      
002077***************************************************************   114315      
002078 01  WKS-TAB-CLIENTES.                                            114320      
002079     02  WKS-CLIENTES-BU           OCCURS 2500 TIMES.             114325      
002080         03  WKS-TAB-CLIENTE       PIC 9(12) COMP.                114330      
002081         03  WKS-TAB-INBU          PIC 9(05).                     114335      
002082         03  WKS-TAB-UNIN          PIC X(05).                     114340      
002083                                                                  114345      
002084 77 W77-TOTAL-CL                   PIC 9(04).                     114350      
002085***************************************************************   114400      
002086*          LIBRERIA CTLVERS       ( S006)                     *   114500      
002087***************************************************************   114600      
002088                                                                  114700      
002089 01  WKS-CTLVERS-LIBRERIA         PIC  X(012).                    114800      
002090 01  WKS-CTLVERS-TITULO           PIC  X(072).                    114900      
002091 01  WKS-CTLVERS-STATUS           PIC S9(011) BINARY.             115000      
002092                                                                  115100      
002093 01  WKS-CTLVERS-NUMREG           PIC  9(002).                    115200      
002094 01  WKS-CTLVERS-LIBID            PIC  X(012).                    115300      
002095 01  WKS-CTLVERS-LIBID-R REDEFINES WKS-CTLVERS-LIBID.             115400      
002096     03 WKS-LIBID-NOMB            PIC  X(009).                    115500      
002097     03 WKS-LIBID-SIST            PIC  X(003).                    115600      
002098                                                                  115700      
002099 01  WKS-151-DATOS WITH LOWER-BOUNDS.                             115800      
002100     03 WKS-DEL-FUNCION           PIC  9(004).                    115900      
002101     03 WKS-DEL-FECHA             PIC  9(008).                    116000      
002102     03 WKS-DEL-NUMLOG            PIC  9(002).                    116100      
002103     03 WKS-DEL-PRODUCTO          PIC  9(004).                    116200      
002104     03 WKS-DEL-PROCESO           PIC  9(002).                    116300      
002105                                                                  116400      
002106 01  WKS-TIT-REGISTRA.                                            116500      
002107     02 FILLER                    PIC  X(032) VALUE               116600      
002108        "(S151)S151/OBJECT/L002/REGISTRAS" .                      116700      
002109     02 WKS-TIT-SISREG            PIC  9(003) VALUE 0.            116800      
002110     02 FILLER                    PIC  X(018) VALUE               116900      
002111        "/02MTP0  ON CMEMP.".                                     117000      
002112                                                                  117100      
002113***************************************************************   117200      
002114*          LIBRERIA SOPORTECOMS                               *   117300      
002115***************************************************************   117400      
002116                                                                  117500      
002117 01  WKS-DATOSHOST.                                               117600      
002118     02 WKS-DH-NUMCSI             PIC  9(002).                    117700      
002119     02 WKS-DH-NOMEQUIPO          PIC  X(010).                    117800      
002120     02 WKS-DH-NOMCSI             PIC  X(026).                    117900      
002121     02 WKS-DH-LINEABATCH         PIC  X(005).                    118000      
002122                                                                  118100      
002123******************************************************************118200      
002124*            PARAMETROS DE LAS CVES DE TRANSACCION               *118300      
002125******************************************************************118400      
002126 01  WKS-TABLA-PARAMETROS-TRANS.                                  118500      
002127     02 WKS-T-PARAMETROS-TRANS    OCCURS 5000 TIMES.              118600      
002128        04 WKS-PT-NUM-LEYEN       PIC  9(004) COMP.               118700      
002129        04 WKS-PT-EDOCTA          PIC  9(002) COMP.               118800      
002130        04 WKS-PT-RENG-BITA       PIC  9(002) COMP.               118900      
002131        04 WKS-PT-AGR-CONT        PIC  9(004) COMP.               119000      
002132        04 WKS-PT-NATS028         PIC  9(002) COMP.               119100      
002133        04 WKS-PT-INDS250         PIC  9(002) COMP.               119200      
002134        04 WKS-PT-INDBITA         PIC  9(002) COMP.               119300      
002135                                                                  119400      
002136***************************************************************   119500      
002137*                                                             *   119600      
002138***************************************************************   119700      
002139 77  REGISTRO                     PIC  9(010).                    119800      
002140 77  REG-02                       PIC  9(010) VALUE 0.            119820      
002141 77  W77-BUSCA                    PIC  9(002).                    119900      
002142 01  WKS-CLAVE-CIA                PIC  9(005).                    120000      
002143 77  W77-SW-CAT6                  PIC  9(001) VALUE 0.            120100      
002144                                                                  120200      
002145******************************************************************120300      
002146*            NOMBRE DE LOS ARCHIVOS                              *120400      
002147******************************************************************120500      
002148 01  WKS-TIT-SDLOG-S151.                                          120600      
002149     02 FILLER                PIC  X(010) VALUE "(S151)S151".     120700      
002150     02 FILLER                PIC  X(011) VALUE "/FILE/SDMOV".    120800      
002151     02 WKS-SD-SISTEMA        PIC  9(003) VALUE 0.                120900      
002152     02 FILLER                PIC  X(001) VALUE "/".              121000      
002153     02 WKS-SD-FEC            PIC  9(006).                        121100      
002154     02 FILLER                PIC  X(010) VALUE " ON CMEMP.".     121200      
002155                                                                  121300      
002156  01 WKS-TIT-ARCH-S016.                                           121310      
002157     02  FILLER               PIC X(10) VALUE "(S016)S016".       121320      
002158     02  FILLER               PIC X(06) VALUE "/FILE/".           121330      
002159     02  WKS-TIT-CSI-S016     PIC 9(02).                          121340      
002160     02  FILLER               PIC X(06) VALUE "/S151/".           121350      
002161     02  WKS-TIT-FEC-S016     PIC 9(06).                          121360      
002162     02  FILLER               PIC X(13) VALUE " ON CLIENTES.".    121370      
002163                                                                  121380      
002164 01  WKS-TIT-ARCHS016.                                            121400      
002165     02 FILLER                PIC  X(007) VALUE "(S151)S".        121500      
002166     02 WKS-KEY-SISTEMA       PIC  9(003).                        121600      
002167     02 FILLER                PIC  X(015) VALUE "/FILE/CONTRATOS".121700      
002168     02 FILLER                PIC  X(010) VALUE " ON CMEMP.".     121800      
002169                                                                  121900      
002170 01  WKS-TIT-LOGS151.                                             122000      
002171     02 FILLER                PIC  X(010) VALUE "(S151)S151".     122100      
002172     02 FILLER                PIC  X(010) VALUE "/FILE/MOVS".     122200      
002173     02 WS-TL-SISTEMA         PIC  9(003) VALUE 0.                122300      
002174     02 FILLER                PIC  X(001) VALUE "/".              122400      
002175     02 WS-FEC-LOG            PIC  9(006).                        122500      
002176     02 FILLER                PIC  X(004) VALUE " ON ".           122600      
002177     02 WKS-PACK-LOG          PIC  X(017) .                       122700      
002178     02 FILLER                PIC  X(001) VALUE ".".              122800      
002179                                                                  122900      
002180 01  WKS-TIT-DES151.                                              123000      
002181     02 FILLER                PIC  X(010) VALUE "(S151)S151".     123100      
002182     02 FILLER                PIC  X(010) VALUE "/FILE/DESS".     123200      
002183     02 WS-TD-SISTEMA         PIC  9(003) VALUE 0.                123300      
002184     02 FILLER                PIC  X(001) VALUE "/".              123400      
002185     02 WS-FEC-DES            PIC  9(006).                        123500      
002186     02 FILLER                PIC  X(004) VALUE " ON ".           123600      
002187     02 WKS-PACK-DES          PIC  X(017).                        123700      
002188     02 FILLER                PIC  X(001) VALUE ".".              123800      
002189                                                                  123900      
002190 01  WKS-TIT-WFL.                                                 124000      
002191     02 FILLER                PIC  X(015) VALUE "BEGIN JOB; RUN ".124100      
002192     02 WKS-START-PROG        PIC  X(047).                        124200      
002193     02 FILLER                PIC  X(002) VALUE " (".             124300      
002194     02 FILLER                PIC  X(001) VALUE QUOTES.           124400      
002195     02 FILLER                PIC  X(001) VALUE "S".              124500      
002196     02 WKS-START-SIS         PIC  9(003).                        124600      
002197     02 FILLER                PIC  X(004) VALUE "SCIG".           124700      
002198     02 FILLER                PIC  X(001) VALUE "/".              124800      
002199     02 WKS-START-FEC         PIC  X(008).                        124900      
002200     02 FILLER                PIC  X(001) VALUE "/".              125000      
002201     02 WKS-TIPO-PROC         PIC  9(002).                        125100      
002202     02 FILLER                PIC  X(001) VALUE QUOTES.           125200      
002203     02 FILLER                PIC  X(012) VALUE ") ; END JOB.".   125300      
002204                                                                  125400      
002205 01  WKS-TIT-MOVSCIG.                                             125500      
002206     03 FILLER                PIC  X(001) VALUE "S".              125600      
002207     03 WKS-MC-SISTEMA        PIC  9(003).                        125700      
002208     03 FILLER                PIC  X(006) VALUE "/FILE/".         125800      
002209     03 WKS-MC-CSI            PIC  9(002).                        125900      
002210     03 FILLER                PIC  X(009) VALUE "/MOVSCIG/".      126000      
002211     03 WKS-MC-FECHA          PIC  9(008).                        126100      
002212     03 FILLER                PIC  X(001) VALUE "/".              126110      
002213     03 WKS-TIPO-INF          PIC  9(002).                        126120      
002214     03 FILLER                PIC  X(001) VALUE ".".              126200      
002215                                                                  126300      
002216******************************************************************126400      
002217*           CATALOGOS PARAMETRICOS  S080                         *126500      
002218******************************************************************126600      
002219 77  S080-CP-SISTEMA              PIC S9(011) BINARY.             126700      
002220 77  S080-CP-PROGRAMA             PIC S9(011) BINARY.             126800      
002221 77  S080-CP-RESULT               PIC S9(011) BINARY.             126900      
002222 01  S080-CP-PARAMETRO-ENT.                                       127000      
002223     02 S080-CPPE-CATALOGO        PIC  9(006) COMP.               127100      
002224     02 S080-CPPE-CLAVE           PIC  9(002) COMP.               127200      
002225     02 S080-CPPE-ORDEN-BUSQ      PIC  9(002) COMP.               127300      
002226     02 S080-CPPE-REGISTROS       PIC  9(002) COMP.               127400      
002227     02 S080-CPPE-LLAVE1          PIC  9(012).                    127500      
002228     02 S080-CPPE-LLAVE2          PIC  9(012).                    127600      
002229     02 S080-CPPE-LLAVE2-A REDEFINES S080-CPPE-LLAVE2             127700      
002230                                  PIC  X(012).                    127800      
002231     02 S080-CPPE-LLAVE3          PIC  X(012).                    127900      
002232     02 S080-CPPE-LLAVE4          PIC  X(012).                    128000      
002233     02 S080-CPPE-LLAVE5          PIC  X(012).                    128100      
002234     02 S080-CPPE-LLAVE6          PIC  X(012).                    128200      
002235     02 S080-CPPE-FECHA-VIG       PIC  9(006) COMP.               128300      
002236     02 S080-CPPE-FECHA-CONS      PIC  9(006) COMP.               128400      
002237     02 S080-CPPE-NIVEL-INI       PIC  9(002) COMP.               128500      
002238     02 FILLER                    PIC  X(011).                    128600      
002239                                                                  128700      
002240 01  S080-CP-PARAMETRO-SAL.                                       128800      
002241     02 S080-CPPS-NUM-REGISTRO    PIC  9(002) COMP.               128900      
002242     02 S080-CPPS-NUM-CATALOGO    PIC  9(006) COMP.               129000      
002243     02 S080-CPPS-FECHA-CONS      PIC  9(006) COMP.               129100      
002244     02 S080-CPPS-NIVEL-INI       PIC  9(002) COMP.               129200      
002245     02 FILLER                    PIC  X(022).                    129300      
002246     02 S080-CPPS-REGISTROS.                                      129400      
002247        04 S080-CPPS-DATOS    OCCURS 28 TIMES                     129500      
002248                                  PIC  9(012).                    129600      
002249        04 S080-CPPS-DATOS-A  REDEFINES S080-CPPS-DATOS           129700      
002250                              OCCURS 28 TIMES                     129800      
002251                                  PIC  X(012).                    129900      
002252        04 S080-CPPS-FECHA-ALTA   PIC  9(006) COMP.               130000      
002253        04 S080-CPPS-FECHA-BAJA   PIC  9(006) COMP.               130100      
002254        04 S080-CPPS-FECHA-ULTMOD PIC  9(006) COMP.               130200      
002255        04 S080-CPPS-FECHA-VIG    PIC  9(006) COMP.               130300      
002256        04 FILLER                 PIC  X(500).                    130400      
002257                                                                  130500      
002258******************************************************************130510      
002259*               LIBRERIA LOCSUP        ( S006 )                  *130520      
002260******************************************************************130530      
002261                                                                  130540      
002262 77  WKS-FUNCION                   PIC S9(11) BINARY.             130550      
002263 77  WKS-FORMATO                   PIC S9(11) BINARY.             130560      
002264 01  WKS-FECHA1                    PIC 9(08).                     130570      
002265 01  WKS-FECHA2                    PIC 9(08).                     130580      
002266                                                                  130590      
002267******************************************************************130600      
002268*            VARIABLES MISCELANEAS                               *130700      
002269******************************************************************130800      
002270 77  W77-SALIDA                   PIC  9(001) VALUE 0.            130900      
002271 77  W77-EOF                      PIC  9.                         131000      
002272 77  W77-RESULT                   PIC S9(011) BINARY.             131100      
002273 77  W77-ERROR-S016               PIC  9(002) COMP VALUE 1.       131110      
002274 77 W77-TOTREG-S016               PIC  9(08).                     131120      
002275 77  W77-NUMREG-LOG               PIC  9(08) COMP VALUE ZERO.     131130      
002276 77  LOG-KEY                      PIC  9(008).                    131200      
002277 77  W77-IND                      PIC  9(006).                    131300      
002278 77  W77-CAMPO-DISPLAY            PIC  9(012).                    131400      
002279 77  W77-DESC                     PIC  9(001) VALUE ZEROS.        131600      
002280     88 W88-DESC                              VALUE 1.            131700      
002281 77 W77-TIPO-PROCESO              PIC 9(02).                      131710      
002282    88 W88-PROCESO-LINEA          VALUE 0 THRU  19.               131720      
002283    88 W88-PROCESO-BATCH          VALUE 20 THRU 99.               131730      
002284 77 W77-TIPO                      PIC 9(02).                      131740      
002285 88 W88-TIPO-LINEA                VALUE 1.                        131750      
002286 88 W88-TIPO-BATCH                VALUE 2.                        131760      
002287 01 WKS-PARAMETROS.                                               131770      
002288    03 WKS-PROCESO-PARAMETRO      PIC 9(02).                      131780      
002289    03 WKS-SISTEMA-PARAMETRO      PIC 9(03).                      131800      
002290 01  WKS-HORA-COMP-HHMMSS         PIC  9(006).                    131900      
002291 01  WKS-HORA-COMP-HHMMSS-R REDEFINES WKS-HORA-COMP-HHMMSS.       132000      
002292     02 WKS-HORA-COMP-HH          PIC  9(002).                    132100      
002293     02 WKS-HORA-COMP-MM          PIC  9(002).                    132200      
002294     02 WKS-HORA-COMP-SS          PIC  9(002).                    132300      
002295                                                                  132400      
002296 01  WKS-HORA-COMPILACION.                                        132500      
002297     02 WKS-HORA-COMP             PIC  9(013).                    132600      
002298     02 FILLER                    PIC  X(187).                    132700      
002299                                                                  132800      
002300 01  WKS-FECHA-MAQ                PIC  9(008).                    132900      
002301 01  WKS-FECHA-MAQ-R    REDEFINES WKS-FECHA-MAQ.                  133000      
002302     03 WKS-FM-AMO                PIC  9(004).                    133100      
002303     03 WKS-FM-MES                PIC  9(002).                    133200      
002304     03 WKS-FM-DIA                PIC  9(002).                    133300      
002305                                                                  133400      
002306 01  WKS-FECHA-PROCESO            PIC  9(008).                    133500      
002307 01  WKS-FECHA-PROCESO-R REDEFINES WKS-FECHA-PROCESO.             133600      
002308     03 WKS-FP-AMO                PIC  9(004).                    133700      
002309     03 WKS-FP-MES                PIC  9(002).                    133800      
002310     03 WKS-FP-DIA                PIC  9(002).                    133900      
002311                                                                  134000      
002312 01  WS-FECHA-TEMP                PIC  9(008).                    134100      
002313 01  WS-FECHA-TEMP-R    REDEFINES WS-FECHA-TEMP.                  134200      
002314     03 WS-DIA-TEMP               PIC  9(002).                    134300      
002315     03 WS-MES-TEMP               PIC  9(002).                    134400      
002316     03 WS-AMO-TEMP               PIC  9(004).                    134500      
002317                                                                  134600      
002318 01  WKS-HORA-MAQ                 PIC  9(008).                    134700      
002319 01  WKS-HORA-MAQ-R     REDEFINES WKS-HORA-MAQ.                   134800      
002320     03 WKS-HORA-HHMMSS           PIC  9(006).                    134900      
002321     03 FILLER                    PIC  9(002).                    135000      
002322                                                                  135100      
002323 01  WKS-HORA-MAQ-E     REDEFINES WKS-HORA-MAQ.                   135200      
002324     03 WKS-HORA-HH               PIC  9(002).                    135300      
002325     03 WKS-HORA-MM               PIC  9(002).                    135400      
002326     03 WKS-HORA-SS               PIC  9(002).                    135500      
002327     03 FILLER                    PIC  9(002).                    135600      
002328 01  WKS-HORAM-MAQ-R    REDEFINES WKS-HORA-MAQ.                   135700      
002329     03 WKS-HORA-HHMM             PIC  9(002).                    135800      
002330     03 WKS-MINU-HHMM             PIC  9(002).                    135900      
002331     03 FILLER                    PIC  9(004).                    136000      
002332 01 WKS-FECHA-PROCANT             PIC 9(08) COMP.                 136100      
002333                                                                  136200      
002334*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002335* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           136300      
002336**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
002337  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
002338  01 MENSAJE-LJ.                                                  100300      
002339     02 SISTEMA-LJ     PIC X(04).                                 100400      
002340     02 FILLER         PIC X VALUE "/".                           100500      
002341     02 PASO-LJ        PIC X(04).                                 100600      
002342     02 FILLER         PIC X VALUE "/".                           100700      
002343     02 MTP-LJ         PIC 9(03).                                 100800      
002344     02 FILLER         PIC X VALUE ":".                           100900      
002345     02 TIPO-LJ        PIC X.                                     101000      
002346     02 FILLER         PIC X VALUE ">".                           101100      
002347     02 CODIGO-LJ      PIC 9(06).                                 101200      
002348     02 FILLER         PIC X VALUE "<".                           101300      
002349     02 TEXTO-LJ       PIC X(250).                                101400      
002350*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002351                                                                  136400      
002352***************************************************************** 136500      
002353*             P R O C E D U R E     D I V I S I O N             * 136600      
002354***************************************************************** 136700      
002355 PROCEDURE DIVISION USING WKS-PARAMETROS.                         136800      
002356 000000-PROGRAMA.                                                 136900      
002357*================                                                 137000      
002358     PERFORM                      100000-INICIO                   137100      
002359     PERFORM                      200000-PROCESO                  137200      
002360     PERFORM                      600000-FIN                      137300      
002361     STOP RUN                                                    .137400      
002362                                                                  137500      
002363******************************************************************137600      
002364*                 I N I C I O                                    *137700      
002365*                 ===========                                    *137800      
002366*    INICIALIZA VARIABLES                                        *137900      
002367*    CARGA PARAMETROS                                            *138000      
002368*    CARGA ATRIBUTOS                                             *138100      
002369*    CARGA FECHAS                                                *138200      
002370*    CARGA VERSIONES                                             *138300      
002371*    CARGA LIBRERIAS                                             *138400      
002372*    VALIDA CONTROL                                              *138500      
002373*    CARGA CATALOGOS                                             *138600      
002374******************************************************************138700      
002375 100000-INICIO.                                                   138800      
002376*==============                                                   138900      
002377     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   139000      
002378        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          139100      
002379     MOVE WKS-PROCESO-PARAMETRO   TO  W77-TIPO                    139110      
002380                                      WKS-TIPO-PROC               139115      
002381                                      WKS-TIPO-INF.               139120      
002382     MOVE "S151"                  TO  SISTEMA-LJ                  139300      
002383     MOVE "P110"                  TO  PASO-LJ                     139400      
002384     MOVE "001"                   TO  MTP-LJ                      139500      
002385     MOVE "I"                     TO  TIPO-LJ                     139600      
002386     MOVE 020101                  TO  CODIGO-LJ                   139700      
002387                                                                  139800      
002388     PERFORM                      110000-INICIO-PROGRAMA          139900      
002389     PERFORM                      120000-CARGA-CATALOGOS          140000      
002390     PERFORM                      130000-OBTEN-TIT940            .140100      
002391                                                                  140200      
002392 110000-INICIO-PROGRAMA.                                          140300      
002393*=======================                                          140400      
002394                                                                  140500      
002395     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.140600      
002396     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            140700      
002397                                      "SOPORTECOMS".              140800      
002398     CALL "CSIID OF SOPORTECOMS"                                  140900      
002399                          USING       WKS-DATOSHOST               141000      
002400                                                                  141100      
002401     CHANGE ATTRIBUTE LIBACCESS    OF "CTRLVERS" TO BYFUNCTION.   141200      
002402     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".    141300      
002403                                                                  141400      
002404                                                                  141500      
002405     MOVE "S151L001CTL"           TO  WKS-CTLVERS-LIBRERIA        141600      
002406     CALL "DAME_TIT IN CTRLVERS"                                  141700      
002407                          USING       WKS-CTLVERS-LIBRERIA,       141800      
002408                                      WKS-CTLVERS-TITULO          141900      
002409                          GIVING      WKS-CTLVERS-STATUS.         142000      
002410                                                                  142100      
002411     IF WKS-CTLVERS-STATUS        <   0                           142200      
002412        MOVE "I"                  TO  TIPO-LJ                     142300      
002413        MOVE 020101               TO  CODIGO-LJ                   142400      
002414        STRING "ERROR EN CTLVERS, USO LICBRERIA DE CONTROL SIN ", 142500      
002415               "RELEASE NI MTP." DELIMITED BY SIZE INTO TEXTO-LJ  142600      
002416        CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL"   TO           142700      
002417            "(S151)S151/OBJECT/L001/CONTROL          ON CMEMP."   142800      
002418     ELSE                                                         142900      
002419        CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL"                143000      
002420                                  TO  WKS-CTLVERS-TITULO         .143100      
002421                                                                  143200      
002422     MOVE WKS-SISTEMA-PARAMETRO   TO  WKS-B01-SISTEMA             143300      
002423                                      WKS-B03-SISTEMA             143400      
002424                                      WS-TL-SISTEMA               143500      
002425                                      WKS-SD-SISTEMA              143600      
002426                                      WS-TD-SISTEMA               143700      
002427                                      WKS-HD500-SIST-ORI          143800      
002428                                      WKS-START-SIS               143900      
002429                                      WKS-MC-SISTEMA              144000      
002430                                                                  144100      
002431     MOVE 1                       TO  WKS-B01-FUNCION             144200      
002432     MOVE WKS-DH-NUMCSI           TO  WKS-B01-CSI                 144300      
002433                                                                  144400      
002434     CALL "CONSISDIA IN S151LIBCONTROL"                           144500      
002435                          USING       WKS-S151B01SISDIA           144600      
002436                          GIVING      W77-RESULT                  144700      
002437                                                                  144800      
002438     IF ATTRIBUTE VALUE OF MYSELF =   0                           144900      
002439        MOVE WKS-B01-FECPRO       TO  WKS-FECHA-PROCESO           145000      
002440        MOVE WKS-B01-NOMPACMOV    TO  WKS-PACK-LOG                145100      
002441                                      WKS-PACK-DES                145200      
002442        PERFORM                   111000-CIERRA-DESC              145300      
002443     ELSE                                                         145400      
002444        MOVE WKS-B01-NOMPACMOV    TO  WKS-PACK-LOG                145500      
002445                                      WKS-PACK-DES                145600      
002446        MOVE ATTRIBUTE VALUE OF MYSELF                            145700      
002447                                  TO  WKS-FECHA-PROCESO          .145800      
002448                                                                  145900      
002449     MOVE WKS-FECHA-PROCESO       TO  WKS-SD-FEC                  146000      
002450                                      WKS-HD500-FECHA-INF         146100      
002451                                      WKS-HD500-FECHA-FIN         146200      
002452                                      WKS-START-FEC               146300      
002453                                      WKS-MC-FECHA                146400      
002454                                                                  146500      
002455     MOVE WKS-DH-NUMCSI           TO  WKS-HD500-CSI               146600      
002456                                      WKS-MC-CSI                  146700      
002457     MOVE 1                       TO  WKS-B03-FUNCION             147000      
002458                                                                  147100      
002459     CALL "CONSISMEN IN S151LIBCONTROL"                           147200      
002460                          USING       WKS-S151B03SISMEN           147300      
002461                          GIVING      W77-RESULT-LIBCON           147400      
002462                                                                  147500      
002463     STRING "INICIO PROCESO CON FECHA ",                          147600      
002464                                      WKS-FECHA-PROCESO           147700      
002465            DELIMITED BY SIZE                                     147800      
002466                          INTO        TEXTO-LJ                    147900      
002467                                                                  148000      
002468     PERFORM                      A2K-ACCEPT-TODAYS-DATE          148100      
002469                          THRU    A2K-ACCEPT-TODAYS-DATE-EXIT     148200      
002470     MOVE A2K-FEC-MDCA-001        TO  WS-FECHA-TEMP               148300      
002471     MOVE WS-DIA-TEMP             TO  WKS-FM-MES                  148400      
002472     MOVE WS-MES-TEMP             TO  WKS-FM-DIA                  148500      
002473     MOVE WS-AMO-TEMP             TO  WKS-FM-AMO                  148600      
002474     MOVE WKS-FECHA-MAQ           TO  WKS-HD500-FECHA-PROC        148700      
002475     ACCEPT WKS-HORA-MAQ  FROM    TIME                            148800      
002476                                                                  148900      
002477     CHANGE ATTRIBUTE LIBACCESS   OF "LOCSUP"                     149000      
002478                                  TO  BYFUNCTION                  149100      
002479     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP"                    149200      
002480                                  TO  "LOCSUP"                    149300      
002481                                                                  149400      
002482     MOVE "S080BD01CON"           TO  WKS-CTLVERS-LIBRERIA        149500      
002483     CALL "DAME_TIT IN CTRLVERS"                                  149600      
002484                          USING       WKS-CTLVERS-LIBRERIA        149700      
002485                                      WKS-CTLVERS-TITULO          149800      
002486                          GIVING      WKS-CTLVERS-STATUS          149900      
002487                                                                  150000      
002488     IF WKS-CTLVERS-STATUS        <   0                           150100      
002489        MOVE "ERROR AL OBTENER NOMBRE S08BD01CON"                 150200      
002490                                  TO  TEXTO-LJ                    150300      
002491        MOVE "O"                  TO  TIPO-LJ                     150400      
002492        MOVE 020901               TO  CODIGO-LJ                   150500      
002493        CALL "LJ IN LIB-DISP"                                     150600      
002494                          USING       CONTADOR-LJ                 150700      
002495                                      MENSAJE-LJ                  150800      
002496        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                   150900      
002497     ELSE                                                         151000      
002498        CHANGE ATTRIBUTE TITLE OF "S080BD01CON"                   151100      
002499                                  TO  WKS-CTLVERS-TITULO         .151200      
002500                                                                  151300      
002501     MOVE ZEROS                   TO  A2K-FEC-CAMD-001            151400      
002502     MOVE WKS-FECHA-PROCESO       TO  A2K-FEC-CAMD-001            151500      
002503     PERFORM                      A2K-CONV-CAMD-TO-AMD            151600      
002504                          THRU    A2K-CONV-CAMD-TO-AMD-EXIT       151700      
002505     MOVE A2K-FEC-AMD-001         TO  WS-FEC-LOG                  151800      
002506                                      WS-FEC-DES                  151900      
002507                                                                  152000      
002508*    PERFORM 112000-ASIGNA-S016.                                  152010      
002509*    PERFORM 113000-VALIDA-S016 UNTIL W77-ERROR-S016 = 0.         152020      
002510*    PERFORM 114000-ORDENA-S016.                                  152030      
002511                                                                  152040      
002512     OPEN OUTPUT  MOVSCIG                                         152100      
002513     MOVE WKS-HORA-HHMMSS         TO  WKS-HD500-HORA-PROC         152200      
002514     WRITE REG-MOVSCIG    FROM        WKS-HD500-CIG             . 152300      
002515                                                                  152400      
002516 111000-CIERRA-DESC.                                              152500      
002517*===================                                              152600      
002518     MOVE ZEROS                   TO  W77-DESC                    152700      
002519     IF WKS-B01-FECARCMOV (01)    =   WKS-FECHA-PROCESO           152800      
002520        MOVE 1                    TO  W77-DESC                    152900      
002521        MOVE 10                   TO  WKS-DEL-FUNCION             153000      
002522     ELSE                                                         153100      
002523     IF WKS-B01-FECARCMOV (02)    =   WKS-FECHA-PROCESO           153200      
002524        MOVE 1                    TO  W77-DESC                    153300      
002525        MOVE 11                   TO  WKS-DEL-FUNCION             153400      
002526     ELSE                                                         153500      
002527     IF WKS-B01-FECARCMOV (03)    =   WKS-FECHA-PROCESO           153600      
002528        MOVE 1                    TO  W77-DESC                    153700      
002529        MOVE 12                   TO  WKS-DEL-FUNCION             153800      
002530     ELSE                                                         153900      
002531     IF WKS-B01-FECARCMOV (04)    =   WKS-FECHA-PROCESO           154000      
002532        MOVE 1                    TO  W77-DESC                    154100      
002533        MOVE 13                   TO  WKS-DEL-FUNCION             154200      
002534     ELSE                                                         154300      
002535     IF WKS-B01-FECARCMOV (05)    =   WKS-FECHA-PROCESO           154400      
002536        MOVE 1                    TO  W77-DESC                    154500      
002537        MOVE 14                   TO  WKS-DEL-FUNCION             154600      
002538     ELSE                                                         154700      
002539     IF WKS-B01-FECARCMOV (06)    =   WKS-FECHA-PROCESO           154800      
002540        MOVE 1                    TO  W77-DESC                    154900      
002541        MOVE 15                   TO  WKS-DEL-FUNCION             155000      
002542     ELSE                                                         155100      
002543     IF WKS-B01-FECARCMOV (07)    =   WKS-FECHA-PROCESO           155200      
002544        MOVE 1                    TO  W77-DESC                    155300      
002545        MOVE 16                   TO  WKS-DEL-FUNCION             155400      
002546     ELSE                                                         155500      
002547     IF WKS-B01-FECARCMOV (08)    =   WKS-FECHA-PROCESO           155600      
002548        MOVE 1                    TO  W77-DESC                    155700      
002549        MOVE 17                   TO  WKS-DEL-FUNCION             155800      
002550     ELSE                                                         155900      
002551     IF WKS-B01-FECARCMOV (09)    =   WKS-FECHA-PROCESO           156000      
002552        MOVE 1                    TO  W77-DESC                    156100      
002553        MOVE 18                   TO  WKS-DEL-FUNCION             156200      
002554     ELSE                                                         156300      
002555     IF WKS-B01-FECARCMOV (10)    =   WKS-FECHA-PROCESO           156400      
002556        MOVE 1                    TO  W77-DESC                    156500      
002557        MOVE 19                   TO  WKS-DEL-FUNCION            .156600      
002558                                                                  156700      
002559     MOVE ZEROS                   TO  WKS-CTLVERS-STATUS          156800      
002560     MOVE "S151L002R"             TO  WKS-LIBID-NOMB              156900      
002561     MOVE WKS-SISTEMA-PARAMETRO   TO  WKS-LIBID-SIST              157000      
002562                                                                  157100      
002563     IF W88-DESC                                                  157200      
002564        CALL "DAME_TIT IN CTRLVERS"                               157300      
002565                          USING       WKS-CTLVERS-LIBID           157400      
002566                                      WKS-CTLVERS-TITULO          157500      
002567                          GIVING      WKS-CTLVERS-STATUS         .157600      
002568                                                                  157700      
002569     IF W88-DESC                                                  157800      
002570        IF WKS-CTLVERS-STATUS     <   0                           157900      
002571           MOVE WKS-SISTEMA-PARAMETRO                             158000      
002572                                  TO  WKS-TIT-SISREG              158100      
002573           MOVE "I"               TO  TIPO-LJ                     158200      
002574           MOVE 020101            TO  CODIGO-LJ                   158300      
002575           STRING "ERROR EN CTLVERS, USO LIBRERIA REGISTRA SIN ", 158400      
002576                  "RELEASE NI MTP."                               158500      
002577           DELIMITED BY SIZE INTO     TEXTO-LJ                    158600      
002578           CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA"               158700      
002579                                  TO  WKS-TIT-REGISTRA            158800      
002580        ELSE                                                      158900      
002581           CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA"               159000      
002582                                  TO  WKS-CTLVERS-TITULO         .159100      
002583                                                                  159200      
002584     MOVE ZEROS                   TO  WKS-DEL-FECHA               159300      
002585                                      WKS-DEL-NUMLOG              159400      
002586                                      WKS-DEL-PRODUCTO            159500      
002587                                      WKS-DEL-PROCESO             159600      
002588                                      W77-RESULT                  159700      
002589     IF W88-DESC                                                  159800      
002590        CALL "CONTROLES IN LIB-REGISTRA"                          159900      
002591                          USING       WKS-151-DATOS               160000      
002592                          GIVING      W77-RESULT                 .160100      
002593                                                                  160200      
002594     MOVE 85                      TO  WKS-DEL-FUNCION             160300      
002595     MOVE ZEROS                   TO  WKS-DEL-FECHA               160400      
002596                                      WKS-DEL-NUMLOG              160500      
002597                                      WKS-DEL-PRODUCTO            160600      
002598                                      WKS-DEL-PROCESO             160700      
002599                                      W77-RESULT                  160800      
002600                                                                  160900      
002601     CALL "CONTROLES IN LIB-REGISTRA"                             161000      
002602                          USING       WKS-151-DATOS               161100      
002603                          GIVING      W77-RESULT                 .161200      
002604 112000-ASIGNA-S016.                                              161202      
002605*===================                                              161204      
002606     MOVE  15                     TO WKS-FUNCION.                 161206      
002607     MOVE  1                      TO WKS-FECHA2 .                 161208      
002608     MOVE  WKS-FECHA-PROCESO      TO WKS-FECHA1 .                 161210      
002609     MOVE  13                     TO WKS-FORMATO.                 161211      
002610     CALL "THECALENDAR IN LOCSUP" USING                           161212      
002611           WKS-FUNCION, WKS-FECHA1, WKS-FECHA2, WKS-FORMATO.      161214      
002612                                                                  161216      
002613     IF WKS-FUNCION = 0                                           161218      
002614        MOVE WKS-FECHA1           TO WKS-FECHA-PROCANT            161220      
002615     ELSE                                                         161222      
002616        MOVE WKS-FECHA-PROCESO    TO WKS-FECHA-PROCANT.           161224      
002617     MOVE WKS-FECHA-PROCANT       TO WKS-TIT-FEC-S016.            161226      
002618     MOVE WKS-DH-NUMCSI           TO WKS-TIT-CSI-S016.            161228      
002619                                                                  161230      
002620 113000-VALIDA-S016.                                              161232      
002621*==================                                               161234      
002622     OPEN INPUT  ARCH-S016.                                       161236      
002623     READ ARCH-S016 INTO  A00-R00-S016-HDR.                       161238      
002624     IF A00-R00-S016-TIPREG = "1"                AND              161240      
002625        A00-R00-S016-FECPRO = WKS-FECHA-PROCANT  AND              161242      
002626        A00-R00-S016-NUMCSI = WKS-DH-NUMCSI                       161244      
002627           OPEN OUTPUT ARS016-SORTED                              161246      
002628           READ ARCH-S016 INTO  A00-R01-S016-REGMOV               161248      
002629           PERFORM 113100-SELECC-MOVS016                          161250      
002630             UNTIL A00-R01-S016-TIPREG = "3"                      161252      
002631           MOVE A00-R02-S016-TOTREG     TO W77-TOTREG-S016        161254      
002632           CLOSE ARCH-S016     WITH RELEASE                       161256      
002633           CLOSE ARS016-SORTED WITH SAVE                          161258      
002634           MOVE ZERO                    TO W77-ERROR-S016         161260      
002635     ELSE                                                         161262      
002636           MOVE  1                      TO W77-ERROR-S016         161264      
002637           CLOSE ARCH-S016 WITH RELEASE                           161266      
002638           IF WKS-FECHA-PROCANT = WKS-FECHA-PROCESO               161268      
002639              MOVE WKS-FECHA-PROCANT    TO WKS-FECHA1             161270      
002640              MOVE  15                  TO WKS-FUNCION            161272      
002641              MOVE  1                   TO WKS-FECHA2             161274      
002642              CALL "THECALENDAR IN LOCSUP" USING                  161276      
002643                WKS-FUNCION, WKS-FECHA1, WKS-FECHA2, WKS-FORMATO  161278      
002644              PERFORM 112000-ASIGNA-S016                          161280      
002645           ELSE                                                   161282      
002646              MOVE WKS-FECHA-PROCANT    TO WKS-FECHA1             161284      
002647              PERFORM 112000-ASIGNA-S016.                         161286      
002648                                                                  161288      
002649  113100-SELECC-MOVS016.                                          161290      
002650*=====================                                            161292      
002651    MOVE A00-R01-S016-PROD                 TO WKS-CTO-PROD    .   161294      
002652    MOVE A00-R01-S016-INST                 TO WKS-CTO-INST    .   161296      
002653    MOVE ZERO                              TO WKS-NUM-SUC     .   161298      
002654    MOVE A00-R01-S016-NUMERO               TO WKS-NUM-CTO     .   161300      
002655    MOVE A00-R01-S016-INTERCIA             TO WKS-CTO-INTERCIA.   161302      
002656    WRITE REG-CTO-S016.                                           161304      
002657    READ ARCH-S016 INTO  A00-R01-S016-REGMOV.                     161306      
002658    ADD 1                                  TO W77-NUMREG-LOG.     161308      
002659 114000-ORDENA-S016.                                              161310      
002660*=================                                                161312      
002661     OPEN    INPUT                ARS016-SORTED                   161314      
002662     COMPUTE W77-FRAMESIZE        =                               161316      
002663            (ATTRIBUTE FRAMESIZE  OF ARS016-SORTED)               161318      
002664     COMPUTE W77-MAXRECSIZE       =                               161320      
002665            (ATTRIBUTE MAXRECSIZE OF ARS016-SORTED)               161322      
002666     COMPUTE W77-LASTRECORD       =                               161324      
002667            (ATTRIBUTE LASTRECORD OF ARS016-SORTED                161326      
002668                                  +   1)                          161328      
002669     CLOSE   ARS016-SORTED        WITH RELEASE                    161330      
002670     PERFORM                      70000-CALCULA-ESPACIO           161332      
002671     SORT SD-ARCS016                                              161334      
002672          ASCENDING KEY WKS-SD-LLAVE                              161336      
002673          USING  ARS016-SORTED                                    161338      
002674          GIVING ARS016-SORTED                                    161340      
002675          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    161342      
002676          DISK   SIZE IS W77-DISK-SIZE   WORDS.                   161344      
002677                                                                  161350      
002678 120000-CARGA-CATALOGOS.                                          161400      
002679*=======================                                          161500      
002680     MOVE 151                     TO  S080-CP-SISTEMA             161600      
002681     MOVE 108                     TO  S080-CP-PROGRAMA            161700      
002682     MOVE 6                       TO  S080-CPPE-CATALOGO          161800      
002683     MOVE 20                      TO  S080-CPPE-CLAVE             161900      
002684     MOVE 2                       TO  S080-CPPE-ORDEN-BUSQ        162000      
002685     MOVE 1                       TO  S080-CPPE-REGISTROS         162100      
002686     MOVE WKS-SISTEMA-PARAMETRO   TO  S080-CPPE-LLAVE2            162200      
002687     MOVE 0                       TO  S080-CPPE-LLAVE1            162300      
002688                                      S080-CPPE-LLAVE3            162400      
002689                                      S080-CPPE-LLAVE4            162500      
002690                                      S080-CPPE-LLAVE5            162600      
002691                                      S080-CPPE-LLAVE6            162700      
002692     MOVE ZEROS                   TO  A2K-FEC-CAMD-001            162800      
002693     MOVE WKS-FECHA-PROCESO       TO  A2K-FEC-CAMD-001            162900      
002694     PERFORM                      A2K-CONV-CAMD-TO-AMD            163000      
002695                          THRU    A2K-CONV-CAMD-TO-AMD-EXIT       163100      
002696     MOVE A2K-FEC-AMD-001         TO  S080-CPPE-FECHA-VIG         163200      
002697     MOVE 0                       TO  S080-CPPE-FECHA-VIG         163300      
002698     MOVE 0                       TO  S080-CPPE-FECHA-CONS        163400      
002699                                      S080-CPPE-NIVEL-INI         163500      
002700     MOVE 0                       TO  W77-EOF                     163600      
002701     PERFORM                      121000-CARGA-TRANSACCIONES      163700      
002702                          UNTIL       W77-EOF >   0              .163800      
002703                                                                  163802      
002704     MOVE 151                           TO S080-CP-SISTEMA     .  163804      
002705     MOVE 108                           TO S080-CP-PROGRAMA    .  163806      
002706     MOVE 1613                          TO S080-CPPE-CATALOGO  .  163808      
002707     MOVE 20                            TO S080-CPPE-CLAVE     .  163810      
002708     MOVE 1                             TO S080-CPPE-ORDEN-BUSQ.  163812      
002709     MOVE 1                             TO S080-CPPE-REGISTROS .  163814      
002710     MOVE ZERO                          TO S080-CPPE-LLAVE1       163816      
002711                                           S080-CPPE-LLAVE2       163818      
002712                                           S080-CPPE-LLAVE3       163820      
002713                                           S080-CPPE-LLAVE4       163822      
002714                                           S080-CPPE-LLAVE5       163824      
002715                                           S080-CPPE-LLAVE6       163826      
002716                                           S080-CP-RESULT         163828      
002717                                           S080-CPPE-FECHA-VIG    163830      
002718                                           S080-CPPE-FECHA-CONS   163832      
002719                                           S080-CPPE-NIVEL-INI    163834      
002720                                           W77-EOF, W77-IND    .  163836      
002721     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    163838      
002722           USING  S080-CP-SISTEMA                                 163840      
002723                  S080-CP-PROGRAMA                                163842      
002724                  S080-CP-PARAMETRO-ENT                           163844      
002725                  S080-CP-PARAMETRO-SAL                           163846      
002726           GIVING S080-CP-RESULT.                                 163848      
002727                                                                  163850      
002728     IF S080-CP-RESULT = 0 OR = 1                                 163852      
002729        NEXT SENTENCE                                             163854      
002730     ELSE                                                         163856      
002731        MOVE 1                      TO W77-EOF.                   163858      
002732     PERFORM 12610-CARGA-CLIENTES UNTIL W77-EOF > 0.              163860      
002733                                                                  163900      
002734 121000-CARGA-TRANSACCIONES.                                      164000      
002735*===========================                                      164100      
002736     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    164200      
002737                          USING       S080-CP-SISTEMA             164300      
002738                                      S080-CP-PROGRAMA            164400      
002739                                      S080-CP-PARAMETRO-ENT       164500      
002740                                      S080-CP-PARAMETRO-SAL       164600      
002741                          GIVING      S080-CP-RESULT              164700      
002742                                                                  164800      
002743     IF S080-CP-RESULT            =   0                       OR  164900      
002744                                  =   1                           165000      
002745        MOVE S080-CPPS-DATOS  (1) TO  S080-CPPE-LLAVE1            165100      
002746                                      W77-IND                     165200      
002747        MOVE S080-CPPS-NIVEL-INI  TO  S080-CPPE-NIVEL-INI         165300      
002748        MOVE S080-CPPS-FECHA-CONS TO  S080-CPPE-FECHA-CONS        165400      
002749        IF W77-IND < 5001                                         165500      
002750           MOVE S080-CPPS-DATOS (03)                              165600      
002751                                  TO  WKS-PT-NUM-LEYEN (W77-IND)  165700      
002752           MOVE S080-CPPS-DATOS (05)                              165800      
002753                                  TO  WKS-PT-EDOCTA    (W77-IND)  165900      
002754           MOVE S080-CPPS-DATOS (09)                              166000      
002755                                  TO  WKS-PT-RENG-BITA (W77-IND)  166100      
002756           MOVE S080-CPPS-DATOS (10)                              166200      
002757                                  TO  WKS-PT-AGR-CONT  (W77-IND)  166300      
002758           MOVE S080-CPPS-DATOS (11)                              166400      
002759                                  TO  WKS-PT-NATS028   (W77-IND)  166500      
002760           MOVE S080-CPPS-DATOS (12)                              166600      
002761                                  TO  WKS-PT-INDS250   (W77-IND)  166700      
002762           MOVE S080-CPPS-DATOS (13)                              166800      
002763                                  TO  WKS-PT-INDBITA   (W77-IND)  166900      
002764        ELSE                                                      167000      
002765           IF W77-SW-CAT6         =   0                           167100      
002766              MOVE 1              TO  W77-SW-CAT6                 167200      
002767           ELSE                                                   167300      
002768              NEXT SENTENCE                                       167400      
002769     ELSE                                                         167500      
002770        MOVE 1                    TO  W77-EOF                     167600      
002771        MOVE S080-CP-RESULT       TO  W77-CAMPO-DISPLAY          .167700      
002772                                                                  167800      
002773     IF S080-CP-RESULT            =   0                           167900      
002774        MOVE 1                    TO  W77-EOF                    .168000      
002775                                                                  168100      
002776 130000-OBTEN-TIT940.                                             168200      
002777*====================                                             168300      
002778     MOVE "S006P940"              TO  WKS-CTLVERS-LIBRERIA        168400      
002779     CALL "DAME_TIT IN CTRLVERS"                                  168500      
002780                          USING       WKS-CTLVERS-LIBRERIA,       168600      
002781                                      WKS-CTLVERS-TITULO          168700      
002782                          GIVING      WKS-CTLVERS-STATUS         .168800      
002783                                                                  168900      
002784     IF WKS-CTLVERS-STATUS < 0                                    169000      
002785        MOVE "(S006)S006/OBJECT/P940/CTRLFTP/01MTP001 ON XFER"    169100      
002786                                  TO  WKS-START-PROG              169200      
002787     ELSE                                                         169300      
002788        STRING WKS-CTLVERS-TITULO DELIMITED BY SIZE               169400      
002789                          INTO        WKS-START-PROG             .169500      
002790                                                                  169600      
002791******************************************************************169700      
002792*                 P R O C E S O                                  *169800      
002793*                 =============                                  *169900      
002794******************************************************************170000      
002795*    LEE ARCHIVO DEL SISTEMA 016 CLASIFICADO EN EL PASO 108  Y   *170100      
002796*    DEPENDIENDO DEL NUMERO DE REGISTROS CARGA EN MEMORIA O EN   *170200      
002797*    DISCO, PARA LA BUSQUEDA DE LA CLAVE INTERCOMPANY POR CADA   *170300      
002798*    REGISTRO SELECCIONADO DE LA LECTURA DEL  ARCHIVO  DE  MO-   *170400      
002799*    VIMIENTOS(LOG) PARA LA GENERA ARCHIVOS BIT                  *170500      
002800******************************************************************170600      
002801 200000-PROCESO.                                                  170700      
002802*===============                                                  170800      
002803*    OPEN    INPUT                ARS016-SORTED                   170900      
002804*    COMPUTE W77-LASTRECORD       =                               171000      
002805*           (ATTRIBUTE LASTRECORD OF ARS016-SORTED                171100      
002806*                                 +   1)                          171200      
002807*    IF W77-LASTRECORD            <   500                         171300      
002808*       MOVE 1                    TO  W77-ACCESO                  171400      
002809*       PERFORM                   210000-CARGA-MEMORIA            171500      
002810*    ELSE                                                         171600      
002811*       MOVE 2                    TO  W77-ACCESO                  171700      
002812*       PERFORM                   220000-CARGA-ARCHIVO            171800      
002813*       OPEN I-O  ARCH-KEY-S016                                  .171900      
002814                                                                  172000      
002815*    CLOSE ARS016-SORTED          WITH RELEASE                    172100      
002816     OPEN INPUT   LOG151                                          172200      
002817                  LOG151-COMP                                     172300      
002818     MOVE ZEROS                   TO  W77-EOF                     172400      
002819     READ LOG151          INTO        A01-R01-DATOS               172500      
002820          AT END                                                  172600      
002821             MOVE 1               TO  W77-EOF                    .172700      
002822                                                                  172800      
002823     IF W77-EOF                   =   0                       AND 172900      
002824        A00-R01-APUDES            >   0                           173000      
002825        COMPUTE LOG-KEY           =   A00-R01-APUDES              173100      
002826                                  +   1                           173200      
002827        READ LOG151-COMP  INTO        A01-R02-TESOFE              173300      
002828             INVALID KEY                                          173400      
002829             MOVE 1               TO  W77-ERROR-BIT              .173500      
002830                                                                  173690      
002831     PERFORM                      230000-ESCOGE-MOVS              173700      
002832                      UNTIL       W77-EOF >   0                  .173800      
002833                                                                  173900      
002834 210000-CARGA-MEMORIA.                                            174000      
002835*=====================                                            174100      
002836     MOVE ZERO                    TO  W77-EOF                     174200      
002837     READ ARS016-SORTED           AT END                          174300      
002838        MOVE 1                    TO  W77-EOF                    .174400      
002839                                                                  174500      
002840     PERFORM                      211000-LLENA-MEMORIA            174600      
002841                      UNTIL       W77-EOF =   1                   174700      
002842     MOVE W77-MEM                 TO  W77-TOT-REG-MEM            .174800      
002843                                                                  174900      
002844 211000-LLENA-MEMORIA.                                            175000      
002845*=====================                                            175100      
002846     ADD 1                        TO  W77-MEM                     175200      
002847     MOVE WKS-CTO-PROD            TO  WKS-MEM-PROD    (W77-MEM)   175300      
002848     MOVE WKS-CTO-INST            TO  WKS-MEM-INST    (W77-MEM)   175400      
002849     MOVE WKS-NUM-CTO             TO  WKS-NUM-CTO-MEM (W77-MEM)   175500      
002850     MOVE ZERO                    TO  WKS-NUM-SUC-MEM (W77-MEM)   175600      
002851     MOVE WKS-CTO-INTERCIA        TO  WKS-MEM-INTERCIA(W77-MEM)   175700      
002852     READ ARS016-SORTED           AT END                          175800      
002853        MOVE 1                    TO  W77-EOF                    .175900      
002854                                                                  176000      
002855 220000-CARGA-ARCHIVO.                                            176100      
002856*=====================                                            176200      
002857     MOVE WKS-SISTEMA-PARAMETRO   TO  WKS-KEY-SISTEMA             176300      
002858     OPEN OUTPUT  ARCH-KEY-S016                                   176400      
002859     CLOSE ARCH-KEY-S016          WITH SAVE                       176500      
002860     OPEN I-O     ARCH-KEY-S016                                   176600      
002861     READ ARS016-SORTED       INTO    REG-CTO-S016                176700      
002862     MOVE ZERO                    TO  W77-EOF                     176800      
002863     PERFORM                      221000-LLENA-ARCHIVO            176900      
002864                      UNTIL       W77-EOF =   1                   177000      
002865     CLOSE ARCH-KEY-S016          WITH SAVE                      .177100      
002866                                                                  177200      
002867 221000-LLENA-ARCHIVO.                                            177300      
002868*=====================                                            177400      
002869     WRITE S016-CONTRATOS     FROM    REG-CTO-S016                177500      
002870           INVALID KEY NEXT SENTENCE                             .177600      
002871                                                                  177700      
002872     READ ARS016-SORTED           AT END                          177800      
002873        MOVE 1                    TO  W77-EOF                    .177900      
002874                                                                  178000      
002875 230000-ESCOGE-MOVS.                                              178100      
002876*===================                                              178200      
002877     MOVE ZEROS                   TO  WKS-CLAVE-CIA               178300      
002878     IF A00-R01-FUNCION           =   1                       AND 178400      
002879        (A00-R01-STATUS           =   1   OR  2)                  178500      
002880        PERFORM                   231000-CARGA-INTERCOMPANY      .178600      
002881     MOVE A00-R01-TIPO-PROC       TO W77-TIPO-PROCESO            .178700      
002882     IF (W88-TIPO-LINEA                                       AND 178730      
002883         W88-PROCESO-LINEA)       OR                              178740      
002884        (W88-TIPO-BATCH                                       AND 178750      
002885         W88-PROCESO-BATCH)                                       178760      
002886        IF (A00-R01-FUNCION       =   1   OR  2)              AND 178800      
002887           (A00-R01-ORIGEN        =   1   OR  3)                  178900      
002888           PERFORM                   232000-GRABA-MOVSCIG        .179000      
002889                                                                  179100      
002890*JRA-INICIO-IBM-IDENTIFICAR SEGUNDO REGISTRO                      179110      
002891*    IF LOG-KEY > 0                                               179120      
002892        MOVE 0            TO REG-02                               179130      
002893                             REGISTRO.                            179135      
002894*JRA-FIN-IBM-IDENTIFICAR SEGUNDO REGISTRO                         179140      
002895*                                                                 179150      
002896     READ LOG151              INTO    A00-R01-REGMOV              179200      
002897       AT END                                                     179300      
002898          MOVE 1                  TO  W77-EOF                    .179400      
002899                                                                  179500      
002900     IF W77-EOF                   =   0                       AND 179600      
002901        A00-R01-APUDES            >   0                           179700      
002902        COMPUTE LOG-KEY           =   A00-R01-APUDES              179800      
002903                                  +   1                           179900      
002904        READ LOG151-COMP      INTO    A01-R01-DATOS               180000      
002905             INVALID KEY                                          180100      
002906              MOVE 1              TO  W77-ERROR-BIT              .180200      
002907                                                                  180300      
002908     IF W77-EOF                   =   0                           180400      
002909        IF A00-R01-FUNCION        =   99                          180500      
002910           MOVE 1                 TO  W77-EOF                    .180600      
002911                                                                  180700      
002912 231000-CARGA-INTERCOMPANY.                                       180800      
002913*==========================                                       180900      
002914     MOVE ZERO                    TO  W77-BUSCA                   181000      
002915     IF A00-R01-CONTRATO          >   0                           181100      
002916        PERFORM 21016-BUSCA-CLIENTE                               181120      
002917                VARYING W77-BUSCA FROM 1 BY 1                     181140      
002918                UNTIL   W77-BUSCA > W77-TOTAL-CL OR               181160      
002919                        W77-BUSCA > 5000.                         181180      
002920*       IF W88-ACCESA-MEMORIA                                     181200      
002921*          PERFORM                231100-BUSCA-EN-MEMORIA         181300      
002922*                     VARYING     W77-MEM FROM 1 BY 1             181400      
002923*                     UNTIL       W77-MEM > W77-TOT-REG-MEM   OR  181500      
002924*                                 W77-MEM > 4500              OR  181600      
002925*                                 W77-BUSCA = 1                   181700      
002926*       ELSE                                                      181800      
002927*          IF W88-ACCESA-DISCO                                    181900      
002928*             MOVE A00-R01-PRODUCTO                               182000      
002929*                                 TO  S016-CTO-PROD               182100      
002930*             MOVE A00-R01-INSTRUMENTO                            182200      
002931*                                 TO  S016-CTO-INST               182300      
002932*             MOVE ZERO           TO  S016-NUM-SUC                182400      
002933*             MOVE A00-R01-CONTRATO                               182500      
002934*                                 TO  S016-NUM-CTO                182600      
002935*             PERFORM             231200-BUSCA-EN-DISCO          .182700      
002936                                                                  182800      
002937 231100-BUSCA-EN-MEMORIA.                                         182900      
002938*========================                                         183000      
002939     IF A00-R01-PRODUCTO          =   WKS-MEM-PROD(W77-MEM)   AND 183100      
002940        A00-R01-INSTRUMENTO       =   WKS-MEM-INST(W77-MEM)   AND 183200      
002941        A00-R01-CONTRATO          =   WKS-NUM-CTO-MEM(W77-MEM)    183300      
002942        MOVE 1                    TO  W77-BUSCA                   183400      
002943        MOVE WKS-MEM-INTERCIA(W77-MEM)                            183500      
002944                                  TO  WKS-CLAVE-CIA               183600      
002945     ELSE                                                         183700      
002946        IF WKS-MEM-PROD(W77-MEM)  >   A00-R01-PRODUCTO            183800      
002947           MOVE 4501              TO  W77-MEM                    .183900      
002948                                                                  184000      
002949 231200-BUSCA-EN-DISCO.                                           184100      
002950*======================                                           184200      
002951     MOVE 1                       TO  W77-BUSCA                   184300      
002952     READ ARCH-KEY-S016                                           184400      
002953          INVALID KEY                                             184500      
002954          MOVE ZERO               TO  W77-BUSCA                  .184600      
002955                                                                  184700      
002956     IF W77-BUSCA                 =   1                           184800      
002957        MOVE S016-CTO-INTERCOMPANY                                184900      
002958                                  TO  WKS-CLAVE-CIA              .185000      
002959                                                                  185100      
002960 232000-GRABA-MOVSCIG.                                            185200      
002961*=====================                                            185300      
002962     PERFORM                      30000-LIMPIA-BIT                185400      
002963     IF A00-R01-CVETRAN1          >   0                           185500      
002964        MOVE WKS-PT-INDS250  (A00-R01-CVETRAN1)                   185600      
002965                                  TO  A00-BIT500-INDALFA (1)     .185700      
002966     IF A00-R01-CVETRAN2          >   0                           185800      
002967        MOVE WKS-PT-INDS250  (A00-R01-CVETRAN2)                   185900      
002968                                  TO  A00-BIT500-INDALFA (2)     .186000      
002969     IF A00-R01-CVETRAN3          >   0                           186100      
002970        MOVE WKS-PT-INDS250  (A00-R01-CVETRAN3)                   186200      
002971                                  TO  A00-BIT500-INDALFA (3)     .186300      
002972     IF A00-R01-CVETRAN4          >   0                           186400      
002973        MOVE WKS-PT-INDS250  (A00-R01-CVETRAN4)                   186500      
002974                                  TO  A00-BIT500-INDALFA (4)     .186600      
002975     IF A00-R01-CVETRAN5          >   0                           186700      
002976        MOVE WKS-PT-INDS250  (A00-R01-CVETRAN5)                   186800      
002977                                  TO  A00-BIT500-INDALFA (5)     .186900      
002978                                                                  187000      
002979     PERFORM                      30100-GRABA-BIT                 187100      
002980                                                                  187200      
002981     MOVE ZERO                    TO  W77-BIT-SALIDA              187300      
002982     PERFORM                      30190-CUENTA-CVES               187400      
002983                      VARYING     W77-IND FROM 1 BY 1             187500      
002984                      UNTIL       W77-IND >    5              OR  187600      
002985                                  W77-BIT-SALIDA = 1             .187700      
002986                                                                  187800      
002987*   COPY "(S151)S151/COPY/GRABABIT/NF/P108 ON CMEMP".             187900      
002988*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002989*COPY "(S151)S151/COPY/GRABABIT/S500 ON CMEMP".                   187910      
002990 30000-LIMPIA-BIT.                                                000100      
002991*=================                                                000200      
002992    MOVE SPACES                     TO A00-BIT500-REGMOV.         000300      
002993    MOVE SPACES                     TO A00-BIT500-FIL-FUTURO      000310      
002994                                       A00-BIT500-CVECON-YREFLOC  000320      
002995                                       A00-BIT500-FILXAPL         000330      
002996                                       A00-BIT500-LEYENDA         000340      
002997                                       A00-BIT500-INF-CBII        000350      
002998                                       A00-BIT500-SIN-USO         000360      
002999                                       A00-BIT500-TIPO-OPER       000370      
003000                                       A00-BIT500-CVE-FILIAL      000380      
003001                                       A00-BIT500-NOMBEN-S500     000382      
003002                                       A00-BIT500-RFCBCO-S500     000384      
003003                                       A00-BIT500-AUT-NIO-S500    000390      
003004                                       A00-BIT500-LEYENDA-SUBC    000395      
003005                                       A01-BIT500-VALOR-IND       000397      
003006                                       A00-BIT500-NOM-BENEF-AMPL. 000399      
003007    MOVE ZERO                       TO A00-BIT500-FUNCION         000400      
003008                                       A00-BIT500-SISTEMA         000500      
003009                                       A00-BIT500-PRODUCTO        000600      
003010                                       A00-BIT500-INSTRUMENTO     000700      
003011                                       A00-BIT500-SUCPROM         000800      
003012                                       A00-BIT500-CONTRATO        000900      
003013                                       A00-BIT500-CVETRAN (1)     001000      
003014                                       A00-BIT500-INDALFA (1)     001100      
003015                                       A00-BIT500-INDLEY  (1)     001200      
003016                                       A00-BIT500-ESQCON  (1)     001300      
003017                                       A00-BIT500-IMPORTE (1)     001400      
003018                                       A00-BIT500-CVETRAN (2)     001500      
003019                                       A00-BIT500-INDALFA (2)     001600      
003020                                       A00-BIT500-INDLEY  (2)     001700      
003021                                       A00-BIT500-ESQCON  (2)     001800      
003022                                       A00-BIT500-IMPORTE (2)     001900      
003023                                       A00-BIT500-CVETRAN (3)     002000      
003024                                       A00-BIT500-INDALFA (3)     002100      
003025                                       A00-BIT500-INDLEY  (3)     002200      
003026                                       A00-BIT500-ESQCON  (3)     002300      
003027                                       A00-BIT500-IMPORTE (3)     002400      
003028                                       A00-BIT500-CVETRAN (4)     002500      
003029                                       A00-BIT500-INDALFA (4)     002600      
003030                                       A00-BIT500-INDLEY  (4)     002700      
003031                                       A00-BIT500-ESQCON  (4)     002800      
003032                                       A00-BIT500-IMPORTE (4)     002900      
003033                                       A00-BIT500-CVETRAN (5)     003000      
003034                                       A00-BIT500-INDALFA (5)     003100      
003035                                       A00-BIT500-INDLEY  (5)     003200      
003036                                       A00-BIT500-ESQCON  (5)     003300      
003037                                       A00-BIT500-IMPORTE (5)     003400      
003038                                       A00-BIT500-FECMOV          003500      
003039                                       A00-BIT500-IND-EFEC        003550      
003040                                       A00-BIT500-HORMOV          003600      
003041                                       A00-BIT500-FECCONT         003700      
003042                                       A00-BIT500-FECVAL          003800      
003043                                       A00-BIT500-AUTORIZA        003900      
003044                                       A00-BIT500-AUT3ER          004000      
003045                                       A00-BIT500-REFNUM          004100      
003046                                       A00-BIT500-CVEMDA          004200      
003047                                       A00-BIT500-NUMMDA          004300      
003048                                       A00-BIT500-MDA-SUC         004400      
003049                                       A00-BIT500-MDA-CTA         004500      
003050                                       A00-BIT500-CVEMDE          004600      
003051                                       A00-BIT500-SUC-INIC        004700      
003052                                       A00-BIT500-CAJA-INIC       004800      
003053                                       A00-BIT500-SUCOPER         004900      
003054                                       A00-BIT500-CAJAOPER        005000      
003055                                       A00-BIT500-SUCTRAN         005100      
003056                                       A00-BIT500-CAJATRAN        005200      
003057                                       A00-BIT500-NOMINA-OPE      005300      
003058                                       A00-BIT500-ORIGEN          005400      
003059                                       A00-BIT500-MONEDA          005500      
003060                                       A00-BIT500-AUT-S151        005600      
003061                                       A00-BIT500-AUTELI-S151     005700      
003062                                       A00-BIT500-AUTELI-ANT-S151 005800      
003063                                       A00-BIT500-TIPO-PROC       005900      
003064                                       A00-BIT500-SOBREGIRO       006000      
003065                                       A00-BIT500-CVEAVISO        006100      
003066                                       A00-BIT500-IND-EDOCTA      006200      
003067                                       A00-BIT500-IND-DATOS-ADIC  006300      
003068                                       A00-BIT500-FECUM-NDIAS     006400      
003069                                       A00-BIT500-SECTOR          006500      
003070                                       A00-BIT500-BANCA           006600      
003071                                     WKS-BIT500-DATAGRUP1-PROD-TPR006700      
003072                                     WKS-BIT500-DATAGRUP2-INST-TCR006800      
003073                                       WKS-BIT500-SIRH-DEPTO      006900      
003074                                       WKS-BIT500-LIBRO-CONTABLE  007000      
003075                                       WKS-BIT500-CVE-DESVIO (1)  007100      
003076                                       WKS-BIT500-GUIA-DESVIO(1)  007200      
003077                                       WKS-BIT500-CVE-DESVIO (2)  007300      
003078                                       WKS-BIT500-GUIA-DESVIO(2)  007400      
003079                                       WKS-BIT500-CVE-DESVIO (3)  007500      
003080                                       WKS-BIT500-GUIA-DESVIO(3)  007600      
003081                                       WKS-BIT500-CVE-DESVIO (4)  007700      
003082                                       WKS-BIT500-GUIA-DESVIO(4)  007800      
003083                                       WKS-BIT500-CVE-DESVIO (5)  007900      
003084                                       WKS-BIT500-GUIA-DESVIO(5)  008000      
003085                                       A00-BIT500-NODO-ORIG       008100      
003086                                       A00-BIT500-STATUS          008200      
003087                                       A00-BIT500-NOMINA-FUN1     008300      
003088                                       A00-BIT500-NOMINA-FUN2     008400      
003089                                       A00-BIT500-CONT-ORIG       008420      
003090                                       A00-BIT500-NOMINA-MAKER    008440      
003091                                       A00-BIT500-NOMINA-CHECKER  008460      
003092                                       A00-BIT500-REF23POS        008465      
003093                                       A00-BIT500-COMPREF         008470      
003094                                       A00-BIT500-FEC-PAGO        008480      
003095                                       A00-BIT500-SIST-ORIG       008500      
003096                                       A00-BIT500-PROD-ORIG       008600      
003097                                       A00-BIT500-INST-ORIG       008700      
003098                                       A00-BIT500-SALDO           008800      
003099                                       A00-BIT500-AGRUP-DESVIO    008820      
003100                                       A00-BIT500-TRUI-S500       008822      
003101                                       A00-BIT500-MICR-S500       008824      
003102                                       A00-BIT500-CTABEN-S500     008826      
003103                                       A00-BIT500-BCREC-S500      008828      
003104                                       A00-BIT500-AGRUP-INST      008830      
003105                                       A00-BIT500-AGRUP-SIRH      008840      
003106                                       A00-BIT500-VER-FIRMA       008845      
003107                                       A00-BIT500-IND-ENVIO-CITI  008850      
003108                                       A00-BIT500-BCO-ORI         009460      
003109                                       A00-BIT500-BCO-DES         009480      
003110                                       A00-BIT500-IMPBASE-ESQFINAN009485      
003111                                       A00-BIT500-ESTATUS-REG     009490      
003112                                       A00-BIT500-SERVICIO-ALERTA 009491      
003113                                       A00-BIT500-GRUPO-SOC       009492      
003114                                       A00-BIT500-BIN-TAR         009494      
003115                                       A00-BIT500-SDO-FIN-S500    009496      
003116                                       A00-BIT500-IND-EXTNET.     009500      
003117*                                       A00-BIT500-IND-SUBC       009505      
003118*                                       A00-BIT500-PRO-SUBC       009510      
003119*                                       A00-BIT500-INST-SUBC      009515      
003120*                                       A00-BIT500-MON-SUBC       009520      
003121*                                       A00-BIT500-CONT-SUBC      009525      
003122*                                       A00-BIT500-CTAMDA-SUBC    009530      
003123*                                       A00-BIT500-STA-SUBC       009535      
003124*                                       A00-BIT500-INDALER-SUBC   009540      
003125*                                       A00-BIT500-INDCTACON-SUBC.009545      
003126                                                                  009550      
003127 30190-CUENTA-CVES.                                               009555      
003128*==================                                               009600      
003129    IF A00-BIT500-FUNCION = 1                                     009700      
003130       IF A00-BIT500-CVETRAN(W77-IND) = 0 AND                     009800      
003131          A00-BIT500-IMPORTE(W77-IND) = 0                         009900      
003132          IF W77-IND = 1                                          010000      
003133             ADD 1                  TO WKS-TR500-TOT-CVES         010100      
003134          ELSE                                                    010200      
003135             MOVE 1                 TO W77-BIT-SALIDA             010300      
003136       ELSE                                                       010400      
003137          ADD 1                     TO WKS-TR500-TOT-CVES         010500      
003138    ELSE                                                          010600      
003139       MOVE 1                       TO W77-BIT-SALIDA             010700      
003140       ADD 1                        TO WKS-TR500-TOT-CVES.        010800      
003141                                                                  010900      
003142 30100-GRABA-BIT.                                                 011000      
003143*================                                                 011100      
003144    MOVE "5"                        TO A00-BIT500-TIPO-REG       .011200      
003145    MOVE A00-R01-FUNCION            TO A00-BIT500-FUNCION        .011300      
003146    MOVE A00-R01-SISTEMA            TO A00-BIT500-SISTEMA        .011400      
003147    MOVE A00-R01-PRODUCTO           TO A00-BIT500-PRODUCTO       .011500      
003148    MOVE A00-R01-INSTRUMENTO        TO A00-BIT500-INSTRUMENTO    .011600      
003149    MOVE A00-R01-SUCPROM            TO A00-BIT500-SUCPROM        .011700      
003150    MOVE A00-R01-CONTRATO           TO A00-BIT500-CONTRATO       .011800      
003151    MOVE A00-R01-CVETRAN1           TO A00-BIT500-CVETRAN (1)    .011900      
003152    MOVE A00-R01-INDLEY1            TO A00-BIT500-INDLEY  (1)    .012000      
003153    MOVE A00-R01-ESQCON1            TO A00-BIT500-ESQCON  (1)    .012100      
003154    MOVE A00-R01-IMPORTE1           TO A00-BIT500-IMPORTE (1)    .012200      
003155    ADD  A00-R01-IMPORTE1           TO WKS-TR500-TOT-IMP         .012300      
003156    MOVE A00-R01-CVETRAN2           TO A00-BIT500-CVETRAN (2)    .012400      
003157    MOVE A00-R01-INDLEY2            TO A00-BIT500-INDLEY  (2)    .012500      
003158    MOVE A00-R01-ESQCON2            TO A00-BIT500-ESQCON  (2)    .012600      
003159    MOVE A00-R01-IMPORTE2           TO A00-BIT500-IMPORTE (2)    .012700      
003160    ADD  A00-R01-IMPORTE2           TO WKS-TR500-TOT-IMP         .012800      
003161    MOVE A00-R01-CVETRAN3           TO A00-BIT500-CVETRAN (3)    .012900      
003162    MOVE A00-R01-INDLEY3            TO A00-BIT500-INDLEY  (3)    .013000      
003163    MOVE A00-R01-ESQCON3            TO A00-BIT500-ESQCON  (3)    .013100      
003164    MOVE A00-R01-IMPORTE3           TO A00-BIT500-IMPORTE (3)    .013200      
003165    ADD  A00-R01-IMPORTE3           TO WKS-TR500-TOT-IMP         .013300      
003166    MOVE A00-R01-CVETRAN4           TO A00-BIT500-CVETRAN (4)    .013400      
003167    MOVE A00-R01-INDLEY4            TO A00-BIT500-INDLEY  (4)    .013500      
003168    MOVE A00-R01-ESQCON4            TO A00-BIT500-ESQCON  (4)    .013600      
003169    MOVE A00-R01-IMPORTE4           TO A00-BIT500-IMPORTE (4)    .013700      
003170    ADD  A00-R01-IMPORTE4           TO WKS-TR500-TOT-IMP         .013800      
003171    MOVE A00-R01-CVETRAN5           TO A00-BIT500-CVETRAN (5)    .013900      
003172    MOVE A00-R01-INDLEY5            TO A00-BIT500-INDLEY  (5)    .014000      
003173    MOVE A00-R01-ESQCON5            TO A00-BIT500-ESQCON  (5)    .014100      
003174    MOVE A00-R01-IMPORTE5           TO A00-BIT500-IMPORTE (5)    .014200      
003175    ADD  A00-R01-IMPORTE5           TO WKS-TR500-TOT-IMP         .014300      
003176    MOVE A00-R01-FECMOV             TO A00-BIT500-FECMOV         .014400      
003177    MOVE A00-R01-HORMOV             TO A00-BIT500-HORMOV         .014500      
003178    MOVE A00-R01-FECCONT            TO A00-BIT500-FECCONT        .014600      
003179                                                                  014700      
003180    MOVE A00-R01-FECVAL             TO A00-BIT500-FECVAL         .015000      
003181    MOVE A00-R01-AUTORIZA           TO A00-BIT500-AUTORIZA       .015100      
003182    MOVE A00-R01-AUT3ER             TO A00-BIT500-AUT3ER         .015200      
003183    MOVE A00-R01-REFNUM             TO A00-BIT500-REFNUM         .015300      
003184    MOVE A00-R01-CVEMDA             TO A00-BIT500-CVEMDA         .015350      
003185    MOVE A00-R01-MDA-SUC            TO A00-BIT500-MDA-SUC        .015400      
003186    MOVE A00-R01-MDA-CTA            TO A00-BIT500-MDA-CTA        .015500      
003187                                                                  015600      
003188    MOVE A00-R01-CVEMDE             TO A00-BIT500-CVEMDE         .015700      
003189    MOVE A00-R01-SUC-INIC           TO A00-BIT500-SUC-INIC       .015800      
003190    MOVE A00-R01-CAJA-INIC          TO A00-BIT500-CAJA-INIC      .015900      
003191    MOVE A00-R01-SUCOPER            TO A00-BIT500-SUCOPER        .016000      
003192    MOVE A00-R01-CAJAOPER           TO A00-BIT500-CAJAOPER       .016100      
003193    MOVE A00-R01-SUCTRAN            TO A00-BIT500-SUCTRAN        .016200      
003194    MOVE A00-R01-CAJATRAN           TO A00-BIT500-CAJATRAN       .016300      
003195    MOVE A00-R01-NOMINA-OPE         TO A00-BIT500-NOMINA-OPE     .016400      
003196    MOVE A00-R01-IND-EFEC           TO A00-BIT500-IND-EFEC       .016500      
003197    MOVE A00-R01-ORIGEN             TO A00-BIT500-ORIGEN         .016600      
003198    MOVE A00-R01-MONEDA             TO A00-BIT500-MONEDA         .016700      
003199    MOVE A00-R01-AUT-S151           TO A00-BIT500-AUT-S151       .016800      
003200                                                                  016900      
003201    MOVE A00-R01-AUT-AELIM-S151     TO A00-BIT500-AUTELI-S151    .017000      
003202    MOVE A00-R01-AUT-ANT-S151       TO A00-BIT500-AUTELI-ANT-S151.017100      
003203    MOVE A00-R01-TIPO-PROC          TO A00-BIT500-TIPO-PROC      .017200      
003204                                                                  017300      
003205    MOVE A00-R01-SOBREGIRO          TO A00-BIT500-SOBREGIRO      .017600      
003206                                                                  017700      
003207    MOVE A00-R01-CVEAVISO           TO A00-BIT500-CVEAVISO       .018000      
003208                                                                  018100      
003209    MOVE A00-R01-IND-EDOCTA         TO A00-BIT500-IND-EDOCTA     .018400      
003210    MOVE A00-R01-IND-DATOS-ADIC     TO A00-BIT500-IND-DATOS-ADIC .018500      
003211    MOVE A00-R01-PLAZO              TO A00-BIT500-FECUM-NDIAS    .018600      
003212    MOVE A00-R01-SECTOR             TO A00-BIT500-SECTOR         .018700      
003213    MOVE A00-R01-BANCA              TO A00-BIT500-BANCA          .018800      
003214                                                                  018900      
003215    MOVE SPACES                     TO A00-BIT500-FIL-FUTURO     .019200      
003216    MOVE A00-R01-CLIENTE            TO A00-BIT500-FIL-FUTURO     .019300      
003217                                                                  019400      
003218    MOVE A00-R01-NODO-ORIG          TO A00-BIT500-NODO-ORIG      .019500      
003219    MOVE A00-R01-STATUS             TO A00-BIT500-STATUS         .019600      
003220    MOVE WKS-CLAVE-CIA              TO A00-BIT500-INTERCOMPANY   .019700      
003221    MOVE A00-R01-SIST-ORIG          TO A00-BIT500-SIST-ORIG       019800      
003222    MOVE A00-R01-PROD-ORIG          TO A00-BIT500-PROD-ORIG       019900      
003223    MOVE A00-R01-INST-ORIG          TO A00-BIT500-INST-ORIG       020000      
003224    MOVE SPACES                     TO A00-BIT500-FILXAPL         020100      
003225    MOVE A00-R01-CVETR-ORIG         TO A00-BIT500-CVETR-ORIG      020200      
003226    MOVE  A00-R01-SERVICIO          TO A00-BIT500-SERVICIO        020202      
003227    MOVE  A00-R01-TIPO-OPERACION    TO A00-BIT500-TIPO-OPER       020204      
003228    MOVE  A00-R01-TIPO-MOVIMIENTO   TO A00-BIT500-TIPO-MOV        020206      
003229    MOVE  A00-R01-AGRUP-DESV-PROD   TO A00-BIT500-AGRUP-DESVIO    020208      
003230    MOVE  A00-R01-AGRUP-DESV-INST   TO A00-BIT500-AGRUP-INST      020210      
003231    MOVE  A00-R01-SIRH-DESVIO       TO A00-BIT500-AGRUP-SIRH      020212      
003232    MOVE  A00-R01-ENVIO-CD          TO A00-BIT500-IND-ENVIO-CITI  020214      
003233    IF A00-R01-SISTEMA NOT = 500                                  020215      
003234       MOVE  A00-R01-FILIAL         TO A00-BIT500-CVE-FILIAL.     020216      
003235    MOVE  A00-R01-NIO               TO A00-BIT500-AUT-NIO-S500    020218      
003236    IF A00-R01-SISTEMA = 500                                      020219      
003237       MOVE  A00-R01-SERVICIO-ALERTA TO A00-BIT500-SERVICIO-ALERTA020220      
003238       MOVE  A00-R01-GRUPO-SOC    TO A00-BIT500-GRUPO-SOC         020221      
003239       MOVE  A00-R01-BIN-TAR      TO A00-BIT500-BIN-TAR           020222      
003240       MOVE  A01-R01-SDO-FIN-S500 TO A00-BIT500-SDO-FIN-S500      020223      
003241       MOVE  A00-R01-MOTIVO-DEV   TO A00-BIT500-MOTIVO-DEV        020224      
003242       MOVE  A00-R01-NOMB-BCO     TO A00-BIT500-NOM-BCO-EMISOR    020225      
003243       MOVE  A00-R01-REF-CECO     TO A00-BIT500-REF-CECOBAN       020226      
003244       MOVE  A00-R01-NUM-ORD-PAGO TO A00-BIT500-NUM-ORD-PAGO      020228      
003245       MOVE A00-R01-VERIF-FIRMA   TO A00-BIT500-VER-FIRMA.        020250      
003246    IF A00-R01-SISTEMA = 500                                      020300      
003247*============================================== REDEFINICION 1 (S5020400      
003248       MOVE A00-R01-TCHEQ           TO A00-BIT500-TIPO-CHEQUE     020450      
003249       MOVE A00-R01-CVECAUSA        TO A00-BIT500-CVECAUSA        020500      
003250       MOVE A00-R01-FECDEV          TO A00-BIT500-FECDEV          020600      
003251       MOVE A00-R01-BCO             TO A00-BIT500-BANCO           020700      
003252       MOVE A00-R01-BCO-ORI         TO A00-BIT500-BCO-ORI         020720      
003253       MOVE A00-R01-BCO-DES         TO A00-BIT500-BCO-DES         020740      
003254       MOVE A00-R01-NOMORD          TO A00-BIT500-NOMORD          020800      
003255       MOVE A00-R01-CAUSAORD        TO A00-BIT500-CAUSAORD        020900      
003256       MOVE A00-R01-SUCORD          TO A00-BIT500-SUCORD          021000      
003257       MOVE A00-R01-CTACON          TO A00-BIT500-CTACON          021100      
003258       MOVE A00-R01-CLIENTE         TO A00-BIT500-CLIENTE-S500    021150      
003259       MOVE A00-R01-ESTACION        TO A00-BIT500-S015            021170      
003260    ELSE                                                          021200      
003261    IF A00-R01-SISTEMA = 264                                      026500      
003262       MOVE SPACES                  TO A00-BIT500-CVECON-YREFLOC  026600      
003263                                       A00-BIT500-FILXAPL         026700      
003264       MOVE ZEROS                   TO A00-BIT500-NOMINA-FUN1     026800      
003265                                       A00-BIT500-NOMINA-FUN2     026900      
003266                                       A00-BIT500-SIST-ORIG       027000      
003267                                       A00-BIT500-PROD-ORIG       027100      
003268                                       A00-BIT500-INST-ORIG.      027200      
003269                                                                  033500      
003270    IF A00-R01-APUDES > 0                                         040100      
003271       MOVE A01-R01-NOMINA-FUN1     TO A00-BIT500-NOMINA-FUN1     040200      
003272       MOVE A01-R01-NOMINA-FUN2     TO A00-BIT500-NOMINA-FUN2     040300      
003273       MOVE A01-R01-CONT-ORIG       TO A00-BIT500-CONT-ORIG       040400      
003274       MOVE A01-R01-REF23POS        TO A00-BIT500-REF23POS        040420      
003275       MOVE A01-R01-COMPREF         TO A00-BIT500-COMPREF   .     040440      
003276    MOVE ZERO                       TO W77-ERROR-BIT.             040500      
003277                                                                  040600      
003278    IF A00-R01-APUDES > 0                                         040700      
003279       MOVE A01-R01-LEY1             TO WKS-LEY-ARCH              040800      
003280                                        A00-BIT500-LEYENDA        040820      
003281*      MOVE A01-R01-NOM-MAKER        TO A00-BIT500-NOMINA-MAKER   040825      
003282*      MOVE A01-R01-NOM-CHECKER      TO A00-BIT500-NOMINA-CHECKER 040830      
003283       MOVE A01-R01-REF-CLIENTE      TO A00-BIT500-REF-CLIENTE    040835      
003284       MOVE A01-R01-REFERENCIA1      TO A00-BIT500-REFERENCIA1-CTE040840      
003285       MOVE A01-R01-REF2-CTE         TO A00-BIT500-REFERENCIA2-CTE040845      
003286       MOVE A01-R01-REF3-CTE         TO A00-BIT500-REFERENCIA3-CTE040850      
003287       MOVE A01-R01-REF4-CTE         TO A00-BIT500-REFERENCIA4-CTE040855      
003288       MOVE A01-R02-LEY2             TO A00-BIT500-LEYENDA2       040860      
003289       MOVE A01-R02-LEY3             TO A00-BIT500-LEYENDA3       040865      
003290       MOVE  A01-R02-LEY4            TO A00-BIT500-LEYENDA4       040875      
003291       MOVE  A01-R02-LEY5            TO A00-BIT500-LEYENDA5       040885      
003292                                                                  040890      
003293       IF A00-R01-SISTEMA = 500                                   040900      
003294          MOVE A01-R01-NOMB-CTE    TO A00-BIT500-NOM-CLIENTE      040910      
003295          MOVE A01-R01-NOMB-BENEF  TO A00-BIT500-NOM-BENEFICIARIO 040920      
003296          MOVE A01-R01-CVE-RASTREO-S500 TO A00-BIT500-CVE-RASTREO 040930      
003297          MOVE A01-R01-FECHA-PAGO       TO A00-BIT500-FEC-PAGO    040940      
003298          IF WKS-LEY-P1 IS NUMERIC                                041000      
003299             MOVE WKS-LEY-P1           TO A00-BIT500-REF-CBII     041100      
003300          ELSE                                                    041200      
003301             MOVE SPACES               TO A00-BIT500-INF-CBII.    041300      
003302                                                                  041305      
003303    IF  A00-R01-SISTEMA  = 500 AND A00-R01-APUDES > 0             041340      
003304       PERFORM 30110-VALIDA-REFERENCIA.                           041360      
003305                                                                  042104      
003306*JRA-INICIO-IBM LEE EL SEGUNDO REGISTRO                           042108      
003307                                                                  042128      
003308    IF A01-R01-APUDES > 0                                         042132      
003309       MOVE A01-R01-APUDES   TO REGISTRO                          042134      
003310       COMPUTE LOG-KEY = A01-R01-APUDES + 1                       042136      
003311       READ LOG151-COMP      INTO A01-R01-DATOS                   042140      
003312         INVALID KEY                                              042144      
003313           MOVE 1        TO REG-02                                042148      
003314           MOVE LOW-VALUES TO A01-R01-DATOS.                      042150      
003315                                                                  042178      
003316    IF REGISTRO > 0 AND REG-02 = 0                                042180      
003317                                                                  042182      
003318     PERFORM 30100-VALIDA-NUMERICO                                042184      
003319                                                                  042186      
003320*<INICIO-IBM> FPC CONTROL INTERNO DE FRAUDES FASE2                042188      
003321     MOVE A01-R01-NOMPAN-S500         TO  A00-BIT500-NOMPAN-S500  042190      
003322     MOVE A01-R01-OPCPAN-S500         TO  A00-BIT500-OPCPAN-S500  042192      
003323     MOVE A01-R01-NUMCTO1-S500        TO  A00-BIT500-NUMCTO1-S500 042194      
003324     MOVE A01-R01-NUMCTO2-S500        TO  A00-BIT500-NUMCTO2-S500 042196      
003325     MOVE A01-R01-NUMCTO3-S500        TO  A00-BIT500-NUMCTO3-S500 042198      
003326*<FIN-IBM> FPC CONTROL INTERNO DE FRAUDES FASE2                   042200      
003327     MOVE A01-R01-NOM-BENEFOTROBCO    TO  A00-BIT500-NOMBEN-S500  042232      
003328     MOVE A01-R01-RFC-OTROBCO         TO  A00-BIT500-RFCBCO-S500  042233      
003329*INICIO CJMG TESOFE 2019                                          042234      
003330     IF A01-R01-IND-SUBC = 1                                      042235      
003331     MOVE A01-R01-IND-SUBC            TO  A00-BIT500-IND-SUBC     042236      
003332     MOVE A01-R01-PRO-SUBC            TO  A00-BIT500-PRO-SUBC     042237      
003333     MOVE A01-R01-INST-SUBC           TO  A00-BIT500-INST-SUBC    042238      
003334     MOVE A01-R01-MON-SUBC            TO  A00-BIT500-MON-SUBC     042239      
003335     MOVE A01-R01-CONT-SUBC           TO  A00-BIT500-CONT-SUBC    042240      
003336     MOVE A01-R01-CTAMDA-SUBC         TO  A00-BIT500-CTAMDA-SUBC  042241      
003337     MOVE A01-R01-STA-SUBC            TO  A00-BIT500-STA-SUBC     042242      
003338     MOVE A01-R01-INDALER-SUBC        TO  A00-BIT500-INDALER-SUBC 042243      
003339     MOVE A01-R01-INDCTACON-SUBC      TO                          042244      
003340                                        A00-BIT500-INDCTACON-SUBC 042245      
003341     MOVE A01-R01-LEYENDA-SUBC        TO A00-BIT500-LEYENDA-SUBC. 042246      
003342*FIN CJMF TESOFE 2019                                             042247      
003343     IF A01-R01-VALOR-IND = "01"                                  042250      
003344       MOVE A01-R01-VALOR-IND        TO A01-BIT500-VALOR-IND      042252      
003345       MOVE A01-R01-NOMB-BENEF-AMPLI TO A00-BIT500-NOM-BENEF-AMPL.042254      
003346*JRA-FIN-IBM LEE SEGUNDO REGISTRO                                 042260      
003347                                                                  042262      
003348*INI EXTNET    2024.06                                            042267      
003349     IF A00-R01-FORMATO = 2                                       042272      
003350        MOVE A01-R01-IND-EXTNET      TO A00-BIT500-IND-EXTNET     042273      
003351     ELSE                                                         042274      
003352        MOVE 0                       TO A00-BIT500-IND-EXTNET.    042275      
003353*FIN EXTNET    2024.06                                            042276      
003354                                                                  042280      
003355    WRITE REG-MOVSCIG FROM  A00-BIT500-REGMOV.                    042300      
003356    ADD 1                              TO WKS-TR500-TOT-REG.      042400      
003357                                                                  042500      
003358 30100-VALIDA-NUMERICO.                                           042600      
003359*JRA-INICIO-VALIDA NUMERICO TRUI                                  042700      
003360   IF A01-R01-CSIID-RECEPTOR IS NUMERIC                           042800      
003361     MOVE A01-R01-CSIID-RECEPTOR      TO  A00-BIT500-CSIREC-S500  042900      
003362   ELSE                                                           043000      
003363     MOVE ZEROS                       TO  A00-BIT500-CSIREC-S500. 043100      
003364                                                                  043200      
003365   IF A01-R01-CSIID-ORIGEN IS NUMERIC                             043300      
003366     MOVE A01-R01-CSIID-ORIGEN        TO  A00-BIT500-CSIOR-S500   043400      
003367   ELSE                                                           043500      
003368     MOVE ZEROS                       TO  A00-BIT500-CSIOR-S500.  043600      
003369                                                                  043700      
003370   IF A01-R01-NUM-OPERACION IS NUMERIC                            043800      
003371     MOVE A01-R01-NUM-OPERACION       TO  A00-BIT500-NUMOP-S500   043900      
003372   ELSE                                                           044000      
003373     MOVE ZEROS                       TO  A00-BIT500-NUMOP-S500.  044100      
003374                                                                  044200      
003375   IF A01-R01-NUM-TRANSACCI IS NUMERIC                            044300      
003376     MOVE A01-R01-NUM-TRANSACCI       TO  A00-BIT500-NUMTR-S500   044400      
003377   ELSE                                                           044500      
003378     MOVE ZEROS                       TO  A00-BIT500-NUMTR-S500.  044600      
003379                                                                  044700      
003380   IF A01-R01-INST-MONETARIO IS NUMERIC                           044800      
003381     MOVE A01-R01-INST-MONETARIO      TO  A00-BIT500-INSMN-S500   044900      
003382   ELSE                                                           045000      
003383     MOVE ZEROS                       TO  A00-BIT500-INSMN-S500.  045100      
003384*JRA-FIN-VALIDA NUMERICO TRUI                                     045200      
003385                                                                  045300      
003386*JRA-INICIO-VALIDA NUMERICO MICR                                  045400      
003387   IF A01-R01-COD-SEGURIDAD IS NUMERIC                            045500      
003388     MOVE A01-R01-COD-SEGURIDAD       TO  A00-BIT500-CODSEG-S500  045600      
003389   ELSE                                                           045700      
003390     MOVE ZEROS                       TO  A00-BIT500-CODSEG-S500. 045800      
003391                                                                  045900      
003392   IF A01-R01-VER-PREMARCADO IS NUMERIC                           046000      
003393     MOVE A01-R01-VER-PREMARCADO      TO  A00-BIT500-VERPRE-S500  046100      
003394   ELSE                                                           046200      
003395     MOVE ZEROS                       TO  A00-BIT500-VERPRE-S500. 046300      
003396                                                                  046400      
003397   IF A01-R01-COD-TRANSMONE IS NUMERIC                            046500      
003398     MOVE A01-R01-COD-TRANSMONE       TO  A00-BIT500-CTRMON-S500  046600      
003399   ELSE                                                           046700      
003400     MOVE ZEROS                       TO  A00-BIT500-CTRMON-S500. 046800      
003401                                                                  046900      
003402   IF A01-R01-PLAZA-CECOBAN IS NUMERIC                            047000      
003403     MOVE A01-R01-PLAZA-CECOBAN       TO  A00-BIT500-PLCEC-S500   047100      
003404   ELSE                                                           047200      
003405     MOVE ZEROS                       TO  A00-BIT500-PLCEC-S500.  047300      
003406                                                                  047400      
003407   IF A01-R01-COD-BCOEMISOR IS NUMERIC                            047500      
003408     MOVE A01-R01-COD-BCOEMISOR       TO  A00-BIT500-BNCEM-S500   047600      
003409   ELSE                                                           047700      
003410     MOVE ZEROS                       TO  A00-BIT500-BNCEM-S500.  047800      
003411                                                                  047900      
003412   IF A01-R01-DIG-VINTERCAM IS NUMERIC                            048000      
003413     MOVE A01-R01-DIG-VINTERCAM       TO  A00-BIT500-DVEIN-S500   048100      
003414   ELSE                                                           048200      
003415     MOVE ZEROS                       TO  A00-BIT500-DVEIN-S500.  048300      
003416                                                                  048400      
003417   IF A01-R01-NUM-CTACHEQUE IS NUMERIC                            048500      
003418     MOVE A01-R01-NUM-CTACHEQUE       TO  A00-BIT500-CTACH-S500   048600      
003419   ELSE                                                           048700      
003420     MOVE ZEROS                       TO  A00-BIT500-CTACH-S500.  048800      
003421                                                                  048900      
003422   IF A01-R01-NUM-REFCHEQUE IS NUMERIC                            049000      
003423     MOVE A01-R01-NUM-REFCHEQUE       TO  A00-BIT500-REFCH-S500   049100      
003424   ELSE                                                           049200      
003425     MOVE ZEROS                       TO  A00-BIT500-REFCH-S500.  049300      
003426*JRA-FIN-VALIDA NUMERICO MICR                                     049400      
003427                                                                  049500      
003428*JRA-INICIO-VALIDA NUMERICO PFG A                                 049600      
003429   IF A01-R01-CTA-BENEFOTROBCO IS NUMERIC                         049700      
003430     MOVE A01-R01-CTA-BENEFOTROBCO    TO  A00-BIT500-CTABEN-S500  049800      
003431   ELSE                                                           049900      
003432     MOVE ZEROS                       TO  A00-BIT500-CTABEN-S500. 050000      
003433                                                                  050100      
003434   IF A01-R01-BCO-RECEPOTROBCO IS NUMERIC                         050200      
003435     MOVE A01-R01-BCO-RECEPOTROBCO    TO  A00-BIT500-BCREC-S500   050300      
003436   ELSE                                                           050400      
003437     MOVE ZEROS                       TO  A00-BIT500-BCREC-S500.  050500      
003438*JRA-FIN-VALIDA NUMERICO PFG A                                    050600      
003439                                                                  051000      
003440 30110-VALIDA-REFERENCIA.                                         052000      
003441    MOVE A01-R01-REFERENCIA1 TO A01-REF-TEMP.                     053000      
003442                                                                  054000      
003443    IF    (A00-R01-CVETRAN1 = 1134  OR A00-R01-CVETRAN2 = 1134    055000      
003444       OR  A00-R01-CVETRAN3 = 1134  OR A00-R01-CVETRAN4 = 1134    056000      
003445       OR  A00-R01-CVETRAN5 = 1134)                               057000      
003446    AND (A00-R01-CAJATRAN = 78    OR A00-R01-CAJATRAN = 87        058000      
003447    OR A00-R01-CAJATRAN = 72)                                     059000      
003448    AND  A00-R01-SUCTRAN = 0859  AND A01-REF-DOC  IS NUMERIC      060000      
003449        MOVE A01-REF-DOC-NUM TO A00-BIT500-REFNUM                 061000      
003450        MOVE A00-R01-IND-EFEC           TO A00-BIT500-IND-EFEC    062000      
003451    ELSE                                                          063000      
003452        NEXT SENTENCE.                                            064000      
003453*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003454                                                                  188000      
003455******************************************************************188100      
003456*                 F I N                                          *188200      
003457*                 ======                                         *188300      
003458******************************************************************188400      
003459*    ESCRIBE REGISTRO TRAILER DEL ARCHIVO PARA LA BIT            *188500      
003460*    CIERRA ARCHIVOS                                             *188600      
003461*    ENVIA EL ARCHIVO DE LA BIT MEDIANTE LA EJECUCION DEL WFL    *188700      
003462******************************************************************188800      
003463 600000-FIN.                                                      188900      
003464*===========                                                      189000      
003465     WRITE REG-MOVSCIG    FROM        WKS-TR500-CIG               189100      
003466     IF W88-ACCESA-DISCO                                          189200      
003467        CLOSE ARCH-KEY-S016       WITH PURGE                     .189300      
003468                                                                  189400      
003469     CLOSE LOG151                                                 189500      
003470           LOG151-COMP                                            189600      
003471           MOVSCIG                WITH SAVE                       189700      
003472     PERFORM                      700000-ENVIA-BIT               .189800      
003473                                                                  189900      
003474 700000-ENVIA-BIT.                                                190000      
003475*=================                                                190100      
003476    CALL SYSTEM WFL       USING       WKS-TIT-WFL                .190200      
003477                                                                  190300      
003478*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003479*   COPY "S151/CRONOS2K/CPY/PD".                                  190400      
003480** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
003481** Unisys has defined for CRONOS2K project                     ** 000200      
003482** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
003483***************************************************************** 000400      
003484***************************************************************** 000600      
003485** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
003486** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
003487** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
003488** date MMDDCCAA, which is returned into the variable          ** 001000      
003489** A2K-FEC-MDCA-001.                                           ** 001100      
003490***************************************************************** 001200      
003491                                                                  001300      
003492 A2K-ACCEPT-TODAYS-DATE.                                          001400      
003493        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
003494*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
003495        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
003496        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
003497        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
003498        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
003499        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
003500                                                                  002200      
003501 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
003502        EXIT.                                                     002240      
003503                                                                  002500      
003504****************************************************************  002600      
003505** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
003506**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
003507**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
003508**baseyear to add the century to the year part.               **  003000      
003509**INPUT is A2K-FEC-AMD-001                                    **  003100      
003510**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
003511****************************************************************  003300      
003512                                                                  003400      
003513 A2K-CONV-AMD-TO-CAMD.                                            003500      
003514         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
003515         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
003516         IF A2K-FEC-AMD-001 = 0                                   003720      
003517            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
003518         ELSE                                                     003741      
003519          IF A2K-FEC-AMD-001 = 999999                             003742      
003520             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
003521         ELSE                                                     003760      
003522         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
003523                 A2K-OBTAIN-CENTURY-EXIT                          003900      
003524         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
003525         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
003526         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
003527         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
003528                                                                  004400      
003529 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
003530         EXIT.                                                    004600      
003531                                                                  004700      
003532******************************************************************004800      
003533**A2K-CONV-MDA-TO-MDCA.                                         **004900      
003534**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
003535** an eight digit format as MMDDCCAA. It use a                  **005100      
003536** baseyear to add century to the yaer.                         **005200      
003537** INPUT is A2K-FEC-MDA-001                                     **005300      
003538** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
003539                                                                  005500      
003540 A2K-CONV-MDA-TO-MDCA.                                            005600      
003541     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
003542     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
003543     IF A2K-FEC-MDA-001 = 0                                       005820      
003544        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
003545     ELSE                                                         005845      
003546      IF A2K-FEC-MDA-001 = 999999                                 005850      
003547         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
003548     ELSE                                                         005860      
003549     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
003550             A2K-OBTAIN-CENTURY-EXIT                              006000      
003551     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
003552     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
003553     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
003554     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
003555                                                                  006500      
003556 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
003557     EXIT.                                                        006700      
003558                                                                  006800      
003559***************************************************************** 006900      
003560**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
003561**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
003562**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
003563**baseyear to add century to the year.                         ** 007300      
003564**INPUT is A2K-FEC-DMA-001                                     ** 007400      
003565**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
003566                                                                  007600      
003567 A2K-CONV-DMA-TO-DMCA.                                            007700      
003568       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
003569       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
003570       IF  A2K-FEC-DMA-001   = 0                                  007920      
003571          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
003572       ELSE                                                       007945      
003573        IF A2K-FEC-DMA-001 = 999999                               007950      
003574          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
003575       ELSE                                                       007960      
003576       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
003577               A2K-OBTAIN-CENTURY-EXIT                            008100      
003578       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
003579       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
003580       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
003581       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
003582                                                                  008600      
003583 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
003584       EXIT.                                                      008800      
003585                                                                  008900      
003586***************************************************************** 009000      
003587** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
003588** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
003589** a 6 digit format as AAMMDD.                                 ** 009300      
003590** It simply removes the century information in the output     ** 009400      
003591** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
003592** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
003593                                                                  009700      
003594 A2K-CONV-CAMD-TO-AMD.                                            009800      
003595     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
003596     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
003597     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
003598     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
003599                                                                  010300      
003600 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
003601      EXIT.                                                       010500      
003602                                                                  010600      
003603******************************************************************010700      
003604******************************************************************010800      
003605** A2K-CONV-MDCA-TO-MDA.                                        **010900      
003606** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
003607** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
003608** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
003609** INPUT is A2K-FEC-MDCA-001                                    **011300      
003610** OUTPUT is A2K-FEC-MDA-001                                    **011400      
003611                                                                  011500      
003612 A2K-CONV-MDCA-TO-MDA.                                            011600      
003613     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
003614     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
003615     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
003616     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
003617                                                                  012100      
003618 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
003619      EXIT.                                                       012300      
003620                                                                  012400      
003621******************************************************************012500      
003622***************************************************************** 012600      
003623** A2K-CONV-DMCA-TO-DMA.                                        **012700      
003624** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
003625** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
003626** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
003627** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
003628** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
003629                                                                  013300      
003630 A2K-CONV-DMCA-TO-DMA.                                            013400      
003631     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
003632     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
003633     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
003634     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
003635                                                                  013900      
003636 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
003637      EXIT.                                                       014100      
003638                                                                  014200      
003639***************************************************************** 014300      
003640 A2K-CONV-MDCA-TO-CAMD.                                           014400      
003641      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
003642      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
003643      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
003644      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
003645      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
003646 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
003647      EXIT.                                                       015100      
003648***************************************************************** 015200      
003649** This paragraph adds century to an year field which is 9(02) ** 015300      
003650** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
003651** Output is A2K-FEC-CCAA-001.                                 ** 015600      
003652***************************************************************** 015700      
003653 A2K-CONV-AA-TO-CCAA.                                             015800      
003654      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
003655      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
003656              A2K-OBTAIN-CENTURY-EXIT.                            016100      
003657      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
003658 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
003659      EXIT.                                                       016400      
003660***************************************************************** 016500      
003661** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
003662** format.                                                     ** 016700      
003663** Input is A2K-FEC-DMCA-001.                                  ** 016800      
003664** Output is A2K-FEC-CAMD-001.                                 ** 016900      
003665***************************************************************** 017000      
003666 A2K-CONV-DMCA-TO-CAMD.                                           017100      
003667      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
003668      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
003669      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
003670      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
003671      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
003672 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
003673      EXIT.                                                       017800      
003674***************************************************************** 017900      
003675** This paragraph desides the Century to be added depending    ** 018000      
003676** on the base year.                                           ** 018100      
003677** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
003678** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
003679***************************************************************** 018400      
003680 A2K-OBTAIN-CENTURY.                                              018500      
003681      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
003682          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
003683      ELSE                                                        018800      
003684          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
003685 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
003686      EXIT.                                                       019100      
003687                                                                  019200      
003688***************************************************************** 019300      
003689** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
003690**  Format                                                     ** 019500      
003691** Input Is A2K-FEC-CAMD-001                                   ** 019600      
003692** Output Is A2K-FEC-DMCA-001                                  ** 019700      
003693***************************************************************** 019800      
003694 A2K-CONV-CAMD-TO-DMCA.                                           019900      
003695      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
003696      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
003697      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
003698      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
003699      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
003700                                                                  020500      
003701 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
003702      EXIT.                                                       020700      
003703                                                                  020800      
003704******************************************************************020900      
003705******************************************************************021000      
003706 A2K-CONV-AM-TO-CAM.                                              021100      
003707      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
003708      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
003709      IF A2K-FEC-AM-001 = 0                                       021220      
003710         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
003711      ELSE                                                        021245      
003712      IF A2K-FEC-AM-001 = 9999                                    021250      
003713         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
003714      ELSE                                                        021260      
003715      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
003716      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
003717      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
003718              A2K-OBTAIN-CENTURY-EXIT                             021600      
003719      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
003720                                                                  021800      
003721 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
003722      EXIT.                                                       022000      
003723                                                                  022100      
003724******************************************************************022200      
003725******************************************************************022300      
003726 A2K-CONV-CAM-TO-AM.                                              022400      
003727      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
003728      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
003729      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
003730                                                                  022800      
003731 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
003732   EXIT.                                                          023000      
003733                                                                  023100      
003734                                                                  023200      
003735                                                                  023500      
003736*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003737 A2K-CPY-EXIT-PARA.                                               190500      
003738   EXIT.                                                          190600      
003739                                                                  190610      
003740*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003741* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP001 ON CMEMP."         190620      
003742*                                      FROM 100000 TO 999999.     190630      
003743                                                                  100000      
003744*----------------------------------------------------------------*100100      
003745*   PROCEDIMIENTO DE CALCULO DINAMICO DE ESPACIO PARA EL SORT    *100200      
003746*----------------------------------------------------------------*100300      
003747 70000-CALCULA-ESPACIO.                                           100400      
003748*======================                                           100500      
003749     IF W77-FRAMESIZE             =   8                           100600      
003750        COMPUTE WS-CALC-WORD      =   W77-MAXRECSIZE              100700      
003751                                  /   6                           100800      
003752        IF WS-WORD-RES            >   ZEROS                       100900      
003753           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                 101000      
003754                                  +   1                           101100      
003755        ELSE                                                      101200      
003756           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                .101300      
003757                                                                  101400      
003758     COMPUTE W77-MEMORY-SIZE ROUNDED                              101500      
003759                                  =   (W77-MAXRECSIZE + 3)        101600      
003760                                  *   2000                        101700      
003761                                  +   1500                        101800      
003762                                                                  101900      
003763     COMPUTE W77-DISK-SIZE ROUNDED                                102000      
003764                                  =   W77-MAXRECSIZE              102100      
003765                                  *   W77-LASTRECORD              102200      
003766                                  *   3.5                        .102300      
003767                                                                  102400      
003768*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003769                                                                  191000      
003770 12610-CARGA-CLIENTES.                                            192000      
003771*=======================                                          193000      
003772     ADD 1                         TO W77-TOTAL-CL                194000      
003773                                      W77-IND.                    194500      
003774     MOVE S080-CPPS-DATOS(1)       TO WKS-TAB-CLIENTE(W77-IND)    195000      
003775                                      S080-CPPE-LLAVE1.           196000      
003776     MOVE S080-CPPS-DATOS(2)       TO WKS-TAB-INBU(W77-IND).      197000      
003777     MOVE S080-CPPS-DATOS(2)       TO S080-CPPE-LLAVE2.           198000      
003778     MOVE S080-CPPS-DATOS(3)       TO WKS-TAB-UNIN(W77-IND).      199000      
003779     MOVE S080-CPPS-FECHA-VIG       TO S080-CPPE-FECHA-VIG .      200000      
003780     MOVE S080-CPPS-FECHA-CONS      TO S080-CPPE-FECHA-CONS.      201000      
003781     MOVE S080-CPPS-NIVEL-INI       TO S080-CPPE-NIVEL-INI .      202000      
003782     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    203000      
003783           USING  S080-CP-SISTEMA                                 204000      
003784                  S080-CP-PROGRAMA                                205000      
003785                  S080-CP-PARAMETRO-ENT                           206000      
003786                  S080-CP-PARAMETRO-SAL                           207000      
003787           GIVING S080-CP-RESULT.                                 208000      
003788     IF S080-CP-RESULT = 0 OR = 1                                 209000      
003789        NEXT SENTENCE                                             210000      
003790     ELSE                                                         211000      
003791        MOVE 1                      TO W77-EOF.                   212000      
003792                                                                  213000      
003793 21016-BUSCA-CLIENTE.                                             214000      
003794*===================                                              215000      
003795     IF WKS-TAB-CLIENTE(W77-BUSCA) = A00-R01-CLIENTE              216000      
003796        MOVE 5001                       TO W77-SALIDA             217000      
003797        MOVE WKS-TAB-INBU(W77-BUSCA)    TO WKS-CLAVE-CIA.         218000      
003798                                                                  219000      
