000001$SET LIST ERRORLIMIT = 5000 XREF LINEINFO                         000100      
000002*INICIA CODIGO DE RENOVACION CRONOS 2000                          000200      
000003$SET LISTOMITTED                                                  000300      
000004$SET OLDCODE                                                      000400      
000005*TERMINA CODIGO DE RENOVACION CRONOS 2000                         000500      
000006*$SET TADS                                                        000600      
000007 IDENTIFICATION DIVISION.                                         000700      
000008 AUTHOR. ING FRANCISCO JAVIER HERNANDEZ GONZALEZ.                 000800      
000009******************************************************************000900      
000010*  FUNCIONES: GENERAR UN ARCHIVO CON SALDOS DE CONTRATOS         *001000      
000011*  DEL SISTEMA S500, POR PRODUCTO 001 (CHEQUES) Y 066 (CUENTA    *001100      
000012*  MAESTRA .                                                     *001200      
000013*                                                                *001300      
000014*     ENTRADAS.-                                                  001400      
000015*       1.-   ARCHIVO SDOS DEL SISTEMA S151 CON REGISTROS DE     *001500      
000016*             DE SALDOS DE CHEQUES Y CTA. MAE.                   *001600      
000017*                                                                *001700      
000018*     SALIDAS.-                                                  *001800      
000019*       1.-   ARCHIVOS SDO0001 Y SD00066 (CHEQUES Y CTA. MAESTRA)*001900      
000020*             PARA EL SISTEMA S050 (ESTADOS DE CUENTA)           *002000      
000021*             PARA GENERACION DE ESTADO DE CUENTA.               *002100      
000022*       2.-   ARCHIVO DE SALDOS PARA CITI (ACC CBII).            *002200      
000023*                                                                *002300      
000024******************************************************************002400      
000025 ENVIRONMENT DIVISION.                                            002500      
000026 INPUT-OUTPUT SECTION.                                            002600      
000027 FILE-CONTROL.                                                    002700      
000028      SELECT A01-SDOENT     ASSIGN TO DISK.                       002800      
000029      SELECT A02-SDOSAL1    ASSIGN TO DISK.                       002900      
000030      SELECT A03-SDOSAL2    ASSIGN TO DISK.                       003000      
000031      SELECT A04-SDOSCBII-T ASSIGN TO DISK.                       003100      
000032      SELECT A05-SDOSCBII   ASSIGN TO DISK.                       003200      
000033      SELECT A06-MONITOR    ASSIGN TO DISK.                       003300      
000034      SELECT R01-CIFRAS     ASSIGN TO PRINTER.                    003400      
000035      SELECT V00-REPORTE2   ASSIGN TO PRINTER.                    003500      
000036*                                                                 003600      
000037/                                                                 003700      
000038 DATA DIVISION.                                                   003800      
000039 FILE SECTION.                                                    003900      
000040 FD  A01-SDOENT                                                   004000      
000041     BLOCK CONTAINS 168 RECORDS                                   004100      
000042     VALUE OF TITLE        IS WKS-TIT-SDOENT.                     004200      
000043                                                                  004300      
000044 01  R01-SDOENT                   PIC X(390).                     004400      
000045                                                                  004500      
000046 FD  A02-SDOSAL1                                                  004600      
000047     BLOCK CONTAINS 171 RECORDS                                   004700      
000048     VALUE OF TITLE        IS WKS-TIT-SDOSAL                      004800      
000049              AREAS        IS 1000                                004900      
000050              AREASIZE     IS 6000                                005000      
000051              SECURITYTYPE IS PUBLIC.                             005100      
000052                                                                  005200      
000053 01  R02-SDOSAL1                  PIC X(380).                     005300      
000054                                                                  005400      
000055 FD  A03-SDOSAL2                                                  005500      
000056     BLOCK CONTAINS 171 RECORDS                                   005600      
000057     VALUE OF TITLE        IS WKS-TIT-SDOSAL                      005700      
000058              AREAS        IS 1000                                005800      
000059              AREASIZE     IS 6000                                005900      
000060              SECURITYTYPE IS PUBLIC.                             006000      
000061                                                                  006100      
000062 01  R03-SDOSAL2                  PIC X(380).                     006200      
000063                                                                  006300      
000064 FD  A04-SDOSCBII-T                                               006400      
000065     VALUE OF TITLE        IS WKS-TIT-SDOSCBII-T                  006500      
000066              AREAS        IS 1000                                006600      
000067              AREASIZE     IS 6000                                006700      
000068              SECURITYTYPE IS PUBLIC.                             006800      
000069                                                                  006900      
000070 01  R04-SDOSCBII-T.                                              007000      
000071  02 ACCI-INT-REC-T.                                              007100      
000072      05 ACCI-RECORD-TYPE-T          PIC  X(03).                  007200      
000073      05 ACCI-KEY-GRP-T.                                          007300      
000074         10 ACCI-BRCH-NBR-T          PIC 9(03).                   007400      
000075         10 ACCI-GEN-CUST-T          PIC 9(11).                   007500      
000076         10 ACCI-CCY-CODE-T          PIC 9(03).                   007600      
000077         10 ACCI-ACCT-NBR-T          PIC 9(11).                   007700      
000078         10 ACCI-LIA-NBR-T           PIC 9(11).                   007800      
000079      05 ACCI-SWIFT-CCY-CODE-T       PIC X(04).                   007900      
000080      05 ACCI-SHORT-NAME-TEXT-T      PIC X(32).                   008000      
000081      05 ACCI-ACCT-STAT-IND-T        PIC X(01).                   008100      
000082      05 ACCI-CAT-CODE-T             PIC 9(07).                   008200      
000083      05 ACCI-LAST-TXN-DATE-T        PIC 9(07).                   008300      
000084      05 ACCI-ACCT-BAL-AMT-T         PIC 9(15)V99.                008400      
000085      05 ACCI-ACCT-BAL-AMT-SIGN-T    PIC X(01).                   008500      
000086      05 ACCI-LCY-ACCT-BAL-AMT-T     PIC 9(15)V99.                008600      
000087      05 ACCI-LCY-BAL-AMT-SIGN-T     PIC X(01).                   008700      
000088      05 ACCI-DISP-VAL-BAL-AMT-T     PIC 9(15)V99.                008800      
000089      05 ACCI-DISP-BAL-AMT-SIGN-T    PIC X(01).                   008900      
000090      05 ACCI-BANK-NON-BANK-T        PIC X(03).                   009000      
000091      05 ACCI-MAIL-T                 PIC X(04).                   009100      
000092      05 ACCI-MAIL-TO-COLLECT-T      PIC X(01).                   009200      
000093      05 ACCI-MAIL-RULEOFF-T         PIC X(02).                   009300      
000094      05 ACCI-LANGUAGE-CODE-T        PIC 9(02).                   009400      
000095      05 ACCI-FILLER-T               PIC X(25).                   009500      
000096      05 ACCI-CUSTOMER-NAME-T        PIC X(35).                   009600      
000097      05 ACCI-CBR-ADDRESS-1-T        PIC X(35).                   009700      
000098      05 ACCI-CBR-ADDRESS-2-T        PIC X(35).                   009800      
000099      05 ACCI-CBR-ADDRESS-3-T        PIC X(35).                   009900      
000100      05 ACCI-CBR-ADDRESS-4-T        PIC X(35).                   010000      
000101      05 ACCI-PRIME-DELIMETER-T      PIC X(01).                   010100      
000102  02 ACCI-RESTO-REG-T.                                            010200      
000103      05 ACCI-CONTRATO-T             PIC 9(16).                   010300      
000104      05 FILLER                      PIC X(02).                   010400      
000105                                                                  010500      
000106 FD  A05-SDOSCBII                                                 010600      
000107     BLOCK CONTAINS 5 RECORDS                                     010700      
000108     VALUE OF TITLE        IS WKS-TIT-SDOSCBII                    010800      
000109              AREAS        IS 1000                                010900      
000110              AREASIZE     IS 6000                                011000      
000111              SECURITYTYPE IS PUBLIC.                             011100      
000112                                                                  011200      
000113 01  R05-SDOSCBII              PIC X(360).                        011300      
000114                                                                  011400      
000115 FD  R01-CIFRAS                                                   011500      
000116     VALUE OF TITLE        IS WKS-TIT-CIFRAS.                     011600      
000117                                                                  011700      
000118 01  R01-REG-CIFRAS            PIC X(132).                        011800      
000119                                                                  011900      
000120 FD  V00-REPORTE2                                                 012000      
000121     VALUE OF TITLE        IS WKS-TIT-REPORTE2.                   012100      
000122                                                                  012200      
000123 01  V00-R00-REPORTE2              PIC X(132).                    012300      
000124                                                                  012400      
000125 FD  A06-MONITOR                                                  012500      
000126     BLOCK CONTAINS 5 RECORDS                                     012600      
000127     VALUE OF TITLE        IS WKS-TIT-MONITOR                     012700      
000128              SECURITYTYPE IS PUBLIC.                             012800      
000129                                                                  012900      
000130 01  R06-MONITOR               PIC X(108).                        013000      
000131                                                                  013100      
000132                                                                  013200      
000133/                                                                 013300      
000134 WORKING-STORAGE SECTION.                                         013400      
000135*INICIA CODIGO DE RENOVACION CRONOS 2000                          013500      
000136*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000137*     COPY "S151/CRONOS2K/CPY/WS".                                013600      
000138******************************************************************000100      
000139** This copyBook defines all the additional variables that      **000200      
000140** Unisys has defined for the CRONOS2K project                  **000300      
000141** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000142******************************************************************000500      
000143                                                                  000600      
000144******************************************************************000700      
000145** These Variables are used to Accept the system date in long   **000800      
000146** format and get the century information                       **000900      
000147** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000148 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000149 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000150    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000151    05 FILLER      PIC X(1).                                      001400      
000152    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000153    05 FILLER      PIC X(1).                                      001600      
000154    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000155    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000156      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000157      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000158******************************************************************002100      
000159                                                                  002200      
000160******************************************************************002300      
000161** This variable defines a date in the format MMDDCCAA          **002400      
000162**                                                              **002500      
000163 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000164 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000165    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000166    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000167    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000168    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000169      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000170      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000171******************************************************************003400      
000172                                                                  003500      
000173******************************************************************003600      
000174** This variable defines a date in the format CCAAMMDD          **003700      
000175**                                                              **003800      
000176 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000177 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000178    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000179    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000180      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000181      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000182    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000183    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000184******************************************************************004700      
000185                                                                  004800      
000186******************************************************************004900      
000187** This variable defines a date in the format DDMMCCAA          **005000      
000188**                                                              **005100      
000189 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000190 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000191    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000192    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000193    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000194    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000195      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000196      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000197******************************************************************006000      
000198                                                                  006100      
000199******************************************************************006200      
000200** This variable defines a date in the Julian Format CCAADDD    **006300      
000201**                                                              **006400      
000202 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000203 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000204    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000205    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000206                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000207      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000208      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000209    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000210******************************************************************007300      
000211                                                                  007400      
000212******************************************************************007500      
000213** This variable defines a date in the format AAMMDD            **007600      
000214**                                                              **007700      
000215 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000216 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000217    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000218    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000219    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000220******************************************************************008300      
000221                                                                  008400      
000222******************************************************************008500      
000223** This variable defines a date in the format MMDDAA            **008600      
000224**                                                              **008700      
000225 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000226 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000227    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000228    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000229    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000230******************************************************************009300      
000231                                                                  009400      
000232******************************************************************009500      
000233** This variable defines a date in the format DDMMAA            **009600      
000234**                                                              **009700      
000235 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000236 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000237    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000238    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000239    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000240******************************************************************010300      
000241                                                                  010400      
000242******************************************************************010500      
000243** These variables are defined to be used for CALL bridge logic **010600      
000244**                                                              **010700      
000245 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000246 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000247 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000248 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000249 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000250 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000251******************************************************************011400      
000252                                                                  011500      
000253******************************************************************011600      
000254** This variable is used for converting only a year field AA to **011700      
000255** CCAA and a CCAA to AA                                        **011800      
000256 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000257 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000258    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000259    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000260 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000261 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000262******************************************************************012300      
000263                                                                  012400      
000264******************************************************************012500      
000265** These variables are Bridge Variables for Intercambio files   **012600      
000266** para EDOCTA                                                  **012700      
000267 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000268 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000269 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000270 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000271 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000272 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000273 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000274******************************************************************013500      
000275* Para MODULO                                                     013600      
000276 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000277******************************************************************013800      
000278******************************************************************013900      
000279** Para FMOVSCHABO                                                014000      
000280 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000281******************************************************************014200      
000282                                                                  014300      
000283******************************************************************014400      
000284***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000285******************************************************************014600      
000286                                                                  014700      
000287 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000288 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000289     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000290     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000291     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000292******************************************************************015300      
000293                                                                  015400      
000294******************************************************************015500      
000295***  These Variables Are Defined For Date In AAMM Format       ***015600      
000296******************************************************************015700      
000297                                                                  015800      
000298 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000299 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000300     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000301     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000302******************************************************************016300      
000303                                                                  016400      
000304                                                                  016500      
000305*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000306 01  A2K-BASE-YEAR     PIC 9(02) VALUE   50.                      013700      
000307*TERMINA CODIGO DE RENOVACION CRONOS 2000                         013800      
000308                                                                  013900      
000309******************************************************************014000      
000310*            NOMBRE EXTERNO DEL ARCHIVO SDOS DEL S151            *014100      
000311******************************************************************014200      
000312                                                                  014300      
000313 01  WKS-TIT-SDOENT.                                              014400      
000314     02  WKS-NOM-SDOENT                PIC X(34).                 014500      
000315     02  WKS-FEC-SDOENT                PIC 9(06).                 014600      
000316     02  FILLER                        PIC X(04) VALUE            014700      
000317                                       " ON ".                    014800      
000318     02  WKS-PK-SDOENT                 PIC X(17).                 014900      
000319     02  FILLER                        PIC X(01) VALUE ".".       015000      
000320                                                                  015100      
000321******************************************************************015200      
000322*               NOMBRE EXTERNO DE ARCHIVO SDOYYYY                *015300      
000323******************************************************************015400      
000324 01  WKS-TIT-SDOSAL.                                              015500      
000325     02  FILLER                        PIC X(15) VALUE            015600      
000326                                      "S500/FILE/S050/".          015700      
000327     02  WKS-CSI-ORIG                  PIC 9(02).                 015800      
000328     02  FILLER                        PIC X(01) VALUE            015900      
000329                                      "/".                        016000      
000330     02  WKS-CSI-DEST                  PIC 9(02).                 016100      
000331     02  FILLER                        PIC X(04) VALUE            016200      
000332                                      "/SDO".                     016300      
000333     02  WKS-SIS-SDOSAL                PIC 9(04).                 016400      
000334     02  FILLER                        PIC X(01) VALUE "/".       016500      
000335     02  WKS-FEC-SDOSAL                PIC 9(06) VALUE 0.         016600      
000336     02  FILLER                        PIC X(01) VALUE ".".       016700      
000337*                                                                 016800      
000338******************************************************************016900      
000339*           NOMBRE EXTERNO DE ARCHIVO SDOSCBII ACC               *017000      
000340******************************************************************017100      
000341 01  WKS-TIT-SDOSCBII.                                            017200      
000342     02  FILLER                        PIC X(28) VALUE            017300      
000343                               "(S151)S151/FILE/E01/S500ACC/".    017400      
000344     02  WKS-CSI-ORIGCBII              PIC 9(02).                 017500      
000345     02  FILLER                        PIC X(04) VALUE            017600      
000346                                      "/10/".                     017700      
000347     02  WKS-FEC-SDOSALCBII            PIC 9(06) VALUE 0.         017800      
000348     02  FILLER                        PIC X(10) VALUE            017900      
000349                                      " ON CMEMP.".               018000      
000350*                                                                 018100      
000351 01  WKS-TIT-SDOSCBII-T.                                          018200      
000352     02  FILLER                        PIC X(29) VALUE            018300      
000353                               "(S151)S151/FILE/E01/S500ACCT/".   018400      
000354     02  WKS-CSI-ORIGCBII-T            PIC 9(02).                 018500      
000355     02  FILLER                        PIC X(04) VALUE            018600      
000356                                      "/10/".                     018700      
000357     02  WKS-FEC-SDOSALCBII-T          PIC 9(06) VALUE 0.         018800      
000358     02  FILLER                        PIC X(10) VALUE            018900      
000359                                      " ON CMEMP.".               019000      
000360******************************************************************019100      
000361*           NOMBRE EXTERNO ARCHIVO MONITOR                       *019200      
000362******************************************************************019300      
000363 01  WKS-TIT-MONITOR.                                             019400      
000364     02  FILLER                        PIC X(27) VALUE            019500      
000365                             "(S151)S151/FILE/ACCMONITOR/".       019600      
000366     02  WKS-CSI-MONITOR               PIC 9(02).                 019700      
000367     02  FILLER                        PIC X(01) VALUE "/".       019800      
000368     02  WKS-FEC-MONITOR               PIC 9(06) VALUE 0.         019900      
000369     02  FILLER                        PIC X(10) VALUE            020000      
000370                                      " ON CMEMP.".               020100      
000371 01 WKS-HD-MONITOR.                                               020200      
000372    03 FILLER                          PIC X(04) VALUE "S500".    020300      
000373    03 WKS-HD-FEC-MON                  PIC 9(08).                 020400      
000374    03 FILLER                          PIC X(96).                 020500      
000375                                                                  020600      
000376 01 WKS-REG-MONITOR.                                              020700      
000377    03 WKS-CTO-MON                     PIC 9(16).                 020800      
000378    03 WKS-BASENUM-MON                 PIC 9(11).                 020850      
000379    03 WKS-SIG-SDOACT                  PIC X.                     020870      
000380    03 WKS-SDO-ACT-MON                 PIC 9(14)V99.              020900      
000381    03 WKS-SIG-SDODIS                  PIC X.                     020950      
000382    03 WKS-SDO-DIS-MON                 PIC 9(14)V99.              021000      
000383    03 WKS-SIG-LIN                     PIC X.                     021050      
000384    03 WKS-SDO-LIN-MON                 PIC 9(14)V99.              021100      
000385    03 WKS-SIG-SDOACTCAL               PIC X.                     021150      
000386    03 WKS-SDO-ACTCALC-MON             PIC 9(14)V99.              021200      
000387    03 WKS-SDO-FECHA-MON               PIC 9(08).                 021300      
000388    03 WKS-SDO-RESULT-MON              PIC 9(02).                 021400      
000389    03 FILLER                          PIC X(03).                 021500      
000390                                                                  021600      
000391******************************************************************021700      
000392*             NOMBRE EXTERNO DEL REPORTE DE CIFRAS               *021800      
000393******************************************************************021900      
000394                                                                  022000      
000395 01  WKS-TIT-CIFRAS.                                              022100      
000396     02  FILLER                        PIC X(01) VALUE "S".       022200      
000397     02  WLI-SIST-CIFRAS               PIC 9(03) VALUE 0.         022300      
000398     02  FILLER                        PIC X(11) VALUE            022400      
000399                                      "/LIST/P167/".              022500      
000400     02  WLI-CSI-CIFRAS                PIC 9(02).                 022600      
000401     02  FILLER                        PIC X(05) VALUE            022700      
000402                                      "00/C0".                    022800      
000403     02  WLI-SECUENCIA                 PIC 9(02).                 022820      
000404     02  FILLER                        PIC X(01) VALUE "/".       022840      
000405     02  WLI-FECHA-CIFRAS              PIC 9(06) VALUE 0.         022900      
000406     02  FILLER                        PIC X(01) VALUE "/".       023000      
000407     02  WLI-NUMMIX-CIFRAS             PIC 9(07).                 023100      
000408     02  FILLER                        PIC X(16) VALUE            023200      
000409                                       "/001S151TOTSDOS.".        023300      
000410                                                                  023400      
000411 01  WLI-ENCABEZADO-1.                                            023500      
000412     02  FILLER                        PIC X(24) VALUE            023600      
000413                                    "S151-P167-001S151TOTSDOS".   023700      
000414     02  FILLER                        PIC X(15) VALUE SPACES.    023800      
000415     02  FILLER                        PIC X(55) VALUE            023900      
000416      "B A N C O   N A C I O N A L   D E   M E X I C O   S. A.".  024000      
000417     02  FILLER                        PIC X(23) VALUE SPACES.    024100      
000418     02  FILLER                        PIC X(15) VALUE            024200      
000419                                    "HOJA :      001".            024300      
000420                                                                  024400      
000421 01  WLI-ENCABEZADO-2.                                            024500      
000422     02  FILLER                        PIC X(20) VALUE SPACES.    024600      
000423     02 FILLER                         PIC X(28) VALUE SPACES.    024700      
000424     02  FILLER                        PIC X(37) VALUE            024800      
000425         "ADMINISTRADOR DE SALDOS Y MOVIMIENTOS".                 024900      
000426     02  FILLER                        PIC X(19) VALUE SPACES.    025000      
000427     02  FILLER                        PIC X(18) VALUE            025100      
000428                                    "FECHA EJECUCION : ".         025200      
000429     02  WLI-FECEJEC-ENC               PIC 99/99/9999.            025300      
000430                                                                  025400      
000431 01  WLI-ENCABEZADO-3.                                            025500      
000432     02  FILLER                        PIC X(16) VALUE            025600      
000433                                    "FECHA PROCESO : ".           025700      
000434     02  WLI-FECPROC-ENC               PIC 99/99/9999.            025800      
000435     02  FILLER               PIC X(16) VALUE SPACES.             025900      
000436     02  FILLER                        PIC X(47) VALUE            026000      
000437         "REPORTE DE SALDOS POR CONTRATO ENVIADOS AL S050".       026100      
000438     02  FILLER                        PIC X(17) VALUE SPACES.    026200      
000439     02  FILLER                        PIC X(18) VALUE            026300      
000440                                    "HORA  EJECUCION : ".         026400      
000441     02  WLI-HHEJEC-ENC                PIC 99.                    026500      
000442     02  WLI-MMEJEC-ENC                PIC 99.                    026520      
000443     02  WLI-SSEJEC-ENC                PIC 99.                    026540      
000444                                                                  026600      
000445 01  WKS-DETALLE-1.                                               026700      
000446     02  FILLER                        PIC X(29) VALUE SPACES.    026800      
000447     02  FILLER                        PIC X(33) VALUE            026900      
000448         "TOTAL DE CONTRATOS ENVIADOS DEL S".                     027000      
000449     02  WKS-SIST-DET                  PIC 9(03).                 027100      
000450     02  FILLER                        PIC X(05) VALUE SPACES.    027200      
000451     02  WKS-NUM-DET                   PIC ZZ,ZZZ,ZZ9.            027300      
000452     02  FILLER                        PIC X(02) VALUE SPACES.    027400      
000453     02  WKS-IMP-DET                   PIC ZZZZZZ,ZZZ,ZZZ,ZZ9.99. 027500      
000454     02  FILLER                        PIC X(29) VALUE SPACES.    027600      
000455                                                                  027700      
000456******************************************************************027800      
000457*         P A R A M E T R O S    E S T R U C T U R A             *027900      
000458******************************************************************028000      
000459                                                                  028100      
000460 01  WKS-CODIGO                        PIC 9(6).                  028200      
000461 01  WKS-COD                 REDEFINES WKS-CODIGO.                028300      
000462     03  WKS-LLAVE-EST                 PIC 9(4).                  028400      
000463     03  WKS-CLAVE-EST                 PIC 9(2).                  028500      
000464 01  WKS-RESPUESTA                     PIC X(210).                028600      
000465 01  WKS-RESP                REDEFINES WKS-RESPUESTA.             028700      
000466     03  WKS-RESULT                    PIC 9.                     028800      
000467     03  WKS-SUC-NOMBRE                PIC X(40).                 028900      
000468     03  FILLER                        PIC X(169).                029000      
000469 01  WKS-RESP1               REDEFINES WKS-RESPUESTA.             029100      
000470     03  WKS-RESULT1                   PIC 9(01).                 029200      
000471     03  FILLER                        PIC 9(10).                 029300      
000472     03  WKS-NOD-SUBNOD                PIC 9(04).                 029400      
000473     03  WKS-NOD-SUBNOD-R REDEFINES WKS-NOD-SUBNOD.               029500      
000474         05  WKS-NODO                  PIC 9(02).                 029600      
000475         05  WKS-SUBNODO               PIC 9(02).                 029700      
000476     03  WKS-NODO-CIFRAS               PIC 9(02).                 029800      
000477     03  FILLER                        PIC X(193).                029900      
000478 01 WKS-RESP3                 REDEFINES WKS-RESPUESTA.            030000      
000479     03  WKS-RESULT3                   PIC 9(01).                 030100      
000480     03  WKS-EST-CSI                   PIC 9(02).                 030200      
000481     03  FILLER                        PIC X(207).                030300      
000482 01  WKS-RESP2                REDEFINES WKS-RESPUESTA.            030400      
000483     03  WKS-RESULT2                   PIC 9(01).                 030500      
000484     03  WKS-AREA                      PIC 9(04).                 030600      
000485     03  WKS-DIVISION                  PIC 9(04).                 030700      
000486     03  WKS-DIR-DIV                   PIC 9(04).                 030800      
000487     03  WKS-DIR-REG                   PIC 9(04).                 030900      
000488     03  WKS-GER-PLAZA                 PIC 9(04).                 031000      
000489     03  WKS-OPERACION                 PIC 9(04).                 031100      
000490     03  FILLER                        PIC X(185).                031200      
000491                                                                  031300      
000492******************************************************************031400      
000493*           DEFINICION DE REGISTRO DE ARCHIVO SDOENT.            *031500      
000494******************************************************************031600      
000495                                                                  031700      
000496*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000497*   COPY "(S151)S151/FORMATO/ARCHIVO/SALDOS2".                    031800      
000498******************************************************************000100      
000499*                                                                *000200      
000500*mgv FORMATO ARCHIVO DE SALDOS - fechas a 8 dig. para arch.entrada000300      
000501* copia modificando nombres A02 -> A22 para usar 2 copy juntos    000400      
000502******************************************************************000500      
000503                                                                  000600      
000504                                                                  000700      
000505                                                                  000800      
000506 01 A22-R00-SALDOS.                                               000900      
000507    02 A22-R00-TIPO-REG            PIC  9(02)       COMP.         001000      
000508*   02 A22-R00-FILGRAL             PIC  X(179).                   001100      
000509*INICIA CODIGO DE RENOVACION CRONOS 2000                          001101      
000510    02 A22-R00-FILGRAL             PIC  X(385).                   001102      
000511*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001103      
000512                                                                  001200      
000513    02 A22-R00-HEADER              REDEFINES A22-R00-FILGRAL.     001300      
000514       03 A22-R00-HDR-SISTEMA      PIC  9(04)       COMP.         001400      
000515       03 A22-R00-HDR-PRODUCTO     PIC  9(04)       COMP.         001500      
000516*      03 A22-R00-HDR-FECHA        PIC  9(06)       COMP.         001600      
000517*INICIA CODIGO DE RENOVACION CRONOS 2000                          001601      
000518       03 A22-R00-HDR-FECHA        PIC  9(08)       COMP.         001602      
000519*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001603      
000520*      03 FILLER                   PIC  X(172).                   001700      
000521*INICIA CODIGO DE RENOVACION CRONOS 2000                          001701      
000522       03 FILLER                   PIC  X(377).                   001702      
000523*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001703      
000524                                                                  001800      
000525    02 A22-R01-REG-SAL             REDEFINES A22-R00-FILGRAL.     001900      
000526       03 A22-R01-SIS              PIC  9(04)       COMP.         002000      
000527       03 A22-R01-PRD              PIC  9(04)       COMP.         002100      
000528       03 A22-R01-INS              PIC  9(04)       COMP.         002200      
000529       03 A22-R01-CTA              PIC  9(20)       COMP.         002300      
000530       03 A22-R01-CTA-R            REDEFINES A22-R01-CTA.         002400      
000531          05 A22-R01-SUCPRO        PIC  9(04)       COMP.         002500      
000532          05 A22-R01-CNT           PIC  9(16)       COMP.         002600      
000533       03 A22-R01-EDOCTA           PIC  9(02)       COMP.         002700      
000534*      03 A22-R01-FECPRO           PIC  9(06)       COMP.         002800      
000535*INICIA CODIGO DE RENOVACION CRONOS 2000                          002801      
000536       03 A22-R01-FECPRO           PIC  9(08)       COMP.         002802      
000537*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002803      
000538*      03 A22-R01-FECINI           PIC  9(06)       COMP.         002900      
000539*INICIA CODIGO DE RENOVACION CRONOS 2000                          002901      
000540       03 A22-R01-FECINI           PIC  9(08)       COMP.         002902      
000541*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002903      
000542*      03 A22-R01-FECFIN           PIC  9(06)       COMP.         003000      
000543*INICIA CODIGO DE RENOVACION CRONOS 2000                          003001      
000544       03 A22-R01-FECFIN           PIC  9(08)       COMP.         003002      
000545*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003003      
000546*      03 A22-R01-FECULTMOV        PIC  9(06)       COMP.         003100      
000547*INICIA CODIGO DE RENOVACION CRONOS 2000                          003101      
000548       03 A22-R01-FECULTMOV        PIC  9(08)       COMP.         003102      
000549*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003103      
000550       03 A22-R01-STATUS           PIC  9(02)       COMP.         003200      
000551       03 A22-R01-ELEM-IMP         OCCURS 30 TIMES.               003300      
000552          04 A22-R01-CVESDO        PIC  9(04)       COMP.         003400      
000553          04 A22-R01-IMPT          PIC S9(13)V99    COMP.         003500      
000554*      03 A22-R01-FILXAPL          PIC  X(19).                    003600      
000555*INICIA CODIGO DE RENOVACION CRONOS 2000                          003601      
000556       03 A22-R01-FILXAPL          PIC  X(51).                    003602      
000557*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003603      
000558                                                                  003700      
000559       03 A22-R01-S084             REDEFINES A22-R01-FILXAPL.     003800      
000560          04 A22-R01-TASNET        PIC  9(04)V9(04) COMP.         003900      
000561          04 A22-R01-TASBRU        PIC  9(04)V9(04) COMP.         004000      
000562          04 A22-R01-NETPER        PIC  9(04)V9(04) COMP.         004100      
000563          04 A22-R01-NETANU        PIC  9(04)V9(04) COMP.         004200      
000564          04 A22-R01-DIASPER       PIC  9(02)       COMP.         004300      
000565          04 A22-R01-DIASANU       PIC  9(02)       COMP.         004400      
000566          04 A22-R01-MONS084       PIC  9(02)       COMP.         004500      
000567*INICIA CODIGO DE RENOVACION CRONOS 2000                          004520      
000568          04 FILLER                PIC  X(32).                    004540      
000569*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004560      
000570                                                                  004600      
000571       03 A22-R01-S084AVB          REDEFINES A22-R01-FILXAPL.     004700      
000572          04 FILLER                PIC X(03).                     004800      
000573*         04 A22-R01-FECAPE        PIC  9(06)       COMP.         004900      
000574*INICIA CODIGO DE RENOVACION CRONOS 2000                          004901      
000575          04 A22-R01-FECAPE        PIC  9(08)       COMP.         004902      
000576*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004903      
000577*         04 A22-R01-FECSIGPAGO    PIC  9(06)       COMP.         005000      
000578*INICIA CODIGO DE RENOVACION CRONOS 2000                          005001      
000579          04 A22-R01-FECSIGPAGO    PIC  9(08)       COMP.         005002      
000580*TERMINA CODIGO DE RENOVACION CRONOS 2000                         005003      
000581          04 A22-R01-SORTEO        PIC  9(02)       COMP.         005100      
000582          04 A22-R01-RESTANTES     PIC  9(03)       COMP.         005200      
000583          04 A22-R01-ANTICIPADAS   PIC  9(03)       COMP.         005300      
000584          04 A22-R01-OPORTUNAS     PIC  9(02)       COMP.         005400      
000585          04 A22-R01-TOTALES       PIC  9(02)       COMP.         005500      
000586          04 A22-R01-ATRASOS       PIC  9(02)       COMP.         005600      
000587          04 A22-R01-BONOS         PIC  9(02)       COMP.         005700      
000588          04 A22-R01-ESQUEMA       PIC  9(02)       COMP.         005800      
000589          04 A22-R01-MOVEDAAVB     PIC  9(02)       COMP.         005900      
000590          04 FILLER                PIC  X(30).                    005950      
000591                                                                  006000      
000592       03 A22-R01-S087                REDEFINES A22-R01-FILXAPL.  006100      
000593          04 A22-R01-PLAZO            PIC  9(04)       COMP.      006200      
000594          04 A22-R01-TASS087          PIC  9(04)V9(04) COMP.      006300      
000595          04 A22-R01-INSTRUCCIONES    PIC  9(02)       COMP.      006400      
000596          04 A22-R01-TIPOPER          PIC  9(04)       COMP.      006500      
000597          04 A22-R01-MON              PIC  9(04)       COMP.      006600      
000598          04 A22-R01-FILS087          PIC  X(08).                 006700      
000599*INICIA CODIGO DE RENOVACION CRONOS 2000                          006701      
000600          04 FILLER                   PIC  X(32).                 006702      
000601*TERMINA CODIGO DE RENOVACION CRONOS 2000                         006703      
000602                                                                  006800      
000603       03 A22-R01-S500             REDEFINES A22-R01-FILXAPL.     006900      
000604          04 A22-R01-DIASCICLO     PIC  9(03)       COMP.         007000      
000605          04 A22-R01-DIASANO       PIC  9(03)       COMP.         007100      
000606          04 A22-R01-TASRENET      PIC  9(04)V9(04) COMP.         007200      
000607          04 A22-R01-TASREBRU      PIC  9(04)V9(04) COMP.         007300      
000608          04 A22-R01-TASREANO      PIC  9(04)V9(04) COMP.         007400      
000609          04 A22-R01-STATION       PIC  9(04)       COMP.         007500      
000610          04 A22-R01-CTACON        PIC  9(02)       COMP.         007600      
000611          04 A22-R01-MONEDA        PIC  9(02)       COMP.         007700      
000612          04 A22-R01-GENEDOCTA     PIC  9(01).                    007702      
000613          04 A22-R01-INDENVCTD     PIC  9(02)       COMP.         007706      
000614          04 A22-R01-INDENVCTD-R REDEFINES A22-R01-INDENVCTD.     007716      
000615*INI - ISOLATION                                                  007721      
000616             05 A22-R01-INDENVBNE  PIC 9(01)        COMP.         007726      
000617             05 A22-R01-INDENVCD   PIC 9(01)        COMP.         007736      
000618*INI - ISOLATION                                                  007741      
000619          04 A22-R01-P-CTO-ORI     PIC  9(04)       COMP.         007746      
000620          04 A22-R01-I-CTO-ORI     PIC  9(04)       COMP.         007756      
000621          04 A22-R01-M-CTO-ORI     PIC  9(02)       COMP.         007766      
000622          04 A22-R01-C-TAR-ORI     PIC  9(16)       COMP.         007776      
000623          04 A22-R01-FILS500       PIC  X(17).                    007786      
000624                                                                  007800      
000625       03 A22-R01-S408             REDEFINES A22-R01-FILXAPL.     007900      
000626*         04 A22-R01-FECVEN        PIC  9(06)       COMP.         008000      
000627*INICIA CODIGO DE RENOVACION CRONOS 2000                          008001      
000628          04 A22-R01-FECVEN        PIC  9(08)       COMP.         008002      
000629*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008003      
000630          04 A22-R01-TASINT        PIC  9(04)V9(04) COMP.         008100      
000631          04 A22-R01-DIASBG        PIC  9(04)       COMP.         008200      
000632          04 A22-R01-LINEA         PIC  9(04)       COMP.         008300      
000633          04 A22-R01-FOLIO         PIC  9(04)       COMP.         008400      
000634          04 A22-R01-FILS408       PIC  X(06).                    008500      
000635*INICIA CODIGO DE RENOVACION CRONOS 2000                          008501      
000636          04 FILLER                PIC  X(31).                    008502      
000637*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008503      
000638                                                                  008600      
000639    02 A22-R00-TRA-SAL             REDEFINES A22-R00-FILGRAL.     008700      
000640       03 A22-R02-TRA-TOTREG       PIC  9(08)       COMP.         008800      
000641       03 A22-R02-TRA-TOTCON       PIC  9(08)       COMP.         008900      
000642       03 A22-R02-TRA-IMPT         PIC S9(15)V99    COMP.         009000      
000643*      03 FILLER                   PIC  X(162).                   009100      
000644*INICIA CODIGO DE RENOVACION CRONOS 2000                          009101      
000645       03 FILLER                   PIC  X(368).                   009102      
000646*TERMINA CODIGO DE RENOVACION CRONOS 2000                         009103      
000647                                                                  009200      
000648                                                                  009300      
000649*=================================================================009400      
000650*====             DESCRIPCION DE CAMPOS                        ===009500      
000651*=================================================================009600      
000652                                                                  009700      
000653*=A22-R00-TIPO-REG     : 00 = HEADER                              009800      
000654*                        80 = INICIO                              009900      
000655*                        81 = REGISTRO DE SALDOS                  010000      
000656*                        82 = FIN                                 010100      
000657*                        99 = TRAILER                             010200      
000658                                                                  010300      
000659*=================================================================010400      
000660*===                REGISTRO HEADER                            ===010500      
000661*=================================================================010600      
000662                                                                  010700      
000663*=A22-R00-HDR-SISTEMA  : NUMERO DE SISTEMA EJ. 0500               010800      
000664*=A22-R00-HDR-PRODUCTO : NUMERO DE PRODUCTO EJ. 0066              010900      
000665*=A22-R00-HDR-FECHA    : FECHA CONTABLE DE LA APLICACION ORIGEN   011000      
000666                                                                  011100      
000667*=================================================================011200      
000668*===                   REGISTRO DE SALDOS                      ===011300      
000669*=================================================================011400      
000670                                                                  011500      
000671*=A22-R01-SIS          : NUMERO DE SISTEMA     EJ. 0500           011600      
000672*=A22-R01-PRD          : NUMERO DE PRODUCTO    EJ. 0066           011700      
000673*=A22-R01-INS          : NUMERO DE INSTRUMENTO EJ. 0006.          011800      
000674*=A22-R01-CTA          : NUMERO DE CUENTA/CONTRATO                011900      
000675*=A22-R01-EDOCTA       : 00 = NADA MAS ES REGISTRO DE SALDOS      012000      
000676*                        01 = ACTIVOS Y SE GENERA EDO. CTA.       012100      
000677*                        02 = CANCELADOS EN EL MES Y SE GENERA    012200      
000678*                             EDO CTA                             012300      
000679*                        03 = INACTIVOS Y SE GENERA EDO CTA       012400      
000680*                        04 = INACTIVOS Y NO SE GENERA EDO CTA    012500      
000681*=A22-R01-FECPRO       : FECHA CONTABLE DE LA APLICACION          012600      
000682*                        FORMATO AAMMDD                           012700      
000683*=A22-R01-FECINI       : FECHA INICIO DE CICLO PARA CORTE FORMATO 012800      
000684*                        AAMMDD (CAMPO OBLIGATORIO SI             012900      
000685*                        A22-R01-EDOCTA ES MAYOR A CERO)          013000      
000686*=A22-R01-FECFIN       : FECHA FINAL DE CICLO PARA CORTE FORMATO  013100      
000687*                        AAMMDD (CAMPO OBLIGATORIO SI             013200      
000688*                        A22-R01-EDOCTA ES MAYOR A CERO)          013300      
000689*=A22-R01-STATUS       : 00 = ULTIMO REGISTRO DE SALDOS POR       013400      
000690*                             CONTRATO                            013500      
000691*                        01 = SIGUIENTE REGISTRO PERTENECE AL     013600      
000692*                         CONTRATO DE ESTE REGISTRO.              013700      
000693*=A22-R01-CVESDO       : NUMERO DE CONCEPTO DE SALDOS             013800      
000694*                        EJ. 0002 (SALDO ACTUAL)                  013900      
000695*=A22-R01-IMPT         : IMPORTE DEL CONCEPTO DE SALDO            014000      
000696                                                                  014100      
000697*=================================================================014200      
000698*==                FILLER POR APLICACION                       ===014300      
000699*=================================================================014400      
000700                                                                  014500      
000701                                                                  014600      
000702                                                                  014700      
000703                                                                  014800      
000704*=================================================================014900      
000705*==                    SISTEMA S500                            ===015000      
000706*=================================================================015100      
000707                                                                  015200      
000708*=A22-R01-DIASCICLO    : DIAS EN EL CICLO DE CORTE                015300      
000709*=A22-R01-DIASANO      : DIAS EN EL A\O                           015400      
000710*=A22-R01-TASRENET     : TASA DE RENDIMIENTO NETA                 015500      
000711*=A22-R01-TASREBRU     : TASA DE RENDIMIENTO BRUTA                015600      
000712*=A22-R01-TASREANO     : TASA DE RENDIMIENTO NETA EN EL A\O       015700      
000713*=A22-R01-STATION      : IDENTIFICADOR PARA BANCA ELECTRONICA     015800      
000714*=A22-R01-CTACON       : 00 = SUCURSAL 870                        015900      
000715*                        01 = CUENTA CONCENTRADORA                016000      
000716*=A22-R01-MONEDA       : TIPO DE MONEDA                           016010      
000717*=A22-R01-GENEDOCTA    : VALOR PARA GENERACION ESTADO DE CTA      016020      
000718*=A22-R01-INDENVCTD    : VALOR DE INDICADOR DE ENVIO CITIDIRECT   016030      
000719*=A22-R01-INDENVBNE    : VALOR DE INDICADOR DE ENVIO BANCANET     016035      
000720*=A22-R01-P-CTO-ORI    : PROD DEL CTO ORIGINAL SE TRASP BENEF     016040      
000721*=A22-R01-I-CTO-ORI    : INST DEL CTO ORIGINAL SE TRASP BENEF     016050      
000722*=A22-R01-M-CTO-ORI    : MONE DEL CTO ORIGINAL SE TRASP BENEF     016060      
000723*=A22-R01-C-TAR-ORI    : CTO  TARJETA ORIGINAL SE TRASP BENEF     016070      
000724*=A22-R01-FILS500      : FILLER PARA USO FUTURO                   016100      
000725                                                                  016200      
000726*=================================================================016300      
000727*==                    SISTEMA S408                            ===016400      
000728*=================================================================016500      
000729                                                                  016600      
000730*=A22-R01-FECVEN       : FECHA DE VENCIMIENTO DE LA LINEA         016700      
000731*=A22-R01-TASINT       : TASA DE INTERES                          016800      
000732*=A22-R01-DIASBG       : DIAS DE SOBREGIRO                        016900      
000733*=A22-R01-LINEA        : NUMERO DE LINEA                          017000      
000734*=A22-R01-FOLIO        : NUMERO DE FOLIO                          017100      
000735*=A22-R01-FILS408      : FILLER PARA USO FUTURO                   017200      
000736                                                                  017300      
000737*=================================================================017400      
000738*==                   REGISTRO TRAILER                         ===017500      
000739*=================================================================017600      
000740                                                                  017700      
000741*=A22-R02-TRA-TOTREG : TOTAL DE REGISTROS SIN INCLUIR HEADER Y    017800      
000742*                      TRAILER.                                   017900      
000743*=A22-R02-TRA-TOTCON : TOTAL DE CONTRATOS                         018000      
000744*=A22-R02-TRA-IMPT   : SUMA DE TODOS LOS IMPORTES DE LOS CONCEPTOS018100      
000745*                      DE SALDOS.                                 018200      
000746                                                                  018300      
000747*=================================================================018400      
000748*==             NOMBRE EXTERNO DE ARCHIVO                      ===018500      
000749*=================================================================018600      
000750                                                                  018700      
000751*=  (SXXX)S151/FILE/S050/SALDOSYYY/AAMMDD                         018800      
000752                                                                  018900      
000753* XXX   = NUMERO DEL USERCODE EJ. S500                            019000      
000754* YYY   = NUMERO DEL PRODUCTO EJ. S066                            019100      
000755* AAMMDD = FECHA CONTABLE DEL SISTEMA ORIGEN                      019200      
000756*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000757                                                                  031900      
000758 01  WKS-HEADER-SDOENT.                                           032000      
000759     02  WKS-HSE-TIPOREG                PIC X(02).                032100      
000760     02  WKS-HSE-FECHA                  PIC 9(08).                032200      
000761     02  FILLER                         PIC X(176).               032300      
000762                                                                  032400      
000763******************************************************************032500      
000764*           DEFINICION DE REGISTRO DE ARCHIVO SDOSAL             *032600      
000765******************************************************************032700      
000766                                                                  032800      
000767*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000768*   COPY "(S151)S151/FORMATO/ARCHIVO/S050/SDOS".                  032900      
000769******************************************************************001000      
000770*                                                                *002000      
000771*             FORMATO DEL ARCHIVO DE SALDOS                      *003000      
000772*                                                                *004000      
000773******************************************************************005000      
000774                                                                  006000      
000775                                                                  007000      
000776                                                                  008000      
000777 01 A02-R00-SALDOS.                                               009000      
000778    02 A02-R00-TIPO-REG            PIC  9(02)       COMP.         010000      
000779    02 A02-R00-FILGRAL             PIC  X(379).                   011000      
000780                                                                  012000      
000781    02 A02-R00-HEADER              REDEFINES A02-R00-FILGRAL.     013000      
000782       03 A02-R00-HDR-SISTEMA      PIC  9(04)       COMP.         014000      
000783       03 A02-R00-HDR-PRODUCTO     PIC  9(04)       COMP.         015000      
000784       03 A02-R00-HDR-FECHA        PIC  9(06)       COMP.         016000      
000785       03 FILLER                   PIC  X(372).                   017000      
000786                                                                  018000      
000787    02 A02-R01-REG-SAL             REDEFINES A02-R00-FILGRAL.     019000      
000788       03 A02-R01-SIS              PIC  9(04)       COMP.         020000      
000789       03 A02-R01-PRD              PIC  9(04)       COMP.         021000      
000790       03 A02-R01-INS              PIC  9(04)       COMP.         022000      
000791       03 A02-R01-CTA              PIC  9(20)       COMP.         023000      
000792       03 A02-R01-CTA-R            REDEFINES A02-R01-CTA.         023100      
000793          04 A02-R01-SUCPRO        PIC  9(04)       COMP.         023200      
000794          04 A02-R01-CNT           PIC  9(16)       COMP.         023300      
000795       03 A02-R01-EDOCTA           PIC  9(02)       COMP.         024000      
000796       03 A02-R01-FECPRO           PIC  9(06)       COMP.         025000      
000797       03 A02-R01-FECINI           PIC  9(06)       COMP.         026000      
000798       03 A02-R01-FECFIN           PIC  9(06)       COMP.         027000      
000799       03 A02-R01-FECULTMOV        PIC  9(06)       COMP.         027100      
000800       03 A02-R01-STATUS           PIC  9(02)       COMP.         028000      
000801       03 A02-R01-ELEM-IMP         OCCURS 30 TIMES.               029000      
000802          04 A02-R01-CVESDO        PIC  9(04)       COMP.         030000      
000803          04 A02-R01-IMPT          PIC S9(13)V99    COMP.         031000      
000804       03 A02-R01-FILXAPL          PIC  X(49).                    032000      
000805                                                                  033000      
000806       03 A02-R01-S500             REDEFINES A02-R01-FILXAPL.     034000      
000807          04 A02-R01-DIASCICLO     PIC  9(03)       COMP.         035000      
000808          04 A02-R01-DIASANO       PIC  9(03)       COMP.         036000      
000809          04 A02-R01-TASRENET      PIC  9(04)V9(04) COMP.         037000      
000810          04 A02-R01-TASREBRU      PIC  9(04)V9(04) COMP.         038000      
000811          04 A02-R01-TASREANO      PIC  9(04)V9(04) COMP.         039000      
000812          04 A02-R01-STATION       PIC  9(04)       COMP.         040000      
000813          04 A02-R01-CTACON        PIC  9(02)       COMP.         041000      
000814          04 A02-R01-GENEDOCTA     PIC  9(01).                    042000      
000815          04 A02-R01-P-CTO-ORI     PIC  9(04)       COMP.         042100      
000816          04 A02-R01-I-CTO-ORI     PIC  9(04)       COMP.         042200      
000817          04 A02-R01-M-CTO-ORI     PIC  9(02)       COMP.         042300      
000818          04 A02-R01-C-TAR-ORI     PIC  9(16)       COMP.         042400      
000819          04 A02-R01-FILS500       PIC  X(17).                    042500      
000820                                                                  043000      
000821       03 A02-R01-S408             REDEFINES A02-R01-FILXAPL.     044000      
000822          04 A02-R01-FECVEN        PIC  9(06)       COMP.         045000      
000823          04 A02-R01-TASINT        PIC  9(04)V9(04) COMP.         046000      
000824          04 A02-R01-DIASBG        PIC  9(04)       COMP.         047000      
000825          04 A02-R01-LINEA         PIC  9(04)       COMP.         048000      
000826          04 A02-R01-FOLIO         PIC  9(04)       COMP.         049000      
000827          04 A02-R01-FILS408       PIC  X(36).                    050000      
000828                                                                  051000      
000829    02 A02-R00-TRA-SAL             REDEFINES A02-R00-FILGRAL.     052000      
000830       03 A02-R02-TRA-TOTREG       PIC  9(08)       COMP.         053000      
000831       03 A02-R02-TRA-TOTCON       PIC  9(08)       COMP.         054000      
000832       03 A02-R02-TRA-IMPT         PIC S9(15)V99    COMP.         055000      
000833       03 FILLER                   PIC  X(362).                   056000      
000834                                                                  057000      
000835                                                                  058000      
000836*=================================================================059000      
000837*====             DESCRIPCION DE CAMPOS                        ===060000      
000838*=================================================================061000      
000839                                                                  062000      
000840*=A02-R00-TIPO-REG     : 00 = HEADER                              063000      
000841*                        80 = INICIO                              064000      
000842*                        81 = REGISTRO DE SALDOS                  065000      
000843*                        82 = FIN                                 066000      
000844*                        99 = TRAILER                             067000      
000845                                                                  068000      
000846*=================================================================069000      
000847*===                REGISTRO HEADER                            ===070000      
000848*=================================================================071000      
000849                                                                  072000      
000850*=A02-R00-HDR-SISTEMA  : NUMERO DE SISTEMA EJ. 0500               073000      
000851*=A02-R00-HDR-PRODUCTO : NUMERO DE PRODUCTO EJ. 0066              074000      
000852*=A02-R00-HDR-FECHA    : FECHA CONTABLE DE LA APLICACION ORIGEN   075000      
000853                                                                  076000      
000854*=================================================================077000      
000855*===                   REGISTRO DE SALDOS                      ===078000      
000856*=================================================================079000      
000857                                                                  080000      
000858*=A02-R01-SIS          : NUMERO DE SISTEMA     EJ. 0500           081000      
000859*=A02-R01-PRD          : NUMERO DE PRODUCTO    EJ. 0066           082000      
000860*=A02-R01-INS          : NUMERO DE INSTRUMENTO EJ. 0006.          083000      
000861*=A02-R01-CTA          : NUMERO DE CUENTA/CONTRATO                084000      
000862*=A02-R01-EDOCTA       : 00 = NADA MAS ES REGISTRO DE SALDOS      085000      
000863*                        01 = ACTIVOS Y SE GENERA EDO. CTA.       086000      
000864*                        02 = CANCELADOS EN EL MES Y SE GENERA    087000      
000865*                             EDO CTA                             088000      
000866*                        03 = INACTIVOS Y SE GENERA EDO CTA       089000      
000867*                        04 = INACTIVOS Y NO SE GENERA EDO CTA    090000      
000868*=A02-R01-FECPRO       : FECHA CONTABLE DE LA APLICACION          091000      
000869*                        FORMATO AAMMDD                           092000      
000870*=A02-R01-FECINI       : FECHA INICIO DE CICLO PARA CORTE FORMATO 093000      
000871*                        AAMMDD (CAMPO OBLIGATORIO SI             094000      
000872*                        A02-R01-EDOCTA ES MAYOR A CERO)          095000      
000873*=A02-R01-FECFIN       : FECHA FINAL DE CICLO PARA CORTE FORMATO  096000      
000874*                        AAMMDD (CAMPO OBLIGATORIO SI             097000      
000875*                        A02-R01-EDOCTA ES MAYOR A CERO)          098000      
000876*=A02-R01-STATUS       : 00 = ULTIMO REGISTRO DE SALDOS POR       099000      
000877*                             CONTRATO                            100000      
000878*                        01 = SIGUIENTE REGISTRO PERTENECE AL     101000      
000879*                         CONTRATO DE ESTE REGISTRO.              102000      
000880*=A02-R01-CVESDO       : NUMERO DE CONCEPTO DE SALDOS             103000      
000881*                        EJ. 0002 (SALDO ACTUAL)                  104000      
000882*=A02-R01-IMPT         : IMPORTE DEL CONCEPTO DE SALDO            105000      
000883                                                                  106000      
000884*=================================================================107000      
000885*==                FILLER POR APLICACION                       ===108000      
000886*=================================================================109000      
000887                                                                  110000      
000888                                                                  111000      
000889                                                                  112000      
000890                                                                  113000      
000891*=================================================================114000      
000892*==                    SISTEMA S500                            ===115000      
000893*=================================================================116000      
000894                                                                  117000      
000895*=A02-R01-DIASCICLO    : DIAS EN EL CICLO DE CORTE                118000      
000896*=A02-R01-DIASANO      : DIAS EN EL A\O                           119000      
000897*=A02-R01-TASRENET     : TASA DE RENDIMIENTO NETA                 120000      
000898*=A02-R01-TASREBRU     : TASA DE RENDIMIENTO BRUTA                121000      
000899*=A02-R01-TASREANO     : TASA DE RENDIMIENTO NETA EN EL A\O       122000      
000900*=A02-R01-STATION      : IDENTIFICADOR PARA BANCA ELECTRONICA     123000      
000901*=A02-R01-CTACON       : 00 = SUCURSAL 870                        124000      
000902*                        01 = CUENTA CONCENTRADORA                125000      
000903*=A02-R01-P-CTO-ORI    : PROD DEL CTO ORIGINAL SE TRASP BENEF     125100      
000904*=A02-R01-I-CTO-ORI    : INST DEL CTO ORIGINAL SE TRASP BENEF     125200      
000905*=A02-R01-M-CTO-ORI    : MONE DEL CTO ORIGINAL SE TRASP BENEF     125300      
000906*=A02-R01-C-TAR-ORI    : CTO  TARJETA ORIGINAL SE TRASP BENEF     125400      
000907*=A02-R01-FILS500      : FILLER PARA USO FUTURO                   126000      
000908                                                                  127000      
000909*=================================================================128000      
000910*==                    SISTEMA S408                            ===129000      
000911*=================================================================130000      
000912                                                                  131000      
000913*=A02-R01-FECVEN       : FECHA DE VENCIMIENTO DE LA LINEA         132000      
000914*=A02-R01-TASINT       : TASA DE INTERES                          133000      
000915*=A02-R01-DIASBG       : DIAS DE SOBREGIRO                        134000      
000916*=A02-R01-LINEA        : NUMERO DE LINEA                          135000      
000917*=A02-R01-FOLIO        : NUMERO DE FOLIO                          136000      
000918*=A02-R01-FILS408      : FILLER PARA USO FUTURO                   137000      
000919                                                                  138000      
000920*=================================================================139000      
000921*==                   REGISTRO TRAILER                         ===140000      
000922*=================================================================141000      
000923                                                                  142000      
000924*=A02-R02-TRA-TOTREG : TOTAL DE REGISTROS SIN INCLUIR HEADER Y    143000      
000925*                      TRAILER.                                   144000      
000926*=A02-R02-TRA-TOTCON : TOTAL DE CONTRATOS                         145000      
000927*=A02-R02-TRA-IMPT   : SUMA DE TODOS LOS IMPORTES DE LOS CONCEPTOS146000      
000928*                      DE SALDOS.                                 147000      
000929                                                                  148000      
000930*=================================================================149000      
000931*==             NOMBRE EXTERNO DE ARCHIVO                      ===150000      
000932*=================================================================151000      
000933                                                                  152000      
000934*=  (SXXX)S151/FILE/S050/SALDOSYYY/AAMMDD                         153000      
000935                                                                  154000      
000936* XXX   = NUMERO DEL USERCODE EJ. S500                            155000      
000937* YYY   = NUMERO DEL PRODUCTO EJ. S066                            156000      
000938* AAMMDD = FECHA CONTABLE DEL SISTEMA ORIGEN                      157000      
000939*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000940                                                                  033000      
000941                                                                  033100      
000942******************************************************************033200      
000943*             ARCHIVO ACC CITIBANK CBII (SALDOS)                 *033300      
000944******************************************************************033400      
000945*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000946*   COPY "(S151)S151/FORMATO/ARCHIVO/CITI/ACC".                   033500      
000947******************************************************************000100      
000948*                                                                *000200      
000949*             FORMATO DEL ARCHIVO DE SALDOS CBII ACC             *000300      
000950*                                                                *000400      
000951******************************************************************000500      
000952                                                                  000600      
000953                                                                  000700      
000954                                                                  000800      
000955 01 ACCI-INT-REC.                                                 000900      
000956    05 ACCI-RECORD-TYPE            PIC  X(03).                    001000      
000957    05 ACCI-KEY-GRP.                                              001100      
000958       10 ACCI-BRCH-NBR            PIC 9(03).                     001200      
000959       10 ACCI-GEN-CUST            PIC 9(11).                     001300      
000960       10 ACCI-CCY-CODE            PIC 9(03).                     001400      
000961       10 ACCI-ACCT-NBR            PIC 9(11).                     001500      
000962       10 ACCI-LIA-NBR             PIC 9(11).                     001600      
000963    05 ACCI-SWIFT-CCY-CODE         PIC X(04).                     001700      
000964    05 ACCI-SHORT-NAME-TEXT        PIC X(32).                     001800      
000965    05 ACCI-ACCT-STAT-IND          PIC X(01).                     001900      
000966    05 ACCI-CAT-CODE               PIC 9(07).                     002000      
000967    05 ACCI-LAST-TXN-DATE          PIC 9(07).                     002100      
000968    05 ACCI-ACCT-BAL-AMT           PIC 9(15)V99.                  002200      
000969    05 ACCI-ACCT-BAL-AMT-SIGN      PIC X(01).                     002300      
000970    05 ACCI-LCY-ACCT-BAL-AMT       PIC 9(15)V99.                  002400      
000971    05 ACCI-LCY-BAL-AMT-SIGN       PIC X(01).                     002500      
000972    05 ACCI-DISP-VAL-BAL-AMT       PIC 9(15)V99.                  002600      
000973    05 ACCI-DISP-BAL-AMT-SIGN      PIC X(01).                     002700      
000974    05 ACCI-BANK-NON-BANK          PIC X(03).                     002800      
000975    05 ACCI-MAIL                   PIC X(04).                     002900      
000976    05 ACCI-MAIL-TO-COLLECT        PIC X(01).                     003000      
000977    05 ACCI-MAIL-RULEOFF           PIC X(02).                     003100      
000978    05 ACCI-LANGUAGE-CODE          PIC 9(02).                     003200      
000979    05 ACCI-FILLER                 PIC X(25).                     003300      
000980    05 ACCI-CUSTOMER-NAME          PIC X(35).                     003400      
000981    05 ACCI-CBR-ADDRESS-1          PIC X(35).                     003500      
000982    05 ACCI-CBR-ADDRESS-2          PIC X(35).                     003600      
000983    05 ACCI-CBR-ADDRESS-3          PIC X(35).                     003700      
000984    05 ACCI-CBR-ADDRESS-4          PIC X(35).                     003800      
000985    05 ACCI-PRIME-DELIMETER        PIC X(01).                     003900      
000986                                                                  004000      
000987 01 ACCI-TR-REC REDEFINES ACCI-INT-REC.                           004100      
000988    05 ACCI-ENDOFFILE              PIC X(11).                     004200      
000989    05 FILLER                      PIC X(349).                    004300      
000990                                                                  004400      
000991*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000992                                                                  033600      
000993******************************************************************033700      
000994*             COPYBOOK CON EL LLAMADO A CLIENTES                 *033800      
000995******************************************************************033900      
000996*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000997* COPY "(S016)S016/PARAMETROS/L422/COMISIONES2K ON CLIENTES.".    034000      
000998**********************************************************        000100      
000999***  PARAMETROS PARA ENTRY POINT S016_L422_COMXCTA (01)           000200      
001000***   CONSULTA AL B94COMISIONES COMPLETO.                         000300      
001001**********************************************************        000400      
001002  01  E422-01-CTR-ENTRADA.                                        000500      
001003     02  E422-01-CTR-NUMSIST             PIC 9(04) COMP.          000600      
001004*            NUMERO DEL SISTEMA LLAMADOR                          000700      
001005     02  E422-01-CTR-NUMPASO             PIC 9(04) COMP.          000800      
001006*            NUMERO DEL PASO LLAMADOR                             000900      
001007     02  E422-01-CTA-NUMPROD             PIC 9(04) COMP.          001000      
001008*            SEGUN CATALOGOS DE CLIENTES                          001100      
001009     02  E422-01-CTA-CVEINST             PIC 9(04) COMP.          001200      
001010*            SEGUN CATALOGO DE CLIENTES                           001300      
001011     02  E422-01-CTO-NUM.                                         001400      
001012*            NUMERO DE CUENTA DE LA CUAL SE DESEA OBTENER INF.    001500      
001013         03  E422-01-CTA-NUMPREF         PIC 9(04) COMP.          001600      
001014         03  E422-01-CTA-NUM             PIC 9(12) COMP.          001700      
001015     02  E422-01-CTR-NUMCSI              PIC 9(02) COMP.          001800      
001016     02  FILLER                          PIC X(43).               001900      
001017*  SIZE ENTRADA X(60).                                            002000      
001018  01  S422-01-CTR-SALIDA.                                         002100      
001019     02  S422-01-CTR-REGISTRO.                                    002200      
001020         03  S422-01-CTR-NUMCSI          PIC 9(02) COMP.          002300      
001021         03  S422-01-CTA-NUMPROD         PIC 9(04) COMP.          002400      
001022         03  S422-01-CTA-CVEINST         PIC 9(04) COMP.          002500      
001023         03  S422-01-CTO-NUM.                                     002600      
001024             04  S422-01-CTA-NUMPREF     PIC 9(04) COMP.          002700      
001025             04  S422-01-CTA-NUM         PIC 9(12) COMP.          002800      
001026         03  S422-01-CTR-COMISION OCCURS 10 TIMES.                002900      
001027             04  S422-01-CTR-CVECOBRO    PIC 9(02) COMP.          003000      
001028             04  S422-01-CTA-COBCOM      PIC 9(03)V9(2) COMP.     003100      
001029         03  S422-01-CTR-CVEDGA          PIC 9(02) COMP.          003200      
001030         03  S422-01-CTR-FECCADUC        PIC 9(04) COMP.          003300      
001031         03  S422-01-CTR-NUMREPTAR       PIC 9(04) COMP.          003400      
001032         03  S422-01-CTR-NUMCONEDO       PIC 9(04) COMP.          003500      
001033         03  S422-01-CTR-INDCAMB         PIC 9(02) COMP.          003600      
001034         03  S422-01-CTR-FECCADUC-2K     PIC 9(06) COMP.          003700      
001035*FECCADUC-2K  ES AAAAMM POR ESO SOLO ES PIC 9(06) COMP.           003800      
001036         03  FILLER                      PIC X(24).               003900      
001037*SIZE SALIDA X(84).                                               004000      
001038  77  R422-01-CTR-ERROR                   PIC S9(11) BINARY.      004100      
001039****************************************************************  004200      
001040* PARAMETROS PARA ENTRY POINT S016_L422_COMXNCTAS (02)            004300      
001041* CONSULTA B94COMISIONES. COMPLETO, MULTIPLE(NUM_REG E/S)         004400      
001042****************************************************************  004500      
001043  01  E422-02-CTR-ENTRADA.                                        004600      
001044     02  E422-02-CTR-NUMSIST             PIC 9(04) COMP.          004700      
001045*            NUMERO DEL SISTEMA LLAMADOR                          004800      
001046     02  E422-02-CTR-NUMPASO             PIC 9(04) COMP.          004900      
001047*            NUMERO DEL PASO LLAMADOR                             005000      
001048     02  E422-02-CTA-NUMPROD             PIC 9(04) COMP.          005100      
001049*            SEGUN CATALOGOS DE CLIENTES                          005200      
001050     02  E422-02-CTA-CVEINST             PIC 9(04) COMP.          005300      
001051*            SEGUN CATALOGO DE CLIENTES                           005400      
001052     02  E422-02-CTO-NUM.                                         005500      
001053*            NUMERO DE CUENTA DE LA CUAL SE DESEA OBTENER INF.    005600      
001054         03  E422-02-CTA-NUMPREF         PIC 9(04) COMP.          005700      
001055         03  E422-02-CTA-NUM             PIC 9(12) COMP.          005800      
001056     02  E422-02-CTR-NUMREG              PIC 9(02) COMP.          005900      
001057*        NUMERO DE REG. QUE SE DESEAN OBTENER EN EL LLAMADO       006000      
001058     02  E422-02-CTR-NUMCSI              PIC 9(02) COMP.          006100      
001059     02  FILLER                          PIC X(32).               006200      
001060* SIZE ENTRADA X(60)                                              006300      
001061  01  S422-02-CTR-SALIDA.                                         006400      
001062     02  S422-02-CTR-NUMREG              PIC 9(02) COMP.          006500      
001063*        NUMERO DE REGISTROS ENTREGADOS EN LA SALIDA              006600      
001064     02  S422-02-CTR-REGISTRO OCCURS 30 TIMES.                    006700      
001065         03  S422-02-CTR-NUMCSI          PIC 9(02) COMP.          006800      
001066         03  S422-02-CTA-NUMPROD         PIC 9(04) COMP.          006900      
001067         03  S422-02-CTA-CVEINST         PIC 9(04) COMP.          007000      
001068         03  S422-02-CTO-NUM.                                     007100      
001069             04  S422-02-CTA-NUMPREF     PIC 9(04) COMP.          007200      
001070             04  S422-02-CTA-NUM         PIC 9(12) COMP.          007300      
001071         03  S422-02-CTR-COMISION OCCURS 10 TIMES.                007400      
001072             04  S422-02-CTR-CVECOBRO    PIC 9(02) COMP.          007500      
001073             04  S422-02-CTA-COBCOM      PIC 9(03)V9(2) COMP.     007600      
001074         03  S422-02-CTR-CVEDGA          PIC 9(02) COMP.          007700      
001075         03  S422-02-CTR-FECCADUC        PIC 9(04) COMP.          007800      
001076         03  S422-02-CTR-NUMREPTAR       PIC 9(04) COMP.          007900      
001077         03  S422-02-CTR-NUMCONEDO       PIC 9(04) COMP.          008000      
001078         03  S422-02-CTR-INDCAMB         PIC 9(02) COMP.          008100      
001079         03  S422-02-CTR-FECCADUC-2K     PIC 9(06) COMP.          008200      
001080*FECCADUC-2K  ES AAAAMM POR ESO SOLO ES PIC 9(06) COMP.           008300      
001081         03  FILLER                      PIC X(25).               008400      
001082*      SIZE reg OCCURS X(84)                                      008500      
001083*  SIZE SALIDA = 1+(84*30) = 2521                                 008600      
001084   77   R422-02-CTR-ERROR                PIC S9(11) BINARY.       008700      
001085*******************************************************           008800      
001086*  PARAMETROS PARA ENTRY POINT S016_L422_CTESGRAL (03)*           008900      
001087*  CONSULTA B01CLIENTES y B05CTECTA CON OPCION.     ***           009000      
001088*******************************************************           009100      
001089  01  E422-03-CTR-ENTRADA.                                        009200      
001090     02  E422-03-CTR-NUMSIST         PIC 9(04) COMP.              009300      
001091     02  E422-03-CTR-NUMPASO         PIC 9(04) COMP.              009400      
001092     02  E422-03-CTA-NUMPROD         PIC 9(04) COMP.              009500      
001093     02  E422-03-CTA-CVEINST         PIC 9(04) COMP.              009600      
001094     02  E422-03-CTO-NUM.                                         009700      
001095         03  E422-03-CTA-NUMPREF     PIC 9(04) COMP.              009800      
001096         03  E422-03-CTA-NUM         PIC 9(12) COMP.              009900      
001097     02  E422-03-CTE-NUM             PIC 9(12) COMP.              010000      
001098     02  E422-03-OPCION              PIC 9(02) COMP.              010100      
001099     02  E422-03-CTR-NUMCSI          PIC 9(02) COMP.              010200      
001100     02  FILLER                      PIC X(36).                   010300      
001101*  SIZE ENTRADA X(60).                                            010400      
001102 01 S422-03-CTR-SALIDA.                                           010500      
001103    02 S422-03-CTR-REGISTRO.                                      010600      
001104       03 S422-03-CTE-NUM            PIC 9(12) COMP.              010700      
001105       03 S422-03-CTE-NOM            PIC X(55).                   010800      
001106       03 S422-03-CTE-DOM.                                        010900      
001107          04 S422-03-CTE-CALLENUM    PIC X(36).                   011000      
001108          04 S422-03-CTE-NOMCOL      PIC X(24).                   011100      
001109          04 S422-03-CTE-NOMPOB      PIC X(20).                   011200      
001110          04 S422-03-CTE-CVEEDO      PIC 9(02) COMP.              011300      
001111          04 S422-03-CTE-NUMCP       PIC 9(06) COMP.              011400      
001112          04 S422-03-CTE-NUMTEL      PIC 9(10) COMP.              011500      
001113          04 S422-03-CTE-NUMTELEXT   PIC 9(06) COMP.              011600      
001114          04 S422-03-CTE-CVETEL      PIC 9(02) COMP.              011700      
001115          04 S422-03-CTE-NUMTEL2     PIC 9(10) COMP.              011800      
001116          04 S422-03-CTE-NUMTELEXT2  PIC 9(06) COMP.              011900      
001117          04 S422-03-CTE-CVETEL2     PIC 9(02) COMP.              012000      
001118       03 S422-03-CTR-CVEDOM         PIC 9(02) COMP.              012100      
001119       03 S422-03-CTR-NUMDOMS        PIC 9(04) COMP.              012200      
001120       03 S422-03-CTE-CVEPERS        PIC 9(02) COMP.              012300      
001121       03 S422-03-CTE-CVETIPO        PIC 9(02) COMP.              012400      
001122       03 S422-03-CTE-NUMCLASIF      PIC 9(02) COMP.              012500      
001123       03 S422-03-CTE-CODRFC.                                     012600      
001124          04 S422-03-CTE-CODINI      PIC X(04).                   012700      
001125          04 S422-03-CTE-FECNAC      PIC 9(06) COMP.              012800      
001126          04 S422-03-CTE-CODHOM      PIC X(05).                   012900      
001127       03 S422-03-CTE-CVENACION      PIC 9(02) COMP.              013000      
001128       03 S422-03-CTE-CVESEXO        PIC 9(02) COMP.              013100      
001129       03 S422-03-CTE-CAEB           PIC 9(06) COMP.              013200      
001130       03 S422-03-CTE-CVEACTBM       PIC 9(06) COMP.              013300      
001131       03 S422-03-CTE-CVESECTOR      PIC 9(02) COMP.              013400      
001132       03 S422-03-CTE-CVEPERBCO      PIC 9(02) COMP.              013500      
001133       03 S422-03-CTE-CVESEG         PIC 9(02) COMP.              013600      
001134       03 S422-03-CTE-CVESTATUS      PIC 9(02) COMP.              013700      
001135       03 S422-03-CTE-RIEBNM         PIC X(02).                   013800      
001136       03 S422-03-CTE-DIACORTE       PIC 9(02) COMP.              013900      
001137       03 S422-03-CTE-CVEENVIO       PIC 9(04) COMP.              014000      
001138       03 S422-03-CTE-NUMOFICON      PIC 9(04) COMP.              014100      
001139*  NUMOFICON ES EQUIVALENTE A SUCURSAL PROMOTORA                  014200      
001140       03 S422-03-CTE-EDOCTACON      PIC 9(02) COMP.              014300      
001141       03 S422-03-CTE-CVEDISENT      PIC 9(02) COMP.              014400      
001142       03 S422-03-CTE-CVEDISSAL      PIC 9(02) COMP.              014500      
001143       03 S422-03-OFI-NUMCSIALT      PIC 9(02) COMP.              014600      
001144       03 S422-03-CTE-FECALTA-2K     PIC 9(08) COMP.              014700      
001145       03 S422-03-CTE-FECULTMOD-2K   PIC 9(08) COMP.              014800      
001146       03 S422-03-CTR-CVESTADOM      PIC 9(02) COMP.              014900      
001147       03 FILLER                     PIC X(27).                   015000      
001148*  SIZE SALIDA X(240).                                            015100      
001149  01  S422-03-RCTR-SALIDA REDEFINES S422-03-CTR-SALIDA.           015200      
001150     03 S422-03-CTR-ERROR                 PIC 9(004) COMP.        015300      
001151     03 S422-03-CTR-ERRORTYPE             PIC 9(004) COMP.        015400      
001152     03 S422-03-CTR-STRUCTURE             PIC 9(004) COMP.        015500      
001153     03 FILLER                            PIC X(234).             015600      
001154   77  R422-03-CTR-ERROR                 PIC S9(11) BINARY.       015700      
001155*********************************************************         015800      
001156*   PARAMETROS PARA ENTRY POINT S016_L422_CUENTAS (04)***         015900      
001157*** CONSULTA B04CUENTAS Y B17INFADICTA CON OPCION   *****         016000      
001158*********************************************************         016100      
001159  01  E422-04-CTR-ENTRADA.                                        016200      
001160     02  E422-04-CTR-NUMCSI              PIC 9(02) COMP.          016300      
001161*            NUMERO DEL CSI DEL QUE SE DESEA INF.                 016400      
001162     02  E422-04-CTR-NUMSIST             PIC 9(04) COMP.          016500      
001163*            NUMERO DEL SISTEMA LLAMADOR                          016600      
001164     02  E422-04-CTR-NUMPASO             PIC 9(04) COMP.          016700      
001165*            NUMERO DEL PASO LLAMADOR                             016800      
001166     02  E422-04-CTA-NUMPROD             PIC 9(04) COMP.          016900      
001167*            SEGUN CATALOGOS DE CLIENTES                          017000      
001168     02  E422-04-CTA-CVEINST             PIC 9(04) COMP.          017100      
001169*            SEGUN CATALOGO DE CLIENTES                           017200      
001170     02  E422-04-CTO-NUM.                                         017300      
001171*            NUMERO DE CUENTA DE LA CUAL SE DESEA OBTENER INF.    017400      
001172         03  E422-04-CTA-NUMPREF         PIC 9(04) COMP.          017500      
001173         03  E422-04-CTA-NUM             PIC 9(12) COMP.          017600      
001174     02  E422-04-OPCION                  PIC 9(02) COMP.          017700      
001175*            1 - IMPLICA INF. ADICIONAL DE LA CUENTA              017800      
001176*            0 - SOLO INF. DE LA CUENTA                           017900      
001177     02  FILLER                          PIC X(42).               018000      
001178*SIZE ENTRADA X(60).                                              018100      
001179  01  S422-04-CTR-SALIDA.                                         018200      
001180     02  S422-04-CTR-REGISTRO.                                    018300      
001181         03  S422-04-CTR-NUMCSI          PIC 9(02) COMP.          018400      
001182         03  S422-04-CTA-NUMPROD         PIC 9(04) COMP.          018500      
001183         03  S422-04-CTA-CVEINST         PIC 9(02) COMP.          018600      
001184         03  S422-04-CTA-NUMSUC          PIC 9(04) COMP.          018700      
001185         03  S422-04-CTO-NUM.                                     018800      
001186             05  S422-04-CTA-NUMPREF     PIC 9(04) COMP.          018900      
001187             05  S422-04-CTA-NUM         PIC 9(12) COMP.          019000      
001188         03  S422-04-CTE-NUM             PIC 9(12) COMP.          019100      
001189         03  S422-04-CTA-DIACORTE        PIC 9(02) COMP.          019200      
001190         03  S422-04-CTA-CVEMONEDA       PIC 9(02) COMP.          019300      
001191         03  S422-04-CTA-CVEENVIO        PIC 9(04) COMP.          019400      
001192         03  S422-04-CTA-EDIEDOCTA       PIC 9(02) COMP.          019500      
001193         03  S422-04-CTA-DISEDOCTA       PIC 9(02) COMP.          019600      
001194         03  S422-04-CTA-CVEMANEJO       PIC 9(02) COMP.          019700      
001195         03  S422-04-CTA-CVENIVRIE       PIC X(01).               019800      
001196         03  S422-04-CTA-CVESTATUS       PIC 9(02) COMP.          019900      
001197         03  S422-04-CTA-CVEUSO          PIC 9(02) COMP.          020000      
001198         03  S422-04-CTR-USOEJECTA       PIC 9(04) COMP.          020100      
001199         03  S422-04-CTR-USOSCTE         PIC 9(04) COMP.          020200      
001200         03  S422-04-CTA-FECAPER-2K      PIC 9(08) COMP.          020300      
001201         03  S422-04-CTA-FECULTMOD-2K    PIC 9(08) COMP.          020400      
001202         03  S422-04-CTA-FECCANCEL-2K    PIC 9(08) COMP.          020500      
001203         03  S422-04-CTA-FECRENOVA-2K    PIC 9(08) COMP.          020600      
001204* INFORMACION ADICIONAL DE LA CUENTA:                             020700      
001205         03  S422-04-CTA-CODAFIL         PIC X(12).               020800      
001206         03  S422-04-CTA-CODFONVIV       PIC X(12).               020900      
001207         03  S422-04-CTA-NUMEMPDEP       PIC 9(06) COMP.          021000      
001208         03  S422-04-CTA-CVEDISENT       PIC 9(02) COMP.          021100      
001209         03  S422-04-CTA-CVEDISSAL       PIC 9(02) COMP.          021200      
001210         03  S422-04-CTA-ADNIVRIE        PIC X(01).               021300      
001211         03  S422-04-CTA-FECUMODRI-2K    PIC 9(08) COMP.          021400      
001212         03  S422-04-CTA-CVEDESCRE       PIC 9(06) COMP.          021500      
001213         03  S422-04-CTA-CVEEMP          PIC X(03).               021600      
001214         03  S422-04-CTA-NUMPAGEMP       PIC X(09).               021700      
001215         03  S422-04-CTE-FECONSTIT-2K    PIC 9(08) COMP.          021800      
001216         03  S422-04-CTE-FEDICJURI-2K    PIC 9(08) COMP.          021900      
001217         03  S422-04-CTE-FEPODER-2K      PIC 9(08) COMP.          022000      
001218         03  S422-04-CTA-NUMCTOSAR       PIC 9(06) COMP.          022100      
001219         03  S422-04-CTA-FECULTIMP-2K    PIC 9(08) COMP.          022200      
001220         03  S422-04-CTR-DATHIPOTE.                               022300      
001221             05 S422-04-CTA-FECFIRMA-2K  PIC 9(08) COMP.          022400      
001222             05 S422-04-CTR-NUMDOMGAR    PIC 9(04) COMP.          022500      
001223             05 S422-04-CTA-CVEVARTAS    PIC 9(02) COMP.          022600      
001224             05 S422-04-CTA-NUMCONVE     PIC 9(04) COMP.          022700      
001225             05 S422-04-CTA-IMPPREST     PIC 9(14)V9(02) COMP.    022800      
001226             05 S422-04-CTA-CVETIPCRE    PIC 9(02) COMP.          022900      
001227             05 S422-04-CTR-NUMENCPTE    PIC 9(14) COMP.          023000      
001228         03  FILLER                      PIC X(37).               023100      
001229* SIZE SALIDA X(180).                                             023200      
001230  77  R422-04-CTR-ERROR                PIC S9(11) BINARY.         023300      
001231************************************************************      023400      
001232**** PARAMETROS PARA EL ENTRY POINT S016_L422_S500_01 (05)**      023500      
001233**** CONSULTA B08MEDIOS, B04CUENTAS, B01CLIENTES          **      023600      
001234****          Y B17INFADICTA CON OPCION = 1               **      023700      
001235************************************************************      023800      
001236  01  E422-05-CTR-ENTRADA.                                        023900      
001237     02 E422-05-CTR-NUMSIST         PIC 9(04) COMP.               024000      
001238     02 E422-05-CTR-NUMPASO         PIC 9(04) COMP.               024100      
001239     02 E422-05-CTA-NUMPROD         PIC 9(04) COMP.               024200      
001240     02 E422-05-CTA-CVEINST         PIC 9(04) COMP.               024300      
001241     02 E422-05-CTO-NUM.                                          024400      
001242        03  E422-05-CTA-NUMPREF     PIC 9(04) COMP.               024500      
001243        03  E422-05-CTA-NUM         PIC 9(12) COMP.               024600      
001244     02 E422-05-OPCION              PIC 9(02) COMP.               024700      
001245     02 E422-05-CTR-NUMCSI          PIC 9(02) COMP.               024800      
001246     02 FILLER                      PIC X(42).                    024900      
001247* SIZE ENTRADA X(60)                                              025000      
001248  01  S422-05-CTR-SALIDA.                                         025100      
001249     02 S422-05-CTR-REGISTRO.                                     025200      
001250* DEL REBISTRO B04 CUENTAS                                        025300      
001251        03 S422-05-CTA-NUMPROD         PIC 9(04) COMP.            025400      
001252        03 S422-05-CTA-CVEINST         PIC 9(04) COMP.            025500      
001253        03 S422-05-CTA-NUMSUC          PIC 9(04) COMP.            025600      
001254* DEL REGISTRO B01 CLIENTES Y B04 CUENTAS CON NOTA.               025700      
001255        03 S422-05-CTE-CVEPERS         PIC 9(02) COMP.            025800      
001256        03 S422-05-CTE-CVESECTOR       PIC 9(02) COMP.            025900      
001257        03 S422-05-CTE-CVETIPO         PIC 9(02) COMP.            026000      
001258        03 S422-05-CTE-CVEACTBNM       PIC 9(06) COMP.            026100      
001259        03 S422-05-CTA-CVEMONEDA       PIC 9(02) COMP.            026200      
001260        03 S422-05-CTE-NOMBRE          PIC X(55).                 026300      
001261        03 S422-05-CTE-CVESOCFUN       PIC 9(02) COMP.            026400      
001262        03 S422-05-CTE-CVEPERBCO       PIC 9(02) COMP.            026500      
001263*                              NOTA DEL B04.                      026600      
001264        03 S422-05-CTE-NUM             PIC 9(12) COMP.            026700      
001265*                              NOTA DEL B04.                      026800      
001266        03 S422-05-CTA-CVESTATUS       PIC 9(02) COMP.            026900      
001267        03 S422-05-CTE-CODRFC.                                    027000      
001268           04 S422-05-CTE-CODINI       PIC X(04).                 027100      
001269           04 S422-05-CTE-FECNAC       PIC 9(06) COMP.            027200      
001270           04 S422-05-CTE-CODHOM       PIC X(05).                 027300      
001271*                              NOTA DEL B04.                      027400      
001272        03 S422-05-CTA-CVEUSO          PIC 9(02) COMP.            027500      
001273*                              NOTA DEL B04.                      027600      
001274        03 S422-05-CTA-CVEMANEJO       PIC 9(02) COMP.            027700      
001275* DEL REGISTRO B17 INFADICTA                                      027800      
001276        03 S422-05-INFADICTA.                                     027900      
001277           04 S422-05-FECONSTIT-2K     PIC 9(08) COMP.            028000      
001278           04 S422-05-FEPODER-2K       PIC 9(08) COMP.            028100      
001279           04 S422-05-FEDICJURI-2K     PIC 9(08) COMP.            028200      
001280* CONTINUA LA INFORMACION DEL B01.                                028300      
001281        03 S422-05-CTR-NUMCSI          PIC 9(02) COMP.            028400      
001282        03 S422-05-CTE-CAEB            PIC 9(06) COMP.            028500      
001283        03 S422-05-CTE-CVESEXO         PIC 9(02) COMP.            028600      
001284     02    FILLER                      PIC X(24).                 028700      
001285* SIZE SALIDA X(132).                                             028800      
001286  77  R422-05-CTR-ERROR                 PIC S9(11) BINARY.        028900      
001287**********************************************************        029000      
001288***PARAMETROS PARA EL ENTRY POINT S016_L422_MEDIOS (06)***        029100      
001289*  CONSULTA B05CTECTA Y B08MEDIOS MULTIPLE (NUM_REG E/S) *        029200      
001290**********************************************************        029300      
001291  01  E422-06-CTR-ENTRADA.                                        029400      
001292     02  E422-06-CTR-NUMCSI          PIC 9(02) COMP.              029500      
001293     02  E422-06-CTR-NUMSIST         PIC 9(04) COMP.              029600      
001294     02  E422-06-CTR-NUMPASO         PIC 9(04) COMP.              029700      
001295     02  E422-06-CTR-LLAVE.                                       029800      
001296         03 E422-06-CTA-NUMPROD      PIC 9(04) COMP.              029900      
001297         03 E422-06-CTA-CVEINST      PIC 9(04) COMP.              030000      
001298         03 E422-06-CTO-NUM.                                      030100      
001299            05 E422-06-CTA-NUMPREF   PIC 9(04) COMP.              030200      
001300            05 E422-06-CTA-NUM       PIC 9(12) COMP.              030300      
001301         03 E422-06-MDA-CVETIPO      PIC 9(02) COMP.              030400      
001302         03 E422-06-MDA-CTONUM.                                   030500      
001303            05 E422-06-MDA-NUMPREF   PIC 9(04) COMP.              030600      
001304            05 E422-06-MDA-NUM       PIC 9(12) COMP.              030700      
001305     02  E422-06-CTR-NUMREG          PIC 9(02) COMP.              030800      
001306     02  E422-06-CTE-NUM             PIC 9(12) COMP.              030900      
001307     02  FILLER                      PIC X(27).                   031000      
001308* SIZE ENTRADA (60).                                              031100      
001309  01 S422-06-CTR-SALIDA.                                          031200      
001310    02 S422-06-CTR-NUMREG           PIC 9(02) COMP.               031300      
001311******                                                            031400      
001312    02 S422-06-CTR-REGISTRO OCCURS 5 TIMES.                       031500      
001313       03 S422-06-CTE-NUM                 PIC 9(12) COMP.         031600      
001314       03 S422-06-CTA-NUMPROD             PIC 9(04) COMP.         031700      
001315       03 S422-06-CTA-CVEINST             PIC 9(04) COMP.         031800      
001316       03 S422-06-CTA-NUMCTO.                                     031900      
001317          05 S422-06-CTA-NUMPREF          PIC 9(04) COMP.         032000      
001318          05 S422-06-CTA-NUM              PIC 9(12) COMP.         032100      
001319       03 S422-06-MDA-CVETIPO             PIC 9(02) COMP.         032200      
001320       03 S422-06-MDA-SUBTIPO             PIC 9(02) COMP.         032300      
001321       03 S422-06-MDA-CVETIT              PIC 9(02) COMP.         032400      
001322       03 S422-06-MDA-NUMCTO.                                     032500      
001323          05 S422-06-MDA-NUMPREF          PIC 9(04) COMP.         032600      
001324          05 S422-06-MDA-NUM              PIC 9(12) COMP.         032700      
001325       03 S422-06-MDA-ABRPROFT            PIC X(03).              032800      
001326       03 S422-06-CTR-PTRNOMT             PIC 9(04) COMP.         032900      
001327       03 S422-06-MDA-ABRPROFC            PIC X(03).              033000      
001328       03 S422-06-CTR-PTRNOMC             PIC 9(04) COMP.         033100      
001329       03 S422-06-MDA-NUMTALON            PIC 9(02) COMP.         033200      
001330       03 S422-06-MDA-CHQXTALON           PIC 9(02) COMP.         033300      
001331       03 S422-06-MDA-CVESTATUS           PIC 9(02) COMP.         033400      
001332       03 S422-06-MDA-FECALTA-2K          PIC 9(08) COMP.         033500      
001333       03 S422-06-MDA-FECULTMOD-2K        PIC 9(08) COMP.         033600      
001334       03 S422-06-MDA-FECVENC-2K          PIC 9(08) COMP.         033700      
001335       03 S422-06-MDA-FECCANCEL-2K        PIC 9(08) COMP.         033800      
001336       03 S422-06-MDA-FECPREV             PIC 9(06) COMP.         033900      
001337       03 S422-06-MDA-HHPREV              PIC 9(04) COMP.         034000      
001338       03 FILLER                          PIC X(21).              034100      
001339*      SIZE reg OCCURS X(84)                                      034200      
001340*  SIZE SALIDA = 1+(84*5) = 421                                   034300      
001341  01  S422-06-RCTR-SALIDA REDEFINES S422-06-CTR-SALIDA.           034400      
001342     03 S422-06-CTR-ERROR                 PIC 9(004) COMP.        034500      
001343     03 S422-06-CTR-ERRORTYPE             PIC 9(004) COMP.        034600      
001344     03 S422-06-CTR-STRUCTURE             PIC 9(004) COMP.        034700      
001345     03 FILLER                            PIC X(415).             034800      
001346 77  R422-06-CTR-ERROR                    PIC S9(11) BINARY.      034900      
001347********************************************************          035000      
001348*  PARAMETROS               S016_L422_CTASREL (07)   ***          035100      
001349*  CONSULTA B07CTACTA, MULTIPLE (NUMREG E/S)         ***          035200      
001350********************************************************          035300      
001351*77 WKS-NUMREG-07                   PIC 9(02) COMP.               035400      
001352*                                   VALUE 20.                     035500      
001353* El value depende de los registros deseados, ejemplo se usa 20.  035600      
001354 01 E422-07-CTR-ENTRADA.                                          035700      
001355    02 E422-07-CTR-NUMCSI           PIC 9(02) COMP.               035800      
001356    02 E422-07-CTR-NUMSIST          PIC 9(04) COMP.               035900      
001357    02 E422-07-CTR-NUMPASO          PIC 9(04) COMP.               036000      
001358    02 E422-07-CTE-NUM              PIC 9(12) COMP.               036100      
001359    02 E422-07-CTA-NUMPROD          PIC 9(04) COMP.               036200      
001360    02 E422-07-CTA-CVEINST          PIC 9(04) COMP.               036300      
001361    02 E422-07-CTO-NUM.                                           036400      
001362          05 E422-07-CTA-NUMPREF    PIC 9(04) COMP.               036500      
001363          05 E422-07-CTA-NUM        PIC 9(12) COMP.               036600      
001364    02 E422-07-CTA-NUMPRODREL       PIC 9(04) COMP.               036700      
001365    02 E422-07-CTA-CVEINSTREL       PIC 9(04) COMP.               036800      
001366    02 E422-O7-CTA-CTONUMREL.                                     036900      
001367          05 E422-07-CTA-NUMPREFREL PIC 9(04) COMP.               037000      
001368          05 E422-07-CTA-NUMREL     PIC 9(12) COMP.               037100      
001369    02 E422-07-CTR-CVERELCTA        PIC 9(02) COMP.               037200      
001370    02 E422-07-CTR-NUMREG           PIC 9(02) COMP.               037300      
001371    02 FILLER                       PIC X(18).                    037400      
001372** SIZE ENTRADA X(60)                                             037500      
001373  01 S422-07-CTR-SALIDA.                                          037600      
001374    02 S422-07-CTR-NUMREG           PIC 9(02) COMP.               037700      
001375    02 S422-07-CTR-REGISTRO  OCCURS 50 TIMES.                     037800      
001376*                              DEPENDING ON WKS-NUMREG-07.        037900      
001377       03 S422-07-CTR-NUMCSI        PIC 9(02) COMP.               038000      
001378       03 S422-07-CTE-NUM           PIC 9(12) COMP.               038100      
001379       03 S422-07-CTA-NUMPROD       PIC 9(04) COMP.               038200      
001380       03 S422-07-CTA-CVEINST       PIC 9(02) COMP.               038300      
001381       03 S422-07-CTO-NUM.                                        038400      
001382          05 S422-07-CTA-NUMPREF    PIC 9(04) COMP.               038500      
001383          05 S422-07-CTA-NUM        PIC 9(12) COMP.               038600      
001384       03 S422-07-CTR-CVERELCTA     PIC 9(02) COMP.               038700      
001385       03 S422-07-CTA-NUMPRODREL    PIC 9(04) COMP.               038800      
001386       03 S422-07-CTA-CVEINSTREL    PIC 9(02) COMP.               038900      
001387       03 S422-07-CTA-CTONUMREL.                                  039000      
001388          05 S422-07-CTA-NUMPREFREL PIC 9(04) COMP.               039100      
001389          05 S422-07-CTA-NUMREL     PIC 9(12) COMP.               039200      
001390       03 S422-07-CTA-FECALTA-2K    PIC 9(08) COMP.               039300      
001391       03 S422-07-CTA-FECULTMOD-2K  PIC 9(08) COMP.               039400      
001392       03 FILLER                    PIC X(34).                    039500      
001393*      size reg OCCURS X(72)                                      039600      
001394*      SIZE SALIDA = 1+(72*50) = 3601                             039700      
001395*                                                                 039800      
001396       77  R422-07-CTR-ERROR               PIC S9(11) BINARY.     039900      
001397*                                                                 040000      
001398******************************************************            040100      
001399**  PARAMETROS PARA ENTRY POINT S016_L422_SERV (08)  *            040200      
001400**  CONSULTA B09BCALEC                               *            040300      
001401******************************************************            040400      
001402 01  E422-08-CTR-ENTRADA.                                         040500      
001403     02  E422-08-CTR-NUMCSI              PIC 9(02) COMP.          040600      
001404*            NUMERO DEL CSI DEL QUE SE DESEA LA INFORMACION       040700      
001405*            0  = INFORMACION LOCAL                               040800      
001406*            99 = INFORMACION NACIONAL (SOLO EN VDM)              040900      
001407*            NN = INF. DEL CSI NN                                 041000      
001408     02  E422-08-CTR-NUMSIST             PIC 9(04) COMP.          041100      
001409*            NUMERO DEL SISTEMA LLAMADOR                          041200      
001410     02  E422-08-CTR-NUMPASO             PIC 9(04) COMP.          041300      
001411*            NUMERO DEL PASO LLAMADOR                             041400      
001412     02  E422-08-CTR-CLAVE.                                       041500      
001413         03  E422-08-SER-NUM             PIC 9(04) COMP.          041600      
001414*            NUMERO DEL SERVICIO A CONSULTAR                      041700      
001415         03  E422-08-SER-CVETIPO         PIC 9(02) COMP.          041800      
001416*            NUMERO DE INSTRUMENTO (CLAVE)                        041900      
001417         03  E422-08-CTE-NUM             PIC 9(12) COMP.          042000      
001418*            NUMERO DEL CLIENTE DEL QUE SE DESEA INFORMACION.     042100      
001419     02  FILLER                          PIC X(46).               042200      
001420* SIZE ENTRADA X(60).                                             042300      
001421*                                                                 042400      
001422 01  S422-08-CTR-SALIDA.                                          042500      
001423     02  S422-08-CTR-REGISTRO.                                    042600      
001424         03  S422-08-CTR-NUMCSI          PIC 9(02) COMP.          042700      
001425         03  S422-08-CTE-NUM             PIC 9(12) COMP.          042800      
001426         03  S422-08-SER-NUM             PIC 9(04) COMP.          042900      
001427         03  S422-08-SER-CVETIPO         PIC 9(02) COMP.          043000      
001428         03  S422-08-SER-CVEDISP         PIC 9(04) COMP.          043100      
001429         03  S422-08-SER-NOMESTA         PIC X(08).               043200      
001430         03  S422-08-SER-NUMSUCPRO       PIC 9(04) COMP.          043300      
001431         03  S422-08-SER-NUMCTAPRI.                               043400      
001432             05  S422-08-CTA-NUMPROD     PIC 9(04) COMP.          043500      
001433             05  S422-08-CTA-CVEINST     PIC 9(02) COMP.          043600      
001434             05  S422-08-CTA-NUMPREF     PIC 9(04) COMP.          043700      
001435             05  S422-08-CTA-NUM         PIC 9(12) COMP.          043800      
001436         03  S422-08-SER-COBCOM OCCURS 6 TIMES.                   043900      
001437             05  S422-08-COMISION        PIC 9(02) COMP.          044000      
001438         03  S422-08-SER-VERSOFT         PIC 9(04) COMP.          044100      
001439         03  S422-08-SER-PROPEQUIP       PIC 9(02) COMP.          044200      
001440         03  S422-08-CTE-PIN             PIC 9(04) COMP.          044300      
001441         03  S422-08-CTE-PINVER          PIC 9(02) COMP.          044400      
001442         03  S422-08-CTE-CVENOPIN        PIC 9(02) COMP.          044500      
001443         03  S422-08-SER-CVESTATUS       PIC 9(02) COMP.          044600      
001444         03  S422-08-CTR-CVEENVIO        PIC 9(04) COMP.          044700      
001445         03  S422-08-SER-DIACORTE        PIC 9(02) COMP.          044800      
001446         03  S422-08-SER-EDIEDOCTA       PIC 9(02) COMP.          044900      
001447         03  S422-08-SER-DISEDOCTA       PIC 9(02) COMP.          045000      
001448         03  S422-08-SER-FECONTRAT-2K    PIC 9(08) COMP.          045100      
001449         03  S422-08-SER-FECRENOVA-2K    PIC 9(08) COMP.          045200      
001450         03  S422-08-SER-FECCANCEL-2K    PIC 9(08) COMP.          045300      
001451         03  S422-08-SER-FECULTMOD-2K    PIC 9(08) COMP.          045400      
001452         03  S422-08-SER-FECMODPIN-2K    PIC 9(08) COMP.          045500      
001453         03  S422-08-SER-FECULTMOV-2K    PIC 9(08) COMP.          045600      
001454         03  FILLER                      PIC X(26).               045700      
001455* SIZE SALIDA X(102).                                             045800      
001456*                                                                 045900      
001457 77  R422-08-CTR-ERROR                   PIC S9(11) BINARY.       046000      
001458*************************************************************     046100      
001459*          PARAMETROS  S016_L422_CTESGRAL_B16 (09)         **     046200      
001460** CONSULTA B01CLIENTES y B16INFADICTE                     **     046300      
001461*************************************************************     046400      
001462 01  E422-09-CTR-ENTRADA.                                         046500      
001463     02  E422-09-CTR-NUMSIST           PIC 9(04) COMP.            046600      
001464     02  E422-09-CTR-NUMPASO           PIC 9(04) COMP.            046700      
001465     02  E422-09-CTA-NUMPROD           PIC 9(04) COMP.            046800      
001466     02  E422-09-CTA-CVEINST           PIC 9(04) COMP.            046900      
001467     02  E422-09-CTO-NUM.                                         047000      
001468         03  E422-09-CTA-NUMPREF       PIC 9(04) COMP.            047100      
001469         03  E422-09-CTA-NUM           PIC 9(12) COMP.            047200      
001470     02  E422-09-CTE-NUM               PIC 9(12) COMP.            047300      
001471     02  E422-09-CTR-NUMCSI            PIC 9(02) COMP.            047400      
001472     02  FILLER                        PIC X(37).                 047500      
001473*SIZE ENTRADA X(60).                                              047600      
001474*                                                                 047700      
001475  01 S422-09-CTR-SALIDA.                                          047800      
001476     02 S422-09-CTR-REGISTRO.                                     047900      
001477       03 S422-09-CTE-NUMCSI            PIC 9(02) COMP.           048000      
001478       03 S422-09-CTE-NUM               PIC 9(12) COMP.           048100      
001479       03 S422-09-CTE-INDAFIL           PIC 9(02) COMP.           048200      
001480       03 S422-09-CTA-NUMEMPDEP         PIC 9(06) COMP.           048300      
001481       03 S422-09-CTE-CVEFUENTE         PIC 9(02) COMP.           048400      
001482       03 S422-09-CTE-CVEPOTECO         PIC 9(02) COMP.           048500      
001483       03 S422-09-CTE-CVEINGRES         PIC 9(02) COMP.           048600      
001484       03 S422-09-CTE-CVEARRAIG         PIC 9(02) COMP.           048700      
001485       03 S422-09-CTE-CVEBCO1           PIC 9(02) COMP.           048800      
001486       03 S422-09-CTE-NUMPRDBCO1        PIC 9(04) COMP.           048900      
001487       03 S422-09-CTE-SDOPRDBCO1        PIC 9(16) COMP.           049000      
001488       03 S422-09-CTE-CVEBCO2           PIC 9(02) COMP.           049100      
001489       03 S422-09-CTE-NUMPRDBCO2        PIC 9(04) COMP.           049200      
001490       03 S422-09-CTE-SDOPRDBCO2        PIC 9(16) COMP.           049300      
001491       03 S422-09-CTE-CVEB03            PIC 9(02) COMP.           049400      
001492       03 S422-09-CTE-NUMPRDBCO3        PIC 9(04) COMP.           049500      
001493       03 S422-09-CTE-SDOPRDBCO3        PIC 9(16) COMP.           049600      
001494       03 S422-09-CTR-FECULTVIS-2K      PIC 9(08) COMP.           049700      
001495       03 S422-09-CTE-EDOCIVIL          PIC 9(02) COMP.           049800      
001496       03 S422-09-CTE-INGRESOS          PIC 9(08) COMP.           049900      
001497       03 S422-09-CTR-FEACIN-2K         PIC 9(08) COMP.           050000      
001498       03 S422-09-CTE-NUMDEPEND         PIC 9(02) COMP.           050100      
001499       03 S422-09-CTE-STACASA           PIC 9(02) COMP.           050200      
001500       03 S422-09-CTE-NUMAUTOS          PIC 9(02) COMP.           050300      
001501       03 S422-09-CTE-ESCOLAR           PIC 9(02) COMP.           050400      
001502       03 S422-09-CTE-FEULMO-2K         PIC 9(08) COMP.           050500      
001503       03 FILLER                        PIC X(33).                050600      
001504*SIZE SALIDA X(102).                                              050700      
001505*                                                                 050800      
001506**                                                                050900      
001507 01  S422-09-RCTR-SALIDA REDEFINES S422-09-CTR-SALIDA.            051000      
001508     03 S422-09-CTR-ERROR                 PIC 9(004) COMP.        051100      
001509     03 S422-09-CTR-ERRORTYPE             PIC 9(004) COMP.        051200      
001510     03 S422-09-CTR-STRUCTURE             PIC 9(004) COMP.        051300      
001511     03 FILLER                            PIC X(96).              051400      
001512 77  R422-09-CTR-ERROR                    PIC S9(11) BINARY.      051500      
001513*                                                                 051600      
001514**********************************************************        051700      
001515*  PARAMETROS        S016_L422_CTASGRAL_B17 (10)        **        051800      
001516*  CONSULTA B01CLIENTES y B17INFADICTA                  **        051900      
001517**********************************************************        052000      
001518 01  E422-10-CTR-ENTRADA.                                         052100      
001519     02  E422-10-CTR-NUMSIST           PIC 9(04) COMP.            052200      
001520     02  E422-10-CTR-NUMPASO           PIC 9(04) COMP.            052300      
001521     02  E422-10-CTA-NUMPROD           PIC 9(04) COMP.            052400      
001522     02  E422-10-CTA-CVEINST           PIC 9(04) COMP.            052500      
001523     02  E422-10-CTO-NUM.                                         052600      
001524         03  E422-10-CTA-NUMPREF       PIC 9(04) COMP.            052700      
001525         03  E422-10-CTA-NUM           PIC 9(12) COMP.            052800      
001526     02  E422-10-CTE-NUM               PIC 9(12) COMP.            052900      
001527     02  FILLER                        PIC X(01).                 053000      
001528     02  E422-10-CTR-NUMCSI            PIC 9(02) COMP.            053100      
001529     02  E422-10-CTA-NUMCSI            PIC 9(02) COMP.            053200      
001530     02  FILLER                        PIC X(35).                 053300      
001531*SIZE ENTRADA X(60).                                              053400      
001532*                                                                 053500      
001533  01 S422-10-CTR-SALIDA.                                          053600      
001534     02 S422-10-CTR-REGISTRO.                                     053700      
001535       03 S422-10-CTR-NUMCSI            PIC 9(02) COMP.           053800      
001536       03 S422-10-CTE-NUM               PIC 9(12) COMP.           053900      
001537       03 S422-10-CTA-NUMPROD           PIC 9(04) COMP.           054000      
001538       03 S422-10-CTA-CVEINST           PIC 9(04) COMP.           054100      
001539       03 S422-10-CTA-NUMPREF           PIC 9(04) COMP.           054200      
001540       03 S422-10-CTA-NUM               PIC 9(12) COMP.           054300      
001541       03 S422-10-CTA-CODAFIL           PIC X(12).                054400      
001542       03 S422-10-CTA-CODFONVIV         PIC X(12).                054500      
001543       03 S422-10-CTA-NUMEMPDEP         PIC 9(06) COMP.           054600      
001544       03 S422-10-CTA-CVEDISENT         PIC 9(02) COMP.           054700      
001545       03 S422-10-CTA-CVEDISSAL         PIC 9(02) COMP.           054800      
001546       03 S422-10-CTA-CVENIVRIE         PIC X(01).                054900      
001547       03 S422-10-CTA-FECUMODRI-2K      PIC 9(08) COMP.           055000      
001548       03 S422-10-CTA-CVEDESCRE         PIC 9(06) COMP.           055100      
001549       03 S422-10-CTA-CVEEMP            PIC X(03).                055200      
001550       03 S422-10-CTA-NUMPAGEMP         PIC X(09).                055300      
001551       03 S422-10-CTA-NUMCTOSAR         PIC 9(06) COMP.           055400      
001552       03 S422-10-CTA-FECULTIMP-2K      PIC 9(08) COMP.           055500      
001553       03 S422-10-CTA-FECFIRMA-2K       PIC 9(08) COMP.           055600      
001554       03 S422-10-CTA-NUMDOMGAR         PIC 9(04) COMP.           055700      
001555       03 S422-10-CTA-CVEVARTAS         PIC 9(02) COMP.           055800      
001556       03 S422-10-CTA-NUMCONVE          PIC 9(04) COMP.           055900      
001557       03 S422-10-CTA-IMPPREST          PIC 9(12)V9(02) COMP.     056000      
001558       03 S422-10-CTA-CVETIPCRE         PIC 9(02) COMP.           056100      
001559       03 S422-10-CTR-NUMENCPTE         PIC 9(14) COMP.           056200      
001560       03 S422-10-CTA-FECULMOM-2K       PIC 9(08) COMP.           056300      
001561       03 FILLER                        PIC X(77).                056400      
001562* SIZE SALIDA X(180).                                             056500      
001563 77  R422-10-CTR-ERROR                  PIC S9(11) BINARY.        056600      
001564*                                                                 056700      
001565************************************************************      056800      
001566*   PARAMETROS PARA ENTRY POINT S016_L422_NOMB (11)      ***      056900      
001567*   CONSULTA  B03NOMBRES                                 ***      057000      
001568************************************************************      057100      
001569 01  E422-11-CTR-ENTRADA.                                         057200      
001570     02  E422-11-CTR-NUMCSI              PIC 9(02) COMP.          057300      
001571*            NUMERO DEL CSI DEL QUE SE DESEA LA INFORMACION       057400      
001572*            0  = INFORMACION LOCAL                               057500      
001573*            99 = INFORMACION NACIONAL (SOLO EN VDM)              057600      
001574*            NN = INF. DEL CSI NN                                 057700      
001575     02  E422-11-CTR-NUMSIST             PIC 9(04) COMP.          057800      
001576*            NUMERO DEL SISTEMA LLAMADOR                          057900      
001577     02  E422-11-CTR-NUMPASO             PIC 9(04) COMP.          058000      
001578*            NUMERO DEL PASO LLAMADOR                             058100      
001579     02  E422-11-CTR-CLAVE.                                       058200      
001580         03  E422-11-CTE-NUM             PIC 9(12) COMP.          058300      
001581*            NUMERO DEL CLIENTE  A CONSULTAR                      058400      
001582         03  E422-11-CTR-NUMNOM          PIC 9(04) COMP.          058500      
001583*            NUMERO DE NOMBRE ADICIONAL                           058600      
001584         03  E422-11-CTE-CVETITCTE       PIC 9(02) COMP.          058700      
001585*            NUMERO DE RELACION CON EL CLIENTE                    058800      
001586*            13   REPRESENTANTE LEGAL                             058900      
001587*            14   REPRESENTANTE ADMINISTRATIVO                    059000      
001588         03  FILLER                      PIC X(46).               059100      
001589*SIZE ENTRADA X(60).                                              059200      
001590*                                                                 059300      
001591  01  S422-11-CTR-SALIDA.                                         059400      
001592     02  S422-11-CTR-REGISTRO.                                    059500      
001593         03  S422-11-CTR-NUMCSI          PIC 9(02) COMP.          059600      
001594         03  S422-11-CTE-NUM             PIC 9(12) COMP.          059700      
001595         03  S422-11-CTR-NUMNOM          PIC 9(04) COMP.          059800      
001596         03  S422-11-CTR-NOMUSOS         PIC 9(04) COMP.          059900      
001597         03  S422-11-CTE-NOMCORTO        PIC X(26).               060000      
001598         03  S422-11-CTE-CVETITCTE       PIC 9(02) COMP.          060100      
001599         03  S422-11-CTR-CVECONT         PIC 9(02) COMP.          060200      
001600         03  S422-11-CTR-FECALTNOM-2K    PIC 9(08) COMP.          060300      
001601         03  S422-11-CTR-FECMODNOM-2K    PIC 9(08) COMP.          060400      
001602         03  FILLER                      PIC X(25).               060500      
001603* SIZE SALIDA X(72)                                               060600      
001604*                                                                 060700      
001605 77  R422-11-CTR-ERROR                   PIC S9(11) BINARY.       060800      
001606*                                                                 060900      
001607*******************************************************           061000      
001608****    PARAMETROS    S016_L422_REPCTE (12)        ****           061100      
001609******  CONSULTA  B10REPCTE  COMPLETO (NUMREG E/S)  ***           061200      
001610*******************************************************           061300      
001611*  77 WKS-NUMREG-12                  PIC 9(02) COMP.              061400      
001612*                                     VALUE NN.                   061500      
001613   01 E422-12-CTR-ENTRADA.                                        061600      
001614      02 E422-12-CTR-NUMCSI          PIC 9(02) COMP.              061700      
001615* N³mero de CSI del que se desea la inf.                          061800      
001616      02 E422-12-CTR-NUMSIST         PIC 9(04) COMP.              061900      
001617* N³mero del sistema llamador.                                    062000      
001618      02 E422-12-CTR-NUMPASO         PIC 9(04) COMP.              062100      
001619* N³mero del programa llamador                                    062200      
001620      02 E422-12-CTE-NUM             PIC 9(12) COMP.              062300      
001621*N³mero de CLIENTE la informaciÿn, es obligatorio.                062400      
001622      02 E422-12-CTE-REPPIN          PIC X(06).                   062500      
001623*Clave secreta del representante si no se conoce dejar en blancos.062600      
001624      02 E422-12-CTR-NUMREG           PIC 9(02) COMP.             062700      
001625*N³mero de registros Solicitados                                  062800      
001626      02 FILLER                       PIC X(42).                  062900      
001627* SIZE ENTRADA X(60).                                             063000      
001628*                                                                 063100      
00162901  S422-12-CTR-SALIDA.                                           063200      
001630      02 S422-12-CTR-NUMREG         PIC 9(02) COMP.               063300      
001631      02 S422-12-CTR-REGISTRO  OCCURS 5 TIMES.                    063400      
001632*       02 S422-12-CTR-REGISTRO  OCCURS 1 TO 5 TIMES              063500      
001633*                           DEPENDING ON WKS-NUMREG-12.           063600      
001634           03 S422-12-CTR-NUMCSI          PIC 9(02) COMP.         063700      
001635* N³mero de CSI.                                                  063800      
001636           03 S422-12-CTE-NUM             PIC 9(12) COMP.         063900      
001637*N³mero de CLIENTE                                                064000      
001638           03 S422-12-CTE-REPPIN          PIC X(06).              064100      
001639*Clave secreta del representante                                  064200      
001640           03 S422-12-CTE-REPNOMB         PIC X(36).              064300      
001641*Nombre del representante                                         064400      
001642           03 S422-12-CTE-REPLIMITE       PIC 9(14) COMP.         064500      
001643*Limite para los movimientos                                      064600      
001644           03 S422-12-CTE-REPPRIVIL       PIC 9(02) COMP.         064700      
001645*Privilegio del representante                                     064800      
001646           03 S422-12-CTR-REPFEALTA       PIC 9(06) COMP.         064900      
001647*Fecha de alta del representante  AAMMDD                          065000      
001648           03 S422-12-CTR-REPFEMOD        PIC 9(06) COMP.         065100      
001649*Fecha de modificacion  AAMMDD                                    065200      
001650           03 S422-12-CTR-FEALRE-2K       PIC 9(08) COMP.         065300      
001651*Fecha de alta del representante  AAAAMMDD                        065400      
001652           03 S422-12-CTR-FEMORE-2K       PIC 9(08) COMP.         065500      
001653*Fecha de modificacion  AAAAMMDD                                  065600      
001654           03  FILLER                      PIC X(12).             065700      
001655*SIZE SALIDA X(84)                                                065800      
001656*                                                                 065900      
001657*                                                                 066000      
001658      77 R422-12-CTR-ERROR       PIC S9(11) BINARY.               066100      
001659*                                                                 066200      
001660************************************************************      066300      
001661****    PARAMETROS    S016_L422_S500_02 (15)            ****      066400      
001662**** CONSULTA B08MEDIOS, B04CUENTAS, B01CLIENTES          **      066500      
001663****          Y B17INFADICTA CON OPCION = 1               **      066600      
001664************************************************************      066700      
001665 01  E422-15-CTR-ENTRADA.                                         066800      
001666     02  E422-15-CTR-NUMSIST         PIC 9(04) COMP.              066900      
001667     02  E422-15-CTR-NUMPASO         PIC 9(04) COMP.              067000      
001668     02  E422-15-CTA-NUMPROD         PIC 9(04) COMP.              067100      
001669     02  E422-15-CTA-CVEINST         PIC 9(04) COMP.              067200      
001670     02  E422-15-CTO-NUM.                                         067300      
001671         03  E422-15-CTA-NUMPREF     PIC 9(04) COMP.              067400      
001672         03  E422-15-CTA-NUM         PIC 9(12) COMP.              067500      
001673     02  E422-15-OPCION              PIC 9(02) COMP.              067600      
001674     02  E422-15-CTR-NUMCSI          PIC 9(02) COMP.              067700      
001675     02  FILLER                      PIC X(42).                   067800      
001676* SIZE ENTRADA X(60).                                             067900      
001677 01  S422-15-CTR-SALIDA.                                          068000      
001678     02 S422-15-CTR-REGISTRO.                                     068100      
001679        03 S422-15-CTA-NUMPROD         PIC 9(04) COMP.            068200      
001680        03 S422-15-CTA-CVEINST         PIC 9(04) COMP.            068300      
001681        03 S422-15-CTA-NUMSUC          PIC 9(04) COMP.            068400      
001682        03 S422-15-CTE-CVEPERS         PIC 9(02) COMP.            068500      
001683        03 S422-15-CTE-CVESECTOR       PIC 9(02) COMP.            068600      
001684        03 S422-15-CTE-CVETIPO         PIC 9(02) COMP.            068700      
001685        03 S422-15-CTE-ACTBNM          PIC 9(06) COMP.            068800      
001686        03 S422-15-CTA-CVEMON          PIC 9(02) COMP.            068900      
001687        03 S422-15-CTE-NOMBRE          PIC X(55).                 069000      
001688        03 S422-15-CTE-CVESOCFUN       PIC 9(02) COMP.            069100      
001689        03 S422-15-CTE-CVEPERBCO       PIC 9(02) COMP.            069200      
001690        03 S422-15-CTE-NUM             PIC 9(12) COMP.            069300      
001691        03 S422-15-CTA-CVESTATUS       PIC 9(02) COMP.            069400      
001692        03 S422-15-CTE-CODRFC.                                    069500      
001693           04 S422-15-CTE-CODINI       PIC X(04).                 069600      
001694           04 S422-15-CTE-FECNAC       PIC 9(06) COMP.            069700      
001695           04 S422-15-CTE-CODHOM       PIC X(05).                 069800      
001696        03 S422-15-CTA-CVEUSO          PIC 9(02) COMP.            069900      
001697        03 S422-15-CTA-CVEMANEJO       PIC 9(02) COMP.            070000      
001698* INFORMACION ADICIONAL DE LA CUENTA                              070100      
001699        03 S422-15-INFADICTA.                                     070200      
001700           04 S422-15-FECONSTIT-2K     PIC 9(08) COMP.            070300      
001701           04 S422-15-FEPODER-2K       PIC 9(08) COMP.            070400      
001702           04 S422-15-FEDICJURI-2K     PIC 9(08) COMP.            070500      
001703* LA INFORMACION ADICIONAL DE LA CUENTA SE ENTREGARA SOLO         070600      
001704*  CUANDO EL PARAMETRO DE ENTRADA E422-15-OPCION = 1              070700      
001705* VER MANUAL DE OPERACI¿N.                                        070800      
001706        03 S422-15-CTR-NUMCSI          PIC 9(02) COMP.            070900      
001707        03 S422-15-CTA-DIACORTE        PIC 9(02) COMP.            071000      
001708        03 S422-15-CTA-CVEENVIO        PIC 9(04) COMP.            071100      
001709        03 S422-15-CTA-EDIEDOCTA       PIC 9(02) COMP.            071200      
001710        03 S422-15-CTA-DISEDOCTA       PIC 9(02) COMP.            071300      
001711        03 S422-15-CTA-CVENIVRIE       PIC X(01).                 071400      
001712        03 S422-15-CTR-USOEJECTA       PIC 9(04) COMP.            071500      
001713        03 S422-15-CTR-USOSCTE         PIC 9(04) COMP.            071600      
001714        03 S422-15-CTA-VENDNOMI        PIC 9(10) COMP.            071700      
001715        03 S422-15-CTA-VENDSUC         PIC 9(04) COMP.            071800      
001716        03 S422-15-CTA-REFENOMI        PIC 9(10) COMP.            071900      
001717        03 S422-15-CTA-REFECVE         PIC 9(02) COMP.            072000      
001718        03 S422-15-CTA-PREVNOMI        PIC 9(10) COMP.            072100      
001719        03 S422-15-CTA-PREVSUC         PIC 9(04) COMP.            072200      
001720        03 S422-15-CTA-PREVIMP         PIC 9(14) COMP.            072300      
001721        03 S422-15-CTA-RESTRIC         PIC 9(02) COMP.            072400      
001722        03 S422-15-CTA-RESTCON         PIC 9(02) COMP.            072500      
001723        03 S422-15-CTA-OPCPAGO         PIC 9(02) COMP.            072600      
001724        03 S422-15-CTA-RGOPAGO         PIC 9(02) COMP.            072700      
001725        03 S422-15-CTA-RETIMP          PIC 9(02) COMP.            072800      
001726        03 S422-15-CTA-FECPREV         PIC 9(06) COMP.            072900      
001727        03 S422-15-CTA-FECAPER-2K      PIC 9(08) COMP.            073000      
001728        03 S422-15-CTA-FECULTMOD-2K    PIC 9(08) COMP.            073100      
001729        03 S422-15-CTA-FECCANCEL-2K    PIC 9(08) COMP.            073200      
001730        03 S422-15-CTA-FECRENOVA-2K    PIC 9(08) COMP.            073300      
001731        03 S422-15-CTA-SITUACION       PIC X(04).                 073400      
001732*  CONTRATO                                                       073500      
001733        03 S422-15-CTA-NUMPREF         PIC 9(04) COMP.            073600      
001734        03 S422-15-CTA-NUM             PIC 9(12) COMP.            073700      
001735*  MEDIO DE ACCESO                                                073800      
001736        03 S422-15-MDA-CTENUM          PIC 9(12) COMP.            073900      
001737        03 S422-15-MDA-CVETIPO         PIC 9(02) COMP.            074000      
001738        03 S422-15-MDA-SUBTIPO         PIC 9(02) COMP.            074100      
001739        03 S422-15-MDA-CVETIT          PIC 9(02) COMP.            074200      
001740        03 S422-15-MDA-NUMPREF         PIC 9(04) COMP.            074300      
001741        03 S422-15-MDA-NUM             PIC 9(12) COMP.            074400      
001742        03 S422-15-MDA-ABRPROFT        PIC X(03).                 074500      
001743        03 S422-15-MDA-PTRNOMT         PIC 9(04) COMP.            074600      
001744        03 S422-15-MDA-ABRPROFC        PIC X(03).                 074700      
001745        03 S422-15-MDA-PTRNOMC         PIC 9(04) COMP.            074800      
001746        03 S422-15-MDA-NUMTALON        PIC 9(02) COMP.            074900      
001747        03 S422-15-MDA-CHQXTALON       PIC 9(02) COMP.            075000      
001748        03 S422-15-MDA-CVESTATUS       PIC 9(02) COMP.            075100      
001749        03 S422-15-MDA-FECALTA-2K      PIC 9(08) COMP.            075200      
001750        03 S422-15-MDA-FECULTMOD-2K    PIC 9(08) COMP.            075300      
001751        03 S422-15-MDA-FECULTACC-2K    PIC 9(08) COMP.            075400      
001752        03 S422-15-MDA-FECVENC-2K      PIC 9(08) COMP.            075500      
001753        03 S422-15-MDA-FECCANCEL-2K    PIC 9(08) COMP.            075600      
001754        03 S422-15-MDA-FECPREV         PIC 9(06) COMP.            075700      
001755        03 S422-15-MDA-HHPREV          PIC 9(04) COMP.            075800      
001756        03 S422-15-MDA-HHALTA          PIC 9(04) COMP.            075900      
001757        03 S422-15-MDA-HHULTMOD        PIC 9(04) COMP.            076000      
001758        03 S422-15-MDA-HHULTACC        PIC 9(04) COMP.            076100      
001759        03 S422-15-MDA-HHVENC          PIC 9(04) COMP.            076200      
001760        03 S422-15-MDA-PERIODO         PIC 9(02) COMP.            076300      
001761        03 S422-15-MDA-SITUACION       PIC X(04).                 076400      
001762* CAMPO DEL CLIENTE                                               076500      
001763        03 S422-15-CTE-CAEB            PIC 9(06) COMP.            076600      
001764        03 S422-15-CTE-CVESEXO         PIC 9(02) COMP.            076700      
001765*NTT-AYN-B NO EXISTIA ESTE TEF Y SI LO TRABAJA LA L422            076720      
001766        03 S422-15-CTA-TEF             PIC 9(16) COMP.            076740      
001767        03 S422-15-CTA-ACT             PIC 9(02) COMP.            076760      
001768        03 FILLER                      PIC X(24).                 076800      
001769*NTT.AYN-E                                                        076850      
001770*               SIZE SALIDA X(282).                               076900      
001771 77  R422-15-CTR-ERROR                 PIC S9(11) BINARY.         077000      
001772                                                                  077100      
001773*************************************************************     077200      
001774***PARAMETROS          S016_L422_CTRLCAM (16)         *******     077300      
001775*************************************************************     077400      
001776*                        existe en el archivo de parametros  *    077500      
001777*                        pero no existe el codigo          **     077600      
001778*                        CUENTA CON DOCUMENTACION         ***     077700      
001779*************************************************************     077800      
001780 01  E422-16-CTR-ENTRADA.                                         077900      
001781     02  E422-16-CTR-NUMSIST         PIC 9(04) COMP.              078000      
001782     02  E422-16-CTR-NUMPASO         PIC 9(04) COMP.              078100      
001783     02  E422-16-CTA-NUMPROD         PIC 9(04) COMP.              078200      
001784     02  E422-16-CTA-CVEINST         PIC 9(04) COMP.              078300      
001785     02  E422-16-CTA-NUMPREF         PIC 9(04) COMP.              078400      
001786     02  E422-16-CTA-NUM             PIC 9(12) COMP.              078500      
001787     02  E422-16-CTE-NUM             PIC 9(12) COMP.              078600      
001788     02  E422-16-CTR-NUMCSI          PIC 9(02) COMP.              078700      
001789     02  E422-16-CTR-NUMREG-IN       PIC 9(02) COMP.              078800      
001790     02  E422-16-CTR-NUMDS           PIC 9(02) COMP.              078900      
001791     02  E422-16-CTR-NUMCAMPO        PIC 9(02) COMP.              079000      
001792     02  E422-16-CTR-FECULTMOD-2K    PIC 9(08) COMP.              079100      
001793     02  E422-16-CTR-FECINI-2K       PIC 9(08) COMP.              079200      
001794     02  E422-16-CTR-FECFIN-2K       PIC 9(08) COMP.              079300      
001795****                                                              079400      
001796 01 S422-16-CTR-SALIDA.                                           079500      
001797    02 S422-16-CTR-NUMREG-OU         PIC 9(02) COMP.              079600      
001798    02 S422-16-CTR-REGISTRO OCCURS 99 TIMES.                      079700      
001799       03 S422-16-CTR-NUMCSI              PIC 9(02) COMP.         079800      
001800       03 S422-16-CTE-NUM                 PIC 9(12) COMP.         079900      
001801       03 S422-16-CTA-NUMPROD             PIC 9(04) COMP.         080000      
001802       03 S422-16-CTA-CVEINST             PIC 9(04) COMP.         080100      
001803       03 S422-16-CTA-NUMPREF             PIC 9(04) COMP.         080200      
001804       03 S422-16-CTA-NUM                 PIC 9(12) COMP.         080300      
001805       03 S422-16-CTR-NUMDS               PIC 9(02) COMP.         080400      
001806       03 S422-16-CTR-NUMCAMPO            PIC 9(02) COMP.         080500      
001807       03 S422-16-CTR-DATOANT             PIC X(15).              080600      
001808       03 S422-16-CTR-FECULTMOD-2K        PIC 9(08) COMP.         080700      
001809       03 S422-16-CTR-NUMSUC              PIC 9(04) COMP.         080800      
001810       03 S422-16-CTR-NUMNOMI             PIC 9(10) COMP.         080900      
001811*                                                                 081000      
001812 77  R422-16-CTR-ERROR                    PIC S9(11) BINARY.      081100      
001813*************************************************************     081200      
001814**** PARAMETROS         S016_L422_NUMDOM (17)              **     081300      
001815*    CONSULTA B02DOMICILIOS MULTIPE NUMREG (E/S)           **     081400      
001816*************************************************************     081500      
001817 01  E422-17-CTR-ENTRADA.                                         081600      
001818     02  E422-17-CTR-NUMCSI          PIC 9(02) COMP.              081700      
001819     02  E422-17-CTR-NUMSIST         PIC 9(04) COMP.              081800      
001820     02  E422-17-CTR-NUMPASO         PIC 9(04) COMP.              081900      
001821     02  E422-17-CTE-NUM             PIC 9(12) COMP.              082000      
001822     02  E422-17-CTR-NUMDOM          PIC 9(04) COMP.              082100      
001823     02  E422-17-CTR-NUMREG-IN       PIC 9(02) COMP.              082200      
001824     02  E422-17-CTR-OPCION          PIC 9(02) COMP.              082300      
001825     02  FILLER                      PIC X(45).                   082400      
001826* SIZE ENTRADA X(60).                                             082500      
001827 01 S422-17-CTR-SALIDA.                                           082600      
001828     02 S422-17-CTR-NUMREG-OU           PIC 9(02) COMP.           082700      
001829     02 S422-17-CTR-REGISTRO OCCURS 30 TIMES.                     082800      
001830        03 S422-17-CTR-NUMCSI              PIC 9(02) COMP.        082900      
001831        03 S422-17-CTE-NUM                 PIC 9(12) COMP.        083000      
001832        03 S422-17-CTR-NUMDOM              PIC 9(04) COMP.        083100      
001833        03 S422-17-CTR-DOMUSOS             PIC 9(04) COMP.        083200      
001834        03 S422-17-CTE-CALLENUM            PIC X(36).             083300      
001835        03 S422-17-CTE-NOMCOL              PIC X(24).             083400      
001836        03 S422-17-CTE-NOMPOB              PIC X(20).             083500      
001837        03 S422-17-CTE-CVEEDO              PIC 9(02) COMP.        083600      
001838        03 S422-17-CTE-NUMCP               PIC 9(06) COMP.        083700      
001839        03 S422-17-CTE-NUMTEL              PIC 9(10) COMP.        083800      
001840        03 S422-17-CTE-NUMTELEXT           PIC 9(06) COMP.        083900      
001841        03 S422-17-CTE-CVETEL              PIC 9(02) COMP.        084000      
001842        03 S422-17-CTE-NUMTEL2             PIC 9(10) COMP.        084100      
001843        03 S422-17-CTE-NUMTELEX2           PIC 9(06) COMP.        084200      
001844        03 S422-17-CTE-CVETEL2             PIC 9(02) COMP.        084300      
001845        03 S422-17-CTE-CVESTADOM           PIC 9(02) COMP.        084400      
001846        03 S422-17-CTE-CVEDOM              PIC 9(02) COMP.        084500      
001847        03 S422-17-CTE-CVEAGEN             PIC X(04).             084600      
001848        03 S422-17-CTE-APDO                PIC X(08).             084700      
001849        03 S422-17-CTR-NUMCSIDOM           PIC 9(02) COMP.        084800      
001850        03 S422-17-CTR-FECALTDOM-2K        PIC 9(08) COMP.        084900      
001851        03 S422-17-CTR-FECMODDOM-2K        PIC 9(08) COMP.        085000      
001852        03 FILLER                          PIC X(08).             085100      
001853*      size reg OCCURS X(144)                                     085200      
001854* size SALIDA = 1+(144*30) = 4321                                 085300      
001855*                                                                 085400      
001856 77  R422-17-CTR-ERROR                  PIC S9(11) BINARY.        085500      
001857*********************************************************         085600      
001858****PARAMETROS  S016_L422_MED_ACC_SEQ (18)           ****         085700      
001859**  CONSULTA B08MEDIOS MULTIPLE NUMREG E/S           ****         085800      
001860*********************************************************         085900      
001861 01  E422-18-CTR-ENTRADA.                                         086000      
001862     02  E422-18-CTR-NUMSIST         PIC 9(04) COMP.              086100      
001863     02  E422-18-CTR-NUMPASO         PIC 9(04) COMP.              086200      
001864     02  E422-18-MDA-NUMPREF         PIC 9(04) COMP.              086300      
001865     02  E422-18-MDA-NUM             PIC 9(12) COMP.              086400      
001866     02  E422-18-CTR-NUMREG-IN       PIC 9(02) COMP.              086500      
001867     02  FILLER                      PIC X(47).                   086600      
001868* SIZE ENTRADA X(60).                                             086700      
001869 01 S422-18-CTR-SALIDA.                                           086800      
001870     02 S422-18-CTR-NUMREG-OU           PIC 9(02) COMP.           086900      
001871     02 S422-18-CTR-REGISTRO OCCURS 30 TIMES.                     087000      
001872        03 S422-18-CTR-NUMCSI              PIC 9(02) COMP.        087100      
001873        03 S422-18-CTE-NUM                 PIC 9(12) COMP.        087200      
001874        03 S422-18-CTA-NUMPROD             PIC 9(04) COMP.        087300      
001875        03 S422-18-CTA-CVEINST             PIC 9(02) COMP.        087400      
001876        03 S422-18-CTA-NUMPREF             PIC 9(04) COMP.        087500      
001877        03 S422-18-CTA-NUM                 PIC 9(12) COMP.        087600      
001878        03 S422-18-MDA-CVETIPO             PIC 9(02) COMP.        087700      
001879        03 S422-18-MDA-SUBTIPO             PIC 9(02) COMP.        087800      
001880        03 S422-18-MDA-CVETIT              PIC 9(02) COMP.        087900      
001881        03 S422-18-MDA-NUMPREF             PIC 9(04) COMP.        088000      
001882        03 S422-18-MDA-NUM                 PIC 9(12) COMP.        088100      
001883        03 S422-18-MDA-ABRPROFT            PIC X(03).             088200      
001884        03 S422-18-CTR-PTRNOMT             PIC 9(04) COMP.        088300      
001885        03 S422-18-MDA-ABRPROFC            PIC X(03).             088400      
001886        03 S422-18-CTR-PTRNOMC             PIC 9(04) COMP.        088500      
001887        03 S422-18-MDA-NUMTALON            PIC 9(02) COMP.        088600      
001888        03 S422-18-MDA-CHQXTALON           PIC 9(02) COMP.        088700      
001889        03 S422-18-MDA-CVESTATUS           PIC 9(02) COMP.        088800      
001890        03 S422-18-MDA-FECALTA-2K          PIC 9(08) COMP.        088900      
001891        03 S422-18-MDA-FECULTMOD-2K        PIC 9(08) COMP.        089000      
001892        03 S422-18-MDA-FECVENC-2K          PIC 9(08) COMP.        089100      
001893        03 S422-18-MDA-FECCANCEL-2K        PIC 9(08) COMP.        089200      
001894        03 S422-18-MDA-FECPREV             PIC 9(06) COMP.        089300      
001895        03 S422-18-MDA-HHPREV              PIC 9(04) COMP.        089400      
001896        03 S422-18-MDA-HHALTA              PIC 9(04) COMP.        089500      
001897        03 S422-18-MDA-HHULTMOD            PIC 9(04) COMP.        089600      
001898        03 S422-18-MDA-HHULTACC            PIC 9(04) COMP.        089700      
001899        03 S422-18-MDA-HHVENC              PIC 9(04) COMP.        089800      
001900        03 S422-18-MDA-PERIODO             PIC 9(02) COMP.        089900      
001901        03 S422-18-MDA-SITUACION           PIC X(04).             090000      
001902        03 FILLER                          PIC X(08).             090100      
001903*      size reg OCCURS X(84)                                      090200      
001904*      size SALIDA = 1+(84*30) = 2521                             090300      
001905*                                                                 090400      
001906 77  R422-18-CTR-ERROR                  PIC S9(11) BINARY.        090500      
001907*********************************************************         090600      
001908***   PARAMETROS  S016_L422_EMPRESAS (19)           *****         090700      
001909***   CONSULTA B01CUENTAS, B04CUENTAS, B21EMPRESAS     **         090800      
001910**    le falta AL CODIGO llenar los datos de           **         090900      
001911***   LOS DATOS DEL CLIENTE PERTENECIENTE AL PROGRAMA  **         091000      
001912***    FINAPE B23                                      **         091100      
001913*********************************************************         091200      
001914 01  E422-19-CTR-ENTRADA.                                         091300      
001915     02  E422-19-CTR-NUMSIST         PIC 9(04) COMP.              091400      
001916     02  E422-19-CTR-NUMPASO         PIC 9(04) COMP.              091500      
001917     02  E422-19-CTA-NUMPROD         PIC 9(04) COMP.              091600      
001918     02  E422-19-CTA-CVEINST         PIC 9(04) COMP.              091700      
001919     02  E422-19-CTO-NUM.                                         091800      
001920         03  E422-19-CTA-NUMPREF     PIC 9(04) COMP.              091900      
001921         03  E422-19-CTA-NUM         PIC 9(12) COMP.              092000      
001922     02  E422-19-CTE-NUM             PIC 9(12) COMP.              092100      
001923     02  E422-19-CTE-CODINI          PIC X(04).                   092200      
001924     02  E422-19-CTE-FECNAC          PIC 9(06) COMP.              092300      
001925     02  E422-19-CTE-CODHOM          PIC X(05).                   092400      
001926     02  FILLER                      PIC X(26).                   092500      
001927* SIZE SALIDA X(60)                                               092600      
001928 01  S422-19-CTR-SALIDA.                                          092700      
001929     02 S422-19-CTR-REGISTRO.                                     092800      
001930        03 S422-19-CTA-NUMPROD         PIC 9(04) COMP.            092900      
001931        03 S422-19-CTA-CVEINST         PIC 9(04) COMP.            093000      
001932        03 S422-19-CTA-NUMSUC          PIC 9(04) COMP.            093100      
001933        03 S422-19-CTE-CVEPERS         PIC 9(02) COMP.            093200      
001934        03 S422-19-CTE-CVESECTOR       PIC 9(02) COMP.            093300      
001935        03 S422-19-CTE-CVETIPO         PIC 9(02) COMP.            093400      
001936        03 S422-19-CTE-ACTBNM          PIC 9(06) COMP.            093500      
001937        03 S422-19-CTA-CVEMON          PIC 9(02) COMP.            093600      
001938        03 S422-19-CTE-NOMBRE          PIC X(55).                 093700      
001939        03 S422-19-CTE-CVESOCFUN       PIC 9(02) COMP.            093800      
001940        03 S422-19-CTE-CVEPERBCO       PIC 9(02) COMP.            093900      
001941        03 S422-19-CTE-NUM             PIC 9(12) COMP.            094000      
001942        03 S422-19-CTA-CVESTATUS       PIC 9(02) COMP.            094100      
001943        03 S422-19-CTE-CODRFC.                                    094200      
001944           04 S422-19-CTE-CODINI       PIC X(04).                 094300      
001945           04 S422-19-CTE-FECNAC       PIC 9(06) COMP.            094400      
001946           04 S422-19-CTE-CODHOM       PIC X(05).                 094500      
001947        03 S422-19-CTA-CVEUSO          PIC 9(02) COMP.            094600      
001948        03 S422-19-CTA-CVEMANEJO       PIC 9(02) COMP.            094700      
001949        03 S422-19-INFADICTA.                                     094800      
001950           04 S422-19-FECONSTIT-2K     PIC 9(08) COMP.            094900      
001951           04 S422-19-FEPODER-2K       PIC 9(08) COMP.            095000      
001952           04 S422-19-FEDICJURI-2K     PIC 9(08) COMP.            095100      
001953        03 S422-19-CTR-NUMCSI          PIC 9(02) COMP.            095200      
001954        03 S422-19-CTA-DIACORTE        PIC 9(02) COMP.            095300      
001955        03 S422-19-CTA-CVEENVIO        PIC 9(04) COMP.            095400      
001956        03 S422-19-CTA-EDIEDOCTA       PIC 9(02) COMP.            095500      
001957        03 S422-19-CTA-DISEDOCTA       PIC 9(02) COMP.            095600      
001958        03 S422-19-CTA-CVENIVRIE       PIC X(01).                 095700      
001959        03 S422-19-CTR-USOEJECTA       PIC 9(04) COMP.            095800      
001960        03 S422-19-CTR-USOSCTE         PIC 9(04) COMP.            095900      
001961        03 S422-19-CTA-VENDNOMI        PIC 9(10) COMP.            096000      
001962        03 S422-19-CTA-VENDSUC         PIC 9(04) COMP.            096100      
001963        03 S422-19-CTA-REFENOMI        PIC 9(10) COMP.            096200      
001964        03 S422-19-CTA-REFECVE         PIC 9(02) COMP.            096300      
001965        03 S422-19-CTA-PREVNOMI        PIC 9(10) COMP.            096400      
001966        03 S422-19-CTA-PREVSUC         PIC 9(04) COMP.            096500      
001967        03 S422-19-CTA-PREVIMP         PIC 9(14) COMP.            096600      
001968        03 S422-19-CTA-RESTRIC         PIC 9(02) COMP.            096700      
001969        03 S422-19-CTA-RESTCON         PIC 9(02) COMP.            096800      
001970        03 S422-19-CTA-OPCPAGO         PIC 9(02) COMP.            096900      
001971        03 S422-19-CTA-RGOPAGO         PIC 9(02) COMP.            097000      
001972        03 S422-19-CTA-RETIMP          PIC 9(02) COMP.            097100      
001973        03 S422-19-CTA-FECPREV         PIC 9(06) COMP.            097200      
001974        03 S422-19-CTA-FECAPER-2K      PIC 9(08) COMP.            097300      
001975        03 S422-19-CTA-FECULTMOD-2K    PIC 9(08) COMP.            097400      
001976        03 S422-19-CTA-FECCANCEL-2K    PIC 9(08) COMP.            097500      
001977        03 S422-19-CTA-FECRENOVA-2K    PIC 9(08) COMP.            097600      
001978        03 S422-19-CTA-SITUACION       PIC X(04).                 097700      
001979        03 S422-19-CTA-NUMPREF         PIC 9(04) COMP.            097800      
001980        03 S422-19-CTA-NUM             PIC 9(12) COMP.            097900      
001981*LOS DATOS DEL CLIENTE PERTENECIENTE AL PROGRAMA FINAPE           098000      
001982**    le falta AL CODIGO llenar los datos de                      098100      
001983***   LOS DATOS DEL CLIENTE PERTENECIENTE AL PROGRAMA             098200      
001984***    FINAPE B23                                                 098300      
001985        03 S422-19-CTE-NUMFINAPE       PIC 9(12) COMP.            098400      
001986        03 S422-19-CTE-CODINI-FINAPE   PIC X(04).                 098500      
001987        03 S422-19-CTE-FECNAC-FINAPE   PIC 9(06) COMP.            098600      
001988        03 S422-19-CTE-CODHOM-FINAPE   PIC X(05).                 098700      
001989        03 S422-19-CTE-SWIFT           PIC X(11).                 098800      
001990        03 S422-19-CTE-TELEX           PIC X(33).                 098900      
001991        03 S422-19-CTE-NUMVENC         PIC 9(02) COMP.            099000      
001992        03 S422-19-CTE-FINAPE.                                    099100      
001993           05 S422-19-FIN-CVEDESC      PIC 9(04)V9(04) COMP.      099200      
001994           05 S422-19-FIN-CVEGOBI      PIC 9(04)V9(04) COMP.      099300      
001995           05 S422-19-FIN-CVEBANC      PIC 9(04)V9(04) COMP.      099400      
001996           05 S422-19-FIN-CVECOND      PIC 9(04)V9(04) COMP.      099500      
001997        03 S422-19-CTE-RIEBNM          PIC X(02).                 099600      
001998        03 S422-19-CTE-RIEBM           PIC X(02).                 099700      
001999        03 S422-19-CTE-VENTAS          PIC 9(14) COMP.            099800      
002000        03 S422-19-CTE-FECALTA         PIC 9(08) COMP.            099900      
002001        03 S422-19-CTE-FEULTMOD        PIC 9(08) COMP.            100000      
002002        03 S422-19-CTE-CAEB            PIC 9(06) COMP.            100100      
002003        03 S422-19-CTE-CVESEXO         PIC 9(02) COMP.            100200      
002004* HASTA AQUæ SE OBTIENE LA INFORMACION.                           100300      
002005        03 FILLER                      PIC X(51).                 100400      
002006*SIZE SALIDA X(330).                                              100500      
002007* PENDIENTE DE OBTENER SE DEJA PARA UN FUTURO:                    100600      
002008*        03 S422-19-CTE-CALIF   OCCURS  6 TIMES.                  100700      
002009*           05 S422-19-CTE-ACUM         PIC 9(04) COMP.           100800      
002010*           05 S422-19-CTE-INMED        PIC 9(04) COMP.           100900      
002011*        03 S422-19-CTE-MONVEN          PIC 9(12) COMP.           101000      
002012*        03 S422-19-CTE-SALDO-JUNIO     PIC 9(12) COMP.           101100      
002013*        03 S422-19-CTE-SALDO-JULIO     PIC 9(12) COMP.           101200      
002014*        03 S422-19-CTE-FECSUSP         PIC 9(08) COMP.           101300      
002015*        03 S422-19-CTE-STAFIN          PIC 9(02) COMP.           101400      
002016*        03 S422-19-CTE-FOPYME-TASA.                              101500      
002017*           05 S422-19-FOPT-CVEDESC     PIC 9(04)V9(04) COMP.     101600      
002018*           05 S422-19-FOPT-CVEGOBI     PIC 9(04)V9(04) COMP.     101700      
002019*           05 S422-19-FOPT-CVEBANC     PIC 9(04)V9(04) COMP.     101800      
002020*           05 S422-19-FOPT-CVECOND     PIC 9(04)V9(04) COMP.     101900      
002021*        03 S422-19-CTE-FOPYME-PAGO.                              102000      
002022*           05 S422-19-FOPP-CVEDESC     PIC 9(04)V9(04) COMP.     102100      
002023*           05 S422-19-FOPP-CVEGOBI     PIC 9(04)V9(04) COMP.     102200      
002024*           05 S422-19-FOPP-CVEBANC     PIC 9(04)V9(04) COMP.     102300      
002025*           05 S422-19-FOPP-CVECOND     PIC 9(04)V9(04) COMP.     102400      
002026*                                                                 102500      
002027*                                                                 102600      
002028   77  R422-19-CTR-ERROR                 PIC S9(11) BINARY.       102700      
002029*                                                                 102800      
002030************************************************************      102900      
002031**** PARAMETROS DEL ENTRY POINT S016_L422_CONS_XMEDIO (20)**      103000      
002032**** CONSULTA DE CUENTAS POR MEDIOS DE ACCESO             **      103100      
002033****          B08MEDIOS B04PRODS                          **      103200      
002034************************************************************      103300      
002035  01  E422-20-CTR-ENTRADA.                                        103400      
002036     02 E422-20-MDA-NUMPREF         PIC 9(04) COMP.               103500      
002037     02 E422-20-MDA-NUM             PIC 9(12) COMP.               103600      
002038* SIZE ENTRADA X(16)                                              103700      
002039  01  S422-20-CTR-SALIDA.                                         103800      
002040     02 S422-20-CTE-NUM         PIC 9(12) COMP.                   103900      
002041     02 S422-20-CTA-CVESTATUS   PIC 9(02) COMP.                   104000      
002042     02 S422-20-CTA-CVEMONEDA   PIC 9(02) COMP.                   104100      
002043     02 S422-20-MDA-CVESTATUS   PIC 9(02) COMP.                   104200      
002044     02 S422-20-CTA-NUMPROD-M   PIC 9(04) COMP.                   104300      
002045     02 S422-20-CTA-CVEINST-M   PIC 9(02) COMP.                   104400      
002046     02 S422-20-MDA-NUMPREF-M   PIC 9(04) COMP.                   104500      
002047     02 S422-20-MDA-NUM-M       PIC 9(12) COMP.                   104600      
002048     02 S422-20-CTA-NUMPROD-C   PIC 9(04) COMP.                   104700      
002049     02 S422-20-CTA-CVEINST-C   PIC 9(02) COMP.                   104800      
002050     02 S422-20-CTA-NUMPREF-C   PIC 9(04) COMP.                   104900      
002051     02 S422-20-CTA-NUM-C       PIC 9(12) COMP.                   105000      
002052* SIZE SALIDA  X(62)                                              105100      
002053                                                                  105200      
002054 77  R422-20-CTR-ERROR               PIC S9(11) BINARY.           105300      
002055******************************************************************105400      
002056*****    PARAMETROS PARA EL ENTRY POINT BUSCA CUENTA-EJE     *****105500      
002057*****    S016-L422-CTARELACIONADA (E422_60_CTR_ENTRADA,      *****105600      
002058*****    E422_60_CTR_SALIDA)                       (60)      *****105700      
002059*****    PROCEDIMIENTO DE TIPO ENTERO.                        ****105800      
002060*****    CONSULTA B04CUENTAS, B07CTACTA CON OPCION           *****105900      
002061******************************************************************106000      
002062 01  E422-60-CTR-ENTRADA.                                         106100      
002063     02  E422-60-CTA-NUMPROD         PIC 9(04) COMP.              106200      
002064     02  E422-60-CTA-CVEINST         PIC 9(04) COMP.              106300      
002065     02  E422-60-CTO-NUM.                                         106400      
002066         03  E422-60-CTA-NUMPREF     PIC 9(04) COMP.              106500      
002067         03  E422-60-CTA-NUM         PIC 9(12) COMP.              106600      
002068     02  E422-60-CTR-CVERELCTA       PIC 9(02) COMP.              106700      
002069     02  E422-60-OPCION              PIC 9(02) COMP.              106800      
002070     02  FILLER                      PIC X(46).                   106900      
002071* SIZE ENTRADA X(60).                                             107000      
002072 01  S422-60-CTR-SALIDA.                                          107100      
002073     02 S422-60-CTR-REGISTRO.                                     107200      
002074        03 S422-60-CTR-ERR.                                       107300      
002075           04 S422-60-CTR-ERROR        PIC 9(04) COMP.            107400      
002076           04 S422-60-CTR-ERRORTIPO    PIC 9(04) COMP.            107500      
002077           04 S422-60-CTR-ESTRUCTURA   PIC 9(04) COMP.            107600      
002078        03 S422-60-CTR-NUMCSI          PIC 9(02) COMP.            107700      
002079        03 S422-60-CTA-NUMPROD         PIC 9(04) COMP.            107800      
002080        03 S422-60-CTA-CVEINST         PIC 9(02) COMP.            107900      
002081        03 S422-60-CTA-NUMSUC          PIC 9(04) COMP.            108000      
002082        03 S422-60-CTA-NUMCTO.                                    108100      
002083           04 S422-60-CTA-NUMPREF      PIC 9(04) COMP.            108200      
002084           04 S422-60-CTA-NUM          PIC 9(12) COMP.            108300      
002085        03 S422-60-CTE-NUM             PIC 9(12) COMP.            108400      
002086        03 S422-60-CTA-DIACORTE        PIC 9(02) COMP.            108500      
002087        03 S422-60-CTA-CVEMONEDA       PIC 9(02) COMP.            108600      
002088        03 S422-60-CTA-CVESTATUS       PIC 9(02) COMP.            108700      
002089        03 S422-60-CTA-CVEENVIO        PIC 9(04) COMP.            108800      
002090        03 S422-60-CTA-CVEMANEJO       PIC 9(02) COMP.            108900      
002091        03 S422-60-CTA-CVEUSO          PIC 9(02) COMP.            109000      
002092        03 S422-60-CTR-USOEJECTA       PIC 9(04) COMP.            109100      
002093        03 S422-60-CTA-RESTRIC         PIC 9(02) COMP.            109200      
002094        03 S422-60-CTA-RESTCON         PIC 9(02) COMP.            109300      
002095        03 S422-60-CTA-OPCPAGO         PIC 9(02) COMP.            109400      
002096        03 S422-60-CTA-RGOPAGO         PIC 9(02) COMP.            109500      
002097        03 S422-60-CTA-RETIMP          PIC 9(02) COMP.            109600      
002098        03 S422-60-CTA-FECAPER-2K      PIC 9(08) COMP.            109700      
002099        03 S422-60-CTA-FECULTMOD-2K    PIC 9(08) COMP.            109800      
002100        03 S422-60-CTA-FECCANCEL-2K    PIC 9(08) COMP.            109900      
002101        03 FILLER                      PIC X(32).                 110000      
002102*SIZE SALIDA X(84).                                               110100      
002103   77  R422-60-CTR-ERROR               PIC S9(11) BINARY.         110200      
002104*                                                                 110300      
002105*********************************************************         110400      
002106****  PARAMETROS     S016_L422_CTAMEDIO  (61)      ******         110500      
002107****  PROCEDIMIENTO DE TIPO ENTERO                  *****         110600      
002108*****    CONSULTA B04CUENTAS, B08MEDIOS CON OPCION  *****         110700      
002109*********************************************************         110800      
002110 01  E422-61-CTR-ENTRADA.                                         110900      
002111     02  E422-61-CTA-NUMPROD         PIC 9(04) COMP.              111000      
002112     02  E422-61-CTA-CVEINST         PIC 9(04) COMP.              111100      
002113     02  E422-61-CTO-NUM.                                         111200      
002114         03  E422-61-CTA-NUMPREF     PIC 9(04) COMP.              111300      
002115         03  E422-61-CTA-NUM         PIC 9(12) COMP.              111400      
002116     02  E422-61-MDA-CVETIPO         PIC 9(02) COMP.              111500      
002117     02  E422-61-OPCION              PIC 9(02) COMP.              111600      
002118     02  E422-61-CTR-NUMCSI         PIC 9(02) COMP.               111700      
002119     02  E422-61-CTE-NUM            PIC 9(12) COMP.               111800      
002120     02  FILLER                      PIC X(39).                   111900      
002121                                                                  112000      
002122* SIZE ENTRADA X(60)                                              112100      
002123 01  S422-61-CTR-SALIDA.                                          112200      
002124     02 S422-61-CTR-REGISTRO.                                     112300      
002125        03 S422-61-CTR-ERR.                                       112400      
002126           04 S422-61-CTR-ERROR        PIC 9(04) COMP.            112500      
002127           04 S422-61-CTR-ERRORTIPO    PIC 9(04) COMP.            112600      
002128           04 S422-61-CTR-ESTRUCTURA   PIC 9(04) COMP.            112700      
002129        03 S422-61-CTR-NUMCSI          PIC 9(02) COMP.            112800      
002130        03 S422-61-CTE-NUM             PIC 9(12) COMP.            112900      
002131        03 S422-61-CTA-NUMPROD         PIC 9(04) COMP.            113000      
002132        03 S422-61-CTA-CVEINST         PIC 9(02) COMP.            113100      
002133        03 S422-61-CTA-NUMCTO.                                    113200      
002134           04 S422-61-CTA-NUMPREF      PIC 9(04) COMP.            113300      
002135           04 S422-61-CTA-NUM          PIC 9(12) COMP.            113400      
002136        03 S422-61-MDA-CVETIPO         PIC 9(02) COMP.            113500      
002137        03 S422-61-MDA-SUBTIPO         PIC 9(02) COMP.            113600      
002138        03 S422-61-MDA-CVETIT          PIC 9(02) COMP.            113700      
002139        03 S422-61-MDA-NUMCTO.                                    113800      
002140           04 S422-61-MDA-NUMPREF      PIC 9(04) COMP.            113900      
002141           04 S422-61-MDA-NUM          PIC 9(12) COMP.            114000      
002142        03 S422-61-MDA-NUMTALON        PIC 9(02) COMP.            114100      
002143        03 S422-61-MDA-CHQXTALON       PIC 9(02) COMP.            114200      
002144        03 S422-61-MDA-CVEPIN          PIC 9(06) COMP.            114300      
002145        03 S422-61-MDA-CVESTATUS       PIC 9(02) COMP.            114400      
002146        03 S422-61-MDA-FECALTA-2K      PIC 9(08) COMP.            114500      
002147        03 S422-61-MDA-FECULTMOD-2K    PIC 9(08) COMP.            114600      
002148        03 S422-61-MDA-FECCANCEL-2K    PIC 9(08) COMP.            114700      
002149        03 S422-61-MDA-FECMODPIN-2K    PIC 9(08) COMP.            114800      
002150        03 FILLER                      PIC X(27).                 114900      
002151* SIZE SALIDA X(84).                                              115000      
002152  77  R422-61-CTR-ERROR               PIC S9(11) BINARY.          115100      
002153***************************************************************   115200      
002154****  PARAMETROS        S016_L422_CTECTA    (62)           ****   115300      
002155****  PROCEDIMIENTO DE TIPO ENTERO                         ****   115400      
002156*****    CONSULTA B04CUENTAS, B05CTECTA CON OPCION        *****   115500      
002157***************************************************************   115600      
002158 01  E422-62-CTR-ENTRADA.                                         115700      
002159     02  E422-62-CTR-NUMCSI          PIC 9(02) COMP.              115800      
002160     02  E422-62-CTE-NUM             PIC 9(12) COMP.              115900      
002161     02  E422-62-CTA-NUMPROD         PIC 9(04) COMP.              116000      
002162     02  E422-62-CTA-CVEINST         PIC 9(02) COMP.              116100      
002163     02  E422-62-OPCION              PIC 9(02) COMP.              116200      
002164     02  FILLER                      PIC X(49).                   116300      
002165* SIZE ENTRADA X(60).                                             116400      
002166 01  S422-62-CTR-SALIDA.                                          116500      
002167     02 S422-62-CTR-REGISTRO.                                     116600      
002168        03 S422-62-CTR-ERR.                                       116700      
002169           04 S422-62-CTR-ERROR        PIC 9(04) COMP.            116800      
002170           04 S422-62-CTR-ERRORTIPO    PIC 9(04) COMP.            116900      
002171           04 S422-62-CTR-ESTRUCTURA   PIC 9(04) COMP.            117000      
002172        03 S422-62-CTR-NUMCSI          PIC 9(02) COMP.            117100      
002173        03 S422-62-CTE-NUM             PIC 9(12) COMP.            117200      
002174        03 S422-62-CTA-NUMPROD         PIC 9(04) COMP.            117300      
002175        03 S422-62-CTA-CVEINST         PIC 9(02) COMP.            117400      
002176        03 S422-62-CTA-NUMPREF         PIC 9(04) COMP.            117500      
002177        03 S422-62-CTA-NUM             PIC 9(12) COMP.            117600      
002178        03 S422-62-CTA-NUMSUC          PIC 9(04) COMP.            117700      
002179        03 S422-62-CTA-RELCTE          PIC 9(02) COMP.            117800      
002180        03 S422-62-CTA-USOBCAELE       PIC 9(02) COMP.            117900      
002181        03 S422-62-CTA-ASOCIADAX       PIC 9(02) COMP.            118000      
002182        03 S422-62-CTA-FEALTACTE-2K    PIC 9(08) COMP.            118100      
002183        03 S422-62-CTA-FEMODCTE-2K     PIC 9(08) COMP.            118200      
002184        03 S422-62-CTA-3DIGITOS        PIC 9(04) COMP.            118300      
002185        03 FILLER                      PIC X(27).                 118400      
002186* SIZE SALIDA X(66).                                              118500      
002187 77  R422-62-CTR-ERROR                 PIC S9(11) BINARY.         118600      
002188*NO CUENTA CON FILLER, SE AµADIERON 4 COMP.....                   118700      
002189***************************************************************   118800      
002190**** PARAMETROS  S016_L422_CONS_DOMCTA(63)                 ****   118900      
002191**** PROCEDIMIENTO DE TIPO ENTERO                          ****   119000      
002192*****CONSULTA B01CLIENTES, B02DOMICILIOS y B04CUENTAS     *****   119100      
002193***************************************************************   119200      
002194 01  E422-63-CTR-ENTRADA.                                         119300      
002195     03 E422-63-CTA-NUMPREF               PIC 9(004) COMP.        119400      
002196     03 E422-63-CTA-NUM                   PIC 9(012) COMP.        119500      
002197     03 E422-63-CTA-NUMPROD               PIC 9(004) COMP.        119600      
002198     03 E422-63-CTA-CVEINST               PIC 9(002) COMP.        119700      
002199     03 FILLER                            PIC X(049).             119800      
002200*SIZE ENTRADA X(60).                                              119900      
002201*                                                                 120000      
002202 01  S422-63-CTR-SALIDA.                                          120100      
002203     05 S422-63-CTR-ERROR                 PIC 9(004) COMP.        120200      
002204     05 S422-63-CTR-ERRORTYPE             PIC 9(004) COMP.        120300      
002205     05 S422-63-CTR-STRUCTURE             PIC 9(004) COMP.        120400      
002206     05 S422-63-CTE-CALLENUM              PIC X(036).             120500      
002207     05 S422-63-CTE-NOMCOL                PIC X(024).             120600      
002208     05 S422-63-CTE-NOMPOB                PIC X(020).             120700      
002209     05 S422-63-CTE-CVEEDO                PIC 9(002) COMP.        120800      
002210     05 S422-63-CTE-NUMCP                 PIC 9(006) COMP.        120900      
002211     05 S422-63-CTE-NUMTEL                PIC 9(010) COMP.        121000      
002212     05 S422-63-CTE-NUMTELEXT             PIC 9(006) COMP.        121100      
002213     05 S422-63-CTE-CVETEL                PIC 9(002) COMP.        121200      
002214     05 S422-63-CTE-NUMTEL2               PIC 9(010) COMP.        121300      
002215     05 S422-63-CTE-NUMTELEX2             PIC 9(006) COMP.        121400      
002216     05 S422-63-CTE-CVETEL2               PIC 9(002) COMP.        121500      
002217     05 S422-63-CTR-CVESTADOM             PIC 9(002) COMP.        121600      
002218     05 S422-63-CTR-CVEDOM                PIC 9(002) COMP.        121700      
002219     05 FILLER                            PIC X(028).             121800      
002220* SIZE SALIDA X(138).                                             121900      
002221*                                                                 122000      
002222 77  R422-63-CTR-ERROR                    PIC S9(11) BINARY.      122100      
002223***************************************************************   122200      
002224**** PARAMETROS  S016_L422_CONS_DOMGAR (64)                ****   122300      
002225**** PROCEDIMIENTO DE TIPO ENTERO                           ***   122400      
002226*****CONSULTA B01CLIENTES, B02DOMICILIOS y B17INFADICTA   *****   122500      
002227***************************************************************   122600      
002228 01  E422-64-CTR-ENTRADA.                                         122700      
002229     03 E422-64-CTA-NUMPREF               PIC 9(004) COMP.        122800      
002230     03 E422-64-CTA-NUM                   PIC 9(012) COMP.        122900      
002231     03 E422-64-CTA-NUMPROD               PIC 9(004) COMP.        123000      
002232     03 E422-64-CTA-CVEINST               PIC 9(002) COMP.        123100      
002233     03 FILLER                            PIC X(049).             123200      
002234* SIZE SALIDA X(60)                                               123300      
002235*                                                                 123400      
002236 01  S422-64-CTR-SALIDA.                                          123500      
002237        05 S422-64-CTR-ERROR              PIC 9(004) COMP.        123600      
002238        05 S422-64-CTR-ERRORTYPE          PIC 9(004) COMP.        123700      
002239        05 S422-64-CTR-STRUCTURE          PIC 9(004) COMP.        123800      
002240        05 S422-64-CTE-CALLENUM           PIC X(036).             123900      
002241        05 S422-64-CTE-NOMCOL             PIC X(024).             124000      
002242        05 S422-64-CTE-NOMPOB             PIC X(020).             124100      
002243        05 S422-64-CTE-CVEEDO             PIC 9(002) COMP.        124200      
002244        05 S422-64-CTE-NUMCP              PIC 9(006) COMP.        124300      
002245        05 S422-64-CTE-NUMTEL             PIC 9(010) COMP.        124400      
002246        05 S422-64-CTE-NUMTELEXT          PIC 9(006) COMP.        124500      
002247        05 S422-64-CTE-CVETEL             PIC 9(002) COMP.        124600      
002248        05 S422-64-CTE-NUMTEL2            PIC 9(010) COMP.        124700      
002249        05 S422-64-CTE-NUMTELEX2          PIC 9(006) COMP.        124800      
002250        05 S422-64-CTE-CVETEL2            PIC 9(002) COMP.        124900      
002251        05 S422-64-CTA-CVESTADOM          PIC 9(002) COMP.        125000      
002252        05 S422-64-CTR-CVEDOM             PIC 9(002) COMP.        125100      
002253        05 FILLER                         PIC X(28).              125200      
002254* SIZE SALIDA X(138).                                             125300      
002255*                                                                 125400      
002256 01  R422-64-CTR-ERROR                    PIC S9(11) BINARY.      125500      
002257*                                                                 125600      
002258***************************************************************   125700      
002259**** PARAMETROS S016_L422_CON_CTA_EJE (65)                 ****   125800      
002260**** PROCEDIMIENTO DE TIPO ENTERO                          ****   125900      
002261*****    CONSULTA B04CUENTAS, B07CTACTA CON OPCION        *****   126000      
002262***************************************************************   126100      
002263*                                                                 126200      
002264 01  E422-65-CTR-ENTRADA.                                         126300      
002265     03 E422-65-CTR-NUMCSI                PIC 9(002) COMP.        126400      
002266     03 E422-65-CTE-NUM                   PIC 9(012) COMP.        126500      
002267*     03 E422-65-CTA-NUMPROREL             PIC 9(004) COMP.       126600      
002268*     03 E422-65-CTA-CVEINSREL             PIC 9(002) COMP.       126700      
002269*     03 E422-65-CTA-NUMPREREL             PIC 9(004) COMP.       126800      
002270*     03 E422-65-CTA-NUMREL                PIC 9(012) COMP.       126900      
002271*                                                                 127000      
002272     03 E422-65-CTA-NUMPROD               PIC 9(004) COMP.        127100      
002273     03 E422-65-CTA-CVEINST               PIC 9(002) COMP.        127200      
002274     03 E422-65-CTA-NUMPREF               PIC 9(004) COMP.        127300      
002275     03 E422-65-CTA-NUM                   PIC 9(012) COMP.        127400      
002276     03 E422-65-CTA-CVRELCTA              PIC 9(002) COMP.        127500      
002277     03 E422-65-OPCION                    PIC 9(002) COMP.        127600      
002278     03 FILLER                            PIC X(40).              127700      
002279*  SIZE ENTRADA X(60).                                            127800      
002280*                                                                 127900      
002281 01  S422-65-CTR-SALIDA.                                          128000      
002282     03 S422-65-CTR-ERROR                 PIC 9(004) COMP.        128100      
002283     03 S422-65-CTR-ERRORTYPE             PIC 9(004) COMP.        128200      
002284     03 S422-65-CTR-STRUCTURE             PIC 9(004) COMP.        128300      
002285     03 S422-65-CTR-NUMCSI                PIC 9(002) COMP.        128400      
002286     03 S422-65-CTE-NUM                   PIC 9(012) COMP.        128500      
002287     03 S422-65-CTA-NUMPROD               PIC 9(004) COMP.        128600      
002288     03 S422-65-CTA-CVEINST               PIC 9(002) COMP.        128700      
002289     03 S422-65-CTA-NUMPREF               PIC 9(004) COMP.        128800      
002290     03 S422-65-CTA-NUM                   PIC 9(012) COMP.        128900      
002291     03 S422-65-CTR-CVERELCTA             PIC 9(002) COMP.        129000      
002292     03 S422-65-CTA-NUMPRODREL            PIC 9(004) COMP.        129100      
002293     03 S422-65-CTA-CVEINSREL             PIC 9(002) COMP.        129200      
002294     03 S422-65-CTA-NUMPREFREL            PIC 9(004) COMP.        129300      
002295     03 S422-65-CTA-NUMREL                PIC 9(012) COMP.        129400      
002296     03 S422-65-CTA-FECALTA-2K            PIC 9(008) COMP.        129500      
002297     03 S422-65-CTA-FECULTMOD-2K          PIC 9(008) COMP.        129600      
002298     03 FILLER                            PIC X(22).              129700      
002299* SIZE SALIDA X(66).                                              129800      
002300*                                                                 129900      
002301 77  R422-65-CTR-ERROR                   PIC S9(11) BINARY.       130000      
002302*                                                                 130100      
002303*********************************************************         130200      
002304**** PARAMETROS  S016_L422_CON_CTA_REL (66)           ***         130300      
002305**** PROCEDIMIENTO DE TIPO ENTERO                     ***         130400      
002306*****    CONSULTA B04CUENTAS, B07CTACTA             *****         130500      
002307*********************************************************         130600      
002308*                                                                 130700      
002309 01  E422-66-CTR-ENTRADA.                                         130800      
002310     03 E422-66-CTR-NUMCSI                PIC 9(002) COMP.        130900      
002311     03 E422-66-CTE-NUM                   PIC 9(012) COMP.        131000      
002312     03 E422-66-CTA-NUMPROD               PIC 9(004) COMP.        131100      
002313     03 E422-66-CTA-CVEINST               PIC 9(002) COMP.        131200      
002314     03 E422-66-CTA-NUMPREF               PIC 9(004) COMP.        131300      
002315     03 E422-66-CTA-NUM                   PIC 9(012) COMP.        131400      
002316     03 E422-66-CTR-CVRELCTA              PIC 9(002) COMP.        131500      
002317     03 E422-66-CTR-NUMPROREL             PIC 9(004) COMP.        131600      
002318     03 E422-66-CTR-CVEINSREL             PIC 9(002) COMP.        131700      
002319     03 FILLER                            PIC X(038).             131800      
002320* SIZE SALIDA X(60).                                              131900      
002321 01  S422-66-CTR-SALIDA.                                          132000      
002322     03 S422-66-CTR-ERROR                 PIC 9(004) COMP.        132100      
002323     03 S422-66-CTR-ERRORTYPE             PIC 9(004) COMP.        132200      
002324     03 S422-66-CTR-STRUCTURE             PIC 9(004) COMP.        132300      
002325     03 S422-66-CTR-NUMCSI                PIC 9(002) COMP.        132400      
002326     03 S422-66-CTE-NUM                   PIC 9(012) COMP.        132500      
002327     03 S422-66-CTA-NUMPROD               PIC 9(004) COMP.        132600      
002328     03 S422-66-CTA-CVEINST               PIC 9(002) COMP.        132700      
002329     03 S422-66-CTA-NUMPREF               PIC 9(004) COMP.        132800      
002330     03 S422-66-CTA-NUM                   PIC 9(012) COMP.        132900      
002331     03 S422-66-CTR-CVERELCTA             PIC 9(002) COMP.        133000      
002332     03 S422-66-CTA-NUMPRODREL            PIC 9(004) COMP.        133100      
002333     03 S422-66-CTA-CVEINSREL             PIC 9(002) COMP.        133200      
002334     03 S422-66-CTA-NUMPREFREL            PIC 9(004) COMP.        133300      
002335     03 S422-66-CTA-NUMREL                PIC 9(012) COMP.        133400      
002336     03 S422-66-CTA-FECALTA-2K            PIC 9(008) COMP.        133500      
002337     03 S422-66-CTA-FECULTMOD-2K          PIC 9(008) COMP.        133600      
002338     03 FILLER                            PIC X(22).              133700      
002339* SIZE SALIDA X(66).                                              133800      
002340 77  R422-66-CTR-ERROR                    PIC S9(11) BINARY.      133900      
002341*NO CUENTA CON FILLER SE AµADIERON 4 COMP.                        134000      
002342******************************************************************134100      
002343***     PARAMETROS    S016_L422_CON_S404 (67)              *******134200      
002344******************************************************************134300      
002345* S016_L422_CON_S404 (67)   existe en el archivo de parametros    134400      
002346*                        pero no existe el codigo                 134500      
002347*                                                                 134600      
002348 77  R422-67-CTR-ERROR                   PIC S9(11) BINARY.       134700      
002349*                                                                 134800      
002350 01  E422-67-CTR-ENTRADA.                                         134900      
002351     03 E422-67-CTA-NUMPREF               PIC 9(004) COMP.        135000      
002352     03 E422-67-CTA-NUM                   PIC 9(012) COMP.        135100      
002353     03 E422-67-CTA-NUMPROD               PIC 9(004) COMP.        135200      
002354     03 E422-67-CTA-CVEINST               PIC 9(002) COMP.        135300      
002355     03 FILLER                            PIC X(087).             135400      
002356*                                                                 135500      
002357 01  S422-67-CTR-SALIDA.                                          135600      
002358     03 S422-67-CTE-NUM           PIC 9(012) COMP.                135700      
002359*                                                                 135800      
002360     03 S422-67-CTE-NOMBRE        PIC X(055).                     135900      
002361     03 S422-67-CTE-CALLENUM      PIC X(036).                     136000      
002362     03 S422-67-CTE-NOMCOL        PIC X(024).                     136100      
002363     03 S422-67-CTE-NOMPOB        PIC X(020).                     136200      
002364     03 S422-67-CTE-CVEEDO        PIC 9(002) COMP.                136300      
002365     03 S422-67-CTE-NUMCP         PIC 9(006) COMP.                136400      
002366     03 S422-67-CTE-NUMTEL        PIC 9(010) COMP.                136500      
002367     03 S422-67-CTE-NUMTELEXT     PIC 9(006) COMP.                136600      
002368     03 S422-67-CTE-NUMTEL2       PIC 9(010) COMP.                136700      
002369     03 S422-67-CTE-NUMTELEX2     PIC 9(006) COMP.                136800      
002370     03 S422-67-CTE-CVESECTOR     PIC 9(002) COMP.                136900      
002371     03 S422-67-CTE-CVEACTBM      PIC 9(006) COMP.                137000      
002372     03 S422-67-CTE-CODINI        PIC X(004).                     137100      
002373     03 S422-67-CTE-FECNAC        PIC 9(006) COMP.                137200      
002374     03 S422-67-CTE-CODHOM        PIC X(005).                     137300      
002375     03 S422-67-CTE-CVENACION     PIC 9(002) COMP.                137400      
002376     03 S422-67-CTE-CVESEXO       PIC 9(002) COMP.                137500      
002377*                                                                 137600      
002378 01  S422-67-RCTR-SALIDA REDEFINES S422-67-CTR-SALIDA.            137700      
002379     03 S422-67-CTR-ERROR         PIC 9(004) COMP.                137800      
002380     03 S422-67-CTR-ERRORTYPE     PIC 9(004) COMP.                137900      
002381     03 S422-67-CTR-STRUCTURE     PIC 9(004) COMP.                138000      
002382     03 FILLER                    PIC X(161).                     138100      
002383*                                                                 138200      
002384***************************************************************   138300      
002385****   ENTRY POINT  S016_L422_CTE_GRALES (68)             *****   138400      
002386* INTEGER PROCEDURE S016_L422_CTE_GRALES( E422_68_CTR_ENTRADA *   138500      
002387******                                 ,S422_68_CTR_SALIDA); *    138600      
002388***************************************************************   138700      
002389**************  Sin parametros !!!                                138800      
002390****************************************************************  138900      
002391****   ENTRY POINT S016_L422_CTE_NOMCORTO (69)            ******  139000      
002392* INTEGER PROCEDURE S016_L422_CTE_NOMCORTO( E422_69_CTR_ENTRADA*  139100      
002393********                                ,S422_69_CTR_SALIDA); **  139200      
002394****************************************************************  139300      
002395**************  Sin parametros !!!                                139400      
002396*************************************************************     139500      
002397**** PARAMETROS  S016_L422_CTE_DIREC (70)              ******     139600      
002398**** PROCEDIMIENTO DE TIPO ENTERO                      ******     139700      
002399***  CONSULTA B04, B02, B05, y B09BCAELEC CON OPCION.  ******     139800      
002400***  LOCALIZA DOMICILIO. COBRANZA, ESPECIAL DIGITEL Y PEMEX *     139900      
002401*************************************************************     140000      
002402*                                                                 140100      
002403 77  R422-70-CTR-ERROR                    PIC S9(11) BINARY.      140200      
002404*                                                                 140300      
002405 01  E422-70-CTR-ENTRADA.                                         140400      
002406     03 E422-70-CTA-NUMPROD               PIC 9(004) COMP.        140500      
002407     03 E422-70-CTR-NUMCSI                PIC 9(002) COMP.        140600      
002408     03 E422-70-CTA-NUMPREF               PIC 9(004) COMP.        140700      
002409     03 E422-70-CTA-NUM                   PIC 9(012) COMP.        140800      
002410     03 E422-70-CTE-NUM                   PIC 9(012) COMP.        140900      
002411     03 E422-70-CTA-CVEINST               PIC 9(002) COMP.        141000      
002412     03 E422-70-CTA-NUMDOM                PIC 9(002) COMP.        141100      
002413*   CTE-CVEENVIO, CTA-CVEENVIO, CTR-CVEENVIO:                     141200      
002414*   1 DOM.PRINCIPAL, 2 a 998 DOM. ADICIONAL,                      141300      
002415*    999 SUC. PROMOTORA, 1000 ENVIO ESPECIAL                      141400      
002416*    CTR-CVEDOM:                                                  141500      
002417*   1 DOM. PARTICULAR, 2 DOM. OFICINA,                            141600      
002418*   3 AP. POSTAL , 4 ESPECIAL SI DIGITEL EN TEL1                  141700      
002419*    SALDOS RADIOS LOCALIZADORES, SI COBRANZA PEMEX               141800      
002420*    TEL 1 ESTACION DE GASOLINA, TEL2 EMPRESAS.                   141900      
002421     03 E422-70-OPCION                    PIC 9(002) COMP.        142000      
002422     03 FILLER                            PIC X(039).             142100      
002423*SIZE ENTRADA (60).                                               142200      
002424*                                                                 142300      
002425 01  S422-70-CTR-SALIDA.                                          142400      
002426     03 S422-70-CTE-NOM                   PIC X(055).             142500      
002427* SOLO OBTIENE CUANDO EL DOMICILIO SE CONSULTA EN B01.            142600      
002428     03 S422-70-CTE-CALLENUM              PIC X(036).             142700      
002429     03 S422-70-CTE-NOMCOL                PIC X(024).             142800      
002430     03 S422-70-CTE-NOMPOB                PIC X(020).             142900      
002431     03 S422-70-CTE-NUMCP                 PIC 9(006) COMP.        143000      
002432     03 S422-70-CTR-CVEDOM                PIC 9(002) COMP.        143100      
002433     03 S422-70-CTE-CVEEDO                PIC 9(002) COMP.        143200      
002434     03 S422-70-CTE-NUMTEL                PIC 9(010) COMP.        143300      
002435     03 S422-70-CTE-NUMTELEXT             PIC 9(006) COMP.        143400      
002436     03 S422-70-DOM-ENVCOR                PIC 9(004) COMP.        143500      
002437     03 S422-70-CTE-CVETEL                PIC 9(002) COMP.        143600      
002438     03 S422-70-CTE-NUMTEL2               PIC 9(010) COMP.        143700      
002439     03 S422-70-CTE-NUMTELEX2             PIC 9(006) COMP.        143800      
002440     03 S422-70-CTE-CVETEL2               PIC 9(002) COMP.        143900      
002441     03 S422-70-CTA-CVESTADOM             PIC 9(002) COMP.        144000      
002442     03 S422-70-CTE-CVEPERS               PIC 9(002) COMP.        144100      
002443* SOLO OBTIENE CUANDO EL DOMICILIO SE CONSULTA EN B01.            144200      
002444     03 S422-70-CTE-SITUACION             PIC X(004).             144300      
002445* SOLO OBTIENE CUANDO EL DOMICILIO SE CONSULTA EN B01.            144400      
002446     03 FILLER                            PIC X(008).             144500      
002447* SIZE SALIDA X(174)                                              144600      
002448*                                                                 144700      
002449 01  S422-70-RCTR-SALIDA REDEFINES S422-70-CTR-SALIDA.            144800      
002450     03 S422-70-CTR-ERROR                 PIC 9(004) COMP.        144900      
002451     03 S422-70-CTR-ERRORTYPE             PIC 9(004) COMP.        145000      
002452     03 S422-70-CTR-STRUCTURE             PIC 9(004) COMP.        145100      
002453     03 FILLER                            PIC X(168).             145200      
002454*                                                                 145300      
002455***********                                                       145400      
002456*                                                                 145500      
002457*************************************************************     145600      
002458**** PARAMETROS  S016_L422_CTA_PREMIA (77)             ******     145700      
002459**** PROCEDIMIENTO DE TIPO ENTERO                          **     145800      
002460**** CONSULTA B04CUENTAS y B07CTACTA                       **     145900      
002461*************************************************************     146000      
002462*                                                                 146100      
002463 77  R422-77-CTR-ERROR                    PIC S9(11) BINARY.      146200      
002464*                                                                 146300      
002465 01  E422-77-CTR-ENTRADA.                                         146400      
002466     03 E422-77-CTR-NUMCSI                PIC 9(002) COMP.        146500      
002467     03 E422-77-CTA-NUMPROREL             PIC 9(004) COMP.        146600      
002468     03 E422-77-CTA-CVEINSREL             PIC 9(002) COMP.        146700      
002469     03 E422-77-CTA-NUMPREREL             PIC 9(004) COMP.        146800      
002470     03 E422-77-CTA-NUMREL                PIC 9(012) COMP.        146900      
002471     03 E422-77-CTA-NUMPROD               PIC 9(004) COMP.        147000      
002472     03 E422-77-CTA-CVEINST               PIC 9(002) COMP.        147100      
002473     03 E422-77-CTA-NUMPREF               PIC 9(004) COMP.        147200      
002474     03 E422-77-CTA-NUM                   PIC 9(012) COMP.        147300      
002475     03 E422-77-CTR-CVERELCTA             PIC 9(002) COMP.        147400      
002476     03 FILLER                            PIC X(36).              147500      
002477* SIZE ENTRADA X(60).                                             147600      
002478*                                                                 147700      
002479  01  S422-77-CTR-SALIDA.                                         147800      
002480     03 S422-77-CTR-NUMCSI                PIC 9(002) COMP.        147900      
002481     03 S422-77-CTE-NUM                   PIC 9(012) COMP.        148000      
002482     03 S422-77-CTA-NUMPROD               PIC 9(004) COMP.        148100      
002483     03 S422-77-CTA-CVEINST               PIC 9(002) COMP.        148200      
002484     03 S422-77-CTA-NUMPREF               PIC 9(004) COMP.        148300      
002485     03 S422-77-CTA-NUM                   PIC 9(012) COMP.        148400      
002486     03 S422-77-CTR-CVERELCTA             PIC 9(002) COMP.        148500      
002487     03 S422-77-CTA-NUMPRODREL            PIC 9(004) COMP.        148600      
002488     03 S422-77-CTA-CVEINSREL             PIC 9(002) COMP.        148700      
002489     03 S422-77-CTA-NUMPREFREL            PIC 9(004) COMP.        148800      
002490     03 S422-77-CTA-NUMREL                PIC 9(012) COMP.        148900      
002491     03 S422-77-CTA-FECALTA-2K            PIC 9(008) COMP.        149000      
002492     03 S422-77-CTA-FECULTMOD-2K          PIC 9(008) COMP.        149100      
002493     03 FILLER                            PIC X(016).             149200      
002494* SIZE SALIDA X(54)                                               149300      
002495 01  S422-77-RCTR-SALIDA REDEFINES S422-77-CTR-SALIDA.            149400      
002496     03 S422-77-CTR-ERROR                 PIC 9(004) COMP.        149500      
002497     03 S422-77-CTR-ERRORTYPE             PIC 9(004) COMP.        149600      
002498     03 S422-77-CTR-STRUCTURE             PIC 9(004) COMP.        149700      
002499     03 FILLER                            PIC 9(046) COMP.        149800      
002500*                                                                 149900      
002501*********************************************************         150000      
002502***    PARAMETROS  S016_L422_CON_XMEDIO  (78)         ***         150100      
002503****   CONSULTA B08MEDIOS                              **         150200      
002504*********************************************************         150300      
002505*                                                                 150400      
002506 77  R422-78-CTR-ERROR                   PIC S9(11) BINARY.       150500      
002507*                                                                 150600      
002508  01  E422-78-CTR-ENTRADA.                                        150700      
002509     03 E422-78-MDA-NUMERO                PIC 9(016) COMP.        150800      
002510     03 E422-78-MDA-RED     REDEFINES     E422-78-MDA-NUMERO.     150900      
002511        05 E422-78-MDA-NUMPREF            PIC 9(004) COMP.        151000      
002512        05 E422-78-MDA-NUM                PIC 9(012) COMP.        151100      
002513     03 FILLER                            PIC X(052).             151200      
002514* SIZE ENTRADA (60).*                                             151300      
002515  01  S422-78-CTR-SALIDA.                                         151400      
002516     03 S422-78-CTR-NUMCSI                PIC  9(002) COMP.       151500      
002517     03 S422-78-CTE-NUM                   PIC  9(012) COMP.       151600      
002518     03 S422-78-CTA-NUMPROD               PIC  9(004) COMP.       151700      
002519     03 S422-78-CTA-CVEINST               PIC  9(002) COMP.       151800      
002520     03 S422-78-CTA-NUMPREF               PIC  9(004) COMP.       151900      
002521     03 S422-78-CTA-NUM                   PIC  9(012) COMP.       152000      
002522     03 S422-78-MDA-CVETIPO               PIC  9(002) COMP.       152100      
002523     03 S422-78-MDA-SUBTIPO               PIC  9(002) COMP.       152200      
002524     03 S422-78-MDA-CVETIT                PIC  9(002) COMP.       152300      
002525     03 S422-78-MDA-NUMPREF               PIC  9(004) COMP.       152400      
002526     03 S422-78-MDA-NUM                   PIC  9(012) COMP.       152500      
002527     03 S422-78-MDA-ABRPROFT              PIC  X(003).            152600      
002528     03 S422-78-CTR-PTRNOMT               PIC  9(004) COMP.       152700      
002529     03 S422-78-MDA-ABRPROFC              PIC  X(003).            152800      
002530     03 S422-78-CTR-PTRNOMC               PIC  9(004) COMP.       152900      
002531     03 S422-78-MDA-NUMTALON              PIC  9(002) COMP.       153000      
002532     03 S422-78-MDA-CHQXTALON             PIC  9(002) COMP.       153100      
002533     03 S422-78-MDA-CVEPIN                PIC  9(006) COMP.       153200      
002534     03 S422-78-MDA-CVESTATUS             PIC  9(002) COMP.       153300      
002535     03 S422-78-MDA-FECALTA-2K            PIC  9(008) COMP.       153400      
002536     03 S422-78-MDA-FECULTMOD-2K          PIC  9(008) COMP.       153500      
002537     03 S422-78-MDA-FECULTACC-2K          PIC  9(008) COMP.       153600      
002538     03 S422-78-MDA-FECVENC-2K            PIC  9(008) COMP.       153700      
002539     03 S422-78-MDA-FECCANCEL-2K          PIC  9(008) COMP.       153800      
002540     03 S422-78-MDA-FECPREV               PIC  9(006) COMP.       153900      
002541     03 S422-78-MDA-FECMODPIN-2K          PIC  9(008) COMP.       154000      
002542     03 S422-78-MDA-HHPREV                PIC  9(004) COMP.       154100      
002543     03 S422-78-MDA-HHALTA                PIC  9(004) COMP.       154200      
002544     03 S422-78-MDA-HHULTMOD              PIC  9(004) COMP.       154300      
002545     03 S422-78-MDA-HHULTACC              PIC  9(004) COMP.       154400      
002546     03 S422-78-MDA-HHVENC                PIC  9(004) COMP.       154500      
002547     03 S422-78-MDA-PERIODO               PIC  9(002) COMP.       154600      
002548     03 S422-78-MDA-SITUACION             PIC  X(004).            154700      
002549     03 FILLER                            PIC  X(021).            154800      
002550* SIZE SALIDA X(108).                                             154900      
002551*                                                                 155000      
002552 01  S422-78-RCTR-SALIDA REDEFINES S422-78-CTR-SALIDA.            155100      
002553*                                                                 155200      
002554     03 S422-78-CTR-ERROR                 PIC 9(004) COMP.        155300      
002555     03 S422-78-CTR-ERRORTYPE             PIC 9(004) COMP.        155400      
002556     03 S422-78-CTR-STRUCTURE             PIC 9(004) COMP.        155500      
002557     03 FILLER                            PIC 9(102) COMP.        155600      
002558*                                                                 155700      
002559***********************************************************       155800      
002560***      PARAMETROS S016_L422_FINAPE (79)               ***       155900      
002561****     CONSULTA B23FINAPE                              **       156000      
002562***********************************************************       156100      
002563*                                                                 156200      
002564 77  R422-79-CTR-ERROR                    PIC S9(11) BINARY.      156300      
002565*                                                                 156400      
002566 01  E422-79-CTR-ENTRADA.                                         156500      
002567     03 E422-79-CTE-CODINI                PIC X(004).             156600      
002568     03 E422-79-CTE-FECNAC                PIC 9(006) COMP.        156700      
002569     03 E422-79-CTE-CODHOM                PIC X(005).             156800      
002570     03 E422-79-CTE-NUM                   PIC 9(012) COMP.        156900      
002571     03 E422-79-CTA-NUMPROD               PIC 9(004) COMP.        157000      
002572     03 E422-79-CTA-CVEINST               PIC 9(004) COMP.        157100      
002573     03 E422-79-CTA-NUMPREF               PIC 9(004) COMP.        157200      
002574     03 E422-79-CTA-NUM                   PIC 9(012) COMP.        157300      
002575     03 FILLER                            PIC X(018).             157400      
002576* SIZE ENTRADA X(60).                                             157500      
002577*                                                                 157600      
002578  01  S422-79-CTR-SALIDA.                                         157700      
002579     03 S422-79-CTE-NUM                   PIC 9(012)    COMP.     157800      
002580     03 S422-79-CTE-CODINI                PIC X(004).             157900      
002581     03 S422-79-CTE-FECNAC                PIC 9(006)    COMP.     158000      
002582     03 S422-79-CTE-CODHOM                PIC X(005).             158100      
002583     03 S422-79-CTE-SWIFT                 PIC X(011).             158200      
002584     03 S422-79-CTE-TELEX                 PIC X(033).             158300      
002585     03 S422-79-CTE-NUMVENC               PIC 9(002)    COMP.     158400      
002586     03 S422-79-CTE-SECTOR                PIC 9(002)    COMP.     158500      
002587     03 S422-79-CTE-CAEB                  PIC 9(006)    COMP.     158600      
002588     03 S422-79-CTE-STAFIN                PIC 9(002)    COMP.     158700      
002589     03 S422-79-CTE-RIEBNM                PIC X(002).             158800      
002590     03 S422-79-CTE-RIEBM                 PIC X(002).             158900      
002591     03 S422-79-CTE-VENTAS                PIC 9(014)    COMP.     159000      
002592     03 S422-79-CTE-CALIF  OCCURS 6 TIMES.                        159100      
002593        05 S422-79-CTE-ACUM               PIC 9(004)    COMP.     159200      
002594        05 S422-79-CTE-INMED              PIC 9(004)    COMP.     159300      
002595     03 S422-79-CTE-MONVEN                PIC 9(012)    COMP.     159400      
002596     03 S422-79-SALDO-JUNIO               PIC 9(012)    COMP.     159500      
002597     03 S422-79-SALDO-JULIO               PIC 9(012)    COMP.     159600      
002598     03 S422-79-CTE-NUMSOC                PIC 9(006)    COMP.     159700      
002599     03 S422-79-CTE-CVEDESFIN             PIC 9(4)V9(4) COMP.     159800      
002600     03 S422-79-CTE-CVEBANFIN             PIC 9(4)V9(4) COMP.     159900      
002601     03 S422-79-CTE-CVEGOBFIN             PIC 9(4)V9(4) COMP.     160000      
002602     03 S422-79-CTE-CVECONFIN             PIC 9(4)V9(4) COMP.     160100      
002603*   DESCUENTOS FOPYME TASA                                        160200      
002604     03 S422-79-CTE-CVEDESFOP             PIC 9(4)V9(4) COMP.     160300      
002605     03 S422-79-CTE-CVEBANFOP             PIC 9(4)V9(4) COMP.     160400      
002606     03 S422-79-CTE-CVEGOBFOP             PIC 9(4)V9(4) COMP.     160500      
002607     03 S422-79-CTE-CVECONFOP             PIC 9(4)V9(4) COMP.     160600      
002608*   DESCUENTOS FOPYME PAGO                                        160700      
002609     03 S422-79-CTE-DESFOPAGO             PIC 9(4)V9(4) COMP.     160800      
002610     03 S422-79-CTE-BANFOPAGO             PIC 9(4)V9(4) COMP.     160900      
002611     03 S422-79-CTE-GOBFOPAGO             PIC 9(4)V9(4) COMP.     161000      
002612     03 S422-79-CTE-CONFOPAGO             PIC 9(4)V9(4) COMP.     161100      
002613     03 S422-79-CTE-FECSUSP               PIC 9(008)    COMP.     161200      
002614     03 S422-79-CTE-FECALTA               PIC 9(008)    COMP.     161300      
002615     03 S422-79-CTE-FECULTMOD             PIC 9(008)    COMP.     161400      
002616     03 FILLER                            PIC X(020).             161500      
002617*  SIZE SALIDA X(204).                                            161600      
002618*                                                                 161700      
002619  01  S422-79-RCTR-SALIDA REDEFINES S422-79-CTR-SALIDA.           161800      
002620     03 S422-79-CTR-ERROR                 PIC 9(004)    COMP.     161900      
002621     03 S422-79-CTR-ERRORTYPE             PIC 9(004)    COMP.     162000      
002622     03 S422-79-CTR-STRUCTURE             PIC 9(004)    COMP.     162100      
002623     03 FILLER                            PIC X(198).             162200      
002624*                                                                 162300      
002625******************************************************************162400      
002626***    PARAMETROS  S016_L422_DIACORTE(80)                      ***162500      
002627****   CONSULTA B04CUENTAS MULTIPLE NUMREG SOLO S               **162600      
002628******************************************************************162700      
002629*                                                                 162800      
002630  77  R422-80-CTR-ERROR                    PIC S9(11) BINARY.     162900      
002631*                                                                 163000      
002632  01  E422-80-CTR-ENTRADA.                                        163100      
002633     03 E422-80-CTA-DIACORTE              PIC 9(002) COMP.        163200      
002634     03 E422-80-CTA-NUMPROD               PIC 9(004) COMP.        163300      
002635     03 E422-80-CTA-CVEINST               PIC 9(002) COMP.        163400      
002636     03 E422-80-CTA-NUMPREF               PIC 9(004) COMP.        163500      
002637     03 E422-80-CTA-NUM                   PIC 9(012) COMP.        163600      
002638     03 FILLER                            PIC X(48).              163700      
002639* SIZE ENTRADA (60).                                              163800      
002640*                                                                 163900      
002641  01  S422-80-CTR-SALIDA.                                         164000      
002642     03 S422-80-CTR-NUMREG        PIC 9(002) COMP.                164100      
002643     03 S422-80-CTR-OCC OCCURS 20.                                164200      
002644        05 S422-80-CTR-NUMCSI     PIC 9(002) COMP.                164300      
002645        05 S422-80-CTA-NUMPROD    PIC 9(004) COMP.                164400      
002646        05 S422-80-CTA-CVEINST    PIC 9(002) COMP.                164500      
002647        05 S422-80-CTA-NUMSUC     PIC 9(004) COMP.                164600      
002648        05 S422-80-CTA-NUMPREF    PIC 9(004) COMP.                164700      
002649        05 S422-80-CTA-NUM        PIC 9(012) COMP.                164800      
002650        05 S422-80-CTE-NUM        PIC 9(012) COMP.                164900      
002651        05 S422-80-CTA-DIACORTE   PIC 9(002) COMP.                165000      
002652        05 S422-80-CTA-CVEMONEDA  PIC 9(002) COMP.                165100      
002653        05 S422-80-CTA-CVEENVIO   PIC 9(004) COMP.                165200      
002654        05 S422-80-CTA-EDIEDOCTA  PIC 9(002) COMP.                165300      
002655        05 S422-80-CTA-CVESTATUS  PIC 9(002) COMP.                165400      
002656        05 S422-80-CTA-CVEUSO     PIC 9(002) COMP.                165500      
002657        05 S422-80-CTA-FECAPER    PIC 9(008) COMP.                165600      
002658        05 S422-80-CTA-FECULTMOD  PIC 9(008) COMP.                165700      
002659        05 S422-80-CTA-FECCANCEL  PIC 9(008) COMP.                165800      
002660        05 S422-80-CTA-SITUACION  PIC X(004).                     165900      
002661        05 FILLER                 PIC X(011).                     166000      
002662*      SIZE reg OCCURS X(54)                                      166100      
002663* SIZE SALIDA = 1+(54*20) = 1081                                  166200      
002664*                                                                 166300      
002665  01  S422-80-RCTR-SALIDA REDEFINES S422-80-CTR-SALIDA.           166400      
002666     03 S422-80-CTR-ERROR         PIC 9(004) COMP.                166500      
002667     03 S422-80-CTR-ERRORTYPE     PIC 9(004) COMP.                166600      
002668     03 S422-80-CTR-STRUCTURE     PIC 9(004) COMP.                166700      
002669     03 FILLER                    PIC X(1075).                    166800      
002670*                                                                 166900      
002671*                                                                 167000      
002672******************************************************************167100      
002673***    PARAMETROS   S016_L422_PRODINS (81)                     ***167200      
002674****   CONSULTA B04CUENTAS MULTIPLE NUMREG SOLO S               **167300      
002675******************************************************************167400      
002676*                                                                 167500      
002677  77  R422-81-CTR-ERROR                    PIC S9(11) BINARY.     167600      
002678*                                                                 167700      
002679  01  E422-81-CTR-ENTRADA.                                        167800      
002680     03 E422-81-CTR-NUMCSI                PIC 9(002) COMP.        167900      
002681     03 E422-81-CTA-NUMPROD               PIC 9(004) COMP.        168000      
002682     03 E422-81-CTA-CVEINST               PIC 9(002) COMP.        168100      
002683     03 E422-81-CTA-NUMPREF               PIC 9(004) COMP.        168200      
002684     03 E422-81-CTA-NUM                   PIC 9(012) COMP.        168300      
002685     03 FILLER                            PIC X(48).              168400      
002686* SIZE ENTRADA X(60).                                             168500      
002687*                                                                 168600      
002688  01  S422-81-CTR-SALIDA.                                         168700      
002689     03 S422-81-CTR-NUMREG        PIC 9(002) COMP.                168800      
002690     03 S422-81-CTR-OCC OCCURS 50.                                168900      
002691        05 S422-81-CTR-NUMCSI     PIC 9(002) COMP.                169000      
002692        05 S422-81-CTA-NUMPROD    PIC 9(004) COMP.                169100      
002693        05 S422-81-CTA-CVEINST    PIC 9(002) COMP.                169200      
002694        05 S422-81-CTA-NUMSUC     PIC 9(004) COMP.                169300      
002695        05 S422-81-CTA-NUMPREF    PIC 9(004) COMP.                169400      
002696        05 S422-81-CTA-NUM        PIC 9(012) COMP.                169500      
002697        05 S422-81-CTE-NUM        PIC 9(012) COMP.                169600      
002698        05 S422-81-CTA-DIACORTE   PIC 9(002) COMP.                169700      
002699        05 S422-81-CTA-CVEMONEDA  PIC 9(002) COMP.                169800      
002700        05 S422-81-CTA-CVEMANEJO  PIC 9(002) COMP.                169900      
002701        05 S422-81-CTE-CVESTATUS  PIC 9(002) COMP.                170000      
002702        05 S422-81-CTA-CVEUSO     PIC 9(002) COMP.                170100      
002703        05 S422-81-CTA-RESTRIC    PIC 9(002) COMP.                170200      
002704        05 S422-81-CTA-RESTCON    PIC 9(002) COMP.                170300      
002705        05 S422-81-CTA-OPCPAGO    PIC 9(002) COMP.                170400      
002706        05 S422-81-CTE-RGOPAGO    PIC 9(002) COMP.                170500      
002707        05 S422-81-CTA-FECAPER    PIC 9(008) COMP.                170600      
002708        05 S422-81-CTA-FECULTMOD  PIC 9(008) COMP.                170700      
002709        05 S422-81-CTE-FECCANCEL  PIC 9(008) COMP.                170800      
002710        05 FILLER                 PIC X(007).                     170900      
002711*      SIZE reg OCCURS X(48)                                      171000      
002712* SIZE SALIDA = 1+(48*50) = 2401                                  171100      
002713*                                                                 171200      
002714  01  S422-81-RCTR-SALIDA REDEFINES S422-81-CTR-SALIDA.           171300      
002715     03 S422-81-CTR-ERROR         PIC 9(004) COMP.                171400      
002716     03 S422-81-CTR-ERRORTYPE     PIC 9(004) COMP.                171500      
002717     03 S422-81-CTR-STRUCTURE     PIC 9(004) COMP.                171600      
002718     03 FILLER                    PIC X(2395).                    171700      
002719*                                                                 171800      
002720***************************************************************** 171900      
002721***    PARAMETROS   S016_L422_XCTECTA (82)                   **** 172000      
002722****   CONSULTA B05CTECTA CON OPCION                           ** 172100      
002723***************************************************************** 172200      
002724*                                                                 172300      
002725  77  R422-82-CTR-ERROR                    PIC S9(11) BINARY.     172400      
002726*                                                                 172500      
002727  01  E422-82-CTR-ENTRADA.                                        172600      
002728     03 E422-82-CTR-NUMCSI                PIC 9(002) COMP.        172700      
002729     03 E422-82-CTE-NUM                   PIC 9(012) COMP.        172800      
002730     03 E422-82-CTA-NUMPROD               PIC 9(004) COMP.        172900      
002731     03 E422-82-CTA-CVEINST               PIC 9(004) COMP.        173000      
002732     03 E422-82-CTA-NUMPREF               PIC 9(004) COMP.        173100      
002733     03 E422-82-CTA-NUM                   PIC 9(012) COMP.        173200      
002734     03 E422-82-OPCION                    PIC 9(002) COMP.        173300      
002735     03 FILLER                            PIC X(20).              173400      
002736* SIZE ENTRADA X(60)*                                             173500      
002737  01  S422-82-CTR-SALIDA.                                         173600      
002738     03 S422-82-CTR-NUMCSI        PIC 9(002) COMP.                173700      
002739     03 S422-82-CTE-NUM           PIC 9(012) COMP.                173800      
002740     03 S422-82-CTA-NUMPROD       PIC 9(004) COMP.                173900      
002741     03 S422-82-CTA-CVEINST       PIC 9(004) COMP.                174000      
002742     03 S422-82-CTA-NUMPREF       PIC 9(004) COMP.                174100      
002743     03 S422-82-CTA-NUM           PIC 9(012) COMP.                174200      
002744     03 S422-82-CTA-NUMSUC        PIC 9(004) COMP.                174300      
002745     03 S422-82-CTA-RELCTE        PIC 9(002) COMP.                174400      
002746     03 S422-82-CTA-USOBCAELE     PIC 9(002) COMP.                174500      
002747     03 S422-82-CTA-ASOCIADAX     PIC 9(002) COMP.                174600      
002748     03 S422-82-CTA-FEALTACTE     PIC 9(008) COMP.                174700      
002749     03 S422-82-CTA-FEMODCTE      PIC 9(008) COMP.                174800      
002750     03 S422-82-CTA-3DIGITOS      PIC 9(004) COMP.                174900      
002751     03 FILLER                    PIC X(20).                      175000      
002752* SIZE SALIDA X(54)*                                              175100      
002753*                                                                 175200      
002754  01  S422-82-RCTR-SALIDA REDEFINES S422-82-CTR-SALIDA.           175300      
002755     03 S422-82-CTR-ERROR         PIC 9(004) COMP.                175400      
002756     03 S422-82-CTR-ERRORTYPE     PIC 9(004) COMP.                175500      
002757     03 S422-82-CTR-STRUCTURE     PIC 9(004) COMP.                175600      
002758     03 FILLER                    PIC X(048).                     175700      
002759*                                                                 175800      
002760******************************************************************175900      
002761***    PARAMETROS  S016_L422_B04SXCTAPRD (83)                  ***176000      
002762****   CONSULTA B04CUENTAS CON OPCION                           **176100      
002763******************************************************************176200      
002764*                                                                 176300      
002765 77  R422-83-CTR-ERROR                   PIC S9(11) BINARY.       176400      
002766*                                                                 176500      
002767 01  E422-83-CTR-ENTRADA.                                         176600      
002768     03 E422-83-CTA-NUMPREF               PIC 9(004) COMP.        176700      
002769     03 E422-83-CTA-NUM                   PIC 9(012) COMP.        176800      
002770     03 E422-83-CTA-NUMPROD               PIC 9(004) COMP.        176900      
002771     03 E422-83-CTA-CVEINST               PIC 9(004) COMP.        177000      
002772     03 E422-83-OPCION                    PIC 9(002) COMP.        177100      
002773     03 FILLER                            PIC X(047).             177200      
002774* SIZE ENTRADA X(60)*                                             177300      
002775*                                                                 177400      
002776*                                                                 177500      
002777 01  S422-83-CTR-SALIDA.                                          177600      
002778     03 S422-83-CTR-NUMCSI                PIC 9(002) COMP.        177700      
002779     03 S422-83-CTA-NUMPROD               PIC 9(004) COMP.        177800      
002780     03 S422-83-CTA-CVEINST               PIC 9(004) COMP.        177900      
002781     03 S422-83-CTA-NUMSUC                PIC 9(004) COMP.        178000      
002782     03 S422-83-CTA-NUMPREF               PIC 9(004) COMP.        178100      
002783     03 S422-83-CTA-NUM                   PIC 9(012) COMP.        178200      
002784     03 S422-83-CTE-NUM                   PIC 9(012) COMP.        178300      
002785     03 S422-83-CTA-DIACORTE              PIC 9(002) COMP.        178400      
002786     03 S422-83-CTA-CVEMONEDA             PIC 9(002) COMP.        178500      
002787     03 S422-83-CTA-CVEENVIO              PIC 9(004) COMP.        178600      
002788     03 S422-83-CTA-EDIEDOCTA             PIC 9(002) COMP.        178700      
002789     03 S422-83-CTA-CVEMANEJO             PIC 9(002) COMP.        178800      
002790     03 S422-83-CTA-CVESTATUS             PIC 9(002) COMP.        178900      
002791     03 S422-83-CTA-CVEUSO                PIC 9(002) COMP.        179000      
002792     03 S422-83-CTA-RESTRIC               PIC 9(002) COMP.        179100      
002793     03 S422-83-CTA-RESTCON               PIC 9(002) COMP.        179200      
002794     03 S422-83-CTA-OPCPAGO               PIC 9(002) COMP.        179300      
002795     03 S422-83-CTA-RGOPAGO               PIC 9(002) COMP.        179400      
002796     03 S422-83-CTA-FECAPER               PIC 9(008) COMP.        179500      
002797     03 S422-83-CTA-FECULTMOD             PIC 9(008) COMP.        179600      
002798     03 S422-83-CTA-FECCANCEL             PIC 9(008) COMP.        179700      
002799     03 S422-83-CTA-REFECVE               PIC 9(002) COMP.        179800      
002800     03 S422-83-CTA-VENDNOMI              PIC 9(010) COMP.        179900      
002801     03 S422-83-CTA-REFENOMI              PIC 9(010) COMP.        180000      
002802     03 S422-83-CTA-DISEDOCTA             PIC 9(002) COMP.        180100      
002803     03 FILLER                            PIC X(09).              180200      
002804* SIZE SALIDA X(66)*                                              180300      
002805*                                                                 180400      
002806*                                                                 180500      
002807 01  S422-83-RCTR-SALIDA REDEFINES S422-83-CTR-SALIDA.            180600      
002808     03 S422-83-CTR-ERROR                 PIC 9(004) COMP.        180700      
002809     03 S422-83-CTR-ERRORTYPE             PIC 9(004) COMP.        180800      
002810     03 S422-83-CTR-STRUCTURE             PIC 9(004) COMP.        180900      
002811     03 FILLER                            PIC X(60).              181000      
002812*                                                                 181100      
002813******************************************************************181200      
002814***    PARAMETROS  S016_L422_B01SXCTE    (84)                  ***181300      
002815****   CONSULTA B01CLIENTES y B04CUENTAS CON OPCION             **181400      
002816** INFOWARE PROYECTO SHJ AGOSTO DEL 2011 (XRFC)             SHJ **181500      
002817******************************************************************181600      
002818*                                                                 181700      
002819 77  R422-84-CTR-ERROR                   PIC S9(11) BINARY.       181800      
002820*                                                                 181900      
002821 01  E422-84-CTR-ENTRADA.                                         182000      
002822     03 E422-84-CTE-NUM                   PIC 9(012) COMP.        182100      
002823     03 E422-84-CTA-NUMPROD               PIC 9(004) COMP.        182200      
002824     03 E422-84-CTA-CVEINST               PIC 9(004) COMP.        182300      
002825     03 E422-84-CTA-NUMPREF               PIC 9(004) COMP.        182400      
002826     03 E422-84-CTA-NUM                   PIC 9(012) COMP.        182500      
002827     03 E422-84-OPCION                    PIC 9(002) COMP.        182600      
002828     03 E422-84-CTR-CSI                   PIC 9(002) COMP.        182700      
002829***** INICIO MODIFICACION XRFC *****                              182800      
002830     03 E422-84-CTE-CODINI                PIC X(004).             182900      
002831     03 E422-84-CTE-FECNAC                PIC 9(006) COMP.        183000      
002832     03 E422-84-CTE-CODHOM                PIC X(005).             183100      
002833*********************************************************         183200      
002834     03 FILLER                            PIC X(028).             183300      
002835* SIZE ENTRADA X(60)*                                             183400      
002836*                                                                 183500      
002837 01  S422-84-CTR-SALIDA.                                          183600      
002838     03 S422-84-CTE-NUM                   PIC 9(012) COMP.        183700      
002839     03 S422-84-CTE-NOM                   PIC X(055).             183800      
002840     03 S422-84-CTE-CALLENUM              PIC X(036).             183900      
002841     03 S422-84-CTE-NOMCOL                PIC X(024).             184000      
002842     03 S422-84-CTE-NOMPOB                PIC X(020).             184100      
002843     03 S422-84-CTE-CVEEDO                PIC 9(002) COMP.        184200      
002844     03 S422-84-CTE-NUMCP                 PIC 9(006) COMP.        184300      
002845     03 S422-84-CTE-NUMTEL                PIC 9(010) COMP.        184400      
002846     03 S422-84-CTE-NUMTELEXT             PIC 9(006) COMP.        184500      
002847     03 S422-84-CTE-CVETEL                PIC 9(002) COMP.        184600      
002848     03 S422-84-CTE-NUMTEL2               PIC 9(010) COMP.        184700      
002849     03 S422-84-CTE-NUMTELEX2             PIC 9(006) COMP.        184800      
002850     03 S422-84-CTE-CVETEL2               PIC 9(002) COMP.        184900      
002851     03 S422-84-CTR-CVESTADOM             PIC 9(002) COMP.        185000      
002852     03 S422-84-CTR-CVEDOM                PIC 9(002) COMP.        185100      
002853     03 S422-84-CTR-NUMDOMS               PIC 9(004) COMP.        185200      
002854     03 S422-84-CTE-CVEPERS               PIC 9(002) COMP.        185300      
002855     03 S422-84-CTE-CVETIPO               PIC 9(002) COMP.        185400      
002856     03 S422-84-CTE-NUMCLASIF             PIC 9(002) COMP.        185500      
002857     03 S422-84-CTE-CODINI                PIC X(004).             185600      
002858     03 S422-84-CTE-FECNAC                PIC 9(006) COMP.        185700      
002859     03 S422-84-CTE-CODHOM                PIC X(005).             185800      
002860     03 S422-84-CTE-CVENACION             PIC 9(002) COMP.        185900      
002861     03 S422-84-CTE-CVESEXO               PIC 9(002) COMP.        186000      
002862     03 S422-84-CTE-FECNACIM-2K           PIC 9(008) COMP.        186100      
002863     03 S422-84-CTE-CAEB                  PIC 9(006) COMP.        186200      
002864     03 S422-84-CTE-CVEACTBM              PIC 9(006) COMP.        186300      
002865     03 S422-84-CTE-EDOCTACON             PIC 9(002) COMP.        186400      
002866     03 S422-84-CTE-CVESECTOR             PIC 9(002) COMP.        186500      
002867     03 S422-84-CTE-CVEPERBCO             PIC 9(002) COMP.        186600      
002868     03 S422-84-CTE-CVESEG                PIC 9(002) COMP.        186700      
002869     03 S422-84-CTE-DIACORTE              PIC 9(002) COMP.        186800      
002870     03 S422-84-CTE-CVEENVIO              PIC 9(004) COMP.        186900      
002871     03 S422-84-CTE-NUMOFICON             PIC 9(004) COMP.        187000      
002872*  NUMOFICON ES EQUIVALENTE A SUCURSAL PROMOTORA                  187100      
002873     03 S422-84-CTE-CVESTATUS             PIC 9(002) COMP.        187200      
002874     03 S422-84-OFI-NUMCSIALT             PIC 9(002) COMP.        187300      
002875     03 S422-84-CTE-FECALTA               PIC 9(008) COMP.        187400      
002876     03 S422-84-CTE-FECULTMOD             PIC 9(008) COMP.        187500      
002877     03 S422-84-CTE-NUMUNIMER             PIC 9(004) COMP.        187600      
002878     03 S422-84-CTE-RIEBNM                PIC X(002).             187700      
002879     03 S422-84-CTE-RIEBM                 PIC X(002).             187800      
002880     03 S422-84-CTE-OCUPACION             PIC 9(002) COMP.        187900      
002881     03 S422-84-CTE-CVEPUB                PIC 9(002) COMP.        188000      
002882     03 S422-84-CTE-SITUACION             PIC X(004).             188100      
002883     03 S422-84-CTE-FECPREV               PIC 9(006) COMP.        188200      
002884     03 S422-84-CTE-RECEPSUC6             PIC 9(004) COMP.        188300      
002885     03 S422-84-CTE-HHRECEP6              PIC 9(004) COMP.        188400      
002886     03 FILLER                            PIC X(014).             188500      
002887* SIZE SALIDA X(246)*                                             188600      
002888*                                                                 188700      
002889*                                                                 188800      
002890  01  S422-84-RCTR-SALIDA REDEFINES S422-84-CTR-SALIDA.           188900      
002891     03 S422-84-CTR-ERROR                 PIC 9(004)    COMP.     189000      
002892     03 S422-84-CTR-ERRORTYPE             PIC 9(004)    COMP.     189100      
002893     03 S422-84-CTR-STRUCTURE             PIC 9(004)    COMP.     189200      
002894     03 FILLER                            PIC X(240).             189300      
002895******************************************************************189400      
002896***   PARAMETROS  S016_L422_B09SXCTESISTIP (85)                ***189500      
002897****   CONSULTA B09BCAELEC CON OPCION                           **189600      
002898******************************************************************189700      
002899*                                                                 189800      
002900   77  R422-85-CTR-ERROR                 PIC S9(11) BINARY.       189900      
002901*                                                                 190000      
002902  01  E422-85-CTR-ENTRADA.                                        190100      
002903     03 E422-85-CTR-NUMCSI                PIC 9(002) COMP.        190200      
002904     03 E422-85-CTE-NUM                   PIC 9(012) COMP.        190300      
002905     03 E422-85-SER-NUM                   PIC 9(004) COMP.        190400      
002906     03 E422-85-SER-CVETIPO               PIC 9(002) COMP.        190500      
002907     03 E422-85-OPCION                    PIC 9(002) COMP.        190600      
002908     03 FILLER                            PIC X(048).             190700      
002909* SIZE ENTRADA X(60)*                                             190800      
002910*                                                                 190900      
002911*                                                                 191000      
002912 01 S422-85-CTR-SALIDA.                                           191100      
002913      03 S422-85-CTR-NUMCSI               PIC 9(002) COMP.        191200      
002914      03 S422-85-CTE-NUM                  PIC 9(012) COMP.        191300      
002915      03 S422-85-SER-NUM                  PIC 9(004) COMP.        191400      
002916      03 S422-85-SER-CVETIPO              PIC 9(002) COMP.        191500      
002917      03 S422-85-SER-CVEDISP              PIC 9(004) COMP.        191600      
002918      03 S422-85-SER-NOMESTA              PIC X(008).             191700      
002919      03 S422-85-SER-NUMSUCPR             PIC 9(004) COMP.        191800      
002920      03 S422-85-CTA-NUMPROD              PIC 9(004) COMP.        191900      
002921      03 S422-85-CTA-CVEINST              PIC 9(004) COMP.        192000      
002922      03 S422-85-CTA-NUMPREF              PIC 9(004) COMP.        192100      
002923      03 S422-85-CTA-NUM                  PIC 9(012) COMP.        192200      
002924      03 S422-85-SER-COBCOM1              PIC 9(002) COMP.        192300      
002925      03 S422-85-SER-COBCOM2              PIC 9(002) COMP.        192400      
002926      03 S422-85-SER-COBCOM3              PIC 9(002) COMP.        192500      
002927      03 S422-85-SER-COBCOM4              PIC 9(002) COMP.        192600      
002928      03 S422-85-SER-COBCOM5              PIC 9(002) COMP.        192700      
002929      03 S422-85-SER-COBCOM6              PIC 9(002) COMP.        192800      
002930      03 S422-85-SER-VERSOFT              PIC 9(004) COMP.        192900      
002931      03 S422-85-SER-PROPEQUI             PIC 9(002) COMP.        193000      
002932      03 S422-85-CTE-PIN                  PIC 9(004) COMP.        193100      
002933      03 S422-85-CTE-PINVER               PIC 9(002) COMP.        193200      
002934      03 S422-85-CTE-CVENOPIN             PIC 9(002) COMP.        193300      
002935      03 S422-85-SER-CVESTATUS            PIC 9(002) COMP.        193400      
002936      03 S422-85-CTR-CVEENVIO             PIC 9(004) COMP.        193500      
002937      03 S422-85-SER-DIACORTE             PIC 9(002) COMP.        193600      
002938      03 S422-85-SER-EDIEDOCTA            PIC 9(002) COMP.        193700      
002939      03 S422-85-SER-DISEDOCTA            PIC 9(002) COMP.        193800      
002940      03 S422-85-SER-FECONTRAT            PIC 9(008) COMP.        193900      
002941      03 S422-85-SER-FECRENOVA            PIC 9(008) COMP.        194000      
002942      03 S422-85-SER-FECCANCEL            PIC 9(008) COMP.        194100      
002943      03 S422-85-SER-FECULTMOD            PIC 9(008) COMP.        194200      
002944      03 S422-85-SER-FECMODPIN            PIC 9(008) COMP.        194300      
002945      03 S422-85-SER-FECULTMOV            PIC 9(008) COMP.        194400      
002946      03 S422-85-SER-FECINIOPE            PIC 9(008) COMP.        194500      
002947      03 FILLER                           PIC X(015).             194600      
002948* SIZE SALIDA X(96)                                               194700      
002949*                                                                 194800      
002950 01  S422-85-RCTR-SALIDA REDEFINES S422-85-CTR-SALIDA.            194900      
002951     03 S422-85-CTR-ERROR                 PIC 9(004)    COMP.     195000      
002952     03 S422-85-CTR-ERRORTYPE             PIC 9(004)    COMP.     195100      
002953     03 S422-85-CTR-STRUCTURE             PIC 9(004)    COMP.     195200      
002954     03 FILLER                            PIC X(090).             195300      
002955*                                                                 195400      
002956******************************************************************195500      
002957****  PARAMETROS S016_L422_NOMBRES_ADICIONALES (86)           ****195600      
002958****  CONSULTA  B01CLIENTES y B03NOMBRES MULTIPLE NUMREG SOLO S **195700      
002959******************************************************************195800      
002960*                                                                 195900      
002961 77  R422-86-CTR-ERROR                    PIC S9(11) BINARY.      196000      
002962*                                                                 196100      
002963 01  E422-86-CTR-ENTRADA.                                         196200      
002964     03 E422-86-CTE-NUM                   PIC 9(012) COMP.        196300      
002965     03 E422-86-CTR-NUMNOM                PIC 9(002) COMP.        196400      
002966     03 FILLER                            PIC X(052).             196500      
002967* SIZE ENTRADA X(60)*                                             196600      
002968*                                                                 196700      
002969 01  S422-86-CTR-SALIDA.                                          196800      
002970     03 S422-86-CTR-NUMREG                PIC 9(002) COMP.        196900      
002971     03 S422-86-CTR-NUMCSI                PIC 9(002) COMP.        197000      
002972     03 S422-86-CTE-NUM                   PIC 9(012) COMP.        197100      
002973     03 S422-86-OCCURS                    OCCURS 10 TIMES.        197200      
002974        05 S422-86-CTR-NUMNOM             PIC 9(004) COMP.        197300      
002975        05 S422-86-CTR-NOMUSOS            PIC 9(004) COMP.        197400      
002976        05 S422-86-CTE-NOMCORTO           PIC X(026).             197500      
002977        05 S422-86-CTE-CVETITCTE          PIC 9(002) COMP.        197600      
002978        05 S422-86-CTR-CVECONT            PIC 9(002) COMP.        197700      
002979        05 S422-86-CTR-FECALTNOM          PIC 9(008) COMP.        197800      
002980        05 S422-86-CTR-FECMODNOM          PIC 9(008) COMP.        197900      
002981        05 FILLER                         PIC X(026).             198000      
002982*      SIZE reg OCCURS X(66)                                      198100      
002983* SIZE SALIDA = 8+(66*10) = 668                                   198200      
002984*                                                                 198300      
002985 01  S422-86-RCTR-SALIDA REDEFINES S422-86-CTR-SALIDA.            198400      
002986     03 S422-86-CTR-ERROR                 PIC 9(004)    COMP.     198500      
002987     03 S422-86-CTR-ERRORTYPE             PIC 9(004)    COMP.     198600      
002988     03 S422-86-CTR-STRUCTURE             PIC 9(004)    COMP.     198700      
002989     03 FILLER                            PIC X(662).             198800      
002990*                                                                 198900      
002991******************************************************************199000      
002992*    PARAMETROS PARA EL ENTRY-POINT S016_L422_COTITULARES (87)   *199100      
002993**  CONSULTA  B01CLIENTES y B06COTITULAR MULTIPLE NUMREG SOLO S **199200      
002994******           CON OPCION                                    ***199300      
002995******************************************************************199400      
002996*                                                                 199500      
002997 77  R422-87-CTR-ERROR                    PIC S9(11) BINARY.      199600      
002998*                                                                 199700      
002999 01  E422-87-CTR-ENTRADA.                                         199800      
003000     03 E422-87-CTE-NUM                   PIC 9(012) COMP.        199900      
003001     03 E422-87-CTA-NUMPROD               PIC 9(004) COMP.        200000      
003002     03 E422-87-CTA-CVEINST               PIC 9(004) COMP.        200100      
003003     03 E422-87-CTA-NUMPREF               PIC 9(004) COMP.        200200      
003004     03 E422-87-CTA-NUM                   PIC 9(012) COMP.        200300      
003005     03 E422-87-CTR-NUMPTRNOM             PIC 9(004) COMP.        200400      
003006     03 E422-87-OPCION                    PIC 9(002) COMP.        200500      
003007     03 FILLER                            PIC X(039).             200600      
003008* SIZE ENTRADA X(60)*                                             200700      
003009*                                                                 200800      
003010 01  S422-87-CTR-SALIDA.                                          200900      
003011     03 S422-87-CTR-NUMCSI                PIC 9(002) COMP.        201000      
003012     03 S422-87-CTE-NUM                   PIC 9(012) COMP.        201100      
003013     03 S422-87-CTR-NUMREG                PIC 9(002) COMP.        201200      
003014     03 S422-87-OCCURS                    OCCURS 10 TIMES.        201300      
003015        05 S422-87-CTR-NUMMDA             PIC 9(002) COMP.        201400      
003016        05 S422-87-CTR-NUMPROD            PIC 9(004) COMP.        201500      
003017        05 S422-87-CTE-CVEINST            PIC 9(004) COMP.        201600      
003018        05 S422-87-CTA-NUMPREF            PIC 9(004) COMP.        201700      
003019        05 S422-87-CTA-NUM                PIC 9(012) COMP.        201800      
003020        05 S422-87-CTR-NUMPTRNOM          PIC 9(004) COMP.        201900      
003021        05 S422-87-CTR-FECALTNOM          PIC 9(008) COMP.        202000      
003022        05 S422-87-CTR-FECMODNOM          PIC 9(008) COMP.        202100      
003023        05 FILLER                         PIC X(007).             202200      
003024*      SIZE reg OCCURS X(30)                                      202300      
003025* SIZE SALIDA = 8+(30*10) = 308                                   202400      
003026*                                                                 202500      
003027 01  S422-87-RCTR-SALIDA REDEFINES S422-87-CTR-SALIDA.            202600      
003028     03 S422-87-CTR-ERROR                 PIC 9(004)    COMP.     202700      
003029     03 S422-87-CTR-ERRORTYPE             PIC 9(004)    COMP.     202800      
003030     03 S422-87-CTR-STRUCTURE             PIC 9(004)    COMP.     202900      
003031     03 FILLER                            PIC X(302).             203000      
003032*                                                                 203100      
003033******************************************************************203200      
003034*                S016_L422_B07SxCtaRelCte (88)                   *203300      
003035*** CONSULTA B04CUENTAS y B07CTACTA  CON OPCION               ****203400      
003036******************************************************************203500      
003037*                                                                 203600      
003038  77  R422-88-CTR-ERROR                   PIC S9(11) BINARY.      203700      
003039*                                                                 203800      
003040  01  E422-88-CTR-ENTRADA.                                        203900      
003041     03 E422-88-CTA-NUMPROREL             PIC 9(004) COMP.        204000      
003042     03 E422-88-CTA-CVEINSREL             PIC 9(004) COMP.        204100      
003043     03 E422-88-CTA-NUMCTOREL             PIC 9(016) COMP.        204200      
003044     03 E422-88-CTA-NUMCTORELRED REDEFINES E422-88-CTA-NUMCTOREL. 204300      
003045        05 E422-88-CTA-NUMPREREL          PIC 9(004) COMP.        204400      
003046        05 E422-88-CTA-NUMREL             PIC 9(012) COMP.        204500      
003047     03 E422-88-CTR-CVERELCTA             PIC 9(002) COMP.        204600      
003048     03 E422-88-CTA-NUMPROD               PIC 9(004) COMP.        204700      
003049     03 E422-88-CTA-CVEINST               PIC 9(004) COMP.        204800      
003050     03 E422-88-CTA-NUMCTO                PIC 9(016) COMP.        204900      
003051     03 E422-88-CTA-NUMCTORED REDEFINES E422-88-CTA-NUMCTO.       205000      
003052        05 E422-88-CTA-NUMPREF            PIC 9(004) COMP.        205100      
003053        05 E422-88-CTA-NUM                PIC 9(012) COMP.        205200      
003054     03 E422-88-OPCION                    PIC 9(002) COMP.        205300      
003055     03 FILLER                            PIC X(034).             205400      
003056* SIZE ENTRADA X(60)*                                             205500      
003057*                                                                 205600      
003058 01  S422-88-CTR-SALIDA.                                          205700      
003059     03 S422-88-CTR-NUMCSI                PIC 9(002) COMP.        205800      
003060     03 S422-88-CTE-NUM                   PIC 9(012) COMP.        205900      
003061     03 S422-88-CTA-NUMPROD               PIC 9(004) COMP.        206000      
003062     03 S422-88-CTA-CVEINST               PIC 9(004) COMP.        206100      
003063     03 S422-88-CTA-NUMCTO                PIC 9(016) COMP.        206200      
003064     03 S422-88-CTA-NUMCTORED  REDEFINES  S422-88-CTA-NUMCTO.     206300      
003065        05 S422-88-CTA-NUMPREF            PIC 9(004) COMP.        206400      
003066        05 S422-88-CTA-NUM                PIC 9(012) COMP.        206500      
003067     03 S422-88-CTR-CVERELCTA             PIC 9(002) COMP.        206600      
003068     03 S422-88-CTA-NUMPROREL             PIC 9(004) COMP.        206700      
003069     03 S422-88-CTA-CVEINSREL             PIC 9(004) COMP.        206800      
003070     03 S422-88-CTA-NUMCTOREL             PIC 9(016) COMP.        206900      
003071     03 S422-88-CTA-NUMCTORELRED REDEFINES S422-88-CTA-NUMCTOREL. 207000      
003072        05 S422-88-CTA-NUMPREREL          PIC 9(004) COMP.        207100      
003073        05 S422-88-CTA-NUMREL             PIC 9(012) COMP.        207200      
003074     03 S422-88-CTA-FECALTA               PIC 9(008) COMP.        207300      
003075     03 S422-88-CTA-FECULTMOD             PIC 9(008) COMP.        207400      
003076*                                                                 207500      
003077*                                                                 207600      
003078******************************************************************207700      
003079*                S016_L422_B10SxCteRepPin (89)                   *207800      
003080****  CONSULTA  B01CLIENTES y B10SXCTEREPPIN CON OPCION         **207900      
003081******************************************************************208000      
003082*                                                                 208100      
003083 77  R422-89-CTR-ERROR                    PIC S9(11) BINARY.      208200      
003084*                                                                 208300      
003085 01  E422-89-CTR-ENTRADA.                                         208400      
003086     03 E422-89-CTE-NUM                   PIC 9(012) COMP.        208500      
003087     03 E422-89-CTE-REPPIN                PIC X(006)     .        208600      
003088     03 E422-89-OPCION                    PIC 9(002) COMP.        208700      
003089     03 FILLER                            PIC X(047).             208800      
003090* SIZE ENTRADA X(60)*                                             208900      
003091*                                                                 209000      
003092 01  S422-89-CTR-SALIDA.                                          209100      
003093     03 S422-89-CTR-NUMCSI                PIC 9(002) COMP.        209200      
003094     03 S422-89-CTE-NUM                   PIC 9(012) COMP.        209300      
003095     03 S422-89-CTE-REPPIN                PIC X(006)     .        209400      
003096     03 S422-89-CTE-REPNOMB               PIC X(036)     .        209500      
003097     03 S422-89-CTE-REPLIMITE             PIC 9(014) COMP.        209600      
003098     03 S422-89-CTE-REPPRIVILEGIO         PIC 9(002) COMP.        209700      
003099     03 S422-89-CTE-REPFECALTA            PIC 9(008) COMP.        209800      
003100     03 S422-89-CTE-REPFECULTMOD          PIC 9(008) COMP.        209900      
003101     03 FILLER                            PIC X(19).              210000      
003102* SIZE SALIDA X(84)*                                              210100      
003103*                                                                 210200      
003104*****************************************************             210300      
003105******      S016_L422_B09SXSISTIPCTE (90)************             210400      
003106******  CONSULTA AL B09BCAELEC              *********             210500      
003107*****************************************************             210600      
003108****PARAMETRO DE ENTRADA :                                        210700      
003109*                                                                 210800      
003110  01  E422-90-CTR-ENTRADA.                                        210900      
003111* OPCIONAL                                                        211000      
003112     03 E422-90-CTR-NUMCSI           PIC 9(002) COMP.             211100      
003113* NECESARIOS                                                      211200      
003114     03 E422-90-CTE-NUM              PIC 9(012) COMP.             211300      
003115     03 E422-90-SER-NUM              PIC 9(004) COMP.             211400      
003116     03 E422-90-SER-CVETIPO          PIC 9(002) COMP.             211500      
003117     03 FILLER                       PIC X(050).                  211600      
003118* SIZE ENTRADA X(60)*                                             211700      
003119*                                                                 211800      
003120*  PARAMETRO DE SALIDA                                            211900      
003121*                                                                 212000      
003122  01 S422-90-CTR-SALIDA.                                          212100      
003123     03 S422-90-CTR-NUMCSI        PIC 9(002) COMP.                212200      
003124     03 S422-90-CTE-NUM           PIC 9(012) COMP.                212300      
003125     03 S422-90-SER-NUM           PIC 9(004) COMP.                212400      
003126     03 S422-90-SER-CVETIPO       PIC 9(002) COMP.                212500      
003127     03 S422-90-SER-CVEDISP       PIC 9(004) COMP.                212600      
003128     03 S422-90-SER-NOMESTA       PIC X(008).                     212700      
003129     03 S422-90-SER-NUMSUCPR      PIC 9(004) COMP.                212800      
003130     03 S422-90-CTA-NUMPROD       PIC 9(004) COMP.                212900      
003131     03 S422-90-CTA-CVEINST       PIC 9(002) COMP.                213000      
003132     03 S422-90-CTA-NUMPREF       PIC 9(004) COMP.                213100      
003133     03 S422-90-CTA-NUM           PIC 9(012) COMP.                213200      
003134     03 S422-90-SER-COBCOM1       PIC 9(002) COMP.                213300      
003135     03 S422-90-SER-COBCOM2       PIC 9(002) COMP.                213400      
003136     03 S422-90-SER-COBCOM3       PIC 9(002) COMP.                213500      
003137     03 S422-90-SER-COBCOM4       PIC 9(002) COMP.                213600      
003138     03 S422-90-SER-COBCOM5       PIC 9(002) COMP.                213700      
003139     03 S422-90-SER-COBCOM6       PIC 9(002) COMP.                213800      
003140     03 S422-90-SER-VERSOFT       PIC 9(004) COMP.                213900      
003141     03 S422-90-SER-PROPEQUI      PIC 9(002) COMP.                214000      
003142     03 S422-90-CTE-PIN           PIC 9(004) COMP.                214100      
003143     03 S422-90-CTE-PINVER        PIC 9(002) COMP.                214200      
003144     03 S422-90-CTE-CVENOPIN      PIC 9(002) COMP.                214300      
003145     03 S422-90-SER-CVESTATUS     PIC 9(002) COMP.                214400      
003146     03 S422-90-CTR-CVEENVIO      PIC 9(004) COMP.                214500      
003147     03 S422-90-SER-DIACORTE      PIC 9(002) COMP.                214600      
003148     03 S422-90-SER-EDIEDOCTA     PIC 9(002) COMP.                214700      
003149     03 S422-90-SER-DISEDOCTA     PIC 9(002) COMP.                214800      
003150     03 S422-90-SER-FECONTRAT-2K  PIC 9(008) COMP.                214900      
003151     03 S422-90-SER-FECRENOVA-2K  PIC 9(008) COMP.                215000      
003152     03 S422-90-SER-FECCANCEL-2K  PIC 9(008) COMP.                215100      
003153     03 S422-90-SER-FECULTMOD-2K  PIC 9(008) COMP.                215200      
003154     03 S422-90-SER-FECMODPIN-2K  PIC 9(008) COMP.                215300      
003155     03 S422-90-SER-FECULTMOV-2K  PIC 9(008) COMP.                215400      
003156     03 S422-90-SER-FECINIOPE-2K  PIC 9(008) COMP.                215500      
003157     03 S422-90-SER-SITUACION     PIC X(004).                     215600      
003158     03 FILLER                    PIC X(024).                     215700      
003159* SIZE SALIDA X(108)                                              215800      
003160*                                                                 215900      
003161 01  S422-90-RCTR-SALIDA REDEFINES S422-90-CTR-SALIDA.            216000      
003162     03 S422-90-CTR-ERROR            PIC 9(004) COMP.             216100      
003163     03 S422-90-CTR-ERRORTYPE        PIC 9(004) COMP.             216200      
003164     03 S422-90-CTR-STRUCTURE        PIC 9(004) COMP.             216300      
003165     03 FILLER                       PIC X(102).                  216400      
003166                                                                  216500      
003167*  RESULTADO DE LA CONSULTA :                                     216600      
003168*                                                                 216700      
003169   77  R422-90-CTR-ERROR          PIC S9(11) BINARY.              216800      
003170*                                                                 216900      
003171*****************************************************             217000      
003172****** S016_L422_ACUM_B04XCTECTA (91)****************             217100      
003173******  CONSULTA AL B04CUENTAS              *********             217200      
003174*****************************************************             217300      
003175*                                                                 217400      
003176*  PARAMETRO DE ENTRADA :                                         217500      
003177*                                                                 217600      
003178   01  E422-91-CTR-ENTRADA.                                       217700      
003179     03 E422-91-CTR-SIST                     PIC 9(004) COMP.     217800      
003180     03 E422-91-CTE-NUM                      PIC 9(012) COMP.     217900      
003181     03 E422-91-CTA-NUMPROD                  PIC 9(004) COMP.     218000      
003182     03 E422-91-CTA-CVEINST                  PIC 9(002) COMP.     218100      
003183     03 E422-91-OPCION                       PIC 9(002) COMP.     218200      
003184     03 FILLER                               PIC X(048).          218300      
003185* SIZE ENTRADA X(60)*                                             218400      
003186**                                                                218500      
003187*                                                                 218600      
003188*  PARAMETRO DE SALIDA                                            218700      
003189**                                                                218800      
003190   01 S422-91-CTR-SALIDA.                                         218900      
003191     02 S422-91-CTECTACUANTOS   OCCURS 20 TIMES.                  219000      
003192          03 S422-91-CTA-NUMPROD          PIC 9(004) COMP.        219100      
003193          03 S422-91-CTA-CVEINST          PIC 9(004) COMP.        219200      
003194          03 S422-91-CUANTOS              PIC 9(004) COMP.        219300      
003195* EN CUANTOS APARECE EL N¥MERO DE CUENTAS PROD-INST QUE TIENE     219400      
003196*   EL CLIENTE CONSULTADO                                         219500      
003197     02 FILLER     PIC X(024).                                    219600      
003198* SIZE SALIDA X(144)*                                             219700      
003199*                                                                 219800      
003200*                                                                 219900      
003201  01  S422-91-RCTR-SALIDA REDEFINES S422-91-CTR-SALIDA.           220000      
003202        03 S422-91-CTR-ERROR         PIC 9(004) COMP.             220100      
003203        03 S422-91-CTR-ERRORTYPE     PIC 9(004) COMP.             220200      
003204        03 S422-91-CTR-STRUCTURE     PIC 9(004) COMP.             220300      
003205        03 FILLER                    PIC X(138).                  220400      
003206*                                                                 220500      
003207*RESULTADO DE LA CONSULTA :                                       220600      
003208*                                                                 220700      
003209    77  R422-91-CTR-ERROR               PIC S9(11) BINARY.        220800      
003210*                                                                 220900      
003211******************************************************************221000      
003212***    PARAMETROS  S016_L422_B01SXCTE_TODO (92)                ***221100      
003213****   CONSULTA B01CLIENTES y B04CUENTAS CON OPCION             **221200      
003214******************************************************************221300      
003215*                                                                 221400      
003216 77  R422-92-CTR-ERROR                   PIC S9(11) BINARY.       221500      
003217*                                                                 221600      
003218 01  E422-92-CTR-ENTRADA.                                         221700      
003219     03 E422-92-CTE-NUM                   PIC 9(012) COMP.        221800      
003220     03 E422-92-CTA-NUMPROD               PIC 9(004) COMP.        221900      
003221     03 E422-92-CTA-CVEINST               PIC 9(004) COMP.        222000      
003222     03 E422-92-CTA-NUMPREF               PIC 9(004) COMP.        222100      
003223     03 E422-92-CTA-NUM                   PIC 9(012) COMP.        222200      
003224     03 E422-92-OPCION                    PIC 9(002) COMP.        222300      
003225     03 FILLER                            PIC X(042).             222400      
003226* SIZE ENTRADA X(60)*                                             222500      
003227*                                                                 222600      
003228 01  S422-92-CTR-SALIDA.                                          222700      
003229     03 S422-92-CTE-NUM                   PIC 9(012) COMP.        222800      
003230     03 S422-92-CTE-NOM                   PIC X(055).             222900      
003231     03 S422-92-CTE-CALLENUM              PIC X(036).             223000      
003232     03 S422-92-CTE-NOMCOL                PIC X(024).             223100      
003233     03 S422-92-CTE-NOMPOB                PIC X(020).             223200      
003234     03 S422-92-CTE-CVEEDO                PIC 9(002) COMP.        223300      
003235     03 S422-92-CTE-NUMCP                 PIC 9(006) COMP.        223400      
003236     03 S422-92-CTE-NUMTEL                PIC 9(010) COMP.        223500      
003237     03 S422-92-CTE-NUMTELEXT             PIC 9(006) COMP.        223600      
003238     03 S422-92-CTE-CVETEL                PIC 9(002) COMP.        223700      
003239     03 S422-92-CTE-NUMTEL2               PIC 9(010) COMP.        223800      
003240     03 S422-92-CTE-NUMTELEX2             PIC 9(006) COMP.        223900      
003241     03 S422-92-CTE-CVETEL2               PIC 9(002) COMP.        224000      
003242     03 S422-92-CTR-CVESTADOM             PIC 9(002) COMP.        224100      
003243     03 S422-92-CTR-CVEDOM                PIC 9(002) COMP.        224200      
003244     03 S422-92-CTR-NUMDOMS               PIC 9(004) COMP.        224300      
003245     03 S422-92-CTE-CVEPERS               PIC 9(002) COMP.        224400      
003246     03 S422-92-CTE-CVETIPO               PIC 9(002) COMP.        224500      
003247     03 S422-92-CTE-NUMCLASIF             PIC 9(002) COMP.        224600      
003248     03 S422-92-CTE-CODINI                PIC X(004).             224700      
003249     03 S422-92-CTE-FECNAC                PIC 9(006) COMP.        224800      
003250     03 S422-92-CTE-CODHOM                PIC X(005).             224900      
003251     03 S422-92-CTE-CVENACION             PIC 9(002) COMP.        225000      
003252     03 S422-92-CTE-CVESEXO               PIC 9(002) COMP.        225100      
003253     03 S422-92-CTE-FECNACIM-2K           PIC 9(008) COMP.        225200      
003254     03 S422-92-CTE-CAEB                  PIC 9(006) COMP.        225300      
003255     03 S422-92-CTE-CVEACTBM              PIC 9(006) COMP.        225400      
003256     03 S422-92-CTE-EDOCTACON             PIC 9(002) COMP.        225500      
003257     03 S422-92-CTE-CVESECTOR             PIC 9(002) COMP.        225600      
003258     03 S422-92-CTE-CVEPERBCO             PIC 9(002) COMP.        225700      
003259     03 S422-92-CTE-CVESEG                PIC 9(002) COMP.        225800      
003260     03 S422-92-CTE-DIACORTE              PIC 9(002) COMP.        225900      
003261     03 S422-92-CTE-CVEENVIO              PIC 9(004) COMP.        226000      
003262     03 S422-92-CTE-NUMOFICON             PIC 9(004) COMP.        226100      
003263*  NUMOFICON ES EQUIVALENTE A SUCURSAL PROMOTORA                  226200      
003264     03 S422-92-CTE-CVESTATUS             PIC 9(002) COMP.        226300      
003265     03 S422-92-OFI-NUMCSIALT             PIC 9(002) COMP.        226400      
003266     03 S422-92-CTE-FECALTA               PIC 9(008) COMP.        226500      
003267     03 S422-92-CTE-FECULTMOD             PIC 9(008) COMP.        226600      
003268     03 S422-92-CTE-NUMUNIMER             PIC 9(004) COMP.        226700      
003269     03 S422-92-CTE-RIEBNM                PIC X(002).             226800      
003270     03 S422-92-CTE-RIEBM                 PIC X(002).             226900      
003271     03 S422-92-CTE-OCUPACION             PIC 9(002) COMP.        227000      
003272     03 S422-92-CTE-CVEPUB                PIC 9(002) COMP.        227100      
003273     03 S422-92-CTE-SITUACION             PIC X(004).             227200      
003274     03 S422-92-CTE-CVEDISENT             PIC 9(002) COMP.        227300      
003275     03 S422-92-CTE-CVEDISSAL             PIC 9(002) COMP.        227400      
003276     03 S422-92-CTE-RECEPDOC OCCURS 6 TIMES.                      227500      
003277         04 S422-92-CTE-RECEPSW           PIC X(001).             227600      
003278         04 S422-92-CTE-RECEPNOMI         PIC 9(010) COMP.        227700      
003279         04 S422-92-CTE-RECEPSUC          PIC 9(004) COMP.        227800      
003280         04 S422-92-CTE-HHRECEP           PIC 9(004) COMP.        227900      
003281         04 S422-92-CTE-FEREDO-2K         PIC 9(008) COMP.        228000      
003282     03 S422-92-CTE-PREVNOMI              PIC 9(010) COMP.        228100      
003283     03 S422-92-CTE-PREVSUC               PIC 9(004) COMP.        228200      
003284     03 S422-92-CTE-FEPREV-2K             PIC 9(008) COMP.        228300      
003285     03 FILLER                            PIC X(004).             228400      
003286* SIZE SALIDA X(324)*                                             228500      
003287*                                                                 228600      
003288*                                                                 228700      
003289  01  S422-92-RCTR-SALIDA REDEFINES S422-92-CTR-SALIDA.           228800      
003290     03 S422-92-CTR-ERROR                 PIC 9(004)    COMP.     228900      
003291     03 S422-92-CTR-ERRORTYPE             PIC 9(004)    COMP.     229000      
003292     03 S422-92-CTR-STRUCTURE             PIC 9(004)    COMP.     229100      
003293     03 FILLER                            PIC X(318).             229200      
003294******************************************************************229300      
003295*************************************************************     229400      
003296**** PARAMETROS S016_L422_DAMENUMDOM;          % (93)        **   229500      
003297**** VER EL ENTRY POINT S016_L422_NUMDOM (17)CONSULTA GENERAL**   229600      
003298*    CONSULTA B01 CLIENTES Y B02DOMICILIOS                   **   229700      
003299*    REGRESA  SI COINCIDE DOM ENTRADA EL NUMDOM IGUAL        **   229800      
003300*    CERO SI NO LO ENCONTRO   NOTA ES 1 SI ES IGUAL AL B01   **   229900      
003301*************************************************************     230000      
003302 01  E422-93-CTR-ENTRADA.                                         230100      
003303     02  E422-93-CTR-NUMCSI          PIC 9(02) COMP.              230200      
003304     02  E422-93-CTE-NUM             PIC 9(12) COMP.              230300      
003305     02  E422-93-CTR-NUMDOM          PIC 9(04) COMP.              230400      
003306     02  E422-93-CTE-CALLENUM           PIC X(36).                230500      
003307     02  E422-93-CTE-NOMCOL             PIC X(24).                230600      
003308     02  E422-93-CTE-NOMPOB             PIC X(20).                230700      
003309     02  E422-93-CTE-CVEEDO             PIC 9(02) COMP.           230800      
003310     02  E422-93-CTE-NUMCP              PIC 9(06) COMP.           230900      
003311     02  E422-93-CTE-NUMTEL             PIC 9(10) COMP.           231000      
003312     02  E422-93-CTE-NUMTEL2            PIC 9(10) COMP.           231100      
003313     02  E422-93-CTR-OPCION             PIC 9(02) COMP.           231200      
003314     02  FILLER                         PIC X(16).                231300      
003315* SIZE ENTRADA X(120).                                            231400      
003316 01 S422-93-CTR-SALIDA.                                           231500      
003317        03 S422-93-CTR-SALIDA-OK           PIC 9(02) COMP.        231600      
003318*DATOS DEL ULTIMO DOMICILIO SI NO OK O DEL DOM SI OK.             231700      
003319        03 S422-93-CTR-NUMCSI              PIC 9(02) COMP.        231800      
003320        03 S422-93-CTE-NUM                 PIC 9(12) COMP.        231900      
003321        03 S422-93-CTR-NUMDOM              PIC 9(04) COMP.        232000      
003322        03 S422-93-CTR-DOMUSOS             PIC 9(04) COMP.        232100      
003323        03 S422-93-CTE-CALLENUM            PIC X(36).             232200      
003324        03 S422-93-CTE-NOMCOL              PIC X(24).             232300      
003325        03 S422-93-CTE-NOMPOB              PIC X(20).             232400      
003326        03 S422-93-CTE-CVEEDO              PIC 9(02) COMP.        232500      
003327        03 S422-93-CTE-NUMCP               PIC 9(06) COMP.        232600      
003328        03 S422-93-CTE-NUMTEL              PIC 9(10) COMP.        232700      
003329        03 S422-93-CTE-NUMTELEXT           PIC 9(06) COMP.        232800      
003330        03 S422-93-CTE-CVETEL              PIC 9(02) COMP.        232900      
003331        03 S422-93-CTE-NUMTEL2             PIC 9(10) COMP.        233000      
003332        03 S422-93-CTE-NUMTELEX2           PIC 9(06) COMP.        233100      
003333        03 S422-93-CTE-CVETEL2             PIC 9(02) COMP.        233200      
003334        03 S422-93-CTE-CVESTADOM           PIC 9(02) COMP.        233300      
003335        03 S422-93-CTE-CVEDOM              PIC 9(02) COMP.        233400      
003336        03 S422-93-CTE-CVEAGEN             PIC X(04).             233500      
003337        03 S422-93-CTE-APDO                PIC X(08).             233600      
003338        03 S422-93-CTR-NUMCSIDOM           PIC 9(02) COMP.        233700      
003339        03 S422-93-CTR-FECALTDOM-2K        PIC 9(08) COMP.        233800      
003340        03 S422-93-CTR-FECMODDOM-2K        PIC 9(08) COMP.        233900      
003341        03 FILLER                          PIC X(08).             234000      
003342*                                                                 234100      
003343* size SALIDA = 1+(144) = 145                                     234200      
003344*                                                                 234300      
003345 77  R422-93-CTR-DOMOER                 PIC S9(11) BINARY.        234400      
003346*********************************************************         234500      
003347*************************************************************     234600      
003348**** PARAMETROS S016_L422_SUCXMEDIO;          % (94)       **     234700      
003349*    CONSULTA LA SUCURSAL ASOCIADA AL MEDIO DE ACCESO      **     234800      
003350*    PARA VALIDAR LA BUSQUEDA SE UTILIZA LA VARIABLE       **     234900      
003351*    RES SOLO SI ES "0" SI ENCONTRO SUCURSAL               **     235000      
003352*************************************************************     235100      
003353 77  R422-94-CTR-ERROR                   REAL.                    235200      
003354*                                                                 235300      
003355 01  E422-94-CTR-ENTRADA.                                         235400      
003356     02  E422-94-MDA-NUMPREF         PIC 9(04) COMP.              235500      
003357     02  E422-94-MDA-NUMCTA          PIC 9(12) COMP.              235600      
003358     02  FILLER                      PIC X(52).                   235700      
003359**SIZE ENTRADA (60)                                               235800      
003360                                                                  235900      
003361 01  S422-94-CTR-SALIDA.                                          236000      
003362     02  S422-94-CTR-NUMSUC          PIC 9(04) COMP.              236100      
003363     02  FILLER                      PIC X(58).                   236200      
003364*SIZE ENTRADA (60)                                                236300      
003365*************************************************************     236400      
003366* PARAMETROS PARA ENTRY POINT S016_L422_DAMENOMNUM(95) ******     236500      
003367*   CONSULTA  B03NOMBRES REGRESA NUMERO DE NOMBRE.       ****     236600      
003368*SI YA EXISTE, O EL N¥MERO DE NOMBRE DONDE DARLO DE ALTA.+1 *     236700      
003369*************************************************************     236800      
003370 01  E422-95-CTR-ENTRADA.                                         236900      
003371     02  E422-95-CTR-NUMCSI              PIC 9(02) COMP.          237000      
003372*            NUMERO DEL CSI DEL QUE SE DESEA LA INFORMACION       237100      
003373*            0  = INFORMACION LOCAL                               237200      
003374*            99 = INFORMACION NACIONAL (SOLO EN VDM)              237300      
003375*            NN = INF. DEL CSI NN                                 237400      
003376     02  E422-95-CTR-NUMSIST             PIC 9(04) COMP.          237500      
003377*            NUMERO DEL SISTEMA LLAMADOR                          237600      
003378     02  E422-95-CTR-NUMPASO             PIC 9(04) COMP.          237700      
003379*            NUMERO DEL PASO LLAMADOR                             237800      
003380     02  E422-95-CTR-CLAVE.                                       237900      
003381         03  E422-95-CTE-NUM             PIC 9(12) COMP.          238000      
003382*            NUMERO DEL CLIENTE  A CONSULTAR                      238100      
003383         03  E422-95-CTR-NUMNOM          PIC 9(04) COMP.          238200      
003384*            NUMERO DE NOMBRE ADICIONAL                           238300      
003385         03  E422-95-CTE-CVETITCTE       PIC 9(02) COMP.          238400      
003386*            NUMERO DE RELACION CON EL CLIENTE TODAS MAS:         238500      
003387*            13   REPRESENTANTE LEGAL                             238600      
003388*            14   REPRESENTANTE ADMINISTRATIVO                    238700      
003389         03  E422-95-CTE-NOMBRE       PIC X(20) .                 238800      
003390         03  E422-95-CTE-APPATERNO       PIC X(20) .              238900      
003391         03  E422-95-CTE-APMATERNO       PIC X(20) .              239000      
003392         03  E422-95-CTR-OPCION          PIC 9(02) COMP.          239100      
003393         03  E422-95-CTE-NOMBRE-S016     PIC X(52) .              239200      
003394         03  FILLER                      PIC X(5).                239300      
003395*SIZE ENTRADA X(132).22*6                                         239400      
003396*                                                                 239500      
003397  01  S422-95-CTR-SALIDA.                                         239600      
003398     02  S422-95-CTR-REGISTRO.                                    239700      
003399         03  S422-95-CTR-NUMNOMBASE       PIC 9(04) COMP.         239800      
003400         03  S422-95-CTR-ULTNUMNOM        PIC 9(04) COMP.         239900      
003401         03  S422-95-CTR-TAMNOM           PIC 9(02) COMP.         240000      
003402         03  S422-95-CTE-SECCION1         PIC X(26).              240100      
003403         03  S422-95-CTE-SECCION2         PIC X(26).              240200      
003404         03  S422-95-CTE-SECCION3         PIC X(10).              240300      
003405*DATOS DEL B03, CON CVECONT, 2 O 3 DEL CTE ENCONTRADO.            240400      
003406         03  S422-95-CTR-NUMCSI          PIC 9(02) COMP.          240500      
003407         03  S422-95-CTE-NUM             PIC 9(12) COMP.          240600      
003408         03  S422-95-CTR-NUMNOM          PIC 9(04) COMP.          240700      
003409         03  S422-95-CTR-NOMUSOS         PIC 9(04) COMP.          240800      
003410         03  S422-95-CTE-NOMCORTO        PIC X(26).               240900      
003411         03  S422-95-CTE-CVETITCTE       PIC 9(02) COMP.          241000      
003412         03  S422-95-CTR-CVECONT         PIC 9(02) COMP.          241100      
003413         03  S422-95-CTR-FECALTNOM-2K    PIC 9(08) COMP.          241200      
003414         03  S422-95-CTR-FECMODNOM-2K    PIC 9(08) COMP.          241300      
003415         03  FILLER                      PIC X(06).               241400      
003416* SIZE SALIDA X(120)                                              241500      
003417*                                                                 241600      
003418 77  R422-95-CTR-ERRNOM                  PIC S9(11) BINARY.       241700      
003419*                                                                 241800      
003420***************************************************************** 241900      
003421* PARAMETROS PARA ENTRY POINT S016_L422_B08SXCTECTATIPOTIT (96)** 242000      
003422*  AMPLIACI¿N DEL S016_L422_CTAMEDIO (61)                    **** 242100      
003423*  YA QUE UTILIZA el MDA-CVETIT UN ELEMENTO MAS EN LA LLAVE     * 242200      
003424***************************************************************** 242300      
003425*   PARAMETRO DE ENTRADA :                                        242400      
003426                                                                  242500      
003427           01    E422-96-CTR-ENTRADA.                             242600      
003428             02    E422-96-CTA-NUMPROD          PIC 9(04) COMP.   242700      
003429* N³mero de producto del que se desea la inf.                     242800      
003430             02    E422-96-CTA-CVEINST          PIC 9(04) COMP.   242900      
003431* Clave del instrumento que se desea conocer                      243000      
003432             02    E422-96-CTA-NUMPREF          PIC 9(04) COMP.   243100      
003433*Prefijo de la cuenta                                             243200      
003434             02    E422-96-CTA-NUM              PIC 9(12) COMP.   243300      
003435* Numero de la cuenta                                             243400      
003436             02    E422-96-MDA-CVETIPO          PIC 9(02) COMP.   243500      
003437* Numero de clave relativa                                        243600      
003438             02    E422-96-OPCION               PIC 9(02) COMP.   243700      
003439* Clave de opcion seleccionada                                    243800      
003440*   00  Cualquier cuenta que encuentres                           243900      
003441*   10   "  y con llave completa.                                 244000      
003442*   01  Cuenta MDA-CVESTATUS = 21                                 244100      
003443*   11   "  y con llave completa.                                 244200      
003444*   02  Cuenta MDA_CVESTATUS NEQ 21                               244300      
003445*   12   "  y con llave completa.                                 244400      
003446             02    E422-96-CTR-NUMCSI           PIC 9(02) COMP.   244500      
003447             02    E422-96-CTE-NUM              PIC 9(12) COMP.   244600      
003448             02    E422-96-MDA-CVETIT           PIC 9(02) COMP.   244700      
003449             02    FILLER                       PIC X(33).        244800      
003450                                                                  244900      
003451                                                                  245000      
003452* SIZE ENTRADA X(60)                                              245100      
003453*--------- PARAMETRO DE SALIDA                                    245200      
003454                                                                  245300      
003455   01  S422-96-CTR-SALIDA.                                        245400      
003456        02 S422-96-CTR-REGISTRO.                                  245500      
003457           03 S422-96-CTR-ERR.                                    245600      
003458              04 S422-96-CTR-ERROR        PIC 9(04) COMP.         245700      
003459              04 S422-96-CTR-ERRORTIPO    PIC 9(04) COMP.         245800      
003460              04 S422-96-CTR-ESTRUCTURA   PIC 9(04) COMP.         245900      
003461           03 S422-96-CTR-NUMCSI          PIC 9(02) COMP.         246000      
003462           03 S422-96-CTE-NUM             PIC 9(12) COMP.         246100      
003463           03 S422-96-CTA-NUMPROD         PIC 9(04) COMP.         246200      
003464           03 S422-96-CTA-CVEINST         PIC 9(02) COMP.         246300      
003465           03 S422-96-CTA-NUMCTO.                                 246400      
003466              04 S422-96-CTA-NUMPREF      PIC 9(04) COMP.         246500      
003467              04 S422-96-CTA-NUM          PIC 9(12) COMP.         246600      
003468           03 S422-96-MDA-CVETIPO         PIC 9(02) COMP.         246700      
003469           03 S422-96-MDA-SUBTIPO         PIC 9(02) COMP.         246800      
003470           03 S422-96-MDA-CVETIT          PIC 9(02) COMP.         246900      
003471           03 S422-96-MDA-NUMCTO.                                 247000      
003472              04 S422-96-MDA-NUMPREF      PIC 9(04) COMP.         247100      
003473              04 S422-96-MDA-NUM          PIC 9(12) COMP.         247200      
003474           03 S422-96-MDA-NUMTALON        PIC 9(02) COMP.         247300      
003475           03 S422-96-MDA-CHQXTALON       PIC 9(02) COMP.         247400      
003476           03 S422-96-MDA-CVEPIN          PIC 9(06) COMP.         247500      
003477           03 S422-96-MDA-CVESTATUS       PIC 9(02) COMP.         247600      
003478           03 S422-96-MDA-FECALTA-2K      PIC 9(08) COMP.         247700      
003479           03 S422-96-MDA-FECULTMOD-2K    PIC 9(08) COMP.         247800      
003480           03 S422-96-MDA-FECCANCEL-2K    PIC 9(08) COMP.         247900      
003481           03 S422-96-MDA-FECMODPIN-2K    PIC 9(08) COMP.         248000      
003482           03 FILLER                      PIC X(27).              248100      
003483* SIZE SALIDA X(84).                                              248200      
003484                                                                  248300      
003485                                                                  248400      
003486*  RESULTADO DE LA CONSULTA :                                     248500      
003487          77  R422-96-CTR-ERROR           PIC S9(11) BINARY.      248600      
003488                                                                  248700      
003489**************************************************************    248800      
003490**** PARAMETROS S016_L422_B27SXCTETIPNUMDE (97) **                248900      
003491*    CONSULTA B27 DOMELEC                                    **   249000      
003492*************************************************************     249100      
003493 01  E422-97-CTR-ENTRADA.                                         249200      
003494     02  E422-97-CTE-NUM             PIC 9(12) COMP.              249300      
003495     02  E422-97-CTR-TIPODE          PIC 9(02) COMP.              249400      
003496     02  E422-97-CTR-NUMDOME         PIC 9(04) COMP.              249500      
003497     02  E422-97-CTR-NUMCONS         PIC 9(02) COMP.              249600      
003498     02  E422-97-CTR-OPCION          PIC 9(02) COMP.              249700      
003499     02  FILLER                      PIC X(49).                   249800      
003500* SIZE ENTRADA X(60).                                             249900      
003501 01 S422-97-CTR-SALIDA.                                           250000      
003502        03 S422-97-CTR-NUMCSI              PIC 9(02) COMP.        250100      
003503        03 S422-97-CTE-NUM                 PIC 9(12) COMP.        250200      
003504        03 S422-97-CTR-TIPODE              PIC 9(02) COMP.        250300      
003505        03 S422-97-CTR-NUMDOME             PIC 9(04) COMP.        250400      
003506        03 S422-97-CTR-NUMCOMS             PIC 9(02) COMP.        250500      
003507        03 S422-97-CTR-NOMUSOSE            PIC 9(04) COMP.        250600      
003508        03 S422-97-CTR-CVEPROV             PIC 9(04) COMP.        250700      
003509        03 S422-97-CTE-DOMELEC             PIC X(26).             250800      
003510        03 S422-97-CTR-FECALTDOM-2K        PIC 9(08) COMP.        250900      
003511        03 S422-97-CTR-FECMODDOM-2K        PIC 9(08) COMP.        251000      
003512        03 FILLER                          PIC X(08).             251100      
003513*                                                                 251200      
003514* size SALIDA = x(060)                                            251300      
003515*                                                                 251400      
003516 77  R422-97-CTR-ERROR            PIC S9(11) BINARY.              251500      
003517*********************************************************         251600      
003518**************************************************************    251700      
003519**** PARAMETROS S016_L422_B28SXCTECTADE (98) **                   251800      
003520*    CONSULTA B28 CUENTASDE                                **     251900      
003521*************************************************************     252000      
003522 01  E422-98-CTR-ENTRADA.                                         252100      
003523     02  E422-98-CTE-NUM     PIC 9(12) COMP.                      252200      
003524     02  E422-98-CTA-PROD    PIC 9(04) COMP.                      252300      
003525     02  E422-98-CTA-INST    PIC 9(02) COMP.                      252400      
003526     02  E422-98-CTA-PREF    PIC 9(04) COMP.                      252500      
003527     02  E422-98-CTA-NUM     PIC 9(12) COMP.                      252600      
003528     02  E422-98-CTR-TIPODE  PIC 9(02) COMP.                      252700      
003529     02  E422-98-CTR-NUMDOME PIC 9(04) COMP.                      252800      
003530     02  E422-98-CTR-OPCION  PIC 9(02) COMP.                      252900      
003531     02  FILLER              PIC X(39).                           253000      
003532* SIZE ENTRADA X(60).                                             253100      
003533 01 S422-98-CTR-SALIDA.                                           253200      
003534        03 S422-98-CTR-NUMCSI    PIC 9(02) COMP.                  253300      
003535        03 S422-98-CTE-CTENUM    PIC 9(12) COMP.                  253400      
003536        03 S422-98-CTR-NUMPROD   PIC 9(04) COMP.                  253500      
003537        03 S422-98-CTR-CVEINST   PIC 9(02) COMP.                  253600      
003538        03 S422-98-CTR-NUMPREF   PIC 9(04) COMP.                  253700      
003539        03 S422-98-CTR-CTANUM    PIC 9(12) COMP.                  253800      
003540        03 S422-98-CTR-TIPODE    PIC 9(02) COMP.                  253900      
003541        03 S422-98-CTE-NUMDOME   PIC 9(04) COMP.                  254000      
003542        03 S422-98-CTR-FEALDE-2K PIC 9(08) COMP.                  254100      
003543        03 S422-98-CTR-FEMODE-2K PIC 9(08) COMP.                  254200      
003544        03 FILLER                PIC X(31).                       254300      
003545*                                                                 254400      
003546* size SALIDA = x(060)                                            254500      
003547*                                                                 254600      
003548 77  R422-98-CTR-ERROR            PIC S9(11) BINARY.              254700      
003549*********************************************************         254800      
003550**************************************************************    254900      
003551**** PARAMETROS S016_L422_B11TERCEROS   (99) **                   255000      
003552*    CONSULTA B11 TERCEROS                                 **     255100      
003553*************************************************************     255200      
003554 01  E422-99-CTR-ENTRADA.                                         255300      
003555     02  E422-99-CTE-NUM      PIC 9(12) COMP.                     255400      
003556     02  E422-99-CTA-PROD     PIC 9(04) COMP.                     255500      
003557     02  E422-99-CTA-INST     PIC 9(02) COMP.                     255600      
003558     02  E422-99-CTO-NUM      PIC 9(16) COMP.                     255700      
003559     02  E422-99-CTO-RED REDEFINES E422-99-CTO-NUM.               255800      
003560       03 E422-99-CTA-PREF        PIC 9(04) COMP.                 255900      
003561       03 E422-99-CTA-NUM         PIC 9(12) COMP.                 256000      
003562     02  E422-99-CTR-NUMREG   PIC 9(02) COMP.                     256100      
003563     02  E422-99-CTR-CONT     PIC 9(02) COMP.                     256200      
003564     02  E422-99-CTR-OPCION   PIC 9(02) COMP.                     256300      
003565     02  FILLER               PIC X(40).                          256400      
003566* SIZE ENTRADA X(60).                                             256500      
003567 01 S422-99-CTR-SALIDA.                                           256600      
003568     02 S422-99-CTE-NUM       PIC 9(12) COMP.                     256700      
003569     02 S422-99-CTR-NUMREG    PIC 9(02) COMP.                     256800      
003570     02 S422-99-CTR-CONT      PIC 9(02) COMP.                     256900      
003571     02 S422-99-CTR-REGISTRO  OCCURS 20 TIMES.                    257000      
003572       03 S422-99-CTA-NUMPROD   PIC 9(04) COMP.                   257100      
003573       03 S422-99-CTA-CVEINST   PIC 9(02) COMP.                   257200      
003574       03 S422-99-CTO-NUM       PIC 9(16) COMP.                   257300      
003575       03 S422-99-CTO-RED REDEFINES S422-99-CTO-NUM.              257400      
003576          05 S422-99-CTA-NUMPREF PIC 9(04) COMP.                  257500      
003577          05 S422-99-CTA-NUM     PIC 9(12) COMP.                  257600      
003578       03 S422-99-SER-LIMAXAUT  PIC 9(14) COMP.                   257700      
003579       03 S422-99-SER-PERIODLIM PIC X(01).                        257800      
003580       03 S422-99-CTA-CVEMONEDA PIC 9(02) COMP.                   257900      
003581       03 S422-99-SER-CVEUSOCTA PIC 9(02) COMP.                   258000      
003582       03 S422-99-CTA-3DIGITOS  PIC 9(04) COMP.                   258100      
003583       03 S422-99-CTR-FEALTE-2K PIC 9(08) COMP.                   258200      
003584       03 S422-99-CTR-FEMOTE-2K PIC 9(08) COMP.                   258300      
003585       03 S422-99-SER-FEFIVI-2K PIC 9(06) COMP.                   258400      
003586       03 S422-99-CTA-STATUS    PIC 9(02) COMP.                   258500      
003587       03 S422-99-CTA-SUCURSAL  PIC 9(04) COMP.                   258600      
003588       03 FILLER                PIC X(08).                        258700      
003589*                                                                 258800      
003590* SIZE REG OCC X(45).                                             258900      
003591* SIZE SALIDA = 8 + (45*20) = 908.                                259000      
003592*                                                                 259100      
003593 77  R422-99-CTR-ERROR            PIC S9(11) BINARY.              259200      
003594*********************************************************         259300      
003595*************************************************************     259400      
003596**   PARAMETROS S016_L422_B22DATOSREP   (100)              **     259500      
003597**   CONSULTA B22 DATOS DEL REPRESENTANTE                  **     259600      
003598*************************************************************     259700      
003599 01  E422-100-CTR-ENTRADA.                                        259800      
003600     02  E422-100-CTE-NUM               PIC 9(12) COMP.           259900      
003601     02  E422-100-CTR-PTRNOMR           PIC 9(04) COMP.           260000      
003602     02  E422-100-CTR-NUMREG            PIC 9(02) COMP.           260100      
003603     02  E422-100-CTR-CONT              PIC 9(02) COMP.           260200      
003604     02  E422-100-CTR-OPCION            PIC 9(02) COMP.           260300      
003605     02  FILLER                         PIC X(19).                260400      
003606* SIZE ENTRADA X(30).                                             260500      
003607 01 S422-100-CTR-SALIDA.                                          260600      
003608     02 S422-100-CTE-NUM                PIC 9(12) COMP.           260700      
003609     02 S422-100-CTR-NUMREG             PIC 9(02) COMP.           260800      
003610     02 S422-100-CTR-CONT               PIC 9(02) COMP.           260900      
003611     02 S422-100-CTR-REGISTRO  OCCURS 10 TIMES.                   261000      
003612       03 S422-100-CTR-PTRNOMR          PIC 9(04) COMP.           261100      
003613       03 S422-100-REP-FENACI-2K        PIC 9(08) COMP.           261200      
003614       03 S422-100-CTR-FEALTA-2K        PIC 9(08) COMP.           261300      
003615       03 S422-100-CTR-FEULMO-2K        PIC 9(08) COMP.           261400      
003616       03 FILLER                        PIC X(06).                261500      
003617*                                                                 261600      
003618* SIZE REG OCC X(20).                                             261700      
003619* SIZE SALIDA = 8 + (20*10) = 208.                                261800      
003620*                                                                 261900      
003621 77  R422-100-CTR-ERROR                 PIC S9(11) BINARY.        262000      
003622*********************************************************         262100      
003623* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 262200      
003624* PARAMETROS PARA LA LIBRERIA S016L422    ( 101  )              * 262300      
003625* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 262400      
003626*                                                                 262500      
003627 77  R422-101-CTR-ERROR                 PIC S9(11) BINARY.        262600      
003628 01  E422-101-CTR-ENTRADA.                                        262700      
003629     02  E422-101-CTE-NUM         PIC 9(12) COMP.                 262800      
003630     02  E422-101-CTR-TIPODOM     PIC 9(02) COMP.                 262900      
003631     02  E422-101-CTR-NUMDOM      PIC 9(04) COMP.                 263000      
003632     02  E422-101-CTR-OPCION      PIC 9(02) COMP.                 263100      
003633*                                                                 263200      
003634* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 263300      
003635* PARAMETROS DE SALIDA DE LA S016L422     ( 101 )               * 263400      
003636* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 263500      
003637*                                                                 263600      
003638 01  S422-101-CTR-SALIDA.                                         263700      
003639     02  S422-101-CTR-NUMCSI      PIC 9(02) COMP.                 263800      
003640     02  S422-101-CTE-NUM         PIC 9(12) COMP.                 263900      
003641     02  S422-101-CTR-NUMREGS     PIC 9(02) COMP.                 264000      
003642     02  S422-101-CTR-DOMSE OCCURS 5 TIMES.                       264100      
003643         03 S422-101-CTR-TIPODOM  PIC 9(02) COMP.                 264200      
003644         03 S422-101-CTR-NUMDOM   PIC 9(04) COMP.                 264300      
003645         03 S422-101-CTR-NUMUSOSE PIC 9(04) COMP.                 264400      
003646         03 S422-101-CTR-CVEPROV  PIC 9(04) COMP.                 264500      
003647         03 S422-101-CTR-DOMELEC  PIC X(78) .                     264600      
003648         03 S422-101-CTR-FEALDE   PIC 9(08) COMP.                 264700      
003649         03 S422-101-CTR-FEMODE   PIC 9(08) COMP.                 264800      
003650     02  FILLER                   PIC X(87).                      264900      
003651* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 265000      
003652* PARAMETROS PARA LA LIBRERIA S016L422            (102)         * 265100      
003653* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 265200      
003654*                                                                 265300      
003655 77  R422-102-CTR-ERROR                 PIC S9(11) BINARY.        265400      
003656 01  E422-102-CTR-ENTRADA.                                        265500      
003657     02  E422-102-CTA-NUMPROD     PIC 9(04) COMP.                 265600      
003658     02  E422-102-CTA-CVEINST     PIC 9(04) COMP.                 265700      
003659     02  E422-102-CTA-NUMPREF     PIC 9(04) COMP.                 265800      
003660     02  E422-102-CTA-NUM         PIC 9(12) COMP.                 265900      
003661     02  E422-102-CTR-TIPODE      PIC 9(02) COMP.                 266000      
003662     02  E422-102-CTR-NUMDOME     PIC 9(04) COMP.                 266100      
003663     02  E422-102-CTR-OPCION      PIC 9(02) COMP.                 266200      
003664*                                                                 266300      
003665* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 266400      
003666* PARAMETROS DE SALIDA DE LA S016L422          (102)            * 266500      
003667* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 266600      
003668 01  S422-102-CTR-SALIDA.                                         266700      
003669     02  S422-102-CTR-NUMCSI      PIC 9(02) COMP.                 266800      
003670     02  S422-102-CTE-NUM         PIC 9(12) COMP.                 266900      
003671     02  S422-102-CTR-NUMREGS     PIC 9(02) COMP.                 267000      
003672     02  S422-102-CTR-NUMPROD     PIC 9(04) COMP.                 267100      
003673     02  S422-102-CTR-CVEINST     PIC 9(02) COMP.                 267200      
003674     02  S422-102-CTA-NUMPREF     PIC 9(04) COMP.                 267300      
003675     02  S422-102-CTA-NUM         PIC 9(12) COMP.                 267400      
003676     02  S422-102-CTR-DOMSE OCCURS 5 TIMES.                       267500      
003677         03 S422-102-CTR-TIPODOM  PIC 9(02) COMP.                 267600      
003678         03 S422-102-CTR-NUMDOM   PIC 9(04) COMP.                 267700      
003679         03 S422-102-CTR-FEALDE   PIC 9(08) COMP.                 267800      
003680         03 S422-102-CTR-FEMODE   PIC 9(08) COMP.                 267900      
003681     02  FILLER                   PIC X(87).                      268000      
003682*                                                                 268100      
003683*************************************************************     268200      
003684**   PARAMETROS S016_L422_CTASINCORPO   (103)              **     268300      
003685**   CONSULTA B05 Y B08 DATOS : CONTRATO Y SU MEDIO        **     268400      
003686*************************************************************     268500      
003687 01  E422-103-CTR-ENTRADA.                                        268600      
003688     02  E422-103-CTE-NUM               PIC 9(12) COMP.           268700      
003689     02  E422-103-CTA-NUMPROD           PIC 9(04) COMP.           268800      
003690     02  E422-103-CTA-CVEINST           PIC 9(02) COMP.           268900      
003691     02  E422-103-CTA-NUMPREF           PIC 9(04) COMP.           269000      
003692     02  E422-103-CTA-NUM               PIC 9(12) COMP.           269100      
003693     02  E422-103-CTR-NUMREG            PIC 9(02) COMP.           269200      
003694     02  E422-103-CTR-OPCION            PIC 9(02) COMP.           269300      
003695     02  FILLER                         PIC X.                    269400      
003696* SIZE ENTRADA X(26).                                             269500      
003697 01 S422-103-CTR-SALIDA.                                          269600      
003698     02 S422-103-CTR-NUMCSI             PIC 9(02) COMP.           269700      
003699     02 S422-103-CTE-NUM                PIC 9(12) COMP.           269800      
003700     02 S422-103-CTR-NUMREG             PIC 9(02) COMP.           269900      
003701     02 S422-103-CTR-CONT               PIC 9(02) COMP.           270000      
003702     02 S422-103-CTR-REGISTRO  OCCURS 20 TIMES.                   270100      
003703       03 S422-103-CTA-NUMPROD          PIC 9(04) COMP.           270200      
003704       03 S422-103-CTA-CVEINST          PIC 9(02) COMP.           270300      
003705       03 S422-103-CTA-NUMPREF          PIC 9(04) COMP.           270400      
003706       03 S422-103-CTA-NUM              PIC 9(12) COMP.           270500      
003707       03 S422-103-CTA-NUMSUC           PIC 9(04) COMP.           270600      
003708       03 S422-103-CTA-CVESTATUS        PIC 9(02) COMP.           270700      
003709       03 S422-103-CTA-CVEMONEDA        PIC 9(02) COMP.           270800      
003710       03 S422-103-MDA-NUMPREF          PIC 9(04) COMP.           270900      
003711       03 S422-103-MDA-NUM              PIC 9(12) COMP.           271000      
003712       03 S422-103-MDA-CVESTATUS        PIC 9(02) COMP.           271100      
003713       03 S422-103-CTA-RELCTE           PIC 9(02) COMP.           271200      
003714       03 S422-103-CTA-USOBCAELE        PIC 9(02) COMP.           271300      
003715       03 S422-103-CTA-ASOCIADAX        PIC 9(02) COMP.           271400      
003716       03 S422-103-CTA-3DIGITOS         PIC 9(04) COMP.           271500      
003717       03 S422-103-CTA-FEALCT-2K        PIC 9(08) COMP.           271600      
003718       03 S422-103-CTA-FEMOCT-2K        PIC 9(08) COMP.           271700      
003719*                                                                 271800      
003720* SIZE REG OCC X(37).                                             271900      
003721* SIZE SALIDA = 9 + (37*20) = 749.                                272000      
003722*                                                                 272100      
003723 77  R422-103-CTR-ERROR                 PIC S9(11) BINARY.        272200      
003724*************************************************************     272300      
003725**   PARAMETROS S016_L422_B29SXCTEPIN   (104)              **     272400      
003726**   CONSULTA B05 Y B08 DATOS : CONTRATO Y SU MEDIO        **     272500      
003727*************************************************************     272600      
003728  01 E422-104-CTR-ENTRADA.                                        272700      
003729     03 E422-104-CTE-NUM                PIC 9(012) COMP.          272800      
003730     03 E422-104-SER-NUM                PIC 9(004) COMP.          272900      
003731     03 E422-104-SER-CVETIPO            PIC 9(002) COMP.          273000      
003732     03 E422-104-CTE-PINOCHO            PIC 9(008).               273100      
003733     03 E422-104-CTE-RED REDEFINES E422-104-CTE-PINOCHO.          273200      
003734        05 E422-104-CTE-PIN8ALFA        PIC X(008).               273300      
003735     03 E422-104-CTE-OPCION             PIC 9(002) COMP.          273400      
003736     03 FILLER                          PIC X(042).               273500      
003737* SIZE ENTRADA X(60).                                             273600      
003738*                                                                 273700      
003739  01 S422-104-CTR-SALIDA.                                         273800      
003740     03 S422-104-PIN-FEALTA       PIC 9(008) COMP.                273900      
003741     03 S422-104-PIN-FEREIN       PIC 9(008) COMP.                274000      
003742     03 S422-104-PIN-FEMOPI       PIC 9(008) COMP.                274100      
003743     03 S422-104-PIN-ANT          PIC 9(002) COMP.                274200      
003744     03 FILLER                    PIC X(047).                     274300      
003745* SIZE SALIDA X(79).                                              274400      
003746*                                                                 274500      
003747 77  R422-104-CTR-ERROR                 PIC S9(11) BINARY.        274600      
003748*************************************************************     274700      
003749**   PARAMETROS S016_L422_B36XREF       (105)              **     274800      
003750**   CONSULTA B36 X REFERENCE CLIENTES BANAMEX/CITIBANK    **     274900      
003751*************************************************************     275000      
003752 01  E422-105-CTR-ENTRADA.                                        275100      
003753     02  E422-105-CTE-NUM               PIC 9(16) COMP.           275200      
003754     02  E422-105-CTR-FTE               PIC 9(02) COMP.           275300      
003755     02  E422-105-CTR-NUMREG            PIC 9(02) COMP.           275400      
003756     02  E422-105-CTR-CONT              PIC 9(02) COMP.           275500      
003757     02  E422-105-CTR-OPCION            PIC 9(02) COMP.           275600      
003758     02  FILLER                         PIC X(18).                275700      
003759* SIZE ENTRADA X(30).                                             275800      
003760 01 S422-105-CTR-SALIDA.                                          275900      
003761     02 S422-105-CTE-NUM                PIC 9(16) COMP.           276000      
003762     02 S422-105-CTR-NUMREG             PIC 9(02) COMP.           276100      
003763     02 S422-105-CTR-CONT               PIC 9(02) COMP.           276200      
003764     02 S422-105-CTR-REGISTRO  OCCURS 10 TIMES.                   276300      
003765       03 S422-105-CTE-NUMSAL           PIC 9(16) COMP.           276400      
003766       03 S422-105-CTR-FTE              PIC 9(02) COMP.           276500      
003767       03 S422-105-NUMNOMI              PIC 9(10) COMP.           276600      
003768       03 S422-105-NUMDOM               PIC 9(04) COMP.           276700      
003769       03 S422-105-NUMERO1              PIC 9(12) COMP.           276800      
003770       03 S422-105-NUMERO2              PIC 9(12) COMP.           276900      
003771       03 S422-105-NUMERO3              PIC 9(12) COMP.           277000      
003772       03 S422-105-NUMERO4              PIC 9(12) COMP.           277100      
003773       03 S422-105-ALFA                 PIC X(16).                277200      
003774       03 S422-105-CTR-FEALTA           PIC 9(08) COMP.           277300      
003775*                                                                 277400      
003776* SIZE REG OCC X(60).                                             277500      
003777* SIZE SALIDA = 10 + (60*10) = 610.                               277600      
003778*                                                                 277700      
003779 77  R422-105-CTR-ERROR                 PIC S9(11) BINARY.        277800      
003780*************************************************************     277900      
003781**   PARAMETROS S016_L422_B38COSMOS     (106)              **     278000      
003782**   CONSULTA B38 CLIENTES CITI COSMOS CORPORATIVOS        **     278100      
003783*************************************************************     278200      
003784  01 E422-106-CTR-ENTRADA.                                        278300      
003785     03 E422-106-CTE-NUM                PIC 9(012) COMP.          278400      
003786     03 E422-106-CTR-NUMCSI             PIC 9(002) COMP.          278500      
003787     03 FILLER                          PIC X(003).               278600      
003788* SIZE ENTRADA X(10).                                             278700      
003789*                                                                 278800      
003790  01 S422-106-CTR-SALIDA.                                         278900      
003791     03 S422-106-CTR-NUMCSI             PIC 9(002) COMP.          279000      
003792     03 S422-106-CTE-NUM                PIC 9(012) COMP.          279100      
003793     03 S422-106-CTE-BRANCH             PIC 9(003) COMP.          279200      
003794     03 S422-106-CTE-APR                PIC 9(010) COMP.          279300      
003795     03 S422-106-CTE-LANGUAGE           PIC 9(001) COMP.          279400      
003796     03 S422-106-CTE-CNTRYDOM           PIC 9(003) COMP.          279500      
003797     03 S422-106-CTE-MXTAXDOM           PIC 9(003) COMP.          279600      
003798     03 S422-106-CTE-CITIREL            PIC 9(001) COMP.          279700      
003799     03 S422-106-CTE-GAPDOM             PIC 9(003) COMP.          279800      
003800     03 S422-106-CTE-RISKRAT            PIC 9(002) COMP.          279900      
003801     03 S422-106-CTE-RISKRATI           PIC X(001).               280000      
003802     03 S422-106-CTE-ACCOCLAS           PIC 9(001) COMP.          280100      
003803     03 S422-106-CTE-OLDSIC             PIC 9(003) COMP.          280200      
003804     03 S422-106-CTE-NEWSIC             PIC 9(004) COMP.          280300      
003805     03 S422-106-CTE-LIABILIT           PIC 9(006) COMP.          280400      
003806     03 S422-106-CTE-WCG                PIC X(001).               280500      
003807     03 S422-106-CTE-NYPARENT           PIC X(005).               280600      
003808     03 S422-106-CTE-NYLOCAL            PIC X(005).               280700      
003809     03 S422-106-CTE-HOLDING            PIC 9(006) COMP.          280800      
003810     03 S422-106-CTE-SUBHOLD            PIC 9(006) COMP.          280900      
003811     03 S422-106-CTE-ULPARENT           PIC 9(006) COMP.          281000      
003812     03 S422-106-CTE-PARADISE           PIC 9(002) COMP.          281100      
003813     03 S422-106-CTE-EXTNUM1            PIC 9(010) COMP.          281200      
003814     03 S422-106-CTE-EXTNUM2            PIC 9(010) COMP.          281300      
003815     03 S422-106-CTE-EXTALF1            PIC X(010).               281400      
003816     03 S422-106-CTE-EXTALF2            PIC X(010).               281500      
003817     03 FILLER                          PIC X(001).               281600      
003818* SIZE SALIDA X(84).                                              281700      
003819*                                                                 281800      
003820 77  R422-106-CTR-ERROR                 PIC S9(11) BINARY.        281900      
003821******************************************************************282000      
003822***   PARAMETROS  S016_L422_B09ALL          (85)               ***282100      
003823****   CONSULTA B09BCAELEC CON OPCION                           **282200      
003824******************************************************************282300      
003825*                                                                 282400      
003826   77  R422-109-CTR-ERROR                 PIC S9(11) BINARY.      282500      
003827*                                                                 282600      
003828  01  E422-109-CTR-ENTRADA.                                       282700      
003829     03 E422-109-CTR-NUMCSI                PIC 9(002) COMP.       282800      
003830     03 E422-109-CTE-NUM                   PIC 9(012) COMP.       282900      
003831     03 E422-109-SER-NUM                   PIC 9(004) COMP.       283000      
003832     03 E422-109-SER-CVETIPO               PIC 9(002) COMP.       283100      
003833     03 E422-109-OPCION                    PIC 9(002) COMP.       283200      
003834     03 FILLER                             PIC X(048).            283300      
003835* SIZE ENTRADA X(60)*                                             283400      
003836*                                                                 283500      
003837*                                                                 283600      
003838 01 S422-109-CTR-SALIDA.                                          283700      
003839    02 S422-109-NUMREG-09                 PIC 9(002) COMP.        283800      
003840    02 S422-109-CTR-REG      OCCURS 4 TIMES.                      283900      
003841      03 S422-109-CTR-NUMCSI               PIC 9(002) COMP.       284000      
003842      03 S422-109-CTE-NUM                  PIC 9(012) COMP.       284100      
003843      03 S422-109-SER-NUM                  PIC 9(004) COMP.       284200      
003844      03 S422-109-SER-CVETIPO              PIC 9(002) COMP.       284300      
003845      03 S422-109-SER-CVEDISP              PIC 9(004) COMP.       284400      
003846      03 S422-109-SER-NOMESTA              PIC X(008).            284500      
003847      03 S422-109-SER-NUMSUCPR             PIC 9(004) COMP.       284600      
003848      03 S422-109-CTA-NUMPROD              PIC 9(004) COMP.       284700      
003849      03 S422-109-CTA-CVEINST              PIC 9(004) COMP.       284800      
003850      03 S422-109-CTA-NUMPREF              PIC 9(004) COMP.       284900      
003851      03 S422-109-CTA-NUM                  PIC 9(012) COMP.       285000      
003852      03 S422-109-SER-COBCOM1              PIC 9(002) COMP.       285100      
003853      03 S422-109-SER-COBCOM2              PIC 9(002) COMP.       285200      
003854      03 S422-109-SER-COBCOM3              PIC 9(002) COMP.       285300      
003855      03 S422-109-SER-COBCOM4              PIC 9(002) COMP.       285400      
003856      03 S422-109-SER-COBCOM5              PIC 9(002) COMP.       285500      
003857      03 S422-109-SER-COBCOM6              PIC 9(002) COMP.       285600      
003858      03 S422-109-SER-VERSOFT              PIC 9(004) COMP.       285700      
003859      03 S422-109-SER-PROPEQUI             PIC 9(002) COMP.       285800      
003860      03 S422-109-CTE-PIN                  PIC 9(004) COMP.       285900      
003861      03 S422-109-CTE-PINVER               PIC 9(002) COMP.       286000      
003862      03 S422-109-CTE-CVENOPIN             PIC 9(002) COMP.       286100      
003863      03 S422-109-SER-CVESTATUS            PIC 9(002) COMP.       286200      
003864      03 S422-109-CTR-CVEENVIO             PIC 9(004) COMP.       286300      
003865      03 S422-109-SER-DIACORTE             PIC 9(002) COMP.       286400      
003866      03 S422-109-SER-EDIEDOCTA            PIC 9(002) COMP.       286500      
003867      03 S422-109-SER-DISEDOCTA            PIC 9(002) COMP.       286600      
003868      03 S422-109-SER-FECONTRAT            PIC 9(008) COMP.       286700      
003869      03 S422-109-SER-FECRENOVA            PIC 9(008) COMP.       286800      
003870      03 S422-109-SER-FECCANCEL            PIC 9(008) COMP.       286900      
003871      03 S422-109-SER-FECULTMOD            PIC 9(008) COMP.       287000      
003872      03 S422-109-SER-FECMODPIN            PIC 9(008) COMP.       287100      
003873      03 S422-109-SER-FECULTMOV            PIC 9(008) COMP.       287200      
003874      03 S422-109-SER-FECINIOPE            PIC 9(008) COMP.       287300      
003875*                                                                 287400      
003876 01  S422-109-RCTR-SALIDA REDEFINES S422-109-CTR-SALIDA.          287500      
003877     03 S422-109-CTR-ERROR                 PIC 9(004)    COMP.    287600      
003878     03 S422-109-CTR-ERRORTYPE             PIC 9(004)    COMP.    287700      
003879     03 S422-109-CTR-STRUCTURE             PIC 9(004)    COMP.    287800      
003880     03 FILLER                             PIC X(075).            287900      
003881*                                                                 288000      
003882*********************************************************         288100      
003883**   PARAMETROS S016_L422_B29SXCTEPIN_3D  (110)            **     288200      
003884**   CONSULTA PIN EN 3D                                           288300      
003885*************************************************************     288400      
003886  01 E422-110-CTR-ENTRADA.                                        288500      
003887     03 E422-110-CTE-NUM                PIC 9(012) COMP.          288600      
003888     03 E422-110-SER-NUM                PIC 9(004) COMP.          288700      
003889     03 E422-110-SER-CVETIPO            PIC 9(002) COMP.          288800      
003890     03 E422-110-CTE-PIN                PIC 9(008).               288900      
003891     03 E422-110-CTE-RED REDEFINES E422-110-CTE-PIN.              289000      
003892        05 E422-110-CTE-PIN8ALFA        PIC X(008).               289100      
003893     03 E422-110-CTE-LLAVEENCR          PIC 9(004)  COMP.         289200      
003894     03 E422-110-CTE-OPCION             PIC 9(002) COMP.          289300      
003895     03 FILLER                          PIC X(040).               289400      
003896* SIZE ENTRADA X(60).                                             289500      
003897*                                                                 289600      
003898  01 S422-110-CTR-SALIDA.                                         289700      
003899     03 S422-110-PIN-FEALTA       PIC 9(008) COMP.                289800      
003900     03 S422-110-PIN-FEREIN       PIC 9(008) COMP.                289900      
003901     03 S422-110-PIN-FEMOPI       PIC 9(008) COMP.                290000      
003902     03 S422-110-PIN-ANT          PIC 9(002) COMP.                290100      
003903     03 FILLER                    PIC X(047).                     290200      
003904* SIZE SALIDA X(79).                                              290300      
003905 77  R422-110-CTR-ERROR                 PIC S9(11) BINARY.        290400      
003906                                                                  290500      
003907*********************************************************         290600      
003908**   PARAMETROS S016_L422_B32SXCTE        (111)            **     290700      
003909**   CONSULTA DE COTITULARES                                      290800      
003910*************************************************************     290900      
003911                                                                  291000      
003912 01  E422-111-CTR-ENTRADA.                                        291100      
003913     03 E422-111-CTE-NUM                   PIC 9(012).            291200      
003914     03 E422-111-CTA-NUMPROD               PIC 9(004).            291300      
003915     03 E422-111-CTA-CVEINST               PIC 9(002).            291400      
003916     03 E422-111-CTA-NUMPREF               PIC 9(004).            291500      
003917     03 E422-111-CTA-NUM                   PIC 9(012).            291600      
003918     03 E422-111-OPCION                    PIC 9(002).            291700      
003919     03 FILLER                             PIC X(031).            291800      
003920                                                                  291900      
003921 01  S422-111-CTR-SALIDA.                                         292000      
003922     03 S422-111-COTITULARES OCCURS 10 TIMES.                     292100      
003923        05 S422-111-CTR-NUMCSI          PIC 9(02).                292200      
003924        05 S422-111-CTE-NUM             PIC 9(12).                292300      
003925        05 S422-111-CTR-NUMCSIA         PIC 9(02).                292400      
003926        05 S422-111-CTE-NUMASOC         PIC 9(12).                292500      
003927        05 S422-111-CTR-NUMNOM          PIC 9(04).                292600      
003928        05 S422-111-CTA-NUMPROD         PIC 9(04).                292700      
003929        05 S422-111-CTA-CVEINST         PIC 9(02).                292800      
003930        05 S422-111-CTA-NUMPREF         PIC 9(04).                292900      
003931        05 S422-111-CTA-NUM             PIC 9(12).                293000      
003932        05 S422-111-CTR-TIPOASOC        PIC 9(02).                293100      
003933        05 S422-111-CTE-NOM             PIC X(55).                293200      
003934     03 S422-111-RCTR-SALIDA.                                     293300      
003935        05 S422-111-CTR-ERROR         PIC 9(004).                 293400      
003936        05 S422-111-CTR-ERRORTYPE     PIC 9(004).                 293500      
003937        05 S422-111-CTR-STRUCTURE     PIC 9(004).                 293600      
003938     03 FILLER                        PIC X(080).                 293700      
003939                                                                  293800      
003940  77  R422-111-CTR-ERROR            PIC S9(11) BINARY.            293900      
003941*****************************************************             294000      
003942****** S016_L422_B04XCTECTA_PROD18 (114)****************          294100      
003943******  CONSULTA AL B04CUENTAS X PROD INST  *********             294200      
003944*****************************************************             294300      
003945*  PARAMETRO DE ENTRADA :                                         294400      
003946   01  E422-114-CTR-ENTRADA.                                      294500      
003947     03 E422-114-CTR-FILLER                   PIC 9(004) COMP.    294600      
003948     03 E422-114-CTE-NUM                      PIC 9(012) COMP.    294700      
003949     03 E422-114-CTA-NUMPROD                  PIC 9(004) COMP.    294800      
003950     03 E422-114-CTA-CVEINST                  PIC 9(002) COMP.    294900      
003951     03 E422-114-RGOPAGO                      PIC 9(002) COMP.    295000      
003952     03 FILLER                                PIC X(048).         295100      
003953*  PARAMETRO DE SALIDA                                            295200      
003954   01 S422-114-CTR-SALIDA.                                        295300      
003955     03 S422-114-CTR-FILLER                   PIC 9(004) COMP.    295400      
003956     03 S422-114-CTE-NUM                      PIC 9(012) COMP.    295500      
003957     03 S422-114-CTA-NUMPROD                  PIC 9(004) COMP.    295600      
003958     03 S422-114-CTA-CVEINST                  PIC 9(002) COMP.    295700      
003959     03 S422-114-RGOPAGO                      PIC 9(002) COMP.    295800      
003960     03 S422-114-STATUS                       PIC 9(002) COMP.    295900      
003961     03 FILLER                                PIC X(046).         296000      
003962  01  S422-114-RCTR-SALIDA REDEFINES S422-114-CTR-SALIDA.         296100      
003963        03 S422-114-CTR-ERROR         PIC 9(004) COMP.            296200      
003964        03 S422-114-CTR-ERRORTYPE     PIC 9(004) COMP.            296300      
003965        03 S422-114-CTR-STRUCTURE     PIC 9(004) COMP.            296400      
003966        03 FILLER                     PIC X(058).                 296500      
003967*RESULTADO DE LA CONSULTA :                                       296600      
003968    77  R422-114-CTR-ERROR               PIC S9(11) BINARY.       296700      
003969*                                                                 296800      
003970*****************************************************             296900      
003971****** S016_L422_B04XCTECTA_PROD18 (114)*************             297000      
003972******  CONSULTA AL B04CUENTAS X PROD INST  *********             297100      
003973****** PARA CASH-POLICY *****************************             297200      
003974*****************************************************             297300      
003975*  PARAMETRO DE ENTRADA :                                         297400      
003976  01 E422-115-CTR-ENTRADA.                                        297500      
003977     03 E422-115-CTR-FILLER                   PIC 9(004) COMP.    297600      
003978     03 E422-115-CTE-NUM                      PIC 9(012) COMP.    297700      
003979     03 E422-115-CTA-NUMPROD                  PIC 9(004) COMP.    297800      
003980     03 E422-115-CTA-CVEINST                  PIC 9(002) COMP.    297900      
003981     03 E422-115-RGOPAGO                      PIC 9(002) COMP.    298000      
003982     03 FILLER                                PIC X(048).         298100      
003983*  PARAMETRO DE SALIDA                                            298200      
003984 01  S422-115-CTR-SALIDA.                                         298300      
003985     03 S422-115-CTR-NUMCSI                PIC 9(002) COMP.       298400      
003986     03 S422-115-CTA-NUMPROD               PIC 9(004) COMP.       298500      
003987     03 S422-115-CTA-CVEINST               PIC 9(004) COMP.       298600      
003988     03 S422-115-CTA-NUMSUC                PIC 9(004) COMP.       298700      
003989     03 S422-115-CTA-NUMPREF               PIC 9(004) COMP.       298800      
003990     03 S422-115-CTA-NUM                   PIC 9(012) COMP.       298900      
003991     03 S422-115-CTE-NUM                   PIC 9(012) COMP.       299000      
003992     03 S422-115-CTA-DIACORTE              PIC 9(002) COMP.       299100      
003993     03 S422-115-CTA-CVEMONEDA             PIC 9(002) COMP.       299200      
003994     03 S422-115-CTA-CVEENVIO              PIC 9(004) COMP.       299300      
003995     03 S422-115-CTA-EDIEDOCTA             PIC 9(002) COMP.       299400      
003996     03 S422-115-CTA-CVEMANEJO             PIC 9(002) COMP.       299500      
003997     03 S422-115-CTA-CVESTATUS             PIC 9(002) COMP.       299600      
003998     03 S422-115-CTA-CVEUSO                PIC 9(002) COMP.       299700      
003999     03 S422-115-CTA-RESTRIC               PIC 9(002) COMP.       299800      
004000     03 S422-115-CTA-RESTCON               PIC 9(002) COMP.       299900      
004001     03 S422-115-CTA-OPCPAGO               PIC 9(002) COMP.       300000      
004002     03 S422-115-CTA-RGOPAGO               PIC 9(002) COMP.       300100      
004003     03 S422-115-CTA-FECAPER               PIC 9(008) COMP.       300200      
004004     03 S422-115-CTA-FECULTMOD             PIC 9(008) COMP.       300300      
004005     03 S422-115-CTA-FECCANCEL             PIC 9(008) COMP.       300400      
004006     03 S422-115-CTA-REFECVE               PIC 9(002) COMP.       300500      
004007     03 S422-115-CTA-VENDNOMI              PIC 9(010) COMP.       300600      
004008     03 S422-115-CTA-REFENOMI              PIC 9(010) COMP.       300700      
004009     03 S422-115-CTA-DISEDOCTA             PIC 9(002) COMP.       300800      
004010     03 FILLER                             PIC X(09).             300900      
004011* SIZE SALIDA X(66)*                                              301000      
004012*                                                                 301100      
004013*                                                                 301200      
004014 01  S422-115-RCTR-SALIDA REDEFINES S422-115-CTR-SALIDA.          301300      
004015     03 R422-115-CTR-ERROR                 PIC 9(004) COMP.       301400      
004016     03 R422-115-CTR-ERRORTYPE             PIC 9(004) COMP.       301500      
004017     03 R422-115-CTR-STRUCTURE             PIC 9(004) COMP.       301600      
004018     03 FILLER                             PIC X(60).             301700      
004019*                                                                 301800      
004020*************************************************************     301900      
004021**   PARAMETROS S016_L422_B48INTERC     (116)              **     302000      
004022**   CONSULTA CLAVE INTERCOMPANY POR CLIENTE               **     302100      
004023*************************************************************     302200      
004024  01 E422-116-CTR-ENTRADA.                                        302300      
004025     03 E422-116-CTE-NUM                PIC 9(012) COMP.          302400      
004026     03 FILLER                          PIC X(004).               302500      
004027* SIZE ENTRADA X(10).                                             302600      
004028*                                                                 302700      
004029  01 S422-116-CTR-SALIDA.                                         302800      
004030     03 S422-116-CTE-NUM                PIC 9(012) COMP.          302900      
004031     03 S422-116-CVE-INTERC             PIC 9(005) COMP.          303000      
004032     03 S422-116-FEC-ALTA               PIC 9(008) COMP.          303100      
004033     03 S422-116-FEC-ULTMOD             PIC 9(008) COMP.          303200      
004034     03 S422-116-CVESTATUS              PIC 9(002) COMP.          303300      
004035* SIZE SALIDA X(20).                                              303400      
004036*                                                                 303500      
004037  77  R422-116-CTR-ERROR                PIC S9(11) BINARY.        303600      
004038*************************************************************     303700      
004039**   PARAMETROS S016_L422_B48INTERC     (117)              **     303800      
004040**   CONSULTA CLAVE INTERCOMPANY POR CUENTA                **     303900      
004041*************************************************************     304000      
004042  01 E422-117-CTR-ENTRADA.                                        304100      
004043     03 E422-117-CTO-NUM                PIC 9(16) COMP.           304200      
004044     03 E422-117-CTO-NUM-R REDEFINES E422-117-CTO-NUM.            304300      
004045        04 E422-117-CTA-NUMPREF         PIC 9(004) COMP.          304400      
004046        04 E422-117-CTA-NUM             PIC 9(012) COMP.          304500      
004047     03 E422-117-CTA-NUMPROD            PIC 9(004) COMP.          304600      
004048     03 E422-117-CTA-CVEINST            PIC 9(002) COMP.          304700      
004049     03 FILLER                          PIC X(004).               304800      
004050* SIZE ENTRADA X(15).                                             304900      
004051*                                                                 305000      
004052  01 S422-117-CTR-SALIDA.                                         305100      
004053     03 S422-117-CTE-NUM                PIC 9(012) COMP.          305200      
004054     03 S422-117-CVE-INTERC             PIC 9(005) COMP.          305300      
004055     03 S422-117-FEC-ALTA               PIC 9(008) COMP.          305400      
004056     03 S422-117-FEC-ULTMOD             PIC 9(008) COMP.          305500      
004057     03 S422-117-CVESTATUS              PIC 9(002) COMP.          305600      
004058* SIZE SALIDA X(20).                                              305700      
004059*                                                                 305800      
004060  77  R422-117-CTR-ERROR                PIC S9(11) BINARY.        305900      
004061*************************************************************     306000      
004062**   PARAMETROS S016_L422_B48INTERC     (118)              **     306100      
004063**   CONSULTA CLAVE INTERCOMPANY POR MEDIO                 **     306200      
004064*************************************************************     306300      
004065  01 E422-118-CTR-ENTRADA.                                        306400      
004066     03 E422-118-CTA-NUMPREF            PIC 9(004) COMP.          306500      
004067     03 E422-118-CTA-NUM                PIC 9(012) COMP.          306600      
004068     03 FILLER                          PIC X(002).               306700      
004069* SIZE ENTRADA X(10).                                             306800      
004070*                                                                 306900      
004071  01 S422-118-CTR-SALIDA.                                         307000      
004072     03 S422-118-CTE-NUM                PIC 9(012) COMP.          307100      
004073     03 S422-118-CVE-INTERC             PIC 9(005) COMP.          307200      
004074     03 S422-118-FEC-ALTA               PIC 9(008) COMP.          307300      
004075     03 S422-118-FEC-ULTMOD             PIC 9(008) COMP.          307400      
004076     03 S422-118-CVESTATUS              PIC 9(002) COMP.          307500      
004077* SIZE SALIDA X(20).                                              307600      
004078*                                                                 307700      
004079  77  R422-118-CTR-ERROR                PIC S9(11) BINARY.        307800      
004080*EHG CONSULTA DOMICILIO FD L422                                   307900      
004081***************************************************************   308000      
004082**      S016_L422_BD56SXCTEUSU    (119)                      **   308100      
004083**      CONSULTA DE DOMICILIO FISICO DEL USUARIO             **   308200      
004084***************************************************************   308300      
004085*  PARAMETRO DE ENTRADA:                                          308400      
004086  01 E422-119-CTR-ENTRADA.                                        308500      
004087     03 E422-119-CTE-NUM              PIC 9(012) COMP.            308600      
004088     03 E422-119-MAS-DATOS            PIC X(001).                 308700      
004089     03 E422-119-USU-NUM              PIC 9(004) COMP.            308800      
004090     03 E422-119-USU-NUMPROD          PIC 9(004) COMP.            308900      
004091     03 E422-119-USU-CVEINST          PIC 9(002) COMP.            309000      
004092     03 E422-119-USU-STATUS           PIC 9(002) COMP.            309100      
004093     03 E422-119-OPCION               PIC 9(002) COMP.            309200      
004094                                                                  309300      
004095*  PARAMETRO DE SALIDA:                                           309400      
004096 01  S422-119-CTR-SALIDA.                                         309500      
004097     03 S422-119-CTE-NUM              PIC 9(012) COMP.            309600      
004098     03 S422-119-MAS-DATOS            PIC X(001).                 309700      
004099*                                                                 309800      
004100     03 S422-119-USU-DOMICILIO OCCURS 25 TIMES.                   309900      
004101        04 S422-119-USU-NUM           PIC 9(004) COMP.            310000      
004102        04 S422-119-USU-NUMPROD       PIC 9(004) COMP.            310100      
004103        04 S422-119-USU-CVEINST       PIC 9(004) COMP.            310200      
004104        04 S422-119-CTE-CSI           PIC 9(002) COMP.            310300      
004105        04 S422-119-USU-NUMNOM        PIC 9(004) COMP.            310400      
004106        04 S422-119-CTE-NOMCORTO      PIC X(026).                 310500      
004107        04 S422-119-USU-STATUS        PIC 9(002) COMP.            310600      
004108        04 S422-119-USU-CALLENUM      PIC X(036).                 310700      
004109        04 S422-119-USU-NOMCOL        PIC X(024).                 310800      
004110        04 S422-119-USU-NOMPOB        PIC X(020).                 310900      
004111        04 S422-119-USU-CVEEDO        PIC 9(002) COMP.            311000      
004112        04 S422-119-USU-CVENACION     PIC 9(002) COMP.            311100      
004113        04 S422-119-USU-NUMCP         PIC 9(006) COMP.            311200      
004114        04 S422-119-USU-NUMTEL        PIC 9(010) COMP.            311300      
004115        04 S422-119-USU-NUMTELEXT     PIC 9(006) COMP.            311400      
004116        04 S422-119-USU-NUMTEL2       PIC 9(010) COMP.            311500      
004117        04 S422-119-USU-NUMTELEXT2    PIC 9(006) COMP.            311600      
004118        04 S422-119-USU-TIPOID        PIC 9(002) COMP.            311700      
004119        04 S422-119-USU-NUMID         PIC X(025).                 311800      
004120        04 S422-119-USU-EMAIL         PIC X(078).                 311900      
004121        04 S422-119-FEC-ALT-STAT      PIC 9(008) COMP.            312000      
004122        04 S422-119-FEC-MOD-STAT      PIC 9(008) COMP.            312100      
004123        04 S422-119-FEC-ALT-GRAL      PIC 9(008) COMP.            312200      
004124        04 S422-119-FEC-MOD-GRAL      PIC 9(008) COMP.            312300      
004125        04 S422-119-FEC-MOD-MAIL      PIC 9(008) COMP.            312400      
004126     03 S422-119-USU-NUMREG           PIC 9(02)  COMP.            312500      
004127*                                                                 312600      
004128 01  S422-119-STAT-SALIDA REDEFINES S422-119-CTR-SALIDA.          312700      
004129     03 S422-119-STA-CTENUM           PIC 9(012) COMP.            312800      
004130     03 S422-119-STA-USUA             PIC 9(004) COMP.            312900      
004131     03 S422-119-STA-PROD             PIC 9(004) COMP.            313000      
004132     03 S422-119-STA-INST             PIC 9(002) COMP.            313100      
004133     03 S422-119-STA-STAT             PIC 9(002) COMP.            313200      
004134*                                                                 313300      
004135 01  S422-119-STAM-SALIDA REDEFINES S422-119-CTR-SALIDA.          313400      
004136     03 S422-119-STM-STAT             PIC 9(002) COMP.            313500      
004137     03 S422-119-STM-MAS-DATOS        PIC X(001).                 313600      
004138     03 S422-119-STM-STATUSU OCCURS 25.                           313700      
004139        05 S422-119-STM-CTENUM        PIC 9(012) COMP.            313800      
004140        05 S422-119-STM-USUA          PIC 9(004) COMP.            313900      
004141        05 S422-119-STM-PROD          PIC 9(004) COMP.            314000      
004142        05 S422-119-STM-INST          PIC 9(002) COMP.            314100      
004143        05 S422-119-STM-FECMOD        PIC 9(008) COMP.            314200      
004144     03 S422-119-STM-NUMREG           PIC 9(02)  COMP.            314300      
004145                                                                  314400      
004146 77  R422-119-CTR-ERROR               PIC S9(11) BINARY.          314500      
004147***************************************************************   314600      
004148**      S016_L422_BD56SXCTEUSU_2  (119)                      **   314700      
004149**      CONSULTA DE DOMICILIO FISICO DEL USUARIO  VERSION 2  **   314800      
004150***************************************************************   314900      
004151*  PARAMETRO DE ENTRADA:                                          315000      
004152  01 E422-119B-CTR-ENTRADA.                                       315100      
004153     03 E422-119B-CTE-NUM              PIC 9(012) COMP.           315200      
004154     03 E422-119B-MAS-DATOS            PIC X(001).                315300      
004155     03 E422-119B-USU-NUM              PIC 9(004) COMP.           315400      
004156     03 E422-119B-USU-NUMPROD          PIC 9(004) COMP.           315500      
004157     03 E422-119B-USU-CVEINST          PIC 9(002) COMP.           315600      
004158     03 E422-119B-USU-STATUS           PIC 9(002) COMP.           315700      
004159     03 E422-119B-OPCION               PIC 9(002) COMP.           315800      
004160                                                                  315900      
004161*  PARAMETRO DE SALIDA:                                           316000      
004162 01  S422-119B-CTR-SALIDA.                                        316100      
004163     03 S422-119B-CTE-NUM              PIC 9(012) COMP.           316200      
004164     03 S422-119B-MAS-DATOS            PIC X(001).                316300      
004165*                                                                 316400      
004166     03 S422-119B-USU-DOMICILIO OCCURS 25 TIMES.                  316500      
004167        04 S422-119B-USU-NUM           PIC 9(004) COMP.           316600      
004168        04 S422-119B-USU-NUMPROD       PIC 9(004) COMP.           316700      
004169        04 S422-119B-USU-CVEINST       PIC 9(004) COMP.           316800      
004170        04 S422-119B-CTE-CSI           PIC 9(002) COMP.           316900      
004171        04 S422-119B-USU-NUMNOM        PIC 9(004) COMP.           317000      
004172        04 S422-119B-CTE-NOMCORTO      PIC X(026).                317100      
004173        04 S422-119B-USU-STATUS        PIC 9(002) COMP.           317200      
004174        04 S422-119B-USU-CALLENUM      PIC X(036).                317300      
004175        04 S422-119B-USU-NOMCOL        PIC X(024).                317400      
004176        04 S422-119B-USU-NOMPOB        PIC X(020).                317500      
004177        04 S422-119B-USU-CVEEDO        PIC 9(002) COMP.           317600      
004178        04 S422-119B-USU-CVENACION     PIC 9(002) COMP.           317700      
004179        04 S422-119B-USU-NUMCP         PIC 9(006) COMP.           317800      
004180        04 S422-119B-USU-NUMTEL        PIC 9(010) COMP.           317900      
004181        04 S422-119B-USU-NUMTELEXT     PIC 9(006) COMP.           318000      
004182        04 S422-119B-USU-NUMTEL2       PIC 9(010) COMP.           318100      
004183        04 S422-119B-USU-NUMTELEXT2    PIC 9(006) COMP.           318200      
004184        04 S422-119B-USU-TIPOID        PIC 9(002) COMP.           318300      
004185        04 S422-119B-USU-NUMID         PIC X(025).                318400      
004186        04 S422-119B-USU-EMAIL         PIC X(078).                318500      
004187        04 S422-119B-FEC-ALT-STAT      PIC 9(008) COMP.           318600      
004188        04 S422-119B-FEC-MOD-STAT      PIC 9(008) COMP.           318700      
004189        04 S422-119B-FEC-ALT-GRAL      PIC 9(008) COMP.           318800      
004190        04 S422-119B-FEC-MOD-GRAL      PIC 9(008) COMP.           318900      
004191        04 S422-119B-FEC-MOD-MAIL      PIC 9(008) COMP.           319000      
004192        04 S422-119B-USU-NOTIFICA      PIC 9(002) COMP.           319100      
004193        04 S422-119B-USU-CLVCIACEL     PIC 9(002) COMP.           319200      
004194        04 S422-119B-MDA-NUMREPRES     PIC 9(008) COMP.           319300      
004195     03 S422-119B-USU-NUMREG           PIC 9(002) COMP.           319400      
004196*                                                                 319500      
004197 01  S422-119B-STAT-SALIDA REDEFINES S422-119B-CTR-SALIDA.        319600      
004198     03 S422-119B-STA-CTENUM           PIC 9(012) COMP.           319700      
004199     03 S422-119B-STA-USUA             PIC 9(004) COMP.           319800      
004200     03 S422-119B-STA-PROD             PIC 9(004) COMP.           319900      
004201     03 S422-119B-STA-INST             PIC 9(002) COMP.           320000      
004202     03 S422-119B-STA-STAT             PIC 9(002) COMP.           320100      
004203*                                                                 320200      
004204 01  S422-119B-STAM-SALIDA REDEFINES S422-119B-CTR-SALIDA.        320300      
004205     03 S422-119B-STM-STAT             PIC 9(002) COMP.           320400      
004206     03 S422-119B-STM-MAS-DATOS        PIC X(001).                320500      
004207     03 S422-119B-STM-STATUSU OCCURS 25.                          320600      
004208        05 S422-119B-STM-CTENUM        PIC 9(012) COMP.           320700      
004209        05 S422-119B-STM-USUA          PIC 9(004) COMP.           320800      
004210        05 S422-119B-STM-PROD          PIC 9(004) COMP.           320900      
004211        05 S422-119B-STM-INST          PIC 9(002) COMP.           321000      
004212        05 S422-119B-STM-FECMOD        PIC 9(008) COMP.           321100      
004213     03 S422-119B-STM-NUMREG           PIC 9(002) COMP.           321200      
004214                                                                  321300      
004215 77  R422-119B-CTR-ERROR               PIC S9(11) BINARY.         321400      
004216                                                                  321500      
004217*EHG CONSULTA ULTIMOS DIMICILIOS                                  321600      
004218*EHG CONSULTA ULTIMOS DIMICILIOS                                  321700      
004219***************************************************************   321800      
004220**      S016_L422_10ULTDOM       (120)                       **   321900      
004221**      CONSULTA ULTIMOS 10 DOMICILIOS DEL CLIENTE           **   322000      
004222***************************************************************   322100      
004223*  PARAMETRO DE ENTRADA:                                          322200      
004224  01 E422-120-CTR-ENTRADA.                                        322300      
004225     03 E422-120-CTE-NUM              PIC 9(012) COMP.            322400      
004226                                                                  322500      
004227*  PARAMETRO DE SALIDA:                                           322600      
004228 01  S422-120-CTR-SALIDA.                                         322700      
004229     03 S422-120-CTE-NUM              PIC 9(012) COMP.            322800      
004230     03 S422-120-CTE-NOM              PIC X(055).                 322900      
004231     03 S422-120-CTR-NUMCSI           PIC 9(002) COMP.            323000      
004232*                                                                 323100      
004233     03 S422-120-USU-10DOM OCCURS 10 TIMES.                       323200      
004234        04 S422-120-CTR-NUMDOM        PIC 9(004) COMP.            323300      
004235        04 S422-120-CTR-DOMUSOS       PIC 9(004) COMP.            323400      
004236        04 S422-120-CTE-CALLENUM      PIC X(036).                 323500      
004237        04 S422-120-CTE-NOMCOL        PIC X(024).                 323600      
004238        04 S422-120-USU-NOMPOB        PIC X(020).                 323700      
004239        04 S422-120-USU-CVEEDO        PIC 9(002) COMP.            323800      
004240        04 S422-120-USU-NUMCP         PIC 9(006) COMP.            323900      
004241        04 S422-120-USU-NUMTEL        PIC 9(010) COMP.            324000      
004242        04 S422-120-USU-NUMTELEXT     PIC 9(006) COMP.            324100      
004243        04 S422-120-CTE-CVETEL        PIC 9(002) COMP.            324200      
004244        04 S422-120-USU-NUMTEL2       PIC 9(010) COMP.            324300      
004245        04 S422-120-USU-NUMTELEXT2    PIC 9(006) COMP.            324400      
004246        04 S422-120-CTE-CVETEL2       PIC 9(002) COMP.            324500      
004247        04 S422-120-CTR-CVESTADOM     PIC 9(002) COMP.            324600      
004248        04 S422-120-CTR-CVEDOM        PIC 9(002) COMP.            324700      
004249        04 S422-120-CTE-CVEAGEN       PIC X(004).                 324800      
004250        04 S422-120-CTE-APDO          PIC X(008).                 324900      
004251        04 S422-120-OFI-NUMCSIDOM     PIC 9(002) COMP.            325000      
004252        04 S422-120-CTR-FECALTDOM     PIC 9(006) COMP.            325100      
004253        04 S422-120-CTR-FECMODDOM     PIC 9(006) COMP.            325200      
004254        04 S422-120-CTR-FEALDO-2K     PIC 9(008) COMP.            325300      
004255        04 S422-120-CTR-FEMODO-2K     PIC 9(008) COMP.            325400      
004256     03 S422-120-USU-NUMREG           PIC 9(02)  COMP.            325500      
004257*                                                                 325600      
004258 77  R422-120-CTR-ERROR   PIC S9(11) BINARY.                      325700      
004259*EHG CONSULTA DEL SERVICIO 274 DE BANCA ELECTRONICA               325800      
004260***************************************************************   325900      
004261**      S016_L422_SERV274BE      (121)                       **   326000      
004262**      CONSULTA UDEL SERVICIO 274 DE BANCA ELECTRONICA      **   326100      
004263***************************************************************   326200      
004264*  PARAMETRO DE ENTRADA                                           326300      
004265  01 E422-121-CTR-ENTRADA.                                        326400      
004266     03 E422-121-CTE-NUM              PIC 9(012) COMP.            326500      
004267     03 E422-121-SER-NUM              PIC 9(004) COMP.            326600      
004268     03 E422-121-SER-CVE              PIC 9(002) COMP.            326700      
004269     03 E422-121-SER-CVEDISP          PIC 9(006) COMP.            326800      
004270                                                                  326900      
004271*  PARAMETRO DE SALIDA                                            327000      
004272  01 S422-121-CTR-SALIDA.                                         327100      
004273     03 S422-121-CTE-NUM              PIC 9(012) COMP.            327200      
004274     03 S422-121-CTE-NOM              PIC X(055).                 327300      
004275     03 S422-121-SER-NUM              PIC 9(004) COMP.            327400      
004276     03 S422-121-SER-CVE              PIC 9(002) COMP.            327500      
004277     03 S422-121-SER-CVEDISP          PIC 9(006) COMP.            327600      
004278     03 S422-121-SER-SUCPRO           PIC 9(004) COMP.            327700      
004279     03 S422-121-CTA-NUMPROD          PIC 9(004) COMP.            327800      
004280     03 S422-121-CTA-CVEINST          PIC 9(004) COMP.            327900      
004281     03 S422-121-CTA-NUMCTO           PIC 9(016) COMP.            328000      
004282     03 S422-121-NOM-VEND             PIC 9(010) COMP.            328100      
004283     03 S422-121-SER-VERSOFT          PIC 9(004) COMP.            328200      
004284     03 S422-121-SER-PROPEQUIP        PIC 9(002) COMP.            328300      
004285     03 S422-121-SER-NOMESTA          PIC X(008).                 328400      
004286     03 S422-121-CTE-PINVER           PIC 9(002) COMP.            328500      
004287     03 S422-121-SER-STATUS           PIC 9(002) COMP.            328600      
004288     03 S422-121-SER-COBCOM PIC 9(002) COMP OCCURS 6.             328700      
004289     03 S422-121-CTR-CVEENVIO         PIC 9(004) COMP.            328800      
004290     03 S422-121-SER-EDIEDOCTA        PIC 9(002) COMP.            328900      
004291     03 S422-121-SER-DIACORTE         PIC 9(002) COMP.            329000      
004292     03 S422-121-SER-FECONTRAT        PIC 9(008) COMP.            329100      
004293     03 S422-121-SER-FECULTMOD        PIC 9(008) COMP.            329200      
004294     03 S422-121-SER-FECMODPIN        PIC 9(008) COMP.            329300      
004295     03 S422-121-SER-FECCANCEL        PIC 9(008) COMP.            329400      
004296     03 S422-121-SER-FECRENOVA        PIC 9(008) COMP.            329500      
004297     03 S422-121-SER-FECINIOPE        PIC 9(008) COMP.            329600      
004298*                                                                 329700      
004299 77  R422-121-CTR-ERROR           PIC S9(11) BINARY.              329800      
004300                                                                  329900      
004301**JGM*****************************************************        330000      
004302**CAMBIOS DE NOMINA SE TOMA EL MTP96 Y SE GENERA EL 97****        330100      
004303**Y SE PLANCHA EL S016/PARAMETROS/L422/COMISIONES2K CON***        330200      
004304**EL MTP 97***********************************************        330300      
004305******************************************************************330400      
004306**   PARAMETROS S016_L422_B04SXCTATEF   (122)                   **330500      
004307**   CONSULTA CONTRATOS DEL PRODUCTO TEF DE ACUERDO A LA OPCION **330600      
004308******************************************************************330700      
004309**   NOTA: OPCION 1 CONSULTA TODOS LOS PRODUCTOS TEF DEL CLIENTE  330800      
004310**         OPCION 2 CONSULTA EL ESTATUS DEL PRODUCTO TEF          330900      
004311**                                                                331000      
004312  01 E422-122-CTR-ENTRADA.                                        331100      
004313     03 E422-122-OFI-NUMCSIALT            PIC 9(02) COMP.         331200      
004314     03 E422-122-CTE-NUM                  PIC 9(12) COMP.         331300      
004315     03 E422-122-CTA-NUMPROD              PIC 9(04) COMP.         331400      
004316     03 E422-122-CTA-CVEINST              PIC 9(02) COMP.         331500      
004317     03 E422-122-CTA-NUMPREF              PIC 9(04) COMP.         331600      
004318     03 E422-122-CTA-NUM                  PIC 9(12) COMP.         331700      
004319     03 E422-122-OPCION                   PIC 9(02) COMP.         331800      
004320     03 FILLER                            PIC X(41) .             331900      
004321* SIZE ENTRADA X(60)                                              332000      
004322                                                                  332100      
004323  01 S422-122-CTR-SALIDA.                                         332200      
004324     03 S422-122-CTR-NUMCSI               PIC 9(02) COMP.         332300      
004325     03 S422-122-CTE-NUM                  PIC 9(12) COMP.         332400      
004326     03 S422-122-CTA-NUMPROD              PIC 9(04) COMP.         332500      
004327     03 S422-122-CTA-CVEINST              PIC 9(02) COMP.         332600      
004328     03 S422-122-CTR-CTOTEF        OCCURS 10 TIMES .              332700      
004329        05 S422-122-CTA-NUMPREF           PIC 9(04) COMP.         332800      
004330        05 S422-122-CTA-NUM               PIC 9(12) COMP.         332900      
004331        05 S422-122-CTA-CVESTAT           PIC 9(02) COMP.         333000      
004332     03 FILLER                            PIC X(10) .             333100      
004333* SIZE SALIDA X(110)                                              333200      
004334                                                                  333300      
004335  01 S422-122-RCTR-SALIDA       REDEFINES S422-122-CTR-SALIDA.    333400      
004336     03 S422-122-CTR-ERROR                PIC 9(04) COMP.         333500      
004337     03 S422-122-CTR-ERRORTYPE            PIC 9(04) COMP.         333600      
004338     03 S422-122-CTR-STRUCTURE            PIC 9(04) COMP.         333700      
004339     03 FILLER                            PIC X(104).             333800      
004340                                                                  333900      
004341  77  R422-122-CTR-ERROR                  PIC S9(11) BINARY.      334000      
004342*************************************************************     334100      
004343**   PARAMETROS S016_L422_CONSREGUL     (125)              **     334200      
004344**   CONSULTA B04 Y B60: CONTRATOS Y CUENTAS REGULARES     **     334300      
004345*************************************************************     334400      
004346 01  E422-125-CTR-ENTRADA.                                        334500      
004347     02  E422-125-CTE-NUM               PIC 9(12) COMP.           334600      
004348     02  E422-125-CTA-NUMPROD           PIC 9(04) COMP.           334700      
004349     02  E422-125-CTA-CVEINST           PIC 9(02) COMP.           334800      
004350     02  E422-125-CTA-NUMPREF           PIC 9(04) COMP.           334900      
004351     02  E422-125-CTA-NUM               PIC 9(12) COMP.           335000      
004352     02  E422-125-CTR-NUMREG            PIC 9(02) COMP.           335100      
004353     02  E422-125-CTR-OPCION            PIC 9(02) COMP.           335200      
004354     02  FILLER                         PIC X.                    335300      
004355* SIZE ENTRADA X(20).                                             335400      
004356 01 S422-125-CTR-SALIDA.                                          335500      
004357     02 S422-125-CTR-NUMCSI             PIC 9(02) COMP.           335600      
004358     02 S422-125-CTE-NUM                PIC 9(12) COMP.           335700      
004359     02 S422-125-CTR-NUMREG             PIC 9(02) COMP.           335800      
004360     02 S422-125-CTR-CONT               PIC 9(02) COMP.           335900      
004361     02 S422-125-CTR-REGISTRO  OCCURS 20 TIMES.                   336000      
004362       03 S422-125-CTA-NUMPROD          PIC 9(04) COMP.           336100      
004363       03 S422-125-CTA-CVEINST          PIC 9(02) COMP.           336200      
004364       03 S422-125-CTA-NUMPREF          PIC 9(04) COMP.           336300      
004365       03 S422-125-CTA-NUM              PIC 9(12) COMP.           336400      
004366       03 S422-125-CTA-NUMSUC           PIC 9(04) COMP.           336500      
004367       03 S422-125-CTA-CVESTATUS        PIC 9(02) COMP.           336600      
004368       03 S422-125-CTA-CVEMANEJO        PIC 9(02) COMP.           336700      
004369       03 S422-125-CTA-FEAPER-2K        PIC 9(08) COMP.           336800      
004370       03 S422-125-CTA-FEULMO-2K        PIC 9(08) COMP.           336900      
004371       03 S422-125-CTA-VENDNOM          PIC 9(10) COMP.           337000      
004372       03 S422-125-CTA-VENDSUC          PIC 9(04) COMP.           337100      
004373       03 S422-125-CTR-STATUSREG        PIC 9(02) COMP.           337200      
004374       03 S422-125-CTR-FECREG           PIC 9(08) COMP.           337300      
004375 77  R422-125-CTR-ERROR                 PIC S9(11) BINARY.        337400      
004376                                                                  337500      
004377******************************************************************337600      
004378**   PARAMETROS S016_L422_CTESCORE      (126)                   **337700      
004379**   CONSULTA SCORE DEL CLIENTE                                 **337800      
004380******************************************************************337900      
004381 01 E422-126-CTR-ENTRADA.                                         338000      
004382   03 E422-126-CTE-NUM           PIC 9(012) COMP.                 338100      
004383                                                                  338200      
004384                                                                  338300      
004385 01 S422-126-CTR-SALIDA.                                          338400      
004386   03  S422-126-CTE-NUM          PIC 9(12) COMP.                  338500      
004387   03  S422-126-CTE-REF          PIC 9(4)  COMP.                  338600      
004388                                                                  338700      
004389 77 R422-126-CTR-ERROR           PIC S9(11) BINARY.               338800      
004390                                                                  338900      
004391                                                                  339000      
004392******************************************************************339100      
004393**   PARAMETROS S016_L422_B07SXCTARELCREDCH (127)               **339200      
004394**   CONSULTA DE CREDICHEQUERA.                                 **339300      
004395******************************************************************339400      
004396 01 E422-127-CTR-ENTRADA.                                         339500      
004397    03 E422-127-CTA-NUMPROREL     PIC 9(004) COMP.                339600      
004398    03 E422-127-CTA-CVEINSREL     PIC 9(004) COMP.                339700      
004399    03 E422-127-CTA-NUMPREREL     PIC 9(004) COMP.                339800      
004400    03 E422-127-CTA-NUMREL        PIC 9(012) COMP.                339900      
004401    03 E422-127-OPCION            PIC 9(002) COMP.                340000      
004402    03 FILLER                     PIC X(043).                     340100      
004403                                                                  340200      
004404 01 S422-127-CTR-SALIDA.                                          340300      
004405    03 S422-127-CTR-NUMCSI        PIC 9(002) COMP.                340400      
004406    03 S422-127-CTE-NUM           PIC 9(012) COMP.                340500      
004407    03 S422-127-CTA-NUMPROD       PIC 9(004) COMP.                340600      
004408    03 S422-127-CTA-CVEINST       PIC 9(004) COMP.                340700      
004409    03 S422-127-CTA-NUMCTO        PIC 9(016) COMP.                340800      
004410    03 S422-127-CTA-NUMCTORED REDEFINES S422-127-CTA-NUMCTO.      340900      
004411       05 S422-127-CTA-NUMPREF    PIC 9(004) COMP.                341000      
004412       05 S422-127-CTA-NUM        PIC 9(012) COMP.                341100      
004413                                                                  341200      
004414 77 R422-127-CTR-ERROR            PIC S9(11) BINARY.              341300      
004415******************************************************************341400      
004416******************************************************************341500      
004417**   PARAMETROS S016_L422_B65SxCte          (128)               **341600      
004418**   Consulta de Telefonos                                      **341700      
004419**   opcion       Llave           Descripcion                   **341800      
004420**      1         cte-num         busqueda por numero de cte    **341900      
004421**      2         cte-num         continuacion                  **342000      
004422**                tel-num                                       **342100      
004423**      3         tel-num         busqueda por numero de        **342200      
004424**      4         tel-num         continuacion                  **342300      
004425**                cte-num                                       **342400      
004426**                                                              **342500      
004427** R422-128-CTR-ERROR                                           **342600      
004428**        0       no hay error                                  **342700      
004429**        11      no existe el registro ( no cte )              **342800      
004430**        12      opcion invalida                               **342900      
004431**                                                              **343000      
004432**                                                              **343100      
004433**                                                              **343200      
004434**                                          socradesh oct 2k7   **343300      
004435******************************************************************343400      
004436******************************************************************343500      
004437                                                                  343600      
004438 77  R422-128-CTR-ERROR                   PIC S9(11) BINARY.      343700      
004439                                                                  343800      
004440 01 E422-128-CTR-ENTRADA.                                         343900      
004441    03 E422-128-CTE-NUM           PIC 9(012) COMP.                344000      
004442    03 E422-128-CTE-NUMTEL        PIC 9(016) COMP.                344100      
004443    03 E422-128-OPCION            PIC 9(002) COMP.                344200      
004444    03 FILLER                     PIC X(042)     .                344300      
004445                                                                  344400      
004446 01 S422-128-CTR-SALIDA.                                          344500      
004447    02 S422-128-NUMOCC                    PIC 9(02)  COMP.        344600      
004448    02 S422-128-NUMREGS           OCCURS  20.                     344700      
004449       03 S422-128-CTE-NUM                PIC 9(012) COMP.        344800      
004450       03 S422-128-CTE-NUMTEL             PIC 9(016) COMP.        344900      
004451       03 S422-128-CTE-EXT                PIC 9(008) COMP.        345000      
004452       03 S422-128-CTA-NUMPROD            PIC 9(004) COMP.        345100      
004453       03 S422-128-CTA-CVEINST            PIC 9(002) COMP.        345200      
004454       03 S422-128-CTE-FECULTLLA          PIC 9(008) COMP.        345300      
004455       03 S422-128-CTE-DOM                PIC 9(004) COMP.        345400      
004456       03 S422-128-CTE-CVETIPO            PIC 9(002) COMP.        345500      
004457       03 S422-128-CTE-NUMLLAM            PIC 9(008) COMP.        345600      
004458       03 S422-128-CTE-NUMLLAME           PIC 9(008) COMP.        345700      
004459       03 S422-128-CTE-MEDIO              PIC 9(002) COMP.        345800      
004460       03 S422-128-CTE-FECALTA            PIC 9(008) COMP.        345900      
004461       03 S422-128-CTE-CVESTATUS          PIC 9(002) COMP.        346000      
004462       03 S422-128-CTE-ORIGEN             PIC 9(004) COMP.        346100      
004463       03 S422-128-CTE-VIGEN              PIC 9(004) COMP.        346200      
004464       03 S422-128-CTE-FECULT             PIC 9(008) COMP.        346300      
004465       03 S422-128-CTE-REPRES             PIC 9(004) COMP.        346400      
004466       03 S422-128-CTE-NOMINA             PIC 9(012) COMP.        346500      
004467       03 S422-128-CTE-COFETTEL           PIC 9(004) COMP.        346600      
004468       03 S422-128-CTE-PAIS               PIC 9(004) COMP.        346700      
004469       03 S422-128-CTE-TIPREL             PIC 9(004) COMP.        346800      
004470       03 S422-128-CTE-TIMEZO             PIC 9(004) COMP.        346900      
004471       03 S422-128-CTE-PREFCEL            PIC 9(004) COMP.        347000      
004472                                                                  347100      
004473******************************************************************347200      
004474**                                                              **347300      
004475** FD DE PARAMETROS DEL ENTRYPOINT S016_L422_CTASINCORP (129)   **347400      
004476**    - CUENTAS INCORPORADAS                                    **347500      
004477**                                            MAT. ABEL NOGUERA **347600      
004478**                                                              **347700      
004479**                                                              **347800      
004480** se añadieron 3 campos nuevos a la entrada, para recibir el   **347900      
004481** MDA y poder continuar con la busqueda de forma adecuada      **348000      
004482** se agregaron MDA-NUMPREF , MDA-NUM , FILLER                  **348100      
004483**                                                              **348200      
004484**                                Zuma-ti 10MTP304 Abr 2k15     **348300      
004485******************************************************************348400      
004486*                                                                 348500      
004487*                         Long = 60 (hex) =  30 (ebcdic)          348600      
004488 01 E422-129-CTR-ENT.                                             348700      
004489    02 E422-129-LIB-OPC                PIC 9(02) COMP.            348800      
004490    02 E422-129-CTE-NUM                PIC 9(12) COMP.            348900      
004491    02 E422-129-CTA-PROD               PIC 9(04) COMP.            349000      
004492    02 E422-129-CTA-INST               PIC 9(02) COMP.            349100      
004493    02 E422-129-CTA-PREF               PIC 9(04) COMP.            349200      
004494    02 E422-129-CTA-NUM                PIC 9(12) COMP.            349300      
004495    02 E422-129-NUM-OCR                PIC 9(02) COMP.            349400      
004496    02 E422-129-MDA-NUMCTO                           .            349500      
004497       04 E422-129-MDA-NUMPREF         PIC 9(04) COMP.            349600      
004498       04 E422-129-MDA-NUM             PIC 9(12) COMP.            349700      
004499    02 E422-129-FILLER                 PIC X(06)     .            349800      
004500                                                                  349900      
004501*                                                                 350000      
004502 01 S422-129-CTR-SAL.                                             350100      
004503    02 S422-129-CSI-NUM                PIC 9(02) COMP.            350200      
004504    02 S422-129-CTE-NUM                PIC 9(12) COMP.            350300      
004505    02 S422-129-CTE-STATUS             PIC 9(02) COMP.            350400      
004506    02 S422-129-CTE-TIPPER             PIC 9(02) COMP.            350500      
004507    02 S422-129-CTE-CLASIF             PIC 9(02) COMP.            350600      
004508    02 S422-129-NUM-OCR                PIC 9(02) COMP.            350700      
004509    02 S422-129-HAY-MAS                PIC 9(02) COMP.            350800      
004510    02 S422-129-TABLA                  OCCURS 20 TIMES.           350900      
004511       03 S422-129-CTO-PROD            PIC 9(04) COMP.            351000      
004512       03 S422-129-CTO-INST            PIC 9(02) COMP.            351100      
004513       03 S422-129-CTA-PREF            PIC 9(04) COMP.            351200      
004514       03 S422-129-CTA-NUM             PIC 9(12) COMP.            351300      
004515       03 S422-129-CTA-STATUS          PIC 9(02) COMP.            351400      
004516       03 S422-129-CTA-SUCURS          PIC 9(04) COMP.            351500      
004517       03 S422-129-CTO-MONEDA          PIC 9(02) COMP.            351600      
004518       03 S422-129-CTA-MANEJO          PIC 9(02) COMP.            351700      
004519       03 S422-129-CTE-CVEENV          PIC 9(04) COMP.            351800      
004520       03 S422-129-CTE-FECALT          PIC 9(08) COMP.            351900      
004521       03 S422-129-CTE-FECMOD          PIC 9(08) COMP.            352000      
004522       03 S422-129-CTO-RELCTE          PIC 9(02) COMP.            352100      
004523       03 S422-129-CTO-USOBEL          PIC 9(02) COMP.            352200      
004524       03 S422-129-CTO-CVEASO          PIC 9(02) COMP.            352300      
004525       03 S422-129-CTA-3DIGIT          PIC 9(04) COMP.            352400      
004526       03 S422-129-CTA-TIPCTA          PIC 9(02) COMP.            352500      
004527       03 S422-129-CTA-SUBTIP          PIC 9(02) COMP.            352600      
004528       03 S422-129-CTA-CVETIT          PIC 9(02) COMP.            352700      
004529       03 S422-129-CTO-NUMCTA          PIC 9(16) COMP.            352800      
004530       03 S422-129-CTO-MDASTA          PIC 9(02) COMP.            352900      
004531       03 S422-129-CTA-PROFTI          PIC X(03).                 353000      
004532       03 S422-129-CTA-NOMTIT          PIC 9(04) COMP.            353100      
004533       03 S422-129-CTA-PROFCO          PIC X(03).                 353200      
004534       03 S422-129-CTA-NOMCOT          PIC 9(04) COMP.            353300      
004535       03 S422-129-CTA-PRESEN          PIC 9(02) COMP.            353400      
004536       03 S422-129-CTA-FECALT          PIC 9(08) COMP.            353500      
004537       03 S422-129-CTA-FECMOD          PIC 9(08) COMP.            353600      
004538                                                                  353700      
004539  77  R422-129-CTR-ERROR               PIC S9(11) BINARY.         353800      
004540                                                                  353900      
004541******************************************************************354000      
004542**                                                              **354100      
004543** FD DE PARAMETROS DEL ENTRYPOINT S016_L422_CTEBNMXCF  (131)   **354200      
004544**    - CLIENTE BANAMEX & CLIENTE CF                            **354300      
004545**                                        JOSE GUTIERREZ MOLINA.**354400      
004546******************************************************************354500      
004547 01 E422-131-CTR-ENT.                                             354600      
004548    02 E422-131-CTE-BNM                PIC 9(12) COMP.            354700      
004549    02 E422-131-CTE-CF                 PIC 9(18) COMP.            354800      
004550*                                                                 354900      
004551 01 S422-131-CTR-SAL.                                             355000      
004552    02 S422-131-CTE-NUM                PIC 9(12) COMP.            355100      
004553    02 S422-131-CTE-CF                 PIC 9(18) COMP.            355200      
004554    02 S422-131-CTO-PREFI              PIC 9(04) COMP.            355300      
004555    02 S422-131-CTO-CF                 PIC 9(12) COMP.            355400      
004556    02 S422-131-NUMPROD                PIC 9(04) COMP.            355500      
004557    02 S422-131-CVEINST                PIC 9(04) COMP.            355600      
004558    02 S422-131-TIPOASO                PIC 9(02) COMP.            355700      
004559 77  R422-131-CTR-ERROR                PIC S9(11) BINARY.         355800      
004560*                                                                 355900      
004561* INI GCV SOFTTEK NOV2007                                         356000      
004562*************************************************************     356100      
004563**   PARAMETROS S016_L422_B35CURP       (130)              **     356200      
004564**   CONSULTA B35 CURP                                     **     356300      
004565**                                                         **     356400      
004566**   R422-130-CTR-ERROR                                    **     356500      
004567**         0 = EXISTE CURP PARA EL CLIENTE                 **     356600      
004568**        10 = EL CLIENTE NO TIENE CURP                    **     356700      
004569**        99 = ERROR EN BD                                 **     356800      
004570**                                    GCV-SOFTTEK-NOV2007  **     356900      
004571*************************************************************     357000      
004572  01 E422-130-CTR-ENTRADA.                                        357100      
004573     03 E422-130-CTE-NUM                PIC 9(012) COMP.          357200      
004574     03 FILLER                          PIC X(054).               357300      
004575* SIZE ENTRADA X(60).                                             357400      
004576*                                                                 357500      
004577  01 S422-130-CTR-SALIDA.                                         357600      
004578     03 S422-130-CTE-NUM                PIC 9(012) COMP.          357700      
004579     03 S422-130-CTE-CURP               PIC X(021).               357800      
004580     03 FILLER                          PIC X(057).               357900      
004581* SIZE SALIDA X(84).                                              358000      
004582*                                                                 358100      
004583 77  R422-130-CTR-ERROR                 PIC S9(11) BINARY.        358200      
004584* FIN GCV SOFTTEK NOV2007                                         358300      
004585******************************************************************358400      
004586** PARAMETROS          S016_L422_CONS_TERS  (132)               **358500      
004587** Dialogo para consulta de cuentas y montos operables Terceros **358600      
004588** Banamex                                                      **358700      
004589******************************************************************358800      
004590*                                                                 358900      
004591 77 R422-132-CTR-ERROR                PIC S9(11) BINARY.          359000      
004592*                                                                 359100      
004593 01 E422-132-CTR-ENTRADA.                                         359200      
004594    02 E422-132-CTR-NUMCSI            PIC 9(02) COMP.             359300      
004595    02 E422-132-CTE-NUM               PIC 9(12) COMP.             359400      
004596    02 E422-132-CTO-NUM.                                          359500      
004597       03 E422-132-CTA-NUMPREF        PIC 9(04) COMP.             359600      
004598       03 E422-132-CTA-NUM            PIC 9(12) COMP.             359700      
004599    02 E422-132-CTA-OPCION            PIC 9(02) COMP.             359800      
004600    02 FILLER                         PIC X(44).                  359900      
004601*SIZE ENTRADA X(60).                                              360000      
004602*                                                                 360100      
004603  01 S422-132-CTR-SALIDA.                                         360200      
004604     02 S422-132-SER-LIMAXAUT         PIC 9(14) COMP.             360300      
004605     02 S422-132-SER-PERIODLIM        PIC X(01).                  360400      
004606     02 S422-132-CTE-NOM              PIC X(55).                  360500      
004607     02 S422-132-CTA-NOMBRE           PIC X(20).                  360600      
004608     02 S422-132-CTR-FEMOTE-2K        PIC 9(08) COMP.             360700      
004609     02 S422-132-CTR-STATUS           PIC 9(02) COMP.             360800      
004610     02 FILLER                        PIC X(06).                  360900      
004611* SIZE SALIDA X(90).                                              361000      
004612*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-**361100      
004613******************************************************************361200      
004614** PARAMETROS          S016_L422_CONS_INTER (133)               **361300      
004615** Dialogo para consulta de cuentas y montos operables          **361400      
004616** interbancarios                                               **361500      
004617******************************************************************361600      
004618*                                                                 361700      
004619 77 R422-133-CTR-ERROR                PIC S9(11) BINARY.          361800      
004620*                                                                 361900      
004621 01 E422-133-CTR-ENTRADA.                                         362000      
004622    02 E422-133-CTE-NUM               PIC 9(12) COMP.             362100      
004623    02 E422-133-CTA-CLABE-TARJ        PIC 9(20) COMP.             362200      
004624    02 E422-133-CTA-CLAVE-TARJ-R      REDEFINES                   362300      
004625                                      E422-133-CTA-CLABE-TARJ.    362400      
004626       03 E422-133-CTA-CLABE          PIC 9(04) COMP.             362500      
004627       03 E422-133-CTA-NUMPREF        PIC 9(04) COMP.             362600      
004628       03 E422-133-CTA-NUM            PIC 9(12) COMP.             362700      
004629    02 E422-133-CTE-NOMBENEF          PIC X(55).                  362800      
004630    02 E422-133-CTA-OPCION            PIC 9(02) COMP.             362900      
004631    02 E422-133-TIPO-CTA              PIC 9(02) COMP.             363000      
004632* JRR     STK     INI     ENE/09                                  363100      
004633    02 E422-133-ESTABL                PIC 9(06) COMP.             363200      
004634*   02 FILLER                         PIC X(23).                  363300      
004635    02 FILLER                         PIC X(20).                  363400      
004636* JRR     STK     FIN     ENE/09                                  363500      
004637*SIZE ENTRADA X(96).                                              363600      
004638*                                                                 363700      
004639  01 S422-133-CTR-SALIDA.                                         363800      
004640     02 S422-133-SER-LIMAXAUT         PIC 9(14) COMP.             363900      
004641     02 S422-133-SER-PERIODLIM        PIC X(01).                  364000      
004642*   SE DA COMO CONFIRMACION DEL NOMBRE DEL BENEF. ENCONTRADO      364100      
004643     02 S422-133-CTE-NOMBENEF         PIC X(55).                  364200      
004644     02 S422-133-CTA-NOMBRE           PIC X(20).                  364300      
004645     02 S422-133-CTR-FEMOTE-2K        PIC 9(08) COMP.             364400      
004646     02 S422-133-CTA-BCO              PIC 9(04) COMP.             364500      
004647     02 S422-133-CTR-STATUS           PIC 9(02) COMP.             364600      
004648     02 FILLER                        PIC X(06).                  364700      
004649* SIZE SALIDA X(96).                                              364800      
004650                                                                  364900      
004651                                                                  365000      
004652******************************************************************365100      
004653** PARAMETROS          S016_L422_CONS_EMAIL    (135)            **365200      
004654** Consulta del email  de un cliente                            **365300      
004655**                                recosntruido por zuma dic 2k9 **365400      
004656******************************************************************365500      
004657*                                                                 365600      
004658 01 E422-135-CTR-ENTRADA.                                         365700      
004659     03  E422-135-CTE-NUM                PIC 9(12) COMP.          365800      
004660     03  E422-135-CTA-NUMPROD            PIC 9(04) COMP.          365900      
004661     03  E422-135-CTA-CVEINST            PIC 9(02) COMP.          366000      
004662     03  E422-135-CTA-NUMPREF            PIC 9(04) COMP.          366100      
004663     03  E422-135-CTA-NUM                PIC 9(12) COMP.          366200      
004664     03  E422-135-CTR-TIPODE             PIC 9(02) COMP.          366300      
004665     03  E422-135-CTR-NUMDOME            PIC 9(04) COMP.          366400      
004666     03  FILLER                          PIC X(40).               366500      
004667                                                                  366600      
004668* SIZE ENTRADA X(60).                                             366700      
004669*                                                                 366800      
004670                                                                  366900      
004671 01 S422-135-CTR-SALIDA.                                          367000      
004672     03  S422-135-CTE-EMAIL              PIC X(78).               367100      
004673     03  FILLER                          PIC X(42).               367200      
004674                                                                  367300      
004675* SIZE SALIDA X(120).                                             367400      
004676                                                                  367500      
004677  77  R422-135-CTR-ERROR                  PIC S9(11) BINARY.      367600      
004678                                                                  367700      
004679                                                                  367800      
004680                                                                  367900      
004681******************************************************************368000      
004682**                S016_L422_CONSMARCASCTE (137)                 **368100      
004683**            Consulta de  b74, Marcas del cliente              **368200      
004684**                                                              **368300      
004685******************************************************************368400      
004686*                                                                 368500      
004687 01 E422-137-CTR-ENTRADA.                                         368600      
004688     02  E422-137-CTE-NUM                PIC 9(12) .              368700      
004689*      NUMERO DE CLIENTE                                          368800      
004690     02  E422-137-CTR-SERVICIO           PIC 9(04) .              368900      
004691*      NUMERO DE SERVICIO                                         369000      
004692     02  E422-137-CTR-TIPO               PIC 9(02) .              369100      
004693*      TIPO DE SERVICIO                                           369200      
004694     02  E422-137-CTR-CONCEPTO           PIC 9(08) .              369300      
004695*      TIPO DE CONCEPTO                                           369400      
004696          02  E422-137-CTR-OPCION        PIC 9(02) .              369500      
004697*      OPCION 1 = CONSULTA                                        369600      
004698     02  FILLER                          PIC X(50).               369700      
004699                                                                  369800      
004700* SIZE ENTRADA X(70).                                             369900      
004701*                                                                 370000      
004702                                                                  370100      
004703 01 S422-137-CTR-SALIDA.                                          370200      
004704          02  S422-137-CTE-NUM            PIC 9(12).              370300      
004705          02  S422-137-CTR-SERVICIO       PIC 9(04).              370400      
004706          02  S422-137-CTR-TIPO           PIC 9(02).              370500      
004707          02  S422-137-CTR-VALCON         PIC 9(08).              370600      
004708*         VALOR DEL CONCEPTO                                      370700      
004709          02  S422-137-CTR-RESULT         PIC 9(02).              370800      
004710          02  FILLER                      PIC X(50).              370900      
004711                                                                  371000      
004712* SIZE SALIDA X(74).                                              371100      
004713                                                                  371200      
004714  77  R422-137-CTR-ERROR                  PIC S9(11) BINARY.      371300      
004715                                                                  371400      
004716******************************************************************371500      
004717**                  S016_L422_ CTASINCCOBRA    (138)            **371600      
004718** Consulta de cuentas incorporadas para cobranza universal     **371700      
004719**                                                              **371800      
004720******************************************************************371900      
004721*                                                                 372000      
004722 01 E422-138-CTR-ENTRADA.                                         372100      
004723    02 E422-138-LIB-OPC                   PIC 9(02) COMP.         372200      
004724*         OPCION                                                  372300      
004725    02 E422-138-CTE-NUM                   PIC 9(12) COMP.         372400      
004726*         NUMERO DE CLIENTE                                       372500      
004727    02 E422-138-CTA-PROD                  PIC 9(04) COMP.         372600      
004728*         PRODUCTO                                                372700      
004729    02 E422-138-CTA-INST                  PIC 9(02) COMP.         372800      
004730*         INSTRUMENTO                                             372900      
004731    02 E422-138-CTA-PREF                  PIC 9(04) COMP.         373000      
004732*         PREFIJO DE LA CUENTA                                    373100      
004733    02 E422-138-CTA-NUM                   PIC 9(12) COMP.         373200      
004734*         NUMERO DE CUENTA                                        373300      
004735    02 E422-138-MDA-CVETIPO               PIC 9(02) COMP.         373400      
004736*         tipo de medio de acceso                                 373500      
004737    02 E422-138-MDA-CVETIT                PIC 9(02) COMP.         373600      
004738*         titularidad de medio de acceso                          373700      
004739    02 E422-138-MDA-NUM                   PIC 9(12) COMP.         373800      
004740*         N³mero de medio de acceso                               373900      
004741    02 E422-138-NUM-OCR                   PIC 9(02) COMP.         374000      
004742*         OCURRENCIAS                                             374100      
004743    02 FILLER                             PIC X(11).              374200      
004744                                                                  374300      
004745* SIZE ENTRADA X(30).                                             374400      
004746*                                                                 374500      
004747 01 S422-138-CTR-SALIDA.                                          374600      
004748    02 S422-138-CSI-NUM                   PIC 9(02) COMP.         374700      
004749    02 S422-138-CTE-NUM                   PIC 9(12) COMP.         374800      
004750    02 S422-138-CTE-STATUS                PIC 9(02) COMP.         374900      
004751    02 S422-138-CTE-TIPPER                PIC 9(02) COMP.         375000      
004752    02 S422-138-CTE-CLASIF                PIC 9(02) COMP.         375100      
004753    02 S422-138-NUM-OCR                   PIC 9(02) COMP.         375200      
004754    02 S422-138-HAY-MAS                   PIC 9(02) COMP.         375300      
004755    02 S422-138-TABLA                   OCCURS 15 TIMES.          375400      
004756*      datos cuenta B04                                           375500      
004757       03 S422-138-CTA-PROD               PIC 9(04) COMP.         375600      
004758       03 S422-138-CTA-INST               PIC 9(02) COMP.         375700      
004759       03 S422-138-CTA-PREF               PIC 9(04) COMP.         375800      
004760       03 S422-138-CTA-NUM                PIC 9(12) COMP.         375900      
004761       03 S422-138-CTA-STATUS             PIC 9(02) COMP.         376000      
004762       03 S422-138-CTA-SUCURS             PIC 9(04) COMP.         376100      
004763       03 S422-138-CTA-MONEDA             PIC 9(02) COMP.         376200      
004764       03 S422-138-CTA-MANEJO             PIC 9(02) COMP.         376300      
004765       03 S422-138-CTA-CVEENV             PIC 9(04) COMP.         376400      
004766       03 S422-138-CTA-FECALT             PIC 9(08) COMP.         376500      
004767       03 S422-138-CTA-FECMOD             PIC 9(08) COMP.         376600      
004768*  La libreria no manda nada aqui                                 376700      
004769       03 S422-138-CTO-CVEREQ             PIC 9(02) COMP.         376800      
004770       03 S422-138-CTE-NOMCORTO           PIC X(26) .             376900      
004771*      datos cta incorporada B05                                  377000      
004772       03 S422-138-CTA-RELCTE             PIC 9(02) COMP.         377100      
004773       03 S422-138-CTA-USOBEL             PIC 9(02) COMP.         377200      
004774       03 S422-138-CTA-CVEASO             PIC 9(02) COMP.         377300      
004775       03 S422-138-CTA-3DIGIT             PIC 9(04) COMP.         377400      
004776*      medio de acceso B08                                        377500      
004777       03 S422-138-MDA-TIPCTA             PIC 9(02) COMP.         377600      
004778       03 S422-138-MDA-SUBTIP             PIC 9(02) COMP.         377700      
004779       03 S422-138-MDA-CVETIT             PIC 9(02) COMP.         377800      
004780       03 S422-138-MDA-CTAPREV            PIC 9(04) COMP.         377900      
004781       03 S422-138-MDA-CTANUM             PIC 9(12) COMP.         378000      
004782       03 S422-138-MDA-MDASTA             PIC 9(02) COMP.         378100      
004783       03 S422-138-MDA-PROFTI             PIC X(03) .             378200      
004784       03 S422-138-MDA-NOMTIT             PIC 9(04) COMP.         378300      
004785       03 S422-138-MDA-PROFCO             PIC X(03) .             378400      
004786       03 S422-138-MDA-NOMCOT             PIC 9(04) COMP.         378500      
004787       03 S422-138-MDA-PRESEN             PIC 9(02) COMP.         378600      
004788       03 S422-138-MDA-FECALT             PIC 9(08) COMP.         378700      
004789       03 S422-138-MDA-FECMOD             PIC 9(08) COMP.         378800      
004790  02 FILLER                               PIC X(114).             378900      
004791                                                                  379000      
004792* SIZE SALIDA X(1272).                                            379100      
004793                                                                  379200      
004794  77  R422-138-CTR-ERROR                  PIC S9(11) BINARY.      379300      
004795                                                                  379400      
004796******************************************************************379500      
004797**                  S016_L422_ B13SXCTA        (139)            **379600      
004798**        Consulta del dataset S016b13requerimientos            **379700      
004799**                                                              **379800      
004800******************************************************************379900      
004801*                                                                 380000      
004802  01 E422-139-CTR-ENTRADA.                                        380100      
004803     02 E422-139-LIB-OPC                PIC 9(02) COMP.           380200      
004804*         OPCION                                                  380300      
004805     02 E422-139-CTR-CSI                PIC 9(02) COMP.           380400      
004806*         NUMERO DE CSI                                           380500      
004807     02 E422-139-CTA-PROD               PIC 9(04) COMP.           380600      
004808*         PRODUCTO                                                380700      
004809     02 E422-139-CTA-INST               PIC 9(02) COMP.           380800      
004810*         INSTRUMENTO                                             380900      
004811     02 E422-139-CTA-PREF               PIC 9(04) COMP.           381000      
004812*         PREFIJO DE LA CUENTA                                    381100      
004813     02 E422-139-CTA-NUM                PIC 9(12) COMP.           381200      
004814*         NUMERO DE CUENTA                                        381300      
004815     02 FILLER                          PIC X(04).                381400      
004816                                                                  381500      
004817* SIZE ENTRADA X(17).                                             381600      
004818*                                                                 381700      
004819* datos de salida                                                 381800      
004820                                                                  381900      
004821  01 S422-139-CTR-SALIDA.                                         382000      
004822     02 S422-139-CSI-NUM                PIC 9(02) COMP.           382100      
004823     02 S422-139-CTA-CVEREQ             PIC 9(02) COMP.           382200      
004824     02 S422-139-CTA-NUMPROD            PIC 9(04) COMP.           382300      
004825     02 S422-139-CTA-CVEINST            PIC 9(02) COMP.           382400      
004826     02 S422-139-CTA-NUMCTO                           .           382500      
004827         03 S422-139-CTA-PREF           PIC 9(04) COMP.           382600      
004828         03 S422-139-CTA-NUM            PIC 9(12) COMP.           382700      
004829     02 S422-139-CTA-FECULTMOD          PIC 9(06) COMP.           382800      
004830     02 S422-139-CTA-FECULMO-2K         PIC 9(08) COMP.           382900      
004831     02 FILLER                          PIC X(40).                383000      
004832                                                                  383100      
004833* SIZE SALIDA X(60).                                              383200      
004834                                                                  383300      
004835  77  R422-139-CTR-ERROR                  PIC S9(11) BINARY.      383400      
004836                                                                  383500      
004837                                                                  383600      
004838                                                                  383700      
004839**********************************************************        383800      
004840***  PARAMETROS PARA ENTRY POINT S016_L422_COMXCTA (140)          383900      
004841***   CONSULTA AL S016B69EXTERNAS COMPLETO.                       384000      
004842**********************************************************        384100      
004843 01 E422-140-CTR-ENTRADA.                                         384200      
004844*     opcion                                                      384300      
004845    02 E422-140-CTR-OPC                          PIC 9(0002) COMP.384400      
004846*     numero de cliente                                           384500      
004847    02 E422-140-B69-CTE-NUM                      PIC 9(0012) COMP.384600      
004848*     banco                                                       384700      
004849    02 E422-140-B69-CTA-BANCO                    PIC 9(0004) COMP.384800      
004850*     cuenta, clabe o tarjeta                                     384900      
004851    02 E422-140-B69-CTA-CLABE-TAR                PIC 9(0020) COMP.385000      
004852*     espacio disponible                                          385100      
004853    02 E422-140-FILLER                           PIC X(0040).     385200      
004854                                                                  385300      
004855 01 S422-140-CTR-SALIDA.                                          385400      
004856*     numero de cliente                                           385500      
004857    02 S422-140-B69-CTE-NUM                      PIC 9(0012) COMP.385600      
004858*     numero de ocurrencias devueltas                             385700      
004859    02 S422-140-CTR-NUMOC                        PIC 9(0002) COMP.385800      
004860*     indicardor existen mas registros                            385900      
004861    02 S422-140-CTR-HAYMAS                       PIC 9(0002) COMP.386000      
004862    02 S422-140-TABLA OCCURS 015 TIMES.                           386100      
004863*        cuenta, clabe o tarjeta                                  386200      
004864       03 S422-140-B69-CTA-CLABE-TAR             PIC 9(0020) COMP.386300      
004865*        banco                                                    386400      
004866       03 S422-140-B69-CTA-BANCO                 PIC 9(0004) COMP.386500      
004867*        sucursal                                                 386600      
004868       03 S422-140-B69-CTA-SUC                   PIC 9(0004) COMP.386700      
004869*        numero de prospecto                                      386800      
004870       03 S422-140-B69-CTE-NUMPROS               PIC 9(0012) COMP.386900      
004871*        tipo de cuenta                                           387000      
004872       03 S422-140-B69-CTA-CUENTIP               PIC 9(0002) COMP.387100      
004873*        tipo de moneda                                           387200      
004874       03 S422-140-B69-CTA-CVEMONEDA             PIC 9(0002) COMP.387300      
004875*        codigo swift                                             387400      
004876       03 S422-140-B69-CTR-CODSWIFT              PIC X(0012).     387500      
004877*        codigo aba                                               387600      
004878       03 S422-140-B69-CTR-CODABA                PIC X(0010).     387700      
004879*        medio alta de la cuenta                                  387800      
004880       03 S422-140-B69-CTA-MEDALTA               PIC 9(0004) COMP.387900      
004881*        gerencia de cuenta                                       388000      
004882       03 S422-140-B69-CTR-GERCTA                PIC 9(0002) COMP.388100      
004883*        tipo de persona                                          388200      
004884       03 S422-140-B69-CTE-CVEPERS               PIC 9(0002) COMP.388300      
004885*        alias                                                    388400      
004886       03 S422-140-B69-CTA-ALIAS                 PIC X(0020).     388500      
004887*        sector economico                                         388600      
004888       03 S422-140-B69-CTE-CVESECTOR             PIC 9(0002) COMP.388700      
004889*        limite maximo a pagar                                    388800      
004890       03 S422-140-B69-CTR-LIMAXUT               PIC 9(0014) COMP.388900      
004891*        periodicidad del limite                                  389000      
004892       03 S422-140-B69-SER-PERIODLIM             PIC X(0001).     389100      
004893*        cve unica registro pobl                                  389200      
004894       03 S422-140-B69-CTE-CURP                  PIC X(0018).     389300      
004895*        numero de establecimiento                                389400      
004896       03 S422-140-B69-CTR-NUMESTABL             PIC 9(0006) COMP.389500      
004897*        referencia                                               389600      
004898       03 S422-140-B69-CTR-REFE                  PIC X(0030).     389700      
004899*        fecha de alta                                            389800      
004900       03 S422-140-B69-CTR-FEALTA-2K             PIC 9(0008) COMP.389900      
004901*        fecha de modificacion                                    390000      
004902       03 S422-140-B69-CTR-FECMOD-2K             PIC 9(0008) COMP.390100      
004903*        fecha ultima consulta                                    390200      
004904       03 S422-140-B69-CTA-FULCON-2K             PIC 9(0008) COMP.390300      
004905*        fecha de baja                                            390400      
004906       03 S422-140-B69-CTR-FBAJA-2K              PIC 9(0008) COMP.390500      
004907*     espacio disponible                                          390600      
004908    02 S422-140-FILLER                           PIC X(0040).     390700      
004909                                                                  390800      
004910                                                                  390900      
004911  77  R422-140-CTR-ERROR                  PIC S9(11) BINARY.      391000      
004912                                                                  391100      
004913**********************************************************        391200      
004914***  PARAMETROS PARA ENTRY POINT S016_L422_PROSP   (141)          391300      
004915***   CONSULTA AL S016B63PROSCTE.                                 391400      
004916**********************************************************        391500      
004917 01 E422-141-CTR-ENTRADA.                                         391600      
004918*     opcion                                                      391700      
004919    02 E422-141-CTR-OPC                          PIC 9(0002).     391800      
004920*     numero de cliente                                           391900      
004921    02 E422-141-B63-CTENUM                       PIC 9(0012).     392000      
004922*     numero de prospecto                                         392100      
004923    02 E422-141-B63-CTE-NUMPROS                  PIC 9(0012).     392200      
004924*     espacio disponible                                          392300      
004925    02 E422-141-FILLER                           PIC X(0040).     392400      
004926                                                                  392500      
004927 01 S422-141-CTR-SALIDA.                                          392600      
004928*     numero de cliente                                           392700      
004929    02 S422-141-B63-CTENUM                       PIC 9(0012) COMP.392800      
004930*     numero de ocurrencias devueltas                             392900      
004931    02 S422-141-CTR-NUMOC                        PIC 9(0002) COMP.393000      
004932*     indicardor existen mas registros                            393100      
004933    02 S422-141-CTR-HAYMAS                       PIC 9(0002) COMP.393200      
004934   02 S422-141-TABLA OCCURS 015 TIMES.                            393300      
004935*        numero de producto                                       393400      
004936       03 S422-141-B63-CTA-NUMPROD               PIC 9(0004) COMP.393500      
004937*        numero de instrumento                                    393600      
004938       03 S422-141-B63-CTA-CVEINST               PIC 9(0002) COMP.393700      
004939*        prefijo                                                  393800      
004940       03 S422-141-B63-CTA-NUMPREF               PIC 9(0004) COMP.393900      
004941*        numero de cuenta                                         394000      
004942       03 S422-141-B63-CTA-NUM                   PIC 9(0012) COMP.394100      
004943*        numero de prospecto                                      394200      
004944       03 S422-141-B63-CTE-NUMPROS               PIC 9(0012) COMP.394300      
004945*        tipo de prospecto                                        394400      
004946       03 S422-141-B63-CTE-TIPPROS               PIC 9(0004) COMP.394500      
004947*        sucursal que lleva la cuenta                             394600      
004948       03 S422-141-B63-CTA-NUMSUC                PIC 9(0004) COMP.394700      
004949*        tipo de parentesco                                       394800      
004950       03 S422-141-B63-CTR-CVETITCTE             PIC 9(0004) COMP.394900      
004951*        nombre del prospecto                                     395000      
004952       03 S422-141-B63-CTE-NOM                   PIC X(0100).     395100      
004953*        calle y numero                                           395200      
004954       03 S422-141-B63-CTE-CALLENUM              PIC X(0036).     395300      
004955*        colonia                                                  395400      
004956       03 S422-141-B63-CTE-NOMCOL                PIC X(0024).     395500      
004957*        poblacion                                                395600      
004958       03 S422-141-B63-CTE-NOMPOB                PIC X(0020).     395700      
004959*        estado                                                   395800      
004960       03 S422-141-B63-CTE-CVEEDO                PIC 9(0002) COMP.395900      
004961*        codigo postal                                            396000      
004962       03 S422-141-B63-CTE-NUMCP                 PIC 9(0006) COMP.396100      
004963*        numero telefonico                                        396200      
004964       03 S422-141-B63-CTE-NUMTEL                PIC 9(0010) COMP.396300      
004965*        extension telefonica                                     396400      
004966       03 S422-141-B63-CTE-NUMTELEXT             PIC 9(0006) COMP.396500      
004967*        cve telefono,casa,oficina,fax                            396600      
004968       03 S422-141-B63-CTE-CVETEL                PIC 9(0002) COMP.396700      
004969*        numero telefono 2                                        396800      
004970       03 S422-141-B63-CTE-NUMTEL2               PIC 9(0010) COMP.396900      
004971*        numero extencion 2                                       397000      
004972       03 S422-141-B63-CTE-NUMTELEX2             PIC 9(0006) COMP.397100      
004973*        cve telefono2,casa,ofi.,fax                              397200      
004974       03 S422-141-B63-CTE-CVETEL2               PIC 9(0002) COMP.397300      
004975*        status del domicilio                                     397400      
004976       03 S422-141-B63-CTR-CVESTADOM             PIC 9(0002) COMP.397500      
004977*        clave del domicilio                                      397600      
004978       03 S422-141-B63-CTR-CVEDOM                PIC 9(0002) COMP.397700      
004979*        estado civil del prospecto                               397800      
004980       03 S422-141-B63-CTE-EDOCIVIL              PIC 9(0002) COMP.397900      
004981*        iniciales del rfc                                        398000      
004982       03 S422-141-B63-CTE-CODINI                PIC X(0004).     398100      
004983*        fecha del rfc aammdd                                     398200      
004984       03 S422-141-B63-CTE-FECNAC                PIC 9(0006) COMP.398300      
004985*        homonimia del rfc                                        398400      
004986       03 S422-141-B63-CTE-CODHOM                PIC X(0005).     398500      
004987*        persona fisica = 1, moral = 2                            398600      
004988       03 S422-141-B63-CTE-CVEPERS               PIC 9(0002) COMP.398700      
004989*        sexo masculino = 1, femenino = 2                         398800      
004990       03 S422-141-B63-CTE-CVESEXO               PIC 9(0002) COMP.398900      
004991*        nacionalidad del prospecto                               399000      
004992       03 S422-141-B63-CTE-CVENACION             PIC 9(0002) COMP.399100      
004993*        pais de origen del prospecto                             399200      
004994       03 S422-141-B63-CTE-PAIS                  PIC 9(0004) COMP.399300      
004995*        fecha de nacimiento del benef                            399400      
004996       03 S422-141-B63-CTE-FECNACIM              PIC 9(0008) COMP.399500      
004997*        fecha de alta del benef aaaammdd                         399600      
004998       03 S422-141-B63-CTE-FEALTA-2K             PIC 9(0008) COMP.399700      
004999*        fecha ultima modificacion aaaammdd                       399800      
005000       03 S422-141-B63-CTE-FEULMO-2K             PIC 9(0008) COMP.399900      
005001*        estatus del prospecto                                    400000      
005002       03 S422-141-B63-CTE-CVESTATUS             PIC 9(0002) COMP.400100      
005003*        correo electronico                                       400200      
005004       03 S422-141-B63-CTE-EMAIL                 PIC X(0078).     400300      
005005*     espacio disponible                                          400400      
005006    02 S422-141-FILLER                           PIC X(0040).     400500      
005007                                                                  400600      
005008 77 R422-141-CTR-ERROR                  PIC S9(11) BINARY.        400700      
005009                                                                  400800      
005010**********************************************************        400900      
005011***  PARAMETROS PARA ENTRY POINT S016_L422_MDAVIRTUAL (142)       401000      
005012***   CONSULTA AL S016B73MDAVIRTUAL.                              401100      
005013**********************************************************        401200      
005014 01 E422-142-CTR-ENTRADA.                                         401300      
005015*     opcion                                                      401400      
005016    02 E422-142-OPC                              PIC 9(0002) COMP.401500      
005017*     numero de cliente                                           401600      
005018    02 E422-142-CTE-NUM                          PIC 9(0012) COMP.401700      
005019*     numero de producto                                          401800      
005020    02 E422-142-CTA-PROD                         PIC 9(0004) COMP.401900      
005021*     numero de instrumento                                       402000      
005022    02 E422-142-CTA-INST                         PIC 9(0002) COMP.402100      
005023*     numero de prefijo                                           402200      
005024    02 E422-142-CTA-PREF                         PIC 9(0004) COMP.402300      
005025*     numero de cuenta                                            402400      
005026    02 E422-142-CTA-NUM                          PIC 9(0012) COMP.402500      
005027*     Alias                                                       402600      
005028    02 E422-142-ALIAS                            PIC X(0026).     402700      
005029*     tipo de medio de acceso                                     402800      
005030    02 E422-142-MDA-CVETIPO                      PIC 9(0002) COMP.402900      
005031*     titularidad                                                 403000      
005032    02 E422-142-MDA-NUMPREF                      PIC 9(0004) COMP.403100      
005033*     prefijo del medio de acceso                                 403200      
005034    02 E422-142-MDA-NUM                          PIC 9(0012) COMP.403300      
005035*     numero de cuenta del medio                                  403400      
005036    02 FILLER                                    PIC X(0200).     403500      
005037                                                                  403600      
005038 01 S422-142-CTR-SALIDA.                                          403700      
005039*   numero de cliente                                             403800      
005040    02 S422-142-CTE-NUM                       PIC 9(0012) COMP.   403900      
005041*   numero de producto                                            404000      
005042    02 S422-142-CTA-NUMPROD                   PIC 9(0004) COMP.   404100      
005043*   numero de instrumento                                         404200      
005044    02 S422-142-CTA-CVEINST                   PIC 9(0002) COMP.   404300      
005045*   prefijo del medio de acceso                                   404400      
005046    02 S422-142-CTA-NUMPREF                   PIC 9(0004) COMP.   404500      
005047*   numero de cuenta del medio                                    404600      
005048    02 S422-142-CTA-NUM                       PIC 9(0012) COMP.   404700      
005049*   numero de ocurrencias devueltas                               404800      
005050    02 S422-142-CTR-NUMOC                     PIC 9(0002) COMP.   404900      
005051*   indicardor existen mas registros                              405000      
005052    02 S422-142-CTR-HAYMAS                    PIC 9(0002) COMP.   405100      
005053                                                                  405200      
005054    02 S422-142-TABLA OCCURS 010 TIMES.                           405300      
005055*      Cvetipo de medio de acceso                                 405400      
005056       03 S422-142-MDA-CVETIPO                   PIC 9(0002) COMP.405500      
005057*      subtipo de medio de acceso                                 405600      
005058       03 S422-142-MDA-SUBTIPO                   PIC 9(0002) COMP.405700      
005059*      titularidad                                                405800      
005060       03 S422-142-MDA-CVETIT                    PIC 9(0002) COMP.405900      
005061*      prefijo del medio de acceso                                406000      
005062       03 S422-142-MDA-NUMPREF                   PIC 9(0004) COMP.406100      
005063*      numero de cuenta del medio                                 406200      
005064       03 S422-142-MDA-NUM                       PIC 9(0012) COMP.406300      
005065*      titulo prof. para nonbre tit                               406400      
005066       03 S422-142-MDA-ABRPROFT                  PIC X(0003).     406500      
005067*      alias del cliente                                          406600      
005068       03 S422-142-CTE-ALIAS                     PIC X(0026).     406700      
005069*      titulo prof. para nombre cot.                              406800      
005070       03 S422-142-MDA-ABRPROFC                  PIC X(0003).     406900      
005071*      numero de talonarios en dotacion                           407000      
005072       03 S422-142-MDA-NUMTALON                  PIC 9(0002) COMP.407100      
005073*      numero de cheques por talonario                            407200      
005074       03 S422-142-MDA-CHQXTALON                 PIC 9(0002) COMP.407300      
005075*      clave secreta para BCAELEC                                 407400      
005076       03 S422-142-MDA-CVEPIN                    PIC 9(0006) COMP.407500      
005077*      estatus del medio                                          407600      
005078       03 S422-142-MDA-CVESTATUS                 PIC 9(0002) COMP.407700      
005079*      periodo del vencimiento                                    407800      
005080       03 S422-142-MDA-PERIODO                   PIC 9(0002) COMP.407900      
005081*      situacion del medio                                        408000      
005082       03 S422-142-MDA-SITUACION                 PIC X(0004).     408100      
005083*      envio de correspondencia                                   408200      
005084       03 S422-142-MDA-CVEENVIO                  PIC 9(0002) COMP.408300      
005085*      fecha de alta del medio AAAAMMDD                           408400      
005086       03 S422-142-MDA-FECALTA                   PIC 9(0008) COMP.408500      
005087*      fec ultima modificacion AAAAMMDD                           408600      
005088       03 S422-142-MDA-FEULMO                    PIC 9(0008) COMP.408700      
005089*      fecha del ultimo acceso AAAAMMDD                           408800      
005090       03 S422-142-MDA-FEULAC                    PIC 9(0008) COMP.408900      
005091*      fecha de vencimiento    AAAAMMDD                           409000      
005092       03 S422-142-MDA-FEVENC                    PIC 9(0008) COMP.409100      
005093*      fecha de cancelacion    AAAAMMDD                           409200      
005094       03 S422-142-MDA-FECANC                    PIC 9(0008) COMP.409300      
005095*      fecha de modificacion del PIN                              409400      
005096       03 S422-142-MDA-FEMOPI                    PIC 9(0008) COMP.409500      
005097*      hora de prevencion     HHMM                                409600      
005098       03 S422-142-MDA-HHPREV                    PIC 9(0004) COMP.409700      
005099*      hora de alta           HHMM                                409800      
005100       03 S422-142-MDA-HHALTA                    PIC 9(0004) COMP.409900      
005101*      hora de ultima modificacion HHMM                           410000      
005102       03 S422-142-MDA-HHULTMOD                  PIC 9(0004) COMP.410100      
005103*      hora de ultimo acceso       HHMM                           410200      
005104       03 S422-142-MDA-HHULTACC                  PIC 9(0004) COMP.410300      
005105*      hora de vencimiento         HHMM                           410400      
005106       03 S422-142-MDA-HHVENC                    PIC 9(0004) COMP.410500      
005107                                                                  410600      
005108*     espacio disponible                                          410700      
005109    02 S422-142-FILLER                           PIC X(0050).     410800      
005110                                                                  410900      
005111 77  R422-142-CTR-ERROR                  PIC S9(11) BINARY.       411000      
005112                                                                  411100      
005113******************************************************************411200      
005114***    PARAMETROS  S016_L422_EXTERNAS    (144)                 ***411300      
005115****   CONSULTA S016B69EXTERNAS                                 **411400      
005116******************************************************************411500      
005117*                                                                 411600      
005118 77  R422-144-CTR-ERROR                   PIC S9(11) BINARY.      411700      
005119*                                                                 411800      
005120 01  E422-144-CTR-ENTRADA.                                        411900      
005121     03 E422-144-CTE-NUM                  PIC 9(012) COMP.        412000      
005122     03 E422-144-CTA-CLABE-TAR            PIC 9(020) COMP.        412100      
005123     03 E422-144-CTA-BANCO                PIC 9(004) COMP.        412200      
005124     03 E422-144-CTE-NUMPROSP             PIC 9(012) COMP.        412300      
005125     03 E422-144-CTA-CUENTIP              PIC 9(002) COMP.        412400      
005126     03 E422-144-CTR-NUMESTABL            PIC 9(006) COMP.        412500      
005127     03 E422-144-CTR-OPCION               PIC 9(002) COMP.        412600      
005128     03 FILLER                            PIC X(002).             412700      
005129* SIZE ENTRADA X(60)*                                             412800      
005130*                                                                 412900      
005131 01  S422-144-CTR-SALIDA.                                         413000      
005132     03 S422-144-CTE-NUM                PIC 9(012) COMP.          413100      
005133     03 S422-144-CTA-CLABE-TAR          PIC 9(020) COMP.          413200      
005134     03 S422-144-CTA-BANCO              PIC 9(004) COMP.          413300      
005135     03 S422-144-CTA-SUC                PIC 9(004) COMP.          413400      
005136     03 S422-144-CTE-NUMPROS            PIC 9(012) COMP.          413500      
005137     03 S422-144-CTA-CUENTIP            PIC 9(002) COMP.          413600      
005138     03 S422-144-CTA-CVEMONEDA          PIC 9(002) COMP.          413700      
005139     03 S422-144-CTR-CODSWIFT           PIC X(012).               413800      
005140     03 S422-144-CTR-CODABA             PIC X(010).               413900      
005141     03 S422-144-CTA-MEDALTA            PIC 9(004) COMP.          414000      
005142     03 S422-144-CTR-GERCTA             PIC 9(002) COMP.          414100      
005143     03 S422-144-CTE-CVEPERS            PIC 9(002) COMP.          414200      
005144     03 S422-144-CTA-ALIAS              PIC X(020).               414300      
005145     03 S422-144-CTE-CVESECTOR          PIC 9(002) COMP.          414400      
005146     03 S422-144-CTR-LIMAXUT            PIC 9(014) COMP.          414500      
005147     03 S422-144-SER-PERIODLIM          PIC X(001).               414600      
005148     03 S422-144-CTE-CURP               PIC X(018).               414700      
005149     03 S422-144-CTR-NUMESTABL          PIC 9(006) COMP.          414800      
005150     03 S422-144-CTR-REFE               PIC X(030).               414900      
005151     03 S422-144-CTR-FEALTA-2K          PIC 9(008) COMP.          415000      
005152     03 S422-144-CTR-FECMOD-2K          PIC 9(008) COMP.          415100      
005153     03 S422-144-CTA-FULCON-2K          PIC 9(008) COMP.          415200      
005154     03 S422-144-CTR-FBAJA-2K           PIC 9(008) COMP.          415300      
005155     03 S422-144-CTE-SERVNUM            PIC 9(004) COMP.          415400      
005156     03 S422-144-CTR-HORALTA            PIC 9(008) COMP.          415500      
005157                                                                  415600      
005158                                                                  415700      
005159                                                                  415800      
005160  01  S422-144-RCTR-SALIDA REDEFINES S422-144-CTR-SALIDA.         415900      
005161     03 S422-144-CTR-ERROR                 PIC 9(004)    COMP.    416000      
005162     03 S422-144-CTR-ERRORTYPE             PIC 9(004)    COMP.    416100      
005163     03 S422-144-CTR-STRUCTURE             PIC 9(004)    COMP.    416200      
005164     03 FILLER                            PIC X(140).             416300      
005165******************************************************************416400      
005166******************************************************************416500      
005167***    PARAMETROS  S016_L422_TERCEROS_HH    (145)              ***416600      
005168****   CONSULTA S016B11TERCEROS CON HH                          **416700      
005169******************************************************************416800      
005170*                                                                 416900      
005171 77  R422-145-CTR-ERROR                   PIC S9(11) BINARY.      417000      
005172*                                                                 417100      
005173 01  E422-145-CTR-ENTRADA.                                        417200      
005174     03 E422-145-CTE-NUM                PIC 9(012) COMP.          417300      
005175     03 E422-145-CTA-NUMPROD            PIC 9(004) COMP.          417400      
005176     03 E422-145-CTA-CVEINST            PIC 9(002) COMP.          417500      
005177     03 E422-145-CTA-NUMPREF            PIC 9(004) COMP.          417600      
005178     03 E422-145-CTA-NUM                PIC 9(012) COMP.          417700      
005179     03 E422-145-SER-CVEUSOCTA          PIC 9(002) COMP.          417800      
005180     03 E422-145-CTA-3DIGITOS           PIC 9(004) COMP.          417900      
005181     03 E422-145-CTR-OPCION             PIC 9(002) COMP.          418000      
005182     03 FILLER                          PIC X(018).               418100      
005183* SIZE ENTRADA X(60)*                                             418200      
005184*                                                                 418300      
005185 01  S422-145-CTR-SALIDA.                                         418400      
005186     03 S422-145-CTR-NUMCSI         PIC 9(002) COMP.              418500      
005187     03 S422-145-CTE-NUM            PIC 9(012) COMP.              418600      
005188     03 S422-145-CTA-NUMPROD        PIC 9(004) COMP.              418700      
005189     03 S422-145-CTA-CVEINST        PIC 9(002) COMP.              418800      
005190     03 S422-145-CTA-NUMPREF        PIC 9(004) COMP.              418900      
005191     03 S422-145-CTA-NUM            PIC 9(012) COMP.              419000      
005192     03 S422-145-SER-LIMAXAUT       PIC 9(014) COMP.              419100      
005193     03 S422-145-SER-PERIODLIM      PIC X(001).                   419200      
005194     03 S422-145-CTA-CVEMONEDA      PIC 9(002) COMP.              419300      
005195     03 S422-145-SER-CVEUSOCTA      PIC 9(002) COMP.              419400      
005196     03 S422-145-CTR-FECALTTER      PIC 9(006) COMP.              419500      
005197     03 S422-145-CTR-FECMODTER      PIC 9(006) COMP.              419600      
005198     03 S422-145-SER-FECFINVIG      PIC 9(004) COMP.              419700      
005199     03 S422-145-CTA-3DIGITOS       PIC 9(004) COMP.              419800      
005200     03 S422-145-CTR-FEALTE-2K      PIC 9(008) COMP.              419900      
005201     03 S422-145-CTR-FEMOTE-2K      PIC 9(008) COMP.              420000      
005202     03 S422-145-SER-FEFIVI-2K      PIC 9(006) COMP.              420100      
005203     03 S422-145-CTR-FBAJA-2K       PIC 9(008) COMP.              420200      
005204     03 S422-145-CTA-FULCON-2K      PIC 9(008) COMP.              420300      
005205     03 S422-145-CTA-ALIAS          PIC X(020) .                  420400      
005206     03 S422-145-CTA-MEDALTA        PIC 9(004) COMP.              420500      
005207     03 S422-145-CTR-GERCTA         PIC 9(002) COMP.              420600      
005208     03 S422-145-CTR-HORALTA        PIC 9(008) COMP.              420700      
005209                                                                  420800      
005210                                                                  420900      
005211                                                                  421000      
005212  01  S422-145-RCTR-SALIDA REDEFINES S422-145-CTR-SALIDA.         421100      
005213     03 S422-145-CTR-ERROR                 PIC 9(004)    COMP.    421200      
005214     03 S422-145-CTR-ERRORTYPE             PIC 9(004)    COMP.    421300      
005215     03 S422-145-CTR-STRUCTURE             PIC 9(004)    COMP.    421400      
005216     03 FILLER                             PIC X(078).            421500      
005217                                                                  421600      
005218******************************************************************421700      
005219** INFOWARE PROYECTO JFP MARZO 2010                         JRS **421800      
005220** FD DE PARAMETROS DEL ENTRYPOINT S016_L422_CTASINCORP2(143)   **421900      
005221******************************************************************422000      
005222 01 E422-143-CTR-ENT.                                             422100      
005223    02 E422-143-LIB-OPC                PIC 9(02) COMP.            422200      
005224    02 E422-143-CTE-NUM                PIC 9(12) COMP.            422300      
005225    02 E422-143-CTA-PROD               PIC 9(04) COMP.            422400      
005226    02 E422-143-CTA-INST               PIC 9(02) COMP.            422500      
005227    02 E422-143-CTA-PREF               PIC 9(04) COMP.            422600      
005228    02 E422-143-CTA-NUM                PIC 9(12) COMP.            422700      
005229    02 E422-143-NUM-OCR                PIC 9(02) COMP.            422800      
005230*** INICIO CAMBIOS MACV INFOWARE-IBM AGOSTO 2016                  422900      
005231    02 E422-143-MDA-NUMCTO                           .            423000      
005232       04 E422-143-MDA-NUMPREF         PIC 9(04) COMP.            423100      
005233       04 E422-143-MDA-NUM             PIC 9(12) COMP.            423200      
005234***  FIN   CAMBIOS MACV INFOWARE-IBM AGOSTO 2016                  423300      
005235 01 S422-143-CTR-SAL.                                             423400      
005236    02 S422-143-CSI-NUM                PIC 9(02) COMP.            423500      
005237    02 S422-143-CTE-NUM                PIC 9(12) COMP.            423600      
005238    02 S422-143-CTE-CVESTATUS          PIC 9(02) COMP.            423700      
005239    02 S422-143-CTE-CVEPERS            PIC 9(02) COMP.            423800      
005240    02 S422-143-CTE-NUMCLASIF          PIC 9(02) COMP.            423900      
005241    02 S422-143-NUM-OCR                PIC 9(02) COMP.            424000      
005242    02 S422-143-HAY-MAS                PIC 9(02) COMP.            424100      
005243    02 S422-143-TABLA OCCURS 20 TIMES                .            424200      
005244       03 S422-143-CTA-NUMPROD         PIC 9(04) COMP.            424300      
005245       03 S422-143-CTA-CVEINST         PIC 9(02) COMP.            424400      
005246       03 S422-143-CTA-NUMPREF         PIC 9(04) COMP.            424500      
005247       03 S422-143-CTA-NUM             PIC 9(12) COMP.            424600      
005248       03 S422-143-CTA-CVESTATUS       PIC 9(02) COMP.            424700      
005249       03 S422-143-CTA-NUMSUC          PIC 9(04) COMP.            424800      
005250       03 S422-143-CTA-CVEMONEDA       PIC 9(02) COMP.            424900      
005251       03 S422-143-CTA-CVEMANEJO       PIC 9(02) COMP.            425000      
005252       03 S422-143-CTA-CVEENVIO        PIC 9(04) COMP.            425100      
005253       03 S422-143-CTA-FEALCT-2K       PIC 9(08) COMP.            425200      
005254       03 S422-143-CTA-FEMOCT-2K       PIC 9(08) COMP.            425300      
005255       03 S422-143-CTA-RELCTE          PIC 9(02) COMP.            425400      
005256       03 S422-143-CTA-USOBCAELE       PIC 9(02) COMP.            425500      
005257       03 S422-143-CTA-ASOCIADAX       PIC 9(02) COMP.            425600      
005258       03 S422-143-CTA-3DIGITOS        PIC 9(04) COMP.            425700      
005259       03 S422-143-MDA-CVETIPO         PIC 9(02) COMP.            425800      
005260       03 S422-143-MDA-SUBTIPO         PIC 9(02) COMP.            425900      
005261       03 S422-143-MDA-CVETIT          PIC 9(02) COMP.            426000      
005262       03 S422-143-MDA-NUMCTO                        .            426100      
005263          05 S422-143-MDA-NUMPREF      PIC 9(04) COMP.            426200      
005264          05 S422-143-MDA-NUM          PIC 9(12) COMP.            426300      
005265       03 S422-143-MDA-CVESTATUS       PIC 9(02) COMP.            426400      
005266       03 S422-143-MDA-ABRPROFT        PIC X(03)     .            426500      
005267       03 S422-143-CTR-PTRNOMT         PIC 9(04) COMP.            426600      
005268       03 S422-143-MDA-ABRPROFC        PIC X(03)     .            426700      
005269       03 S422-143-CTR-PTRNOMC         PIC 9(04) COMP.            426800      
005270       03 S422-143-CTA-PRESEN          PIC 9(02) COMP.            426900      
005271       03 S422-143-MDA-FEALTA-2K       PIC 9(08) COMP.            427000      
005272       03 S422-143-MDA-FEULMO-2K       PIC 9(08) COMP.            427100      
005273                                                                  427200      
005274 77  R422-143-CTR-ERROR                PIC S9(11) BINARY.         427300      
005275                                                                  427400      
005276******************************************************************427500      
005277                                                                  427600      
005278******************************************************************427700      
005279** PARAMETROS          S016_L422_CONS_TERS_2  (146)             **427800      
005280** Dialogo para consulta de cuentas y montos operables Terceros **427900      
005281** Banamex                                                      **428000      
005282******************************************************************428100      
005283*                                                                 428200      
005284 77 R422-146-CTR-ERROR                PIC S9(11) BINARY.          428300      
005285*                                                                 428400      
005286 01 E422-146-CTR-ENTRADA.                                         428500      
005287    02 E422-146-CTR-NUMCSI            PIC 9(02) COMP.             428600      
005288    02 E422-146-CTE-NUM               PIC 9(12) COMP.             428700      
005289    02 E422-146-CTO-NUM.                                          428800      
005290       03 E422-146-CTA-NUMPREF        PIC 9(04) COMP.             428900      
005291       03 E422-146-CTA-NUM            PIC 9(12) COMP.             429000      
005292    02 E422-146-CTA-OPCION            PIC 9(02) COMP.             429100      
005293    02 FILLER                         PIC X(44).                  429200      
005294*SIZE ENTRADA X(60).                                              429300      
005295*                                                                 429400      
005296  01 S422-146-CTR-SALIDA.                                         429500      
005297     02 S422-146-SER-LIMAXAUT         PIC 9(14) COMP.             429600      
005298     02 S422-146-SER-PERIODLIM        PIC X(01).                  429700      
005299     02 S422-146-CTE-NOM              PIC X(55).                  429800      
005300     02 S422-146-CTA-NOMBRE           PIC X(20).                  429900      
005301     02 S422-146-CTR-FEMOTE-2K        PIC 9(08) COMP.             430000      
005302     02 S422-146-CTR-STATUS           PIC 9(02) COMP.             430100      
005303     02 S422-146-CTR-FECALTA          PIC 9(08) COMP.             430200      
005304     02 S422-146-CTR-HORALTA          PIC 9(08) COMP.             430300      
005305     02 FILLER                        PIC X(06).                  430400      
005306* SIZE SALIDA X(90).                                              430500      
005307*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-**430600      
005308******************************************************************430700      
005309** PARAMETROS          S016_L422_CONS_INTER_2 (147)             **430800      
005310** Dialogo para consulta de cuentas y montos operables          **430900      
005311** interbancarios                                               **431000      
005312******************************************************************431100      
005313*                                                                 431200      
005314 77 R422-147-CTR-ERROR                PIC S9(11) BINARY.          431300      
005315*                                                                 431400      
005316 01 E422-147-CTR-ENTRADA.                                         431500      
005317    02 E422-147-CTE-NUM               PIC 9(12) COMP.             431600      
005318    02 E422-147-CTA-CLABE-TARJ        PIC 9(20) COMP.             431700      
005319    02 E422-147-CTA-CLAVE-TARJ-R      REDEFINES                   431800      
005320                                      E422-147-CTA-CLABE-TARJ.    431900      
005321       03 E422-147-CTA-CLABE          PIC 9(04) COMP.             432000      
005322       03 E422-147-CTA-NUMPREF        PIC 9(04) COMP.             432100      
005323       03 E422-147-CTA-NUM            PIC 9(12) COMP.             432200      
005324    02 E422-147-CTE-NOMBENEF          PIC X(55).                  432300      
005325    02 E422-147-CTA-OPCION            PIC 9(02) COMP.             432400      
005326    02 E422-147-TIPO-CTA              PIC 9(02) COMP.             432500      
005327    02 E422-147-ESTABL                PIC 9(06) COMP.             432600      
005328    02 E422-147-CTE-SERVNUM           PIC 9(04) COMP.             432700      
005329    02 FILLER                         PIC X(24).                  432800      
005330*SIZE ENTRADA X(96).                                              432900      
005331*                                                                 433000      
005332  01 S422-147-CTR-SALIDA.                                         433100      
005333     02 S422-147-SER-LIMAXAUT         PIC 9(14) COMP.             433200      
005334     02 S422-147-SER-PERIODLIM        PIC X(01).                  433300      
005335*   SE DA COMO CONFIRMACION DEL NOMBRE DEL BENEF. ENCONTRADO      433400      
005336     02 S422-147-CTE-NOMBENEF         PIC X(55).                  433500      
005337     02 S422-147-CTA-NOMBRE           PIC X(20).                  433600      
005338     02 S422-147-CTR-FEMOTE-2K        PIC 9(08) COMP.             433700      
005339     02 S422-147-CTA-BCO              PIC 9(04) COMP.             433800      
005340     02 S422-147-CTR-STATUS           PIC 9(02) COMP.             433900      
005341     02 S422-147-CTE-SERVNUM          PIC 9(04) COMP.             434000      
005342     02 S422-147-CTR-FECALTA          PIC 9(08) COMP.             434100      
005343     02 S422-147-CTR-HORALTA          PIC 9(08) COMP.             434200      
005344     02 FILLER                        PIC X(06).                  434300      
005345* SIZE SALIDA X(96).                                              434400      
005346                                                                  434500      
005347* ZUMA-EGS INICIO MULTIEMPRESAS JUNIO 2010                        434600      
005348**********************************************************        434700      
005349**               S016_L422_B72SXEMPRCTE (146)                   * 434800      
005350**        CONSULTA DEL DATASET S016B72MULTIEMPRESAS             * 434900      
005351***************************************************************** 435000      
005352                                                                  435100      
005353* DATOS DE ENTRADA                                                435200      
005354 01 E422-148-CTR-ENTRADA.                                         435300      
005355* EMPRESA A LA QUE PERTENECE                                      435400      
005356    02 E422-148-CTE-EMPRESA PIC 9(06) COMP.                       435500      
005357* NUMERO DE CLIENTE                                               435600      
005358    02 E422-148-CTE-NUM     PIC 9(12) COMP.                       435700      
005359    02 FILLER               PIC X(06).                            435800      
005360    02 E422-148-CTR-ROLEMPR PIC 9(02).                            435900      
005361    02 FILLER               PIC X(32).                            436000      
005362* SIZE ENTRADA X(50).                                             436100      
005363                                                                  436200      
005364* DATOS DE SALIDA                                                 436300      
005365                                                                  436400      
005366 01 S422-148-CTR-SALIDA.                                          436500      
005367    02 S422-148-CTE-EMPRESA PIC 9(06) COMP.                       436600      
005368    02 S422-148-CTE-NUM     PIC 9(12) COMP.                       436700      
005369    02 S422-148-CTE-ESTATUS PIC 9(02) COMP.                       436800      
005370    02 S422-148-CTE-DOMPRIN PIC 9(04) COMP.                       436900      
005371    02 S422-148-CTE-ROLEMPR PIC 9(02) COMP.                       437000      
005372    02 S422-148-CTE-FECALTA PIC 9(08) COMP.                       437100      
005373    02 S422-148-CTE-FEULMOD PIC 9(08) COMP.                       437200      
005374    02 S422-148-CTE-FECBAJA PIC 9(08) COMP.                       437300      
005375*   02 FILLER               PIC X(10).                            437400      
005376                                                                  437500      
005377* SIZE SALIDA X(60).                                              437600      
005378                                                                  437700      
005379 77 R422-148-CTR-ERROR      PIC S9(11) BINARY.                    437800      
005380                                                                  437900      
005381* ZUMA-EGS INICIO MULTIEMPRESAS JUNIO 2010                        438000      
005382                                                                  438100      
005383******************************************************************438200      
005384** INFOWARE PROYECTO SHJ SEPTIEMBRE DEL 2010                SHJ **438300      
005385** FD DE PARAMETROS DEL ENTRYPOINT S016_L422_CTASINCORP3(149)   **438400      
005386******************************************************************438500      
005387 01 E422-149-CTR-ENT.                                             438600      
005388    02 E422-149-LIB-OPC                PIC 9(02) COMP.            438700      
005389    02 E422-149-CTE-NUM                PIC 9(12) COMP.            438800      
005390    02 E422-149-CTA-PROD               PIC 9(04) COMP.            438900      
005391    02 E422-149-CTA-INST               PIC 9(02) COMP.            439000      
005392    02 E422-149-CTA-PREF               PIC 9(04) COMP.            439100      
005393    02 E422-149-CTA-NUM                PIC 9(12) COMP.            439200      
005394    02 E422-149-NUM-OCR                PIC 9(02) COMP.            439300      
005395 01 S422-149-CTR-SAL.                                             439400      
005396    02 S422-149-CSI-NUM                PIC 9(02) COMP.            439500      
005397    02 S422-149-CTE-NUM                PIC 9(12) COMP.            439600      
005398    02 S422-149-CTE-CVESTATUS          PIC 9(02) COMP.            439700      
005399    02 S422-149-CTE-CVEPERS            PIC 9(02) COMP.            439800      
005400    02 S422-149-CTE-NUMCLASIF          PIC 9(02) COMP.            439900      
005401    02 S422-149-NUM-OCR                PIC 9(02) COMP.            440000      
005402    02 S422-149-HAY-MAS                PIC 9(02) COMP.            440100      
005403    02 S422-149-TABLA OCCURS 15 TIMES                .            440200      
005404       03 S422-149-CTA-NUMPROD         PIC 9(04) COMP.            440300      
005405       03 S422-149-CTA-CVEINST         PIC 9(02) COMP.            440400      
005406       03 S422-149-CTA-NUMPREF         PIC 9(04) COMP.            440500      
005407       03 S422-149-CTA-NUM             PIC 9(12) COMP.            440600      
005408       03 S422-149-CTA-CVESTATUS       PIC 9(02) COMP.            440700      
005409       03 S422-149-CTA-NUMSUC          PIC 9(04) COMP.            440800      
005410       03 S422-149-CTA-CVEMONEDA       PIC 9(02) COMP.            440900      
005411       03 S422-149-CTA-CVEMANEJO       PIC 9(02) COMP.            441000      
005412       03 S422-149-CTA-CVEENVIO        PIC 9(04) COMP.            441100      
005413       03 S422-149-CTA-FEALCT-2K       PIC 9(08) COMP.            441200      
005414       03 S422-149-CTA-FEMOCT-2K       PIC 9(08) COMP.            441300      
005415       03 S422-149-CTA-RELCTE          PIC 9(02) COMP.            441400      
005416       03 S422-149-CTA-USOBCAELE       PIC 9(02) COMP.            441500      
005417       03 S422-149-CTA-ASOCIADAX       PIC 9(02) COMP.            441600      
005418       03 S422-149-CTA-3DIGITOS        PIC 9(04) COMP.            441700      
005419       03 S422-149-MDA-CVETIPO         PIC 9(02) COMP.            441800      
005420       03 S422-149-MDA-SUBTIPO         PIC 9(02) COMP.            441900      
005421       03 S422-149-MDA-CVETIT          PIC 9(02) COMP.            442000      
005422       03 S422-149-MDA-NUMCTO                        .            442100      
005423          05 S422-149-MDA-NUMPREF      PIC 9(04) COMP.            442200      
005424          05 S422-149-MDA-NUM          PIC 9(12) COMP.            442300      
005425       03 S422-149-MDA-CVESTATUS       PIC 9(02) COMP.            442400      
005426       03 S422-149-MDA-ABRPROFT        PIC X(03)     .            442500      
005427       03 S422-149-CTR-PTRNOMT         PIC 9(04) COMP.            442600      
005428       03 S422-149-MDA-ABRPROFC        PIC X(03)     .            442700      
005429       03 S422-149-CTR-PTRNOMC         PIC 9(04) COMP.            442800      
005430       03 S422-149-CTA-PRESEN          PIC 9(02) COMP.            442900      
005431       03 S422-149-MDA-FEALTA-2K       PIC 9(08) COMP.            443000      
005432       03 S422-149-MDA-FEULMO-2K       PIC 9(08) COMP.            443100      
005433       03 S422-149-MDA-NOMBRECOR       PIC X(26).                 443200      
005434                                                                  443300      
005435 77  R422-149-CTR-ERROR                PIC S9(11) BINARY.         443400      
005436                                                                  443500      
005437******************************************************************443600      
005438***    PARAMETROS  S016_L422_B04XCTODUPLI (151)                ***443700      
005439****   PARA CONTRATOS DUPLICADOS CUENTA MAESTRA                 **443800      
005440******************************************************************443900      
005441*                                                                 444000      
005442 77  R422-151-CTR-ERROR                   PIC S9(11) BINARY.      444100      
005443*                                                                 444200      
005444 01  E422-151-CTR-ENTRADA.                                        444300      
005445     03 E422-151-CTA-NUMPREF              PIC 9(004) COMP.        444400      
005446     03 E422-151-CTA-NUM                  PIC 9(012) COMP.        444500      
005447     03 FILLER                            PIC X(044).             444600      
005448* SIZE ENTRADA X(60)*                                             444700      
005449*                                                                 444800      
005450*                                                                 444900      
005451 01  S422-151-CTR-SALIDA.                                         445000      
005452     03 S422-151-CTA-NUMPROD              PIC 9(004) COMP.        445100      
005453     03 S422-151-CTA-CVEINST              PIC 9(004) COMP.        445200      
005454     03 S422-151-CTA-NUMPREF              PIC 9(004) COMP.        445300      
005455     03 S422-151-CTA-NUM                  PIC 9(012) COMP.        445400      
005456     03 FILLER                            PIC X(042).             445500      
005457* SIZE SALIDA X(66)*                                              445600      
005458*                                                                 445700      
005459 01  S422-151-RCTR-SALIDA REDEFINES S422-151-CTR-SALIDA.          445800      
005460     03 S422-151-CTR-ERROR                PIC 9(004) COMP.        445900      
005461     03 S422-151-CTR-ERRORTYPE            PIC 9(004) COMP.        446000      
005462     03 S422-151-CTR-STRUCTURE            PIC 9(004) COMP.        446100      
005463     03 FILLER                            PIC X(054).             446200      
005464                                                                  446300      
005465***************************************************************** 446400      
005466***  PARAMETROS PARA ENTRY POINT S016_L422_CTAXMDAS(154)      *** 446500      
005467***  Consulta todos los medios de acceso de una cuenta.       *** 446600      
005468***  Puede filtrarse para que entregue                        *** 446700      
005469***  solo los medios activos (status = 20,21)                 *** 446800      
005470***************************************************************** 446900      
005471                                                                  447000      
005472*** PARAMETROS DE ENTRADA ***                                     447100      
005473                                                                  447200      
005474 01  E422-154-CTR-ENTRADA.                                        447300      
005475     02  E422-154-CTR-OPCION          PIC 9(02) COMP.             447400      
005476     02  E422-154-CTR-LLAVE.                                      447500      
005477         03  E422-154-CTE-NUM         PIC 9(12) COMP.             447600      
005478         03 E422-154-CTA-NUMPROD      PIC 9(04) COMP.             447700      
005479         03 E422-154-CTA-CVEINST      PIC 9(04) COMP.             447800      
005480         03 E422-154-CTO-NUM.                                     447900      
005481            05 E422-154-CTA-NUMPREF   PIC 9(04) COMP.             448000      
005482            05 E422-154-CTA-NUM       PIC 9(12) COMP.             448100      
005483         03 E422-154-MDA-CVETIPO      PIC 9(02) COMP.             448200      
005484         03 E422-154-MDA-CVETIT       PIC 9(02) COMP.             448300      
005485         03 E422-154-MDA-CTONUM.                                  448400      
005486            05 E422-154-MDA-NUMPREF   PIC 9(04) COMP.             448500      
005487            05 E422-154-MDA-NUM       PIC 9(12) COMP.             448600      
005488     02  E422-154-CTR-NUMREG          PIC 9(02) COMP.             448700      
005489     02  FILLER                       PIC X(28).                  448800      
005490                                                                  448900      
005491*** PARAMETROS DE SALIDA ***                                      449000      
005492                                                                  449100      
005493 01 S422-154-CTR-SALIDA.                                          449200      
005494    02 S422-154-CTR-NUMREG              PIC 9(02) COMP.           449300      
005495    02 S422-154-CTR-HAYMAS              PIC 9(02) COMP.           449400      
005496    02 S422-154-CTE-NUM                 PIC 9(12) COMP.           449500      
005497    02 S422-154-CTA-NUMPROD             PIC 9(04) COMP.           449600      
005498    02 S422-154-CTA-CVEINST             PIC 9(04) COMP.           449700      
005499    02 S422-154-CTA-NUMCTO.                                       449800      
005500       03 S422-154-CTA-NUMPREF          PIC 9(04) COMP.           449900      
005501       03 S422-154-CTA-NUM              PIC 9(12) COMP.           450000      
005502    02 S422-154-CTA-NUMSUC              PIC 9(04) COMP.           450100      
005503    02 S422-154-CTA-CVEMONEDA           PIC 9(02) COMP.           450200      
005504    02 S422-154-CTA-CVEMANEJO           PIC 9(02) COMP.           450300      
005505    02 S422-154-CTA-CVESTATUS           PIC 9(02) COMP.           450400      
005506    02 S422-154-CTR-REGISTRO OCCURS 20 TIMES.                     450500      
005507       03 S422-154-MDA-CVETIPO             PIC 9(02) COMP.        450600      
005508       03 S422-154-MDA-SUBTIPO             PIC 9(02) COMP.        450700      
005509       03 S422-154-MDA-CVETIT              PIC 9(02) COMP.        450800      
005510       03 S422-154-MDA-NUMCTO.                                    450900      
005511          05 S422-154-MDA-NUMPREF          PIC 9(04) COMP.        451000      
005512          05 S422-154-MDA-NUM              PIC 9(12) COMP.        451100      
005513       03 S422-154-MDA-ABRPROFT            PIC X(03).             451200      
005514       03 S422-154-CTR-PTRNOMT             PIC 9(04) COMP.        451300      
005515       03 S422-154-MDA-ABRPROFC            PIC X(03).             451400      
005516       03 S422-154-CTR-PTRNOMC             PIC 9(04) COMP.        451500      
005517       03 S422-154-MDA-NUMTALON            PIC 9(02) COMP.        451600      
005518       03 S422-154-MDA-CHQXTALON           PIC 9(02) COMP.        451700      
005519       03 S422-154-MDA-CVESTATUS           PIC 9(02) COMP.        451800      
005520       03 S422-154-MDA-FECALTA-2K          PIC 9(08) COMP.        451900      
005521       03 S422-154-MDA-FECULTMOD-2K        PIC 9(08) COMP.        452000      
005522       03 S422-154-MDA-FECVENC-2K          PIC 9(08) COMP.        452100      
005523       03 S422-154-MDA-FECCANCEL-2K        PIC 9(08) COMP.        452200      
005524       03 S422-154-MDA-FECPREV             PIC 9(06) COMP.        452300      
005525       03 S422-154-MDA-HHPREV              PIC 9(04) COMP.        452400      
005526**     03 FILLER                           PIC X(21).             452500      
005527**** SIZE reg OCCURS X(10)                                        452600      
005528**** SIZE SALIDA = 1+( *10) =                                     452700      
005529                                                                  452800      
005530 77  R422-154-CTR-ERROR                   PIC S9(11) BINARY.      452900      
005531                                                                  453000      
005532******************************************************************453100      
005533***    PARAMETROS  S016_L422_B01SXCTERFC    (155)                 453200      
005534******************************************************************453300      
005535                                                                  453400      
005536 77  R422-155-CTR-ERROR                   PIC S9(11) BINARY.      453500      
005537                                                                  453600      
005538 01  E422-155-CTR-ENTRADA.                                        453700      
005539     03 E422-155-OPCION                    PIC 9(002) COMP.       453800      
005540     03 E422-155-CTE-NUM                   PIC 9(012) COMP.       453900      
005541     03 E422-155-CTE-CODINI                PIC X(004).            454000      
005542     03 E422-155-CTE-FECNAC                PIC 9(006) COMP.       454100      
005543     03 E422-155-CTE-CODHOM                PIC X(005).            454200      
005544     03 E422-155-HAY-MAS                   PIC X(001).            454300      
005545     03 FILLER                             PIC X(040).            454400      
005546                                                                  454500      
005547* SIZE ENTRADA X(60)*                                             454600      
005548                                                                  454700      
005549 01 S422-155-CTR-SALIDA.                                          454800      
005550   02 S422-155-CTR-NUMREG                     PIC 9(002) COMP.    454900      
005551   02 S422-155-CTR-HAYMAS                     PIC 9(002) COMP.    455000      
005552   02 S422-155-CTR-OCC  OCCURS 10.                                455100      
005553     03 S422-155-CTE-NUM                   PIC 9(012) COMP.       455200      
005554     03 S422-155-CTE-NOM                   PIC X(055).            455300      
005555     03 S422-155-CTE-CALLENUM              PIC X(036).            455400      
005556     03 S422-155-CTE-NOMCOL                PIC X(024).            455500      
005557     03 S422-155-CTE-NOMPOB                PIC X(020).            455600      
005558     03 S422-155-CTE-CVEEDO                PIC 9(002) COMP.       455700      
005559     03 S422-155-CTE-NUMCP                 PIC 9(006) COMP.       455800      
005560     03 S422-155-CTE-NUMTEL                PIC 9(010) COMP.       455900      
005561     03 S422-155-CTE-NUMTELEXT             PIC 9(006) COMP.       456000      
005562     03 S422-155-CTE-CVETEL                PIC 9(002) COMP.       456100      
005563     03 S422-155-CTE-NUMTEL2               PIC 9(010) COMP.       456200      
005564     03 S422-155-CTE-NUMTELEX2             PIC 9(006) COMP.       456300      
005565     03 S422-155-CTE-CVETEL2               PIC 9(002) COMP.       456400      
005566     03 S422-155-CTR-CVESTADOM             PIC 9(002) COMP.       456500      
005567     03 S422-155-CTR-CVEDOM                PIC 9(002) COMP.       456600      
005568     03 S422-155-CTR-NUMDOMS               PIC 9(004) COMP.       456700      
005569     03 S422-155-CTE-CVEPERS               PIC 9(002) COMP.       456800      
005570     03 S422-155-CTE-CVETIPO               PIC 9(002) COMP.       456900      
005571     03 S422-155-CTE-NUMCLASIF             PIC 9(002) COMP.       457000      
005572     03 S422-155-CTE-CODINI                PIC X(004).            457100      
005573     03 S422-155-CTE-FECNAC                PIC 9(006) COMP.       457200      
005574     03 S422-155-CTE-CODHOM                PIC X(005).            457300      
005575     03 S422-155-CTE-CVENACION             PIC 9(002) COMP.       457400      
005576     03 S422-155-CTE-CVESEXO               PIC 9(002) COMP.       457500      
005577     03 S422-155-CTE-FECNACIM-2K           PIC 9(008) COMP.       457600      
005578     03 S422-155-CTE-CAEB                  PIC 9(006) COMP.       457700      
005579     03 S422-155-CTE-CVEACTBM              PIC 9(006) COMP.       457800      
005580     03 S422-155-CTE-EDOCTACON             PIC 9(002) COMP.       457900      
005581     03 S422-155-CTE-CVESECTOR             PIC 9(002) COMP.       458000      
005582     03 S422-155-CTE-CVEPERBCO             PIC 9(002) COMP.       458100      
005583     03 S422-155-CTE-CVESEG                PIC 9(002) COMP.       458200      
005584     03 S422-155-CTE-DIACORTE              PIC 9(002) COMP.       458300      
005585     03 S422-155-CTE-CVEENVIO              PIC 9(004) COMP.       458400      
005586     03 S422-155-CTE-NUMOFICON             PIC 9(004) COMP.       458500      
005587*  NUMOFICON ES EQUIVALENTE A SUCURSAL PROMOTORA                  458600      
005588     03 S422-155-CTE-CVESTATUS             PIC 9(002) COMP.       458700      
005589     03 S422-155-OFI-NUMCSIALT             PIC 9(002) COMP.       458800      
005590     03 S422-155-CTE-FECALTA               PIC 9(008) COMP.       458900      
005591     03 S422-155-CTE-FECULTMOD             PIC 9(008) COMP.       459000      
005592     03 S422-155-CTE-NUMUNIMER             PIC 9(004) COMP.       459100      
005593     03 S422-155-CTE-RIEBNM                PIC X(002).            459200      
005594     03 S422-155-CTE-RIEBM                 PIC X(002).            459300      
005595     03 S422-155-CTE-OCUPACION             PIC 9(002) COMP.       459400      
005596     03 S422-155-CTE-CVEPUB                PIC 9(002) COMP.       459500      
005597     03 S422-155-CTE-SITUACION             PIC X(004).            459600      
005598     03 S422-155-CTE-FECPREV               PIC 9(006) COMP.       459700      
005599     03 S422-155-CTE-RECEPSUC6             PIC 9(004) COMP.       459800      
005600     03 S422-155-CTE-HHRECEP6              PIC 9(004) COMP.       459900      
005601                                                                  460000      
005602  01 S422-155-RCTR-SALIDA REDEFINES S422-155-CTR-SALIDA.          460100      
005603     03 S422-155-CTR-ERROR                 PIC 9(004) COMP.       460200      
005604     03 S422-155-CTR-ERRORTYPE             PIC 9(004) COMP.       460300      
005605     03 S422-155-CTR-STRUCTURE             PIC 9(004) COMP.       460400      
005606     03 FILLER                             PIC X(240).            460500      
005607**                                                                460600      
005608******************************************************************460700      
005609******************************************************************460800      
005610***  PARAMETROS  S016_L422_TERCEROS_NM    (156)                 **460900      
005611***  CONSULTA LAS CUENTAS DE TERCEROS,LAS CUALES SERAN FILTRADAS**461000      
005612***  CON EL INDICADOR DE NO NO SER CREADAS MASIVAMENTE          **461100      
005613******************************************************************461200      
005614*                                                                 461300      
005615 77  R422-156-CTR-ERROR                   PIC S9(11) BINARY.      461400      
005616*                                                                 461500      
005617 01  E422-156-CTR-ENTRADA.                                        461600      
005618     03 E422-156-CTE-NUM                PIC 9(012) COMP.          461700      
005619     03 E422-156-CTA-NUMPROD            PIC 9(004) COMP.          461800      
005620     03 E422-156-CTA-CVEINST            PIC 9(002) COMP.          461900      
005621     03 E422-156-CTA-NUMPREF            PIC 9(004) COMP.          462000      
005622     03 E422-156-CTA-NUM                PIC 9(012) COMP.          462100      
005623     03 E422-156-SER-CVEUSOCTA          PIC 9(002) COMP.          462200      
005624     03 E422-156-CTA-3DIGITOS           PIC 9(004) COMP.          462300      
005625     03 E422-156-CTR-OPCION             PIC 9(002) COMP.          462400      
005626     03 FILLER                          PIC X(018).               462500      
005627* SIZE ENTRADA X(60)*                                             462600      
005628*                                                                 462700      
005629 01  S422-156-CTR-SALIDA.                                         462800      
005630     03 S422-156-CTR-NUMCSI         PIC 9(002) COMP.              462900      
005631     03 S422-156-CTE-NUM            PIC 9(012) COMP.              463000      
005632     03 S422-156-CTA-NUMPROD        PIC 9(004) COMP.              463100      
005633     03 S422-156-CTA-CVEINST        PIC 9(002) COMP.              463200      
005634     03 S422-156-CTA-NUMPREF        PIC 9(004) COMP.              463300      
005635     03 S422-156-CTA-NUM            PIC 9(012) COMP.              463400      
005636     03 S422-156-SER-LIMAXAUT       PIC 9(014) COMP.              463500      
005637     03 S422-156-SER-PERIODLIM      PIC X(001).                   463600      
005638     03 S422-156-CTA-CVEMONEDA      PIC 9(002) COMP.              463700      
005639     03 S422-156-SER-CVEUSOCTA      PIC 9(002) COMP.              463800      
005640     03 S422-156-CTR-FECALTTER      PIC 9(006) COMP.              463900      
005641     03 S422-156-CTR-FECMODTER      PIC 9(006) COMP.              464000      
005642     03 S422-156-SER-FECFINVIG      PIC 9(004) COMP.              464100      
005643     03 S422-156-CTA-3DIGITOS       PIC 9(004) COMP.              464200      
005644     03 S422-156-CTR-FEALTE-2K      PIC 9(008) COMP.              464300      
005645     03 S422-156-CTR-FEMOTE-2K      PIC 9(008) COMP.              464400      
005646     03 S422-156-SER-FEFIVI-2K      PIC 9(006) COMP.              464500      
005647     03 S422-156-CTR-FBAJA-2K       PIC 9(008) COMP.              464600      
005648     03 S422-156-CTA-FULCON-2K      PIC 9(008) COMP.              464700      
005649     03 S422-156-CTA-ALIAS          PIC X(020) .                  464800      
005650     03 S422-156-CTA-MEDALTA        PIC 9(004) COMP.              464900      
005651     03 S422-156-CTR-GERCTA         PIC 9(002) COMP.              465000      
005652     03 S422-156-CTR-HORALTA        PIC 9(008) COMP.              465100      
005653**                                                                465200      
005654  01  S422-156-RCTR-SALIDA REDEFINES S422-156-CTR-SALIDA.         465300      
005655     03 S422-156-CTR-ERROR                 PIC 9(004)    COMP.    465400      
005656     03 S422-156-CTR-ERRORTYPE             PIC 9(004)    COMP.    465500      
005657     03 S422-156-CTR-STRUCTURE             PIC 9(004)    COMP.    465600      
005658     03 FILLER                             PIC X(078).            465700      
005659**                                                                465800      
005660******************************************************************465900      
005661** PARAMETROS          S016_L422_CONS_INTER_3 (157)             **466000      
005662** CONSULTA DE ORDENES DE PAGO Y DE CUENTAS INTERBANCARIAS      **466100      
005663** LAS CUALES SERAN FILTRADAS CON EL INDICADOR DE NO SER        **466200      
005664** CREADAS MASIVAMENTE                                          **466300      
005665******************************************************************466400      
005666*                                                                 466500      
005667 77 R422-157-CTR-ERROR                PIC S9(11) BINARY.          466600      
005668*                                                                 466700      
005669 01 E422-157-CTR-ENTRADA.                                         466800      
005670    02 E422-157-CTE-NUM               PIC 9(12) COMP.             466900      
005671    02 E422-157-CTA-CLABE-TARJ            PIC 9(20) COMP.         467000      
005672    02 E422-157-CTA-CLAVE-TARJ-R      REDEFINES                   467100      
005673                                      E422-157-CTA-CLABE-TARJ.    467200      
005674       03 E422-157-CTA-CLABE          PIC 9(04) COMP.             467300      
005675       03 E422-157-CTA-NUMPREF        PIC 9(04) COMP.             467400      
005676       03 E422-157-CTA-NUM            PIC 9(12) COMP.             467500      
005677    02 E422-157-CTE-NOMBENEF          PIC X(55).                  467600      
005678    02 E422-157-CTA-OPCION            PIC 9(02) COMP.             467700      
005679    02 E422-157-TIPO-CTA              PIC 9(02) COMP.             467800      
005680    02 E422-157-ESTABL                PIC 9(06) COMP.             467900      
005681    02 E422-157-CTE-SERVNUM           PIC 9(04) COMP.             468000      
005682    02 FILLER                         PIC X(24).                  468100      
005683*                                                                 468200      
005684*SIZE ENTRADA X(96).                                              468300      
005685*                                                                 468400      
005686  01 S422-157-CTR-SALIDA.                                         468500      
005687     02 S422-157-CTA-BANCO      PIC 9(04) COMP.                   468600      
005688     02 S422-157-CTA-SUC        PIC 9(04) COMP.                   468700      
005689     02 S422-157-CTE-NUMPROS    PIC 9(12) COMP.                   468800      
005690     02 S422-157-CTA-CUENTIP    PIC 9(02) COMP.                   468900      
005691     02 S422-157-CTA-CVEMONEDA  PIC 9(02) COMP.                   469000      
005692     02 S422-157-CTR-CODSWIFT   PIC X(12).                        469100      
005693     02 S422-157-CTR-CODABA     PIC X(10).                        469200      
005694     02 S422-157-CTR-GERCTA     PIC 9(02) COMP.                   469300      
005695     02 S422-157-CTE-CVEPERS    PIC 9(02) COMP.                   469400      
005696     02 S422-157-CTA-ALIAS      PIC X(20) .                       469500      
005697     02 S422-157-CTE-CVESECTOR  PIC 9(02) COMP.                   469600      
005698     02 S422-157-CTR-LIMAXUT    PIC 9(14) COMP.                   469700      
005699     02 S422-157-SER-PERIODLIM  PIC X(01) .                       469800      
005700     02 S422-157-CTR-NUMESTABL  PIC 9(06) COMP.                   469900      
005701     02 S422-157-CTR-FEALTA-2K  PIC 9(08) COMP.                   470000      
005702     02 S422-157-CTA-FULCON-2K  PIC 9(08) COMP.                   470100      
005703     02 S422-157-CTE-SERVNUM    PIC 9(04) COMP.                   470200      
005704     02 S422-157-CTR-HORALTA    PIC 9(08) COMP.                   470300      
005705**      Datos complementarios                                     470400      
005706     02 S422-157-CTE-NOM        PIC X(100) .                      470500      
005707     02 S422-157-CTE-EMAIL      PIC X(078) .                      470600      
005708     02 FILLER                  PIC X(06).                        470700      
005709************************************************************      470800      
005710**** PARAMETROS DEL ENTRY POINT S016_L422_TITXADICIO(159) **      470900      
005711**** CONSULTA DEL CLIENTE TITULAR POR MEDIO DE LA         **      471000      
005712****     TARJETA ADICIONAL                                **      471100      
005713************************************************************      471200      
005714  01  E422-159-CTR-ENTRADA.                                       471300      
005715     02 E422-159-MDA-NUMPREF         PIC 9(04) COMP.              471400      
005716     02 E422-159-MDA-NUM             PIC 9(12) COMP.              471500      
005717                                                                  471600      
005718* SIZE ENTRADA (16).*                                             471700      
005719 01  S422-159-CTR-SALIDA.                                         471800      
005720     03 S422-159-CTR-NUMCSI                PIC  9(002) COMP.      471900      
005721     03 S422-159-CTE-NUM                   PIC  9(012) COMP.      472000      
005722     03 S422-159-CTA-NUMPROD               PIC  9(004) COMP.      472100      
005723     03 S422-159-CTA-CVEINST               PIC  9(002) COMP.      472200      
005724     03 S422-159-CTA-NUMPREF               PIC  9(004) COMP.      472300      
005725     03 S422-159-CTA-NUM                   PIC  9(012) COMP.      472400      
005726     03 S422-159-MDA-CVETIPO               PIC  9(002) COMP.      472500      
005727     03 S422-159-MDA-SUBTIPO               PIC  9(002) COMP.      472600      
005728     03 S422-159-MDA-CVETIT                PIC  9(002) COMP.      472700      
005729     03 S422-159-MDA-NUMPREF               PIC  9(004) COMP.      472800      
005730     03 S422-159-MDA-NUM                   PIC  9(012) COMP.      472900      
005731     03 S422-159-MDA-ABRPROFT              PIC  X(003).           473000      
005732     03 S422-159-CTR-PTRNOMT               PIC  9(004) COMP.      473100      
005733     03 S422-159-MDA-ABRPROFC              PIC  X(003).           473200      
005734     03 S422-159-CTR-PTRNOMC               PIC  9(004) COMP.      473300      
005735     03 S422-159-MDA-NUMTALON              PIC  9(002) COMP.      473400      
005736     03 S422-159-MDA-CHQXTALON             PIC  9(002) COMP.      473500      
005737     03 S422-159-MDA-CVEPIN                PIC  9(006) COMP.      473600      
005738     03 S422-159-MDA-CVESTATUS             PIC  9(002) COMP.      473700      
005739     03 S422-159-MDA-FECALTA-2K            PIC  9(008) COMP.      473800      
005740     03 S422-159-MDA-FECULTMOD-2K          PIC  9(008) COMP.      473900      
005741     03 S422-159-MDA-FECULTACC-2K          PIC  9(008) COMP.      474000      
005742     03 S422-159-MDA-FECVENC-2K            PIC  9(008) COMP.      474100      
005743     03 S422-159-MDA-FECCANCEL-2K          PIC  9(008) COMP.      474200      
005744     03 S422-159-MDA-FECPREV               PIC  9(006) COMP.      474300      
005745     03 S422-159-MDA-FECMODPIN-2K          PIC  9(008) COMP.      474400      
005746     03 S422-159-MDA-HHPREV                PIC  9(004) COMP.      474500      
005747     03 S422-159-MDA-HHALTA                PIC  9(004) COMP.      474600      
005748     03 S422-159-MDA-HHULTMOD              PIC  9(004) COMP.      474700      
005749     03 S422-159-MDA-HHULTACC              PIC  9(004) COMP.      474800      
005750     03 S422-159-MDA-HHVENC                PIC  9(004) COMP.      474900      
005751     03 S422-159-MDA-PERIODO               PIC  9(002) COMP.      475000      
005752     03 S422-159-MDA-SITUACION             PIC  X(004).           475100      
005753     03 FILLER                             PIC  X(021).           475200      
005754* SIZE SALIDA X(108).                                             475300      
005755                                                                  475400      
005756 01 S422-159-CTR-SALERR REDEFINES S422-159-CTR-SALIDA.            475500      
005757     03 S422-159-CTR-ERROR                 PIC 9(004) COMP.       475600      
005758     03 S422-159-CTR-ERRORTYPE             PIC 9(004) COMP.       475700      
005759     03 S422-159-CTR-STRUCTURE             PIC 9(004) COMP.       475800      
005760     03 FILLER                             PIC 9(102) COMP.       475900      
005761                                                                  476000      
005762*                                                                 476100      
005763 77  S422-159-RCTR-SALERR                  PIC S9(11) BINARY.     476200      
005764*                                                                 476300      
005765***                                                               476400      
005766**************************************************************    476500      
005767****  ENTRY POINT S016_L422_B76CTATEL           (160)     ****    476600      
005768****  Consulta de la estructura B76                       ****    476700      
005769****     asociacion cuenta - celular                      ****    476800      
005770**************************************************************    476900      
005771                                                                  477000      
005772 01  E422-160-CTR-ENTRADA.                                        477100      
005773     03 E422-160-CTE-NUM         PIC 9(12) COMP.                  477200      
005774     03 E422-160-CTA-CLABE-TARJ  PIC 9(20) COMP.                  477300      
005775     03 E422-160-CLABE-R  REDEFINES E422-160-CTA-CLABE-TARJ.      477400      
005776        05 E422-160-CLABE        PIC 9(20) COMP.                  477500      
005777     03 E422-160-TAR-R    REDEFINES E422-160-CTA-CLABE-TARJ.      477600      
005778        05 E422-160-FILLER1      PIC 9(04) COMP.                  477700      
005779        05 E422-160-TAR          PIC 9(16) COMP.                  477800      
005780     03 E422-160-CHQS   REDEFINES E422-160-CTA-CLABE-TARJ.        477900      
005781        05 E422-160-FILLER2      PIC 9(04) COMP.                  478000      
005782        05 E422-160-CTA-NUMPREF  PIC 9(04) COMP.                  478100      
005783        05 E422-160-CTA-NUM      PIC 9(12) COMP.                  478200      
005784     03 E422-160-CTE-CELULAR     PIC 9(10) COMP.                  478300      
005785     03 E422-160-CTA-OPCION      PIC 9(02) COMP.                  478400      
005786     03 FILLER                   PIC X(24).                       478500      
005787                                                                  478600      
005788                                                                  478700      
005789* SIZE ENTRADA (16).*                                             478800      
005790                                                                  478900      
005791 01  S422-160-CTR-SALIDA.                                         479000      
005792     03 S422-160-CTE-NUM                   PIC  9(012) COMP.      479100      
005793     03 S422-160-CTA-NUMPROD               PIC  9(004) COMP.      479200      
005794     03 S422-160-CTA-CVEINST               PIC  9(002) COMP.      479300      
005795     03 S422-160-CTA-SUCU                  PIC  9(004) COMP.      479400      
005796     03 S422-160-CTA-NUMCTO                                .      479500      
005797        05 S422-160-CTA-NUMPREF            PIC  9(004) COMP.      479600      
005798        05 S422-160-CTA-NUM                PIC  9(012) COMP.      479700      
005799     03 S422-160-CTE-CELULAR               PIC  9(010) COMP.      479800      
005800     03 S422-160-CTA-EXTERNA               PIC  9(020) COMP.      479900      
005801     03 S422-160-CTE-CVECOMP               PIC  9(004) COMP.      480000      
005802     03 S422-160-CTA-TIPCTASOC             PIC  9(002) COMP.      480100      
005803     03 S422-160-CTA-CUENTIP               PIC  9(002) COMP.      480200      
005804     03 S422-160-CVE-STATUS                PIC  9(002) COMP.      480300      
005805     03 S422-160-CTR-FEALTA-2K             PIC  9(008) COMP.      480400      
005806     03 S422-160-CTR-FEULMO-2K             PIC  9(008) COMP.      480500      
005807     03 FILLER                             PIC  X(024)     .      480600      
005808                                                                  480700      
005809  77 R422-160-CTR-ERROR                    PIC S9(11) BINARY.     480800      
005810                                                                  480900      
005811                                                                  481000      
005812                                                                  481100      
005813                                                                  481200      
005814**                                                                481300      
005815******************************************************************481400      
005816******************************************************************481500      
005817***  PARAMETROS  S016_L422_TERCEROS_4     (161)                 **481600      
005818***  CONSULTA LAS CUENTAS DE TERCEROS,USANDO LA LLAVE QUE       **481700      
005819***  NO USA PRODUCTO - INSTRUMENTO                              **481800      
005820******************************************************************481900      
005821*                                                                 482000      
005822 77  R422-161-CTR-ERROR                   PIC S9(11) BINARY.      482100      
005823*                                                                 482200      
005824 01  E422-161-CTR-ENTRADA.                                        482300      
005825     03 E422-161-CTE-NUM                PIC 9(012) COMP.          482400      
005826     03 E422-161-CTA-NUMPROD            PIC 9(004) COMP.          482500      
005827     03 E422-161-CTA-CVEINST            PIC 9(002) COMP.          482600      
005828     03 E422-161-CTA-NUMPREF            PIC 9(004) COMP.          482700      
005829     03 E422-161-CTA-NUM                PIC 9(012) COMP.          482800      
005830     03 E422-161-SER-CVEUSOCTA          PIC 9(002) COMP.          482900      
005831     03 E422-161-CTA-3DIGITOS           PIC 9(004) COMP.          483000      
005832     03 E422-161-CTR-OPCION             PIC 9(002) COMP.          483100      
005833     03 FILLER                          PIC X(018).               483200      
005834* SIZE ENTRADA X(60)*                                             483300      
005835*                                                                 483400      
005836 01  S422-161-CTR-SALIDA.                                         483500      
005837     03 S422-161-CTR-NUMCSI         PIC 9(002) COMP.              483600      
005838     03 S422-161-CTE-NUM            PIC 9(012) COMP.              483700      
005839     03 S422-161-CTA-NUMPROD        PIC 9(004) COMP.              483800      
005840     03 S422-161-CTA-CVEINST        PIC 9(002) COMP.              483900      
005841     03 S422-161-CTA-NUMPREF        PIC 9(004) COMP.              484000      
005842     03 S422-161-CTA-NUM            PIC 9(012) COMP.              484100      
005843     03 S422-161-SER-LIMAXAUT       PIC 9(014) COMP.              484200      
005844     03 S422-161-SER-PERIODLIM      PIC X(001).                   484300      
005845     03 S422-161-CTA-CVEMONEDA      PIC 9(002) COMP.              484400      
005846     03 S422-161-SER-CVEUSOCTA      PIC 9(002) COMP.              484500      
005847     03 S422-161-CTR-FECALTTER      PIC 9(006) COMP.              484600      
005848     03 S422-161-CTR-FECMODTER      PIC 9(006) COMP.              484700      
005849     03 S422-161-SER-FECFINVIG      PIC 9(004) COMP.              484800      
005850     03 S422-161-CTA-3DIGITOS       PIC 9(004) COMP.              484900      
005851     03 S422-161-CTR-FEALTE-2K      PIC 9(008) COMP.              485000      
005852     03 S422-161-CTR-FEMOTE-2K      PIC 9(008) COMP.              485100      
005853     03 S422-161-SER-FEFIVI-2K      PIC 9(006) COMP.              485200      
005854     03 S422-161-CTR-FBAJA-2K       PIC 9(008) COMP.              485300      
005855     03 S422-161-CTA-FULCON-2K      PIC 9(008) COMP.              485400      
005856     03 S422-161-CTA-ALIAS          PIC X(020) .                  485500      
005857     03 S422-161-CTA-MEDALTA        PIC 9(004) COMP.              485600      
005858     03 S422-161-CTR-GERCTA         PIC 9(002) COMP.              485700      
005859     03 S422-161-CTR-HORALTA        PIC 9(008) COMP.              485800      
005860**                                                                485900      
005861  01  S422-161-RCTR-SALIDA REDEFINES S422-161-CTR-SALIDA.         486000      
005862     03 S422-161-CTR-ERROR                 PIC 9(004)    COMP.    486100      
005863     03 S422-161-CTR-ERRORTYPE             PIC 9(004)    COMP.    486200      
005864     03 S422-161-CTR-STRUCTURE             PIC 9(004)    COMP.    486300      
005865     03 FILLER                             PIC X(078).            486400      
005866                                                                  486500      
005867**                                                                486600      
005868******************************************************************486700      
005869** PARAMETROS          S016_L422_CONS_INTER_4 (162)             **486800      
005870** CONSULTA DE ORDENES DE PAGO Y DE CUENTAS INTERBANCARIAS      **486900      
005871**                                                              **487000      
005872**                                                              **487100      
005873******************************************************************487200      
005874*                                                                 487300      
005875 77 R422-162-CTR-ERROR                PIC S9(11) BINARY.          487400      
005876*                                                                 487500      
005877 01 E422-162-CTR-ENTRADA.                                         487600      
005878    02 E422-162-CTE-NUM               PIC 9(12) COMP.             487700      
005879    02 E422-162-CTA-CLABE-TARJ            PIC 9(20) COMP.         487800      
005880    02 E422-162-CTA-CLAVE-TARJ-R      REDEFINES                   487900      
005881                                      E422-162-CTA-CLABE-TARJ.    488000      
005882       03 E422-162-CTA-CLABE          PIC 9(04) COMP.             488100      
005883       03 E422-162-CTA-NUMPREF        PIC 9(04) COMP.             488200      
005884       03 E422-162-CTA-NUM            PIC 9(12) COMP.             488300      
005885    02 E422-162-CTE-NOMBENEF          PIC X(55).                  488400      
005886    02 E422-162-CTA-OPCION            PIC 9(02) COMP.             488500      
005887    02 E422-162-TIPO-CTA              PIC 9(02) COMP.             488600      
005888    02 E422-162-ESTABL                PIC 9(06) COMP.             488700      
005889    02 E422-162-CTE-SERVNUM           PIC 9(04) COMP.             488800      
005890    02 FILLER                         PIC X(24).                  488900      
005891*                                                                 489000      
005892*SIZE ENTRADA X(96).                                              489100      
005893*                                                                 489200      
005894  01 S422-162-CTR-SALIDA.                                         489300      
005895     02 S422-162-CTA-BANCO      PIC 9(04) COMP.                   489400      
005896     02 S422-162-CTA-SUC        PIC 9(04) COMP.                   489500      
005897     02 S422-162-CTE-NUMPROS    PIC 9(12) COMP.                   489600      
005898     02 S422-162-CTA-CUENTIP    PIC 9(02) COMP.                   489700      
005899     02 S422-162-CTA-CVEMONEDA  PIC 9(02) COMP.                   489800      
005900     02 S422-162-CTR-CODSWIFT   PIC X(12).                        489900      
005901     02 S422-162-CTR-CODABA     PIC X(10).                        490000      
005902     02 S422-162-CTR-GERCTA     PIC 9(02) COMP.                   490100      
005903     02 S422-162-CTE-CVEPERS    PIC 9(02) COMP.                   490200      
005904     02 S422-162-CTA-ALIAS      PIC X(20) .                       490300      
005905     02 S422-162-CTE-CVESECTOR  PIC 9(02) COMP.                   490400      
005906     02 S422-162-CTR-LIMAXUT    PIC 9(14) COMP.                   490500      
005907     02 S422-162-SER-PERIODLIM  PIC X(01) .                       490600      
005908     02 S422-162-CTR-NUMESTABL  PIC 9(06) COMP.                   490700      
005909     02 S422-162-CTR-FEALTA-2K  PIC 9(08) COMP.                   490800      
005910     02 S422-162-CTA-FULCON-2K  PIC 9(08) COMP.                   490900      
005911     02 S422-162-CTE-SERVNUM    PIC 9(04) COMP.                   491000      
005912     02 S422-162-CTR-HORALTA    PIC 9(08) COMP.                   491100      
005913**      Datos complementarios                                     491200      
005914     02 S422-162-CTE-NOM        PIC X(100) .                      491300      
005915     02 S422-162-CTE-EMAIL      PIC X(078) .                      491400      
005916     02 FILLER                  PIC X(06).                        491500      
005917                                                                  491600      
005918                                                                  491700      
005919**************************************************************    491800      
005920**         ENTRY POINT S016_L422_B77PORTAB        (163)     **    491900      
005921**             CONSULTA DE LA ESTRUCTURA B77                      492000      
005922**                                                          **    492100      
005923**************************************************************    492200      
005924**                                                                492300      
005925 77 R422-163-CTR-ERROR          PIC S9(11) BINARY.                492400      
005926**                                                                492500      
005927***PARAMETROS DE ENTRADA.                                         492600      
005928*************************                                         492700      
005929 01 E422-163-CTR-ENTRADA.                                         492800      
005930    03 E422-163-MDA-PREF        PIC 9(004) COMP.                  492900      
005931    03 E422-163-MDA-NUM         PIC 9(012) COMP.                  493000      
005932    03 E422-163-CTR-OPCION      PIC 9(002) COMP.                  493100      
005933**                                                                493200      
005934***PARAMETROS DE SALIDA.                                          493300      
005935************************                                          493400      
005936**                                                                493500      
005937 01 S422-163-CTR-SALIDA.                                          493600      
005938    03 S422-163-CTE-NUM         PIC 9(012) COMP.                  493700      
005939    03 S422-163-MDA-NUMCTO.                                       493800      
005940       05 S422-163-MDA-NUMPREF  PIC 9(004) COMP.                  493900      
005941       05 S422-163-MDA-NUM      PIC 9(012) COMP.                  494000      
005942    03 S422-163-MDA-TIP         PIC 9(002) COMP.                  494100      
005943*ZUMA-KCT-PORTV-180417-B                                          494200      
005944    03 S422-163-CTA-BANCO       PIC 9(005) COMP.                  494300      
005945*ZUMA-KCT-PORTV-180417-E                                          494400      
005946    03 S422-163-CTA-CLABE-TAR   PIC 9(020) COMP.                  494500      
005947    03 S422-163-CTR-SOEID       PIC X(010).                       494600      
005948    03 S422-163-CTR-FOLIO       PIC 9(015) COMP.                  494700      
005949    03 S422-163-CTR-FECALTA     PIC 9(008) COMP.                  494800      
005950    03 S422-163-CTR-FPROALTA    PIC 9(008) COMP.                  494900      
005951    03 S422-163-CTR-FECULTMOD   PIC 9(008) COMP.                  495000      
005952    03 S422-163-CTR-VACIO       PIC 9(008) COMP.                  495100      
005953**                                                                495200      
005954 01 S422-163-CTR-SAL-RED REDEFINES S422-163-CTR-SALIDA.           495300      
005955    03 S422-163-CTR-ERROR       PIC 9(04) COMP.                   495400      
005956    03 S422-163-CTR-ERRORTYPE   PIC 9(04) COMP.                   495500      
005957    03 S422-163-CTR-STRUCTURE   PIC 9(04) COMP.                   495600      
005958    03 FILLER                   PIC X(99).                        495700      
005959                                                                  495800      
005960                                                                  495900      
005961**************************************************************    496000      
005962**** PARAMETROS DEL ENTRY POINT S016_L422_ORDENA_EMAIL(164) **    496100      
005963**** CONSULTA DE EMAILS DEL CLIENTE                         **    496200      
005964**************************************************************    496300      
005965  01  E422-164-CTR-ENTRADA.                                       496400      
005966     02 E422-164-CTE-NUM             PIC 9(12) COMP.              496500      
005967                                                                  496600      
005968* SIZE ENTRADA (16).*                                             496700      
005969 01  S422-164-CTR-SALIDA.                                         496800      
005970     03 S422-164-OCCURS        OCCURS 10 TIMES.                   496900      
005971        05 S422-164-NUMCSI                    PIC 9(002) COMP.    497000      
005972        05 S422-164-CTE-NUM                   PIC 9(012) COMP.    497100      
005973        05 S422-164-TIPODE                    PIC 9(002) COMP.    497200      
005974        05 S422-164-NUMDOME                   PIC 9(004) COMP.    497300      
005975        05 S422-164-CVE-USO                   PIC 9(004) COMP.    497400      
005976        05 S422-164-CVEPROV                   PIC 9(004) COMP.    497500      
005977        05 S422-164-DOMELEC                   PIC X(078).         497600      
005978        05 S422-164-FEC-ALTA                  PIC 9(008) COMP.    497700      
005979        05 S422-164-FEC-ULTMOD                PIC 9(008) COMP.    497800      
005980*                                                                 497900      
005981*77  S422-164-RCTR-SALERR                  PIC S9(11) BINARY.     498000      
005982 77  R422-164-CTR-ERROR                    PIC S9(11) BINARY.     498100      
005983                                                                  498200      
005984*                                                                 498300      
005985                                                                  498400      
005986***************************************************************   498500      
005987**** PARAMETROS DEL ENTRY POINT S016_L422_CONS_CTESXTEL(165) **   498600      
005988**** CONSULTA DE CLIENTES POR TELEFONO                       **   498700      
005989***************************************************************   498800      
005990  01  E422-165-CTR-ENTRADA.                                       498900      
005991     02 E422-165-NUMTEL                 PIC 9(10) COMP.           499000      
005992     02 E422-165-OPCION                 PIC 9(02) COMP.           499100      
005993*            01 = CONSULTA DE LOS PRIMEROS   10 CLIENTES          499200      
005994*            02 = CONSULTA DE LOS SIGUIENTES 10 CLIENTES          499300      
005995     02 E422-165-CTE-NUM-KEY            PIC 9(12) COMP.           499400      
005996*            SE USA PARA LA OPCION 2, ES EL NUMERO DE CLIENTE     499500      
005997*            CON EL QUE DEBE DE CONTINUAR LA CONSULTA             499600      
005998                                                                  499700      
005999* SIZE ENTRADA (16).*                                             499800      
006000 01  S422-165-CTR-SALIDA.                                         499900      
006001     03 S422-165-OCCURS        OCCURS 10 TIMES.                   500000      
006002        05 S422-165-CTE-NUM             PIC 9(012) COMP.          500100      
006003        05 S422-165-CTE-NOM             PIC X(055).               500200      
006004        05 S422-165-RFC-INIC            PIC X(004).               500300      
006005        05 S422-165-RFC-FECHA           PIC 9(006) COMP.          500400      
006006        05 S422-165-RFC-HOMO            PIC X(005).               500500      
006007        05 S422-165-CVETIPO             PIC 9(002) COMP.          500600      
006008        05 S422-165-CTE-CALLENUM        PIC X(036).               500700      
006009        05 S422-165-CTE-NOMCOL          PIC X(024).               500800      
006010        05 S422-165-CTE-NOMPOB          PIC X(020).               500900      
006011        05 S422-165-CTE-CVEEDO          PIC 9(002) COMP.          501000      
006012        05 S422-165-CTE-NUMCP           PIC 9(006) COMP.          501100      
006013        05 S422-165-CTR-CVESTADOM       PIC 9(002) COMP.          501200      
006014        05 S422-165-CTR-CVEDOM          PIC 9(002) COMP.          501300      
006015     03 S422-165-RESULT                 PIC 9(004) COMP.          501400      
006016*            0 = NO HAY MAS TELEFONOS                             501500      
006017*            1 = SI HAY MAS TELEFONOS                             501600      
006018*            2 = NO EXISTE ESTE TELEFONO EN LA B65                501700      
006019     03 S422-165-CTE-NUM-CONT           PIC 9(012) COMP.          501800      
006020*            SE USA PARA EL RESULT 1, ES EL NUMERO DE CLIENTE     501900      
006021*            CON EL QUE DEBE DE CONTINUAR LA SIG. CONSULTA        502000      
006022                                                                  502100      
006023*77  S422-165-RCTR-SALERR               PIC S9(11) BINARY.        502200      
006024 77  R422-165-CTR-ERROR                 PIC S9(11) BINARY.        502300      
006025                                                                  502400      
006026*                                                                 502500      
006027                                                                  502600      
006028******************************************************************502700      
006029**                                                              **502800      
006030** FD DE PARAMETROS DEL ENTRYPOINT S016_L422_CTASINCORP2 (166)  **502900      
006031**    - CUENTAS INCORPORADAS                                    **503000      
006032**                                            ILA/ZUMA FEB-2016 **503100      
006033**                                                              **503200      
006034**                                                              **503300      
006035** se a¨adieron 2 campos a la salida, CTA-FECANC y MDA-FECANC   **503400      
006036******************************************************************503500      
006037*                                                                 503600      
006038*                         Long = 60 (hex) =  30 (ebcdic)          503700      
006039 01 E422-166-CTR-ENT.                                             503800      
006040    02 E422-166-LIB-OPC                PIC 9(02) COMP.            503900      
006041    02 E422-166-CTE-NUM                PIC 9(12) COMP.            504000      
006042    02 E422-166-CTA-PROD               PIC 9(04) COMP.            504100      
006043    02 E422-166-CTA-INST               PIC 9(02) COMP.            504200      
006044    02 E422-166-CTA-PREF               PIC 9(04) COMP.            504300      
006045    02 E422-166-CTA-NUM                PIC 9(12) COMP.            504400      
006046    02 E422-166-NUM-OCR                PIC 9(02) COMP.            504500      
006047    02 E422-166-MDA-NUMCTO                           .            504600      
006048       04 E422-166-MDA-NUMPREF         PIC 9(04) COMP.            504700      
006049       04 E422-166-MDA-NUM             PIC 9(12) COMP.            504800      
006050    02 E422-166-FILLER                 PIC X(06)     .            504900      
006051*                                                                 505000      
006052 01 S422-166-CTR-SAL.                                             505100      
006053    02 S422-166-CSI-NUM                PIC 9(02) COMP.            505200      
006054    02 S422-166-CTE-NUM                PIC 9(12) COMP.            505300      
006055    02 S422-166-CTE-STATUS             PIC 9(02) COMP.            505400      
006056    02 S422-166-CTE-TIPPER             PIC 9(02) COMP.            505500      
006057    02 S422-166-CTE-CLASIF             PIC 9(02) COMP.            505600      
006058    02 S422-166-NUM-OCR                PIC 9(02) COMP.            505700      
006059    02 S422-166-HAY-MAS                PIC 9(02) COMP.            505800      
006060    02 S422-166-TABLA                  OCCURS 20 TIMES.           505900      
006061       03 S422-166-CTO-PROD            PIC 9(04) COMP.            506000      
006062       03 S422-166-CTO-INST            PIC 9(02) COMP.            506100      
006063       03 S422-166-CTA-PREF            PIC 9(04) COMP.            506200      
006064       03 S422-166-CTA-NUM             PIC 9(12) COMP.            506300      
006065       03 S422-166-CTA-STATUS          PIC 9(02) COMP.            506400      
006066       03 S422-166-CTA-SUCURS          PIC 9(04) COMP.            506500      
006067       03 S422-166-CTO-MONEDA          PIC 9(02) COMP.            506600      
006068       03 S422-166-CTA-MANEJO          PIC 9(02) COMP.            506700      
006069       03 S422-166-CTE-CVEENV          PIC 9(04) COMP.            506800      
006070       03 S422-166-CTE-FECALT          PIC 9(08) COMP.            506900      
006071       03 S422-166-CTE-FECMOD          PIC 9(08) COMP.            507000      
006072       03 S422-166-CTO-RELCTE          PIC 9(02) COMP.            507100      
006073       03 S422-166-CTO-USOBEL          PIC 9(02) COMP.            507200      
006074       03 S422-166-CTO-CVEASO          PIC 9(02) COMP.            507300      
006075       03 S422-166-CTA-3DIGIT          PIC 9(04) COMP.            507400      
006076       03 S422-166-CTA-TIPCTA          PIC 9(02) COMP.            507500      
006077       03 S422-166-CTA-SUBTIP          PIC 9(02) COMP.            507600      
006078       03 S422-166-CTA-CVETIT          PIC 9(02) COMP.            507700      
006079       03 S422-166-CTO-NUMCTA          PIC 9(16) COMP.            507800      
006080       03 S422-166-CTO-MDASTA          PIC 9(02) COMP.            507900      
006081       03 S422-166-CTA-PROFTI          PIC X(03).                 508000      
006082       03 S422-166-CTA-NOMTIT          PIC 9(04) COMP.            508100      
006083       03 S422-166-CTA-PROFCO          PIC X(03).                 508200      
006084       03 S422-166-CTA-NOMCOT          PIC 9(04) COMP.            508300      
006085       03 S422-166-CTA-PRESEN          PIC 9(02) COMP.            508400      
006086       03 S422-166-CTA-FECALT          PIC 9(08) COMP.            508500      
006087       03 S422-166-CTA-FECMOD          PIC 9(08) COMP.            508600      
006088                                                                  508700      
006089  77  R422-166-CTR-ERROR               PIC S9(11) BINARY.         508800      
006090 01 S422-166-CTR-SAL2.                                            508900      
006091    02 S422-166-TABLA2                  OCCURS 20 TIMES.          509000      
006092       03 S422-166-CTA-FECANC          PIC 9(08) COMP.            509100      
006093       03 S422-166-MDA-FECANC          PIC 9(08) COMP.            509200      
006094*-> FIN ILA/ZUMA FEB-2016                                         509300      
006095*-> INICIO MHM/ZUMA JUNIO-2016                                    509400      
006096********************************************************          509500      
006097**** PARAMETROS DEL ENTRY POINT S016_L422_PORTABNOM               509600      
006098********************************************************          509700      
006099 01 E422-167-CTR-ENTRADA.                                         509800      
006100    02 E42-167-OPCION                   PIC 9(02) COMP.           509900      
006101*    01 =  CONSULTA POR NUMERO DE CLIENTE                         510000      
006102*    02 =  PAGINACION DE LA OPCION 1                              510100      
006103*    03 =  CONSULTA POR NUMERO DE TARJETA O CHEQUERA              510200      
006104*    04 =  PAGINACION OPCION 3                                    510300      
006105*    05 =  CONSULTA POR NUMERO DE CLIENTE Y NUMERO DE TARJETA     510400      
006106    02 E422-167-CTE-NUM                 PIC 9(12) COMP.           510500      
006107    02 E422-167-MDA-NUMCTO.                                       510600      
006108       04 E422-167-MDA-NUMPREF          PIC 9(04) COMP.           510700      
006109       04 E422-167-MDA-NUM              PIC 9(12) COMP.           510800      
006110                                                                  510900      
006111 01 S422-167-CTR-SAL.                                             511000      
006112    02  S422-167-NUM-CTE                PIC 9(12) COMP.           511100      
006113    02  S422-167-CONTINUACION           PIC 9(02) COMP.           511200      
006114*        01 = SI HAY MAS REGISTROS                                511300      
006115*        00 = NO HAY MAS REGISTROS                                511400      
006116    02 S422-167-OCCURS                  OCCURS 03 TIMES.          511500      
006117       04  S422-167-MDA-NUMPREF         PIC 9(04) COMP.           511600      
006118       04  S422-167-MDA-NUM             PIC 9(12) COMP.           511700      
006119       04  S422-167-MDA-TIP             PIC 9(02) COMP.           511800      
006120       04  S422-167-CTA-BANCO           PIC 9(04) COMP.           511900      
006121       04  S422-167-CLABE-TAR           PIC 9(20) COMP.           512000      
006122       04  S422-167-CTR-SOEID           PIC X(10).                512100      
006123       04  S422-167-CTR-FOLIO.                                    512200      
006124          06 S422-167-CTR-FOLIOK        PIC 9(15) COMP.           512300      
006125          06 S422-167-CTR-CERO          PIC 9(01) COMP.           512400      
006126       04  S422-167-CTR-FECALTA         PIC 9(08) COMP.           512500      
006127       04  S422-167-CTR-FPROALTA        PIC 9(08) COMP.           512600      
006128       04  S422-167-CTR-FECULTMOD       PIC 9(08) COMP.           512700      
006129       04  S422-167-CTR-VACIO           PIC 9(08) COMP.           512800      
006130 77  R422-167-CTR-ERROR                 PIC S9(11) BINARY.        512900      
006131*->FIN MHM/ZUMA JUNIO-2016                                        513000      
006132                                                                  513100      
006133*********************************************************         513200      
006134**     PARAMETROS  S016_L422_CON_XMEDIO_DIG14  (168)   **         513300      
006135**     CONSULTA B08MEDIOS                              **         513400      
006136*********************************************************         513500      
006137                                                                  513600      
006138  77 R422-168-CTR-ERROR                    PIC S9(11) BINARY.     513700      
006139                                                                  513800      
006140  01 E422-168-CTR-ENTRADA.                                        513900      
006141     03 E422-168-MDA-NUMERO                PIC 9(016) COMP.       514000      
006142     03 E422-168-MDA-RED     REDEFINES     E422-168-MDA-NUMERO.   514100      
006143        05 E422-168-MDA-NUMPREF            PIC 9(004) COMP.       514200      
006144        05 E422-168-MDA-NUM                PIC 9(012) COMP.       514300      
006145     03 FILLER                             PIC X(052).            514400      
006146* SIZE ENTRADA (60).*                                             514500      
006147  01 S422-168-CTR-SALIDA.                                         514600      
006148     03 S422-168-CTR-NUMCSI                PIC  9(002) COMP.      514700      
006149     03 S422-168-CTE-NUM                   PIC  9(012) COMP.      514800      
006150     03 S422-168-CTA-NUMPROD               PIC  9(004) COMP.      514900      
006151     03 S422-168-CTA-CVEINST               PIC  9(002) COMP.      515000      
006152     03 S422-168-CTA-NUMPREF               PIC  9(004) COMP.      515100      
006153     03 S422-168-CTA-NUM                   PIC  9(012) COMP.      515200      
006154     03 S422-168-MDA-CVETIPO               PIC  9(002) COMP.      515300      
006155     03 S422-168-MDA-SUBTIPO               PIC  9(002) COMP.      515400      
006156     03 S422-168-MDA-CVETIT                PIC  9(002) COMP.      515500      
006157     03 S422-168-MDA-NUMPREF               PIC  9(004) COMP.      515600      
006158     03 S422-168-MDA-NUM                   PIC  9(012) COMP.      515700      
006159     03 S422-168-MDA-ABRPROFT              PIC  X(003).           515800      
006160     03 S422-168-CTR-PTRNOMT               PIC  9(004) COMP.      515900      
006161     03 S422-168-MDA-ABRPROFC              PIC  X(003).           516000      
006162     03 S422-168-CTR-PTRNOMC               PIC  9(004) COMP.      516100      
006163     03 S422-168-MDA-NUMTALON              PIC  9(002) COMP.      516200      
006164     03 S422-168-MDA-CHQXTALON             PIC  9(002) COMP.      516300      
006165     03 S422-168-MDA-CVEPIN                PIC  9(006) COMP.      516400      
006166     03 S422-168-MDA-CVESTATUS             PIC  9(002) COMP.      516500      
006167     03 S422-168-MDA-FECALTA-2K            PIC  9(008) COMP.      516600      
006168     03 S422-168-MDA-FECULTMOD-2K          PIC  9(008) COMP.      516700      
006169     03 S422-168-MDA-FECULTACC-2K          PIC  9(008) COMP.      516800      
006170     03 S422-168-MDA-FECVENC-2K            PIC  9(008) COMP.      516900      
006171     03 S422-168-MDA-FECCANCEL-2K          PIC  9(008) COMP.      517000      
006172     03 S422-168-MDA-FECPREV               PIC  9(006) COMP.      517100      
006173     03 S422-168-MDA-FECMODPIN-2K          PIC  9(008) COMP.      517200      
006174     03 S422-168-MDA-HHPREV                PIC  9(004) COMP.      517300      
006175     03 S422-168-MDA-HHALTA                PIC  9(004) COMP.      517400      
006176     03 S422-168-MDA-HHULTMOD              PIC  9(004) COMP.      517500      
006177     03 S422-168-MDA-HHULTACC              PIC  9(004) COMP.      517600      
006178     03 S422-168-MDA-HHVENC                PIC  9(004) COMP.      517700      
006179     03 S422-168-MDA-PERIODO               PIC  9(002) COMP.      517800      
006180     03 S422-168-MDA-SITUACION             PIC  X(004).           517900      
006181     03 FILLER                             PIC  X(021).           518000      
006182* SIZE SALIDA X(108).                                             518100      
006183*                                                                 518200      
006184 01 S422-168-RCTR-SALIDA REDEFINES S422-168-CTR-SALIDA.           518300      
006185*                                                                 518400      
006186    03 S422-168-CTR-ERROR                 PIC 9(004) COMP.        518500      
006187    03 S422-168-CTR-ERRORTYPE             PIC 9(004) COMP.        518600      
006188    03 S422-168-CTR-STRUCTURE             PIC 9(004) COMP.        518700      
006189    03 FILLER                             PIC 9(102) COMP.        518800      
006190                                                                  518900      
006191                                                                  519000      
006192                                                                  519100      
006193                                                                  519200      
006194*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
006195                                                                  034100      
006196 77 W77-NUM-CTE                        PIC 9(12) COMP.            034200      
006197******************************************************************034300      
006198*             PARAMETROS PARA LIBRERIA CLTVERS                   *034400      
006199******************************************************************034500      
006200*                                                                 034600      
006201 01  WKS-CTLVER-NUMREG                 PIC 9(02).                 034700      
006202 01  WKS-CTLVER-LIBID                  PIC X(12).                 034800      
006203 01  WKS-CTLVER-NOMLIB                 PIC X(72).                 034900      
006204 77  W77-CTLVER-RSLT                   PIC S9(11) BINARY.         035000      
006205*                                                                 035100      
006206******************************************************************035200      
006207*     LIBRERIA DEL S408 QUE PROPORCIONA LINEA DE CREDITO         *035300      
006208******************************************************************035400      
006209 01 WKS-FTO-LLAMADO-S408.                                         035500      
006210    02 WKS-FUN-S408                       PIC 9(02).              035600      
006211    02 WKS-FEC-S408                       PIC 9(08).              035700      
006212    02 WKS-CTO-S408                       PIC 9(12).              035800      
006213    02 WKS-RESPUESTA-S408.                                        035900      
006214       04 WKS-SDO-S408                    PIC 9(14)V99.           036000      
006215       04 WKS-S408-RESULT                 PIC 9(02).              036100      
006216                                                                  036200      
006217 01 WKS-CONTRATO-S408.                                            036300      
006218    03 WKS-SUC-S408                       PIC 9(04).              036400      
006219    03 WKS-CONT-S408                      PIC 9(12).              036500      
006220******************************************************************036600      
006221*              VARIABLES PARA EL MANEJO DE CORTES                *036700      
006222******************************************************************036800      
006223 77  I                                 PIC 9(4)   COMP.           036900      
006224 77  J                                 PIC 9(4)   COMP.           037000      
006225 77  K                                 PIC 9(4)   COMP.           037100      
006226 77  L                                 PIC 9(4)   COMP.           037200      
006227 77  W77-SIS-ENT                       PIC 9(4)   COMP.           037300      
006228 77  M                                 PIC 9(4)   COMP.           037400      
006229 77  X                                 PIC 9(4)   COMP.           037500      
006230 77  Y                                 PIC 9(4)   COMP.           037600      
006231 77  Z                                 PIC 9(4)   COMP.           037700      
006232                                                                  037800      
006233 77  W77-IND                           PIC 9(02).                 037900      
006234 77  W77-SDOACT                        PIC 9.                     038000      
006235     88 W88-SDOACT                     VALUE 1.                   038100      
006236 77  W77-SDOACT-TEMP                   PIC S9(16)V99.             038200      
006237 77  W77-S408-OK                       PIC 9.                     038300      
006238     88 W88-S408-OK                    VALUE 1.                   038400      
006239******************************************************************038500      
006240*         VARIABLES PARA EL MANEJO DE DATOS CITI                 *038600      
006241******************************************************************038700      
006242 01 WKS-NUM-CTA-CITI.                                             038800      
006243    03 WKS-NUMPREF                    PIC 9(04).                  038900      
006244    03 WKS-CUENTA                     PIC 9(07).                  039000      
006245                                                                  039100      
006246 01 WKS-NUM-CUENTA-T                  PIC 9(11).                  039200      
006247 01 WKS-NUM-CUENTA-T-R REDEFINES WKS-NUM-CUENTA-T.                039300      
006248    03 WKS-FILLER-1                   PIC 9(02).                  039400      
006249    03 WKS-2D-NUMPREF                 PIC 9(02).                  039500      
006250    03 WKS-4D-CTA                     PIC 9(04).                  039600      
006251    03 WKS-FILLER-2                   PIC 9(03).                  039700      
006252                                                                  039800      
006253 01 WKS-BASE-NUMBER.                                              039900      
006254    03 WKS-BN-FILLER1                 PIC 9(01) VALUE 0.          040000      
006255    03 WKS-BN-2DNUMPREF               PIC 9(02).                  040100      
006256    03 WKS-BN-4DCTA                   PIC 9(04).                  040200      
006257    03 WKS-BN-FILLER2                 PIC 9(04) VALUE 0000.       040300      
006258                                                                  040400      
006259  01 WKS-NUM-CUENTA-T2                 PIC 9(11).                 040500      
006260  01 WKS-NUM-CUENTA-T2-R REDEFINES WKS-NUM-CUENTA-T2.             040600      
006261     03 WKS-1DIG-CTA                   PIC 9(01).                 040700      
006262     03 WKS-DIG-MUEVE                  PIC 9(01).                 040800      
006263     03 WKS-6DIG-CTA                   PIC 9(06).                 040900      
006264     03 WKS-3DIG-CTA                   PIC 9(03).                 041000      
006265                                                                  041100      
006266 01 WKS-CTA-FTOINT.                                               041200      
006267    03 WKS-1DIG-CTAFTOI               PIC 9(01).                  041300      
006268    03 WKS-6DIG-CTAFTOI               PIC 9(06).                  041400      
006269    03 WKS-7DIG-CTAFTOI               PIC 9(01).                  041500      
006270    03 WKS-3DIG-CTAFTOI               PIC 9(03).                  041600      
006271                                                                  041700      
006272  01 WKS-LIABILITI-NUMBER.                                        041800      
006273     03 WKS-LI-FILLER1                 PIC 9(01) VALUE 0.         041900      
006274     03 WKS-LIABILIT                   PIC 9(06).                 042000      
006275     03 WKS-LI-FILLER2                 PIC 9(04) VALUE 0000.      042100      
006276                                                                  042200      
006277******************************************************************042300      
006278*        VARIABLES PARA ALMACENAR LAS FECHAS Y TIEMPOS           *042400      
006279******************************************************************042500      
006280                                                                  042600      
006281 01  FECHAS.                                                      042700      
006282     02  WKS-FECHA-ACTUAL-AMD.                                    042800      
006283         03  WKS-AMO-ACTUAL-AMD        PIC 9(4).                  042900      
006284         03  WKS-MES-ACTUAL-AMD        PIC 9(2).                  043000      
006285         03  WKS-DIA-ACTUAL-AMD        PIC 9(2).                  043100      
006286     02  WKS-FECHA-PROCESO-DMA         PIC 9(08).                 043200      
006287                                                                  043300      
006288     02  WKS-FECHA-ACTUAL-DMA REDEFINES WKS-FECHA-PROCESO-DMA.    043400      
006289         03  WKS-DIA-ACTUAL-DMA        PIC 9(2).                  043500      
006290         03  WKS-MES-ACTUAL-DMA        PIC 9(2).                  043600      
006291         03  WKS-AMO-ACTUAL-DMA        PIC 9(4).                  043700      
006292     02  WKS-FECHA-TEMP.                                          043800      
006293         03  WKS-DIA-TEMP-DMA          PIC 9(2).                  043900      
006294         03  WKS-MES-TEMP-DMA          PIC 9(2).                  044000      
006295         03  WKS-AMO-TEMP-DMA          PIC 9(4).                  044100      
006296     02  WKS-FECHA-ACTUAL-MDA.                                    044200      
006297         03  WKS-MES-ACTUAL-MDA        PIC 9(2).                  044300      
006298         03  WKS-DIA-ACTUAL-MDA        PIC 9(2).                  044400      
006299         03  WKS-AMO-ACTUAL-MDA        PIC 9(4).                  044500      
006300                                                                  044600      
006301     02  WKS-FECCONT                   PIC 9(08).                 044700      
006302     02  WKS-FECCONT-R  REDEFINES   WKS-FECCONT.                  044800      
006303         03  WKS-FC-AA                  PIC 9(04).                044900      
006304         03  WKS-FC-MM                  PIC 9(02).                045000      
006305         03  WKS-FC-DD                  PIC 9(02).                045100      
006306                                                                  045200      
006307     02  WKS-FORMATO-FECHA.                                       045300      
006308         03  WKS-FORM-DD                PIC 9(02).                045400      
006309         03  FILLER                     PIC X(01) VALUE "/".      045500      
006310         03  WKS-FORM-MM                PIC X(03).                045600      
006311         03  FILLER                     PIC X(01) VALUE "/".      045700      
006312         03  WKS-FORM-AA                PIC 9(04).                045800      
006313*                                                                 045900      
006314 01  WKS-HORA-OPERACION                 PIC 9(6) COMP.            046000      
006315                                                                  046100      
006316 01  WKS-HORA-OPERACION-R  REDEFINES WKS-HORA-OPERACION.          046200      
006317     02  WKS-HH-OP                      PIC 9(2) COMP.            046300      
006318     02  WKS-MM-OP                      PIC 9(2) COMP.            046400      
006319     02  WKS-SS-OP                      PIC 9(2) COMP.            046500      
006320*                                                                 046600      
006321 01  WKS-HORA-HS-R.                                               046700      
006322     02  WKS-HORA-HH                    PIC 9(2) COMP.            046800      
006323     02  WKS-HORA-MM                    PIC 9(2) COMP.            046900      
006324     02  FILLER                        PIC 9(4) COMP.             047000      
006325*                                                                 047100      
006326 01  WKS-HORA-HS-RR REDEFINES WKS-HORA-HS-R.                      047200      
006327     02  WKS-HR-HH                     PIC 9(2) COMP.             047300      
006328     02  WKS-HR-MM                     PIC 9(2) COMP.             047320      
006329     02  WKS-HR-SS                     PIC 9(2) COMP.             047340      
006330     02  FILLER                        PIC 9(2) COMP.             047400      
006331*                                                                 047500      
006332 01  WKS-HORA-HSS-R REDEFINES WKS-HORA-HS-R.                      047600      
006333     02  WKS-HORA-HSS-HH               PIC 9(2) COMP.             047700      
006334     02  WKS-HORA-HSS-MM               PIC 9(2) COMP.             047800      
006335     02  WKS-HORA-HSS-SS               PIC 9(2) COMP.             047900      
006336     02  FILLER                        PIC 9(2) COMP.             048000      
006337 01  WKS-HORA-HS    REDEFINES WKS-HORA-HS-R   PIC 9(8) COMP.      048100      
006338                                                                  048200      
006339 77  W77-FECULT-ACT                    PIC 9(07).                 048300      
006340******************************************************************048400      
006341*                   CONTADORES DE HOJAS                          *048500      
006342******************************************************************048600      
006343                                                                  048700      
006344 01  CONTADORES.                                                  048800      
006345     02  WKS-NUM-HOJAS-SUC             PIC 9(3) COMP VALUE 0.     048900      
006346     02  WKS-TOTAL-HOJAS               PIC 9(4) COMP VALUE 0.     049000      
006347     02  WKS-NUM-LINEAS                PIC 9(2) COMP VALUE 0.     049100      
006348/                                                                 049200      
006349******************************************************************049300      
006350*               VARIABLES PARA LA LOCAL SUPPORT                  *049400      
006351******************************************************************049500      
006352                                                                  049600      
006353 01  WKS-CODIGO-ESTRUCT                PIC 9(6).                  049700      
006354 01  WKS-CODIGO-ESTRUCT-R  REDEFINES WKS-CODIGO-ESTRUCT.          049800      
006355     03  WKS-LLAVE-ESTRUCT             PIC 9(4).                  049900      
006356     03  WKS-CLAVE-ESTRUCT             PIC 9(2).                  050000      
006357                                                                  050100      
006358 01  WKS-RESPUESTA-ESTRUCT.                                       050200      
006359     03  WKS-RESULTADO-ESTRUCT         PIC 9(1).                  050300      
006360     03  WKS-NOMBRE-SUC-ESTRUCT        PIC X(40).                 050400      
006361     03  FILLER                        PIC X(40).                 050500      
006362                                                                  050600      
006363 01  WKS-CSI-RESP-ESTRUCT.                                        050700      
006364     03  WKS-RESULT-CSI-ESTRUCT        PIC 9(1).                  050800      
006365     03  WKS-CSI-ESTRUCT               PIC 9(2).                  050900      
006366     03  FILLER                        PIC X(78).                 051000      
006367                                                                  051100      
006368 77  W77-FUNCION                       PIC S9(11) BINARY.         051200      
006369 77  W77-FORMATO                       PIC S9(11) BINARY.         051300      
006370                                                                  051400      
006371 01  WKS-FECHA1                        PIC X(08).                 051500      
006372 01  WKS-FECHA1-RED   REDEFINES WKS-FECHA1.                       051600      
006373     05  WKS-AMO1-RED                  PIC 9(04).                 051700      
006374     05  WKS-MES1-RED                  PIC 9(02).                 051800      
006375     05  WKS-DIA1-RED                  PIC 9(02).                 051900      
006376*                                                                 052000      
006377 01  WKS-FECHA2                        PIC X(08).                 052100      
006378 01  WKS-FECHA2-RED   REDEFINES WKS-FECHA2.                       052200      
006379     05  WKS-AMO2-RED                  PIC 9(04).                 052300      
006380     05  WKS-MES2-RED                  PIC 9(02).                 052400      
006381     05  WKS-DIA2-RED                  PIC 9(02).                 052500      
006382*                                                                 052600      
006383 01  WKS-DATOS-HOST.                                              052700      
006384     03  WKS-NUMCSI                    PIC 9(02).                 052800      
006385     03  WKS-NOMEQUIPO                 PIC X(10).                 052900      
006386     03  WKS-NOMCSI                    PIC X(26).                 053000      
006387     03  WKS-LINEABATCH                PIC X(05).                 053100      
006388*                                                                 053200      
006389 01  WKS-DATOS-CTL WITH LOWER-BOUNDS.                             053300      
006390     03  WKS-CTL-FUNCION               PIC 9(02).                 053400      
006391     03  WKS-CTL-SISTEMA               PIC 9(04).                 053500      
006392     03  WKS-CTL-NUMCSI                PIC 9(02).                 053600      
006393     03  WKS-CTL-FECPROC               PIC 9(08).                 053700      
006394     03  WKS-CTL-FECCONT               PIC 9(08).                 053800      
006395     03  WKS-CTL-FECS151               PIC 9(08).                 053900      
006396     03  WKS-CTL-STAREG                PIC 9(02).                 054000      
006397     03  WKS-CTL-NOMSDO                PIC X(34).                 054100      
006398     03  WKS-CTL-PKSDO                 PIC X(17).                 054200      
006399     03  WKS-CTL-NOMMOV                PIC X(34).                 054300      
006400     03  WKS-CTL-PKMOV                 PIC X(17).                 054400      
006401     03  WKS-CTL-NOMDES                PIC X(34).                 054500      
006402     03  WKS-CTL-PKDES                 PIC X(17).                 054600      
006403     03  WKS-CTL-NOMERR                PIC X(34).                 054700      
006404     03  WKS-CTL-PKERR                 PIC X(17).                 054800      
006405     03  WKS-CTL-NOMBD                 PIC X(17).                 054900      
006406     03  WKS-CTL-STABD                 PIC 9(02).                 055000      
006407     03  WKS-CTL-NUMARC                PIC 9(02).                 055100      
006408     03  WKS-CTL-3ERNIV                PIC 9(02).                 055200      
006409     03  WKS-CTL-OCC-FECHAS      OCCURS 10 TIMES.                 055300      
006410         05  WKS-CTL-FECARCH           PIC 9(08).                 055400      
006411         05  WKS-CTL-NIVARCH           PIC 9(08).                 055500      
006412         05  WKS-CTL-NIVBDM            PIC 9(08).                 055600      
006413         05  WKS-CTL-STAARCH           PIC 9(02).                 055700      
006414*                                                                 055800      
006415******************************************************************055900      
006416*            NOMBRE DEL WFL PARA EJECUCION DEL P940              *056000      
006417*            PARA ENVIO DE ARCHIVOS A CITIBANK.                  *056100      
006418******************************************************************056200      
006419                                                                  056300      
006420  01 WKS-TIT-WFL.                                                 056400      
006421     02 FILLER                   PIC X(06) VALUE "START ".        056500      
006422     02 WKS-START-PROG           PIC X(36).                       056600      
006423     02 FILLER                   PIC X(02) VALUE " (".            056700      
006424     02 FILLER                   PIC X(01) VALUE QUOTES.          056800      
006425     02 FILLER                   PIC X(01) VALUE "S".             056900      
006426     02 WKS-START-SIS            PIC 9(03).                       057000      
006427     02 WKS-START-CCI            PIC X(01).                       057100      
006428     02 WKS-START-ARCH           PIC X(03).                       057200      
006429     02 FILLER                   PIC X(01) VALUE QUOTES.          057300      
006430     02 FILLER                   PIC X(01) VALUE ",".             057400      
006431     02 FILLER                   PIC X(01) VALUE QUOTES.          057500      
006432     02 WKS-START-FEC            PIC 9(08).                       057600      
006433     02 FILLER                   PIC X(01) VALUE QUOTES.          057700      
006434     02 FILLER                   PIC X(01) VALUE ",".             057800      
006435     02 FILLER                   PIC X(01) VALUE QUOTES.          057900      
006436     02 WKS-START-CSI            PIC 9(02).                       058000      
006437     02 FILLER                   PIC X(01) VALUE QUOTES.          058100      
006438     02 FILLER                   PIC X(01) VALUE ")".             058200      
006439/                                                                 058300      
006440 01  WKS-COPY-L030.                                               058308      
006441    03 FILLER                 PIC X(06) VALUE "START ".           058316      
006442    03 WKS-N-WFL              PIC X(37).                          058324      
006443    03 FILLER                 PIC X(01) VALUE "(".                058332      
006444    03 FILLER                 PIC X(01) VALUE QUOTES.             058340      
006445    03 FILLER                 PIC X(20) VALUE                     058348      
006446                                      "CORRESOLO P102 S151 ".     058356      
006447    03 WKS-ARCHIVO            PIC X(34) VALUE SPACES.             058364      
006448    03 FILLER                 PIC X(12) VALUE " CMEMP CMEMP".     058372      
006449    03 FILLER                 PIC X(01) VALUE QUOTES.             058380      
006450    03 FILLER                 PIC X(01) VALUE ")".                058388      
006451******************************************************************058400      
006452*       DEFINICION DE TABLA PARA SISTEMAS QUE SE PROCESAN        *058500      
006453******************************************************************058600      
006454*                                                                 058700      
006455 01 SISTEMAS.                                                     058800      
006456     02  FILLER     PIC X(16) VALUE "001CHEQUES      ".           058900      
006457     02  FILLER     PIC X(16) VALUE "500CTA. MAESTRA ".           059000      
006458     02  FILLER     PIC X(16) VALUE "500AHORROS      ".           059100      
006459     02  FILLER     PIC X(16) VALUE "084FONDOS       ".           059200      
006460     02  FILLER     PIC X(16) VALUE "408LIN.SOBREGIRO".           059300      
006461     02  FILLER     PIC X(16) VALUE "999NO CALIFICADO".           059400      
006462 01 TABLA-SISTEMAS REDEFINES SISTEMAS.                            059500      
006463     02  TAB-SISTEMA         OCCURS    6 TIMES.                   059600      
006464         03  NUM-SISTEMA               PIC X(03).                 059700      
006465         03  SISTEMA                   PIC X(13).                 059800      
006466*                                                                 059900      
006467 01  CSI.                                                         060000      
006468     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  1   ".   060100      
006469     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  2   ".   060200      
006470     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  3   ".   060300      
006471     02  FILLER       PIC X(25) VA "MONM O N T E R R E Y     ".   060400      
006472     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  5   ".   060500      
006473     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  6   ".   060600      
006474     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  7   ".   060700      
006475     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  8   ".   060800      
006476     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  9   ".   060900      
006477     02  FILLER       PIC X(25) VA "VDMV A L L E  DE  M E X .".   061000      
006478                                                                  061100      
006479 01  TABLA-CSI REDEFINES CSI.                                     061200      
006480     02  TAB-CSI OCCURS 10 TIMES.                                 061300      
006481         03  WKS-NOMB-CSI              PIC X(03).                 061400      
006482                                                                  061500      
006483 77 W77-I                              PIC 9(02).                 061600      
006484 77 W77-FECHA-PROC                     PIC 9(08).                 061800      
006485 77 W77-VALUE                          PIC 9(08) VALUE 0.         061900      
006486 77 W77-STATUS                         PIC 9(04).                 062000      
006487 77 W77-NUMREG-001                     PIC 9(08) COMP.            062100      
006488 77 W77-NUMREG-066                     PIC 9(08) COMP.            062200      
006489 77 W77-SDOACT-001                     PIC S9(15)V99 COMP.        062300      
006490 77 W77-SDOACT-066                     PIC S9(15)V99 COMP.        062400      
006491 77 W77-NUMCTO-001                     PIC 9(08) COMP.            062500      
006492 77 W77-NUMCTO-066                     PIC 9(08) COMP.            062600      
006493 77 W77-FINLOG                         PIC 9(02).                 062700      
006494    88 W88-FINLOG                      VALUE 1.                   062800      
006495 77 W77-FILEOK                         PIC 9(02).                 062900      
006496    88 W88-FILEOK                      VALUE 1.                   063000      
006497 01 WKS-PARAMETRO.                                                063100      
006498    03 WKS-PARAM-SECUENCIA             PIC 9(02).                 063120      
006499    03 W77-SIST-PARAM                  PIC 9(03).                 063140      
006500 01 WKS-PARAMETRO-R REDEFINES WKS-PARAMETRO.                      063150      
006501    03 WKS-PARAM-SISTEMA               PIC 9(03).                 063160      
006502    03 FILLER                          PIC X(02).                 063170      
006503 01  WKS-TABLA-ESTRUCTURA.                                        063200      
006504     03  WKS-TBL-ESTRUCTURA  OCCURS  5000 TIMES.                  063300      
006505         05  WKS-TAB-NOD-SUB           PIC 9(04) COMP.            063400      
006506         05  WKS-TAB-NOD-SUB-R REDEFINES WKS-TAB-NOD-SUB.         063500      
006507             07  WKS-TAB-NODO          PIC 9(02) COMP.            063600      
006508             07  WKS-TAB-SUBNODO       PIC 9(02) COMP.            063700      
006509                                                                  063800      
006510 01  WKS-NOM-ACC.                                                 063815      
006511     02 FILLER                     PIC X(06).                     063830      
006512     02 WKS-NOMBREACC              PIC X(34).                     063845      
006513     02 FILLER                     PIC X(16).                     063860      
006514                                                                  063875      
006515 01  WKS-COMPILA                       PIC 9(11) BINARY.          063900      
006516                                                                  064000      
006517 01  WKS-FECAPLI                       PIC 9(08).                 064100      
006518 01  WKS-FECAPLI-R REDEFINES WKS-FECAPLI.                         064200      
006519     03  WKS-AA-FECAPLI                PIC 9(04).                 064300      
006520     03  WKS-MM-FECAPLI                PIC 9(02).                 064400      
006521     03  WKS-DD-FECAPLI                PIC 9(02).                 064500      
006522                                                                  064520      
006523 77 W77-TIPO-OPCION                    PIC 9(02).                 064550      
006524 01 WKS-ERR-CTA                        PIC X(16).                 064555      
006525 01 WKS-ERR-CTE                        PIC X(12).                 064560      
006526 01 WKS-ERR-PRD                        PIC X(04).                 064565      
006527 01 WKS-ERR-INS                        PIC X(04).                 064570      
006528 01 WKS-ERR-CALL                       PIC 9(04).                 064575      
006529                                                                  064585      
006530 01 WKS-ENV-CTD                        PIC 9(04).                 064595      
006531                                                                  064600      
006532******************************************************************064700      
006533                                                                  064800      
006534*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
006535*    COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".        064900      
006536**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
006537  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
006538  01 MENSAJE-LJ.                                                  100300      
006539     02 SISTEMA-LJ     PIC X(04).                                 100400      
006540     02 FILLER         PIC X VALUE "/".                           100500      
006541     02 PASO-LJ        PIC X(04).                                 100600      
006542     02 FILLER         PIC X VALUE "/".                           100700      
006543     02 MTP-LJ         PIC 9(03).                                 100800      
006544     02 FILLER         PIC X VALUE ":".                           100900      
006545     02 TIPO-LJ        PIC X.                                     101000      
006546     02 FILLER         PIC X VALUE ">".                           101100      
006547     02 CODIGO-LJ      PIC 9(06).                                 101200      
006548     02 FILLER         PIC X VALUE "<".                           101300      
006549     02 TEXTO-LJ       PIC X(250).                                101400      
006550*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
006551*                                                                 065000      
006552 01  WKS-TEXTO.                                                   065100      
006553     02  FILLER    PIC X(20) VALUE "INICIO DE PROCESO : ".        065200      
006554     02  FEC-TEX   PIC X(08).                                     065300      
006555                                                                  065400      
006556*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
006557*    COPY "(S151)S151/FORMATO/DISPLAY ON CMEMP".                  065500      
006558                                                                  000100      
006559*===============================================================* 000200      
006560*         FORMATO PARA DISPLAYS                                 * 000300      
006561*===============================================================* 000400      
006562                                                                  000500      
006563 01 WKS-TIT-REPORTE2.                                             000600      
006564    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
006565    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
006566    02 FILLER                       PIC X(06) VALUE               000900      
006567                                              "/LIST/".           001000      
006568    02 WKS-PASO-BACK2               PIC X(04).                    001051      
006569    02 FILLER                       PIC X(01) VALUE "/".          001071      
006570    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
006571    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
006572    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
006573    02 FILLER                       PIC X(1)  VALUE "/".          001400      
006574    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
006575    02 FILLER                       PIC X(11) VALUE               001600      
006576                                              "/001MSGIMP.".      001700      
006577                                                                  002100      
006578 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
006579                                                                  002300      
006580***********************************************************       002400      
006581*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
006582***********************************************************       002600      
006583 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
006584*8D                                                               002800      
006585 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
006586 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
006587    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
006588    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
006589    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
006590*8D                                                               003400      
006591 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
006592 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
006593    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
006594    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
006595    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
006596                                                                  004100      
006597 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
006598                                                                  004300      
006599 01 WKS-FECHA-HORA2.                                              004400      
006600    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
006601    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
006602       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
006603       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
006604    02 WKS-TIME-MAQ2.                                             004600      
006605       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
006606       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
006607          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
006608          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
006609          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
006610       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
006611    02 FILLER                             PIC X(01).              004900      
006612    02 WKS-RESTO2                         PIC X(04).              005000      
006613                                                                  005100      
006614*8D                                                               005200      
006615****************** REPORTE DE MENSAJES *********************      005300      
006616 01 WLI-ENCAB-12.                                                 005400      
006617    03 FILLER                             PIC X(05) VALUE         005500      
006618       "S151-".                                                   005600      
006619    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
006620    03 FILLER                             PIC X(15) VALUE         005671      
006621       "-001IMPMENSAJES".                                         005691      
006622    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
006623    03 FILLER                             PIC X(34) VALUE         005800      
006624       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
006625    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
006626    03 FILLER                             PIC X(26) VALUE         006100      
006627       "FECHA DE LA INFORMACION : ".                              006200      
006628    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
006629    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
006630       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
006631       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
006632       05  WKS-SLASH1                         PIC X(01).          006356      
006633       05  WLI-RB-E1-MES                  PIC 99.                 006357      
006634       05  WKS-SLASH2                         PIC X(01).          006358      
006635       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
006636 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
006637 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
006638    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
006639    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
006640    03 FILLER                          PIC X(01).                 006371      
006641    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
006642    03 FILLER                          PIC X(01).                 006381      
006643    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
006644*8D                                                               006400      
006645 01 WLI-ENCAB-22.                                                 006500      
006646     03 FILLER                          PIC X(11) VALUE           006600      
006647        "F.PROCESO: ".                                            006700      
006648     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
006649     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
006650     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
006651     03 FILLER                          PIC X(01) VALUE ":".      007020      
006652     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
006653     03 FILLER                          PIC X(01) VALUE ":".      007060      
006654     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
006655     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
006656     03 FILLER                          PIC X(24) VALUE           007200      
006657              "IMPRESION MENSAJES DEL S".                         007300      
006658     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
006659     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
006660     03 FILLER                          PIC X(14) VALUE           007600      
006661        "TIPO PROCESO: ".                                         007700      
006662     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
006663*8D                                                               007900      
006664 01 WLI-ENCAB-32.                                                 008000      
006665     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
006666*       "VERSION  : ".                                            008200      
006667*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
006668     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
006669     03 FILLER                     PIC X(07) VALUE                008500      
006670        "HOJA : ".                                                008600      
006671     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
006672                                                                  008800      
006673 01 WLI-ENCAB-42.                                                 008900      
006674     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
006675     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
006676     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
006677                                                                  009300      
006678 01 WLI-ENCAB-52.                                                 009400      
006679    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
006680    03 WLI-TIPO-LJ                PIC X(02).                      009600      
006681    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
006682    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
006683                                                                  009900      
006684*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
006685 01 WLI-ENCAB-62.                                                 009910      
006686    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
006687    03 WLI-RESULT                 PIC X(04).                      009920      
006688    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
006689    03 WLI-TEXTO                  PIC X(110).                     009930      
006690                                                                  009935      
006691 01 WLI-TOT-ENVIO.                                                009940      
006692    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
006693    03 FILLER                     PIC X(37) VALUE                 009950      
006694       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
006695    03 WLI-ENV-CTD                PIC X(04).                      009960      
006696*FIN - INFOWARE                                                   009970      
006697****************************************************************  010000      
006698*                 CONTADORES DE HOJAS                          *  010100      
006699****************************************************************  010200      
006700                                                                  010300      
006701  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
006702*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
006703                                                                  065600      
006704******************************************************************065700      
006705*              P R O C E D U R E     D I V I S I O N             *065800      
006706******************************************************************065900      
006707                                                                  066000      
006708 PROCEDURE DIVISION USING WKS-PARAMETRO.                          066100      
006709 CHECA-DIA-HABIL SECTION.                                         066200      
006710 000-000-CHECA-DIA.                                               066300      
006711     MOVE WKS-PARAM-SECUENCIA       TO WLI-SECUENCIA              066380      
006712                                                                  066400      
006713     IF WLI-SECUENCIA > 0                                         066420      
006714        COMPUTE WLI-SECUENCIA = WLI-SECUENCIA - 1.                066440      
006715                                                                  066460      
006716     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   066500      
006717        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          066600      
006718     CHANGE ATTRIBUTE LIBACCESS OF "SOPORTECOMS" TO BYFUNCTION.   066700      
006719     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            066800      
006720                                      "SOPORTECOMS".              066900      
006721     CHANGE ATTRIBUTE LIBACCESS OF "CTLVER" TO BYFUNCTION.        067000      
006722     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO                 067100      
006723                                      "CTLVERS".                  067200      
006724     MOVE 0                        TO W77-CTLVER-RSLT.            067300      
006725     MOVE "S151L001CTL"            TO WKS-CTLVER-LIBID.           067400      
006726     CALL "DAME_TIT IN CTLVER" USING  WKS-CTLVER-LIBID            067500      
006727                                      WKS-CTLVER-NOMLIB           067600      
006728                               GIVING W77-CTLVER-RSLT.            067700      
006729     IF W77-CTLVER-RSLT = 0                                       067800      
006730        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                067900      
006731                                  WKS-CTLVER-NOMLIB               068000      
006732     ELSE                                                         068100      
006733        MOVE 020101 TO CODIGO-LJ                                  068200      
006734        MOVE "ERROR EN CTLVERS, NO ENCONTRO ID DE LIB-CONTROL "   068300      
006735                    TO TEXTO-LJ                                   068400      
006736        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ        068500      
006737        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                068600      
006738            "(S151)S151/OBJECT/L001/CONTROL          ON CMEMP.".  068700      
006739                                                                  068800      
006740*VERSION DEL WFL/LOTE*                                            068805      
006741     MOVE 0                                TO W77-CTLVER-RSLT.    068810      
006742     MOVE "S151LOTE"                       TO WKS-CTLVER-LIBID    068815      
006743     CALL "DAME_TIT IN CTLVER"                                    068820      
006744          USING  WKS-CTLVER-LIBID                                 068825      
006745                 WKS-CTLVER-NOMLIB                                068830      
006746          GIVING W77-CTLVER-RSLT.                                 068835      
006747                                                                  068840      
006748     IF W77-CTLVER-RSLT < 0                                       068845      
006749        MOVE "ERROR AL OBTENER NOMBRE S151LOTE"                   068850      
006750                                           TO TEXTO-LJ            068855      
006751        MOVE "O"                           TO TIPO-LJ             068860      
006752        MOVE 020901                        TO CODIGO-LJ           068865      
006753        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       068870      
006754        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                   068875      
006755     ELSE                                                         068880      
006756        MOVE WKS-CTLVER-NOMLIB TO WKS-N-WFL.                      068885      
006757*                                                                 068890      
006758     MOVE "S151" TO SISTEMA-LJ                                    068900      
006759     MOVE "P167" TO PASO-LJ                                       069000      
006760     MOVE "001"  TO MTP-LJ                                        069100      
006761     MOVE "I"    TO TIPO-LJ                                       069200      
006762     MOVE 020101 TO CODIGO-LJ                                     069300      
006763     MOVE WKS-TEXTO TO TEXTO-LJ                                   069400      
006764                                                                  069500      
006765     PERFORM 000-005-CHECA-LIBCONTROL.                            069600      
006766     MOVE "I"    TO TIPO-LJ                                       069700      
006767     MOVE 020101 TO CODIGO-LJ                                     069800      
006768     MOVE W77-FECHA-PROC TO FEC-TEX.                              069900      
006769     MOVE WKS-TEXTO TO TEXTO-LJ, WLI-TEXTO-LJ.                    070000      
006770     MOVE TIPO-LJ         TO      WLI-TIPO-LJ                     070100      
006771     PERFORM 000-030-IMPRIME-MENSAJE                              070200      
006772**   CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ.         070300      
006773                                                                  070400      
006774          PERFORM 000-010-INICIO.                                 070500      
006775*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
006776*      COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY ON CMEMP"       070600      
006777*           FROM 3051 TO 4800.                                    070700      
006778 000-050-CHECA-SALTO-HOJA2.                                       003051      
006779*==========================                                       003071      
006780    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
006781     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
006782        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
006783     ELSE                                                         003079      
006784        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
006785     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
006786     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
006787     MOVE "/"                     TO WKS-SLASH1.                  003086      
006788     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
006789     MOVE "/"                     TO WKS-SLASH2.                  003088      
006790     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
006791     IF  WKS-NUM-LINEAS2 > 56                                     003091      
006792         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
006793         ADD 1                   TO    W77-CONT-HOJA2             003200      
006794         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
006795         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
006796         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
006797         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
006798         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
006799         MOVE SPACES             TO V00-R00-REPORTE2              003800      
006800         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
006801         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
006802                                                                  004100      
006803 000-030-IMPRIME-MENSAJE.                                         004200      
006804*========================                                         004300      
006805*LP                                                               004400      
006806     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
006807     ADD             2       TO WKS-NUM-LINEAS2                   004600      
006808     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
006809                                                                  004800      
006810*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
006811                                                                  070800      
006812  000-005-CHECA-LIBCONTROL.                                       070900      
006813*==========================                                       071000      
006814                                                                  071100      
006815     SET R01-CIFRAS(USERBACKUPNAME)     TO VALUE TRUE.            071200      
006816     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-VALUE.             071300      
006817     CALL "CSIID IN SOPORTECOMS" USING WKS-DATOS-HOST.            071400      
006818     MOVE W77-SIST-PARAM    TO WKS-CTL-SISTEMA WLI-SIST-CIFRAS.   071500      
006819     MOVE WKS-NUMCSI        TO WKS-CTL-NUMCSI WLI-CSI-CIFRAS,     071600      
006820                               WKS-CSI-MONITOR.                   071700      
006821     MOVE 1                 TO WKS-CTL-FUNCION.                   071800      
006822     CALL "CONSISDIA IN LIB-CONTROL" USING WKS-DATOS-CTL          071900      
006823                                    GIVING W77-STATUS.            072000      
006824                                                                  072100      
006825     MOVE W77-SIST-PARAM          TO  WKS-SIS-BACK2               072200      
006826                                      WLI-RB-E3-SISTEMA2.         072300      
006827     MOVE "P167"                  TO  WKS-PASO-BACK2              072400      
006828                                      WLI-RB-E1-PASO.             072500      
006829     MOVE "DIARIO"                TO  WLI-RB-E2-TIPO-PROC2.       072600      
006830     MOVE WKS-NUMCSI              TO  WKS-TR-CSI2.                072700      
006831     MOVE WKS-CTL-FECPROC         TO  WLI-RB-E1-FECHA-INF2.       072800      
006832                                                                  072900      
006833*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
006834*     COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY ON CMEMP"        073000      
006835*          FROM 100 TO 3000.                                      073100      
006836                                                                  000100      
006837*===============================================================* 000200      
006838*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
006839*         PARA LLAMADO DE DISPLAY                               * 000400      
006840*===============================================================* 000500      
006841                                                                  000600      
006842     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
006843            TO BYFUNCTION.                                        000671      
006844                                                                  000691      
006845     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
006846          USING WKS-DATE-ARRAY2.                                  000800      
006847     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
006848     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
006849     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
006850     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
006851     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
006852     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
006853                                                                  001300      
006854     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
006855     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
006856     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
006857                               WKS-TIT-REPORTE2.                  001700      
006858*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
006859*                                  GIVING WKS-COMPILA2.           001900      
006860*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
006861*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
006862*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
006863*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
006864                                                                  002066      
006865*    IF WKS-AAA-VERSION2  < 50                                    002071      
006866*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
006867*    ELSE                                                         002081      
006868*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
006869                                                                  002091      
006870                                                                  002500      
006871*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
006872     OPEN OUTPUT V00-REPORTE2.                                    002700      
006873     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
006874     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
006875                                                                  003000      
006876*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
006877                                                                  073200      
006878     IF W77-STATUS > 0                                            073300      
006879        MOVE "E"            TO      TIPO-LJ                       073400      
006880        MOVE 010105         TO      CODIGO-LJ                     073500      
006881        MOVE SPACES         TO      TEXTO-LJ                      073600      
006882        STRING "ERROR AL CONSULTAR LIB-CONTROL : ",               073700      
006883                         W77-STATUS                               073800      
006884               DELIMITED BY SIZE INTO TEXTO-LJ                    073900      
006885        MOVE TIPO-LJ         TO      WLI-TIPO-LJ                  074000      
006886        MOVE TEXTO-LJ        TO      WLI-TEXTO-LJ                 074100      
006887        PERFORM 000-030-IMPRIME-MENSAJE                           074200      
006888        CLOSE V00-REPORTE2 WITH SAVE                              074300      
006889**      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ        074400      
006890        SET MYSELF(STATUS)  TO  -1.                               074500      
006891     IF W77-VALUE = 0                                             074600      
006892        MOVE WKS-CTL-FECPROC   TO W77-FECHA-PROC                  074700      
006893     ELSE                                                         074800      
006894        MOVE W77-VALUE         TO W77-FECHA-PROC.                 074900      
006895                                                                  075000      
006896     MOVE W77-FECHA-PROC  TO      WKS-HD-FEC-MON,                 075100      
006897                                  WKS-FEC-MONITOR.                075200      
006898                                                                  075300      
006899 000-010-INICIO.                                                  075400      
006900*===============                                                  075500      
006901                                                                  075600      
006902     PERFORM 100-010-INICIALIZA-FECHAS.                           075700      
006903     PERFORM 100-020-INICIALIZA-HEADER.                           075800      
006904                                                                  075900      
006905     MOVE 0                        TO W77-CTLVER-RSLT.            076000      
006906     MOVE "S016L422"               TO WKS-CTLVER-LIBID.           076100      
006907     CALL "DAME_TIT IN CTLVER" USING  WKS-CTLVER-LIBID            076200      
006908                                      WKS-CTLVER-NOMLIB           076300      
006909                               GIVING W77-CTLVER-RSLT.            076400      
006910     IF W77-CTLVER-RSLT = 0                                       076500      
006911        CHANGE ATTRIBUTE TITLE OF "S016L422" TO                   076600      
006912                                  WKS-CTLVER-NOMLIB               076700      
006913     ELSE                                                         076800      
006914        MOVE 020101 TO CODIGO-LJ                                  076900      
006915        MOVE "ERROR EN CTLVERS, NO ENCONTRO ID DE S016L422 "      077000      
006916                    TO TEXTO-LJ                                   077100      
006917        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ        077200      
006918        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                077300      
006919            "(S016)S016/OBJECT/L422         ON CLIENTES.".        077400      
006920                                                                  077500      
006921     MOVE 0                        TO W77-CTLVER-RSLT.            077600      
006922     MOVE "S408L020"               TO WKS-CTLVER-LIBID.           077700      
006923     CALL "DAME_TIT IN CTLVER" USING  WKS-CTLVER-LIBID            077800      
006924                                      WKS-CTLVER-NOMLIB           077900      
006925                               GIVING W77-CTLVER-RSLT.            078000      
006926     IF W77-CTLVER-RSLT = 0                                       078100      
006927        CHANGE ATTRIBUTE TITLE OF "CONL020" TO                    078200      
006928                                  WKS-CTLVER-NOMLIB               078300      
006929     ELSE                                                         078400      
006930        MOVE 020101 TO CODIGO-LJ                                  078500      
006931        MOVE "ERROR EN CTLVERS, NO ENCONTRO ID DE S408L020 "      078600      
006932                    TO TEXTO-LJ                                   078700      
006933        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ        078800      
006934        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                078900      
006935            "(S408)S408/OBJECT/L020         ON CREDITO.".         079000      
006936     IF WKS-PARAM-SECUENCIA = 1                                   079100      
006937        OPEN OUTPUT A04-SDOSCBII-T.                               079120      
006938                                                                  079140      
006939     PERFORM 100-005-EXTRAE-REGISTROS-SDOS.                       079200      
006940                                                                  079220      
006941     IF WKS-PARAM-SECUENCIA = 1                                   079240      
006942        CLOSE A04-SDOSCBII-T WITH SAVE.                           079260      
006943                                                                  079280      
006944     MOVE 0 TO W77-S408-OK.                                       079300      
006945     IF WKS-PARAM-SECUENCIA = 1                                   079350      
006946        PERFORM 300-COMPLETA-SDOS.                                079400      
006947                                                                  079420      
006948     PERFORM 000-080-IMPRIME-TRAILER.                             079440      
006949     MOVE "I"    TO TIPO-LJ                                       079500      
006950     MOVE 020101 TO CODIGO-LJ                                     079600      
006951     MOVE  "FIN NORMAL DE PROCESO" TO TEXTO-LJ, WLI-TEXTO-LJ      079700      
006952     MOVE TIPO-LJ         TO      WLI-TIPO-LJ                     079800      
006953     PERFORM 000-030-IMPRIME-MENSAJE                              079900      
006954     CLOSE V00-REPORTE2 WITH SAVE                                 080000      
006955**   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         080100      
006956     STOP RUN.                                                    080200      
006957/                                                                 080300      
006958 100-010-INICIALIZA-FECHAS.                                       080400      
006959*==========================                                       080500      
006960                                                                  080600      
006961     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          080700      
006962             A2K-ACCEPT-TODAYS-DATE-EXIT.                         080800      
006963     MOVE A2K-FEC-MDCA-001 TO WKS-FECHA-ACTUAL-MDA                080900      
006964     MOVE WKS-DIA-ACTUAL-MDA      TO WKS-DIA-ACTUAL-DMA           081000      
006965                                     WKS-DIA-ACTUAL-AMD           081100      
006966     MOVE WKS-MES-ACTUAL-MDA      TO WKS-MES-ACTUAL-DMA           081200      
006967                                     WKS-MES-ACTUAL-AMD           081300      
006968     MOVE WKS-AMO-ACTUAL-MDA      TO WKS-AMO-ACTUAL-DMA           081400      
006969                                     WKS-AMO-ACTUAL-AMD           081500      
006970     MOVE WKS-FECHA-PROCESO-DMA   TO WLI-FECEJEC-ENC.             081600      
006971     MOVE W77-FECHA-PROC          TO WKS-FECHA-ACTUAL-AMD.        081700      
006972     MOVE WKS-DIA-ACTUAL-AMD      TO WKS-DIA-ACTUAL-DMA.          081800      
006973     MOVE WKS-MES-ACTUAL-AMD      TO WKS-MES-ACTUAL-DMA.          081900      
006974     MOVE WKS-AMO-ACTUAL-AMD      TO WKS-AMO-ACTUAL-DMA.          082000      
006975     MOVE WKS-FECHA-PROCESO-DMA   TO WLI-FECPROC-ENC.             082100      
006976                                                                  082200      
006977     ACCEPT   WKS-HORA-HS         FROM TIME                       082300      
006978     MOVE     WKS-HR-HH           TO WLI-HHEJEC-ENC.              082400      
006979     MOVE     WKS-HR-MM           TO WLI-MMEJEC-ENC.              082420      
006980     MOVE     WKS-HR-SS           TO WLI-SSEJEC-ENC.              082440      
006981     MOVE ATTRIBUTE STACKNO       OF MYSELF TO WLI-NUMMIX-CIFRAS. 082500      
006982                                                                  082600      
006983 100-020-INICIALIZA-HEADER.                                       082700      
006984*==========================                                       082800      
006985                                                                  082900      
006986     MOVE WKS-NUMCSI          TO WKS-CSI-ORIG WKS-CSI-DEST,       083000      
006987                                 WKS-CSI-ORIGCBII,                083100      
006988                                 WKS-CSI-ORIGCBII-T.              083200      
006989     MOVE SPACES              TO A02-R00-HEADER.                  083300      
006990     MOVE 0                   TO A02-R00-TIPO-REG.                083400      
006991     MOVE 0500                TO A02-R00-HDR-SISTEMA.             083500      
006992     MOVE 0001                TO A02-R00-HDR-PRODUCTO.            083600      
006993$SET OMIT = OLDCODE                                               083700      
006994     MOVE W77-FECHA-PROC      TO WKS-HS-FECHA WKS-FEC-SDOSAL      083800      
006995          WKS-FEC-SDOSALCBII WKS-FEC-SDOENT WLI-FECHA-CIFRAS      083900      
006996          WKS-FEC-SDOSALCBII-T.                                   084000      
006997$POP OMIT                                                         084100      
006998$SET OMIT = NOT OLDCODE                                           084200      
006999     MOVE ZEROES TO A2K-FEC-CAMD-001                              084300      
007000     MOVE W77-FECHA-PROC  TO A2K-FEC-CAMD-001                     084400      
007001     PERFORM A2K-CONV-CAMD-TO-AMD THRU                            084500      
007002             A2K-CONV-CAMD-TO-AMD-EXIT                            084600      
007003     MOVE A2K-FEC-AMD-001     TO A02-R00-HDR-FECHA WKS-FEC-SDOSAL 084700      
007004               WKS-FEC-SDOSALCBII WKS-FEC-SDOENT WLI-FECHA-CIFRAS 084800      
007005               WKS-FEC-SDOSALCBII-T.                              084900      
007006$POP OMIT                                                         085000      
007007*TERMINA CODIGO DE RENOVACION CRONOS 2000                         085100      
007008     MOVE 001                 TO WKS-SIS-SDOSAL.                  085200      
007009     IF WKS-PARAM-SECUENCIA = 2                                   085250      
007010        OPEN OUTPUT A02-SDOSAL1                                   085300      
007011        WRITE R02-SDOSAL1   FROM A02-R00-SALDOS.                  085500      
007012     MOVE 0066                TO A02-R00-HDR-PRODUCTO.            085600      
007013     MOVE 066                 TO WKS-SIS-SDOSAL.                  085700      
007014     IF WKS-PARAM-SECUENCIA = 2                                   085750      
007015        OPEN OUTPUT A03-SDOSAL2                                   085800      
007016        WRITE R03-SDOSAL2   FROM A02-R00-SALDOS.                  085900      
007017     CHANGE ATTRIBUTE TITLE OF R01-CIFRAS TO WKS-TIT-CIFRAS.      086000      
007018     OPEN OUTPUT R01-CIFRAS.                                      086100      
007019     WRITE R01-REG-CIFRAS     FROM WLI-ENCABEZADO-1 AFTER PAGE.   086200      
007020     WRITE R01-REG-CIFRAS     FROM WLI-ENCABEZADO-2 AFTER 1 LINE. 086300      
007021     WRITE R01-REG-CIFRAS     FROM WLI-ENCABEZADO-3 AFTER 1 LINE  086400      
007022     MOVE ALL "-" TO R01-REG-CIFRAS.                              086500      
007023     WRITE R01-REG-CIFRAS AFTER 1 LINE.                           086600      
007024     IF WKS-PARAM-SECUENCIA = 1                                   086650      
007025        OPEN OUTPUT A06-MONITOR                                   086700      
007026        WRITE R06-MONITOR FROM WKS-HD-MONITOR.                    086800      
007027                                                                  086900      
007028 100-005-EXTRAE-REGISTROS-SDOS.                                   087000      
007029*==============================                                   087100      
007030                                                                  087200      
007031     MOVE WKS-CTL-NOMSDO      TO WKS-NOM-SDOENT.                  087300      
007032     MOVE WKS-CTL-PKSDO       TO WKS-PK-SDOENT                    087400      
007033     MOVE 0                   TO W77-FILEOK.                      087500      
007034     MOVE 0                   TO WKS-ENV-CTD.                     087550      
007035     PERFORM 150-007-VALIDA-HEADER UNTIL W88-FILEOK OR W88-FINLOG.087600      
007036     PERFORM 150-010-LEE-PRIMER-REGISTRO UNTIL W88-FINLOG.        087700      
007037     MOVE SPACES         TO A02-R00-TRA-SAL.                      087800      
007038     MOVE 99             TO A02-R00-TIPO-REG.                     087900      
007039     MOVE W77-NUMREG-001 TO A02-R02-TRA-TOTREG.                   088000      
007040     MOVE W77-NUMCTO-001 TO A02-R02-TRA-TOTCON WKS-NUM-DET.       088100      
007041     MOVE W77-SDOACT-001 TO A02-R02-TRA-IMPT   WKS-IMP-DET.       088200      
007042     MOVE 001            TO WKS-SIST-DET                          088300      
007043     WRITE R01-REG-CIFRAS FROM WKS-DETALLE-1 AFTER 6 LINES.       088400      
007044     IF WKS-PARAM-SECUENCIA = 2                                   088450      
007045        WRITE R02-SDOSAL1   FROM A02-R00-SALDOS.                  088500      
007046     MOVE W77-NUMREG-066 TO A02-R02-TRA-TOTREG.                   088600      
007047     MOVE W77-NUMCTO-066 TO A02-R02-TRA-TOTCON  WKS-NUM-DET.      088700      
007048     MOVE W77-SDOACT-066 TO A02-R02-TRA-IMPT    WKS-IMP-DET.      088800      
007049     MOVE 066            TO WKS-SIST-DET                          088900      
007050     WRITE R01-REG-CIFRAS FROM WKS-DETALLE-1 AFTER 4 LINES.       089000      
007051     IF WKS-PARAM-SECUENCIA = 2                                   089100      
007052        WRITE R03-SDOSAL2   FROM A02-R00-SALDOS.                  089200      
007053     IF WKS-PARAM-SECUENCIA = 2                                   089300      
007054        CLOSE A02-SDOSAL1 WITH SAVE                               089400      
007055        CLOSE A03-SDOSAL2 WITH SAVE.                              089500      
007056                                                                  089600      
007057     CLOSE A01-SDOENT  WITH SAVE.                                 089700      
007058*                                                                 089800      
007059 150-007-VALIDA-HEADER.                                           089900      
007060*======================                                           090000      
007061                                                                  090100      
007062     OPEN INPUT A01-SDOENT.                                       090200      
007063     MOVE  0  TO  W77-FINLOG W77-FILEOK.                          090300      
007064                                                                  090400      
007065     READ A01-SDOENT INTO WKS-HEADER-SDOENT                       090500      
007066                          AT END MOVE 1 TO W77-FINLOG.            090600      
007067                                                                  090700      
007068     IF W88-FINLOG                                                090800      
007069                                                                  090900      
007070        MOVE "ERROR: ARCHIVO VACIO"       TO      WLI-TEXTO-LJ    091000      
007071        PERFORM 000-030-IMPRIME-MENSAJE                           091100      
007072        MOVE 1  TO  W77-FINLOG                                    091200      
007073     ELSE                                                         091300      
007074        IF WKS-HSE-TIPOREG = "HD" AND                             091400      
007075           WKS-HSE-FECHA   = W77-FECHA-PROC                       091500      
007076           MOVE 1 TO W77-FILEOK                                   091600      
007077        ELSE                                                      091700      
007078           STOP    "FECHA EN HEADER ERRONEA = " WKS-HSE-FECHA     091800      
007079                   " FECHA CORRECTA = " W77-FECHA-PROC            091900      
007080                   " FAVOR DE COPIAR ARCHIVO CORRECTO O DAR DS"   092000      
007081                   CLOSE A01-SDOENT.                              092100      
007082*                                                                 092200      
007083                                                                  092300      
007084 150-010-LEE-PRIMER-REGISTRO.                                     092400      
007085*============================                                     092500      
007086                                                                  092600      
007087     MOVE  0  TO  W77-FINLOG.                                     092700      
007088                                                                  092800      
007089     READ A01-SDOENT INTO A22-R00-SALDOS                          092900      
007090                          AT END MOVE 1 TO W77-FINLOG.            093000      
007091                                                                  093100      
007092     IF W88-FINLOG                                                093200      
007093        MOVE "ERROR: ARCHIVO VACIO"       TO      WLI-TEXTO-LJ    093300      
007094        PERFORM 000-030-IMPRIME-MENSAJE                           093400      
007095        MOVE 1  TO  W77-FINLOG.                                   093500      
007096                                                                  093600      
007097     IF NOT W88-FINLOG                                            093700      
007098        IF A22-R00-TIPO-REG = 81    AND                           093720      
007099           WKS-PARAM-SECUENCIA = 1  AND                           093722      
007100         ((A22-R01-PRD = 1          AND                           093724      
007101           A22-R01-INS > 10         AND                           093726      
007102           A22-R01-INS < 16)        OR                            093728      
007103          (A22-R01-INDENVCTD = 1 OR 2))                           093738      
007104           PERFORM 190-MUEVE-SDOS-CBII                            093740      
007105        ELSE                                                      093760      
007106        IF WKS-PARAM-SECUENCIA = 2                                093780      
007107           IF A22-R00-TIPO-REG = 81                               093800      
007108              PERFORM 200-MUEVE-INFORMACION-SDOS                  093900      
007109              IF A22-R01-PRD=66 OR                                094000      
007110                (A22-R01-PRD=500 AND A22-R01-INS = 1)             094050      
007111                 PERFORM 150-030-GRABA-SDOCMAE                    094100      
007112              ELSE                                                094200      
007113                 PERFORM 150-040-GRABA-SDOCHQS.                   094300      
007114     IF NOT W88-FINLOG                                            094400      
007115        PERFORM 150-020-GRABA-DEMAS-REG UNTIL W88-FINLOG.         094500      
007116                                                                  094600      
007117*                                                                 094700      
007118                                                                  094800      
007119 150-020-GRABA-DEMAS-REG.                                         094900      
007120*========================                                         095000      
007121                                                                  095100      
007122     MOVE  0  TO  W77-FINLOG.                                     095200      
007123                                                                  095300      
007124     READ A01-SDOENT INTO A22-R00-SALDOS                          095400      
007125                          AT END MOVE 1 TO W77-FINLOG.            095500      
007126                                                                  095600      
007127     IF A22-R00-TIPO-REG    = 83 AND                              095620      
007128        WKS-PARAM-SECUENCIA = 1                                   095640      
007129        MOVE 1            TO W77-FINLOG.                          095660      
007130                                                                  095680      
007131     IF NOT W88-FINLOG                                            095700      
007132        IF A22-R00-TIPO-REG = 81    AND                           095710      
007133           WKS-PARAM-SECUENCIA = 1  AND                           095720      
007134         ((A22-R01-PRD = 1          AND                           095730      
007135           A22-R01-INS > 10         AND                           095740      
007136           A22-R01-INS < 16)        OR                            095750      
007137          (A22-R01-INDENVCTD = 1 OR 2))                           095755      
007138           PERFORM 190-MUEVE-SDOS-CBII                            095760      
007139        ELSE                                                      095780      
007140        IF WKS-PARAM-SECUENCIA = 2                                095800      
007141           IF A22-R00-TIPO-REG = 81                               095900      
007142              PERFORM 200-MUEVE-INFORMACION-SDOS                  096000      
007143              IF A22-R01-PRD=66 OR                                096050      
007144                (A22-R01-PRD=500 AND A22-R01-INS = 1)             096100      
007145                 PERFORM 150-030-GRABA-SDOCMAE                    096200      
007146              ELSE                                                096300      
007147                 PERFORM 150-040-GRABA-SDOCHQS.                   096400      
007148                                                                  096500      
007149 150-030-GRABA-SDOCMAE.                                           096600      
007150*======================                                           096700      
007151                                                                  096800      
007152     MOVE 0 TO W77-I.                                             096900      
007153     PERFORM 150-035-SUMA-SDOACT VARYING W77-I FROM 1 BY 1        097000      
007154*                                 UNTIL W77-I > 13 OR             097100      
007155                                  UNTIL W77-I > 30.               097150      
007156*                                 A22-R01-CVESDO(W77-I) = 0.      097200      
007157     MOVE 01             TO A02-R00-TIPO-REG.                     097300      
007158     WRITE R03-SDOSAL2 FROM A02-R00-SALDOS.                       097400      
007159     ADD 1 TO W77-NUMREG-066.                                     097500      
007160                                                                  097600      
007161 150-035-SUMA-SDOACT.                                             098200      
007162*====================                                             098300      
007163                                                                  098400      
007164     IF A22-R01-CVESDO(W77-I) = 2                                 098500      
007165        COMPUTE W77-NUMCTO-066 = W77-NUMCTO-066 + 1               098600      
007166        COMPUTE W77-SDOACT-066 = W77-SDOACT-066 +                 098700      
007167                               + A22-R01-IMPT(W77-I).             098800      
007168                                                                  098900      
007169 150-040-GRABA-SDOCHQS.                                           099000      
007170*======================                                           099100      
007171                                                                  099200      
007172     IF A22-R01-PRD NOT = 500                                     099300      
007173        MOVE 0 TO W77-I                                           099400      
007174        PERFORM 150-045-SUMA-SDOACT VARYING W77-I FROM 1 BY 1     099500      
007175*                                    UNTIL W77-I > 13 OR          099600      
007176                                     UNTIL W77-I > 30.            099650      
007177*                                    A22-R01-CVESDO(W77-I) = 0    099700      
007178        MOVE 01             TO A02-R00-TIPO-REG                   099800      
007179        WRITE R02-SDOSAL1 FROM A02-R00-SALDOS                     099900      
007180        ADD 1 TO W77-NUMREG-001.                                  100000      
007181                                                                  100100      
007182 150-045-SUMA-SDOACT.                                             100700      
007183*====================                                             100800      
007184     IF A22-R01-CVESDO(W77-I) = 2                                 101000      
007185        COMPUTE W77-NUMCTO-001 = W77-NUMCTO-001 + 1               101100      
007186        COMPUTE W77-SDOACT-001 = W77-SDOACT-001 +                 101200      
007187                               + A22-R01-IMPT(W77-I).             101300      
007188                                                                  101400      
007189 150-050-LLAMA-CTES.                                              101500      
007190*===================                                              101600      
007191     MOVE 0                      TO R422-84-CTR-ERROR.            101700      
007192     MOVE LOW-VALUES             TO S422-84-CTR-SALIDA.           101800      
007193     MOVE ZEROS                  TO E422-84-CTE-NUM.              101900      
007194     MOVE 0000                   TO E422-84-CTA-NUMPREF.          102000      
007195     MOVE A22-R01-CNT            TO E422-84-CTA-NUM,              102100      
007196                                    ACCI-CONTRATO-T               102200      
007197     MOVE A22-R01-PRD            TO E422-84-CTA-NUMPROD.          102300      
007198     MOVE A22-R01-INS            TO E422-84-CTA-CVEINST.          102400      
007199     MOVE 02                     TO E422-84-OPCION                102500      
007200     MOVE A22-R01-CNT            TO WKS-ERR-CTA.                  102520      
007201     MOVE A22-R01-PRD            TO WKS-ERR-PRD.                  102540      
007202     MOVE A22-R01-INS            TO WKS-ERR-INS.                  102560      
007203     CALL "S016_L422_B01SXCTE IN S016L422"                        102600      
007204          USING    E422-84-CTR-ENTRADA                            102700      
007205                   S422-84-CTR-SALIDA                             102800      
007206          GIVING   R422-84-CTR-ERROR.                             102900      
007207                                                                  103000      
007208*    IF R422-103-CTR-ERROR = 0                                    103100      
007209     IF R422-84-CTR-ERROR = 0                                     103150      
007210        MOVE ZEROS                TO      ACCI-GEN-CUST-T,        103200      
007211                                          ACCI-LIA-NBR-T          103300      
007212        MOVE 01                   TO      ACCI-LANGUAGE-CODE-T    103400      
007213        MOVE S422-84-CTE-NOM      TO      ACCI-SHORT-NAME-TEXT-T, 103500      
007214                                          ACCI-CUSTOMER-NAME-T    103600      
007215        MOVE S422-84-CTE-CALLENUM TO      ACCI-CBR-ADDRESS-1-T    103700      
007216        MOVE S422-84-CTE-NOMCOL   TO      ACCI-CBR-ADDRESS-2-T    103800      
007217        MOVE S422-84-CTE-NOMPOB   TO      ACCI-CBR-ADDRESS-3-T    103900      
007218        MOVE SPACES               TO      ACCI-CBR-ADDRESS-4-T    104000      
007219        MOVE S422-84-CTE-NUM      TO      W77-NUM-CTE             104100      
007220        PERFORM 150-060-MAS-DATCTES                               104200      
007221        MOVE  2                         TO W77-TIPO-OPCION        104220      
007222        MOVE  1                         TO R422-61-CTR-ERROR      104240      
007223        PERFORM 150-070-MAS-DATCTES2 UNTIL R422-61-CTR-ERROR = 0  104300      
007224                                        OR W77-TIPO-OPCION   = 0  104350      
007225     ELSE                                                         104400      
007226        MOVE ZEROS                TO      ACCI-GEN-CUST-T,        104500      
007227                                          ACCI-ACCT-NBR-T,        104600      
007228                                          ACCI-LIA-NBR-T,         104700      
007229        MOVE 01                   TO      ACCI-LANGUAGE-CODE-T    104800      
007230        MOVE SPACES               TO      ACCI-SHORT-NAME-TEXT-T, 104900      
007231                                          ACCI-CUSTOMER-NAME-T,   105000      
007232                                          ACCI-CBR-ADDRESS-1-T,   105100      
007233                                          ACCI-CBR-ADDRESS-2-T,   105200      
007234                                          ACCI-CBR-ADDRESS-3-T,   105300      
007235                                          ACCI-CBR-ADDRESS-4-T.   105400      
007236                                                                  105405      
007237     IF R422-84-CTR-ERROR > 0                                     105410      
007238        MOVE SPACES             TO WLI-ENCAB-62                   105415      
007239        MOVE R422-84-CTR-ERROR  TO WKS-ERR-CALL                   105420      
007240        MOVE WKS-ERR-CALL       TO WLI-RESULT                     105425      
007241        STRING "ERROR CALL S016_L422_B01SXCTE: ",                 105430      
007242               " CTA: "      DELIMITED BY SIZE,                   105435      
007243               WKS-ERR-CTA   DELIMITED BY SIZE,                   105440      
007244               " PRD: "      DELIMITED BY SIZE,                   105445      
007245               WKS-ERR-PRD   DELIMITED BY SIZE,                   105450      
007246               " INS: "      DELIMITED BY SIZE,                   105455      
007247               WKS-ERR-INS   DELIMITED BY SIZE                    105460      
007248        INTO WLI-TEXTO                                            105465      
007249        PERFORM 000-060-IMPRIME-RESULT-S016.                      105470      
007250                                                                  105475      
007251                                                                  105500      
007252 150-060-MAS-DATCTES.                                             105600      
007253*=====================                                            105700      
007254     MOVE 0                      TO R422-106-CTR-ERROR.           105800      
007255     MOVE LOW-VALUES             TO S422-106-CTR-SALIDA.          105900      
007256     MOVE 0000                   TO E422-106-CTR-NUMCSI.          106000      
007257     MOVE W77-NUM-CTE            TO E422-106-CTE-NUM              106100      
007258                                    WKS-ERR-CTE.                  106150      
007259     CALL "S016_L422_B38COSMOS IN S016L422"                       106200      
007260          USING    E422-106-CTR-ENTRADA                           106300      
007261                   S422-106-CTR-SALIDA                            106400      
007262          GIVING   R422-106-CTR-ERROR.                            106500      
007263                                                                  106600      
007264     IF R422-106-CTR-ERROR = 0                                    106700      
007265        MOVE S422-106-CTE-LANGUAGE TO     ACCI-LANGUAGE-CODE-T    106800      
007266        MOVE S422-106-CTE-LIABILIT TO     WKS-LIABILIT            106900      
007267        MOVE WKS-LIABILITI-NUMBER  TO     ACCI-LIA-NBR-T          107000      
007268     ELSE                                                         107100      
007269        MOVE 01                   TO      ACCI-LANGUAGE-CODE-T    107200      
007270        MOVE ZEROS                TO      ACCI-LIA-NBR-T.         107300      
007271                                                                  107305      
007272     IF R422-106-CTR-ERROR > 0                                    107310      
007273        MOVE SPACES              TO WLI-ENCAB-62                  107315      
007274        MOVE R422-106-CTR-ERROR  TO WKS-ERR-CALL                  107320      
007275        MOVE WKS-ERR-CALL        TO WLI-RESULT                    107325      
007276        STRING "ERROR CALL S016_L422_B38COSMOS: ",                107330      
007277               "NUMERO CLIENTE: "  DELIMITED BY SIZE,             107335      
007278                WKS-ERR-CTE                                       107340      
007279        DELIMITED BY SIZE INTO WLI-TEXTO                          107345      
007280        PERFORM 000-060-IMPRIME-RESULT-S016.                      107350      
007281                                                                  107400      
007282 150-070-MAS-DATCTES2.                                            107500      
007283*=====================                                            107600      
007284     COMPUTE W77-TIPO-OPCION     =  W77-TIPO-OPCION - 1.          107650      
007285     MOVE 0                      TO R422-61-CTR-ERROR.            107700      
007286     MOVE LOW-VALUES             TO S422-61-CTR-SALIDA.           107800      
007287     MOVE 0000                   TO E422-61-CTA-NUMPREF.          107900      
007288     MOVE A22-R01-CNT            TO E422-61-CTA-NUM.              108000      
007289     MOVE A22-R01-PRD            TO E422-61-CTA-NUMPROD.          108100      
007290     MOVE A22-R01-INS            TO E422-61-CTA-CVEINST.          108200      
007291     MOVE 1                      TO E422-61-MDA-CVETIPO.          108300      
007292     MOVE W77-TIPO-OPCION        TO E422-61-OPCION                108400      
007293                                                                  108420      
007294     MOVE A22-R01-CNT            TO WKS-ERR-CTA.                  108440      
007295     MOVE A22-R01-PRD            TO WKS-ERR-PRD.                  108460      
007296     MOVE A22-R01-INS            TO WKS-ERR-INS.                  108480      
007297                                                                  108490      
007298     CALL "S016_L422_CTAMEDIO IN S016L422"                        108500      
007299          USING    E422-61-CTR-ENTRADA                            108600      
007300                   S422-61-CTR-SALIDA                             108700      
007301          GIVING   R422-61-CTR-ERROR.                             108800      
007302                                                                  108900      
007303     IF R422-61-CTR-ERROR = 0                                     109000      
007304        MOVE S422-61-MDA-NUMPREF  TO      WKS-NUMPREF             109100      
007305        MOVE S422-61-MDA-NUM      TO      WKS-CUENTA              109200      
007306        MOVE WKS-NUM-CTA-CITI     TO      WKS-NUM-CUENTA-T2       109300      
007307                                          WKS-NUM-CUENTA-T        109400      
007308        MOVE WKS-2D-NUMPREF       TO      WKS-BN-2DNUMPREF        109500      
007309        MOVE WKS-4D-CTA           TO      WKS-BN-4DCTA            109600      
007310        MOVE WKS-BASE-NUMBER      TO      ACCI-GEN-CUST-T         109700      
007311        MOVE WKS-1DIG-CTA         TO      WKS-1DIG-CTAFTOI        109800      
007312        MOVE WKS-DIG-MUEVE        TO      WKS-7DIG-CTAFTOI        109900      
007313        MOVE WKS-6DIG-CTA         TO      WKS-6DIG-CTAFTOI        110000      
007314        MOVE WKS-3DIG-CTA         TO      WKS-3DIG-CTAFTOI        110100      
007315        MOVE WKS-CTA-FTOINT       TO      ACCI-ACCT-NBR-T         110200      
007316        IF ACCI-LIA-NBR-T = 0                                     110300      
007317           MOVE WKS-BASE-NUMBER   TO      ACCI-LIA-NBR-T          110400      
007318        ELSE                                                      110500      
007319           NEXT SENTENCE                                          110600      
007320     ELSE                                                         110700      
007321        MOVE ZEROS                TO      ACCI-ACCT-NBR-T,        110800      
007322                                          ACCI-GEN-CUST-T.        110805      
007323     IF R422-61-CTR-ERROR > 0                                     110810      
007324        MOVE SPACES             TO WLI-ENCAB-62                   110815      
007325        MOVE R422-61-CTR-ERROR  TO WKS-ERR-CALL                   110820      
007326        MOVE WKS-ERR-CALL       TO WLI-RESULT                     110825      
007327        STRING "ERROR CALL S016_L422_CTAMEDIO: ",                 110830      
007328               " CTA: "      DELIMITED BY SIZE,                   110835      
007329               WKS-ERR-CTA   DELIMITED BY SIZE,                   110840      
007330               " PRD: "      DELIMITED BY SIZE,                   110845      
007331               WKS-ERR-PRD   DELIMITED BY SIZE,                   110850      
007332               " INS: "      DELIMITED BY SIZE,                   110855      
007333               WKS-ERR-INS   DELIMITED BY SIZE                    110860      
007334        INTO WLI-TEXTO                                            110865      
007335        PERFORM 000-060-IMPRIME-RESULT-S016.                      110870      
007336                                                                  111000      
007337 190-MUEVE-SDOS-CBII.                                             111002      
007338*====================                                             111004      
007339   ADD          1             TO WKS-ENV-CTD.                     111006      
007340                                                                  111008      
007341   MOVE "ACI"                 TO  ACCI-RECORD-TYPE-T              111400      
007342   MOVE 484                   TO  ACCI-BRCH-NBR-T                 111500      
007343   IF A22-R01-MONEDA = 5                                          111600      
007344      MOVE 126                TO  ACCI-CCY-CODE-T                 111700      
007345      MOVE "USD"              TO  ACCI-SWIFT-CCY-CODE-T           111800      
007346   ELSE                                                           111900      
007347      MOVE 000                TO  ACCI-CCY-CODE-T                 112000      
007348      MOVE "MXN"              TO  ACCI-SWIFT-CCY-CODE-T.          112100      
007349   IF A22-R01-STATUS = 0                                          112200      
007350      MOVE SPACE              TO  ACCI-ACCT-STAT-IND-T            112300      
007351   ELSE                                                           112400      
007352      IF A22-R01-STATUS = 1                                       112500      
007353         MOVE "B"             TO  ACCI-ACCT-STAT-IND-T            112600      
007354      ELSE                                                        112700      
007355         MOVE "C"             TO  ACCI-ACCT-STAT-IND-T.           112800      
007356   MOVE A22-R01-FECULTMOV     TO  ACCI-LAST-TXN-DATE-T.           112850      
007357   MOVE 1                     TO  ACCI-CAT-CODE-T.                112900      
007358   MOVE "001"                 TO  ACCI-BANK-NON-BANK-T.           113000      
007359   MOVE "1111"                TO  ACCI-MAIL-T.                    113100      
007360   MOVE "0"                   TO  ACCI-MAIL-TO-COLLECT-T.         113200      
007361   MOVE "00"                  TO  ACCI-MAIL-RULEOFF-T.            113300      
007362   MOVE SPACES                TO  ACCI-FILLER-T.                  113400      
007363   MOVE "X"                   TO  ACCI-PRIME-DELIMETER-T.         113500      
007364   MOVE ZEROS                 TO  ACCI-ACCT-BAL-AMT-T,            113501      
007365                                  ACCI-LCY-ACCT-BAL-AMT-T,        113502      
007366                                  ACCI-DISP-VAL-BAL-AMT-T.        113503      
007367   MOVE "+"                   TO  ACCI-DISP-BAL-AMT-SIGN-T,       113504      
007368                                  ACCI-ACCT-BAL-AMT-SIGN-T        113505      
007369                                  ACCI-LCY-BAL-AMT-SIGN-T.        113506      
007370   PERFORM 190-CVESDO-CBII    VARYING W77-IND FROM 1 BY 1         113507      
007371                              UNTIL   W77-IND > 30.               113508      
007372   PERFORM 150-050-LLAMA-CTES                                     113509      
007373   WRITE R04-SDOSCBII-T.                                          113510      
007374                                                                  113511      
007375 190-CVESDO-CBII.                                                 113512      
007376*================                                                 113513      
007377   IF A22-R01-CVESDO(W77-IND) = 2                                 113514      
007378      MOVE A22-R01-IMPT(W77-IND)  TO ACCI-ACCT-BAL-AMT-T,         113515      
007379                                     ACCI-LCY-ACCT-BAL-AMT-T      113516      
007380      MOVE 1 TO W77-SDOACT                                        113517      
007381      IF A22-R01-IMPT(W77-IND) < 0                                113518      
007382         MOVE  "-"                TO ACCI-ACCT-BAL-AMT-SIGN-T,    113520      
007383                                     ACCI-LCY-BAL-AMT-SIGN-T      113521      
007384      ELSE                                                        113522      
007385         MOVE  "+"                TO ACCI-ACCT-BAL-AMT-SIGN-T,    113523      
007386                                     ACCI-LCY-BAL-AMT-SIGN-T      113524      
007387   ELSE                                                           113525      
007388   IF A22-R01-CVESDO(W77-IND) = 354                               113526      
007389      MOVE A22-R01-IMPT(W77-IND)  TO ACCI-DISP-VAL-BAL-AMT-T      113527      
007390      IF A22-R01-IMPT(W77-IND) < 0                                113528      
007391         MOVE  "-"                TO ACCI-DISP-BAL-AMT-SIGN-T     113529      
007392      ELSE                                                        113530      
007393         MOVE  "+"                TO ACCI-DISP-BAL-AMT-SIGN-T.    113531      
007394                                                                  113532      
007395 200-MUEVE-INFORMACION-SDOS.                                      113540      
007396*===========================                                      113560      
007397   MOVE A22-R01-SIS           TO  A02-R01-SIS.                    113600      
007398   MOVE A22-R01-PRD           TO  A02-R01-PRD.                    113700      
007399   MOVE A22-R01-INS           TO  A02-R01-INS.                    113800      
007400   MOVE A22-R01-CTA           TO  A02-R01-CTA.                    113900      
007401   MOVE A22-R01-EDOCTA        TO  A02-R01-EDOCTA.                 114000      
007402   MOVE A22-R01-STATUS        TO  A02-R01-STATUS.                 114100      
007403   MOVE A22-R01-FECPRO        TO  A2K-FEC-CAMD-001.               114200      
007404   PERFORM A2K-CONV-CAMD-TO-AMD THRU A2K-CONV-CAMD-TO-AMD-EXIT.   114300      
007405   MOVE A2K-FEC-AMD-001       TO  A02-R01-FECPRO.                 114400      
007406   MOVE A22-R01-FECINI        TO  A2K-FEC-CAMD-001.               114500      
007407   PERFORM A2K-CONV-CAMD-TO-AMD THRU A2K-CONV-CAMD-TO-AMD-EXIT.   114600      
007408   MOVE A2K-FEC-AMD-001       TO  A02-R01-FECINI.                 114700      
007409   MOVE A22-R01-FECFIN        TO  A2K-FEC-CAMD-001.               114800      
007410   PERFORM A2K-CONV-CAMD-TO-AMD THRU A2K-CONV-CAMD-TO-AMD-EXIT.   114900      
007411   MOVE A2K-FEC-AMD-001       TO  A02-R01-FECFIN.                 115000      
007412   MOVE A22-R01-FECULTMOV     TO  A2K-FEC-CAMD-001,               115100      
007413   PERFORM A2K-CONV-CAMD-TO-AMD THRU A2K-CONV-CAMD-TO-AMD-EXIT.   115300      
007414   MOVE A2K-FEC-AMD-001       TO  A02-R01-FECULTMOV.              115400      
007415   MOVE A22-R01-STATUS        TO  A02-R01-STATUS.                 115500      
007416   PERFORM 250-MUEVE-CVESDO-IMP VARYING W77-IND FROM 1 BY 1       116200      
007417*                                UNTIL   W77-IND > 13.            116300      
007418                                 UNTIL   W77-IND > 30.            116302      
007419   IF W77-SIST-PARAM = 500                                        116305      
007420      MOVE A22-R01-DIASCICLO     TO  A02-R01-DIASCICLO            116310      
007421      MOVE A22-R01-DIASANO       TO  A02-R01-DIASANO              116315      
007422      MOVE A22-R01-TASRENET      TO  A02-R01-TASRENET             116320      
007423      MOVE A22-R01-TASREBRU      TO  A02-R01-TASREBRU             116325      
007424      MOVE A22-R01-TASREANO      TO  A02-R01-TASREANO             116330      
007425      MOVE A22-R01-STATION       TO  A02-R01-STATION              116335      
007426      MOVE A22-R01-CTACON        TO  A02-R01-CTACON               116340      
007427      MOVE A22-R01-GENEDOCTA     TO  A02-R01-GENEDOCTA            116345      
007428      MOVE A22-R01-P-CTO-ORI     TO  A02-R01-P-CTO-ORI            116346      
007429      MOVE A22-R01-I-CTO-ORI     TO  A02-R01-I-CTO-ORI            116347      
007430      MOVE A22-R01-M-CTO-ORI     TO  A02-R01-M-CTO-ORI            116348      
007431      MOVE A22-R01-C-TAR-ORI     TO  A02-R01-C-TAR-ORI            116349      
007432   ELSE                                                           116350      
007433      MOVE A22-R01-FILXAPL       TO  A02-R01-FILXAPL.             116400      
007434                                                                  116500      
007435 250-MUEVE-CVESDO-IMP.                                            116600      
007436*=====================                                            116700      
007437                                                                  116800      
007438   MOVE A22-R01-CVESDO(W77-IND)   TO A02-R01-CVESDO(W77-IND).     116900      
007439   MOVE A22-R01-IMPT(W77-IND)     TO A02-R01-IMPT(W77-IND).       117000      
007440                                                                  117100      
007441 300-COMPLETA-SDOS.                                               119000      
007442*==================                                               119100      
007443     OPEN INPUT A04-SDOSCBII-T.                                   119200      
007444     OPEN OUTPUT A05-SDOSCBII.                                    119300      
007445     MOVE  0  TO  W77-FINLOG.                                     119400      
007446     READ A04-SDOSCBII-T AT END MOVE 1 TO W77-FINLOG.             119500      
007447                                                                  119600      
007448     IF NOT W88-FINLOG                                            119700      
007449        PERFORM 300-LLAMA-S408 UNTIL W88-S408-OK                  119800      
007450        PERFORM 320-LEE-CBII-T UNTIL W88-FINLOG.                  119900      
007451                                                                  120000      
007452     MOVE SPACES TO ACCI-INT-REC                                  120100      
007453     MOVE "END OF FILE" TO ACCI-ENDOFFILE                         120200      
007454     WRITE R05-SDOSCBII FROM ACCI-TR-REC                          120300      
007455     CLOSE A05-SDOSCBII WITH SAVE.                                120400      
007456     CLOSE A04-SDOSCBII-T WITH PURGE.                             120500      
007457     CLOSE A06-MONITOR  WITH SAVE.                                120600      
007458     PERFORM 41230-ENVIA-ACC.                                     120650      
007459                                                                  120700      
007460 300-LLAMA-S408.                                                  120800      
007461*===============                                                  120900      
007462     MOVE ACCI-GEN-CUST-T          TO WKS-BASENUM-MON.            120950      
007463     MOVE ACCI-ACCT-BAL-AMT-SIGN-T TO WKS-SIG-SDOACT,             120970      
007464                                      WKS-SIG-SDOACTCAL.          121070      
007465     MOVE ACCI-ACCT-BAL-AMT-T      TO WKS-SDO-ACT-MON             121100      
007466     MOVE ACCI-DISP-BAL-AMT-SIGN-T TO WKS-SIG-SDODIS              121400      
007467     MOVE ACCI-DISP-VAL-BAL-AMT-T  TO WKS-SDO-DIS-MON             121500      
007468     MOVE "+"             TO      WKS-SIG-LIN                     121600      
007469     MOVE WKS-SDO-ACT-MON TO      WKS-SDO-ACTCALC-MON             121800      
007470     MOVE 0               TO      W77-SDOACT-TEMP,WKS-SDO-LIN-MON 121900      
007471     MOVE LOW-VALUES      TO      WKS-FTO-LLAMADO-S408.           122000      
007472     MOVE 02              TO      WKS-FUN-S408                    122100      
007473     MOVE W77-FECHA-PROC  TO      WKS-FEC-S408,WKS-SDO-FECHA-MON  122200      
007474     MOVE ACCI-CONTRATO-T TO      WKS-CONTRATO-S408               122300      
007475     MOVE WKS-CONT-S408   TO      WKS-CTO-S408,WKS-CTO-MON        122400      
007476     CALL "CONSULTASALDO IN CONL020" USING WKS-FTO-LLAMADO-S408.  122500      
007477                                                                  122600      
007478     MOVE WKS-S408-RESULT TO      WKS-SDO-RESULT-MON.             122700      
007479     IF WKS-S408-RESULT = 0                                       122800      
007480        MOVE 1 TO W77-S408-OK                                     122900      
007481        IF WKS-SDO-S408 > 0                                       123000      
007482           MOVE "+"             TO   WKS-SIG-LIN                  123050      
007483           MOVE WKS-SDO-S408    TO   WKS-SDO-LIN-MON              123100      
007484           COMPUTE W77-SDOACT-TEMP = ACCI-ACCT-BAL-AMT-T          123200      
007485                                     - WKS-SDO-S408               123300      
007486           MOVE W77-SDOACT-TEMP TO   ACCI-ACCT-BAL-AMT-T,         123400      
007487                                     ACCI-LCY-ACCT-BAL-AMT-T,     123500      
007488                                     WKS-SDO-ACTCALC-MON          123600      
007489           MOVE W77-FECHA-PROC  TO   ACCI-LAST-TXN-DATE-T         123650      
007490           IF W77-SDOACT-TEMP > 0                                 123700      
007491              MOVE  "+"         TO   ACCI-ACCT-BAL-AMT-SIGN-T,    123800      
007492                                     ACCI-LCY-BAL-AMT-SIGN-T,     123900      
007493                                     WKS-SIG-SDOACTCAL            123950      
007494           ELSE                                                   124000      
007495              MOVE  "-"         TO   ACCI-ACCT-BAL-AMT-SIGN-T,    124100      
007496                                     ACCI-LCY-BAL-AMT-SIGN-T,     124200      
007497                                     WKS-SIG-SDOACTCAL            124250      
007498        ELSE                                                      124300      
007499           MOVE 0               TO   WKS-SDO-LIN-MON              124400      
007500     ELSE                                                         124500      
007501     IF WKS-S408-RESULT = 96                                      124600      
007502        WAIT(300)                                                 124700      
007503     ELSE                                                         124800      
007504        MOVE 1 TO W77-S408-OK                                     124900      
007505        MOVE 020101 TO CODIGO-LJ                                  125000      
007506        MOVE "E"            TO      TIPO-LJ                       125100      
007507        MOVE 010105         TO      CODIGO-LJ                     125200      
007508        STRING "ERROR AL CONSULTAR S408 CON CTO. : ",             125300      
007509               ACCI-CONTRATO-T, "RESULT : ", WKS-S408-RESULT      125400      
007510               DELIMITED BY SIZE INTO TEXTO-LJ                    125500      
007511        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ.       125600      
007512                                                                  125700      
007513 310-LLAMA-S408.                                                  125800      
007514*===============                                                  125900      
007515     MOVE ACCI-GEN-CUST-T          TO WKS-BASENUM-MON.            126000      
007516     MOVE ACCI-ACCT-BAL-AMT-SIGN-T TO WKS-SIG-SDOACT,             126100      
007517                                      WKS-SIG-SDOACTCAL.          126200      
007518     MOVE ACCI-ACCT-BAL-AMT-T      TO WKS-SDO-ACT-MON             126300      
007519     MOVE ACCI-DISP-BAL-AMT-SIGN-T TO WKS-SIG-SDODIS              126400      
007520     MOVE ACCI-DISP-VAL-BAL-AMT-T  TO WKS-SDO-DIS-MON             126500      
007521     MOVE "+"             TO      WKS-SIG-LIN                     126600      
007522     MOVE WKS-SDO-ACT-MON TO      WKS-SDO-ACTCALC-MON             126700      
007523     MOVE 0               TO      W77-SDOACT-TEMP,WKS-SDO-LIN-MON 126800      
007524     MOVE LOW-VALUES      TO      WKS-FTO-LLAMADO-S408.           126900      
007525     MOVE 02              TO      WKS-FUN-S408                    127000      
007526     MOVE W77-FECHA-PROC  TO      WKS-FEC-S408,WKS-SDO-FECHA-MON  127100      
007527     MOVE ACCI-CONTRATO-T TO      WKS-CONTRATO-S408               127200      
007528     MOVE WKS-CONT-S408   TO      WKS-CTO-S408,WKS-CTO-MON        127300      
007529                                                                  127400      
007530     CALL "CONSULTASALDO IN CONL020" USING WKS-FTO-LLAMADO-S408.  127500      
007531                                                                  127600      
007532     MOVE WKS-S408-RESULT TO      WKS-SDO-RESULT-MON.             127700      
007533     IF WKS-S408-RESULT = 0                                       127750      
007534        MOVE 1 TO W77-S408-OK                                     127800      
007535        IF WKS-SDO-S408 > 0                                       127850      
007536           MOVE "+"             TO   WKS-SIG-LIN                  127900      
007537           MOVE WKS-SDO-S408    TO   WKS-SDO-LIN-MON              127950      
007538           COMPUTE W77-SDOACT-TEMP = ACCI-ACCT-BAL-AMT-T          128000      
007539                                     - WKS-SDO-S408               128050      
007540           MOVE W77-SDOACT-TEMP TO   ACCI-ACCT-BAL-AMT-T,         128100      
007541                                     ACCI-LCY-ACCT-BAL-AMT-T,     128150      
007542                                     WKS-SDO-ACTCALC-MON          128200      
007543           MOVE W77-FECHA-PROC  TO   ACCI-LAST-TXN-DATE-T         128220      
007544           IF W77-SDOACT-TEMP > 0                                 128250      
007545              MOVE  "+"         TO   ACCI-ACCT-BAL-AMT-SIGN-T,    128300      
007546                                     ACCI-LCY-BAL-AMT-SIGN-T,     128350      
007547                                     WKS-SIG-SDOACTCAL            128400      
007548           ELSE                                                   128450      
007549              MOVE  "-"         TO   ACCI-ACCT-BAL-AMT-SIGN-T,    128500      
007550                                     ACCI-LCY-BAL-AMT-SIGN-T,     128550      
007551                                     WKS-SIG-SDOACTCAL            128600      
007552        ELSE                                                      128650      
007553           MOVE 0               TO   WKS-SDO-LIN-MON              128700      
007554     ELSE                                                         129400      
007555     IF WKS-S408-RESULT = 96                                      129410      
007556        WAIT(300)                                                 129420      
007557     ELSE                                                         129430      
007558     IF WKS-S408-RESULT NOT = 99                                  129440      
007559        MOVE 020101 TO CODIGO-LJ                                  129500      
007560        MOVE "E"            TO      TIPO-LJ                       129600      
007561        MOVE 010105         TO      CODIGO-LJ                     129700      
007562        STRING "ERROR AL CONSULTAR S408 CON CTO. : ",             129800      
007563               ACCI-CONTRATO-T, "RESULT : ", WKS-S408-RESULT      129900      
007564               DELIMITED BY SIZE INTO TEXTO-LJ                    130000      
007565        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ.       130100      
007566                                                                  130200      
007567 320-LEE-CBII-T.                                                  130300      
007568*===============                                                  130400      
007569     MOVE ACCI-INT-REC-T TO ACCI-INT-REC.                         130500      
007570     WRITE R05-SDOSCBII FROM ACCI-INT-REC.                        130600      
007571     WRITE R06-MONITOR FROM WKS-REG-MONITOR.                      130700      
007572                                                                  130800      
007573     READ A04-SDOSCBII-T AT END MOVE 1 TO W77-FINLOG.             130900      
007574     PERFORM 310-LLAMA-S408.                                      131000      
007575                                                                  131002      
007576 000-060-IMPRIME-RESULT-S016.                                     131005      
007577*============================                                     131010      
007578     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-62   AFTER 1           131015      
007579     ADD             2       TO WKS-NUM-LINEAS2                   131020      
007580     PERFORM 000-050-CHECA-SALTO-HOJA2.                           131025      
007581                                                                  131030      
007582 000-080-IMPRIME-TRAILER.                                         131035      
007583*============================                                     131040      
007584     MOVE SPACES      TO WLI-ENV-CTD.                             131045      
007585     MOVE WKS-ENV-CTD TO WLI-ENV-CTD.                             131050      
007586     WRITE V00-R00-REPORTE2 FROM WLI-TOT-ENVIO  AFTER 1.          131055      
007587                                                                  131100      
007588*                                                                 131200      
007589*INICIA  CODIGO DE RENOVACION CRONOS 2000                         131300      
007590 A2K-CPY-SECTION SECTION.                                         131400      
007591*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
007592*   COPY "S151/CRONOS2K/CPY/PD".                                  131500      
007593** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
007594** Unisys has defined for CRONOS2K project                     ** 000200      
007595** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
007596***************************************************************** 000400      
007597***************************************************************** 000600      
007598** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
007599** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
007600** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
007601** date MMDDCCAA, which is returned into the variable          ** 001000      
007602** A2K-FEC-MDCA-001.                                           ** 001100      
007603***************************************************************** 001200      
007604                                                                  001300      
007605 A2K-ACCEPT-TODAYS-DATE.                                          001400      
007606        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
007607*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
007608        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
007609        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
007610        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
007611        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
007612        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
007613                                                                  002200      
007614 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
007615        EXIT.                                                     002240      
007616                                                                  002500      
007617****************************************************************  002600      
007618** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
007619**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
007620**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
007621**baseyear to add the century to the year part.               **  003000      
007622**INPUT is A2K-FEC-AMD-001                                    **  003100      
007623**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
007624****************************************************************  003300      
007625                                                                  003400      
007626 A2K-CONV-AMD-TO-CAMD.                                            003500      
007627         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
007628         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
007629         IF A2K-FEC-AMD-001 = 0                                   003720      
007630            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
007631         ELSE                                                     003741      
007632          IF A2K-FEC-AMD-001 = 999999                             003742      
007633             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
007634         ELSE                                                     003760      
007635         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
007636                 A2K-OBTAIN-CENTURY-EXIT                          003900      
007637         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
007638         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
007639         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
007640         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
007641                                                                  004400      
007642 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
007643         EXIT.                                                    004600      
007644                                                                  004700      
007645******************************************************************004800      
007646**A2K-CONV-MDA-TO-MDCA.                                         **004900      
007647**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
007648** an eight digit format as MMDDCCAA. It use a                  **005100      
007649** baseyear to add century to the yaer.                         **005200      
007650** INPUT is A2K-FEC-MDA-001                                     **005300      
007651** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
007652                                                                  005500      
007653 A2K-CONV-MDA-TO-MDCA.                                            005600      
007654     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
007655     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
007656     IF A2K-FEC-MDA-001 = 0                                       005820      
007657        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
007658     ELSE                                                         005845      
007659      IF A2K-FEC-MDA-001 = 999999                                 005850      
007660         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
007661     ELSE                                                         005860      
007662     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
007663             A2K-OBTAIN-CENTURY-EXIT                              006000      
007664     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
007665     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
007666     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
007667     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
007668                                                                  006500      
007669 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
007670     EXIT.                                                        006700      
007671                                                                  006800      
007672***************************************************************** 006900      
007673**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
007674**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
007675**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
007676**baseyear to add century to the year.                         ** 007300      
007677**INPUT is A2K-FEC-DMA-001                                     ** 007400      
007678**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
007679                                                                  007600      
007680 A2K-CONV-DMA-TO-DMCA.                                            007700      
007681       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
007682       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
007683       IF  A2K-FEC-DMA-001   = 0                                  007920      
007684          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
007685       ELSE                                                       007945      
007686        IF A2K-FEC-DMA-001 = 999999                               007950      
007687          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
007688       ELSE                                                       007960      
007689       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
007690               A2K-OBTAIN-CENTURY-EXIT                            008100      
007691       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
007692       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
007693       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
007694       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
007695                                                                  008600      
007696 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
007697       EXIT.                                                      008800      
007698                                                                  008900      
007699***************************************************************** 009000      
007700** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
007701** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
007702** a 6 digit format as AAMMDD.                                 ** 009300      
007703** It simply removes the century information in the output     ** 009400      
007704** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
007705** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
007706                                                                  009700      
007707 A2K-CONV-CAMD-TO-AMD.                                            009800      
007708     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
007709     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
007710     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
007711     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
007712                                                                  010300      
007713 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
007714      EXIT.                                                       010500      
007715                                                                  010600      
007716******************************************************************010700      
007717******************************************************************010800      
007718** A2K-CONV-MDCA-TO-MDA.                                        **010900      
007719** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
007720** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
007721** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
007722** INPUT is A2K-FEC-MDCA-001                                    **011300      
007723** OUTPUT is A2K-FEC-MDA-001                                    **011400      
007724                                                                  011500      
007725 A2K-CONV-MDCA-TO-MDA.                                            011600      
007726     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
007727     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
007728     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
007729     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
007730                                                                  012100      
007731 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
007732      EXIT.                                                       012300      
007733                                                                  012400      
007734******************************************************************012500      
007735***************************************************************** 012600      
007736** A2K-CONV-DMCA-TO-DMA.                                        **012700      
007737** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
007738** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
007739** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
007740** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
007741** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
007742                                                                  013300      
007743 A2K-CONV-DMCA-TO-DMA.                                            013400      
007744     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
007745     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
007746     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
007747     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
007748                                                                  013900      
007749 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
007750      EXIT.                                                       014100      
007751                                                                  014200      
007752***************************************************************** 014300      
007753 A2K-CONV-MDCA-TO-CAMD.                                           014400      
007754      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
007755      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
007756      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
007757      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
007758      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
007759 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
007760      EXIT.                                                       015100      
007761***************************************************************** 015200      
007762** This paragraph adds century to an year field which is 9(02) ** 015300      
007763** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
007764** Output is A2K-FEC-CCAA-001.                                 ** 015600      
007765***************************************************************** 015700      
007766 A2K-CONV-AA-TO-CCAA.                                             015800      
007767      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
007768      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
007769              A2K-OBTAIN-CENTURY-EXIT.                            016100      
007770      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
007771 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
007772      EXIT.                                                       016400      
007773***************************************************************** 016500      
007774** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
007775** format.                                                     ** 016700      
007776** Input is A2K-FEC-DMCA-001.                                  ** 016800      
007777** Output is A2K-FEC-CAMD-001.                                 ** 016900      
007778***************************************************************** 017000      
007779 A2K-CONV-DMCA-TO-CAMD.                                           017100      
007780      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
007781      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
007782      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
007783      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
007784      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
007785 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
007786      EXIT.                                                       017800      
007787***************************************************************** 017900      
007788** This paragraph desides the Century to be added depending    ** 018000      
007789** on the base year.                                           ** 018100      
007790** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
007791** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
007792***************************************************************** 018400      
007793 A2K-OBTAIN-CENTURY.                                              018500      
007794      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
007795          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
007796      ELSE                                                        018800      
007797          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
007798 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
007799      EXIT.                                                       019100      
007800                                                                  019200      
007801***************************************************************** 019300      
007802** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
007803**  Format                                                     ** 019500      
007804** Input Is A2K-FEC-CAMD-001                                   ** 019600      
007805** Output Is A2K-FEC-DMCA-001                                  ** 019700      
007806***************************************************************** 019800      
007807 A2K-CONV-CAMD-TO-DMCA.                                           019900      
007808      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
007809      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
007810      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
007811      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
007812      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
007813                                                                  020500      
007814 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
007815      EXIT.                                                       020700      
007816                                                                  020800      
007817******************************************************************020900      
007818******************************************************************021000      
007819 A2K-CONV-AM-TO-CAM.                                              021100      
007820      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
007821      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
007822      IF A2K-FEC-AM-001 = 0                                       021220      
007823         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
007824      ELSE                                                        021245      
007825      IF A2K-FEC-AM-001 = 9999                                    021250      
007826         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
007827      ELSE                                                        021260      
007828      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
007829      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
007830      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
007831              A2K-OBTAIN-CENTURY-EXIT                             021600      
007832      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
007833                                                                  021800      
007834 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
007835      EXIT.                                                       022000      
007836                                                                  022100      
007837******************************************************************022200      
007838******************************************************************022300      
007839 A2K-CONV-CAM-TO-AM.                                              022400      
007840      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
007841      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
007842      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
007843                                                                  022800      
007844 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
007845   EXIT.                                                          023000      
007846                                                                  023100      
007847                                                                  023200      
007848                                                                  023500      
007849*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
007850 A2K-CPY-EXIT-PARA.                                               131600      
007851    EXIT.                                                         131700      
007852*TERMINA CODIGO DE RENOVACION CRONOS 2000                         131800      
007853                                                                  131900      
007854 41230-ENVIA-ACC.                                                 132000      
007855*=========================                                        132100      
007856*ENVIA ARCHIVO (S151)S151/FILE/E01/S500ACC/04/10/AAMMDD           132200      
007857     IF WKS-NUMCSI = 04                                           132300      
007858        MOVE WKS-TIT-SDOSCBII         TO WKS-NOM-ACC              132400      
007859        MOVE WKS-NOMBREACC            TO WKS-ARCHIVO              132500      
007860        CALL SYSTEM WFL USING WKS-COPY-L030.                      132600      
