000001$SET LIST ERRORLIMIT = 30                                         000100      
000002*$SET TADS                                                        000200      
000003 IDENTIFICATION DIVISION.                                         000300      
000004 AUTHOR. ING. LINO HECTOR TORRES CORONADO & JARC                  000400      
000005******************************************************************000500      
000006* PROGRAMA QUE GENERA LA BITACORA DE MOVIMIENTOS TRANSMITIDOS    *000600      
000007* PARA LAS SUCURSALES, CUADRE CONTABLE, ACTUALIZACION DE CON-    *000700      
000008* CEPTOS EN S151BD11SDOS, MANEJO DE DEFAULTS PARA LOS DATOS      *000800      
000009* ERRONEOS, ADEMAS GENERA LOS ARCHIVOS DE INTERFACE PARA EL      *000900      
000010* S028, S254 , S120 Y DATOTECA.                                  *001000      
000011*                                                                *001010      
000012* RECOMPILACION POR EL UPGRADE DEL MCP A 55                      *001012      
000013* 20141208 15MTP001 MJGRG                                        *001014      
000014* RECOMPILACION POR EL UPGRADE DEL MCP A 62                      *001020      
000015* 20230714 23MTP002 CLLC                                         *001040      
000016******************************************************************001100      
000017* VERSION CON ACUMULACION DE TOTALES X PROCESO,  REPORTE Y       *001200      
000018*  ARCHIVO DE RECHAZOS.                                          *001300      
000019******************************************************************001400      
000020 ENVIRONMENT DIVISION.                                            001500      
000021 INPUT-OUTPUT SECTION.                                            001600      
000022 FILE-CONTROL.                                                    001700      
000023                                                                  001800      
000024      SELECT LOG151         ASSIGN TO DISK                        001900      
000025                            ACCESS MODE IS SEQUENTIAL.            002000      
000026                                                                  002100      
000027      SELECT LOG151-COMP    ASSIGN TO DISK                        002200      
000028                            RESERVE 0 AREAS                       002300      
000029                            ORGANIZATION IS SEQUENTIAL            002400      
000030                            ACCESS MODE IS RANDOM                 002500      
000031                            ACTUAL KEY IS W77-APUDES.             002600      
000032                                                                  002700      
000033      SELECT LOGERR         ASSIGN TO DISK                        002800      
000034                            ACCESS MODE IS SEQUENTIAL.            002900      
000035                                                                  003000      
000036      SELECT MOVIMIENTOS    ASSIGN TO DISK                        003100      
000037                            ACCESS MODE IS SEQUENTIAL.            003200      
000038                                                                  003300      
000039      SELECT SMOVIMIENTOS   ASSIGN TO SORT DISK.                  003400      
000040                                                                  003500      
000041      SELECT CVETRAN        ASSIGN TO DISK                        003600      
000042                            ACCESS MODE IS SEQUENTIAL.            003700      
000043                                                                  003800      
000044      SELECT TOTCVETRAN     ASSIGN TO DISK                        003900      
000045                            ACCESS MODE IS SEQUENTIAL.            004000      
000046                                                                  004100      
000047      SELECT CVEMARCATOR    ASSIGN TO DISK                        004200      
000048                            ACCESS MODE IS SEQUENTIAL.            004300      
000049                                                                  004400      
000050      SELECT MOVCONTABLES   ASSIGN TO DISK.                       004500      
000051                                                                  004600      
000052      SELECT SMOVCONTABLES  ASSIGN TO SORT DISK.                  004700      
000053                                                                  004800      
000054      SELECT CUADRECON      ASSIGN TO DISK                        004900      
000055                            ACCESS MODE IS SEQUENTIAL.            005000      
000056                                                                  005100      
000057      SELECT MOVCONERROR    ASSIGN TO DISK.                       005200      
000058                                                                  005300      
000059      SELECT SMOVCONERROR   ASSIGN TO SORT DISK.                  005400      
000060                                                                  005500      
000061      SELECT MOVSXTERM      ASSIGN TO DISK                        005600      
000062                            ACCESS MODE IS SEQUENTIAL.            005700      
000063                                                                  005800      
000064      SELECT PAQCONTAB2     ASSIGN TO DISK.                       005900      
000065                                                                  006000      
000066      SELECT BITACORA       ASSIGN TO PRINTER.                    006100      
000067                                                                  006200      
000068      SELECT TOTALESTRANS   ASSIGN TO PRINTER.                    006300      
000069                                                                  006400      
000070      SELECT REPCONTABLE    ASSIGN TO PRINTER.                    006500      
000071                                                                  006600      
000072      SELECT REPORTE        ASSIGN TO PRINTER.                    006700      
000073                                                                  006800      
000074      SELECT RECHAZOS       ASSIGN TO PRINTER.                    006900      
000075                                                                  007000      
000076      SELECT TOTRECHA       ASSIGN TO PRINTER.                    007100      
000077                                                                  007200      
000078      SELECT V00-REP-CVES   ASSIGN TO PRINTER.                    007300      
000079                                                                  007400      
000080      SELECT MOVSCIG        ASSIGN TO DISK.                       007700      
000081                                                                  007800      
000082      SELECT A01-ATLAS      ASSIGN TO DISK                        007900      
000083                            ORGANIZATION IS SEQUENTIAL.           008000      
000084                                                                  008100      
000085      SELECT DESVIOS        ASSIGN TO DISK                        008200      
000086                            ORGANIZATION IS SEQUENTIAL.           008300      
000087                                                                  008400      
000088      SELECT ERRORES        ASSIGN TO DISK.                       008500      
000089                                                                  008600      
000090      SELECT V00-REP-PROC   ASSIGN TO PRINTER.                    008700      
000091                                                                  008800      
000092      SELECT PUNTEO         ASSIGN TO DISK                        008900      
000093                            ORGANIZATION IS SEQUENTIAL.           009000      
000094                                                                  009100      
000095      SELECT FILE-AM        ASSIGN TO DISK.                       009200      
000096 DATA DIVISION.                                                   009300      
000097 FILE SECTION.                                                    009400      
000098                                                                  009500      
000099 FD LOG151                                                        009600      
000100*=========                                                        009700      
000101    VALUE OF BUFFERS        IS 1                                  009800      
000102    BLOCK CONTAINS             144 RECORDS                        010000      
000103    VALUE OF TITLE          IS WKS-TIT-LOGS151.                   010100      
000104                                                                  010300      
000105 01 REG-LOGS151                           PIC X(450).             010400      
000106                                                                  010500      
000107 FD LOG151-COMP                                                   010600      
000108*==============                                                   010700      
000109    VALUE OF BUFFERS        IS 1                                  010800      
000110    VALUE OF TITLE          IS WKS-TIT-DES151                     011000      
000111    BLOCK CONTAINS          120 RECORDS.                          011100      
000112                                                                  011200      
000113 01 REG-LOG-COMP                          PIC X(540).             011300      
000114                                                                  011400      
000115 FD LOGERR                                                        011500      
000116*=========                                                        011600      
000117    VALUE OF MAXRECSIZE IS 90                                     011700      
000118          FRAMESIZE IS 48                                         011800      
000119    BLOCK CONTAINS             10 RECORDS                         011900      
000120    VALUE OF TITLE          IS WKS-TIT-LOGERR                     012000      
000121    VALUE OF DEPENDENTSPECS IS TRUE.                              012100      
000122                                                                  012200      
000123 01 REG-LOGERR                            PIC X(540).             012300      
000124                                                                  012400      
000125 FD MOVIMIENTOS                                                   012500      
000126*==============                                                   012600      
000127    VALUE OF TITLE IS WKS-TIT-MOVIMIENTOS                         012650      
000128    VALUE OF MAXRECSIZE     IS 16                                 012700      
000129             FRAMESIZE      IS 48                                 012800      
000130             AREAS IS 1000                                        012900      
000131             AREASIZE IS 6000                                     013000      
000132    BLOCK CONTAINS             120 RECORDS.                       013100      
000133                                                                  013200      
000134 01 REG-MOVIMIENTOS.                                              013300      
000135    02 RM-NODO-IMP                        PIC 9(04) COMP.         013400      
000136    02 RM-SUC-INIC                        PIC 9(04) COMP.         013500      
000137    02 RM-CAJA-INIC                       PIC 9(02) COMP.         013600      
000138    02 RM-TIPO-CRED                       PIC 9(04) COMP.         013700      
000139    02 RM-FONDO                           PIC 9(02) COMP.         013800      
000140    02 RM-SUC-PROM                        PIC 9(04) COMP.         013900      
000141    02 RM-CONTRATO                        PIC 9(16) COMP.         014000      
000142    02 RM-CVE-TRANS                       PIC 9(04) COMP.         014100      
000143    02 RM-TM                              PIC 9(04) COMP.         014200      
000144    02 RM-IMPORTE                         PIC 9(14)V99 COMP.      014300      
000145    02 RM-AUT-APLIC                       PIC 9(08) COMP.         014400      
000146    02 RM-AUT-3NIVEL                      PIC 9(08) COMP.         014500      
000147    02 RM-AUT-S151                        PIC 9(08) COMP.         014600      
000148    02 RM-MONEDA                          PIC 9(04) COMP.         014700      
000149    02 RM-REFERENCIA                      PIC 9(20) COMP.         014800      
000150    02 RM-ORIGEN                          PIC 9(02) COMP.         014900      
000151    02 RM-HORA                            PIC 9(06) COMP.         015000      
000152    02 RM-HORA-R REDEFINES RM-HORA.                               015100      
000153       04 RM-HORA-HH                      PIC 9(02) COMP.         015200      
000154       04 RM-HORA-MM                      PIC 9(02) COMP.         015250      
000155       04 FILLER                          PIC 9(02) COMP.         015300      
000156    02 RM-FECHA-REAL                      PIC 9(08) COMP.         015400      
000157    02 RM-FECHA-VALOR                     PIC 9(08) COMP.         015500      
000158    02 RM-NOMINA-OPER                     PIC 9(08) COMP.         015600      
000159    02 RM-CVE-MDA                         PIC 9(02) COMP.         015700      
000160    02 RM-MDA-SUC                         PIC 9(04) COMP.         015800      
000161    02 RM-MDA-CTA                         PIC 9(16) COMP.         015900      
000162    02 RM-ESTATUS                         PIC 9(02) COMP.         016000      
000163    02 RM-TIPO-PROC                       PIC 9(02) COMP.         016100      
000164    02 RM-LIBRO                           PIC 9(02) COMP.         016200      
000165    02 RM-NATS28                          PIC 9(02) COMP.         016300      
000166    02 RM-TC-ALFA                         PIC X(08).              016400      
000167    02 FILLER                             PIC X(03).              016500      
000168                                                                  016600      
000169 SD SMOVIMIENTOS.                                                 016700      
000170*===============                                                  016800      
000171                                                                  016900      
000172 01 SREG-MOVIMIENTOS.                                             017000      
000173    02 SM-NODO-IMP                        PIC 9(04) COMP.         017100      
000174    02 SM-SUC-INIC                        PIC 9(04) COMP.         017200      
000175    02 SM-CAJA-INIC                       PIC 9(02) COMP.         017300      
000176    02 SM-TIPO-CRED                       PIC 9(04) COMP.         017400      
000177    02 SM-FONDO                           PIC 9(02) COMP.         017500      
000178    02 SM-SUC-PROM                        PIC 9(04) COMP.         017600      
000179    02 SM-CONTRATO                        PIC 9(16) COMP.         017700      
000180    02 SM-CVE-TRANS                       PIC 9(04) COMP.         017800      
000181    02 SM-TM                              PIC 9(04) COMP.         017900      
000182    02 SM-IMPORTE                         PIC 9(14)V99 COMP.      018000      
000183    02 SM-AUT-APLIC                       PIC 9(08) COMP.         018100      
000184    02 SM-AUT-3NIVEL                      PIC 9(08) COMP.         018200      
000185    02 SM-AUT-S151                        PIC 9(08) COMP.         018300      
000186    02 SM-MONEDA                          PIC 9(04) COMP.         018400      
000187    02 SM-REFERENCIA                      PIC 9(20) COMP.         018500      
000188    02 SM-ORIGEN                          PIC 9(02) COMP.         018600      
000189    02 SM-HORA                            PIC 9(08) COMP.         018700      
000190    02 SM-HORA-R REDEFINES SM-HORA.                               018800      
000191       04 SM-HORA-HHMM                    PIC 9(06) COMP.         018900      
000192       04 FILLER                          PIC 9(02) COMP.         019000      
000193    02 SM-FECHA-REAL                      PIC 9(08) COMP.         019100      
000194    02 SM-FECHA-VALOR                     PIC 9(08) COMP.         019200      
000195    02 SM-NOMINA-OPER                     PIC 9(08) COMP.         019300      
000196    02 SM-CVE-MDA                         PIC 9(02) COMP.         019400      
000197    02 SM-MDA-SUC                         PIC 9(04) COMP.         019500      
000198    02 SM-MDA-CTA                         PIC 9(16) COMP.         019600      
000199    02 SM-ESTATUS                         PIC 9(02) COMP.         019700      
000200    02 SM-TIPO-PROC                       PIC 9(02) COMP.         019800      
000201    02 SM-LIBRO                           PIC 9(02) COMP.         019900      
000202    02 SM-NATS28                          PIC 9(02) COMP.         020000      
000203    02 SM-TC-ALFA                         PIC X(08).              020100      
000204    02 FILLER                             PIC X(02).              020200      
000205                                                                  020300      
000206 FD CVETRAN                                                       020400      
000207*==========                                                       020500      
000208    VALUE OF TITLE IS WKS-TIT-CVETRAN                             020550      
000209    VALUE OF MAXRECSIZE     IS 6                                  020600      
000210             FRAMESIZE      IS 48                                 020700      
000211             AREAS IS 1000                                        020800      
000212             AREASIZE IS 9000                                     020900      
000213    BLOCK CONTAINS             5 RECORDS.                         021000      
000214                                                                  021100      
000215 01 REG-CVETRAN.                                                  021200      
000216    02 RMC-FECHA                          PIC 9(08) COMP.         021300      
000217    02 RMC-NPROCESO                       PIC 9(02) COMP.         021400      
000218    02 RMC-LIBRO                          PIC 9(02) COMP.         021500      
000219    02 RMC-MONEDA                         PIC 9(04) COMP.         021600      
000220    02 RMC-FID                            PIC 9(06) COMP.         021700      
000221    02 RMC-TIPOCRED                       PIC 9(04) COMP.         021800      
000222    02 RMC-FONDO                          PIC 9(02) COMP.         021900      
000223    02 RMC-EVENTO                         PIC 9(04) COMP.         022000      
000224    02 RMC-CVETRAN                        PIC 9(04) COMP.         022100      
000225    02 RMC-TM                             PIC 9(02) COMP.         022200      
000226    02 RMC-SUC-PROM                       PIC 9(04) COMP.         022300      
000227    02 RMC-SUC-INIC                       PIC 9(04) COMP.         022400      
000228    02 RMC-IMPORTE                        PIC 9(14)V99 COMP.      022500      
000229    02 RMC-TIPOCON                        PIC 9(02) COMP.         022600      
000230    02 FILLER                             PIC X(04).              022700      
000231                                                                  022800      
000232 FD TOTCVETRAN                                                    022900      
000233*=============                                                    023000      
000234    VALUE OF TITLE IS WKS-TIT-CVES                                023100      
000235    BLOCK CONTAINS        90 RECORDS.                             023200      
000236                                                                  023300      
000237 01 REG-TOTCVETRAN                        PIC X(78).              023400      
000238                                                                  023500      
000239                                                                  023600      
000240 FD CVEMARCATOR                                                   023700      
000241*==============                                                   023800      
000242    BLOCK CONTAINS       30 RECORDS.                              023900      
000243                                                                  024100      
000244 01 REG-CVEMERCATOR               PIC X(162).                     024200      
000245                                                                  024300      
000246 SD SMOVCONTABLES.                                                024400      
000247*===============                                                  024500      
000248                                                                  024600      
000249 01 SREG-CVETRAN.                                                 024700      
000250    02 SRMC-FECHA                          PIC 9(08)    COMP.     024800      
000251    02 SRMC-NPROCESO                       PIC 9(02)    COMP.     024900      
000252    02 SRMC-LIBRO                          PIC 9(02)    COMP.     025000      
000253    02 SRMC-MONEDA                         PIC 9(04)    COMP.     025100      
000254    02 SRMC-FID                            PIC 9(06)    COMP.     025200      
000255    02 SRMC-TIPOCRED                       PIC 9(04)    COMP.     025300      
000256    02 SRMC-FONDO                          PIC 9(02)    COMP.     025400      
000257    02 SRMC-EVENTO                         PIC 9(04)    COMP.     025500      
000258    02 SRMC-CVETRAN                        PIC 9(04)    COMP.     025600      
000259    02 SRMC-TM                             PIC 9(02)    COMP.     025700      
000260    02 SRMC-SUC-PROM                       PIC 9(04)    COMP.     025800      
000261    02 SRMC-SUC-TRAN                       PIC 9(04)    COMP.     025900      
000262    02 SRMC-IMPORTE                        PIC 9(14)V99 COMP.     026000      
000263    02 SRMC-TIPOCON                        PIC 9(02)    COMP.     026100      
000264    02 FILLER                              PIC X(04).             026200      
000265                                                                  026300      
000266 FD MOVCONTABLES                                                  026400      
000267*===============                                                  026500      
000268    VALUE OF TITLE IS WKS-TIT-MOVCONT                             026600      
000269    VALUE OF MAXRECSIZE     IS 10                                 026700      
000270             FRAMESIZE      IS 48                                 026800      
000271             AREAS IS 1000                                        026900      
000272             AREASIZE IS 9000                                     027000      
000273    BLOCK CONTAINS             30 RECORDS.                        027100      
000274                                                                  027200      
000275 01 REG-MOVCONTABLES                      PIC X(60).              027300      
000276                                                                  027400      
000277 FD CUADRECON                                                     027500      
000278*============                                                     027600      
000279    VALUE OF TITLE IS WKS-TIT-CC                                  027700      
000280             BLOCK CONTAINS 15 RECORDS.                           027800      
000281                                                                  027900      
000282 01 REG-CUADRECON                   PIC X(55).                    028000      
000283                                                                  028100      
000284 FD MOVCONERROR                                                   028200      
000285*==============                                                   028300      
000286    VALUE OF TITLE IS  WKS-TIT-MOVERROR                           028350      
000287    BLOCK CONTAINS             10 RECORDS.                        028400      
000288                                                                  028500      
000289 01 REG-ERROR.                                                    028600      
000290    02 RE-LIBRO                           PIC  9(02)    COMP.     028700      
000291    02 RE-PROD                            PIC  9(04)    COMP.     028800      
000292    02 RE-CONTRATO                        PIC  9(12)    COMP.     028900      
000293    02 RE-FOLIO                           PIC  9(04)    COMP.     029000      
000294    02 RE-ESQ                             PIC  9(04)    COMP.     029100      
000295    02 RE-CVE                             PIC  9(04)    COMP.     029200      
000296    02 RE-IMPORTE                         PIC  9(14)V99 COMP.     029300      
000297    02 RE-AUTAPL                          PIC  9(08)    COMP.     029400      
000298    02 RE-MON                             PIC  9(02)    COMP.     029500      
000299    02 RE-TIPOERR                         PIC  9(02)    COMP.     029600      
000300    02 RE-SUC-PROM                        PIC  9(04)    COMP.     029700      
000301    02 RE-SUC-TRAN                        PIC  9(04)    COMP.     029800      
000302    02 RE-AUT-S151                        PIC  9(08)    COMP.     029900      
000303    02 RE-INSTRUMENTO                     PIC  9(06)    COMP.     030000      
000304    02 RE-FIDEICOMISO                     PIC  9(06)    COMP.     030100      
000305    02 RE-ERROR2                          PIC  9(08)    COMP.     030200      
000306                                                                  030300      
000307 SD SMOVCONERROR.                                                 030400      
000308*===============                                                  030500      
000309 01 REG-SERROR.                                                   030600      
000310    02 SRE-LIBRO                          PIC  9(02)    COMP.     030700      
000311    02 SRE-PROD                           PIC  9(04)    COMP.     030800      
000312    02 SRE-CONTRATO                       PIC  9(12)    COMP.     030900      
000313    02 SRE-FOLIO                          PIC  9(04)    COMP.     031000      
000314    02 SRE-ESQ                            PIC  9(04)    COMP.     031100      
000315    02 SRE-CVE                            PIC  9(04)    COMP.     031200      
000316    02 SRE-IMPORTE                        PIC  9(14)V99 COMP.     031300      
000317    02 SRE-AUTAPL                         PIC  9(08)    COMP.     031400      
000318    02 SRE-MON                            PIC  9(02)    COMP.     031500      
000319    02 SRE-TIPOERR                        PIC  9(02)    COMP.     031600      
000320    02 SRE-SUC-PROM                       PIC  9(04)    COMP.     031700      
000321    02 SRE-SUC-TRAN                       PIC  9(04)    COMP.     031800      
000322    02 SRE-AUT-S151                       PIC  9(08)    COMP.     031900      
000323    02 SRE-INSTRUMENTO                    PIC  9(06)    COMP.     032000      
000324    02 SRE-FIDEICOMISO                    PIC  9(06)    COMP.     032100      
000325    02 SRE-ERROR2                         PIC  9(08)    COMP.     032200      
000326                                                                  032300      
000327 FD MOVSXTERM                                                     032400      
000328*============                                                     032500      
000329    BLOCK CONTAINS             15 RECORDS                         032600      
000330    VALUE OF TITLE          IS WKS-TIT-MOVSXTERM.                 032700      
000331 01 REG-MOVSXTERM                         PIC X(60).              032800      
000332                                                                  032900      
000333 FD PAQCONTAB2                                                    033000      
000334*==============                                                   033100      
000335    BLOCK CONTAINS 30 RECORDS                                     033200      
000336    VALUE OF TITLE IS WKS-TIT-PAQCONTAB2.                         033300      
000337 01 REG-PAQCONTAB2                        PIC X(300).             033400      
000338                                                                  033500      
000339 FD BITACORA.                                                     033600      
000340*===========                                                      033700      
000341 01 REG-BITACORA                          PIC X(132).             033800      
000342                                                                  033900      
000343 FD TOTALESTRANS.                                                 034000      
000344*===============                                                  034100      
000345 01 REG-TOTALESTRANS                      PIC X(132).             034200      
000346                                                                  034300      
000347 FD REPCONTABLE.                                                  034400      
000348*=============                                                    034500      
000349 01 REG-REPCONTABLE                       PIC X(132).             034600      
000350                                                                  034700      
000351 FD REPORTE                                                       034800      
000352*===========                                                      034900      
000353    VALUE OF TITLE IS WKS-TIT-REPORTE.                            035000      
000354 01 REG-REPORTE                           PIC X(132).             035100      
000355                                                                  035200      
000356  FD RECHAZOS                                                     035300      
000357*============                                                     035400      
000358     VALUE OF TITLE IS WKS-TIT-RECHAZOS.                          035500      
000359  01 REG-RECHAZOS                         PIC X(132).             035600      
000360                                                                  035700      
000361  FD TOTRECHA                                                     035800      
000362*============                                                     035900      
000363     VALUE OF TITLE IS WKS-TIT-RECHAZOS.                          036000      
000364  01 REG-TOTRECHA                         PIC X(132).             036100      
000365                                                                  036200      
000366 FD V00-REP-CVES.                                                 036300      
000367*================                                                 036400      
000368  01 V00-R00-CVES                         PIC X(132).             036500      
000369                                                                  036600      
000370 FD PUNTEO                                                        036700      
000371*==========                                                       036800      
000372    VALUE OF TITLE IS WKS-TIT-PUNTEO                              036900      
000373    VALUE OF MAXRECSIZE     IS 8                                  037000      
000374             FRAMESIZE      IS 48                                 037100      
000375             AREAS IS 1000                                        037200      
000376             AREASIZE IS 9000                                     037300      
000377    BLOCK CONTAINS            15 RECORDS.                         037400      
000378                                                                  037500      
000379 01 REG-PUNTEO                            PIC X(48).              037600      
000380                                                                  037700      
000381 FD MOVSCIG                                                       043100      
000382*==========                                                       043200      
000383    VALUE OF AREAS IS 1000                                        043300      
000384    VALUE OF AREASIZE IS 6000                                     043400      
000385    BLOCK CONTAINS 50 RECORDS                                     043500      
000386    VALUE OF TITLE IS WKS-TIT-MOVSCIG.                            043600      
000387 01 REG-MOVSCIG                           PIC X(810).             043700      
000388                                                                  043800      
000389 FD A01-ATLAS                                                     043900      
000390*=============                                                    044000      
000391    VALUE OF TITLE IS WKS-TIT-ATLAS                               044100      
000392    BLOCK CONTAINS 15 RECORDS.                                    044200      
000393 01 A01-REG-ATLAS                         PIC X(60).              044300      
000394                                                                  044400      
000395 FD DESVIOS                                                       044500      
000396*==========                                                       044600      
000397*    VALUE OF MAXRECSIZE IS 17                                    044700      
000398*             FRAMESIZE  IS 48                                    044800      
000399*    BLOCK CONTAINS 30 RECORDS                                    044900      
000400    VALUE OF TITLE IS WKS-TIT-DESVIOS.                            045000      
000401                                                                  045100      
000402 01 REG-DESVIOS                           PIC X(130).             045200      
000403                                                                  045300      
000404 FD ERRORES                                                       045400      
000405*==========                                                       045500      
000406    VALUE OF TITLE IS WKS-TIT-ERRORES.                            045600      
000407                                                                  045700      
000408 01 REG-ERRORES                           PIC X(100).             045800      
000409                                                                  045900      
000410 FD V00-REP-PROC.                                                 046000      
000411*================                                                 046100      
000412  01 V00-R00-PROC                         PIC X(132).             046200      
000413*                                                                 046300      
000414  FD FILE-AM                                                      046310      
000415*================                                                 046320      
000416*   VALUE OF AREAS IS 1000                                        046330      
000417*   VALUE OF AREASIZE IS 6000                                     046340      
000418    BLOCK CONTAINS 90 RECORDS.                                    046350      
000419  01 REG-ACT-FIJO                         PIC X(142).             046370      
000420                                                                  046380      
000421 WORKING-STORAGE SECTION.                                         046400      
000422*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000423* COPY "S151/CRONOS2K/CPY/WS".                                    046500      
000424******************************************************************000100      
000425** This copyBook defines all the additional variables that      **000200      
000426** Unisys has defined for the CRONOS2K project                  **000300      
000427** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000428******************************************************************000500      
000429                                                                  000600      
000430******************************************************************000700      
000431** These Variables are used to Accept the system date in long   **000800      
000432** format and get the century information                       **000900      
000433** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000434 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000435 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000436    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000437    05 FILLER      PIC X(1).                                      001400      
000438    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000439    05 FILLER      PIC X(1).                                      001600      
000440    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000441    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000442      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000443      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000444******************************************************************002100      
000445                                                                  002200      
000446******************************************************************002300      
000447** This variable defines a date in the format MMDDCCAA          **002400      
000448**                                                              **002500      
000449 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000450 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000451    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000452    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000453    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000454    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000455      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000456      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000457******************************************************************003400      
000458                                                                  003500      
000459******************************************************************003600      
000460** This variable defines a date in the format CCAAMMDD          **003700      
000461**                                                              **003800      
000462 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000463 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000464    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000465    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000466      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000467      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000468    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000469    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000470******************************************************************004700      
000471                                                                  004800      
000472******************************************************************004900      
000473** This variable defines a date in the format DDMMCCAA          **005000      
000474**                                                              **005100      
000475 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000476 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000477    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000478    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000479    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000480    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000481      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000482      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000483******************************************************************006000      
000484                                                                  006100      
000485******************************************************************006200      
000486** This variable defines a date in the Julian Format CCAADDD    **006300      
000487**                                                              **006400      
000488 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000489 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000490    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000491    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000492                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000493      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000494      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000495    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000496******************************************************************007300      
000497                                                                  007400      
000498******************************************************************007500      
000499** This variable defines a date in the format AAMMDD            **007600      
000500**                                                              **007700      
000501 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000502 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000503    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000504    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000505    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000506******************************************************************008300      
000507                                                                  008400      
000508******************************************************************008500      
000509** This variable defines a date in the format MMDDAA            **008600      
000510**                                                              **008700      
000511 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000512 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000513    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000514    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000515    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000516******************************************************************009300      
000517                                                                  009400      
000518******************************************************************009500      
000519** This variable defines a date in the format DDMMAA            **009600      
000520**                                                              **009700      
000521 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000522 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000523    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000524    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000525    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000526******************************************************************010300      
000527                                                                  010400      
000528******************************************************************010500      
000529** These variables are defined to be used for CALL bridge logic **010600      
000530**                                                              **010700      
000531 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000532 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000533 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000534 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000535 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000536 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000537******************************************************************011400      
000538                                                                  011500      
000539******************************************************************011600      
000540** This variable is used for converting only a year field AA to **011700      
000541** CCAA and a CCAA to AA                                        **011800      
000542 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000543 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000544    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000545    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000546 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000547 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000548******************************************************************012300      
000549                                                                  012400      
000550******************************************************************012500      
000551** These variables are Bridge Variables for Intercambio files   **012600      
000552** para EDOCTA                                                  **012700      
000553 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000554 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000555 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000556 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000557 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000558 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000559 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000560******************************************************************013500      
000561* Para MODULO                                                     013600      
000562 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000563******************************************************************013800      
000564******************************************************************013900      
000565** Para FMOVSCHABO                                                014000      
000566 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000567******************************************************************014200      
000568                                                                  014300      
000569******************************************************************014400      
000570***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000571******************************************************************014600      
000572                                                                  014700      
000573 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000574 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000575     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000576     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000577     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000578******************************************************************015300      
000579                                                                  015400      
000580******************************************************************015500      
000581***  These Variables Are Defined For Date In AAMM Format       ***015600      
000582******************************************************************015700      
000583                                                                  015800      
000584 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000585 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000586     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000587     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000588******************************************************************016300      
000589                                                                  016400      
000590                                                                  016500      
000591*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000592 01  A2K-BASE-YEAR                PIC 9(02) VALUE 50.             046600      
000593*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000594* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         046700      
000595*================================================================ 000100      
000596*         ENTRY-POINT CONSISDIA :                               = 000200      
000597*                                                                 000300      
000598* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000599* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000600* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000601* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000602* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000603* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000604* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000605* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000606* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000607* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000608*                                                               = 001400      
000609*================================================================ 001500      
000610                                                                  001600      
000611                                                                  001700      
000612*================================================================ 001800      
000613* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000614*                                                               = 002000      
000615* ENTRADA REQUERIDA :                                           = 002100      
000616*                                                               = 002200      
000617*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000618*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000619*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000620*================================================================ 002600      
000621 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000622    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000623    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000624    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000625    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000626    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000627    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000628    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000629    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000630    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000631    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000632    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000633    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000634    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000635    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000636    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000637    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000638    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000639    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000640    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000641    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000642       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000643       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000644       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000645       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000646*==============================================================   005200      
000647*                                                             =   005300      
000648* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000649*                                                             =   005500      
000650* CAMPOS REQUERIDOS :                                         =   005600      
000651*                                                             =   005700      
000652* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000653* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000654* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000655* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000656*==============================================================   006200      
000657 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000658    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000659    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000660    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000661    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000662                                                                  006800      
000663*==============================================================   006900      
000664*                                                             =   007000      
000665* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000666*                                                             =   007200      
000667* CAMPOS REQUERIDOS :                                         =   007300      
000668*                                                             =   007400      
000669* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000670* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000671* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000672* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000673*==============================================================   007900      
000674 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000675    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000676    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000677    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000678    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000679                                                                  008500      
000680*==============================================================   008600      
000681*                                                             =   008700      
000682* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000683*                                                             =   008900      
000684* CAMPOS REQUERIDOS :                                         =   009000      
000685*                                                             =   009100      
000686* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000687* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000688* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000689* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000690*==============================================================   009600      
000691 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000692    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000693    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000694    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000695    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000696                                                                  010200      
000697*============================================================     010300      
000698* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000699*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000700*                                                           =     010600      
000701*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000702*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000703*                                                           =     010900      
000704*  ENTRADA REQUERIDA.                                       =     011000      
000705*                                                           =     011100      
000706*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000707*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000708*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000709*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000710*============================================================     011600      
000711                                                                  011700      
000712 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000713     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000714     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000715     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000716     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000717                                                                  012300      
000718*=============================================================    012400      
000719*                                                            =    012500      
000720* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000721*             B01-SIS-FECARMOV.                              =    012700      
000722*                                                            =    012800      
000723* ENTRADA REQUERIDAD :                                       =    012900      
000724*                                                            =    013000      
000725*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000726*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000727*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000728*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000729*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000730*=============================================================    013600      
000731                                                                  013700      
000732 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000733     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000734     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000735     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000736     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000737     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000738*================================================================ 014400      
000739*                                                               = 014500      
000740* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000741*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000742*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000743*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000744*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000745*                                                               = 015100      
000746* ENTRADA REQUERIDA :                                           = 015200      
000747*                                                               = 015300      
000748* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000749* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000750* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000751* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000752* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000753*================================================================ 015900      
000754 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000755    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000756    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000757    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000758    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000759    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000760                                                                  016600      
000761*============================================================     016700      
000762*                                                           =     016800      
000763* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000764*                                                           =     017000      
000765* DATOS REQUERIDOS :                                        =     017100      
000766*                                                           =     017200      
000767* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000768* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000769* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000770* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000771* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000772*============================================================     017800      
000773                                                                  017900      
000774 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000775     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000776     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000777     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000778     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000779     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000780                                                                  018600      
000781*============================================================     018700      
000782*                                                           =     018800      
000783* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000784*                                                           =     019000      
000785* DATOS REQUERIDOS :                                        =     019100      
000786*                                                           =     019200      
000787* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000788* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000789* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000790* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000791* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000792*============================================================     019800      
000793                                                                  019900      
000794 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000795     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000796     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000797     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000798     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000799     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000800                                                                  020600      
000801*===============================================================  020700      
000802*                                                              =  020800      
000803* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000804*              MOVIMIENTOS.                                    =  021000      
000805* DATOS REQUERIDOS :                                           =  021100      
000806*                                                              =  021200      
000807* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000808* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000809* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000810* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000811* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000812* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000813*==============================================================   021900      
000814                                                                  022000      
000815 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000816     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000817     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000818     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000819     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000820     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000821     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000822*==============================================================   022800      
000823*                                                             =   022900      
000824* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000825*                                                             =   023100      
000826* CAMPOS REQUERIDOS :                                         =   023200      
000827*                                                             =   023300      
000828* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000829* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000830* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000831* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000832*==============================================================   023800      
000833 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000834    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000835    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000836    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000837    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000838                                                                  024304      
000839*=================================================================024306      
000840*                ENTRY POINT CONSISB01                           =024308      
000841*                                                                =024310      
000842*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000843*                                                                =024314      
000844*  FUNCIONES DISPONIBLES :                                       =024316      
000845*                                                                =024318      
000846*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000847*                                                                =024322      
000848*  PARAMETROS REQUERIDOS                                         =024324      
000849*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000850*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000851*=================================================================024330      
000852                                                                  024332      
000853 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000854     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000855     03 WKS-CON-CSI                PIC 9(02).                     024336      
000856     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000857     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000858        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000859        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000860        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000861        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000862        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000863                                                                  024400      
000864*=================================================================024500      
000865*                ENTRY POINT B02ARCINTER                         =024600      
000866*                                                                =024700      
000867*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000868*                                                                =024900      
000869*  FUNCIONES DISPONIBLES :                                       =025000      
000870*                                                                =025100      
000871*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000872* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000873* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000874* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000875*                                                                =025600      
000876*  PARAMETROS REQUERIDOS                                         =025700      
000877*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000878*                                                                =025900      
000879*=================================================================026000      
000880 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000881     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000882     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000883     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000884     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000885     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000886     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000887     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000888     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000889     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000890     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000891     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000892     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000893     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000894     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000895     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000896     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000897     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000898     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000899     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000900     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000901     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000902     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000903     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000904     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000905     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000906     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000907     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000908     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000909                                                                  029000      
000910*=================================================================029100      
000911*                ENTRY POINT B04SISTEMA                          =029200      
000912*                                                                =029300      
000913*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000914*                                                                =029500      
000915*  FUNCIONES DISPONIBLES :                                       =029600      
000916*                                                                =029700      
000917*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000918*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000919*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000920*                                                                =030100      
000921*  PARAMETROS REQUERIDOS                                         =030200      
000922*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000923*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000924*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000925*                                                                =030600      
000926*=================================================================030700      
000927 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000928     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000929     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000930     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000931     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000932     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000933     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000934     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000935                                                                  031600      
000936*================================================================ 031700      
000937*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000938*                                                               = 031900      
000939*  FUNCION                                                      = 032000      
000940*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000941*   19       ALTAS.                                             = 032200      
000942*   22       BAJAS                                              = 032300      
000943*   37       CAMBIOS.                                           = 032400      
000944*                                                               = 032500      
000945*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000946*                      FECHA DE PROCESO                         = 032700      
000947*                      NUMERO DE PROCESO                        = 032800      
000948*                      FECHA INICIO                             = 032900      
000949*                      REGISTRO INICIAL                         = 033000      
000950*================================================================ 033100      
000951                                                                  033200      
000952 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000953     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000954     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000955     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000956     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000957     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000958     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000959     03 WKS-B05-MIX                PIC 9(08).                     034000      
000960     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000961     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000962     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000963     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000964     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000965     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000966                                                                  034700      
000967                                                                  034800      
000968*================================================================ 034900      
000969*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000970*                                                               = 035100      
000971*  FUNCION                                                      = 035200      
000972*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000973*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000974*                                                               = 035500      
000975*================================================================ 035600      
000976                                                                  035700      
000977 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000978     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000979     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000980     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000981     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000982     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000983     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000984                                                                  036500      
000985*===============================================================  036600      
000986*                                                              =  036700      
000987*         ENTRY-POINT CONSISMEN                                =  036800      
000988*                                                              =  036900      
000989*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000990*                      SISTEMA                                 =  037100      
000991*                                                              =  037200      
000992*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000993*                                                              =  037400      
000994*===============================================================  037500      
000995 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000996     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000997     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000998     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000999     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
001000     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
001001     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
001002     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
001003     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
001004     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
001005     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
001006     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
001007     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
001008     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
001009     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
001010     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
001011        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
001012        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
001013        05 WKS-B03-AAMM            PIC 9(06).                     039402      
001014        05 WKS-B03-SECOK           PIC 9(10).                     039500      
001015        05 WKS-B03-SECINF          PIC 9(10).                     039600      
001016        05 WKS-B03-SECERR          PIC 9(10).                     039700      
001017        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
001018                                                                  039900      
001019*=====================================================            040000      
001020*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
001021*=====================================================            040200      
001022 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
001023     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
001024     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
001025     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
001026                                                                  040700      
001027*=====================================================            040800      
001028*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
001029*=====================================================            041000      
001030 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
001031     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
001032     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
001033     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
001034                                                                  041500      
001035*=====================================================            041600      
001036*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
001037*=====================================================            041800      
001038 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
001039     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
001040     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
001041     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
001042*=====================================================            042300      
001043*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
001044*=====================================================            042500      
001045 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
001046     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
001047     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
001048     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
001049                                                                  043000      
001050*=====================================================            043100      
001051*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
001052*=====================================================            043300      
001053 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
001054     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
001055     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
001056     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
001057                                                                  043800      
001058*=====================================================            043900      
001059*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
001060*=====================================================            044100      
001061 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
001062     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
001063     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
001064     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
001065                                                                  044600      
001066*=====================================================            044700      
001067*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
001068*=====================================================            044900      
001069 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
001070     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
001071     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
001072     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
001073                                                                  045400      
001074*=====================================================            045500      
001075*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
001076*=====================================================            045700      
001077 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
001078     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
001079     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
001080     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
001081                                                                  046200      
001082*=====================================================            046300      
001083*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
001084*=====================================================            046500      
001085 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
001086     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
001087     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
001088     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
001089                                                                  047000      
001090*=====================================================            047100      
001091*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
001092*=====================================================            047300      
001093 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
001094     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
001095     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
001096     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001097                                                                  047800      
001098*=====================================================            047900      
001099*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001100*=====================================================            048100      
001101 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001102     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001103     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001104     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001105                                                                  048600      
001106*=====================================================            048700      
001107*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001108*=====================================================            048900      
001109 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001110     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001111     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001112     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001113                                                                  049400      
001114*=====================================================            049500      
001115*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001116*=====================================================            049700      
001117 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001118     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001119     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001120     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001121     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001122     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001123     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001124     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001125     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001126     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001127     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001128                                                                  050900      
001129*=====================================================            051000      
001130*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001131*=====================================================            051200      
001132 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001133     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001134     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001135     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001136     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001137                                                                  051800      
001138*=====================================================            051900      
001139*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001140*=====================================================            052100      
001141 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001142     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001143     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001144     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001145     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001146                                                                  052700      
001147*=====================================================            052800      
001148*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001149*=====================================================            053000      
001150 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001151     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001152     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001153     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001154     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001155                                                                  053600      
001156*=====================================================            053700      
001157*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001158*=====================================================            053900      
001159 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001160     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001161     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001162     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001163     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001164                                                                  054500      
001165*=====================================================            054600      
001166*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001167*=====================================================            054800      
001168 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001169     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001170     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001171     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001172     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001173                                                                  055400      
001174*=====================================================            055500      
001175*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001176*=====================================================            055700      
001177 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001178     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001179     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001180     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001181     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001182                                                                  056300      
001183*=====================================================            056400      
001184*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001185*=====================================================            056600      
001186 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001187     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001188     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001189     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001190     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001191                                                                  057200      
001192 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001193*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001194*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001195* COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS ON CMEMP.".             046800      
001196                                                                  000100      
001197******************************************************************000200      
001198**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
001199**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
001200**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
001201******************************************************************000600      
001202                                                                  000700      
001203 01 A00-R00-HDR-MOV .                                             000800      
001204    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
001205    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
001206    02 FILLER                          PIC  X(08).                001100      
001207    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
001208    02 FILLER                          PIC  X(430).               001300      
001209                                                                  001400      
001210 01 A00-R01-REGMOV .                                              001500      
001211    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
001212    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
001213    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
001214                                                                  001900      
001215    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
001216    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
001217                                       PIC  9(04)      COMP.      002200      
001218    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
001219                                       PIC  9(04)      COMP.      002400      
001220                                                                  002500      
001221    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
001222    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
001223                                       PIC  9(02)      COMP.      002800      
001224    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
001225                                       PIC  9(02)      COMP.      003000      
001226    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
001227    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
001228                                       A00-R01-SERVICIO-ALERTA.   003060      
001229       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
001230       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
001231    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
001232    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
001233    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
001234                                       PIC  9(04)      COMP.      003420      
001235    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
001236    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
001237                                       PIC  9(04)      COMP.      003520      
001238    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
001239    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
001240    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
001241                                       PIC  9(02)      COMP.      003900      
001242                                                                  004000      
001243    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
001244    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
001245       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
001246          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
001247          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
001248          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
001249          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
001250          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
001251          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
001252          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
001253                                                                  005100      
001254    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
001255       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
001256       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
001257       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
001258       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
001259       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
001260       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
001261       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
001262                                                                  006000      
001263       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
001264       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
001265       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
001266       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
001267       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
001268       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
001269       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
001270                                                                  006800      
001271       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
001272       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
001273       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
001274       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
001275       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
001276       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
001277       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
001278                                                                  007600      
001279       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
001280       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
001281       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
001282       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
001283       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
001284       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
001285       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
001286                                                                  008400      
001287       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
001288       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
001289       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
001290       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
001291       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
001292       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
001293       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
001294                                                                  009200      
001295    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
001296    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
001297    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
001298    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
001299    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
001300    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
001301       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
001302    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
001303    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
001304    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
001305    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
001306    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
001307    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
001308    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
001309    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
001310       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
001311       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
001312    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
001313    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
001314    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
001315    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
001316    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
001317    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
001318    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
001319    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
001320    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
001321    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
001322    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
001323    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
001324    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
001325    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
001326                                       PIC X(10).                 012600      
001327    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
001328       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
001329       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
001330    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
001331    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
001332    03 A00-R01-FILIAL                  PIC  X(05).                013200      
001333    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
001334       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
001335       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
001336                                                                  013300      
001337    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
001338    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
001339                                       PIC  X(09).                013600      
001340    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
001341                                       PIC  9(18)      COMP.      013800      
001342    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
001343    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
001344                                       PIC  X(9).                 014100      
001345    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
001346    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
001347                                       PIC  X(05).                014400      
001348    03 A00-R01-NIO                     PIC  X(16).                014500      
001349    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
001350    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
001351    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
001352       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
001353    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
001354    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
001355       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
001356    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
001357    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
001358    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
001359    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
001360    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
001361    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
001362                                       PIC  X(04).                015900      
001363    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
001364    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
001365    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
001366                                       PIC  9(04)      COMP.      016300      
001367    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
001368    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
001369    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
001370    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
001371    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
001372                                                                  016900      
001373    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
001374    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
001375       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
001376    03 A00-R01-FILXAPL                 PIC X(165).                017300      
001377                                                                  017400      
001378    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
001379       05 FILLER                       PIC X(96).                 017510      
001380       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
001381       05 FILLER                       PIC X(67).                 017700      
001382                                                                  017702      
001383    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
001384       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
001385       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
001386       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
001387       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
001388       06 WKS-MOV-FILS084              PIC X(154).                017714      
001389                                                                  017800      
001390    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
001391       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
001392       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
001393       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
001394       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
001395       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
001396       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
001397       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
001398       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
001399       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018160      
001400       05 FILLER                       PIC X(62).                 018170      
001401       05 A00-R01-CTE-087              PIC X(07).                 018210      
001402       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
001403          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
001404          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
001405          07 FILLER                    PIC X(01).                 018281      
001406       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
001407       05 FILLER                       PIC X(61).                 018400      
001408                                                                  018500      
001409    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
001410       05 FILLER                       PIC  X(96).                018610      
001411       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
001412       05 FILLER                       PIC  X(65).                018630      
001413                                                                  018640      
001414    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
001415       05 A00-R01-FORMATO0             PIC  9(02).                018700      
001416       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
001417       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
001418       05 FILLER                       PIC  X(141).               018910      
001419                                                                  019100      
001420    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
001421       05 A00-R01-FORMATO1             PIC  9(02).                019300      
001422       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
001423       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
001424       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
001425       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
001426       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
001427       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
001428       05 A00-R01-ENTSAL               PIC  X(01).                020000      
001429       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
001430       05 FILLER                       PIC  X(69).                020200      
001431                                                                  020300      
001432    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
001433       05 A00-R01-FORMATO2             PIC  9(02).                020500      
001434       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
001435       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
001436       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
001437       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
001438       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
001439       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
001440       05 FILLER                       PIC  X(77).                021200      
001441                                                                  021300      
001442    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
001443       05 A00-R01-FORMATO3             PIC  9(02).                021500      
001444       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
001445       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
001446       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
001447       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
001448       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
001449       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
001450       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
001451       05 FILLER                       PIC  X(69).                022300      
001452                                                                  022400      
001453    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
001454       05 A00-R01-FORMATO4             PIC  9(02).                022600      
001455       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
001456       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
001457       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
001458       05 A00-R01-RFCFT04              PIC  X(13).                023000      
001459       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
001460       05 A00-R01-DIRECCION            PIC  X(40).                023200      
001461       05 FILLER                       PIC  X(85).                023300      
001462                                                                  023400      
001463    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
001464       05 A00-R01-COBERTURA            PIC  X(01).                023408      
001465       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
001466       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
001467       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
001468       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
001469       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
001470       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
001471       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
001472       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
001473       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
001474       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
001475       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
001476       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
001477       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
001478       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
001479       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
001480       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
001481       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
001482       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
001483       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
001484       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
001485       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
001486       05 FILLER                       PIC  X(05).                023492      
001487                                                                  023497      
001488    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
001489       05 A00-R01-4CEROS               PIC  9(04).                023600      
001490       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
001491       05 FILLER                       PIC  X(157).               023800      
001492                                                                  023900      
001493    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
001494       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
001495        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
001496       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
001497       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
001498       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
001499       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
001500       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
001501       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
001502       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
001503       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
001504       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
001505       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
001506       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
001507       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
001508       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
001509       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
001510       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
001511       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
001512       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
001513       05 A00-R01-FILLER               PIC  X(41).                025850      
001514       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
001515       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
001516       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
001517       05 A00-R01-INDPAGO              PIC  9(01).                026200      
001518       05 FILLER                       PIC  X(01).                026210      
001519       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
001520       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
001521       05 FILLER                       PIC  X(52).                026300      
001522                                                                  026400      
001523    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
001524       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
001525       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
001526       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
001527       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
001528       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
001529       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
001530       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
001531       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
001532       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
001533       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
001534       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
001535       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
001536       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
001537          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
001538          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
001539       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
001540       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
001541          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
001542       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
001543          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
001544       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
001545          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
001546       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
001547          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
001548       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
001549          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
001550       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
001551          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
001552       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
001553          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
001554       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
001555          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
001556       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
001557          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
001558       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
001559          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
001560          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
001561       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
001562       05 FILLER                       PIC X(01).                 030101      
001563       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
001564       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
001565       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
001566       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
001567       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
001568       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
001569       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
001570       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
001571          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
001572       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
001573       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
001574       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
001575       05 FILLER                       PIC X(14).                 030700      
001576                                                                  030800      
001577    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
001578       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
001579       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
001580       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
001581       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
001582       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
001583       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
001584       05 FILLER                       PIC  X(142).               031600      
001585                                                                  031700      
001586    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
001587       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
001588       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
001589       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
001590       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
001591       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
001592       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
001593       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
001594       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
001595       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
001596       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
001597          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
001598          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
001599          07 FILLER                    PIC  X(08).                032740      
001600       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
001601       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
001602       05 A00-R01-NOMORD               PIC  X(30).                033000      
001603       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
001604       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
001605       05 A00-R01-REF-CECO             PIC  X(07).                033500      
001606       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
001607       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
001608          A00-R01-NUM-ORD-PAGO.                                   033800      
001609          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
001610          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
001611                                                                  034100      
001612    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
001613       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
001614       05 A00-R01-RFC-S501             PIC  X(13).                034160      
001615       05 FILLER                       PIC  X(151).               034180      
001616                                                                  034190      
001617    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
001618       05 A00-R01-DATOS-S701           PIC X(116).                034300      
001619       05 A00-R01-PAG-SERV             REDEFINES                  034400      
001620                                       A00-R01-DATOS-S701.        034500      
001621          07 A00-R01-ID                PIC X(30).                 034600      
001622          07 A00-R01-FECREC            PIC 9(06).                 034700      
001623          07 A00-R01-REF1              PIC X(20).                 034800      
001624          07 A00-R01-REF2              PIC X(20).                 034900      
001625          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
001626          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
001627                                       A00-R01-TIPOPAGO.          035200      
001628             09 A00-R01-ESTAB          PIC 9(04).                 035300      
001629             09 A00-R01-SEQ            PIC 9(02).                 035400      
001630          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
001631          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
001632          07 A00-R01-EBPP              PIC 9(03).                 035700      
001633          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
001634          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
001635          07 FILLER                    PIC X(01).                 035728      
001636          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
001637          07 FILLER                    PIC X(18).                 035760      
001638       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
001639                                       A00-R01-DATOS-S701.        035900      
001640          07 A00-R01-RFC               PIC X(13).                 036000      
001641          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
001642          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
001643          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
001644          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
001645          07 FILLER                    PIC X(85).                 036200      
001646       05 FILLER                       PIC X(49).                 036300      
001647                                                                  036400      
001648    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
001649       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
001650       05 A00-R01-CTA-S702             PIC X(40).                 036700      
001651       05 FILLER                       PIC X(113).                036710      
001652                                                                  036720      
001653    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
001654       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
001655       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
001656       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
001657       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
001658       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
001659       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
001660       05 FILLER                       PIC X(72).                 036800      
001661                                                                  036810      
001662                                                                  036820      
001663    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
001664       05 A00-R01-TRUI-S711.                                      036915      
001665          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
001666          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
001667          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
001668           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
001669          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
001670       05 A00-R01-MICR-S711.                                      036945      
001671          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
001672          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
001673          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
001674          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
001675          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
001676          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
001677          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
001678          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
001679       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
001680       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
001681       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
001682       05 A00-R01-FIL-S711             PIC X(05).                 036965      
001683       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
001684       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
001685       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
001686                                                                  036990      
001687    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
001688       05 A00-R01-RFC-502              PIC  X(13).                037100      
001689       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
001690          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
001691          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
001692          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
001693          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
001694          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
001695          07 FILLER                    PIC  9(01) COMP.           037650      
001696       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
001697       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
001698       05 FILLER                       PIC  X(06).                038680      
001699                                                                  038682      
001700    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
001701       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
001702       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
001703       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
001704       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
001705       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
001706       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
001707       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
001708       05 FILLER                       PIC  X(81).                038750      
001709                                                                  038755      
001710    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
001711       05 A00-R01-COP                  PIC  9(13)        .        038900      
001712       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
001713       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
001714       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
001715       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
001716       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
001717       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
001718       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
001719       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
001720       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
001721       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
001722       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
001723       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
001724       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
001725       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
001726       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
001727       05 FILLER                       PIC  X(81)        .        040800      
001728                                                                  040810      
001729    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
001730       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
001731       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
001732       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
001733       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
001734       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
001735       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
001736       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
001737       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
001738       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
001739       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
001740       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
001741       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
001742       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
001743       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
001744       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
001745       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
001746       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
001747       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
001748       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
001749       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
001750       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
001751       05 FILLER                       PIC  X(18).                041040      
001752                                                                  041400      
001753    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
001754    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
001755*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001756*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001757* COPY "(S151)CITIDIRECT/S151/FORMATO/ARCHIVO/DATOSADIC ON CMEMP."046900      
001758 01 A01-R00-HDR-DES .                                             000100      
001759     03 A00-R00-HDR-HD                 PIC X(02).                 000200      
001760     03 A00-R00-HDR-FCH                PIC 9(08).                 000300      
001761     03 FILLER                         PIC X(530).                000400      
001762 01 A01-R01-DATOS.                                                000500      
001763     03 A01-R01-AUTS151ORI             PIC 9(08) COMP.            000600      
001764     03 A01-R01-DATOS-1.                                          000610      
001765        05 A01-R01-REF-BANAMEX         PIC X(26).                 000620      
001766        05 A01-R01-CVECON-YREFLOC REDEFINES                       000640      
001767           A01-R01-REF-BANAMEX         PIC X(26).                 000700      
001768        05 A01-R01-CVECON-Y-REFV REDEFINES A01-R01-REF-BANAMEX.   000800      
001769           07 A01-R01-CONT-ORIG        PIC 9(20) COMP.            000900      
001770           07 A01-R01-REFLOC-BNM       PIC X(12).                 001000      
001771           07 A01-R01-REFLOC-23POS REDEFINES A01-R01-REFLOC-BNM.  001100      
001772              09 A01-R01-COMPREF       PIC 9(01) COMP.            001200      
001773              09 A01-R01-REF23POS      PIC 9(23) COMP.            001250      
001774           07 A01-R01-REFALFA REDEFINES A01-R01-REFLOC-BNM        001270      
001775                                       PIC X(12).                 001290      
001776           07 FILLER                   PIC X(04).                 001300      
001777        05 A01-R01-REFLOC7-BNM REDEFINES A01-R01-REF-BANAMEX.     001400      
001778           07 FILLER                   PIC X(02).                 001500      
001779           07 A01-R01-LOC07BNM         PIC X(24).                 001600      
001780        05 A01-R01-NOMINA-FUN1         PIC 9(14) COMP.            003600      
001781        05 A01-R01-NOMINA-FUN2         PIC 9(14) COMP.            003700      
001782        05 A01-R01-SDO-FIN.                                       003720      
001783           07 A01-R01-SDO-FIN-S500     PIC S9(15)V99 COMP.        003740      
001784           07 FILLER                   PIC X(05).                 003760      
001785        05 A01-R01-NOMINAS-MC REDEFINES A01-R01-SDO-FIN.          003780      
001786           07 A01-R01-NOM-MAKER        PIC 9(14) COMP.            003800      
001787           07 A01-R01-NOM-CHECKER      PIC 9(14) COMP.            003900      
001788        05 A01-R01-REF-CLIENTE         PIC X(16).                 004000      
001789        05 A01-R01-REFERENCIA1         PIC X(35).                 004100      
001790        05 A01-R01-REFERENCIA1-S500 REDEFINES A01-R01-REFERENCIA1.004110      
001791           07 A01-R01-ORIG-HRAMOV      PIC 9(06).                 004120      
001792           07 A01-R01-ORIG-FECMOV      PIC 9(06).                 004130      
001793           07 A01-R01-ORIG-FOLIO       PIC X(12).                 004140      
001794           07 A01-R01-ORIG-MDE         PIC 9(02).                 004150      
001795           07 A01-R01-ORIG-FILREF1     PIC X(09).                 004160      
001796        05 A01-R01-REF2-CTE            PIC X(35).                 004200      
001797        05 A01-R01-REF3-CTE            PIC X(35).                 004300      
001798        05 A01-R01-REF4-CTE            PIC X(35).                 004400      
001799        05 A01-R01-DATOS-2.                                       004450      
001800           07 A01-R01-LEY1             PIC X(40).                 004500      
001801           07 A01-R02-LEY2             PIC X(40).                 004600      
001802           07 A01-R02-LEY3             PIC X(40).                 004700      
001803           07 A01-R02-LEY4             PIC X(40).                 004800      
001804           07 A01-R02-LEY5             PIC X(40).                 004900      
001805           07 A01-R01-FILXAPL          PIC X(120).                004910      
001806           07 A01-R01-FILXAPL-S203 REDEFINES A01-R01-FILXAPL.     004912      
001807              09 A01-R01-CVE-IMPTO10   PIC 9(06).                 004914      
001808              09 A01-R01-FORMA-PAG10   PIC 9(03).                 004916      
001809              09 A01-R01-IMP-IMPTO10   PIC 9(12).                 004918      
001810              09 A01-R01-CVE-IMPTO11   PIC 9(06).                 004920      
001811              09 A01-R01-FORMA-PAG11   PIC 9(03).                 004922      
001812              09 A01-R01-IMP-IMPTO11   PIC 9(12).                 004924      
001813              09 A01-R01-CVE-IMPTO12   PIC 9(06).                 004926      
001814              09 A01-R01-FORMA-PAG12   PIC 9(03).                 004928      
001815              09 A01-R01-IMP-IMPTO12   PIC 9(12).                 004930      
001816              09 A01-R01-CVE-IMPTO13   PIC 9(06).                 004932      
001817              09 A01-R01-FORMA-PAG13   PIC 9(03).                 004934      
001818              09 A01-R01-IMP-IMPTO13   PIC 9(12).                 004936      
001819              09 A01-R01-CVE-IMPTO14   PIC 9(06).                 004938      
001820              09 A01-R01-FORMA-PAG14   PIC 9(03).                 004940      
001821              09 A01-R01-IMP-IMPTO14   PIC 9(12).                 004942      
001822              09 FILLER                PIC X(15).                 004944      
001823                                                                  004946      
001824*          07 A01-R01-FILXAPL-S711 REDEFINES A01-R01-FILXAPL.     004948      
001825*             09 A01-R01-TRUI-S711.                               004949      
001826*                11 A01-R01-CSIREC-S711 PIC 9(08) COMP.           004950      
001827*                11 A01-R01-CSIOR-S711  PIC 9(08) COMP.           004951      
001828*                11 A01-R01-NUMOP-S711  PIC 9(08) COMP.           004952      
001829*                11 A01-R01-NUMTR-S711  PIC 9(08) COMP.           004953      
001830*                11 A01-R01-INSMN-S711  PIC 9(02) COMP.           004954      
001831*             09 A01-R01-MICR-S711.                               004955      
001832*                11 A01-R01-CODSEG-S711 PIC 9(04) COMP.           004956      
001833*                11 A01-R01-VERPRE-S711 PIC 9(02) COMP.           004957      
001834*                11 A01-R01-CTRMON-S711 PIC 9(02) COMP.           004958      
001835*                11 A01-R01-PLCEC-S711  PIC 9(04) COMP.           004959      
001836*                11 A01-R01-BNCEM-S711  PIC 9(04) COMP.           004960      
001837*                11 A01-R01-DVEIN-S711  PIC 9(02) COMP.           004961      
001838*                11 A01-R01-CTACH-S711  PIC 9(12) COMP.           004962      
001839*                11 A01-R01-REFCH-S711  PIC 9(08) COMP.           004963      
001840*             09 A01-R01-CTABEN-S711    PIC 9(20) COMP.           004964      
001841*             09 A01-R01-BCREC-S711     PIC 9(04) COMP.           004965      
001842*             09 A01-R01-NOMBEN-S711    PIC X(40).                004966      
001843*             09 A01-R01-RFCBCO-S711    PIC X(13).                004967      
001844*             09 A01-R01-FILLER-S711    PIC X(19).                004968      
001845                                                                  004969      
001846           07 A01-R01-FILXAPL-S701 REDEFINES A01-R01-FILXAPL.     004970      
001847              09 A01-R01-NVAAUT-S701   PIC 9(08).                 004971      
001848              09 A01-R01-NVASUCTR-S701 PIC 9(04).                 004972      
001849              09 A01-R01-NVACAJTR-S701 PIC 9(02).                 004973      
001850              09 A01-R01-NVAFECT-S701  PIC 9(08).                 004974      
001851              09 A01-R01-NVOMDPA-S701  PIC 9(02).                 004975      
001852              09 A01-R01-NVALINC-S701  PIC X(30).                 004976      
001853              09 A01-R01-FILLER2-S701  PIC X(66).                 004977      
001854                                                                  004978      
001855           07 A01-R01-FILXAPL-S702 REDEFINES A01-R01-FILXAPL.     004979      
001856              09 A01-R01-STTRAN-S702   PIC 9(01).                 004980      
001857              09 A01-R01-CTEEMI-S702   PIC 9(12) COMP.            004981      
001858              09 A01-R01-CTADES-S702   PIC 9(20) COMP.            004982      
001859              09 A01-R01-IDEORI-S702   PIC 9(01).                 004983      
001860              09 A01-R01-IDEDES-S702   PIC 9(01).                 004984      
001861              09 A01-R01-TCTAEM-S702   PIC 9(02) COMP.            004985      
001862              09 A01-R01-TIARCH-S702   PIC X(01).                 004986      
001863              09 A01-R01-FECARC-S702   PIC 9(08) COMP.            004987      
001864              09 A01-R01-SECARC-S702   PIC 9(02) COMP.            004988      
001865              09 A01-R01-AUTORI-S702   PIC 9(20) COMP.            004989      
001866              09 A01-R01-NOMUSU-S702   PIC X(40).                 004990      
001867              09 A01-R01-TCTAUS-S702   PIC 9(02) COMP.            004991      
001868              09 A01-R01-SUCCON-S702   PIC 9(04) COMP.            004992      
001869              09 A01-R01-CAJCON-S702   PIC 9(04) COMP.            004993      
001870              09 A01-R01-FILLER-S702   PIC X(39).                 004994      
001871                                                                  004995      
001872           07 A01-R01-FILXAPL-S500 REDEFINES A01-R01-FILXAPL.     004996      
001873              09 A01-R01-NOMB-CTE          PIC  X(36).            004997      
001874              09 A01-R01-NOMB-BENEF        PIC  X(50).            004998      
001875              09 A01-R01-CVE-RASTREO-S500  PIC  X(30).            004999      
001876* INI VML                                                         005000      
001877              09 A01-R01-CVE-RASTREO-S500-R REDEFINES             005001      
001878                              A01-R01-CVE-RASTREO-S500.           005002      
001879                 11 A01-R01-TIP-CTA-TRASP  PIC 9(02).             005004      
001880                 11 A01-R01-BCO-CTA-TRASP  PIC 9(05).             005006      
001881                 11 A01-R01-NUM-CTA-TRASP  PIC 9(18).             005007      
001882                 11 A01-R01-FILLER-TRASP   PIC X(05).             005008      
001883* FIN VML                                                         005009      
001884              09 A01-R01-FECHA-PAGO        PIC  9(08)     COMP.   005010      
001885        05 A01-R01-DATOS-2-S264 REDEFINES A01-R01-DATOS-2.        005012      
001886           07 A01-R01-NOMINA-FUN3      PIC 9(14) COMP.            005014      
001887           07 A01-R01-COMISION         PIC 9(10)V99 COMP.         005016      
001888           07 A01-R01-SITUACION        PIC 9(10)V99 COMP.         005018      
001889           07 A01-R01-IVA-COMIS        PIC 9(08)V99 COMP.         005020      
001890           07 A01-R01-IVA-SITUACION    PIC 9(08)V99 COMP.         005022      
001891           07 A01-R01-IVA-FISCAL       PIC 9(12)V99 COMP.         005024      
001892           07 A01-R01-FOLIO-RECEP      PIC 9(10) COMP.            005026      
001893           07 A01-R01-OCUPACION        PIC X(40).                 005028      
001894           07 A01-R01-POBLACION        PIC X(40).                 005030      
001895           07 A01-R01-TIPO-CTA         PIC 9(02) COMP.            005032      
001896           07 A01-R01-NUM-CTE          PIC 9(12) COMP.            005034      
001897           07 A01-R01-NUM-CTA          PIC 9(20) COMP.            005036      
001898           07 A01-R01-CVE-TIPO-IDEN    PIC 9(02) COMP.            005038      
001899           07 A01-R01-NUM-IDEN-OFIC    PIC X(18).                 005040      
001900           07 A01-R01-FECHA-NAC-BEN    PIC 9(08) COMP.            005042      
001901           07 A01-R01-DOMICILIO        PIC X(55).                 005044      
001902           07 A01-R01-COLONIA          PIC X(30).                 005046      
001903           07 A01-R01-TELEFONO         PIC X(10).                 005048      
001904           07 A01-R01-COD-POS          PIC 9(06) COMP.            005050      
001905           07 A01-R01-REF-EMISOR       PIC X(20).                 005052      
001906           07 A01-R01-PIN              PIC 9(12) COMP.            005054      
001907           07 A01-R01-TIPO-CHQ-ORD     PIC 9(02) COMP.            005056      
001908           07 A01-R01-FECHA-EVENTO     PIC 9(08) COMP.            005058      
001909           07 A01-R01-CVE-RASTREO-S264 PIC X(30).                 005060      
001910     03 A01-R01-DATOS-1-R    REDEFINES A01-R01-DATOS-1.           005062      
001911        05 A01-R01-SUB-STA-DOC         PIC 9(02) COMP.            005064      
001912        05 A01-R01-SUC-DESTINO         PIC 9(04) COMP.            005066      
001913        05 A01-R01-TIPO-PREV           PIC X(01).                 005068      
001914        05 A01-R01-CAUSA-CAN-DEV       PIC 9(04) COMP.            005070      
001915        05 A01-R01-NVO-BCO-ORI         PIC 9(06) COMP.            005072      
001916        05 A01-R01-NVO-BCO-DES         PIC 9(06) COMP.            005074      
001917        05 A01-R01-NOM-BENEF-IDEN      PIC X(55).                 005076      
001918        05 A01-R01-NVO-NOM-BENEF       PIC X(55).                 005078      
001919        05 A01-R01-RFC-CURP-BENEF      PIC X(18).                 005080      
001920        05 A01-R01-GTOS-ORD-PAGO       PIC 9(16)V99 COMP.         005082      
001921        05 A01-R01-TIPO-PAGO-CECO      PIC 9(02) COMP.            005084      
001922        05 A01-R01-TIPO-PAGO-SPEI      PIC 9(02) COMP.            005086      
001923        05 A01-R01-TIPO-CONVENIO       PIC 9(02) COMP.            005088      
001924        05 A01-R01-PZA-EDO             PIC 9(06) COMP.            005090      
001925        05 A01-R01-TIPO-CTA-ABO        PIC 9(02) COMP.            005092      
001926        05 A01-R01-NUM-CTE-ABO         PIC 9(12) COMP.            005094      
001927        05 A01-R01-NUM-CTA-ABO         PIC 9(20) COMP.            005096      
001928        05 FILLER                      PIC X(358).                005098      
001929                                                                  005100      
001930     03 A01-R01-DATOS-2-S500 REDEFINES A01-R01-DATOS-1.           005102      
001931        05 A01-R01-TRUI.                                          005104      
001932           07 A01-R01-CSIID-RECEPTOR   PIC 9(08) COMP.            005106      
001933           07 A01-R01-CSIID-ORIGEN     PIC 9(08) COMP.            005108      
001934           07 A01-R01-NUM-OPERACION    PIC 9(08) COMP.            005110      
001935           07 A01-R01-NUM-TRANSACCI    PIC 9(08) COMP.            005112      
001936           07 A01-R01-INST-MONETARIO   PIC 9(02) COMP.            005114      
001937        05 A01-R01-MICR.                                          005116      
001938           07 A01-R01-COD-SEGURIDAD    PIC 9(04) COMP.            005118      
001939           07 A01-R01-VER-PREMARCADO   PIC 9(02) COMP.            005120      
001940           07 A01-R01-COD-TRANSMONE    PIC 9(02) COMP.            005122      
001941           07 A01-R01-PLAZA-CECOBAN    PIC 9(04) COMP.            005124      
001942           07 A01-R01-COD-BCOEMISOR    PIC 9(04) COMP.            005126      
001943           07 A01-R01-DIG-VINTERCAM    PIC 9(02) COMP.            005128      
001944           07 A01-R01-NUM-CTACHEQUE    PIC 9(12) COMP.            005130      
001945           07 A01-R01-NUM-REFCHEQUE    PIC 9(08) COMP.            005132      
001946        05 A01-R01-CTA-BENEFOTROBCO    PIC 9(20) COMP.            005134      
001947        05 A01-R01-BCO-RECEPOTROBCO    PIC 9(04) COMP.            005136      
001948        05 A01-R01-NOM-BENEFOTROBCO    PIC X(40).                 005138      
001949        05 A01-R01-RFC-OTROBCO         PIC X(13).                 005140      
001950        05 A01-R01-NOMPAN-S500         PIC X(05).                 005142      
001951        05 A01-R01-OPCPAN-S500         PIC X(01).                 005144      
001952        05 A01-R01-NUMCTO1-S500        PIC 9(16) COMP.            005146      
001953        05 A01-R01-NUMCTO2-S500        PIC 9(16) COMP.            005148      
001954        05 A01-R01-NUMCTO3-S500        PIC 9(16) COMP.            005150      
001955        05 A01-R01-INDIC-EST           PIC 9(08) COMP.            005152      
001956        05 A01-R01-FILLER-DATOS2-S500  PIC X(395).                005160      
001957                                                                  005170      
001958     03 FILLER                         PIC X(01).                 005198      
001959     03 A01-R01-APUDES                 PIC 9(08) COMP.            005200      
001960     03 A01-R01-TIPREG                 PIC 9(02) COMP.            005300      
001961                                                                  005400      
001962*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001963*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001964* COPY "(S151)S151/FORMATO/ARCHIVO/S028 ON CMEMP.".               047000      
001965                                                                  001028      
001966*=================================================================002028      
001967*==       REGISTRO DEL ARCHIVO DE INTERFASE PARA S028           ==003028      
001968*=================================================================004028      
001969 01 A00-R00-HDR-S028.                                             005028      
001970    02 A00-R00-S028-CVE-REG        PIC X(02).                     006028      
001971    02 A00-R00-S028-FCH-PROC       PIC 9(06).                     007028      
001972    02 A00-R00-S028-FCH-PROC-R    REDEFINES A00-R00-S028-FCH-PROC.008028      
001973       03 A00-R00-S028-DIA-PROC    PIC 9(02).                     009028      
001974       03 A00-R00-S028-MES-PROC    PIC 9(02).                     010028      
001975       03 A00-R00-S028-AMO-PROC    PIC 9(02).                     011028      
001976    02 A00-R00-S028-FCH-REAL       PIC 9(06).                     012028      
001977    02 A00-R00-S028-FCH-REAL-R    REDEFINES A00-R00-S028-FCH-REAL.013028      
001978       03 A00-R00-S028-DIA-REAL    PIC 9(02).                     014028      
001979       03 A00-R00-S028-MES-REAL    PIC 9(02).                     015028      
001980       03 A00-R00-S028-AMO-REAL    PIC 9(02).                     016028      
001981    02 A00-R00-S028-HORA-REAL      PIC 9(06).                     017028      
001982    02 A00-R00-S028-CVE-SISTEMA    PIC X(04).                     018028      
001983    02 A00-R00-S028-NOMBRE-EXT     PIC X(14).                     019028      
001984    02 A00-R00-S028-CVE-FORMATO    PIC 9(02).                     020028      
001985    02 FILLER                      PIC X(20).                     021028      
001986*                                                                 022028      
001987 01 A00-R01-S028-REGMOV.                                          023028      
001988    02 A00-R01-S028-SUCORI         PIC 9(04).                     024028      
001989    02 A00-R01-S028-NUMECO         PIC 9(04).                     025028      
001990    02 FILLER                      PIC X(04).                     026028      
001991    02 A00-R01-S028-NUMTERM        PIC 9(03).                     027028      
001992    02 A00-R01-S028-TIPMON         PIC 9(03).                     028028      
001993    02 A00-R01-S028-CVECTA         PIC 9(06).                     029028      
001994    02 A00-R01-S028-NUMCAR         PIC 9(04)    COMP.             030028      
001995    02 A00-R01-S028-IMPCAR         PIC 9(14)V99 COMP.             031028      
001996    02 A00-R01-S028-NUMABO         PIC 9(04)    COMP.             032028      
001997    02 A00-R01-S028-IMPABO         PIC 9(14)V99 COMP.             033028      
001998    02 FILLER                      PIC X(16).                     034028      
001999*                                                                 035028      
002000 01 A00-R02-REGMOV-S028.                                          036028      
002001     02 A00-R02-S028-SUCORI        PIC 9(04).                     037028      
002002     02 A00-R02-S028-CVEPRD        PIC X(04).                     038028      
002003     02 A00-R02-S028-NUMPRD        PIC 9(04).                     039028      
002004     02 A00-R02-S028-NUMTERM       PIC 9(03).                     040028      
002005     02 A00-R02-S028-TIPMON        PIC 9(03).                     041028      
002006     02 A00-R02-S028-CVECR         PIC X(02).                     042028      
002007     02 A00-R02-S028-NUMCR         PIC 9(04).                     043028      
002008     02 A00-R02-S028-NUMCAR        PIC 9(04)    COMP.             044028      
002009     02 A00-R02-S028-IMPCAR        PIC 9(14)V99 COMP.             045028      
002010     02 A00-R02-S028-NUMABO        PIC 9(04)    COMP.             046028      
002011     02 A00-R02-S028-IMPABO        PIC 9(14)V99 COMP.             047028      
002012     02 A00-R02-S028-LEY           PIC X(15).                     048028      
002013     02 A00-R02-S028-BANCO         PIC 9(01).                     049028      
002014*                                                                 050028      
002015 01 A00-R03-TRAILER-S028.                                         051028      
002016     02 A00-R03-S028-CVEREG        PIC X(02).                     052028      
002017     02 A00-R03-S028-TOTREG        PIC 9(06).                     053028      
002018     02 A00-R03-S028-TOTCAR        PIC 9(14)V99.                  054028      
002019     02 A00-R03-S028-TOTABO        PIC 9(14)V99.                  055028      
002020     02 FILLER                     PIC X(20).                     056028      
002021*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002022*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002023* COPY "(S151)S151/FORMATO/ARCHIVO/MERCATOR ON CMEMP.".           047100      
002024                                                                  000115      
002025*=================================================================001115      
002026*==       REGISTRO DEL ARCHIVO DE INTERFASE PARA MERCATOR       ==002115      
002027*=================================================================003115      
002028 01 A00-R00-HDR-MERC.                                             004115      
002029    02 A00-R00-MERC-CVE-REG        PIC X(02) VALUE "00".          005115      
002030    02 A00-R00-MERC-S-C            PIC X.                         005215      
002031    02 A00-R00-MERC-SIST           PIC 9(03).                     006115      
002032    02 A00-R00-MERC-CSI-ORI        PIC 9(02).                     008115      
002033    02 A00-R00-MERC-FEC-PROCESO.                                  009115      
002034       04 A00-R00-MERC-AA-PP       PIC 9(04).                     009415      
002035       04 FILLER                   PIC X    VALUE "-".            009515      
002036       04 A00-R00-MERC-MM-PP       PIC 9(02).                     009615      
002037       04 FILLER                   PIC X     VALUE "-".           009715      
002038       04 A00-R00-MERC-DD-PP       PIC 9(02).                     009815      
002039    02 A00-R00-MERC-FEC-MAQUINA.                                  015115      
002040       04 A00-R00-MERC-AA-MM       PIC 9(04).                     015415      
002041       04 FILLER                   PIC X VALUE "-".               015515      
002042       04 A00-R00-MERC-MM-MM       PIC 9(02).                     015615      
002043       04 FILLER                   PIC X VALUE "-".               015715      
002044       04 A00-R00-MERC-DD-MM       PIC 9(02).                     015815      
002045    02 A00-R00-MERC-HORA-CREA.                                    021115      
002046       04 A00-R00-MERC-HH-CREA     PIC 9(02).                     021315      
002047       04 FILLER                   PIC X     VALUE ":".           021415      
002048       04 A00-R00-MERC-MM-CREA     PIC 9(02).                     021515      
002049       04 FILLER                   PIC XXX   VALUE ":00".         021615      
002050    02 A00-R00-MERC-VERSION        PIC 9(02).                     028115      
002051    02 A00-R00-FILLER              PIC X(124).                    030115      
002052*                                                                 033115      
002053 01 A00-R01-MERC-REGMOV.                                          034115      
002054    02 A00-R01-MERC-CVE-REG        PIC X(02) VALUE "01".          034165      
002055    02 A00-R01-MERC-FECHA          PIC 9(08).                     034215      
002056    02 A00-R01-MERC-LIBRO          PIC 9(02).                     035115      
002057    02 A00-R01-MERC-MONEDA         PIC 9(04).                     036115      
002058    02 A00-R01-MERC-PROD-TC        PIC 9(04).                     038115      
002059    02 A00-R01-MERC-SUC            PIC 9(04).                     038165      
002060    02 A00-R01-MERC-INST-FONDO     PIC 9(02).                     038215      
002061    02 A00-R01-MERC-FIDEICOMISO    PIC 9(06).                     038315      
002062    02 A00-R01-MERC-CVE            PIC 9(04).                     040115      
002063    02 A00-R01-MERC-TM             PIC 9(02).                     041115      
002064    02 A00-R01-MERC-IMPORTE        PIC 9(15)V99.                  042115      
002065    02 A00-R01-MERC-TIP-TRA        PIC 9(02).                     042120      
002066    02 A00-R01-MERC-TIP-AUX        PIC 9(02).                     042125      
002067    02 A00-R01-MERC-FOL-AUX        PIC 9(10).                     042130      
002068    02 A00-R01-MERC-NUM-AUX        PIC 9(12).                     042135      
002069    02 A00-R01-MERC-DES-AUX        PIC X(30).                     042140      
002070    02 A00-R01-MERC-CVE-AUT        PIC 9(08).                     042145      
002071    02 A00-R01-MERC-FEC-PART       PIC 9(08).                     042150      
002072    02 A00-R01-MERC-SIG-SAUX       PIC X(01).                     042155      
002073    02 A00-R01-MERC-SDO-AUX        PIC 9(14)V99.                  042160      
002074    02 A00-R01-FILLE1              PIC X(18).                     042215      
002075*                                                                 055115      
002076 01 A00-R03-MERC-TRAILER.                                         056115      
002077     02 A00-R03-MERC-CVEREG        PIC X(02) VALUE "09".          057115      
002078     02 A00-R03-MERC-TOTREG        PIC 9(08).                     058115      
002079     02 A00-R03-MERC-TOTIMP        PIC 9(15)V99.                  058165      
002080     02 A00-R03-FILLER             PIC X(135).                    058215      
002081*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002082*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002083* COPY "(S151)S151/FORMATO/ARCHIVO/MOVSCIG ON CMEMP.".            047200      
002084 77 W77-ERROR-BIT                      PIC 9(02).                 000100      
002085 01 WKS-NULO                           PIC X(01) VALUE @00@.      000200      
002086 77 W77-BIT-SALIDA                     PIC 9(01).                 000350      
002087 01 WKS-LEY-ARCH                       PIC X(40).                 000400      
002088 01 WKS-RED-LEY          REDEFINES WKS-LEY-ARCH.                  000500      
002089    03 WKS-LEY-P1                      PIC X(15).                 000600      
002090    03 WKS-LEY-P2                      PIC X(25).                 000700      
002091                                                                  000800      
002092 01  WKS-HEADER-CIG.                                              000900      
002093    03 WKS-HD-TIPO-REG                 PIC X(01) VALUE "1".       001000      
002094    03 WKS-HD-SISTEMA                  PIC X(04) VALUE "S151".    001100      
002095    03 WKS-HD-FECHA-PROC               PIC 9(08).                 001200      
002096    03 WKS-HD-HORA-PROC                PIC 9(06).                 001300      
002097    03 WKS-HD-FECHA-INF                PIC 9(08).                 001400      
002098    03 WKS-HD-FECHA-FIN                PIC 9(08).                 001500      
002099    03 WKS-HD-NUM-ARCH                 PIC 9(02)  VALUE 1.        001600      
002100    03 WKS-HD-CSI                      PIC 9(03).                 001700      
002101    03 WKS-HD-S-C                      PIC X(01)  VALUE "S".      001800      
002102    03 WKS-HD-SIST-ORI                 PIC X(03).                 001900      
002103    03 FILLER                          PIC X(766) VALUE SPACES.   002000      
002104                                                                  002100      
002105 01 A00-BIT-REGMOV .                                              002200      
002106    03 A00-BIT-TIPO-REG                PIC  9(01).                002300      
002107    03 A00-BIT-FUNCION                 PIC  9(02).                002400      
002108    03 A00-BIT-SISTEMA                 PIC  9(04).                002500      
002109    03 A00-BIT-PRODUCTO                PIC  9(04).                002600      
002110    03 A00-BIT-TIPOCREDITO       REDEFINES A00-BIT-PRODUCTO       002700      
002111                                       PIC  9(04).                002800      
002112    03 A00-BIT-TIPOPROD          REDEFINES A00-BIT-PRODUCTO       002820      
002113                                       PIC  9(04).                002840      
002114    03 A00-BIT-INSTRUMENTO             PIC  9(02).                002900      
002115    03 A00-BIT-FONDO             REDEFINES A00-BIT-INSTRUMENTO    003000      
002116                                       PIC  9(02).                003100      
002117    03 A00-BIT-PORTAFOLIO        REDEFINES A00-BIT-INSTRUMENTO    003120      
002118                                       PIC  9(02).                003140      
002119    03 A00-BIT-SUCPROM                 PIC  9(04).                003200      
002120    03 A00-BIT-CONTRATO                PIC  9(16).                003300      
002121    03 A00-BIT-CVEIMP                  PIC  X(140).               003400      
002122    03 A00-BIT-CVEIMP-OC               REDEFINES A00-BIT-CVEIMP.  003500      
002123       04 A00-BIT-ELE-CVEIMP           OCCURS 5 TIMES.            003600      
002124          05 A00-BIT-CVETRAN           PIC  9(04).                003700      
002125          05 A00-BIT-INDALFA           PIC  9(02).                003710      
002126          05 A00-BIT-INDLEY            PIC  9(02).                003800      
002127          05 A00-BIT-ESQCON            PIC  9(04).                003900      
002128          05 A00-BIT-TM REDEFINES A00-BIT-ESQCON                  004000      
002129                                       PIC  9(04).                004100      
002130          05 A00-BIT-IMPORTE           PIC  9(14)V99.             004200      
002131    03 A00-BIT-FECMOV                  PIC  9(08).                004300      
002132    03 A00-BIT-HORMOV                  PIC  9(06).                004400      
002133    03 A00-BIT-FECCONT                 PIC  9(08).                004500      
002134    03 A00-BIT-FECVAL                  PIC  9(08).                004600      
002135    03 A00-BIT-AUTORIZA                PIC  9(08).                004700      
002136    03 A00-BIT-AUT3ER                  PIC  9(08).                004800      
002137    03 A00-BIT-REFNUM                  PIC  9(20).                004900      
002138    03 A00-BIT-REFNUM-S264       REDEFINES A00-BIT-REFNUM.        005000      
002139       05 A00-BIT-INDEFE               PIC  9(02).                005100      
002140       05 A00-BIT-REF264               PIC  9(18).                005200      
002141    03 A00-BIT-REFNUM-R          REDEFINES A00-BIT-REFNUM.        005600      
002142       05 A00-BIT-IND-EFEC             PIC  9(02).                005700      
002143       05 A00-BIT-REF-SIS              PIC  X(18).                005800      
002144       05 A00-BIT-REF-S084       REDEFINES A00-BIT-REF-SIS.       005900      
002145          07 FILLER                    PIC  X(02).                006000      
002146          07 A00-BIT-PM                PIC  9(02).                006100      
002147          07 A00-BIT-REF               PIC  9(14).                006200      
002148       05 A00-BIT-REFNUM-S500    REDEFINES A00-BIT-REF-SIS.       006300      
002149          07 A00-BIT-CHVV              PIC  9(04).                006400      
002150          07 A00-BIT-REFERENCIA        PIC  9(14).                006500      
002151       05 A00-BIT-REFNUM-S404    REDEFINES A00-BIT-REF-SIS.       006600      
002152          07 A00-BIT-TASA-PORC-DESCUENTO PIC 99V99.               006650      
002153          07 A00-BIT-ZEROS             PIC  9(08).                006700      
002154          07 A00-BIT-REF-S404          PIC  9(06).                006800      
002155    03 A00-BIT-CVEMDA                  PIC  9(02).                006900      
002156    03 A00-BIT-NUMMDA                  PIC  9(20).                007000      
002157    03 A00-BIT-NUMMDA-R          REDEFINES A00-BIT-NUMMDA.        007100      
002158       05 A00-BIT-MDA-SUC              PIC  9(04).                007200      
002159       05 A00-BIT-MDA-CTA              PIC  9(16).                007300      
002160    03 A00-BIT-CVEMDE                  PIC  9(02).                007400      
002161    03 A00-BIT-SUC-INIC                PIC  9(04).                007500      
002162    03 A00-BIT-CAJA-INIC               PIC  9(02).                007600      
002163    03 A00-BIT-SUCOPER                 PIC  9(04).                007700      
002164    03 A00-BIT-CAJAOPER                PIC  9(02).                007800      
002165    03 A00-BIT-SUCTRAN                 PIC  9(04).                007900      
002166    03 A00-BIT-CAJATRAN                PIC  9(02).                008000      
002167    03 A00-BIT-NOMINA-OPE              PIC  9(10).                008100      
002168    03 A00-BIT-ORIGEN                  PIC  9(02).                008200      
002169    03 A00-BIT-MONEDA                  PIC  9(04).                008300      
002170    03 A00-BIT-AUT-S151                PIC  9(08).                008400      
002171    03 A00-BIT-AUTELI-S151             PIC  9(08).                008500      
002172    03 A00-BIT-AUTELI-ANT-S151         PIC  9(08).                008600      
002173    03 A00-BIT-TIPO-PROC               PIC  9(02).                008700      
002174    03 A00-BIT-SOBREGIRO               PIC  9(02).                008800      
002175    03 A00-BIT-CVEAVISO                PIC  9(04).                008900      
002176    03 A00-BIT-IND-EDOCTA              PIC  9(02).                009000      
002177    03 A00-BIT-IND-DATOS-ADIC          PIC  9(02).                009100      
002178    03 A00-BIT-FECUM-NDIAS             PIC  9(10).                009200      
002179    03 A00-BIT-NDIAS-R           REDEFINES A00-BIT-FECUM-NDIAS.   009300      
002180       05 A00-BIT-NUMDIAS              PIC  9(04).                009400      
002181       05 A00-BIT-NUMDIAS-R      REDEFINES A00-BIT-NUMDIAS.       009500      
002182          07 A00-BIT-IND-CONTA         PIC  9(02).                009600      
002183          07 A00-BIT-IND-NUMREN        PIC  9(02).                009700      
002184       05 A00-BIT-ACTIVIDAD            PIC  9(06).                009800      
002185    03 A00-BIT-FECUM-R           REDEFINES A00-BIT-FECUM-NDIAS.   009900      
002186       05 A00-RO1-INDCONTA             PIC  9(02).                010000      
002187       05 A00-BIT-FEC-ULTMOV           PIC  9(08).                010100      
002188       05 A00-BIT-FEC-ULT-MOV-R  REDEFINES A00-BIT-FEC-ULTMOV.    010200      
002189          07  A00-BIT-INDNUMREN        PIC  9(02).                010300      
002190          07  A00-BIT-ACTIVIDAD-R      PIC  9(06).                010400      
002191    03 A00-BIT-SECTOR                  PIC  9(02).                010500      
002192    03 A00-BIT-BANCA                   PIC  9(02).                010600      
002193    03 WKS-MOV-DATOS-CONTABLES-DESVIO.                            010700      
002194       05  WKS-DATAGRUP1-PROD-TPROD    PIC 9(04).                 010800      
002195       05  WKS-DATAGRUP2-INST-TCRED    PIC 9(04).                 010900      
002196       05  WKS-SIRH-DEPTO              PIC 9(04).                 011000      
002197       05  WKS-LIBRO-CONTABLE          PIC 9(02).                 011100      
002198       05  WKS-CVES-DESVIO             OCCURS 5 TIMES.            011200      
002199           07 WKS-CVE-DESVIO           PIC 9(04).                 011300      
002200           07 WKS-GUIA-DESVIO          PIC 9(04).                 011400      
002201    03 A00-BIT-FIL-FUTURO              PIC  X(14).                011500      
002202    03 A00-BIT-REDEF-S087        REDEFINES A00-BIT-FIL-FUTURO.    011600      
002203       05 A00-BIT-CLIENTE              PIC  9(14).                011700      
002204       05 A00-BIT-REDEF-S701     REDEFINES A00-BIT-CLIENTE.       011800      
002205          07 A00-BIT-FEC-VEN           PIC  9(08).                011900      
002206          07 FILLER                    PIC  X(06).                012000      
002207       05 A00-BIT-REDEF-087      REDEFINES A00-BIT-CLIENTE.       012100      
002208          07 A00-BIT-FECVEN-087        PIC  9(08).                012200      
002209          07 FILLER                    PIC  X(02).                012300      
002210          07 A00-BIT-SUFIJO            PIC  9(04).                012400      
002211    03 A00-BIT-REDEF-S264        REDEFINES A00-BIT-FIL-FUTURO.    012500      
002212       05 A00-BIT-BCO                  PIC 9(04).                 012600      
002213       05 A00-BIT-BCOS-S264.                                      012700      
002214          06 A00-BIT-BOR-264           PIC 9(03).                 012800      
002215          06 A00-BIT-BDE-264           PIC 9(03).                 012900      
002216       05 FILLER                       PIC X(04).                 013000      
002217    03 A00-BIT-REDEF-S500        REDEFINES A00-BIT-FIL-FUTURO.    013100      
002218       05 A00-BIT-S015                 PIC 9(08).                 013200      
002219       05 A00-BIT-BCOS.                                           013300      
002220          06 A00-BIT-BCO-ORI           PIC 9(03).                 013400      
002221          06 A00-BIT-BCO-DES           PIC 9(03).                 013500      
002222    03 A00-BIT-REDEF-S501        REDEFINES A00-BIT-FIL-FUTURO.    013600      
002223       05 A00-BIT-CAJA-S501            PIC  9(04).                013700      
002224       05 FILLER                       PIC  X(10).                013800      
002225    03 A00-BIT-REDEF-S403        REDEFINES A00-BIT-FIL-FUTURO.    013900      
002226       05 A00-BIT-FOLIO-S403           PIC 9(04).                 014000      
002227       05 A00-BIT-RENGLON-S403         PIC 9(02).                 014100      
002228       05 A00-BIT-SCVECON-S403         PIC 9(04).                 014200      
002229       05 A00-BIT-INDPAGO              PIC 9(01).                 014300      
002230       05 FILLER                       PIC X(03).                 014400      
002231    03 A00-BIT-REDEF-S018       REDEFINES A00-BIT-FIL-FUTURO.     014500      
002232       05 A00-BIT-BCO-S018             PIC  9(04).                014600      
002233       05 FILLER                       PIC  X(10).                014700      
002234    03 A00-BIT-REDEF-S252       REDEFINES A00-BIT-FIL-FUTURO.     014800      
002235       05 A00-BIT-FEC-PARTIDA          PIC  9(08).                014900      
002236       05 FILLER                       PIC  X(06).                015000      
002237    03 A00-BIT-REDEF-S404       REDEFINES A00-BIT-FIL-FUTURO.     015010      
002238       05 BIT-TAB-FLUJO-EFEC OCCURS 5 TIMES.                      015020      
002239          07 A00-BIT-FLUJOEFEC-NEGOCIO PIC  9(01).                015030      
002240          07 A00-BIT-FLUJOEFEC-BANCO   PIC  9(01).                015040      
002241       05 A00-BIT-ID-CORPORATIVO       PIC  9(04).                015050      
002242    03 A00-BIT-NODO-ORIG               PIC  9(02).                015100      
002243    03 A00-BIT-STATUS                  PIC  9(02).                015200      
002244    03 A00-BIT-NOMINA-FUN1             PIC  9(10).                015300      
002245    03 A00-BIT-NOMINA-FUN2             PIC  9(10).                015400      
002246    03 A00-BIT-SIST-ORIG               PIC  9(04).                015500      
002247    03 A00-BIT-PROD-ORIG               PIC  9(04).                015600      
002248    03 A00-BIT-INST-ORIG               PIC  9(02).                015700      
002249    03 A00-BIT-CVECON-YREFLOC          PIC  X(52).                015800      
002250    03 A00-BIT-CVECON-Y-REFV    REDEFINES A00-BIT-CVECON-YREFLOC. 015900      
002251       05 A00-BIT-CVETR-ORIG           PIC  9(04).                016000      
002252       05 A00-BIT-CONT-ORIG            PIC  9(20).                016100      
002253       05 A00-BIT-REFLOC-BNM           PIC  X(24).                016200      
002254       05 A00-BIT-REFLOC-23POS  REDEFINES A00-BIT-REFLOC-BNM.     016300      
002255          06 A00-BIT-REFALFA           PIC  X(24).                016400      
002256          06 A00-BIT-REFALFA-R  REDEFINES A00-BIT-REFALFA.        016500      
002257             07 A00-BIT-REF23POS       PIC  9(23).                016600      
002258             07 A00-BIT-COMPREF        PIC  9(01).                016700      
002259          06 A00-BIT-REFALFA-R1 REDEFINES A00-BIT-REFALFA.        016800      
002260             07 A00-BIT-REF14POS       PIC  9(14).                016900      
002261             07 A00-BIT-REF10POS       PIC  9(10).                017000      
002262       05 A00-BIT-REFLOC-OC     REDEFINES A00-BIT-REFLOC-BNM.     017100      
002263          06 A00-BIT-REFLOC-PZA        PIC  9(03).                017200      
002264          06 A00-BIT-REFLOC-SUC        PIC  9(03).                017300      
002265          06 A00-BIT-REFLOC-TERM       PIC  X(04).                017400      
002266          06 A00-BIT-REFLOC-AUT        PIC  9(06).                017500      
002267          06 A00-BIT-REFLOC-VF         PIC  9(01).                017600      
002268          06 A00-BIT-REFLOC-TCHQ       PIC  9(01).                017700      
002269          06 FILLER                    PIC  X(06).                017800      
002270       05 FILLER                       PIC  X(04).                017900      
002271    03 A00-BIT-CONTYREFLOC      REDEFINES A00-BIT-CVECON-YREFLOC. 018000      
002272       05 A00-BIT-PRODGEN              PIC  9(03).                018100      
002273       05 A00-BIT-SUBPRODGEN           PIC  9(03).                018200      
002274       05 A00-BIT-CRE-FOLIO            PIC  9(04).                018300      
002275       05 A00-BIT-CONSECUTIVO    OCCURS 5 TIMES.                  018400      
002276          06 A00-BIT-CONSEC            PIC  9(08).                018500      
002277       05 A00-BIT-MON-CONTRUC          PIC  9(02).                018600      
002278                                                                  018700      
002279    03 A00-BIT-FILXAPL                 PIC  X(192).               018800      
002280                                                                  018810      
002281    03 A00-BIT-REDS084          REDEFINES A00-BIT-FILXAPL.        018820      
002282       05 A00-BIT-SUCEJE               PIC 9(04).                 018830      
002283       05 A00-BIT-CTAEJE               PIC 9(12).                 018840      
002284       05 A00-BIT-MENSUALIDAD          PIC 9(04).                 018850      
002285       05 A00-BIT-ASESOR               PIC 9(02).                 018860      
002286       05 FILLER                       PIC X(170).                018870      
002287                                                                  018900      
002288    03 A00-BIT-REDS087          REDEFINES A00-BIT-FILXAPL.        019000      
002289       05 A00-BIT-PZO                  PIC 9(04).                 019100      
002290       05 A00-BIT-EMISION              PIC 9(08).                 019200      
002291       05 A00-BIT-CTE-S087             PIC 9(12).                 019250      
002292       05 FILLER                       PIC X(168).                019300      
002293                                                                  019400      
002294    03 A00-BIT-S408              REDEFINES A00-BIT-FILXAPL.       019500      
002295       05 A00-BIT-FOLIO                PIC  9(04).                019600      
002296       05 A00-BIT-NUMLIN               PIC  9(04).                019700      
002297       05 A00-BIT-TASA-S408            PIC  9(4)V9(4).            019800      
002298       05 A00-BIT-FINI-S408            PIC  9(08).                019900      
002299       05 A00-BIT-FFIN-S408            PIC  9(08).                020000      
002300       05 A00-BIT-IMPORTE-S408         PIC  9(12)V99.             020100      
002301       05 FILLER                       PIC  X(146).               020200      
002302                                                                  020300      
002303    03 A00-BIT-REDS500          REDEFINES A00-BIT-FILXAPL.        020400      
002304       05 A00-BIT-CVECAUSA             PIC  9(04).                020500      
002305       05 A00-BIT-FECDEV               PIC  9(08).                020600      
002306       05 A00-BIT-BANCO                PIC  9(04).                020700      
002307       05 A00-BIT-NOMORD               PIC  X(30).                020800      
002308       05 A00-BIT-CAUSAORD             PIC  X(50).                020900      
002309       05 A00-BIT-SUCORD               PIC  9(04).                021000      
002310       05 A00-BIT-CTACON               PIC  9(02).                021100      
002311       05 FILLER                       PIC  X(90).                021200      
002312                                                                  022600      
002313    03 A00-BIT-REDS403           REDEFINES A00-BIT-FILXAPL.       022700      
002314       05 A00-BIT-OPCION               PIC  9(02).                022800      
002315       05 A00-BIT-FECCOTI              PIC  9(06).                022900      
002316       05 A00-BIT-FIDEICO              PIC  9(06).                023000      
002317       05 A00-BIT-IMPVAL               PIC  9(14)V99.             023100      
002318       05 A00-BIT-SUCADIC              PIC  9(04).                023200      
002319       05 A00-BIT-CAJAADIC             PIC  9(02).                023300      
002320       05 A00-BIT-PROGRAMA             PIC  9(04).                023400      
002321       05 A00-BIT-PLAZO                PIC  9(04).                023500      
002322       05 A00-BIT-TIPOPLAZO            PIC  9(02).                023600      
002323       05 A00-BIT-TASAREF              PIC  9(06)V99.             023700      
002324       05 A00-BIT-TASAREAL             PIC  9(04)V9999.           023800      
002325       05 A00-BIT-CTE                  PIC  9(12).                023900      
002326       05 A00-BIT-TIPOCREALFA          PIC  X(08).                024000      
002327       05 A00-BIT-AUTS151ORI           PIC  9(08).                024100      
002328       05 A00-BIT-TIPOCON              PIC  9(02).                024200      
002329       05 A00-BIT-INDCONTABLE          PIC  9(02).                024300      
002330       05 A00-BIT-CAEB                 PIC  9(06).                024310      
002331       05 A00-BIT-AREA                 PIC  9(04).                024320      
002332       05 FILLER                       PIC  X(88).                024400      
002333                                                                  024500      
002334    03 A00-BIT-REDS404           REDEFINES A00-BIT-FILXAPL.       024600      
002335       05 A00-BIT-OPCION-404           PIC  9(02).                024700      
002336       05 A00-BIT-FECCOTI-404          PIC  9(06).                024800      
002337       05 A00-BIT-FIDEICO-404          PIC  9(06).                024900      
002338       05 A00-BIT-IMPVAL-404           PIC  9(14)V99.             025000      
002339       05 A00-BIT-SUCADIC-404          PIC  9(04).                025100      
002340       05 A00-BIT-CAJAADIC-404         PIC  9(02).                025200      
002341       05 A00-BIT-PROGRAMA-404         PIC  9(04).                025300      
002342       05 A00-BIT-PLAZO-404            PIC  9(04).                025400      
002343       05 A00-BIT-TIPOPLAZO-404        PIC  9(02).                025500      
002344       05 A00-BIT-TASAREF-404          PIC  9(04)V99.             025600      
002345       05 A00-BIT-TASAREAL-404         PIC  9(04)V99.             025700      
002346       05 A00-BIT-CTE-404              PIC  9(12).                025800      
002347       05 A00-BIT-VALUDI-PRODNAT REDEFINES A00-BIT-CTE-404.       025900      
002348          07 A00-BIT-VAL-UDI           PIC  9(02)V9(06).          026000      
002349          07 A00-BIT-PRODUCTONAT       PIC  9(04).                026100      
002350       05 A00-BIT-CRE-CAUSACV          PIC  9(02).                026200      
002351       05 A00-BIT-CREDITO         OCCURS 5 TIMES.                 026300      
002352          07 A00-BIT-PAG-PAGNUM        PIC  9(04).                026400      
002353          07 A00-BIT-CRE-STATUS        PIC  9(02).                026500      
002354          07 A00-BIT-CRE-FASE          PIC  9(02).                026600      
002355          07 A00-BIT-PAG-STATUS        PIC  9(02).                026700      
002356          07 A00-BIT-PAG-STAVEN        PIC  9(02).                026800      
002357          07 A00-BIT-PAG-STACARV       PIC  9(02).                026900      
002358          07 A00-BIT-MOV-CONCEPTO      PIC  9(04).                027000      
002359          07 A00-BIT-MOV-TM            PIC  9(02).                027100      
002360          07 A00-BIT-MOV-MOVIMIENTO    PIC  9(04).                027200      
002361                                                                  027300      
002362    03 A00-BIT-REDS701           REDEFINES A00-BIT-FILXAPL.       027400      
002363       05 A00-BIT-DATOS-S701           PIC X(95).                 027500      
002364       05 A00-BIT-PAG-SERV       REDEFINES A00-BIT-DATOS-S701.    027600      
002365          07 A00-BIT-ID               PIC X(30).                  027700      
002366          07 A00-BIT-FECREC           PIC 9(06).                  027800      
002367          07 A00-BIT-REF1             PIC X(20).                  027900      
002368          07 A00-BIT-REF2             PIC X(20).                  028000      
002369          07 A00-BIT-TIPOPAGO         PIC 9(06).                  028100      
002370          07 A00-BIT-TIPOPAGO-R  REDEFINES A00-BIT-TIPOPAGO.      028200      
002371             09 A00-BIT-ESTAB         PIC 9(04).                  028300      
002372             09 A00-BIT-SEQ           PIC 9(02).                  028400      
002373          07 A00-BIT-AUT-S701         PIC 9(08).                  028500      
002374          07 A00-BIT-FPAGO            PIC 9(02).                  028600      
002375          07 A00-BIT-EBPP             PIC 9(03).                  028700      
002376       05 A00-BIT-PAG-IMPT       REDEFINES A00-BIT-DATOS-S701.    028800      
002377          07 A00-BIT-RFC              PIC X(13).                  028900      
002378          07 A00-BIT-FORMULARIO       PIC X(10).                  029000      
002379          07 FILLER                   PIC X(72).                  029100      
002380       05 FILLER                      PIC X(97).                  029200      
002381                                                                  029300      
002382    03 A00-BIT-REDS702           REDEFINES A00-BIT-FILXAPL.       029400      
002383       05 A00-BIT-CTE-S702            PIC X(12).                  029500      
002384       05 A00-BIT-CTA-S702            PIC X(40).                  029600      
002385       05 A00-BIT-STTRAN-S702         PIC 9(01).                  029610      
002386       05 A00-BIT-CTEEMI-S702         PIC 9(12).                  029620      
002387       05 A00-BIT-CTADES-S702         PIC 9(20).                  029630      
002388       05 A00-BIT-IDEORI-S702         PIC 9(01).                  029633      
002389       05 A00-BIT-IDEDES-S702         PIC 9(01).                  029636      
002390       05 A00-BIT-TCTAEM-S702         PIC 9(02).                  029640      
002391       05 A00-BIT-TIARCH-S702         PIC X(01).                  029645      
002392       05 A00-BIT-FECARC-S702         PIC 9(08).                  029650      
002393       05 A00-BIT-SECARC-S702         PIC 9(02).                  029660      
002394       05 A00-BIT-AUTORI-S702         PIC 9(20).                  029670      
002395       05 A00-BIT-NOMUSU-S702         PIC X(40).                  029675      
002396       05 A00-BIT-TCTAUS-S702         PIC 9(02).                  029685      
002397       05 A00-BIT-SUCCON-S274         PIC 9(04).                  029690      
002398       05 A00-BIT-CAJCON-S274         PIC 9(04).                  029695      
002399       05 FILLER                      PIC X(22).                  029705      
002400                                                                  029715      
002401    03 A00-BIT-REDS703 REDEFINES A00-BIT-FILXAPL.                 029725      
002402       05 A00-BIT-703-FLAGTX          PIC X(01).                  029735      
002403       05 A00-BIT-703-FLAGTW          PIC X(02).                  029745      
002404       05 A00-BIT-703-DESCRIPCION     PIC X(18).                  029755      
002405       05 A00-BIT-703-FECHAOPE        PIC 9(06).                  029765      
002406       05 A00-BIT-703-HORAOPE         PIC 9(06).                  029775      
002407       05 A00-BIT-703-NOMBREBEN       PIC X(60).                  029785      
002408       05 FILLER                      PIC X(99).                  029795      
002409                                                                  029805      
002410    03 A00-BIT-REDS264           REDEFINES A00-BIT-FILXAPL.       029900      
002411       05 A00-BIT-TASA                PIC 9(04)V9(04).            030000      
002412       05 A00-BIT-CTE-S264            PIC 9(06).                  030100      
002413       05 A00-BIT-PLAZO264            PIC 9(06).                  030200      
002414       05 A00-BIT-NOMCLI              PIC X(25).                  030300      
002415       05 A00-BIT-FEC-INI             PIC 9(08).                  030400      
002416       05 A00-BIT-FECVEN-S264         PIC 9(08).                  030500      
002417       05 A00-BIT-MDENTREGA           PIC 9(02).                  030600      
002418       05 FILLER                      PIC X(129).                 030700      
002419                                                                  030800      
002420    03 A00-BIT-REDC252-FT00      REDEFINES A00-BIT-FILXAPL.       030900      
002421       05 A00-BIT-FORMATO             PIC  9(02).                 031000      
002422       05 A00-BIT-DESCRIPCION         PIC  X(20).                 031100      
002423       05 A00-BIT-NATUTRAN            PIC  9(02).                 031200      
002424       05 FILLER                      PIC  X(168).                031300      
002425                                                                  031400      
002426    03 A00-BIT-REDC252-FT01      REDEFINES A00-BIT-FILXAPL.       031500      
002427       05 A00-BIT-FORMATO1            PIC  9(02).                 031600      
002428       05 A00-BIT-DESCRIPCION1        PIC  X(20).                 031700      
002429       05 A00-BIT-NATUTRAN1           PIC  9(02).                 031800      
002430       05 A00-BIT-TIPOAUX             PIC  9(01).                 031900      
002431       05 A00-BIT-NUMEROCTE           PIC  9(12).                 032000      
002432       05 A00-BIT-NOMBRECTE           PIC  X(34).                 032100      
002433       05 A00-BIT-NUMPARTIDA          PIC  9(10).                 032200      
002434       05 A00-BIT-ENTSAL              PIC  X(01).                 032300      
002435       05 A00-BIT-SDO                 PIC  9(12)V99.              032400      
002436       05 FILLER                      PIC  X(96).                 032500      
002437                                                                  032600      
002438    03 A00-BIT-REDC252-FT02      REDEFINES A00-BIT-FILXAPL.       032700      
002439       05 A00-BIT-FORMATO2            PIC  9(02).                 032800      
002440       05 A00-BIT-DESCRIPCION2        PIC  X(20).                 032900      
002441       05 A00-BIT-NATUTRAN2           PIC  9(02).                 033000      
002442       05 A00-BIT-NUMACREEDOR         PIC  9(12).                 033100      
002443       05 A00-BIT-NOMACREEDOR         PIC  X(36).                 033200      
002444       05 A00-BIT-FUNCAUTOR2          PIC  9(08).                 033300      
002445       05 A00-BIT-FECHAAUTOR2         PIC  9(08).                 033400      
002446       05 FILLER                      PIC  X(104).                033500      
002447                                                                  033600      
002448    03 A00-BIT-REDC252-FT03      REDEFINES A00-BIT-FILXAPL.       033700      
002449       05 A00-BIT-FORMATO3            PIC  9(02).                 033800      
002450       05 A00-BIT-DESCRIPCION3        PIC  X(20).                 033900      
002451       05 A00-BIT-NATUTRAN3           PIC  9(02).                 034000      
002452       05 A00-BIT-FUNCAUTOR3          PIC  9(08).                 034100      
002453       05 A00-BIT-FUNCPROPO3          PIC  9(08).                 034200      
002454       05 A00-BIT-NUMDEUDOR           PIC  9(12).                 034300      
002455       05 A00-BIT-NOMDEUDOR           PIC  X(36).                 034400      
002456       05 A00-BIT-FECHAAUTOR3         PIC  9(08).                 034500      
002457       05 FILLER                      PIC  X(96).                 034600      
002458                                                                  034700      
002459    03 A00-BIT-REDC252-FT04      REDEFINES A00-BIT-FILXAPL.       034800      
002460       05 A00-BIT-FORMATO4            PIC  9(02).                 034900      
002461       05 A00-BIT-DESCRIPCION4        PIC  X(20).                 035000      
002462       05 A00-BIT-NATUTRAN4           PIC  9(02).                 035100      
002463       05 A00-BIT-TIPOPERS            PIC  9(01).                 035200      
002464       05 A00-BIT-RFCFT04             PIC  X(13).                 035300      
002465       05 A00-BIT-ENTIDADFED          PIC  9(02).                 035400      
002466       05 A00-BIT-DIRECCION           PIC  X(40).                 035500      
002467       05 FILLER                      PIC  X(112).                035600      
002468                                                                  035700      
002469    03 A00-BIT-REDC402           REDEFINES A00-BIT-FILXAPL.       035800      
002470       05 A00-BIT-4CEROS              PIC  9(04).                 035900      
002471       05 A00-BIT-FIDEICO402          PIC  9(04).                 036000      
002472       05 FILLER                      PIC  X(184).                036100      
002473                                                                  036200      
002474    03 A00-BIT-REDS502           REDEFINES A00-BIT-FILXAPL.       036300      
002475       05 A00-BIT-RFC-502             PIC  X(13).                 036400      
002476       05 A00-BIT-CVECPTO1-502        PIC  9(07).                 036500      
002477       05 A00-BIT-PDO1-502            PIC  9(03).                 036600      
002478       05 A00-BIT-EJER1-502           PIC  9(04).                 036700      
002479       05 A00-BIT-TIPPAG1-502         PIC  9(01).                 036800      
002480       05 A00-BIT-IMP1-502            PIC  9(12).                 036900      
002481       05 A00-BIT-CVECPTO2-502        PIC  9(07).                 037000      
002482       05 A00-BIT-PDO2-502            PIC  9(03).                 037100      
002483       05 A00-BIT-EJER2-502           PIC  9(04).                 037200      
002484       05 A00-BIT-TIPPAG2-502         PIC  9(01).                 037300      
002485       05 A00-BIT-IMP2-502            PIC  9(12).                 037400      
002486       05 A00-BIT-CVECPTO3-502        PIC  9(07).                 037500      
002487       05 A00-BIT-PDO3-502            PIC  9(03).                 037600      
002488       05 A00-BIT-EJER3-502           PIC  9(04).                 037700      
002489       05 A00-BIT-TIPPAG3-502         PIC  9(01).                 037800      
002490       05 A00-BIT-IMP3-502            PIC  9(12).                 037900      
002491       05 FILLER                      PIC  X(98).                 038000      
002492    03 A00-BIT-REDC600           REDEFINES A00-BIT-FILXAPL.       038010      
002493       05 A00-BIT-FOLIO-600           PIC  9(004).                038020      
002494       05 A00-BIT-LINEA-600           PIC  9(004).                038030      
002495       05 A00-BIT-CANTID-600          PIC  9(017).                038040      
002496       05 A00-BIT-NUMBIE-600          PIC  9(008).                038050      
002497       05 A00-BIT-TIPBIE-600          PIC  X(030).                038060      
002498       05 A00-BIT-PROPIET-600         PIC  9(005).                038070      
002499       05 A00-BIT-VALVTA-600          PIC  9(016).                038080      
002500       05 FILLER                      PIC  X(108).                038090      
002501    03 A00-BIT-REDS711           REDEFINES A00-BIT-FILXAPL.       038100      
002502       05 A00-BIT-TRUI-S711.                                      038105      
002503          07 A00-BIT-CSIREC-S711      PIC 9(07).                  038110      
002504          07 A00-BIT-CSIOR-S711       PIC 9(07).                  038115      
002505          07 A00-BIT-NUMOP-S711       PIC 9(07).                  038120      
002506          07 A00-BIT-NUMTR-S711       PIC 9(07).                  038125      
002507          07 A00-BIT-INSMN-S711       PIC 9(02).                  038130      
002508       05 A00-BIT-MICR-S711.                                      038135      
002509          07 A00-BIT-CODSEG-S711      PIC 9(03).                  038137      
002510          07 A00-BIT-VERPRE-S711      PIC 9(01).                  038139      
002511          07 A00-BIT-CTRMON-S711      PIC 9(02).                  038140      
002512          07 A00-BIT-PLCEC-S711       PIC 9(03).                  038145      
002513          07 A00-BIT-BNCEM-S711       PIC 9(03).                  038150      
002514          07 A00-BIT-DVEIN-S711       PIC 9(01).                  038153      
002515          07 A00-BIT-CTACH-S711       PIC 9(11).                  038155      
002516          07 A00-BIT-REFCH-S711       PIC 9(07).                  038160      
002517       05 A00-BIT-CTABEN-S711         PIC 9(20).                  038165      
002518       05 A00-BIT-BCREC-S711          PIC 9(03).                  038170      
002519       05 A00-BIT-NOMBEN-S711         PIC X(40).                  038175      
002520       05 A00-BIT-RFCBCO-S711         PIC X(13).                  038180      
002521       05 FILLER                      PIC X(55).                  038185      
002522    03 A00-BIT-SALDO                  PIC S9(15)V99.              038190      
002523    03 A00-BIT-LEYENDA                PIC  X(40).                 038200      
002524    03 A00-BIT-INF-CBII               PIC  X(25).                 038300      
002525    03 A00-BIT-INF-CBII-R1            REDEFINES A00-BIT-INF-CBII. 038400      
002526       05 A00-BIT-REF-CBII            PIC X(15).                  038500      
002527       05 FILLER                      PIC X(10).                  038600      
002528    03 A00-BIT-INF-CBII-R2            REDEFINES A00-BIT-INF-CBII. 038700      
002529       05 A00-BIT-REFNUM-CBII         PIC X(10).                  038800      
002530       05 A00-BIT-REFALFA-CBII        PIC X(15).                  038900      
002531    03 A00-BIT-INTERCOMPANY           PIC 9(05).                  038950      
002532    03 A00-BIT-IMPBASE-ESQFINAN       PIC 9(14)V99.               038970      
002533    03 A00-BIT-SIN-USO                PIC X(15).                  039000      
002534                                                                  039100      
002535                                                                  039200      
002536                                                                  039300      
002537 01 WKS-TRAILER-CIG.                                              039400      
002538    03 WKS-TR-TIPO-REG                PIC X(01)  VALUE "9".       039500      
002539    03 WKS-TR-TOT-REG                 PIC 9(13)  VALUE ZEROES.    039600      
002540    03 WKS-TR-TOT-IMP                PIC 9(16)V9(02) VALUE ZEROES.039700      
002541    03 WKS-TR-TOT-CVES                PIC 9(08)  VALUE ZEROES.    039800      
002542    03 FILLER                         PIC X(770) VALUE SPACES.    039900      
002543*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002544*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002545* COPY "(S151)S151/FORMATO/ARCHIVO/ERRORES/6DIG".                 047300      
002546                                                                  001000      
002547                                                                  002000      
002548                                                                  003000      
002549                                                                  004000      
002550******************************************************************005000      
002551*                                                                *006000      
002552*   FORMATO DE LLAMADO DE MOVIMIENTOS AL S151 PARA TODOS         *007000      
002553*   LOS SISTEMAS:                                                *008000      
002554*   - LONGITUD DEL REGISTRO 540 CARACTERES                       *009000      
002555*     - LONGITUD DE DATOS GENERALES   180 CARACTERES             *010000      
002556*     - LONGITUD DE DATOS ADICIONALES 360 CARACTERES             *011000      
002557*                                                                *012000      
002558******************************************************************013000      
002559                                                                  014000      
002560 01 WKS-ERR-HEADER.                                               014100      
002561    03 WKS-ERR-HD                      PIC X(02).                 014200      
002562    03 WKS-ERR-FECHD                   PIC 9(08).                 014300      
002563    03 FILLER                          PIC X(530).                014400      
002564                                                                  014500      
002565*01 WKS-ERR-DATOS WITH LOWER-BOUNDS.                              015000      
002566 01 WKS-ERR-DATOS.                                                015010      
002567    03 WKS-ERR-FUNCION                 PIC  9(02)      COMP.      016000      
002568    03 WKS-ERR-SISTEMA                 PIC  9(04)      COMP.      017000      
002569    03 WKS-ERR-PRODUCTO                PIC  9(04)      COMP.      018000      
002570    03 WKS-ERR-INSTRUMENTO             PIC  9(02)      COMP.      019000      
002571    03 WKS-ERR-SUCPROM                 PIC  9(04)      COMP.      020000      
002572    03 WKS-ERR-CONTRATO                PIC  9(16)      COMP.      021000      
002573                                                                  022000      
002574    03 WKS-TAB-CVEIMP                  OCCURS 5 TIMES.            023000      
002575       04 WKS-ERR-CVETRAN              PIC  9(04)      COMP.      024000      
002576       04 WKS-ERR-INDLEY               PIC  9(02)      COMP.      025000      
002577       04 WKS-ERR-ESQCON               PIC  9(04)      COMP.      026000      
002578       04 WKS-ERR-IMPORTE              PIC  9(14)V99   COMP.      027000      
002579                                                                  028000      
002580    03 WKS-ERR-FECMOV                  PIC  9(06)      COMP.      029000      
002581    03 WKS-ERR-HORMOV                  PIC  9(06)      COMP.      030000      
002582    03 WKS-ERR-FECCONT                 PIC  9(06)      COMP.      031000      
002583    03 WKS-ERR-FECCONT-R               REDEFINES WKS-ERR-FECCONT. 032000      
002584       04 WKS-ERR-FECCONT-AAMM         PIC  9(04)      COMP.      033000      
002585       04 WKS-ERR-FECCONT-DD           PIC  9(02)      COMP.      034000      
002586    03 WKS-ERR-FECVAL                  PIC  9(06)      COMP.      035000      
002587    03 WKS-ERR-AUTORIZA                PIC  9(08)      COMP.      036000      
002588    03 WKS-ERR-AUT3ER                  PIC  9(08)      COMP.      037000      
002589    03 WKS-ERR-REFNUM                  PIC  9(20)      COMP.      038000      
002590    03 WKS-ERR-REFNUM-S087             REDEFINES WKS-ERR-REFNUM.  038552      
002591       04 FILLER                       PIC  9(04)      COMP.      038554      
002592       04 WKS-ERR-PM                   PIC  9(02)      COMP.      038556      
002593       04 WKS-ERR-REF                  PIC  9(14)      COMP.      038558      
002594    03 WKS-ERR-CVEMDA                  PIC  9(02)      COMP.      039000      
002595    03 WKS-ERR-NUMMDA                  PIC  9(20)      COMP.      040000      
002596    03 WKS-ERR-NUMMDA-R                REDEFINES WKS-ERR-NUMMDA.  041000      
002597       05 WKS-ERR-MDA-SUC              PIC  9(04)      COMP.      042000      
002598       05 WKS-ERR-MDA-CTA              PIC  9(16)      COMP.      043000      
002599    03 WKS-ERR-CVEMDE                  PIC  9(02)      COMP.      044000      
002600    03 WKS-ERR-SUC-INIC                PIC  9(04)      COMP.      045000      
002601    03 WKS-ERR-CAJA-INIC               PIC  9(02)      COMP.      046000      
002602    03 WKS-ERR-SUCOPER                 PIC  9(04)      COMP.      047000      
002603    03 WKS-ERR-CAJAOPER                PIC  9(02)      COMP.      048000      
002604    03 WKS-ERR-SUCTRAN                 PIC  9(04)      COMP.      049000      
002605    03 WKS-ERR-CAJATRAN                PIC  9(02)      COMP.      050000      
002606    03 WKS-ERR-NOMINA-OPE              PIC  9(08)      COMP.      051000      
002607    03 WKS-ERR-ORIGEN                  PIC  9(02)      COMP.      052000      
002608    03 WKS-ERR-MONEDA                  PIC  9(04)      COMP.      053000      
002609    03 WKS-ERR-AUT-S151                PIC  9(08)      COMP.      054000      
002610    03 WKS-ERR-AUT-AELIM-S151          PIC  9(08)      COMP.      055000      
002611    03 WKS-ERR-AUT-ANT-S151            PIC  9(08)      COMP.      056000      
002612    03 WKS-ERR-TIPO-PROC               PIC  9(02)      COMP.      057000      
002613    03 WKS-ERR-SOBREGIRO               PIC  9(02)      COMP.      058000      
002614    03 WKS-ERR-CVEAVISO                PIC  9(04)      COMP.      059000      
002615    03 WKS-ERR-IND-EDOCTA              PIC  9(02)      COMP.      060000      
002616    03 WKS-ERR-IND-DATOS-ADIC          PIC  9(02)      COMP.      061000      
002617    03 WKS-ERR-IND-CONTA               PIC  9(02)      COMP.      062000      
002618    03 WKS-ERR-IND-NUMREN              PIC  9(02)      COMP.      063000      
002619    03 WKS-ERR-ACTIVIDAD               PIC  9(06)      COMP.      064000      
002620    03 WKS-ERR-SECTOR                  PIC  9(02)      COMP.      065000      
002621    03 WKS-ERR-BANCA                   PIC  9(02)      COMP.      066000      
002622    03 WKS-ERR-FIL-FUTURO              PIC  X(10).                067000      
002623    03 WKS-ERR-REDEF-S264 REDEFINES WKS-ERR-FIL-FUTURO.           067010      
002624       05 FILLER                       PIC  X(03).                067030      
002625       05 WKS-ERR-BCO-S264             PIC  9(06) COMP.           067050      
002626       05 FILLER                       PIC  X(01).                067060      
002627       05 WKS-ERR-BORI-S264            PIC  9(03) COMP.           067070      
002628       05 WKS-ERR-BDES-S264            PIC  9(03) COMP.           067090      
002629    03 WKS-ERR-REDEF-S087 REDEFINES WKS-ERR-FIL-FUTURO.           067100      
002630       05 FILLER                       PIC  X(03).                067200      
002631       05 WKS-ERR-FEC-VEN              PIC  9(06)      COMP.      067400      
002632       05 FILLER                       PIC  X(04).                067500      
002633    03 WKS-ERR-REDEF-S500 REDEFINES WKS-ERR-FIL-FUTURO.           067520      
002634       05 FILLER                       PIC  X(03).                067540      
002635       05 WKS-ERR-S015                 PIC  9(06) COMP.           067560      
002636       05 FILLER                       PIC  X(01).                067570      
002637       05 WKS-ERR-BCO-ORI              PIC  9(03) COMP.           067580      
002638       05 WKS-ERR-BCO-DES              PIC  9(03) COMP.           067600      
002639    03 WKS-ERR-REDEF-S501 REDEFINES WKS-ERR-FIL-FUTURO.           067620      
002640       05 FILLER                       PIC  X(03).                067640      
002641       05 WKS-ERR-CAJA-S501            PIC  9(04)      COMP.      067660      
002642       05 FILLER                       PIC  X(05).                067680      
002643    03 WKS-ERR-REDEF-S403 REDEFINES WKS-ERR-FIL-FUTURO.           067700      
002644       05 FILLER                       PIC  X(03).                067720      
002645       05 WKS-ERR-FOLIO-S403           PIC  9(04)       COMP.     067740      
002646       05 WKS-ERR-RENGLON-S403         PIC  9(02)       COMP.     067760      
002647       05 WKS-ERR-SCVECON-S403         PIC  9(04)       COMP.     067780      
002648       05 FILLER                       PIC  X(02).                067800      
002649    03 WKS-ERR-NODO-ORIG               PIC  9(02)      COMP.      068000      
002650    03 WKS-ERR-APU-DESC                PIC  9(08)      COMP.      069000      
002651    03 WKS-ERR-STATUS                  PIC  9(02)      COMP.      070000      
002652                                                                  071000      
002653    03 WKS-ERR-DATOS-ADIC              PIC  X(360).               072000      
002654    03 WKS-ERR-MOV-DATOS-ADIC-R   REDEFINES WKS-ERR-DATOS-ADIC.   073000      
002655       05 WKS-ERR-NOMINA-FUN1          PIC  9(08)      COMP.      074000      
002656       05 WKS-ERR-NOMINA-FUN2          PIC  9(08)      COMP.      075000      
002657       05 WKS-ERR-SIST-ORIG            PIC  9(04)      COMP.      076000      
002658       05 WKS-ERR-PROD-ORIG            PIC  9(04)      COMP.      077000      
002659       05 WKS-ERR-INST-ORIG            PIC  9(02)      COMP.      078000      
002660       05 WKS-ERR-CVETR-ORIG           PIC  9(04)      COMP.      079000      
002661       05 WKS-ERR-CONT-ORIG            PIC  9(20)      COMP.      080000      
002662       05 WKS-ERR-REFLOC-BNM           PIC  X(14).                081000      
002663       05 WKS-ERR-REFLOC-OC            REDEFINES                  081100      
002664          WKS-ERR-REFLOC-BNM.                                     081200      
002665          06 WKS-ERR-REFLOC-PZA        PIC  9(03)      COMP.      081300      
002666          06 WKS-ERR-REFLOC-SUC        PIC  9(03)      COMP.      081400      
002667          06 WKS-ERR-REFLOC-TERM       PIC  X(04).                081500      
002668          06 WKS-ERR-REFLOC-AUT        PIC  9(06)      COMP.      081600      
002669          06 WKS-ERR-REFLOC-VF         PIC  9(01)      COMP.      081700      
002670          06 WKS-ERR-REFLOC-TCHQ       PIC  9(01)      COMP.      081800      
002671          06 FILLER                    PIC  X(03).                081900      
002672       05 WKS-ERR-FILLERXAPLI          PIC  X(96).                082000      
002673                                                                  083000      
002674       05 WKS-ERR-REDS084          REDEFINES WKS-ERR-FILLERXAPLI. 083100      
002675          06 WKS-ERR-SUCEJE            PIC 9(04)       COMP.      083200      
002676          06 WKS-ERR-CTAEJE            PIC 9(12)       COMP.      083300      
002677          06 WKS-ERR-MENSUALIDAD       PIC 9(04)       COMP.      083350      
002678          06 WKS-ERR-FILS084           PIC X(86).                 083400      
002679                                                                  083500      
002680       05 WKS-ERR-REDS087          REDEFINES WKS-ERR-FILLERXAPLI. 084000      
002681          06 WKS-ERR-PZO               PIC 9(04)       COMP.      085000      
002682          06 WKS-ERR-EMISION           PIC 9(08)       COMP.      086000      
002683          06 WKS-ERR-FILS087           PIC X(90).                 087000      
002684                                                                  088000      
002685       05 WKS-ERR-REDS403           REDEFINES WKS-ERR-FILLERXAPLI.088050      
002686          06 WKS-ERR-OPCION            PIC  9(02)    COMP.        088100      
002687          06 WKS-ERR-FECCOTI           PIC  9(06)    COMP.        088150      
002688          06 WKS-ERR-FIDEICO           PIC  9(06)    COMP.        088200      
002689          06 WKS-ERR-IMPVAL            PIC  9(14)V99 COMP.        088250      
002690          06 WKS-ERR-SUCADIC           PIC  9(04)    COMP.        088300      
002691          06 WKS-ERR-CAJAADIC          PIC  9(02)    COMP.        088350      
002692          06 WKS-ERR-PROGRAMA          PIC  9(04)    COMP.        088400      
002693          06 WKS-ERR-PLAZO             PIC  9(04)    COMP.        088450      
002694          06 WKS-ERR-TIPOPLAZO         PIC  9(02)    COMP.        088500      
002695          06 WKS-ERR-TASAREF           PIC  9(06)V99 COMP.        088550      
002696          06 WKS-ERR-TASAREAL          PIC  9(04)V9999 COMP.      088600      
002697          06 WKS-ERR-CTE               PIC  9(12)    COMP.        088650      
002698          06 FILLER                    PIC  X(59).                088700      
002699                                                                  088750      
002700       05 WKS-ERR-REDS408          REDEFINES WKS-ERR-FILLERXAPLI. 089000      
002701          06 WKS-ERR-FOLIO             PIC  9(04)      COMP.      090000      
002702          06 WKS-ERR-NUMLIN            PIC  9(04)      COMP.      091000      
002703          06 WKS-ERR-BCOS              PIC  9(04)      COMP.      091100      
002704          06 WKS-ERR-FILS408           PIC  X(90).                092000      
002705                                                                  093000      
002706       05 WKS-ERR-REDS500          REDEFINES WKS-ERR-FILLERXAPLI. 094000      
002707          06 WKS-ERR-CVECAUSA          PIC  9(04)      COMP.      095000      
002708          06 WKS-ERR-FECDEV            PIC  9(06)      COMP.      096000      
002709          06 WKS-ERR-BCO               PIC  9(04)      COMP.      097000      
002710          06 WKS-ERR-NOMORD            PIC  X(30).                098000      
002711          06 WKS-ERR-CAUSAORD          PIC  X(50).                099000      
002712          06 WKS-ERR-SUCORD            PIC  9(04)      COMP.      100000      
002713          06 WKS-ERR-FILS500           PIC  X(07).                101000      
002714                                                                  102000      
002715       05 WKS-ERR-REDS701          REDEFINES WKS-ERR-FILLERXAPLI. 103000      
002716          06 WKS-ERR-DATOS-S701        PIC  X(76).                104000      
002717          06 MOV-MOV-PAG-SERV      REDEFINES WKS-ERR-DATOS-S701.  105000      
002718             07 WKS-ERR-S701-ID        PIC  X(30).                106000      
002719             07 WKS-ERR-S701-FCHREC    PIC  9(06)      COMP.      107000      
002720             07 WKS-ERR-S701-REF1      PIC  X(20).                108000      
002721             07 WKS-ERR-S701-REF2      PIC  X(20).                109000      
002722             07 WKS-ERR-S701-TIPPAG    PIC  9(06)      COMP.      110000      
002723             07 WKS-ERR-S701-TIPPAG-R  REDEFINES                  111000      
002724                WKS-ERR-S701-TIPPAG.                              112000      
002725                08 WKS-ERR-S701-ESTAB  PIC  9(04)      COMP.      113000      
002726                08 WKS-ERR-S701-SEQ    PIC  9(02)      COMP.      114000      
002727          06 WKS-ERR-PAG-IMPT       REDEFINES WKS-ERR-DATOS-S701. 115000      
002728             07 WKS-ERR-S701-RFC       PIC  X(13).                116000      
002729             07 WKS-ERR-S701-FORMULARI PIC  X(10).                117000      
002730             07 FILLER                 PIC  X(53).                118000      
002731          06 WKS-ERR-FILS701           PIC  X(20).                119000      
002732       05 WKS-ERR-LEYENDAS             PIC  X(200).               119100      
002733       05 WKS-ERR-LEYENDAS-R           REDEFINES WKS-ERR-LEYENDAS.119200      
002734          06 WKS-ERR-LEY1              PIC  X(40).                120000      
002735          06 WKS-ERR-LEY2              PIC  X(40).                121000      
002736          06 WKS-ERR-LEY3              PIC  X(40).                122000      
002737          06 WKS-ERR-LEY4              PIC  X(40).                123000      
002738          06 WKS-ERR-LEY5              PIC  X(40).                124000      
002739       05 WKS-ERR-LEYENDAS-R1          REDEFINES WKS-ERR-LEYENDAS.124100      
002740          06 WKS-ERR-ELEM-LEY          OCCURS 5 TIMES.            124200      
002741             07 WKS-ERR-LEY            PIC  X(40).                124300      
002742             07 WKS-ERR-LEY-R          REDEFINES WKS-ERR-LEY.     124400      
002743                08 WKS-ERR-CHQEXE      PIC  9(10).                124500      
002744                08 WKS-ERR-CHQGIR      PIC  9(10).                124600      
002745                08 WKS-ERR-FILL        PIC  X(20).                124700      
002746       05 FILLER                       PIC  X(24).                125000      
002747       05 WKS-ERR-ESTATUS-ERR          PIC  9(02) COMP.           125100      
002748                                                                  126000      
002749******************************************************************127000      
002750* DATOS REQUERIDOS PARA:                                          128000      
002751*                                                                 129000      
002752* INICIO, FIN Y ELIMINACION DE PROCESO:                           130000      
002753*    WKS-ERR-FUNCION                                              131000      
002754*    WKS-ERR-SISTEMA                                              132000      
002755*    WKS-ERR-TIPO-PROC                                            133000      
002756*    WKS-ERR-FECCONT                                              134000      
002757*                                                                 135000      
002758*                                                                 136000      
002759* ELIMINACION A PARTIR DE UNA AUTORIZACION DEL S151               137000      
002760*    WKS-ERR-FUNCION                                              138000      
002761*    WKS-ERR-SISTEMA                                              139000      
002762*    WKS-ERR-FECCONT                                              140000      
002763*    WKS-ERR-AUT-AELIM-S151                                       141000      
002764*    NUMERO DE AUTORIZACION INICIAL A ELIMINAR                    142000      
002765*    WKS-ERR-AUT-ANT-S151                                         143000      
002766*    NUMERO DE AUTORIZACION FINAL   A ELIMINAR                    144000      
002767*    (SI ESTE CAMPO ES IGUAL A CEROS LA ELIMINACION ES DESDE EL   145000      
002768*     AUTORIZACION INICIAL A ELIMINAR HASTA EL FIN DE ARCHIVO)    146000      
002769*                                                                 147000      
002770******************************************************************148000      
002771*    MOVE "S151L002R" TO WKS-LIBID-NOMB.                          148050      
002772*    ACCEPT LOG-SISTEMA                                           148100      
002773*    MOVE LOG-SISTEMA TO WKS-LIBID-SIST.                          148150      
002774*    CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID           148200      
002775*                                     WKS-CTLVER-NOMLIB           148250      
002776*                              GIVING W77-CTLVER-RSLT.            148300      
002777*    IF W77-CTLVER-RSLT = 0                                       148350      
002778*       CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA" TO               148400      
002779*                                 WKS-CTLVER-NOMLIB               148450      
002780*    ELSE                                                         148500      
002781*       CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA" TO               148550      
002782*       "(S151)S151/OBJECT/L002/REGISTRASNNN/01MTP00  ON CMEMP.". 148600      
002783*                                                                 148650      
002784*                                                                 148700      
002785*    CALL "CARGAMOV1 IN LIB-REGISTRA"  USING LOG-DATOS            149000      
002786*                               GIVING WS-151-RESULT              150000      
002787*                                                                 151000      
002788                                                                  152000      
002789                                                                  153000      
002790                                                                  154000      
002791                                                                  155000      
002792                                                                  156000      
002793*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002794*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002795* COPY "(S151)S151/FORMATO/ARCHIVO/PUNTEO ON CMEMP.".             047400      
002796*=================================================================000100      
002797*== NOMBRE DEL ARCHIVO                                          ==000200      
002798*==       SNNN/FILE/E01/CO/CD/S151/PUNTEO#/AAAAMMDD             ==000300      
002799*=================================================================000400      
002800*==       REGISTRO DEL ARCHIVO PARA PUNTEO CON LOS SNNN         ==000500      
002801*=================================================================000600      
002802 01 A00-R00-HDR-PUNTEO.                                           000700      
002803    02 A00-R00-PUN-CVEREG         PIC 9(02) COMP.                 000800      
002804    02 A00-R00-PUN-SIST           PIC 9(04) COMP.                 001000      
002805    02 A00-R00-PUN-FECPRO         PIC 9(08) COMP.                 001100      
002806    02 FILLER                     PIC X(41).                      001200      
002807*                                                                 001300      
002808 01 A00-R01-PUN-DETALLE.                                          001400      
002809    02 A00-R01-PUN-CVEREG         PIC 9(02) COMP.                 001420      
002810    02 A00-R01-PUN-LIBRO          PIC 9(02) COMP.                 001450      
002811**L3 13JUL                                                        001460      
002812    02 A00-R01-PUN-ORIG-264 REDEFINES A00-R01-PUN-LIBRO           001470      
002813                                  PIC 9(02) COMP.                 001480      
002814    02 A00-R01-PUN-CONTRATO       PIC 9(16) COMP.                 001500      
002815    02 A00-R01-PUN-SUC-264 REDEFINES A00-R01-PUN-CONTRATO.        001510      
002816        03 A00-R01-PUN-SUCTRAN    PIC 9(04) COMP.                 001520      
002817        03 A00-R01-PUN-SUCOPE     PIC 9(04) COMP.                 001530      
002818        03 A00-R01-PUN-PROM       PIC 9(04) COMP.                 001540      
002819        03 A00-R01-PUN-HHMM       PIC 9(04) COMP.                 001550      
002820**L3                                                              001560      
002821    02 A00-R01-PUN-MONEDA         PIC 9(04) COMP.                 001600      
002822    02 A00-R01-PUN-CVETRA         PIC 9(04) COMP.                 001700      
002823    02 A00-R01-PUN-TM             PIC 9(04) COMP.                 001800      
002824*L3 21 SEP                                                        001810      
002825    02 A00-R01-PUN-TM-R REDEFINES A00-R01-PUN-TM.                 001820      
002826        03 A00-R01-PUN-IND-S028   PIC 9(02) COMP.                 001830      
002827        03 A00-R01-PUN-IND-S250   PIC 9(01) COMP.                 001840      
002828        03 A00-R01-PUN-NAT-S250   PIC 9(01) COMP.                 001845      
002829*L3                                                               001850      
002830    02 A00-R01-PUN-IMPORTE        PIC 9(14)V99 COMP.              001900      
002831    02 A00-R01-PUN-AUTS151        PIC 9(08) COMP.                 002000      
002832    02 A00-R01-PUN-AUTAPL         PIC 9(08) COMP.                 002100      
002833    02 A00-R01-PUN-SUCINI         PIC 9(04) COMP.                 002200      
002834    02 A00-R01-PUN-CAJAINI        PIC 9(02) COMP.                 002300      
002835    02 A00-R01-PUN-PRODUCTO       PIC 9(04) COMP.                 002400      
002836    02 A00-R01-PUN-INST           PIC 9(04) COMP.                 002500      
002837    02 A00-R01-PUN-FILXAPLIC      PIC X(09).                      002600      
002838    02 A00-R01-PUN-REDS404 REDEFINES A00-R01-PUN-FILXAPLIC.       002700      
002839       05 A00-R01-PUN-FOLIO       PIC 9(04) COMP.                 002800      
002840       05 A00-R01-PUN-CONCEPTO    PIC 9(04) COMP.                 002900      
002841       05 A00-R01-PUN-MOVI        PIC 9(04) COMP.                 003000      
002842       05 FILLER                  PIC X(03).                      003100      
002843    02 A00-R01-PUN-REDS501 REDEFINES A00-R01-PUN-FILXAPLIC.       003102      
002844       05 A00-R01-PUN-CAJA-501    PIC 9(04) COMP.                 003104      
002845       05 FILLER                  PIC X(07).                      003106      
002846**L3 21MAY                                                        003120      
002847    02 A00-R01-PUN-REDS264 REDEFINES A00-R01-PUN-FILXAPLIC.       003140      
002848       05 A00-R01-REFS264         PIC 9(18) COMP.                 003160      
002849**L3                                                              003180      
002850 01 A00-R02-TR-PUNTEO.                                            003200      
002851    02 A00-R02-PUN-CVEREG         PIC 9(02) COMP.                 003300      
002852    02 A00-R02-PUN-TOTREG         PIC 9(08) COMP.                 003400      
002853    02 FILLER                     PIC X(43).                      003500      
002854*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002855*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002856* COPY "(S151)S151/FORMATO/ARCHIVO/AM ON CMEMP.".                 047450      
002857******************************************************************000010      
002858* DEFINICION DE REGISTROS HEADER, TRAILER Y MOVIMIETOS           *000020      
002859*  DE LA INTERFASE A ACTIVO FIJO DEL MODULO S254-120             *000030      
002860******************************************************************000040      
002861 01  WKS-HEADER-AM.                                               000050      
002862     03 WKS-HDAM-TIP-REG           PIC X(02)  VALUE "HR".         000060      
002863     03 WKS-HDAM-SISTEMA           PIC X(04)  VALUE "S151".       000070      
002864     03 WKS-HDAM-FECHA-PROC        PIC X(10).                     000080      
002865     03 FILLER                     PIC X(126) VALUE SPACES.       000090      
002866 01  WKS-DETALLE-AM.                                              000100      
002867     03 WKS-DEAM-TIP-REG           PIC X(02) VALUE "DE".          000110      
002868     03 WKS-DEAM-CONTRATO          PIC 9(15).                     000120      
002869     03 WKS-DEAM-FOLIO             PIC 9(06).                     000130      
002870     03 WKS-DEAM-LINEA             PIC 9(04).                     000140      
002871     03 WKS-DEAM-CANTIDAD          PIC 9(10).                     000150      
002872     03 WKS-DEAM-ID-BIEN           PIC X(12).                     000160      
002873     03 WKS-DEAM-TIP-BIEN          PIC X(30).                     000170      
002874     03 WKS-DEAM-PROPIETA          PIC X(05).                     000180      
002875     03 WKS-DEAM-CVEMOV            PIC 9(04).                     000190      
002876     03 WKS-DEAM-TIPMOV            PIC 9(04).                     000200      
002877     03 WKS-DEAM-IMPORTE           PIC 9(14)V99.                  000210      
002878     03 WKS-DEAM-FECHA             PIC 9(10).                     000220      
002879     03 WKS-DEAM-PRODUCTO          PIC 9(04).                     000230      
002880     03 WKS-DEAM-DEP               PIC 9(04).                     000240      
002881     03 WKS-DEAM-VALVTA            PIC 9(14)V99.                  000245      
002882*                                                                 000250      
002883 01  WKS-TRAILER-AM.                                              000260      
002884     03 WKS-TRAM-TIP-REG           PIC X(02) VALUE "TR".          000270      
002885     03 WKS-TRAM-TOT-REG           PIC 9(06).                     000280      
002886     03 WKS-TRAM-TOT-IMP           PIC 9(15)V99.                  000290      
002887     03 FILLER                     PIC X(117) VALUE SPACES.       000300      
002888*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002889*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002890* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP002 ON CMEMP."         047500      
002891*                                    FROM 000100 TO 099999      . 048000      
002892                                                                  000100      
002893*----------------------------------------------------------------*000200      
002894*     VARIABLES PARA EL CALCULO DINAMICO DE ESPACIO PARA SORT    *000300      
002895*----------------------------------------------------------------*000400      
002896 77  W77-FRAMESIZE                PIC  9(002) COMP.               000500      
002897 77  W77-LASTRECORD               PIC  9(012) COMP.               000600      
002898 77  W77-MAXRECSIZE               PIC  9(012) COMP.               000700      
002899 77  W77-DISK-SIZE                PIC  9(018) COMP.               000800      
002900 77  W77-MEMORY-SIZE              PIC  9(018) COMP.               000900      
002901 77  W77-MEMORY-65K               PIC  9(018) COMP.               001000      
002902 01  WS-CALC-WORD                 PIC  9(012)V99.                 001100      
002903 01  WS-CALC-WORD-RED   REDEFINES WS-CALC-WORD.                   001200      
002904     02 WS-WORD-ENT               PIC  9(012).                    001300      
002905     02 WS-WORD-RES               PIC  9(002).                    001400      
002906                                                                  001500      
002907*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002908******************************************************************048600      
002909*          LIBRERIA LIBEST        ( S080 )                       *048700      
002910******************************************************************048800      
002911 01  WKS-EST-CODIGO                PIC 9(06).                     048900      
002912 01  WKS-EST-CODIGO-R REDEFINES WKS-EST-CODIGO.                   049000      
002913     03  WKS-EST-SUC               PIC 9(04).                     049100      
002914     03  WKS-EST-CLAVE             PIC 9(02).                     049200      
002915                                                                  049300      
002916 01  WKS-EST-RESPUESTA             PIC X(81).                     049400      
002917 01  WKS-EST-RESPUESTA-R REDEFINES        WKS-EST-RESPUESTA.      049500      
002918     03  WKS-EST-RESUL             PIC 9(01).                     049600      
002919     03  WKS-EST-DATO-RESPUESTA    PIC X(80).                     049700      
002920**  CLAVE 1 CSI                                                   049800      
002921     03  WKS-EST-NUM-CSI REDEFINES        WKS-EST-DATO-RESPUESTA. 049900      
002922         05  WKS-EST-CSI           PIC 99.                        050000      
002923         05  FILLER                PIC X(78).                     050100      
002924**  CLAVE 2   NOMBRE CORTO                                        050200      
002925     03  WKS-EST-NOM-CORTO REDEFINES      WKS-EST-DATO-RESPUESTA. 050300      
002926         05  WKS-EST-NOMBRE-CORTO  PIC X(20).                     050400      
002927         05  FILLER                PIC X(60).                     050500      
002928**  CLAVE 3   NOMBRE LARGO                                        050600      
002929     03  WKS-EST-NOM-LARGO REDEFINES      WKS-EST-DATO-RESPUESTA. 050700      
002930         05  WKS-EST-NOMBRE-LARGO  PIC X(40).                     050800      
002931         05  FILLER                PIC X(40).                     050900      
002932**  CLAVE 4   ESTRUCTURA                                          051000      
002933     03  WKS-EST-ESTRUCTURA REDEFINES     WKS-EST-DATO-RESPUESTA. 051100      
002934         05  WKS-EST-AREA          PIC 9(04).                     051200      
002935         05  WKS-EST-DIV           PIC 9(04).                     051300      
002936         05  WKS-EST-DIRDIV        PIC 9(04).                     051400      
002937         05  WKS-EST-DIRREG        PIC 9(04).                     051500      
002938         05  WKS-EST-DISTRI        PIC 9(04).                     051600      
002939         05  FILLER                PIC X(60).                     051700      
002940**  CLAVE 13  TIPO DE OFICINA                                     051800      
002941     03  WKS-EST-TIPO-OFICINA REDEFINES   WKS-EST-DATO-RESPUESTA. 051900      
002942         05  WKS-EST-TIPO-OFI      PIC 9(02).                     052000      
002943         05  FILLER                PIC X(78).                     052100      
002944**  CLAVE 25  NODO DE IMPRESION                                   052200      
002945     03  WKS-EST-NODO-DE-IMP  REDEFINES   WKS-EST-DATO-RESPUESTA. 052300      
002946         05  FILLER                PIC X(10).                     052400      
002947         05  WKS-EST-NODO-IMP      PIC 9(04).                     052500      
002948         05  WKS-NODO-EST-IMP      REDEFINES WKS-EST-NODO-IMP.    052600      
002949             07  WKS-NODO-EST      PIC 9(02).                     052700      
002950             07  FILLER            PIC 9(02).                     052800      
002951         05  FILLER                PIC X(66).                     052900      
002952** CLAVE 56 FECHA DE BAJA DE OFICINA                              053000      
002953     03  WKS-EST-FECHA-BAJA   REDEFINES   WKS-EST-DATO-RESPUESTA. 053100      
002954         05 WKS-EST-NOM-OFICINA    PIC X(40).                     053200      
002955         05 WKS-EST-NOM-CSI        PIC X(20).                     053300      
002956         05 WKS-EST-NUM-CSI        PIC 9(02).                     053400      
002957         05 WKS-EST-NODO-IMP2      PIC 9(02).                     053500      
002958         05 WKS-EST-FEC-BAJA       PIC 9(06).                     053600      
002959         05 FILLER                 PIC X(10).                     053700      
002960                                                                  053800      
002961******************************************************************053900      
002962*               LIBRERIA LOCSUP        ( S006 )                  *054000      
002963******************************************************************054100      
002964 01  WKS-CAMNUM-ALFA               PIC X(23).                     054200      
002965 01  WKS-CAMNUM-NUM                REDEFINES                      054300      
002966     WKS-CAMNUM-ALFA               PIC 9(23).                     054400      
002967                                                                  054500      
002968 01  WKS-DATOS-CAT.                                               054600      
002969     03 WKS-SIST-CAT               PIC 9(04).                     054700      
002970                                                                  054800      
002971 01  WKS-FECHA1                    PIC 9(08).                     054900      
002972 01  WKS-FECHA1-RED   REDEFINES    WKS-FECHA1.                    055000      
002973     05  WKS-AMO1-RED              PIC 9(02).                     055100      
002974     05  WKS-FECHA1-A6             PIC 9(06).                     055200      
002975                                                                  055300      
002976  01  WKS-FECHA1-8D                 PIC 9(08).                    055400      
002977  01  WKS-FECHA1-8D-R REDEFINES     WKS-FECHA1-8D.                055500      
002978      05 WKS-AA1-RED                PIC 9(02).                    055600      
002979      05 WKS-AA2-RED                PIC 9(02).                    055700      
002980      05 WKS-MM1-RED                PIC 9(02).                    055800      
002981      05 WKS-DD1-RED                PIC 9(02).                    055900      
002982                                                                  056000      
002983 01  WKS-FECHA2                    PIC 9(08).                     056100      
002984 01  WKS-FECHA2-RED   REDEFINES    WKS-FECHA2.                    056200      
002985     05  WKS-AMO2-RED              PIC 9(04).                     056300      
002986     05  WKS-MES2-RED              PIC 9(02).                     056400      
002987     05  WKS-DIA2-RED              PIC 9(02).                     056500      
002988***************************************************************   056600      
002989*          LIBRERIA CTLVERS       ( S006)                     *   056700      
002990***************************************************************   056800      
002991 01  WKS-CTLVERS-LIBRERIA            PIC X(12).                   056900      
002992 01  WKS-CTLVERS-TITULO              PIC X(72).                   057000      
002993 01  WKS-CTLVERS-STATUS              PIC S9(11) BINARY.           057100      
002994                                                                  057200      
002995 01  WKS-CTLVERS-NUMREG              PIC 9(02).                   057300      
002996 01  WKS-CTLVERS-LIBID               PIC X(12).                   057400      
002997 01  WKS-CTLVERS-LIBID-R REDEFINES WKS-CTLVERS-LIBID.             057500      
002998     03 WKS-LIBID-NOMB               PIC X(09).                   057600      
002999     03 WKS-LIBID-SIST               PIC X(03).                   057700      
003000                                                                  057800      
003001 01  WKS-151-DATOS WITH LOWER-BOUNDS.                             057900      
003002     03 WKS-DEL-FUNCION              PIC 9(04).                   058000      
003003     03 WKS-DEL-FECHA                PIC 9(06).                   058100      
003004     03 WKS-DEL-NUMLOG               PIC 9(02).                   058200      
003005     03 WKS-DEL-PRODUCTO             PIC 9(04).                   058300      
003006     03 WKS-DEL-PROCESO              PIC 9(02).                   058400      
003007                                                                  058500      
003008 01 WKS-TIT-REGISTRA.                                             058600      
003009    02 FILLER                     PIC X(32) VALUE                 058700      
003010       "(S151)S151/OBJECT/L002/REGISTRAS" .                       058800      
003011    02 WKS-TIT-SISREG             PIC 9(03) VALUE 0.              058900      
003012    02 FILLER                     PIC X(18) VALUE                 059000      
003013       "/09MTP0  ON CMEMP.".                                      059100      
003014                                                                  059200      
003015***************************************************************   059300      
003016*          LIBRERIA SOPORTECOMS                               *   059400      
003017***************************************************************   059500      
003018 01  WKS-DATOSHOST.                                               059600      
003019     02 WKS-DH-NUMCSI                PIC 9(02).                   059700      
003020     02 WKS-DH-NOMEQUIPO             PIC X(10).                   059800      
003021     02 WKS-DH-NOMCSI                PIC X(26).                   059900      
003022     02 WKS-DH-LINEABATCH            PIC X(05).                   060000      
003023*=============== Variables para envio por intelar =============   060100      
003024 77 W77-INTE-SNT                     PIC S9(11) BINARY.           060102      
003025 01 WKS-INTE-ARCHIVO                 PIC X(120).                  060104      
003026 77 W77-SIST-INTELAR                 PIC 9(03).                   060106      
003027 88 W88-SIST-INTELAR                 VALUE 252, 402, 600.         060156      
003028 88 W88-SIST-INTELAR-252             VALUE 252.                   060166      
003029 01 WKS-ERROR-INTELAR                PIC S9(03).                  060176      
003030 01 WKS-ERR-INTELAR                  PIC  X(04).                  060186      
003031                                                                  060196      
003032***************************************************************   060200      
003033*                    NOMBRES DE CSIS                          *   060300      
003034***************************************************************   060400      
003035 01  WKS-NOM-CSI.                                                 060500      
003036     02  FILLER     PIC X(26) VALUE "     NO EXISTE            ". 060600      
003037     02  FILLER     PIC X(26) VALUE "     NO EXISTE            ". 060700      
003038     02  FILLER     PIC X(26) VALUE "     NO EXISTE            ". 060800      
003039     02  FILLER     PIC X(26) VALUE "04MONM O N T E R R E Y    ". 060900      
003040     02  FILLER     PIC X(26) VALUE "     NO EXISTE            ". 061000      
003041     02  FILLER     PIC X(26) VALUE "     NO EXISTE            ". 061100      
003042     02  FILLER     PIC X(26) VALUE "     NO EXISTE            ". 061200      
003043     02  FILLER     PIC X(26) VALUE "     NO EXISTE            ". 061300      
003044     02  FILLER     PIC X(26) VALUE "     NO EXISTE            ". 061400      
003045     02  FILLER     PIC X(26) VALUE "10VDMM E X I C O          ". 061500      
003046     02  FILLER     PIC X(26) VALUE "     NO EXISTE            ". 061600      
003047     02  FILLER     PIC X(26) VALUE "12CORC O R P O R A T I V O". 061700      
003048 01  WKS-NOMBRES-CSI REDEFINES WKS-NOM-CSI.                       061800      
003049     02  WKS-TAB-CSI               OCCURS 12 TIMES.               061900      
003050         03  WKS-NUM-CSI           PIC 9(02).                     062000      
003051         03  WKS-NOMB-CSI          PIC X(03).                     062100      
003052         03  WKS-NOMB-LARGO-CSI    PIC X(21).                     062200      
003053                                                                  062300      
003054 01 WKS-TABLA-NODO.                                               062400      
003055    03  WKS-TBL-NODOS      OCCURS 100      TIMES.                 062500      
003056        05 WKS-TAB-NODO                    PIC 9(02) COMP.        062600      
003057        05 WKS-BAN-NODO                    PIC 9(02) COMP.        062700      
003058                                                                  062800      
003059******************************************************************062900      
003060*            NOMBRE DE LOS ARCHIVOS                              *063000      
003061******************************************************************063100      
003062 01 WKS-TIT-LOGS151.                                              063200      
003063     02  FILLER               PIC X(10) VALUE "(S151)S151".       063300      
003064     02  FILLER               PIC X(10) VALUE "/FILE/MOVS".       063400      
003065     02  WKS-TL-SISTEMA       PIC 9(03) VALUE 0.                  063500      
003066     02  FILLER               PIC X(01) VALUE "/".                063600      
003067     02  WKS-FEC-LOG          PIC 9(06).                          063700      
003068     02  FILLER               PIC X(04) VALUE " ON ".             063800      
003069     02  WKS-PACK-LOG         PIC X(17) .                         063900      
003070     02  FILLER               PIC X(01) VALUE ".".                064000      
003071                                                                  064100      
003072 01 WKS-TIT-DES151.                                               064200      
003073     02  FILLER               PIC X(10) VALUE "(S151)S151".       064300      
003074     02  FILLER               PIC X(10) VALUE "/FILE/DESS".       064400      
003075     02  WKS-TIT-SIST         PIC 9(03) VALUE 0.                  064500      
003076     02  FILLER               PIC X(01) VALUE "/".                064600      
003077     02  WKS-FEC-DES          PIC 9(06) VALUE 0.                  064700      
003078     02  FILLER               PIC X(04) VALUE " ON ".             064800      
003079     02  WKS-PACK-DES         PIC X(17) .                         064900      
003080     02  FILLER               PIC X(1) VALUE ".".                 065000      
003081                                                                  065100      
003082 01 WKS-TIT-LOGERR.                                               065200      
003083    02  FILLER                PIC X(10) VALUE "(S151)S151".       065300      
003084    02  FILLER                PIC X(10) VALUE "/FILE/ERRS".       065400      
003085    02  WKS-SIS-ERR           PIC 9(03) VALUE 0.                  065500      
003086    02  FILLER                PIC X(01) VALUE "/".                065600      
003087    02  WKS-FEC-ERR           PIC 9(06).                          065700      
003088    02  FILLER                PIC X(04) VALUE " ON ".             065800      
003089    02  WKS-PACK-ERR          PIC X(17) .                         065900      
003090    02  FILLER                PIC X(01) VALUE ".".                066000      
003091                                                                  066100      
003092 01 WKS-TIT-MOVSXTERM.                                            066200      
003093     02  WKS-SIS-S-C          PIC X(01).                          066300      
003094     02  WKS-SIS-MOVSXTERM    PIC 9(03).                          066400      
003095     02  FILLER               PIC X(16) VALUE "/FILE/MOVSXTERM/". 066500      
003096     02  WKS-FECHA-MOVSXTERM  PIC 9(06).                          066600      
003097     02  FILLER               PIC X(01) VALUE ".".                066700      
003098                                                                  066800      
003099 01 WKS-TIT-PAQCONTAB2.                                           066900      
003100    02 WKS-SIS-PAQ2-S-C             PIC X(01).                    067000      
003101    02 WKS-SIS-PAQCONTAB2           PIC 9(03).                    067100      
003102    02 FILLER                       PIC X(07) VALUE "/FILE/E".    067200      
003103    02 WKS-NUM-PAQCONTAB2           PIC 9(02) VALUE 0.            067300      
003104    02 FILLER                       PIC X(01) VALUE "/".          067400      
003105    02 WKS-CSI-PAQCONTAB2           PIC 9(02) VALUE 0.            067500      
003106    02 FILLER                       PIC X(09) VALUE "/12/S115/".  067600      
003107    02 WKS-FECHA-PAQCONTAB2         PIC 9(06).                    067700      
003108    02 FILLER                       PIC X(01) VALUE ".".          067800      
003109                                                                  067900      
003110  01 WKS-TIT-WFL.                                                 069000      
003111     02 FILLER                  PIC X(15) VALUE "BEGIN JOB; RUN ".069100      
003112     02 WKS-START-PROG             PIC X(47).                     069200      
003113     02 FILLER                     PIC X(02) VALUE " (".          069300      
003114     02 FILLER                     PIC X(01) VALUE QUOTES.        069400      
003115     02 WKS-START-S-C              PIC X(01).                     069500      
003116     02 WKS-START-SIS              PIC 9(03).                     069600      
003117     02 FILLER                     PIC X(04) VALUE "SCIG".        069700      
003118     02 FILLER                     PIC X(01) VALUE "/".           069800      
003119     02 WKS-START-FEC              PIC X(08).                     069900      
003120     02 FILLER                     PIC X(01) VALUE "/".           070000      
003121     02 WKS-START-CSI              PIC 9(02).                     070100      
003122     02 FILLER                     PIC X(01) VALUE QUOTES.        070200      
003123     02 FILLER                     PIC X(12) VALUE ") ; END JOB.".070300      
003124                                                                  070400      
003125  01 WKS-TIT-MOVSCIG.                                             070500      
003126     03 WKS-MC-S-C                   PIC X(01).                   070600      
003127     03 WKS-MC-SISTEMA               PIC 9(03).                   070700      
003128     03 FILLER                       PIC X(06) VALUE "/FILE/".    070800      
003129     03 WKS-MC-CSI                   PIC 9(02).                   070900      
003130     03 FILLER                       PIC X(09) VALUE "/MOVSCIG/". 071000      
003131     03 WKS-MC-FECHA                 PIC 9(08).                   071100      
003132     03 FILLER                       PIC X(01) VALUE ".".         071200      
003133                                                                  071300      
003134  01 WKS-TIT-DESVIOS.                                             071400      
003135     03 FILLER                 PIC X(16) VALUE                    071500      
003136                               "(S151)S151/FILE/".                071600      
003137     03 WKS-DES-S-C            PIC X(01).                         071700      
003138     03 WKS-DES-SISTEMA        PIC 9(03).                         071800      
003139     03 FILLER                 PIC X(01) VALUE "/".               071900      
003140     03 WKS-DES-CSI            PIC 9(02).                         072000      
003141     03 FILLER                 PIC X(09) VALUE "/DESVIOS/".       072100      
003142     03 WKS-DES-FECHA          PIC 9(08).                         072200      
003143     03 FILLER                 PIC X(10) VALUE " ON CMEMP.".      072300      
003144                                                                  072400      
003145  01 WKS-TIT-CC.                                                  072500      
003146     03 FILLER                 PIC X(16) VALUE                    072600      
003147                               "(S151)S151/FILE/".                072700      
003148     03 WKS-CC-S-C             PIC X(01).                         072800      
003149     03 WKS-CC-SISTEMA         PIC 9(03).                         072900      
003150     03 FILLER                 PIC X(01) VALUE "/".               073000      
003151     03 WKS-CC-CSI             PIC 9(02).                         073100      
003152     03 FILLER                 PIC X(11) VALUE "/CUADRECON/".     073200      
003153     03 WKS-CC-FECHA           PIC 9(08).                         073300      
003154     03 FILLER                 PIC X(10) VALUE " ON CMEMP.".      073400      
003155                                                                  073405      
003156   01 WKS-TIT-CVETRAN.                                            073410      
003157      03 FILLER                 PIC X(16) VALUE                   073415      
003158                                "(S151)S151/FILE/".               073420      
003159      03 WKS-CVETRAN-S-C        PIC X(01).                        073425      
003160      03 WKS-CVETRAN-SISTEMA    PIC 9(03).                        073430      
003161      03 FILLER                 PIC X(01) VALUE "/".              073435      
003162      03 WKS-CVETRAN-CSI        PIC 9(02).                        073440      
003163      03 FILLER                 PIC X(09) VALUE "/CVETRAN/".      073445      
003164      03 WKS-CVETRAN-FECHA      PIC 9(08).                        073450      
003165      03 FILLER                 PIC X(10) VALUE " ON CMEMP.".     073455      
003166                                                                  073500      
003167  01 WKS-TIT-CVES.                                                073600      
003168     03 FILLER                 PIC X(16) VALUE                    073700      
003169                               "(S151)S151/FILE/".                073800      
003170     03 WKS-CVE-S-C            PIC X(01).                         073900      
003171     03 WKS-CVE-SISTEMA        PIC 9(03).                         074000      
003172     03 FILLER                 PIC X(01) VALUE "/".               074100      
003173     03 WKS-CVE-CSI            PIC 9(02).                         074200      
003174     03 FILLER                 PIC X(08) VALUE "/CLAVES/".        074300      
003175     03 WKS-CVE-FECHA          PIC 9(08).                         074400      
003176     03 FILLER                 PIC X(10) VALUE " ON CMEMP.".      074500      
003177                                                                  074600      
003178   01 WKS-TIT-MOVIMIENTOS.                                        074620      
003179      03 FILLER                  PIC X(16) VALUE                  074640      
003180                                 "(S151)S151/FILE/".              074660      
003181      03 WKS-MOVIMIENTOS-S-C     PIC X(01).                       074662      
003182      03 WKS-MOVIMIENTOS-SIST    PIC 9(03).                       074664      
003183      03 FILLER                  PIC X(01) VALUE "/".             074666      
003184      03 WKS-MOVIMIENTOS-CSI     PIC 9(02).                       074668      
003185      03 FILLER                  PIC X(13) VALUE "/MOVIMIENTOS/". 074670      
003186      03 WKS-MOVIMIENTOS-FECHA   PIC 9(08).                       074672      
003187      03 FILLER                  PIC X(10) VALUE " ON CMEMP.".    074674      
003188                                                                  074676      
003189  01 WKS-TIT-MOVCONT.                                             074700      
003190     03 FILLER                 PIC X(16) VALUE                    074800      
003191                               "(S151)S151/FILE/".                074900      
003192     03 WKS-MOVC-S-C           PIC X(01).                         075000      
003193     03 WKS-MOVC-SISTEMA       PIC 9(03).                         075100      
003194     03 FILLER                 PIC X(01) VALUE "/".               075200      
003195     03 WKS-MOVC-CSI           PIC 9(02).                         075300      
003196     03 FILLER                 PIC X(08) VALUE "/MOVCON/".        075400      
003197     03 WKS-MOVC-FECHA         PIC 9(08).                         075500      
003198     03 FILLER                 PIC X(10) VALUE " ON CMEMP.".      075600      
003199                                                                  075700      
003200  01 WKS-TIT-MERCATOR.                                            075800      
003201     03 WKS-CVEMER-S-C   PIC X(01).                               075900      
003202     03 WKS-CVEMER-SIS   PIC 9(03).                               076000      
003203     03 FILLER           PIC X(10) VALUE "/FILE/E01/".            076100      
003204     03 WKS-CVEMER-CSI   PIC 9(02).                               076200      
003205     03 FILLER           PIC X(06) VALUE "/S254/".                076300      
003206     03 WKS-CVEMER-FECHA PIC 9(06).                               076400      
003207     03 FILLER           PIC X(01) VALUE ".".                     076450      
003208                                                                  076452      
003209 01 WKS-TIT-INTELAR-600.                                          076454      
003210    03 FILLER           PIC X(18) VALUE "S151/FILE/INTS/151".     076456      
003211    03 FILLER           PIC X(03) VALUE "15S"   .                 076458      
003212    03 WKS-INT-SERV-600 PIC 9(02) VALUE 0       .                 076460      
003213    03 FILLER           PIC X(01) VALUE "/"     .                 076462      
003214    03 WKS-INT-CSI-600  PIC 9(02).                                076464      
003215    03 FILLER           PIC X(02) VALUE "/S"    .                 076465      
003216    03 WKS-INT-S151     PIC 9(03) VALUE 0       .                 076466      
003217    03 FILLER           PIC X(06) VALUE "/MXCO/".                 076467      
003218    03 WKS-INT-FEC-600  PIC 9(08).                                076468      
003219    03 FILLER           PIC X(05) VALUE "/C01.".                  076470      
003220                                                                  076501      
003221  01 WKS-TIT-INTELAR.                                             076502      
003222     03 WKS-INT-S-C      PIC X(01).                               076503      
003223     03 WKS-INT-SIS      PIC 9(03).                               076504      
003224     03 FILLER           PIC X(11) VALUE "/FILE/INTS/".           076505      
003225     03 WKS-INT-SIS-I    PIC 9(03).                               076506      
003226     03 FILLER           PIC X(03) VALUE "15S"   .                076507      
003227     03 WKS-INT-SERVICIO PIC 9(02) VALUE 1       .                076509      
003228     03 FILLER           PIC X(01) VALUE "/"     .                076511      
003229     03 WKS-INT-CSI      PIC 9(02).                               076513      
003230     03 WKS-UNIDAD-NEG   PIC X(06) VALUE "/MXCO/".                076515      
003231     03 WKS-INT-FECHA    PIC 9(08).                               076517      
003232     03 FILLER           PIC X(05) VALUE "/C01.".                 076519      
003233  01 WKS-TIT-MOVERROR.                                            076522      
003234     03 FILLER           PIC X(16) VALUE "(S151)S151/FILE/".      076523      
003235     03 WKS-MOVERR-S-C   PIC X(01).                               076524      
003236     03 WKS-MOVERR-SIST  PIC 9(03).                               076525      
003237     03 FILLER           PIC X(01) VALUE "/".                     076530      
003238     03 WKS-MOVERR-CSI   PIC 9(02).                               076535      
003239     03 FILLER           PIC X(10) VALUE "/MOVERROR/".            076540      
003240     03 WKS-MOVERR-FECHA PIC 9(08).                               076545      
003241     03 FILLER           PIC X(10) VALUE " ON CMEMP.".            076550      
003242                                                                  076600      
003243  01 WKS-TIT-ERRORES.                                             076700      
003244     03 FILLER           PIC X(16) VALUE "(S151)S151/FILE/".      076800      
003245     03 WKS-ERR-S-C      PIC X(01).                               076900      
003246     03 WKS-ERR-SIST     PIC 9(03).                               077000      
003247     03 FILLER           PIC X(01) VALUE "/".                     077100      
003248     03 WKS-ERR-CSI      PIC 9(02).                               077200      
003249     03 FILLER           PIC X(09) VALUE "/ERRORES/".             077300      
003250     03 WKS-ERR-FECHA    PIC 9(08).                               077400      
003251     03 FILLER           PIC X(10) VALUE " ON CMEMP.".            077500      
003252                                                                  077600      
003253  01 WKS-TIT-PUNTEO.                                              077700      
003254     03 WKS-PUNTEO-S-C   PIC X(01).                               077800      
003255     03 WKS-PUNTEO-SIS   PIC 9(03).                               077900      
003256     03 FILLER           PIC X(10) VALUE "/FILE/E01/".            078000      
003257     03 WKS-PUNTEO-CSIO  PIC 9(02).                               078100      
003258     03 FILLER           PIC X(01) VALUE "/".                     078200      
003259     03 WKS-PUNTEO-CSID  PIC 9(02).                               078300      
003260     03 FILLER           PIC X(14) VALUE "/S151/PUNTEO2/".        078400      
003261     03 WKS-PUNTEO-FECHA PIC 9(08).                               078500      
003262     03 FILLER           PIC X(01) VALUE ".".                     078600      
003263 77  W77-TOTREG-PUNTEO   PIC 9(08) VALUE ZERO.                    078700      
003264******************************************************************078800      
003265*                NOMBRES DE BACKUPS                              *078900      
003266******************************************************************079000      
003267 01  WKS-TIT-BITACORA.                                            079100      
003268     02  FILLER                     PIC X(01)   VALUE "S".        079200      
003269     02  WKS-TB-SISTEMA             PIC 9(03)   VALUE 0.          079300      
003270     02  FILLER                     PIC X(11)   VALUE             079400      
003271                                    "/LIST/P107/".                079500      
003272     02  WKS-CENTRO-IMPRESION        PIC 9(04).                   079600      
003273     02  WKS-IMPRESION-CENTRO REDEFINES WKS-CENTRO-IMPRESION.     079700      
003274         04 WKS-IMPRESION-NODO       PIC 9(02).                   079800      
003275         04 WKS-IMPRESION-SUBNODO    PIC 9(02).                   079900      
003276     02  FILLER                     PIC X(06)   VALUE "/R000/".   080000      
003277     02  WKS-TB-FECHA-BACKUP        PIC 9(06).                    080100      
003278     02  FILLER                     PIC X(1)    VALUE "/".        080200      
003279     02  WKS-TB-MIX                 PIC 9(07).                    080300      
003280     02  FILLER                     PIC X(1)    VALUE "/".        080400      
003281     02  WKS-TB-NOMB-REPORTE.                                     080500      
003282         04 WKS-NUM-BACKUP          PIC 9(03)   VALUE 0.          080600      
003283         04 FILLER                  PIC X(04)   VALUE "S151".     080700      
003284         04 WKS-NOMBRE-BACKUP       PIC X(09).                    080800      
003285         04 FILLER                  PIC X(1)    VALUE ".".        080900      
003286                                                                  081000      
003287 01  WKS-TIT-TOTALES.                                             081100      
003288     02  FILLER                     PIC X       VALUE "S".        081200      
003289     02  WKS-TT-SISTEMA             PIC 999     VALUE 0.          081300      
003290     02  FILLER                     PIC X(11)   VALUE             081400      
003291                                    "/LIST/P107/".                081500      
003292     02  WKS-TT-CENTRO-IMP          PIC 9(02).                    081600      
003293     02  FILLER                     PIC 9(02)   VALUE 0.          081700      
003294     02  FILLER                     PIC X(06)   VALUE "/C000/".   081800      
003295     02  WKS-TT-FECHA-BACKUP        PIC 9(06).                    081900      
003296     02  FILLER                     PIC X(1)    VALUE "/".        082000      
003297     02  WKS-TT-MIX                 PIC 9(07).                    082100      
003298     02  FILLER                     PIC X(1)    VALUE "/".        082200      
003299     02  WKS-TT-NOMB-BACKUP.                                      082300      
003300         04 WKS-TT-NUM-BACK         PIC 9(03)   VALUE 0.          082400      
003301         04 FILLER                  PIC X(04)   VALUE "S151".     082500      
003302         04 WKS-TT-NOMBRE-BACK      PIC X(09).                    082600      
003303     02  FILLER                     PIC X(1)    VALUE ".".        082700      
003304*                                                                 082800      
003305 01  WKS-TIT-CUADRECONT.                                          082900      
003306     02  FILLER                     PIC X       VALUE "S".        083000      
003307     02  WKS-TC-SISTEMA             PIC 999     VALUE 0.          083100      
003308     02  FILLER                     PIC X(11)   VALUE             083200      
003309                                    "/LIST/P107/".                083300      
003310     02  WKS-TC-NODO-IMP            PIC 9(02).                    083400      
003311     02  FILLER                     PIC 9(02)   VALUE 0.          083500      
003312     02  FILLER                     PIC X(06)   VALUE "/C000/".   083600      
003313     02  WKS-TC-FECHA-BACKUP        PIC 9(06).                    083700      
003314     02  FILLER                     PIC X(1)    VALUE "/".        083800      
003315     02  WKS-TC-MIX                 PIC 9(07).                    083900      
003316     02  FILLER                     PIC X(1)    VALUE "/".        084000      
003317     02  WKS-TC-NOMB-REPORTE.                                     084100      
003318         04 WKS-TC-NUM-BACK         PIC 9(03)   VALUE 0.          084200      
003319         04 FILLER                  PIC X(04)   VALUE "S151".     084300      
003320         04 WKS-TC-NOMBRE-BACK      PIC X(10).                    084400      
003321     02  FILLER                     PIC X(1)    VALUE ".".        084500      
003322                                                                  084600      
003323 01 WKS-TIT-REPORTE.                                              084700      
003324    02 FILLER                       PIC X(01) VALUE "S".          084800      
003325    02 WKS-SIS-ERRORES              PIC 9(03).                    084900      
003326    02 FILLER                       PIC X(11) VALUE "/LIST/P107/".085000      
003327    02 WKS-TR-CSI                   PIC 9(02) VALUE 0.            085100      
003328    02 FILLER                       PIC X(08) VALUE "00/C000/".   085200      
003329    02 WKS-TR-FECHA-BACKUP          PIC 9(06).                    085300      
003330    02 FILLER                       PIC X(1)  VALUE "/".          085400      
003331    02 WKS-TR-MIX                   PIC 9(07).                    085500      
003332    02 FILLER                       PIC X(16) VALUE               085600      
003333                                              "/009S151DESVIOS.". 085700      
003334  01 WKS-TIT-RECHAZOS.                                            085800      
003335     02 FILLER                      PIC X(01) VALUE "S".          085900      
003336     02 WKS-SIS-RECHA               PIC 9(03).                    086000      
003337     02 FILLER                      PIC X(11) VALUE "/LIST/P107/".086100      
003338     02 WKS-CSI-RECHA               PIC 9(02) VALUE 0.            086200      
003339     02 FILLER                      PIC X(03) VALUE "00/".        086300      
003340     02 WKS-C-RECHA                 PIC X     VALUE SPACES.       086400      
003341     02 FILLER                      PIC X(04) VALUE "000/".       086500      
003342     02 WKS-FECHA-RECHA             PIC 9(06).                    086600      
003343     02 FILLER                      PIC X(1)  VALUE "/".          086700      
003344     02 WKS-MIX-RECHA               PIC 9(07).                    086800      
003345     02 WKS-LEY-RECHA               PIC X(17) VALUE SPACES.       086900      
003346                                                                  087000      
003347  01 WKS-TIT-TOTPROC.                                             087100      
003348     02 FILLER                      PIC X(01) VALUE "S".          087200      
003349     02 WKS-SIS-PROCESP             PIC 9(03).                    087300      
003350     02 FILLER                      PIC X(11) VALUE "/LIST/P107/".087400      
003351     02 WKS-CSI-PROCESP             PIC 9(02) VALUE 0.            087500      
003352     02 FILLER                      PIC X(03) VALUE "00/".        087600      
003353     02 WKS-C-PROCESP               PIC X     VALUE SPACES.       087700      
003354     02 FILLER                      PIC X(04) VALUE "000/".       087800      
003355     02 WKS-FECHA-PROCESP           PIC 9(06).                    087900      
003356     02 FILLER                      PIC X(1)  VALUE "/".          088000      
003357     02 WKS-MIX-PROCESP             PIC 9(07).                    088100      
003358     02 WKS-LEY-PROCESP             PIC X(17) VALUE SPACES.       088200      
003359                                                                  088300      
003360  01 WKS-IMP-TOTPRO                 PIC 9(01) VALUE ZEROS.        088400      
003361                                                                  088405      
003362  01 WKS-TIT-AM.                                                  088410      
003363     02 FILLER                      PIC X(29) VALUE               088420      
003364                             "(S151)C600/FILE/ACTFIJO/S151/".     088430      
003365     02 WKS-ACTFIJ-CSI              PIC 9(02) VALUE 0.            088440      
003366     02 FILLER                      PIC X(01) VALUE "/".          088445      
003367     02 WKS-ACTFIJ-FEC              PIC X(08) VALUE SPACES.       088450      
003368     02 FILLER                      PIC X(01) VALUE ".".          088460      
003369                                                                  088462      
003370   01 WKS-TIT-ACTF-INT.                                           088464      
003371      02 FILLER                     PIC X(24) VALUE               088466      
003372                                    "S151/FILE/INTS/15115S03/".   088468      
003373      02 WKS-ACTF-CSI-INT           PIC 9(02) VALUE 10        .   088470      
003374      02 FILLER                     PIC X(11) VALUE "/S600/ACTF/".088472      
003375      02 WKS-ACTF-FEC-INT           PIC 9(06) VALUE 0         .   088477      
003376      02 FILLER                     PIC X(05) VALUE "/C01."   .   088478      
003377                                                                  088481      
003378   77 W77-INTELAR-C600              PIC 9(03).                    088486      
003379   88 W88-INTELAR-C600              VALUE 600.                    088491      
003380                                                                  088496      
003381******************************************************************088500      
003382*                NOMBRE DE LA BASE DE DATOS DE SALDOS            *088600      
003383******************************************************************088700      
003384 01 WKS-NOMBRE-BASE-SALDOS.                                       088800      
003385    02 FILLER                             PIC X(06) VALUE         088900      
003386                                          "(S151)".               089000      
003387    02 WKS-NBS-NOMBRE                     PIC X(17).              089100      
003388    02 FILLER                             PIC X(17) VALUE         089200      
003389       " ON CMEMP.".                                              089300      
003390                                                                  089400      
003391******************************************************************089500      
003392*           CATALOGOS DESCRIPTIVOS  S080                         *089600      
003393******************************************************************089700      
003394 77 S080-CD-SISTEMA                       PIC S9(11) BINARY.      089800      
003395 77 S080-CD-PROGRAMA                      PIC S9(11) BINARY.      089900      
003396 77 S080-CD-RESULT                        PIC S9(11) BINARY.      090000      
003397 01 S080-CD-PARAMETRO-ENT.                                        090100      
003398    02 S080-CDPE-CATALOGO                 PIC 9(06) COMP.         090200      
003399    02 S080-CDPE-CLAVE                    PIC 9(02) COMP.         090300      
003400    02 S080-CDPE-ORDEN-BUSQ               PIC 9(02) COMP.         090400      
003401    02 S080-CDPE-REGISTROS                PIC 9(02) COMP.         090500      
003402    02 S080-CDPE-CVE-REGIST               PIC 9(12).              090600      
003403    02 S080-CDPE-CVE-REGIST-ASOC          PIC 9(12).              090700      
003404    02 S080-CDPE-NIVEL-INI                PIC 9(02) COMP.         090800      
003405    02 S080-CDPE-FECHA-CONS               PIC 9(06) COMP.         090900      
003406    02 FILLER                             PIC X(14).              091000      
003407                                                                  091100      
003408 01 S080-CD-PARAMETRO-SAL.                                        091200      
003409    02 S080-CDPS-NUM-REGISTRO             PIC 9(02) COMP.         091300      
003410    02 S080-CDPS-NUM-CATALOGO             PIC 9(06) COMP.         091400      
003411    02 S080-CDPS-FECHA-CONS               PIC 9(06) COMP.         091500      
003412    02 S080-CDPS-NIVEL-INI                PIC 9(02) COMP.         091600      
003413    02 S080-CDPS-DATOS.                                           091700      
003414       04 S080-CDPS-CVE-REGIST            PIC 9(12).              091800      
003415       04 S080-CDPS-CVE-REGIST-ASOC       PIC 9(12).              091900      
003416       04 S080-CDPS-CVE-REGIST-ASOC-R REDEFINES                   092000      
003417          S080-CDPS-CVE-REGIST-ASOC       PIC X(12).              092100      
003418       04 S080-CDPS-TEXTO-LARGO           PIC X(40).              092200      
003419       04 S080-CDPS-TEXTO-CORTO           PIC X(20).              092300      
003420       04 S080-CDPS-TEXTO-PANTALLA        PIC X(12).              092400      
003421       04 S080-CDPS-TEXTO-ABREV           PIC X(05).              092500      
003422       04 S080-CDPS-FECHA-ALTA            PIC 9(06) COMP.         092600      
003423       04 S080-CDPS-FECHA-BAJA            PIC 9(06) COMP.         092700      
003424       04 S080-CDPS-FECHA-ULTMOD          PIC 9(06) COMP.         092800      
003425       04 FILLER                          PIC X(10).              092900      
003426                                                                  093000      
003427******************************************************************093100      
003428*           CATALOGOS PARAMETRICOS  S080                         *093200      
003429******************************************************************093300      
003430 77 S080-CP-SISTEMA                       PIC S9(11) BINARY.      093400      
003431 77 S080-CP-PROGRAMA                      PIC S9(11) BINARY.      093500      
003432 77 S080-CP-RESULT                        PIC S9(11) BINARY.      093600      
003433 01 S080-CP-PARAMETRO-ENT.                                        093700      
003434    02 S080-CPPE-CATALOGO                 PIC 9(06) COMP.         093800      
003435    02 S080-CPPE-CLAVE                    PIC 9(02) COMP.         093900      
003436    02 S080-CPPE-ORDEN-BUSQ               PIC 9(02) COMP.         094000      
003437    02 S080-CPPE-REGISTROS                PIC 9(02) COMP.         094100      
003438    02 S080-CPPE-LLAVE1                   PIC 9(12).              094200      
003439    02 S080-CPPE-LLAVE2                   PIC 9(12).              094300      
003440    02 S080-CPPE-LLAVE3                   PIC X(12).              094400      
003441    02 S080-CPPE-LLAVE4                   PIC X(12).              094500      
003442    02 S080-CPPE-LLAVE5                   PIC X(12).              094600      
003443    02 S080-CPPE-LLAVE6                   PIC X(12).              094700      
003444    02 S080-CPPE-FECHA-VIG                PIC 9(06) COMP.         094800      
003445    02 S080-CPPE-FECHA-CONS               PIC 9(06) COMP.         094900      
003446    02 S080-CPPE-NIVEL-INI                PIC 9(02) COMP.         095000      
003447    02 FILLER                             PIC X(11).              095100      
003448                                                                  095200      
003449 01 S080-CP-PARAMETRO-SAL.                                        095300      
003450    02 S080-CPPS-NUM-REGISTRO             PIC 9(02) COMP.         095400      
003451    02 S080-CPPS-NUM-CATALOGO             PIC 9(06) COMP.         095500      
003452    02 S080-CPPS-FECHA-CONS               PIC 9(06) COMP.         095600      
003453    02 S080-CPPS-NIVEL-INI                PIC 9(02) COMP.         095700      
003454    02 FILLER                             PIC X(22).              095800      
003455    02 S080-CPPS-REGISTROS.                                       095900      
003456       04 S080-CPPS-REG   OCCURS 10 TIMES.                        096000      
003457          06 S080-CPPS-DATOS OCCURS 28 TIMES PIC 9(12).           096100      
003458          06 S080-CPPS-FECHA-ALTA         PIC 9(06) COMP.         096200      
003459          06 S080-CPPS-FECHA-BAJA         PIC 9(06) COMP.         096300      
003460          06 S080-CPPS-FECHA-ULTMOD       PIC 9(06) COMP.         096400      
003461          06 S080-CPPS-FECHA-VIG          PIC 9(06) COMP.         096500      
003462          06 FILLER                       PIC X(42).              096600      
003463******************************************************************096700      
003464*                    LEYENDAS DE MONEDAS                         *096800      
003465******************************************************************096900      
003466 01 WKS-TABLA-MONEDAS.                                            097000      
003467    02 WKS-T-MONEDAS         OCCURS 99   TIMES.                   097100      
003468       04 WKS-LEYENDA-MON                 PIC X(12).              097200      
003469                                                                  097300      
003470******************************************************************097400      
003471*            LEYENDAS DE LAS TRANSACCIONES                       *097500      
003472******************************************************************097600      
003473 01 WKS-TABLA-LEYENDAS-TRANS1.                                    097700      
003474    02 WKS-T-LEYENDAS-TRANS1 OCCURS 3000 TIMES.                   097800      
003475       04 WKS-LEYENDA-TRANS1              PIC X(20).              097900      
003476                                                                  098000      
003477 01 WKS-TABLA-LEYENDAS-TRANS2.                                    098100      
003478    02 WKS-T-LEYENDAS-TRANS2 OCCURS 3000 TIMES.                   098200      
003479       04 WKS-LEYENDA-TRANS2              PIC X(20).              098300      
003480                                                                  098400      
003481 01 WKS-TABLA-LEYENDAS-TRANS3.                                    098500      
003482    02 WKS-T-LEYENDAS-TRANS3 OCCURS 3000 TIMES.                   098600      
003483       04 WKS-LEYENDA-TRANS3              PIC X(20).              098700      
003484                                                                  098800      
003485 01 WKS-TABLA-LEYENDAS-TRANS4.                                    098900      
003486    02 WKS-T-LEYENDAS-TRANS4 OCCURS 1000 TIMES.                   099000      
003487       04 WKS-LEYENDA-TRANS4              PIC X(20).              099100      
003488                                                                  099200      
003489******************************************************************099300      
003490*                 CATALOGO DE TIPOS DE FONDO                     *099400      
003491******************************************************************099500      
003492  01 WKS-TABLA-TIPOFONDO.                                         099600      
003493     02 WKS-T-TIPOFON        OCCURS 100 TIMES.                    099700      
003494        04 WKS-NUM-TF               PIC 9(02).                    099800      
003495        04 WKS-NOM-TF               PIC X(08).                    099900      
003496                                                                  100000      
003497******************************************************************100100      
003498*                 CATALOGO DE TIPOS DE CREDITO                   *100200      
003499******************************************************************100300      
003500  01 WKS-TABLA-TIPOCREDITO.                                       100400      
003501     02 WKS-T-TIPOCRED       OCCURS 100 TIMES.                    100500      
003502        04 WKS-NUM-TC               PIC 9(02).                    100600      
003503        04 WKS-NOM-TC               PIC X(08).                    100700      
003504******************************************************************100800      
003505*            CATALOGO DE PARAMETROS DE LAS TRANSACCIONES         *100900      
003506******************************************************************101000      
003507 01 WKS-TABLA-PARAMETROS-TRANS2.                                  101100      
003508    02 WKS-T-PARAMETROS-TRANS2 OCCURS 10000 TIMES.                101200      
003509       04 WKS-PARAM-TRANS2  OCCURS 2 TIMES.                       101300      
003510          06 WKS-PT-EXISTE                PIC 9(02) COMP.         101400      
003511          06 WKS-PT-EVENTO                PIC 9(04) COMP.         101500      
003512                                                                  101600      
003513 01 WKS-TABLA-PARAMETROS-TRANS3.                                  101700      
003514    02 WKS-T-PARAMETROS-TRANS3 OCCURS 10000 TIMES.                101800      
003515       04 WKS-PARAM-TRANS3  OCCURS 2 TIMES.                       101900      
003516          06 WKS-PT-NUM-LEYEN             PIC 9(04) COMP.         102000      
003517          06 WKS-PT-INDS254               PIC 9(02) COMP.         102100      
003518                                                                  102200      
003519 01 WKS-TABLA-PARAMETROS-TRANS4.                                  102300      
003520    02 WKS-T-PARAMETROS-TRANS4 OCCURS 10000 TIMES.                102400      
003521       04 WKS-PARAM-TRANS4  OCCURS 2 TIMES.                       102500      
003522          06 WKS-PT-CGENTRA               PIC 9(02) COMP.         102600      
003523          06 WKS-PT-NATS028               PIC 9(02) COMP.         102700      
003524          06 WKS-PT-INDBITA               PIC 9(02) COMP.         102800      
003525                                                                  102900      
003526 01 WKS-TABLA-PARAMETROS-TRANS5.                                  102910      
003527    02 WKS-T-PARAMETROS-TRANS5 OCCURS 10000 TIMES.                102920      
003528       04 WKS-PARAM-TRANS5  OCCURS 2 TIMES.                       102930      
003529          06 WKS-PT-INDAM                 PIC 9(02) COMP.         102940      
003530                                                                  102950      
003531******************************************************************103000      
003532*                  CATALOGO DE CATALOGOS                         *103100      
003533******************************************************************103200      
003534 01 WKS-TABLA-CATALOGO-CAT.                                       103300      
003535    02 WKS-T-CATALOGO-CAT      OCCURS 20   TIMES.                 103400      
003536       04 WKS-CAT-NUM                     PIC 9(06).              103500      
003537       04 WKS-CAT-FORM                    PIC 9(02).              103600      
003538                                                                  103700      
003539******************************************************************103800      
003540*                     CATALOGO DE EVENTOS                        *103900      
003541******************************************************************104000      
003542  01 WKS-TABLA-PARES1.                                            104100      
003543     02 WKS-T-PARES1 OCCURS 300 TIMES.                            104200      
003544        04 WKS-PARES1 OCCURS 2 TIMES.                             104300      
003545           06 WKS-E-CARGO1          PIC 9(02) COMP.               104400      
003546           06 WKS-E-ABONO1          PIC 9(02) COMP.               104500      
003547                                                                  104600      
003548   01 WKS-TABLA-PARES2.                                           104700      
003549      02 WKS-T-PARES2 OCCURS 300 TIMES.                           104800      
003550         04 WKS-PARES2 OCCURS 2 TIMES.                            104900      
003551            06 WKS-E-CARGO2        PIC 9(02) COMP.                105000      
003552            06 WKS-E-ABONO2        PIC 9(02) COMP.                105100      
003553                                                                  105200      
003554   01 WKS-TABLA-PARES3.                                           105300      
003555      02 WKS-T-PARES3 OCCURS 300 TIMES.                           105400      
003556         04 WKS-PARES3 OCCURS 2 TIMES.                            105500      
003557            06 WKS-E-CARGO3        PIC 9(02) COMP.                105600      
003558            06 WKS-E-ABONO3        PIC 9(02) COMP.                105700      
003559                                                                  105800      
003560   01 WKS-TABLA-PARES4.                                           105900      
003561      02 WKS-T-PARES4 OCCURS 300 TIMES.                           106000      
003562         04 WKS-PARES4 OCCURS 2 TIMES.                            106100      
003563            06 WKS-E-CARGO4        PIC 9(02) COMP.                106200      
003564            06 WKS-E-ABONO4        PIC 9(02) COMP.                106300      
003565******************************************************************106400      
003566*                  CATALOGO DE CONCEPTOS O CUENTAS               *106500      
003567******************************************************************106600      
003568  01 WKS-TABLA-CONCEPTOS.                                         106700      
003569    02 WKS-T-CONCEPTOS OCCURS 150 TIMES.                          106800      
003570       04 WKS-CUENTA          PIC 9(04) COMP.                     106900      
003571       04 WKS-NOM-CUENTA      PIC X(20).                          107000      
003572                                                                  107100      
003573******************************************************************107200      
003574*                 CATALOGO DE DESVIOS                            *107300      
003575******************************************************************107400      
003576  01 WKS-TABLA-DESVIOS.                                           107500      
003577     02 WKS-SUCINI-DESVIO         PIC 9(04).                      107600      
003578     02 WKS-CVETRA-DESVIO         PIC 9(04).                      107700      
003579     02 WKS-TM-DESVIO             PIC 9(02).                      107800      
003580     02 WKS-TC-DESVIO             PIC 9(04).                      107900      
003581     02 WKS-LIBRO-DESVIO          PIC 9(02).                      108000      
003582                                                                  108100      
003583 77 W77-SW-CAT492                   PIC 9(01) VALUE 0.            108200      
003584 77 W77-SW-CAT502                   PIC 9(01) VALUE 0.            108300      
003585 77 W77-SW-CAT500                   PIC 9(01) VALUE 0.            108400      
003586 77 W77-PAUSA                       PIC X(02).                    108500      
003587                                                                  108600      
003588*01 WKS-TABLA-SUC-UOC.                                            108700      
003589*   02 WKS-T-SUC-UOC OCCURS 5000 TIMES.                           108800      
003590*      03 WKS-NUM-UOC                       PIC 9(04) COMP.       108900      
003591*                                                                 109000      
003592 01 WKS-TABLA-LIBROS.                                             109100      
003593    02 WKS-TAB-LIBROS OCCURS 90 TIMES.                            109200      
003594       03 WKS-LIBRO                       PIC 9(02).              109300      
003595       03 WKS-MONEDAOP                    PIC 9(04).              109400      
003596       03 WKS-CENT-CONT                   PIC 9(04).              109500      
003597                                                                  109600      
003598******************************************************************109700      
003599*                   ESQUEMA CONTABLES                            *109800      
003600* EL CAMPO TIPO-MOV = 1 SI ES MOVIMIENTO TRANSMITIDO             *109900      
003601*                   = 3 SI ES MOVIMIENTO AUTOMATICO              *110000      
003602* EL CAMPO TIPO-CTA = 1 SI EL CAMPO CUENTA ES CUENTA DE MAYOR    *110100      
003603*                   = 2 SI EL CAMPO CUENTA ES CLAVE CONCEPTO     *110200      
003604******************************************************************110300      
003605 01  WKS-CTA-CON                          PIC 9(12) COMP.         110400      
003606 01  WKS-CTA-CON-R REDEFINES WKS-CTA-CON.                         110500      
003607     03 WKS-CTA-CON1                      PIC 9(04) COMP.         110600      
003608     03 WKS-CTA-CON2                      PIC 9(04) COMP.         110700      
003609     03 WKS-CTA-CON3                      PIC 9(04) COMP.         110800      
003610                                                                  110900      
003611******************************************************************111000      
003612*            PARAMETROS DE LAS SUCURSALES                        *111100      
003613******************************************************************111200      
003614 01 WKS-TABLA-SUCURSALES.                                         111300      
003615    02 WKS-SUCURSALES OCCURS 10000 TIMES.                         111400      
003616*RGV   04 WKS-SUC-VALIDA                  PIC 9(02) COMP.         111500      
003617       04 WKS-SUC-NODO-IMP                PIC 9(04) COMP.         111600      
003618******************************************************************111700      
003619*           CATALOGO 209 PARA EL C402                            *111800      
003620******************************************************************111900      
003621 01 WKS-TABLA-CAT209-C402.                                        112000      
003622    03 WKS-CAT209-C402 OCCURS 10000 TIMES.                        112100      
003623       05 WKS-C209-EXISTE                 PIC 9(02) COMP.         112200      
003624******************************************************************112300      
003625*            VARIABLES MISCELANEAS                               *112400      
003626******************************************************************112500      
003627 77 W77-CONT                              PIC 9(03).              112600      
003628 77 W77-SALIDA                            PIC 9(01) VALUE 0.      112700      
003629 77 W77-FECHA-FIN                         PIC 9(8).               112800      
003630 77 W77-EOF                               PIC 9.                  112900      
003631 77 W77-EOF2                              PIC 9.                  113000      
003632 77 W77-ENCONTRE                          PIC 9.                  113100      
003633 77 W77-CREA                              PIC 9.                  113200      
003634 77 W77-PAQ-VACIO                         PIC 9 VALUE 0.          113300      
003635 77 W77-DIF-CERO                          PIC 9 VALUE 0.          113400      
003636 77 W77-TC-ALFA-ANT                       PIC X(08).              113500      
003637 77 W77-TC-NUM                            PIC 9(02).              113600      
003638 77 W77-ARCH-RESIDENT                     PIC 9(01).              113700      
003639 77 W77-CSI-PROCESO                       PIC 9(02).              113800      
003640 77 W77-RESULT                            PIC S9(11) BINARY.      113900      
003641 77 W77-REG-LEIDOS                        PIC 9(08).              114000      
003642 77 W77-IND                               PIC 9(06).              114100      
003643 77 W77-IND2                              PIC 9(06).              114200      
003644 77 W77-IND3                              PIC 9(06).              114300      
003645 77 W77-IND4                              PIC 9(06).              114400      
003646 77 W77-IND5                              PIC 9(02).              114500      
003647 77 W77-IND6                              PIC 9(02).              114600      
003648 77 W77-209                               PIC 9(06).              114700      
003649 77 W77-NATS028                           PIC 9.                  114800      
003650 77 W77-AFECS254                          PIC 9.                  114900      
003651 77 W77-CVEEXISTE                         PIC 9.                  115000      
003652 77 W77-INDLIB                            PIC 9(02).              115100      
003653 77 W77-NOCVE                             PIC 9.                  115200      
003654 77 W77-LIB-TEMP                          PIC 9(02).              115300      
003655 77 W77-NUM-CONT                          PIC 99.                 115400      
003656 77 W77-IND-FON                           PIC 9(02).              115500      
003657 77 W77-IND-INS                           PIC 9(02).              115600      
003658 77 W77-INDCVE                            PIC 9.                  115700      
003659 77 W77-APUDES                            PIC 9(08).              115800      
003660 77 W77-SW-HALLADO                        PIC 9.                  115900      
003661 77 W77-SW-1VEZ-BITA                      PIC 9     VALUE 0.      116000      
003662 77 W77-CAMPO-DISPLAY                     PIC 9(12).              116100      
003663 77 W77-SISTEMA-PARAM                     PIC 9(03).              116200      
003664 77 W77-LIMITE-CUADCONT                   PIC 9(04).              116300      
003665 77 W77-MOVSXTERM-NUMREG                  PIC 9(06).              116400      
003666 77 W77-MOVSXTERM-CARGOS                  PIC 9(16)V99.           116500      
003667 77 W77-MOVSXTERM-ABONOS                  PIC 9(16)V99.           116600      
003668 77 W77-MOVSXSUC-NUMREG                   PIC 9(08).              116700      
003669 77 W77-MOVSXSUC-IMPORTE                  PIC 9(18)V99.           116800      
003670 77 W77-FECCONT                           PIC 9(06).              116900      
003671 77 W77-CONT-SALDOS                       PIC 9(06) VALUE 0.      117000      
003672 77 W77-SUMA-SALDOS                       PIC S9(16)V99.          117100      
003673 77 W77-CUADRECON                         PIC 9(03) VALUE 0.      117200      
003674    88 W88-CUACON   VALUE 403,404.                                117300      
003675 77 W77-DESC                              PIC 9 VALUE ZEROS.      117400      
003676    88 W88-DESC                           VALUE 1.                117500      
003677 77 W77-MONEDA                            PIC 9.                  117600      
003678    88 W88-MONEDA                         VALUE 0.                117700      
003679 77 W77-LIBRO                             PIC 9.                  117800      
003680    88 W88-LIBRO                          VALUE 0.                117900      
003681 77 W77-BALANCEA                          PIC 9.                  118000      
003682    88 W88-BALANCEA                       VALUE 1.                118100      
003683 77 W77-BAN-DESVIOS                       PIC 9.                  118200      
003684    88 W88-BAN-DESVIOS                    VALUE 1.                118300      
003685 77 W77-DESVIOA                           PIC 9.                  118400      
003686    88 W88-DESVIOA                        VALUE 1.                118500      
003687 77 W77-DESVIOB                           PIC 9.                  118600      
003688    88 W88-DESVIOB                        VALUE 1.                118700      
003689 77 W77-DESVIOC                           PIC 9.                  118800      
003690    88 W88-DESVIOC                        VALUE 1.                118900      
003691 77 W77-DESVIOD                           PIC 9.                  119000      
003692    88 W88-DESVIOD                        VALUE 1.                119100      
003693 77 W77-DESVIOE                           PIC 9.                  119200      
003694    88 W88-DESVIOE                        VALUE 1.                119300      
003695 77 W77-DESVIOF                           PIC 9.                  119400      
003696    88 W88-DESVIOF                        VALUE 1.                119500      
003697 77 W77-DESVIOG                           PIC 9.                  119600      
003698    88 W88-DESVIOG                        VALUE 1.                119700      
003699 77 W77-SIST-CRED                         PIC 999.                119800      
003700    88 W88-SIST-CRED                      VALUE 402,403,404.      119900      
003701 77 W77-SIST-CENTRAL                      PIC 999.                120000      
003702    88 W88-SIST-CENTRAL                   VALUE 252.              120100      
003703 77 W77-SIST-CS                           PIC 999.                120200      
003704    88 W88-SIST-CS                        VALUE 600.              120300      
003705 77 W77-ERR-STATUS                        PIC 99.                 120400      
003706    88 W88-ERR-STATUS                     VALUE 1,2,8,9,11,12,13. 120500      
003707 77 W77-NULL                              PIC 9(16) COMP.         120600      
003708 77 W77-NPROCESO                          PIC 99.                 120700      
003709    88 W88-NPROCESO                       VALUE 80 THRU 89.       120800      
003710 77 W77-CVE-TRAN-AM                       PIC 99.                 120820      
003711    88 W88-CVETRAN-OK                     VALUES ARE 1 THRU 28,39,120840      
003712                                                    44 THRU 57,   120860      
003713                                                    62 THRU 89,39.120880      
003714 01 WKS-CONT-AM.                                                  120882      
003715    03 WKS-AM-SUM-REGS                    PIC 9(06).              120884      
003716    03 WKS-AM-SUM-IMP                     PIC 9(15)V99.           120885      
003717    03 WKS-AM-SW                          PIC 9(01).              120886      
003718    03 WKS-AM-CVETRAN                     PIC 9(04).              120887      
003719    03 WKS-AM-TM                          PIC 9(04).              120888      
003720    03 WKS-AM-IMP                         PIC 9(14)V99 COMP.      120889      
003721                                                                  120890      
003722 01 WKS-FOLIO-PASO                        PIC 9(10).              120900      
003723 01 WKS-FOLIO-PASO-R REDEFINES WKS-FOLIO-PASO.                    121000      
003724    03 WKS-PROD-FOL                       PIC 9(04).              121100      
003725    03 WKS-INST-FOL                       PIC 9(02).              121200      
003726    03 WKS-SECT-FOL                       PIC 9(02).              121300      
003727    03 WKS-CEROS1                         PIC 9(02).              121400      
003728                                                                  121500      
003729 01 WKS-SIST-ALFA.                                                121600      
003730    03 WKS-SIST-S-C                       PIC X(01).              121700      
003731    03 WKS-SIST-AL                        PIC 9(03).              121800      
003732                                                                  121900      
003733 01 WKS-CIA-ALFA.                                                 122000      
003734    03 WKS-CIA-PS                         PIC X(02).              122100      
003735    03 FILLER                             PIC X(02) VALUE SPACES. 122200      
003736                                                                  122300      
003737 01 WKS-FOL-PS                            PIC X(10).              122400      
003738 01 WKS-FOL-PS-R REDEFINES WKS-FOL-PS.                            122500      
003739    03 WKS-FID-PS                         PIC 9(06).              122600      
003740    03 WKS-PROG-PS                        PIC 9(04).              122700      
003741                                                                  122800      
003742 01 WKS-FECHA-10.                                                 122900      
003743    03 WKS-FEC10-AMO                      PIC 9(04).              123000      
003744    03 FILLER                             PIC X(01) VALUE "-".    123100      
003745    03 WKS-FEC10-MES                      PIC 9(02).              123200      
003746    03 FILLER                             PIC X(01) VALUE "-".    123300      
003747    03 WKS-FEC10-DIA                      PIC 9(02).              123400      
003748                                                                  123500      
003749 01 WKS-HORA-8.                                                   123600      
003750    03 WKS-HH-8                           PIC 9(02).              123700      
003751    03 FILLER                             PIC X(01) VALUE ":".    123800      
003752    03 WKS-MM-8                           PIC 9(02).              123900      
003753    03 FILLER                             PIC X(01) VALUE ":".    124000      
003754    03 WKS-SS-8                           PIC 9(02).              124100      
003755                                                                  124200      
003756 01 WKS-AUXILIAR                          PIC 9(10).              124300      
003757 01 WKS-AUXILIAR-R REDEFINES WKS-AUXILIAR.                        124400      
003758    03 WKS-SIST-AUX                       PIC 9(04).              124500      
003759    03 WKS-NODO-AUX                       PIC 9(02).              124600      
003760    03 WKS-CEROS2                         PIC 9(04).              124700      
003761                                                                  124800      
003762 01 WKS-NOMBRE-CUENTA.                                            124900      
003763    03 WKS-NOM-CTA                        PIC X(20).              125000      
003764    03 WKS-NOM-TIPOCRED                   PIC X(08).              125100      
003765                                                                  125200      
003766 01 WKS-NUM-CATA                          PIC 9(06).              125300      
003767 01 WKS-BAN-SUCINI                        PIC 9(01) VALUE 0.      125400      
003768******************************************************************125500      
003769*          VARIABLES PARA EL CONTROL DE CORTES                   *125600      
003770******************************************************************125700      
003771 77 W77-NODO-ANT                          PIC 9(04) COMP.         125800      
003772 77 W77-SUC-ANT                           PIC 9(04) COMP.         125900      
003773 77 W77-CAJA-ANT                          PIC 9(02) COMP.         126000      
003774 77 W77-FONDO-ANT                         PIC 9(02) COMP.         126100      
003775 77 W77-TC-ANT                            PIC 9(04) COMP.         126200      
003776                                                                  126300      
003777 01 WKS-LLAVES-ANT.                                               126400      
003778    02 WKS-NPROCESO-ANT                   PIC 9(02) COMP.         126500      
003779    02 WKS-LIBRO-ANT                      PIC 9(02) COMP.         126600      
003780    02 WKS-MON-ANT                        PIC 9(04) COMP.         126700      
003781    02 WKS-TC-ANT                         PIC 9(04) COMP.         126800      
003782    02 WKS-SUC-ANT                        PIC 9(04) COMP.         126900      
003783    02 WKS-FONDO-ANT                      PIC 9(02) COMP.         127000      
003784    02 WKS-EVE-ANT                        PIC 9(04) COMP.         127100      
003785    02 WKS-TIPOCON-ANT                    PIC 9(02) COMP.         127200      
003786    02 WKS-CVE-ANT                        PIC 9(04) COMP.         127300      
003787    02 WKS-TM-ANT                         PIC 9(02) COMP.         127400      
003788    02 WKS-FID-ANT                        PIC 9(06) COMP.         127500      
003789                                                                  127600      
003790 01 TABLA-CORTES-MOVSXTERM.                                       127700      
003791    03 TAB-CORTES-POR-LIBRO OCCURS 16 TIMES.                      127800      
003792       05 CORTES-MONEDA-MOVSXTERM  OCCURS 100 TIMES.              127900      
003793         07 WKS-S028-NUMCAR               PIC 9(6)     COMP.      128000      
003794         07 WKS-S028-IMPCAR               PIC 9(14)V99 COMP.      128100      
003795         07 WKS-S028-NUMABO               PIC 9(6)     COMP.      128200      
003796         07 WKS-S028-IMPABO               PIC 9(14)V99 COMP.      128300      
003797                                                                  128400      
003798****************************                                      128500      
003799* TOTALES POR CAJA         *                                      128600      
003800****************************                                      128700      
003801 01 TABLA-CORTES-POR-CAJA.                                        128800      
003802    02 WKS-CORTE-CAJA-LIBRO OCCURS 16 TIMES.                      128900      
003803       03 WKS-CORTE-CAJA-MONEDA OCCURS 100 TIMES.                 129000      
003804             05 WKS-CAJA-INDICA            PIC 9(02)    COMP.     129100      
003805             05 WKS-CAJA-NUMCAR            PIC 9(06)    COMP.     129200      
003806             05 WKS-CAJA-IMPCAR            PIC 9(12)V99 COMP.     129300      
003807             05 WKS-CAJA-NUMABO            PIC 9(06)    COMP.     129400      
003808             05 WKS-CAJA-IMPABO            PIC 9(12)V99 COMP.     129500      
003809             05 WKS-CAJA-NUMNCONT          PIC 9(06)    COMP.     129600      
003810             05 WKS-CAJA-IMPNCONT          PIC 9(12)V99 COMP.     129700      
003811                                                                  129800      
003812********************************                                  129900      
003813* TOTALES POR SUCURSAL         *                                  130000      
003814********************************                                  130100      
003815 01 TABLA-CORTES-POR-SUCURSAL.                                    130200      
003816    02 WKS-CORTE-SUC-LIBRO OCCURS 16 TIMES.                       130300      
003817       03 WKS-CORTE-SUC-MONEDA  OCCURS 100 TIMES.                 130400      
003818             05 WKS-SUC-INDICA             PIC 9(02)    COMP.     130500      
003819             05 WKS-SUC-NUMCAR             PIC 9(06)    COMP.     130600      
003820             05 WKS-SUC-IMPCAR             PIC 9(12)V99 COMP.     130700      
003821             05 WKS-SUC-NUMABO             PIC 9(06)    COMP.     130800      
003822             05 WKS-SUC-IMPABO             PIC 9(12)V99 COMP.     130900      
003823             05 WKS-SUC-NUMNCONT           PIC 9(06)    COMP.     131000      
003824             05 WKS-SUC-IMPNCONT           PIC 9(12)V99 COMP.     131100      
003825                                                                  131200      
003826*******************************************                       131300      
003827* TOTALES DEL CSI                         *                       131400      
003828*******************************************                       131500      
003829 01 WKS-LLAVES-TOTALES-CSI.                                       131600      
003830    02 WKS-LLAVES-TOTCSI            OCCURS 100 TIMES.             131700      
003831       03 WKS-LTC-KEY                     PIC 9(08)    COMP.      131800      
003832       03 WKS-LTC-KEY-R    REDEFINES WKS-LTC-KEY.                 131900      
003833          04 WKS-LTC-PRODUCTO             PIC 9(04)    COMP.      132000      
003834          04 WKS-LTC-INST                 PIC 9(02)    COMP.      132100      
003835          04 WKS-LTC-CONCEPTO             PIC 9(02)    COMP.      132200      
003836                                                                  132300      
003837 01 WKS-TOTALES-CSI.                                              132400      
003838    02 WKS-CORTE-CSI-LIBRO  OCCURS 16 TIMES.                      132500      
003839       03 WKS-CORTE-CSI-MONEDA OCCURS 100 TIMES.                  132600      
003840             05 WKS-TOTCSI-INDICA         PIC 9(02)    COMP.      132700      
003841             05 WKS-TOTCSI-NUMCAR         PIC 9(06)    COMP.      132800      
003842             05 WKS-TOTCSI-IMPCAR         PIC 9(12)V99 COMP.      132900      
003843             05 WKS-TOTCSI-NUMABO         PIC 9(06)    COMP.      133000      
003844             05 WKS-TOTCSI-IMPABO         PIC 9(12)V99 COMP.      133100      
003845             05 WKS-TOTCSI-NUMNCONT       PIC 9(08)    COMP.      133200      
003846             05 WKS-TOTCSI-IMPNCONT       PIC 9(12)V99 COMP.      133300      
003847                                                                  133400      
003848 01 WKS-LLAVE-TOTALES-CSI.                                        133500      
003849    02 WKS-LLAVE-TOTCSI                   PIC 9(08)    COMP.      133600      
003850    02 WKS-LLAVE-TOTCSI-R REDEFINES WKS-LLAVE-TOTCSI.             133700      
003851       04 WKS-LLAVE-TOTCSI-PRODUCTO       PIC 9(04)    COMP.      133800      
003852       04 WKS-LLAVE-TOTCSI-INST           PIC 9(02)    COMP.      133900      
003853       04 WKS-LLAVE-TOTCSI-CONCEPTO       PIC 9(02)    COMP.      134000      
003854                                                                  134100      
003855 01 WKS-TABLA-TOT-RECHAZOS.                                       134200      
003856    02 WKS-TAB-TOT-RECHAZOS       OCCURS 14 TIMES.                134300      
003857       03 WKS-TOT-RECHAZOS                PIC 9(06) COMP.         134400      
003858                                                                  134500      
003859 77 W77-TTC-NUMCAR                        PIC 9(08)    COMP.      134600      
003860 77 W77-TTC-IMPCAR                        PIC 9(16)V99 COMP.      134700      
003861 77 W77-TTC-NUMABO                        PIC 9(08)    COMP.      134800      
003862 77 W77-TTC-IMPABO                        PIC 9(16)V99 COMP.      134900      
003863 77 W77-TTC-NUMNCONT                      PIC 9(08)    COMP.      135000      
003864 77 W77-TTC-IMPNCONT                      PIC 9(16)V99 COMP.      135100      
003865                                                                  135200      
003866*******************************************                       135300      
003867* TOTALES DEL PROCESO                     *                       135400      
003868*******************************************                       135500      
003869 77 W77-TP-REG-LEIDOS                     PIC S9(11)  BINARY.     135600      
003870 77 W77-TP-REG-ELIMINADOS                 PIC S9(11)  BINARY.     135700      
003871 77 W77-TP-REG-PROCESADOS                 PIC S9(11)  BINARY.     135800      
003872 77 W77-TP-REG-BITACORA                   PIC S9(11)  BINARY.     135900      
003873 77 W77-TP-REG-CONTABLES                  PIC S9(11)  BINARY.     136000      
003874 77 W77-TP-REG-CTACONT                    PIC S9(11)  BINARY.     136100      
003875 77 W77-TP-REG-FORANEOS-TRANS             PIC S9(11)  BINARY.     136200      
003876 77 W77-TP-REG-FORANEOS-REC               PIC S9(11)  BINARY.     136300      
003877 77 W77-TP-REG-S050                       PIC S9(11)  BINARY.     136400      
003878                                                                  136500      
003879 77 W77-TP-IMP-FORANEOS-TRANS             PIC  9(16)V99 COMP.     136600      
003880 77 W77-TP-IMP-FORANEOS-REC               PIC  9(16)V99 COMP.     136700      
003881 77 W77-TP-IMP-S050                       PIC  9(16)V99 COMP.     136800      
003882                                                                  136900      
003883 77 W77-CVE-TEMP                          PIC 9(04).              137000      
003884 77 W77-TM-TEMP                           PIC 9(02).              137100      
003885 77 W77-EVE-TEMP                          PIC 9(04).              137200      
003886                                                                  137300      
003887 01 WKS-VARIABLE-TEMP-MOVTO.                                      137400      
003888    02 WKS-NUM-CAR                         PIC 9(06)    COMP.     137500      
003889    02 WKS-IMP-CAR                         PIC 9(16)V99 COMP.     137600      
003890    02 WKS-NUM-ABO                         PIC 9(06)    COMP.     137700      
003891    02 WKS-IMP-ABO                         PIC 9(16)V99 COMP.     137800      
003892    02 WKS-NUM-NCONT                       PIC 9(06)    COMP.     137900      
003893    02 WKS-IMP-NCONT                       PIC 9(16)V99 COMP.     138000      
003894                                                                  138100      
003895  01 WKS-NOMBRE-SIST.                                             138200      
003896     03 WKS-S-C-SIST                       PIC X(01).             138300      
003897     03 WKS-NUM-SIST                       PIC 9(03) VALUE 0.     138400      
003898                                                                  138500      
003899 01 KEY-TOT250-ANT.                                               138600      
003900        03 WKS-LEY-PAQ-ANT                 PIC X(05).             138700      
003901        03 WKS-SUC-PAQ-ANT                 PIC 9(04).             138800      
003902        03 WKS-LIB-PAQ-ANT                 PIC 9(04).             138900      
003903        03 WKS-FID-PAQ-ANT                 PIC 9(04).             139000      
003904        03 WKS-MON-PAQ-ANT                 PIC 9(03).             139100      
003905        03 WKS-CON-PAQ-ANT                 PIC 9(04).             139200      
003906        03 WKS-CTA-PAQ-ANT                 PIC 9(06).             139300      
003907        03 WKS-CTA-PAQ-ANT-RED REDEFINES WKS-CTA-PAQ-ANT.         139400      
003908           05 WKS-CTA4-PAQ-ANT             PIC 9(04).             139500      
003909           05 WKS-CTA2-PAQ-ANT             PIC 9(02).             139600      
003910        03 WKS-CTA1-PAQ-ANT-RED REDEFINES WKS-CTA-PAQ-ANT.        139700      
003911           05 WKS-CTA1-PAQ-ANT             PIC 9.                 139800      
003912           05 FILLER                      PIC 9(05).              139900      
003913        03 WKS-TC-PAQ-ANT                  PIC 9(04).             140000      
003914                                                                  140100      
003915 01 WKS-CUENTA-PASO                       PIC 9(06).              140200      
003916 01 WKS-CUENTA-PASO-R REDEFINES WKS-CUENTA-PASO.                  140300      
003917    03 WKS-CTA4D-PASO                     PIC 9(04).              140400      
003918    03 WKS-CTA8D-PASO                     PIC 9(02).              140500      
003919                                                                  140600      
003920 01 RM-IMP-NODO                           PIC 9(04).              140700      
003921 01 RM-IMP-NODO-R                         REDEFINES RM-IMP-NODO.  140800      
003922    02 RM-IMP-NOD                         PIC 9(02).              140900      
003923    02 RM-IMP-SUB                         PIC 9(02).              141000      
003924                                                                  141100      
003925 01 WKS-TOTALES-CTA-PAQCONTAB.                                    141200      
003926    02 WKS-TCP-CARGOS                     PIC S9(16)V99 COMP.     141300      
003927    02 WKS-TCP-ABONOS                     PIC S9(16)V99 COMP.     141400      
003928                                                                  141500      
003929 01 WKS-NUM-PAQCONTAB.                                            141600      
003930    03 WKS-NUM-PAQUETES  OCCURS 4 TIMES.                          141700      
003931       05 WKS-PAQ-ABIERTO                 PIC 9(01).              141800      
003932                                                                  141900      
003933 01 WKS-TOT-MONEDA.                                               142000      
003934    02 WKS-TOT-CARM                       PIC 9(14)V99.           142100      
003935    02 WKS-TOT-ABOM                       PIC 9(14)V99.           142200      
003936                                                                  142300      
003937 01 WKS-CTA-5000                          PIC 9(12).              142400      
003938 01 WKS-CTA-5000-R REDEFINES WKS-CTA-5000.                        142500      
003939    03 WKS-CTA4D-5000                     PIC 9(04).              142600      
003940    03 WKS-CTA2D-5000                     PIC 9(02).              142700      
003941    03 WKS-CTA6D-5000                     PIC 9(06).              142800      
003942                                                                  142900      
003943 01 WKS-CTA-5000-CEROS.                                           143000      
003944    03 WKS-CTA5000-6D1                    PIC 9(06).              143100      
003945    03 WKS-CTA5000-6D2                    PIC 9(06).              143200      
003946                                                                  143300      
003947 01 WKS-TOTALES-PAQCONTAB.                                        143400      
003948    02 WKS-TP-NUMREG                      PIC 9(08)    COMP.      143500      
003949    02 WKS-TP-CARGOS                      PIC S9(16)V99 COMP.     143600      
003950    02 WKS-TP-ABONOS                      PIC S9(16)V99 COMP.     143700      
003951                                                                  143800      
003952 01 WKS-TOT-115-PAQCONTAB2.                                       143900      
003953    02 WKS-TP-115-DIF                     PIC S9(16)V99 COMP.     144000      
003954    02 WKS-TP-115-CARGOS                  PIC S9(16)V99 COMP.     144100      
003955    02 WKS-TP-115-ABONOS                  PIC S9(16)V99 COMP.     144200      
003956                                                                  144300      
003957 01 WKS-TOTAL-SUBCTA-CONT.                                        144400      
003958    02 WKS-TSCC-CARTRA                    PIC 9(16)V99 COMP.      144500      
003959    02 WKS-TSCC-ABOTRA                    PIC 9(16)V99 COMP.      144600      
003960    02 WKS-TSCC-CARAUT                    PIC 9(16)V99 COMP.      144700      
003961    02 WKS-TSCC-ABOAUT                    PIC 9(16)V99 COMP.      144800      
003962    02 WKS-TSCC-SDOANT                    PIC S9(17)V99 COMP.     144900      
003963    02 WKS-TSCC-SDOACT                    PIC S9(17)V99 COMP.     145000      
003964                                                                  145100      
003965 01 WKS-TOTAL-CUENTA.                                             145200      
003966    02 WKS-TC-CARTRA                      PIC 9(16)V99 COMP.      145300      
003967    02 WKS-TC-ABOTRA                      PIC 9(16)V99 COMP.      145400      
003968    02 WKS-TC-CARAUT                      PIC 9(16)V99 COMP.      145500      
003969    02 WKS-TC-ABOAUT                      PIC 9(16)V99 COMP.      145600      
003970    02 WKS-TC-SDOANT                      PIC S9(17)V99 COMP.     145700      
003971    02 WKS-TC-SDOACT                      PIC S9(17)V99 COMP.     145800      
003972                                                                  145900      
003973 01 WKS-TOTAL-PRODUCTO.                                           146000      
003974    02 WKS-TP-CARTRA                      PIC 9(16)V99 COMP.      146100      
003975    02 WKS-TP-ABOTRA                      PIC 9(16)V99 COMP.      146200      
003976                                                                  146300      
003977 01 WKS-TOTAL-MONEDA.                                             146400      
003978    02 WKS-TM-CARTRA                      PIC 9(16)V99 COMP.      146500      
003979    02 WKS-TM-ABOTRA                      PIC 9(16)V99 COMP.      146600      
003980                                                                  146700      
003981 01 WKS-LEY-FONTCRED-S403.                                        146800      
003982    03 WKS-LEY-FONDO                      PIC X(09).              146900      
003983    03 WKS-LEY-TCRED                      PIC X(06).              147000      
003984                                                                  147100      
003985 01 WKS-NUM-FONTCRED-S403.                                        147200      
003986    03 WKS-NUM-FONDO                      PIC 9(02).              147300      
003987    03 WKS-NUM-TCRED                      PIC 9(02).              147400      
003988                                                                  147500      
003989******************************************************************147600      
003990*                CAMPOS DE FECHAS Y HORAS                        *147700      
003991******************************************************************147800      
003992 01  WKS-FECHA-COMP               PIC 9(08).                      147900      
003993 01  WKS-FECHA-COMP-R      REDEFINES WKS-FECHA-COMP.              148000      
003994     02  WKS-FECHA-COMP-AA        PIC 9(04).                      148100      
003995     02  WKS-FECHA-COMP-MM        PIC 9(02).                      148200      
003996     02  WKS-FECHA-COMP-DD        PIC 9(02).                      148300      
003997                                                                  148400      
003998 01  WKS-HORA-COMP-HHMMSS         PIC 9(06).                      148500      
003999 01  WKS-HORA-COMP-HHMMSS-R REDEFINES WKS-HORA-COMP-HHMMSS.       148600      
004000     02  WKS-HORA-COMP-HH         PIC 9(02).                      148700      
004001     02  WKS-HORA-COMP-MM         PIC 9(02).                      148800      
004002     02  WKS-HORA-COMP-SS         PIC 9(02).                      148900      
004003                                                                  149000      
004004 01  WKS-HORA-COMPILACION.                                        149100      
004005     02  WKS-HORA-COMP            PIC 9(13).                      149200      
004006     02  FILLER                   PIC X(187).                     149300      
004007 01  WKS-FECHA-COMPILACION        PIC 9(08).                      149400      
004008                                                                  149500      
004009 01 WKS-FECHA-MAQ                         PIC 9(08).              149600      
004010 01 WKS-FECHA-MAQ-R REDEFINES WKS-FECHA-MAQ.                      149700      
004011     03 WKS-FM-AMO                        PIC 9(4).               149800      
004012     03 WKS-FM-MES                        PIC 9(2).               149900      
004013     03 WKS-FM-DIA                        PIC 9(2).               150000      
004014                                                                  150100      
004015 01 WKS-FECHA-PROCESO                     PIC 9(08).              150200      
004016 01 WKS-FECHA-PROCESO-R REDEFINES WKS-FECHA-PROCESO.              150300      
004017    03 WKS-FP-AMO                         PIC 9(4).               150400      
004018    03 WKS-FP-MES                         PIC 9(2).               150500      
004019    03 WKS-FP-DIA                         PIC 9(2).               150600      
004020 01 WKS-FEC-PROCA6D REDEFINES WKS-FECHA-PROCESO.                  150700      
004021    03 WKS-FPRO-AA1                       PIC 9(02).              150800      
004022    03 WKS-FPROCESO-A6                    PIC 9(06).              150900      
004023                                                                  151000      
004024 01 WKS-FECHA-TEMP                         PIC 9(08).             151100      
004025 01 WKS-FECHA-TEMP-R REDEFINES WKS-FECHA-TEMP.                    151200      
004026     03 WKS-MES-TEMP                       PIC 9(2).              151300      
004027     03 WKS-DIA-TEMP                       PIC 9(2).              151400      
004028     03 WKS-AMO-TEMP                       PIC 9(4).              151500      
004029                                                                  151600      
004030 01 WKS-HORA-MAQ                          PIC 9(08).              151700      
004031 01 WKS-HORA-MAQ-R REDEFINES WKS-HORA-MAQ.                        151800      
004032    03 WKS-HORA-HHMMSS                    PIC 9(06).              151900      
004033    03 FILLER                             PIC 9(02).              152000      
004034 01 WKS-HORAM-MAQ-R REDEFINES WKS-HORA-MAQ.                       152100      
004035    03 WKS-HORA-HHMM                      PIC 9(02).              152200      
004036    03 WKS-MINU-HHMM                      PIC 9(02).              152300      
004037    03 WKS-SEGU-HHMM                      PIC 9(02).              152350      
004038    03 FILLER                             PIC 9(02).              152400      
004039                                                                  152500      
004040 01  WKS-FECHA-CONT-R                     PIC 9(08).              152510      
004041 01  WKS-FECHA-CONT      REDEFINES WKS-FECHA-CONT-R.              152520      
004042     02  WKS-FECHA-CONT-AA                PIC 9(04).              152530      
004043     02  WKS-FECHA-CONT-MM                PIC 9(02).              152540      
004044     02  WKS-FECHA-CONT-DD                PIC 9(02).              152550      
004045                                                                  152560      
004046 01  WKS-FECCO-10.                                                152565      
004047     03 WKS-FECCO10-AA                    PIC 9(04).              152570      
004048     03 FILLER                            PIC X(01) VALUE "-".    152575      
004049     03 WKS-FECCO10-MM                    PIC 9(02).              152580      
004050     03 FILLER                            PIC X(01) VALUE "-".    152585      
004051     03 WKS-FECCO10-DD                    PIC 9(02).              152590      
004052***************************************************************   152600      
004053*           REPORTE DE BITACORA Y TOTALES DE TRANSMISION      *   152700      
004054***************************************************************   152800      
004055 01 WSR-ENCAB-1.                                                  152900      
004056    03 FILLER                             PIC X(10) VALUE         153000      
004057       "S151-P107-".                                              153100      
004058    03 WSR-RB-E1-NOMB-REPORTE             PIC X(16) VALUE SPACES. 153200      
004059    03 FILLER                             PIC X(14) VALUE SPACES. 153300      
004060    03 FILLER                             PIC X(42) VALUE         153400      
004061       "ADMINISTRACION  DE  SALDOS  Y  MOVIMIENTOS".              153500      
004062    03 FILLER                             PIC X(14) VALUE SPACES. 153600      
004063    03 FILLER                             PIC X(26) VALUE         153700      
004064       "FECHA DE LA INFORMACION : ".                              153800      
004065      03 WSR-RB-E1-FECHA-INF                PIC 9999/99/99.       153900      
004066                                                                  154000      
004067 01 WSR-ENCAB-2.                                                  154100      
004068     03 FILLER                          PIC X(11) VALUE           154200      
004069        "F.PROCESO: ".                                            154300      
004070     03 WSR-RB-E2-FECHA-PROC              PIC 9999/99/99.         154400      
004071     03 FILLER                          PIC X(01) VALUE SPACES.   154500      
004072     03 WSR-RB-E2-HORA-TIT              PIC 9(02).                154600      
004073     03 FILLER                          PIC X(01) VALUE ":".      154620      
004074     03 WSR-RB-E2-MINU-TIT              PIC 9(02).                154640      
004075     03 FILLER                          PIC X(01) VALUE ":".      154660      
004076     03 WSR-RB-E2-SEGU-TIT              PIC 9(02).                154680      
004077     03 FILLER                          PIC X(03) VALUE SPACES.   154700      
004078     03 WSR-RB-E2-TITULO                PIC X(66) VALUE SPACES.   154800      
004079     03 FILLER                          PIC X(06) VALUE SPACES.   154900      
004080     03 FILLER                          PIC X(14) VALUE           155000      
004081        "TIPO PROCESO: ".                                         155100      
004082     03 WSR-RB-E2-TIPO-PROC               PIC X(13) VALUE SPACES. 155200      
004083                                                                  155300      
004084 01 WSR-ENCAB-3.                                                  155400      
004085     03 FILLER                            PIC X(11) VALUE         155500      
004086        "VERSION  : ".                                            155600      
004087       03 WSR-RB-E3-VERSION                 PIC 9999/99/99.       155700      
004088     03 FILLER                            PIC X(23) VALUE SPACES. 155800      
004089     03 FILLER                            PIC X(13) VALUE         155900      
004090        "DEL SISTEMA S".                                          156000      
004091     03 WSR-RB-E3-SISTEMA                 PIC 9(03).              156100      
004092     03 FILLER                            PIC X(02) VALUE SPACES. 156200      
004093     03 WSR-RB-E3-NOMB-SIST               PIC X(20).              156300      
004094     03 FILLER                            PIC X(35) VALUE SPACES. 156400      
004095     03 FILLER                            PIC X(07) VALUE         156500      
004096        "HOJA : ".                                                156600      
004097     03 WSR-RB-E3-HOJA                    PIC ZZZZZ9.             156700      
004098                                                                  156800      
004099 01 WSR-ENCAB-4.                                                  156900      
004100     03 WSR-NUM-SUCURSAL                  PIC ZZZ9.               157000      
004101     03 FILLER                            PIC X(04) VALUE SPACES. 157100      
004102     03 WSR-E4-TITULO                     PIC X(75) VALUE SPACES. 157200      
004103     03 FILLER                            PIC X(32) VALUE SPACES. 157300      
004104                                                                  157400      
004105 01 WSR-ENCAB-5.                                                  157500      
004106     03 WSR-SUCURSAL-NOMBRE               PIC X(40).              157600      
004107                                                                  157700      
004108 01 WSR-ENCAB-6.                                                  157800      
004109     03 FILLER                            PIC X(05) VALUE "CAJA:".157900      
004110     03 FILLER                            PIC X(07) VALUE SPACES. 158000      
004111     03 WSR-CAJA                          PIC Z9.                 158100      
004112                                                                  158200      
004113 01 WSR-ENCAB-7.                                                  158300      
004114     03 FILLER                  PIC X(03) VALUE SPACES.           158400      
004115     03 FILLER                  PIC X(08) VALUE " TC/PRO ".       158500      
004116     03 FILLER                  PIC X(05) VALUE "FO/IN".          158600      
004117     03 FILLER                  PIC X(1)  VALUE SPACES.           158700      
004118     03 FILLER                  PIC X(08) VALUE "AUTORIZA".       158800      
004119     03 FILLER                  PIC X(1)  VALUE SPACES.           158900      
004120     03 FILLER                  PIC X(8)  VALUE "CONCEPTO".       159000      
004121     03 FILLER                  PIC X(18) VALUE SPACES.           159100      
004122     03 FILLER                  PIC X(3)  VALUE "MON".            159200      
004123     03 FILLER                  PIC X(02) VALUE SPACES.           159300      
004124     03 FILLER                  PIC X(11)                         159400      
004125                                   VALUE " REFERENCIA".           159500      
004126     03 FILLER                  PIC X(08) VALUE SPACES.           159600      
004127     03 FILLER                  PIC X(13)                         159700      
004128                                   VALUE "I M P O R T E".         159800      
004129     03 FILLER                  PIC X(02) VALUE SPACES.           159900      
004130     03 FILLER                  PIC X(4)  VALUE "TIPO".           160000      
004131     03 FILLER                  PIC X(09) VALUE SPACES.           160100      
004132     03 FILLER                  PIC X(17)                         160200      
004133                                   VALUE "SUCURSAL Y CUENTA".     160300      
004134     03 FILLER                  PIC X(02) VALUE SPACES.           160400      
004135     03 FILLER                  PIC X(4)  VALUE "HORA".           160500      
004136     03 FILLER                  PIC X(1)  VALUE SPACES.           160600      
004137     03 FILLER                  PIC X(8)  VALUE "OPERADOR".       160700      
004138                                                                  160800      
004139 01 WSR-ENCAB-8.                                                  160900      
004140     03 FILLER                  PIC X(03)  VALUE SPACES.          161000      
004141     03 FILLER                  PIC X(08)  VALUE "CREDITO ".      161100      
004142     03 FILLER                  PIC X(06)  VALUE "ZACION".        161200      
004143     03 FILLER                  PIC X(65)  VALUE SPACES.          161300      
004144     03 FILLER                  PIC X(04)  VALUE "MOV.".          161400      
004145                                                                  161500      
004146 01 WSR-LINEA-DETALLE.                                            161600      
004147     03 WSR-LOCAL-FOR           PIC X(03)  VALUE SPACE.           161700      
004148     03 FILLER                  PIC X    VALUE SPACE.             161800      
004149     03 WSR-TC                  PIC X(08).                        161900      
004150     03 FILLER                  PIC X    VALUE "-".               162000      
004151     03 WSR-FONDO               PIC Z9.                           162100      
004152     03 FILLER                  PIC X(1) VALUE SPACES.            162200      
004153     03 WSR-AUTORIZACION        PIC Z(7)9.                        162300      
004154     03 FILLER                  PIC X(1) VALUE SPACES.            162400      
004155     03 WSR-CVETRAN             PIC ZZZZ.                         162500      
004156     03 FILLER                  PIC X(1) VALUE "-".               162600      
004157     03 WSR-TM                  PIC 9.                            162700      
004158     03 FILLER                  PIC X(1) VALUE "-".               162800      
004159     03 WSR-LEYENDA             PIC X(20).                        162900      
004160     03 FILLER                  PIC X(01) VALUE SPACES.           163000      
004161     03 WSR-MONEDA              PIC Z(2).                         163100      
004162     03 FILLER                  PIC X(01) VALUE SPACES.           163200      
004163     03 WSR-REFERENCIA          PIC Z(12).                        163300      
004164     03 FILLER                  PIC X(01) VALUE SPACES.           163400      
004165     03 WSR-IMPORTE             PIC ZZ,ZZZ,ZZZ,ZZ9.99.            163500      
004166     03 FILLER                  PIC X(01) VALUE SPACES.           163600      
004167     03 WSR-CONCEPTO            PIC X(3).                         163700      
004168     03 FILLER                  PIC X(01) VALUE SPACES.           163800      
004169     03 WSR-MEDIO-ACCESO        PIC X(03).                        163900      
004170     03 FILLER                  PIC X(01) VALUE SPACE.            164000      
004171     03 WSR-SUC-PROM            PIC Z(4).                         164100      
004172     03 FILLER                  PIC X(01) VALUE "/".              164200      
004173     03 WSR-CONTRATO            PIC Z(16).                        164300      
004174     03 FILLER                  PIC X(01) VALUE SPACES.           164400      
004175     03 WSR-HORA-HH             PIC 9(02).                        164500      
004176     03 FILLER                  PIC X(01) VALUE ":".              164520      
004177     03 WSR-HORA-MM             PIC 9(02).                        164540      
004178     03 FILLER                  PIC X(01) VALUE SPACES.           164600      
004179     03 WSR-OPERADOR            PIC Z(8).                         164700      
004180                                                                  164800      
004181 01  WSR-DETALLE-CORTE.                                           164900      
004182     03  FILLER                   PIC X(04) VALUE SPACES.         165000      
004183     03  WSR-DC-CONCEPTO          PIC X(25).                      165100      
004184     03  FILLER                   PIC X(03) VALUE SPACES.         165200      
004185     03  WSR-NUM-CARGOS           PIC ZZZ,ZZ9.                    165300      
004186     03  FILLER                   PIC X(03) VALUE SPACES.         165400      
004187     03  WSR-IMP-CARGOS           PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99.       165500      
004188     03  FILLER                   PIC X(03) VALUE SPACES.         165600      
004189     03  WSR-NUM-ABONOS           PIC ZZZ,ZZ9.                    165700      
004190     03  FILLER                   PIC X(03) VALUE SPACES.         165800      
004191     03  WSR-IMP-ABONOS           PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99.       165900      
004192     03  FILLER                   PIC X(03) VALUE SPACES.         166000      
004193     03  WSR-NUM-NCONTABLES       PIC ZZZ,ZZ9.                    166100      
004194     03  FILLER                   PIC X(03) VALUE SPACES.         166200      
004195     03  WSR-IMP-NCONTABLES       PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99.       166300      
004196                                                                  166400      
004197 01 WSR-TITULO-CORTE-BITACORA.                                    166500      
004198    02 WSR-TCB-LEYENDA            PIC X(25).                      166600      
004199    02 FILLER                     PIC X(05) VALUE SPACES.         166700      
004200    02 FILLER                     PIC X(21) VALUE                 166800      
004201                                  "      C A R G O S    ".        166900      
004202    02 FILLER                     PIC X(25) VALUE                 167000      
004203                                  "                  A B O N".    167100      
004204    02 FILLER                     PIC X(06) VALUE                 167200      
004205                                  " O S  ".                       167300      
004206    02 FILLER                     PIC X(16) VALUE SPACES.         167400      
004207    02 FILLER                     PIC X(28) VALUE                 167500      
004208                                  "    N O   C O N T A B L E S ". 167600      
004209                                                                  167700      
004210 01 WSR-TITULO-CORTE-BITACORA-2.                                  167800      
004211    02 FILLER                     PIC X(32) VALUE SPACES.         167900      
004212    02 FILLER                     PIC X(07) VALUE "=======".      168000      
004213    02 FILLER                     PIC X(03) VALUE SPACES.         168100      
004214    02 FILLER                     PIC X(20) VALUE ALL "=".        168200      
004215    02 FILLER                     PIC X(03) VALUE SPACES.         168300      
004216    02 FILLER                     PIC X(07) VALUE "=======".      168400      
004217    02 FILLER                     PIC X(03) VALUE SPACES.         168500      
004218    02 FILLER                     PIC X(20) VALUE ALL "=".        168600      
004219    02 FILLER                     PIC X(03) VALUE SPACES.         168700      
004220    02 FILLER                     PIC X(07) VALUE "=======".      168800      
004221    02 FILLER                     PIC X(03) VALUE SPACES.         168900      
004222    02 FILLER                     PIC X(20) VALUE ALL "=".        169000      
004223                                                                  169100      
004224 01 WSR-TITULO-CORTE-PARCIAL-SUC.                                 169200      
004225    02 FILLER                     PIC X(25) VALUE                 169300      
004226                                 "TOTAL DE LA SUCURSAL".          169400      
004227    02 FILLER                     PIC X(05) VALUE SPACES.         169500      
004228    02 FILLER                     PIC X(21) VALUE                 169600      
004229                                  "      C A R G O S    ".        169700      
004230    02 FILLER                     PIC X(25) VALUE                 169800      
004231                                  "                  A B O N".    169900      
004232    02 FILLER                     PIC X(06) VALUE                 170000      
004233                                  " O S  ".                       170100      
004234    02 FILLER                     PIC X(16) VALUE SPACES.         170200      
004235    02 FILLER                     PIC X(28) VALUE                 170300      
004236                                  "    N O   C O N T A B L E S ". 170400      
004237                                                                  170500      
004238 01 WSR-TITULO-CORTE-MONEDA.                                      170600      
004239      03  FILLER                  PIC X(08) VALUE "MONEDA: ".     170700      
004240      03  FILLER                  PIC X     VALUE SPACES.         170800      
004241      03  WSR-CORTE-CVE-MONEDA    PIC ZZ9.                        170900      
004242      03  FILLER                  PIC X(2) VALUE SPACES.          171000      
004243      03  WSR-CORTE-NOMBRE-MONEDA PIC X(40).                      171100      
004244*                                                                 171200      
004245 01 WSR-TITULO-CORTE-LIBRO.                                       171300      
004246      03  WSR-CORTE-NOMBRE-LIBRO  PIC X(40).                      171400      
004247*                                                                 171500      
004248 01 WSR-TITULO-CSI.                                               171600      
004249    02  FILLER                    PIC X(04) VALUE "CSI ".         171700      
004250    02  WSR-TIT-CSI               PIC X(20).                      171800      
004251    02  FILLER                    PIC X(02) VALUE SPACES.         171900      
004252    02  WSR-TIT-CONT              PIC X(22).                      172000      
004253                                                                  172100      
004254                                                                  172200      
004255 01 WKS-TITULO-NO-INFORMACION.                                    172300      
004256    02 FILLER                      PIC X(29) VALUE SPACES.        172400      
004257    02 FILLER                      PIC X(46) VALUE                172500      
004258       "                           NO HUBO INFORMACION".          172600      
004259                                                                  172700      
004260 01 WKS-REP-TCSI-VACIO             PIC 9(01).                     172800      
004261                                                                  172900      
004262 01 WKS-REP-TMREC-VACIO            PIC 9(01).                     173000      
004263                                                                  173100      
004264 01 WSR-TIT-SIST-HD.                                              173200      
004265    03 WKS-TITU-S-C               PIC X(01).                      173300      
004266    03 WKS-TITU-SIST              PIC 9(03).                      173400      
004267                                                                  173500      
004268 01 WSR-TIT-SIST-HD-R REDEFINES WSR-TIT-SIST-HD PIC X(04).        173600      
004269******************************************************************173700      
004270*                     TOTALES POR CLAVE                          *173800      
004271******************************************************************173900      
004272 01  WLI-TIT1-RESUM.                                              174000      
004273     03 FILLER                     PIC X(23) VALUE                174100      
004274        "S151-P107-004S151TOTCVE".                                174200      
004275     03 FILLER                     PIC X(22) VALUE SPACES.        174300      
004276     03 FILLER                     PIC X(42) VALUE                174400      
004277              "ADMINISTRACION  DE  SALDOS  Y  MOVIMIENTOS".       174500      
004278     03 FILLER                     PIC X(09) VALUE SPACES.        174600      
004279     03 FILLER                     PIC X(26) VALUE                174700      
004280                              "FECHA DE LA INFORMACION : ".       174800      
004281     03 WLI-RP-E1-FECHA-INF        PIC 9999/99/99.                174900      
004282                                                                  175000      
004283 01  WLI-TIT2-RESUM.                                              175100      
004284     03 FILLER                     PIC X(11) VALUE                175200      
004285        "F.PROCESO: ".                                            175300      
004286     03 WLI-RP-E2-FECHA-PROC       PIC 9999/99/99.                175400      
004287     03 FILLER                     PIC X      VALUE SPACE.        175500      
004288     03 WLI-RP-E2-HORA-TIT         PIC 9(02).                     175600      
004289     03 FILLER                     PIC X(01) VALUE ":".           175620      
004290     03 WLI-RP-E2-MINU-TIT         PIC 9(02).                     175640      
004291     03 FILLER                     PIC X(01) VALUE ":".           175660      
004292     03 WLI-RP-E2-SEGU-TIT         PIC 9(02).                     175680      
004293     03 FILLER                     PIC X(22) VALUE SPACES.        175700      
004294     03 FILLER                     PIC X(27) VALUE                175800      
004295              "     TOTALES POR CLAVE ".                          175900      
004296     03 FILLER                     PIC X(29) VALUE SPACES.        176000      
004297     03 FILLER                     PIC X(24) VALUE                176100      
004298        "TIPO DE PROCESO : DIARIO".                               176200      
004299                                                                  176300      
004300******************************************************************176400      
004301*                     TOTALES POR PROCESO                        *176500      
004302******************************************************************176600      
004303 01  WLI-TIT1-PROCE.                                              176700      
004304     03 FILLER                     PIC X(23) VALUE                176800      
004305        "S151-P107-005S151TOTPRO".                                176900      
004306     03 FILLER                     PIC X(22) VALUE SPACES.        177000      
004307     03 FILLER                     PIC X(42) VALUE                177100      
004308              "ADMINISTRACION  DE  SALDOS  Y  MOVIMIENTOS".       177200      
004309     03 FILLER                     PIC X(09) VALUE SPACES.        177300      
004310     03 FILLER                     PIC X(26) VALUE                177400      
004311                              "FECHA DE LA INFORMACION : ".       177500      
004312     03 WLI-RP-E5-FECHA-INF        PIC 9999/99/99.                177600      
004313                                                                  177700      
004314 01  WLI-TIT2-PROCE.                                              177800      
004315     03 FILLER                     PIC X(11) VALUE                177900      
004316        "F.PROCESO: ".                                            178000      
004317     03 WLI-RP-E5-FECHA-PROC       PIC 9999/99/99.                178100      
004318     03 FILLER                     PIC X      VALUE SPACE.        178200      
004319     03 WLI-RP-E5-HORA-PROC        PIC 9(02).                     178300      
004320     03 FILLER                     PIC X(01) VALUE ":".           178320      
004321     03 WLI-RP-E5-MINU-PROC        PIC 9(02).                     178340      
004322     03 FILLER                     PIC X(01) VALUE ":".           178360      
004323     03 WLI-RP-E5-SEGU-PROC        PIC 9(02).                     178380      
004324     03 FILLER                     PIC X(22) VALUE SPACES.        178400      
004325     03 FILLER                     PIC X(27) VALUE                178500      
004326              "   TOTALES POR PROCESO ".                          178600      
004327     03 FILLER                     PIC X(27) VALUE SPACES.        178700      
004328     03 FILLER                     PIC X(26) VALUE                178800      
004329        "TIPO DE PROCESO : ESPECIAL".                             178900      
004330                                                                  179000      
004331 01 WSR-TITULO-CORTE-PROCESO.                                     179100      
004332      03  FILLER                  PIC X(09) VALUE "PROCESO: ".    179200      
004333      03  FILLER                  PIC X(03) VALUE SPACES.         179300      
004334      03  WSR-CORTE-NUM-PROCESO   PIC Z9.                         179400      
004335                                                                  179500      
004336******************************************************************179600      
004337*                     CUADRE CONTABLE                            *179700      
004338******************************************************************179800      
004339                                                                  179900      
004340 01 WKS-TIT1-CUADCON.                                             180000      
004341    03 FILLER                             PIC X(10) VALUE         180100      
004342       "S151-P107-".                                              180200      
004343    03 WSR-RC-E1-NOMB-REPORTE             PIC X(18) VALUE SPACES. 180300      
004344    03 FILLER                             PIC X(16) VALUE SPACES. 180400      
004345    03 FILLER                             PIC X(42) VALUE         180500      
004346       "ADMINISTRACION  DE  SALDOS  Y  MOVIMIENTOS".              180600      
004347    03 FILLER                             PIC X(10) VALUE SPACES. 180700      
004348    03 FILLER                             PIC X(26) VALUE         180800      
004349       "FECHA DE LA INFORMACION : ".                              180900      
004350      03 WSR-RC-E1-FECHA-INF                PIC 9999/99/99.       181000      
004351                                                                  181100      
004352 01 WKS-TIT2-CUADCON.                                             181200      
004353     03 FILLER                          PIC X(11) VALUE           181300      
004354        "F.PROCESO: ".                                            181400      
004355       03 WSR-RC-E2-FECHA-PROC            PIC 9999/99/99.         181500      
004356     03 FILLER                          PIC X      VALUE SPACE.   181600      
004357     03 WSR-RC-E2-HORA-TIT              PIC 9(02).                181700      
004358     03 FILLER                          PIC X(01) VALUE ":".      181720      
004359     03 WSR-RC-E2-MINU-TIT              PIC 9(02).                181740      
004360     03 FILLER                          PIC X(01) VALUE ":".      181760      
004361     03 WSR-RC-E2-SEGU-TIT              PIC 9(02).                181780      
004362     03 FILLER                          PIC X(04) VALUE SPACES.   181800      
004363     03 WSR-RC-E2-TITULO                PIC X(66) VALUE SPACES.   181900      
004364     03 FILLER                          PIC X(10) VALUE SPACES.   182000      
004365     03 FILLER                          PIC X(14) VALUE           182100      
004366        "TIPO PROCESO: ".                                         182200      
004367     03 WSR-RC-E2-TIPO-PROC             PIC X(13) VALUE SPACES.   182300      
004368                                                                  182400      
004369  01 WKS-TIT3-CUADCON.                                            182500      
004370      03 FILLER                            PIC X(11) VALUE        182600      
004371         "VERSION  : ".                                           182700      
004372        03 WSR-RC-E3-VERSION                 PIC 9999/99/99.      182800      
004373      03 FILLER                            PIC X(25) VALUE SPACES.182900      
004374      03 FILLER                            PIC X(13) VALUE        183000      
004375         "DEL SISTEMA S".                                         183100      
004376      03 WSR-RC-E3-SISTEMA               PIC 9(03).               183200      
004377      03 FILLER                          PIC X(02) VALUE SPACES.  183300      
004378      03 WSR-RC-E3-NOMB-SIST             PIC X(20).               183400      
004379      03 FILLER                          PIC X(33) VALUE SPACES.  183500      
004380      03 FILLER                         PIC X(07) VALUE "HOJA : ".183600      
004381      03 WSR-RC-E3-HOJA                  PIC ZZZZZ9.              183700      
004382                                                                  183800      
004383 01 WKS-TIT5-CUADCON.                                             183900      
004384    03 FILLER                 PIC X(26) VALUE "C U E N T A".      184000      
004385    03 FILLER                 PIC X(43) VALUE SPACES.             184100      
004386    03 FILLER                 PIC X(07) VALUE " CARGOS".          184200      
004387    03 FILLER                 PIC X(24) VALUE SPACES.             184300      
004388    03 FILLER                 PIC X(08) VALUE " ABONOS ".         184400      
004389                                                                  184500      
004390 01 WSR-NOMB-CUENTA-CONTABLE.                                     184600      
004391    03 WSR-NUM-CTAMAY         PIC 9(04).                          184700      
004392                                                                  184800      
004393 01 WSR-NOMB-MONEDA.                                              184900      
004394    03 FILLER                 PIC X(14) VALUE "     MONEDA : ".   185000      
004395    03 WSR-NUM-MONEDA         PIC ZZZ9.                           185100      
004396    03 FILLER                 PIC X(02) VALUE SPACES.             185200      
004397    03 WSR-NOMBRE-MONEDA      PIC X(40).                          185300      
004398    03 FILLER                 PIC X(06) VALUE SPACES.             185400      
004399    03 WSR-TIT-FID            PIC X(15) VALUE SPACES.             185500      
004400    03 WSR-NUM-FID            PIC ZZZZZZ.                         185600      
004401                                                                  185700      
004402 01 WSR-NOMB-PRODUCTO.                                            185800      
004403    03 WSR-TIT-PROD           PIC X(14) VALUE SPACES.             185900      
004404    03 WSR-NUM-PROD           PIC ZZZ9.                           186000      
004405    03 FILLER                 PIC X(02) VALUE SPACES.             186100      
004406    03 WSR-NOMBRE-PROD        PIC X(40).                          186200      
004407                                                                  186300      
004408 01 WSR-DET-CUADRE.                                               186400      
004409    03 FILLER                 PIC X(03) VALUE SPACES.             186500      
004410    03 WSR-DC-CUENTA          PIC Z(06).                          186600      
004411    03 FILLER                 PIC X(01) VALUE SPACES.             186700      
004412    03 WSR-DC-NOMCTA          PIC X(28).                          186800      
004413    03 FILLER                 PIC X(21) VALUE SPACES.             186900      
004414    03 WSR-DC-CARTRA          PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99.           187000      
004415    03 FILLER                 PIC X(11) VALUE SPACES.             187100      
004416    03 WSR-DC-ABOTRA          PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99.           187200      
004417                                                                  187300      
004418 01 WSR-TOTALES-CUADRE.                                           187400      
004419    03 FILLER                 PIC X(10) VALUE SPACES.             187500      
004420    03 FILLER                 PIC X(17) VALUE "TOTAL DE LA CTA  ".187600      
004421    03 WSR-CTA4               PIC ZZZZ.                           187700      
004422    03 FILLER                 PIC X(28) VALUE SPACES.             187800      
004423    03 WSR-TC-CARTRA          PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99.           187900      
004424    03 FILLER                 PIC X(11) VALUE SPACES.             188000      
004425    03 WSR-TC-ABOTRA          PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99.           188100      
004426                                                                  188200      
004427****************************************************************  188300      
004428*                 REPORTE DEL PROCESO                          *  188400      
004429****************************************************************  188500      
004430 01 WSR-ENCAB-P1.                                                 188600      
004431    03 FILLER                             PIC X(10) VALUE         188700      
004432       "S151-P107-".                                              188800      
004433    03 FILLE                              PIC X(16) VALUE         188900      
004434       "000S151ERRORES. ".                                        189000      
004435    03 FILLER                             PIC X(16) VALUE SPACES. 189100      
004436    03 FILLER                             PIC X(42) VALUE         189200      
004437       "ADMINISTRACION  DE  SALDOS  Y  MOVIMIENTOS".              189300      
004438    03 FILLER                             PIC X(12) VALUE SPACES. 189400      
004439    03 FILLER                             PIC X(26) VALUE         189500      
004440       "FECHA DE LA INFORMACION : ".                              189600      
004441      03 WSR-RB-P1-FECHA-INF                PIC 9999/99/99.       189700      
004442                                                                  189800      
004443 01 WSR-ENCAB-P2.                                                 189900      
004444     03 FILLER                          PIC X(11) VALUE           190000      
004445        "F.PROCESO: ".                                            190100      
004446     03 WSR-RB-P2-FECHA-PROC            PIC 9999/99/99.           190200      
004447     03 FILLER                          PIC X(01) VALUE SPACES.   190300      
004448     03 WSR-RB-P2-HORA-TIT              PIC 9(02).                190400      
004449     03 FILLER                          PIC X(01) VALUE ":".      190420      
004450     03 WSR-RB-P2-MINU-TIT              PIC 9(02).                190440      
004451     03 FILLER                          PIC X(01) VALUE ":".      190460      
004452     03 WSR-RB-P2-SEGU-TIT              PIC 9(02).                190480      
004453     03 FILLER                          PIC X(13) VALUE SPACES.   190500      
004454     03 FILLER                          PIC X(38) VALUE           190600      
004455     "REPORTE DE MOVIMIENTOS CON ERROR DEL S".                    190700      
004456     03 WSR-RB-P2-SISTEMA               PIC 999.                  190800      
004457     03 FILLER                          PIC X(13) VALUE SPACES.   190900      
004458     03 FILLER                          PIC X(14) VALUE           191000      
004459        "TIPO PROCESO: ".                                         191100      
004460     03 FILLER                          PIC X(13) VALUE           191200      
004461     "DIARIO       ".                                             191300      
004462                                                                  191400      
004463 01 WSR-ENCAB-MOVS.                                               191500      
004464    02 FILLER                 PIC X(43) VALUE                     191600      
004465       "MON  PROD  INST  ORIGEN      CONTRATO   CVE".             191700      
004466    02 FILLER                 PIC X(45) VALUE                     191800      
004467       "         IMPORTE         MDA   AUTS151 STATUS".           191900      
004468                                                                  192000      
004469 01 WSR-ENCAB-MOVS-CRED.                                          192100      
004470    02 FILLER                 PIC X(43) VALUE                     192200      
004471       "MON  TIPCR FONDO ORIGEN      CONTRATO   CVE".             192300      
004472    02 FILLER                 PIC X(45) VALUE                     192400      
004473       "         IMPORTE         MDA   AUTS151 STATUS".           192500      
004474                                                                  192600      
004475 01 WSR-REPORTE-MOVS.                                             192700      
004476    02 FILLER                 PIC X     VALUE SPACES.             192800      
004477    02 WSR-RM-MONEDA          PIC Z9.                             192900      
004478    02 FILLER                 PIC X(02) VALUE SPACES.             193000      
004479    02 WSR-RM-PROD            PIC ZZZ9.                           193100      
004480    02 FILLER                 PIC X(03) VALUE SPACES.             193200      
004481    02 WSR-RM-INST            PIC Z9.                             193300      
004482    02 FILLER                 PIC X(05) VALUE SPACES.             193400      
004483    02 WSR-RM-ORIGEN          PIC Z9.                             193500      
004484    02 FILLER                 PIC X(04) VALUE SPACES.             193600      
004485    02 WSR-RM-CONTRATO        PIC ZZZZZZZZZZZ9.                   193700      
004486    02 FILLER                 PIC X(02) VALUE SPACES.             193800      
004487    02 WSR-RM-CVE             PIC ZZZ9.                           193900      
004488    02 FILLER                 PIC X(02) VALUE SPACES.             194000      
004489    02 WSR-RM-IMPORTE         PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.         194100      
004490    02 FILLER                 PIC X(02) VALUE SPACES.             194200      
004491    02 WSR-RM-MDA             PIC Z9.                             194300      
004492    02 FILLER                 PIC X(02) VALUE SPACES.             194400      
004493    02 WSR-RM-AUT-S151        PIC ZZZZZZZ9.                       194500      
004494    02 FILLER                 PIC X(03) VALUE SPACES.             194600      
004495    02 WSR-RM-STATUS          PIC Z9.                             194700      
004496    02 FILLER                 PIC X(03) VALUE SPACES.             194800      
004497    02 WSR-RM-TIPO-PROC       PIC Z9.                             194900      
004498                                                                  195000      
004499 01 WSR-ENCAB-CTAS-CONT.                                          195100      
004500    02 FILLER                 PIC X(41) VALUE                     195200      
004501       "MON  PROD  INST       CUENTA ORIGEN   CVE".               195300      
004502    02 FILLER                 PIC X(42) VALUE                     195400      
004503       "            IMPORTE      TIPO NAT  AUTS151".              195500      
004504                                                                  195600      
004505 01 WSR-ENCAB-CTAS-CONT-CRED.                                     195700      
004506    02 FILLER                 PIC X(41) VALUE                     195800      
004507       "MON  TIPCR FONDO      CUENTA ORIGEN   CVE".               195900      
004508    02 FILLER                 PIC X(42) VALUE                     196000      
004509       "            IMPORTE      TIPO NAT  AUTS151".              196100      
004510                                                                  196200      
004511 01 WSR-REPORTE-CTAS-CONT.                                        196300      
004512    02 FILLER                 PIC X     VALUE SPACES.             196400      
004513    02 WSR-RCC-MONEDA         PIC Z9.                             196500      
004514    02 FILLER                 PIC X(02) VALUE SPACES.             196600      
004515    02 WSR-RCC-PROD           PIC ZZZ9.                           196700      
004516    02 FILLER                 PIC X(03) VALUE SPACES.             196800      
004517    02 WSR-RCC-INST           PIC Z9.                             196900      
004518    02 FILLER                 PIC X(02) VALUE SPACES.             197000      
004519    02 WSR-RMC-CTA-CONT         PIC Z(12).                        197100      
004520    02 FILLER                 PIC X(04) VALUE SPACES.             197200      
004521    02 WSR-RCC-ORIGEN         PIC Z(02).                          197300      
004522    02 FILLER                 PIC X(03) VALUE SPACES.             197400      
004523    02 WSR-RCC-CVETRAN        PIC ZZZ9.                           197500      
004524    02 FILLER                 PIC X(02) VALUE SPACES.             197600      
004525    02 WSR-RCC-IMPORTE        PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.         197700      
004526    02 FILLER                 PIC X(03) VALUE SPACES.             197800      
004527    02 WSR-RCC-TIPO-MOV       PIC 9.                              197900      
004528    02 FILLER                 PIC X(03) VALUE SPACES.             198000      
004529    02 WSR-RCC-NAT-MOV        PIC 9.                              198100      
004530    02 FILLER                 PIC X(02) VALUE SPACES.             198200      
004531    02 WSR-RCC-AUTS151        PIC Z(08).                          198300      
004532***********************************************************       198400      
004533**        REPORTE DE RECHAZOS EN LINEA                    *       198500      
004534***********************************************************       198600      
004535 01 WLI-DET-RECHAZOS.                                             198700      
004536    03 FILLER                     PIC XX VALUE SPACES.            198800      
004537    03 WLI-RECHA-LIBRO            PIC Z9.                         198900      
004538    03 FILLER                     PIC XX VALUE SPACES.            199000      
004539    03 WLI-RECHA-PROD             PIC Z999.                       199100      
004540    03 FILLER                     PIC X VALUE SPACES.             199200      
004541    03 WLI-RECHA-CTO              PIC ZZZZZZZZZZZ9.               199300      
004542    03 FILLER                     PIC XX VALUE SPACES.            199400      
004543    03 WLI-RECHA-FOLIO            PIC ZZZ9.                       199500      
004544    03 FILLER                     PIC X VALUE SPACES.             199600      
004545    03 WLI-RECHA-CVE              PIC ZZZ9.                       199700      
004546    03 FILLER                     PIC X VALUE SPACES.             199800      
004547    03 WLI-RECHA-ESQ              PIC ZZZ9.                       199900      
004548    03 FILLER                     PIC X VALUE SPACES.             200000      
004549    03 WLI-RECHA-IMP              PIC ZZ,ZZZ,ZZZ,ZZ9.99.          200100      
004550    03 FILLER                     PIC XX VALUE SPACES.            200200      
004551    03 WLI-RECHA-ERROR            PIC X(30) VALUE SPACES.         200300      
004552    03 WLI-RECHA-ERROR2           PIC X(12) VALUE SPACES.         200400      
004553    03 FILLER                     PIC XX VALUE SPACES.            200500      
004554    03 WLI-RECHA-AUTAPL           PIC ZZZZZZZ9.                   200600      
004555    03 FILLER                     PIC XX VALUE SPACES.            200700      
004556    03 WLI-RECHA-MON              PIC ZZZ9.                       200800      
004557    03 FILLER                     PIC XX VALUE SPACES.            200900      
004558    03 WLI-RECHA-FID              PIC ZZZZZ9.                     201000      
004559    03 FILLER                     PIC XX VALUE SPACES.            201100      
004560    03 WLI-RECHA-TERROR           PIC Z9.                         201200      
004561                                                                  201300      
004562 01 WLI-ENCDET-RECHAZOS.                                          201400      
004563    03 FILLER            PIC X(22) VALUE "LIBRO PROD   CONTRATO ".201500      
004564    03 FILLER            PIC X(20) VALUE "  FOLIO CVE.  ESQ.  ".  201600      
004565    03 FILLER            PIC X(20) VALUE "    IMPORTE         ".  201700      
004566    03 FILLER            PIC X(20) VALUE "      TIPO    DE    ".  201800      
004567    03 FILLER            PIC X(20) VALUE " ERROR              ".  201900      
004568    03 FILLER            PIC X(20) VALUE "AUT.APL.   MON.     ".  202000      
004569    03 FILLER            PIC X(12) VALUE "FIDEI. ERR".            202100      
004570                                                                  202200      
004571 01 WLI-ENCDET-RECHAZOS-CRED.                                     202300      
004572    03 FILLER            PIC X(22) VALUE "LIBRO TIPCR  CONTRATO ".202400      
004573    03 FILLER            PIC X(20) VALUE "  FOLIO CVE.  T.M.  ".  202500      
004574    03 FILLER            PIC X(20) VALUE "    IMPORTE         ".  202600      
004575    03 FILLER            PIC X(20) VALUE "      TIPO    DE    ".  202700      
004576    03 FILLER            PIC X(20) VALUE " ERROR              ".  202800      
004577    03 FILLER            PIC X(20) VALUE "AUT.APL.   MON.     ".  202900      
004578    03 FILLER            PIC X(12) VALUE "FIDEI. ERR".            203000      
004579                                                                  203100      
004580 01 WLI-DET-ERR.                                                  203200      
004581    03 WLI-NUM-ERR       PIC X(04) VALUE SPACES.                  203300      
004582    03 WLI-TIPOERR       PIC ZZZZZZZ9.                            203400      
004583                                                                  203500      
004584 01 WLI-ENCDET-TOTRECHA.                                          203600      
004585    03 FILLER            PIC X(14) VALUE "     NUMERO   ".        203700      
004586    03 FILLER            PIC X(20) VALUE "     TIPO  DE  ERROR".  203800      
004587    03 FILLER            PIC X(27) VALUE SPACES.                  203900      
004588    03 FILLER            PIC X(15) VALUE "    CLAVE ERROR".       204000      
004589                                                                  204100      
004590 01 WLI-DET-TOTRECHA.                                             204200      
004591    03 FILLER            PIC X(04) VALUE SPACES.                  204300      
004592    03 WLI-NUM-RECHA     PIC ZZZ,ZZ9.                             204400      
004593    03 FILLER            PIC X(04) VALUE SPACES.                  204500      
004594    03 WLI-TIPO-RECHA    PIC X(30) VALUE SPACES.                  204600      
004595    03 FILLER            PIC X(20) VALUE SPACES.                  204700      
004596    03 WLI-TIPO-ERROR    PIC Z9.                                  204800      
004597                                                                  204900      
004598 01 WKS-HDR-ATLAS.                                                205000      
004599*=================                                                205100      
004600       03 WKS-HDR-ATL             PIC X(02) VALUE "HD".           205200      
004601       03 WKS-HDR-ATL-CSI         PIC 9(02).                      205300      
004602       03 WKS-HDR-ATL-FEC         PIC 9(08).                      205400      
004603       03 WKS-HDR-ATL-SIS         PIC 9(04).                      205500      
004604       03 FILLER                  PIC X(44).                      205600      
004605                                                                  205700      
004606 01 WKS-REG-ATLAS.                                                205800      
004607       03 WKS-R-ATL-CUENTA        PIC 9(16).                      205900      
004608       03 WKS-R-ATL-FOLIO         PIC 9(04).                      206000      
004609       03 WKS-R-ATL-CVETRAN       PIC 9(04).                      206100      
004610       03 WKS-R-ATL-IMPORTE       PIC 9(14)V99.                   206200      
004611       03 WKS-R-ATL-SUCPROM       PIC 9(04).                      206300      
004612       03 WKS-R-ATL-SUCTRAN       PIC 9(04).                      206400      
004613       03 WKS-R-ATL-MONEDA        PIC 9(04).                      206500      
004614       03 WKS-R-ATL-BANCO         PIC 9(02).                      206600      
004615       03 WKS-R-ATL-PROD          PIC 9(04).                      206700      
004616       03 WKS-R-ATL-PROD-R REDEFINES WKS-R-ATL-PROD.              206800      
004617          05 WKS-RATL-INS            PIC 9(02).                   206900      
004618          05 WKS-RATL-FON            PIC 9(02).                   207000      
004619       03 FILLER                   PIC X(02).                     207100      
004620                                                                  207200      
004621 01 WKS-TR-ATLAS.                                                 207300      
004622       03 WKS-TR-ATLAS-TR          PIC X(02) VALUE "TR".          207400      
004623       03 WKS-TR-ATLAS-NUREG       PIC 9(06).                     207500      
004624       03 WKS-TR-ATLAS-TOTIMP      PIC 9(16)V99.                  207600      
004625       03 FILLER                   PIC X(34).                     207700      
004626                                                                  207800      
004627 01 WKS-TIT-ATLAS.                                                207900      
004628     02  WKS-S-C              PIC X(01).                          208000      
004629     02  WKS-SISTEMA          PIC 9(03).                          208100      
004630     02  FILLER               PIC X(10) VALUE "/FILE/E01/".       208200      
004631     02  WKS-CSI-OR           PIC 9(02).                          208300      
004632     02  FILLER               PIC X(10) VALUE "/12/S120/".        208400      
004633     02  WKS-FEC-SAL          PIC 9(06).                          208500      
004634     02  FILLER               PIC X(01) VALUE ".".                208600      
004635                                                                  208700      
004636 01 WKS-PROD-PASO             PIC 9(04).                          208800      
004637 01 WKS-PROD-PASO-R REDEFINES WKS-PROD-PASO.                      208900      
004638     02  WKS-FON-PASO          PIC 9(02).                         209000      
004639     02  WKS-INS-PASO          PIC 9(02).                         209100      
004640****************************************************************  209200      
004641*                 CONTADORES DE HOJAS                          *  209300      
004642****************************************************************  209400      
004643 01 CONTADORES.                                                   209500      
004644    02 WKS-NUM-HOJAS                   PIC 9(6) COMP VALUE 0.     209600      
004645    02 WKS-TOTAL-HOJAS                 PIC 9(4) COMP VALUE 0.     209700      
004646    02 WKS-NUM-LINEAS                  PIC 9(2) COMP VALUE 0.     209800      
004647    02 WKS-NUM-LINERR                  PIC 9(2) COMP VALUE 0.     209900      
004648                                                                  210000      
004649****************************************************************  210100      
004650*                 NOMBRES DE CONCEPTOS                         *  210200      
004651****************************************************************  210300      
004652                                                                  210400      
004653 01 WKS-CONCEPTOS-CAJA.                                           210500      
004654    02 WKS-CONCEP-CAJA OCCURS 16 TIMES.                           210600      
004655       04 WKS-NOMBCON-CAJA                    PIC X(22).          210700      
004656                                                                  210800      
004657 01 WKS-CONCEPTOS-CSI.                                            210900      
004658    02 FILLER     PIC X(25) VALUE "LOCAL                    ".    211000      
004659    02 FILLER     PIC X(25) VALUE "FORANEO TRANSMITIDO      ".    211100      
004660                                                                  211200      
004661 01 WKS-CONCEPTOS-CSI-RED REDEFINES WKS-CONCEPTOS-CSI.            211300      
004662    02 WKS-CONCEP-CSI OCCURS 2  TIMES.                            211400      
004663       04 WKS-NOMBCON-CSI                     PIC X(25).          211500      
004664                                                                  211600      
004665 01 WKS-NOMBRES-TOTALES-CSI.                                      211700      
004666    02 WKS-NOMB-TOT-CSI OCCURS 16 TIMES.                          211800      
004667       04 WKS-NOMBTOT-CSI                     PIC X(25).          211900      
004668                                                                  212000      
004669*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
004670* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           212100      
004671**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
004672  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
004673  01 MENSAJE-LJ.                                                  100300      
004674     02 SISTEMA-LJ     PIC X(04).                                 100400      
004675     02 FILLER         PIC X VALUE "/".                           100500      
004676     02 PASO-LJ        PIC X(04).                                 100600      
004677     02 FILLER         PIC X VALUE "/".                           100700      
004678     02 MTP-LJ         PIC 9(03).                                 100800      
004679     02 FILLER         PIC X VALUE ":".                           100900      
004680     02 TIPO-LJ        PIC X.                                     101000      
004681     02 FILLER         PIC X VALUE ">".                           101100      
004682     02 CODIGO-LJ      PIC 9(06).                                 101200      
004683     02 FILLER         PIC X VALUE "<".                           101300      
004684     02 TEXTO-LJ       PIC X(250).                                101400      
004685*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
004686*================================================================ 212200      
004687*         REGISTRO DE WORKING PARA SORT (TOTALES)               = 212300      
004688*================================================================ 212400      
004689 77  W77-NUM-LINEAS                PIC 9(02) VALUE 0.             212500      
004690 77  W77-IMPMOV                    PIC 9(16)V99.                  212600      
004691 77  W77-NUMMOV                    PIC 9(08).                     212700      
004692                                                                  212800      
004693 01  WKS-REG-SORT.                                                212900      
004694     02 WKS-RS-LLAVE               PIC X(12).                     213000      
004695     02 WKS-RS-LLAVE-R REDEFINES WKS-RS-LLAVE.                    213100      
004696        03 WKS-RS-LIBRO            PIC 9(02).                     213200      
004697        03 WKS-RS-MONEDA           PIC 9(02).                     213300      
004698        03 WKS-RS-CVETRAN          PIC 9(04).                     213400      
004699        03 WKS-RS-ESQCON           PIC 9(04).                     213500      
004700     02 WKS-RS-IMPORTE             PIC 9(14)V99.                  213600      
004701     02 FILLER                     PIC X(02).                     213700      
004702                                                                  213800      
004703 01 WKS-LIBROS.                                                   213900      
004704    03 FILLER     PIC X(22) VALUE "CONTABILIDAD BANCO    ".       214000      
004705    03 FILLER     PIC X(22) VALUE "CONTABILIDAD UDIS     ".       214100      
004706    03 FILLER     PIC X(22) VALUE "CONTABILIDAD FOBA-UDIS".       214200      
004707    03 FILLER     PIC X(22) VALUE "CONTABILIDAD FOBAPROA ".       214300      
004708    03 FILLER     PIC X(22) VALUE "LIBRO MEXICO          ".       214400      
004709    03 FILLER     PIC X(22) VALUE "LIBRO NASSAU          ".       214500      
004710    03 FILLER     PIC X(22) VALUE "LIBRO HOUSTON         ".       214600      
004711    03 FILLER     PIC X(22) VALUE "LIBRO NUEVA YORK      ".       214700      
004712    03 FILLER     PIC X(22) VALUE "LIBRO LONDRES         ".       214800      
004713    03 FILLER     PIC X(22) VALUE "LIBRO FOBAPROA MEXICO ".       214900      
004714    03 FILLER     PIC X(22) VALUE "CARTERA BURSATILIZADA ".       215000      
004715    03 FILLER     PIC X(22) VALUE "ARRENDADORA CITI      " .      215100      
004716    03 FILLER     PIC X(22) VALUE "FIDEICOMISO A CITI    ".       215200      
004717    03 FILLER     PIC X(22) VALUE "FIDEICOMISO B CITI    ".       215300      
004718    03 FILLER     PIC X(22) VALUE "LIBRO CREDITO FAMILIAR".       215400      
004719    03 FILLER     PIC X(22) VALUE "DESCONOCIDA           ".       215450      
004720                                                                  215500      
004721 01 WKS-LIBROS-R REDEFINES WKS-LIBROS.                            215600      
004722    03 WKS-NOMB-LIBRO PIC X(22) OCCURS 16 TIMES.                  215700      
004723                                                                  215800      
004724  77  W77-LEE-FIN                  PIC 9(01) VALUE 0.             215900      
004725  88  W88-LEE-FIN                            VALUE 1.             216000      
004726  77  WKS-VALUE                    PIC 9(08) VALUE 0.             216100      
004727  77  W77-940-FECPRO               PIC 9(08).                     216200      
004728******************************************************************216300      
004729*    HORA DE PROCESO                                             *216400      
004730******************************************************************216500      
004731 01  WKS-HORA-PROCESO              PIC 9(08).                     216600      
004732                                                                  216700      
004733 01  WKS-HORA-R REDEFINES WKS-HORA-PROCESO.                       216800      
004734     03 WKS-HORA-HMS               PIC 9(02).                     216900      
004735     03 WKS-MINU-HMS               PIC 9(02).                     216920      
004736     03 WKS-SEGU-HMS               PIC 9(02).                     216940      
004737     03 FILLER                     PIC X(02).                     217000      
004738************************************************************      217100      
004739*         TITULOS DEL REPORTE DE CLAVES DE TRAN.           *      217200      
004740************************************************************      217300      
004741 01 WLI-TIT3-RESUM.                                               217400      
004742     03 FILLER                     PIC X(21) VALUE  SPACES.       217500      
004743     03 FILLER                     PIC X(85) VALUE SPACES.        217600      
004744     03  WLI-NUM-LIBRO             PIC    ZZ.                     217700      
004745     03  FILLER                    PIC X(02) VALUE SPACES.        217800      
004746     03  WLI-NOMBRE-LIBRO          PIC X(22) VALUE SPACES.        217900      
004747                                                                  218000      
004748 01  WLI-TIT5-RESUM.                                              218100      
004749*     03  WLI-TIT-PROD              PIC X(12) VALUE SPACES.       218200      
004750*     03  WLI-NUM-PRO               PIC  9999.                    218300      
004751*     03  FILLER                    PIC X(02) VALUE SPACES.       218400      
004752*     03  WLI-NOMBRE-PRO            PIC X(25) VALUE SPACES.       218500      
004753*     03  FILLER                    PIC X(02) VALUE SPACES.       218600      
004754     03  WLI-NUM-MON               PIC    Z9.                     218700      
004755     03  FILLER                    PIC X(02) VALUE SPACES.        218800      
004756     03  WLI-NOMBRE-MON            PIC X(20) VALUE SPACES.        218900      
004757                                                                  219000      
004758 01  WLI-TIT5-CVES.                                               219100      
004759     03 FILLER                     PIC X(44) VALUE                219200      
004760        " LIB MON  TC    CVE   TM         N O M B R E".           219300      
004761     03 FILLER                     PIC X(32) VALUE                219400      
004762        "      EVEN   NUM           I M P".                       219500      
004763     03 FILLER                     PIC X(40) VALUE                219600      
004764        " O R T E    S028 S254                   ".               219700      
004765                                                                  219800      
004766 01  WLI-TIT5-CVES-NCRED.                                         219900      
004767     03 FILLER                     PIC X(44) VALUE                220000      
004768        " LIB MON  PROD  CVE   ESQ.       N O M B R E".           220100      
004769     03 FILLER                     PIC X(32) VALUE                220200      
004770        "      EVEN   NUM           I M P".                       220300      
004771     03 FILLER                     PIC X(40) VALUE                220400      
004772        " O R T E    S028 S254                   ".               220500      
004773                                                                  220600      
004774 01 WLI-DET-CVE.                                                  220700      
004775    03 FILLER                     PIC XX    VALUE SPACES.         220800      
004776    03 WLI-LIBRO                  PIC Z9.                         220900      
004777    03 FILLER                     PIC XX    VALUE SPACES.         221000      
004778    03 WLI-MONEDA                 PIC Z9.                         221100      
004779    03 FILLER                     PIC XX    VALUE SPACES.         221200      
004780    03 WLI-TC                     PIC ZZZ9.                       221300      
004781    03 FILLER                     PIC XX    VALUE SPACES.         221400      
004782    03 WLI-CVET                   PIC ZZZ9.                       221500      
004783    03 FILLER                     PIC X(02) VALUE SPACES.         221600      
004784    03 WLI-TM                     PIC Z9.                         221700      
004785    03 FILLER                     PIC X(02) VALUE SPACES.         221800      
004786    03 WLI-AST                    PIC X     VALUE SPACES.         221900      
004787    03 FILLER                     PIC X(02) VALUE SPACES.         222000      
004788    03 WLI-NOMBRE                 PIC X(20) VALUE SPACES.         222100      
004789    03 FILLER                     PIC X(02) VALUE SPACES.         222200      
004790    03 WLI-EVENTO                 PIC ZZ9.                        222300      
004791    03 FILLER                     PIC X(02) VALUE SPACES.         222400      
004792    03 WLI-NUMC                   PIC ZZ,ZZ9.                     222500      
004793    03 FILLER                     PIC X(04) VALUE SPACES.         222600      
004794    03 WLI-IMPC                   PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.      222700      
004795    03 FILLER                     PIC X(02) VALUE SPACES.         222800      
004796    03 WLI-AFECS028               PIC XXX   VALUE SPACES.         222900      
004797    03 FILLER                     PIC X(03) VALUE SPACES.         223000      
004798    03 WLI-AFECS115               PIC XX    VALUE SPACES.         223100      
004799    03 FILLER                     PIC X(03) VALUE SPACES.         223200      
004800    03 WLI-LEYENDA                PIC X(20) VALUE SPACES.         223300      
004801                                                                  223400      
004802 01 WKS-DET-CVES.                                                 223500      
004803    03 FILLER                     PIC X     VALUE ",".            223600      
004804    03 WKS-CVE-LIBRO              PIC 99.                         223700      
004805    03 FILLER                     PIC X     VALUE ",".            223800      
004806    03 WKS-CVE-MONEDA             PIC 99.                         223900      
004807    03 FILLER                     PIC X     VALUE ",".            224000      
004808    03 WKS-CVE-TC                 PIC 9999.                       224100      
004809    03 FILLER                     PIC X     VALUE ",".            224200      
004810    03 WKS-CVE-CVET               PIC 9999.                       224300      
004811    03 FILLER                     PIC X     VALUE ",".            224400      
004812    03 WKS-CVE-TM                 PIC 99.                         224500      
004813    03 FILLER                     PIC X     VALUE ",".            224600      
004814    03 WKS-CVE-NOMBRE             PIC X(20) VALUE SPACES.         224700      
004815    03 FILLER                     PIC X     VALUE ",".            224800      
004816    03 WKS-EVENTO                 PIC 999.                        224900      
004817    03 FILLER                     PIC X     VALUE ",".            225000      
004818    03 WKS-CVE-NUMC               PIC 999999.                     225100      
004819    03 FILLER                     PIC X     VALUE ",".            225200      
004820    03 WKS-CVE-IMPC               PIC 999999999999.99.            225300      
004821    03 FILLER                     PIC X     VALUE ",".            225400      
004822    03 WKS-CVE-AFECS028           PIC XXX   VALUE SPACES.         225500      
004823    03 FILLER                     PIC X     VALUE ",".            225600      
004824    03 WKS-CVE-AFECS115           PIC XX    VALUE SPACES.         225700      
004825    03 FILLER                     PIC X     VALUE ",".            225800      
004826    03 FILLER                     PIC XXX   VALUE SPACES.         225900      
004827******************************************************************226000      
004828*                      REGISTRO DE DESVIOS                       *226100      
004829******************************************************************226200      
004830  01 WKS-DESVIOS.                                                 226300      
004831*   02 FILLER                             PIC X     VALUE ",".    226400      
004832    02 DES-AUT-APLIC                      PIC 9(08).              226500      
004833    02 FILLER                             PIC X     VALUE ",".    226600      
004834    02 DES-CONTRATO                       PIC 9(16).              226700      
004835    02 FILLER                             PIC X     VALUE ",".    226800      
004836    02 DES-FOLIO                          PIC 9(04).              226900      
004837    02 FILLER                             PIC X     VALUE ",".    227000      
004838    02 DES-LIBRO                          PIC 9(02).              227100      
004839    02 FILLER                             PIC X     VALUE ",".    227200      
004840    02 DES-MONEDA                         PIC 9(04).              227300      
004841    02 FILLER                             PIC X     VALUE ",".    227400      
004842    02 DES-TIPOCRED                       PIC 9(04).              227500      
004843    02 FILLER                             PIC X     VALUE ",".    227600      
004844    02 DES-EVENTO                         PIC 9(04).              227700      
004845    02 FILLER                             PIC X     VALUE ",".    227800      
004846    02 DES-SUC-PROM                       PIC 9(04).              227900      
004847    02 FILLER                             PIC X     VALUE ",".    228000      
004848    02 DES-SUC-TRAN                       PIC 9(04).              228100      
004849    02 FILLER                             PIC X     VALUE ",".    228200      
004850    02 DES-AUT-S151                       PIC 9(08).              228300      
004851    02 FILLER                             PIC X     VALUE ",".    228400      
004852    02 DES-CVETRAN                        PIC 9(04).              228500      
004853    02 FILLER                             PIC X     VALUE ",".    228600      
004854    02 DES-TM                             PIC 9(02).              228700      
004855    02 FILLER                             PIC X     VALUE ",".    228800      
004856    02 DES-IMPORTE                        PIC 9(14)V99.           228900      
004857    02 FILLER                             PIC X     VALUE ",".    229000      
004858    02 DES-TIPOERR                        PIC X(07) VALUE SPACES. 229100      
004859    02 FILLER                             PIC X     VALUE ",".    229200      
004860    02 DES-DEFFECHAD                      PIC 9(06).              229300      
004861    02 FILLER                             PIC X     VALUE ",".    229400      
004862    02 DES-DEFSUCIND                      PIC 9(04).              229500      
004863    02 FILLER                             PIC X     VALUE ",".    229600      
004864    02 DES-DEFSUCPD                       PIC 9(04).              229700      
004865    02 FILLER                             PIC X     VALUE ",".    229800      
004866    02 DES-DEFCVED                        PIC 9(04).              229900      
004867    02 FILLER                             PIC X     VALUE ",".    230000      
004868    02 DES-DEFTCD                         PIC 9(02).              230100      
004869    02 FILLER                             PIC X     VALUE ",".    230200      
004870    02 DES-DEFLIBD                        PIC 9(02).              230300      
004871    02 FILLER                             PIC X     VALUE ",".    230400      
004872    02 DES-DEFTMD                         PIC 9(02).              230500      
004873    02 FILLER                             PIC X     VALUE ",".    230600      
004874                                                                  230700      
004875******************************************************************230800      
004876*           REGISTRO DEL ARCHIVO DE CUADRE CONTABLE              *230900      
004877******************************************************************231000      
004878  01 WKS-CUACON.                                                  231100      
004879    02 FILLER                             PIC X     VALUE ",".    231200      
004880    02 WKS-CC-LIBRO                       PIC 9(02).              231300      
004881    02 FILLER                             PIC X     VALUE ",".    231400      
004882    02 WKS-CC-MON                         PIC 9(02).              231500      
004883    02 FILLER                             PIC X     VALUE ",".    231600      
004884    02 WKS-CC-FID                         PIC 9(06).              231700      
004885    02 FILLER                             PIC X     VALUE ",".    231800      
004886    02 WKS-CC-CUENTA                      PIC 9(06).              231900      
004887    02 FILLER                             PIC X     VALUE ",".    232000      
004888    02 WKS-CC-CARGOS                      PIC 9(14)V99.           232100      
004889    02 FILLER                             PIC X     VALUE ",".    232200      
004890    02 WKS-CC-ABONOS                      PIC 9(14)V99.           232300      
004891    02 FILLER                             PIC X     VALUE ",".    232400      
004892                                                                  232500      
004893 01 WKS-ERROR-ALFA.                                               232600      
004894    02 WKS-ERRORA                         PIC X.                  232700      
004895    02 WKS-ERRORB                         PIC X.                  232800      
004896    02 WKS-ERRORC                         PIC X.                  232900      
004897    02 WKS-ERRORD                         PIC X.                  233000      
004898    02 WKS-ERRORE                         PIC X.                  233100      
004899    02 WKS-ERRORF                         PIC X.                  233200      
004900    02 WKS-ERRORG                         PIC X.                  233300      
004901                                                                  233400      
004902 01 WLI-DESVIOS.                                                  233500      
004903    02 WLI-DES-AUT-APLIC                  PIC ZZZZZZZ9.           233600      
004904    02 FILLER                             PIC X     VALUE SPACES. 233700      
004905    02 WLI-DES-CONTRATO                   PIC ZZZZZZZZZZZZZZZ9.   233800      
004906    02 FILLER                             PIC XX    VALUE SPACES. 233900      
004907    02 WLI-DES-FOLIO                      PIC ZZZ9.               234000      
004908    02 FILLER                             PIC XXXX  VALUE SPACES. 234100      
004909    02 WLI-DES-LIBRO                      PIC Z9.                 234200      
004910    02 FILLER                             PIC XX    VALUE SPACES. 234300      
004911    02 WLI-DES-MONEDA                     PIC ZZZ9.               234400      
004912    02 FILLER                             PIC X     VALUE SPACES. 234500      
004913    02 WLI-DES-TIPOCRED                   PIC ZZZ9.               234600      
004914    02 FILLER                             PIC XX    VALUE SPACES. 234700      
004915    02 WLI-DES-EVENTO                     PIC ZZZ9.               234800      
004916    02 FILLER                             PIC XX    VALUE SPACES. 234900      
004917    02 WLI-DES-SUC-PROM                   PIC ZZZ9.               235000      
004918    02 FILLER                             PIC XXX   VALUE SPACES. 235100      
004919    02 WLI-DES-SUC-TRAN                   PIC ZZZ9.               235200      
004920    02 FILLER                             PIC X     VALUE SPACES. 235300      
004921    02 WLI-DES-AUT-S151                   PIC ZZZZZZZ9.           235400      
004922    02 FILLER                             PIC XX    VALUE SPACES. 235500      
004923    02 WLI-DES-CVETRAN                    PIC ZZZ9.               235600      
004924    02 FILLER                             PIC XX    VALUE SPACES. 235700      
004925    02 WLI-DES-TM                         PIC Z9.                 235800      
004926    02 FILLER                             PIC XX    VALUE SPACES. 235900      
004927    02 WLI-DES-AFEC028                    PIC Z9.                 236000      
004928    02 FILLER                             PIC X     VALUE SPACES. 236100      
004929    02 WLI-DES-IMPORTE                  PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.236200      
004930    02 FILLER                             PIC XX    VALUE SPACES. 236300      
004931    02 WLI-DES-FECCONT                    PIC ZZZZZZZ9.           236400      
004932    02 FILLER                             PIC XX    VALUE SPACES. 236500      
004933    02 WLI-DES-TIPOERR                    PIC X(07) VALUE SPACES. 236600      
004934                                                                  236700      
004935 01 WLI-DESVIOS-2.                                                236800      
004936    02 FILLER                              PIC X(35) VALUE SPACES.236900      
004937    02 WLI-DES-DEFLIBD                     PIC 9(02).             237000      
004938    02 WLI-DESVIOS-LIBDZZ   REDEFINES WLI-DES-DEFLIBD.            237100      
004939       04 WLI-DES-DEFLIBDZZ                PIC ZZ.                237200      
004940    02 WLI-DESVIOS-LIBDZ9   REDEFINES WLI-DES-DEFLIBD.            237300      
004941       04 WLI-DES-DEFLIBDZ9                PIC Z9.                237400      
004942    02 FILLER                              PIC X(07) VALUE SPACES.237500      
004943    02 WLI-DES-DEFTCD                      PIC ZZZZ.              237600      
004944    02 FILLER                              PIC X(08) VALUE SPACES.237700      
004945    02 WLI-DES-DEFSUCPD                    PIC ZZZZ.              237800      
004946    02 FILLER                              PIC XXX   VALUE SPACES.237900      
004947    02 WLI-DES-DEFSUCIND                   PIC ZZZZ.              238000      
004948    02 FILLER                              PIC X(11) VALUE SPACES.238100      
004949    02 WLI-DES-DEFCVED                     PIC ZZZZ.              238200      
004950    02 FILLER                              PIC XX   VALUE SPACES. 238300      
004951    02 WLI-DES-DEFTMD                      PIC ZZ.                238400      
004952    02 FILLER                              PIC X(25) VALUE SPACES.238500      
004953    02 WLI-DES-DEFFECHAD                   PIC ZZZZZZZZ.          238600      
004954                                                                  238700      
004955 01  WLI-TIT1-DESVIOS.                                            238800      
004956     03 FILLER                             PIC X(40) VALUE        238900      
004957     "AUT/OPER    CONTRATO      FOLIO LIBRO   ".                  239000      
004958     03 FILLER                             PIC X(40) VALUE        239100      
004959     "MON  TC EVENTO SUC/P  SUC/I  AUT/151 CVE".                  239200      
004960     03 FILLER                             PIC X(40) VALUE        239300      
004961     "/OP TM  A/28  I M P O R T E       FECHA ".                  239400      
004962     03 FILLER                             PIC X(10) VALUE        239500      
004963     "  ERRORES".                                                 239600      
004964                                                                  239700      
004965 01 WLI-TIT2-DESVIOS.                                             239800      
004966     03 FILLER                             PIC X(40) VALUE        239900      
004967     "                                LIBRO D ".                  240000      
004968     03 FILLER                             PIC X(40) VALUE        240100      
004969     "     TC D      SUCP D SUCI D         CVE".                  240200      
004970     03 FILLER                             PIC X(42) VALUE        240300      
004971     " D  TM D                          FECHA D ".                240400      
004972                                                                  240500      
004973 01  WLI-TIT1-DESVIOS-NCRED.                                      240600      
004974     03 FILLER                             PIC X(40) VALUE        240700      
004975     "AUT/OPER    CONTRATO      FOLIO LIBRO   ".                  240800      
004976     03 FILLER                             PIC X(40) VALUE        240900      
004977     "MON PRO EVENTO SUC/P  SUC/I  AUT/151 CVE".                  241000      
004978     03 FILLER                             PIC X(40) VALUE        241100      
004979     "/OP ESQ A/28  I M P O R T E       FECHA ".                  241200      
004980     03 FILLER                             PIC X(10) VALUE        241300      
004981     "  ERRORES".                                                 241400      
004982                                                                  241500      
004983 01 WLI-TIT2-DESVIOS-NCRED.                                       241600      
004984     03 FILLER                             PIC X(40) VALUE        241700      
004985     "                                LIBRO D ".                  241800      
004986     03 FILLER                             PIC X(40) VALUE        241900      
004987     "    PRO D      SUCP D SUCI D         CVE".                  242000      
004988     03 FILLER                             PIC X(42) VALUE        242100      
004989     " D  ESQ D                         FECHA D ".                242200      
004990                                                                  242300      
004991                                                                  242400      
004992***************************************************************** 242500      
004993*                REPORTE DE RECHAZOS                            * 242600      
004994***************************************************************** 242700      
004995                                                                  242800      
004996 01 WSR-TIT1-RESUM.                                               242900      
004997    03 FILLER                             PIC X(10) VALUE         243000      
004998       "S151-P107-".                                              243100      
004999    03 WSR-RP-E1-NUM-TIT                  PIC 9(03).              243200      
005000    03 FILLER                             PIC X(04) VALUE         243300      
005001       "S151".                                                    243400      
005002    03 WSR-RP-E1-NOM-TIT                  PIC X(09) VALUE SPACES. 243500      
005003    03 FILLER                             PIC X(14) VALUE SPACES. 243600      
005004    03 FILLER                             PIC X(42) VALUE         243700      
005005       "ADMINISTRACION  DE  SALDOS  Y  MOVIMIENTOS".              243800      
005006    03 FILLER                             PIC X(14) VALUE SPACES. 243900      
005007    03 FILLER                             PIC X(26) VALUE         244000      
005008       "FECHA DE LA INFORMACION : ".                              244100      
005009    03 WSR-RP-E1-FECHA-INF                PIC 9999/99/99.         244200      
005010                                                                  244300      
005011 01 WSR-TIT2-RESUM.                                               244400      
005012     03 FILLER                          PIC X(11) VALUE           244500      
005013        "F.PROCESO: ".                                            244600      
005014     03 WSR-RP-E2-FECHA-PROC            PIC 9999/99/99.           244700      
005015     03 FILLER                          PIC X      VALUE SPACE.   244800      
005016     03 WSR-RP-E2-HORA-TIT              PIC 9(02).                244900      
005017     03 FILLER                          PIC X(01) VALUE ":".      244920      
005018     03 WSR-RP-E2-MINU-TIT              PIC 9(02).                244940      
005019     03 FILLER                          PIC X(01) VALUE ":".      244960      
005020     03 WSR-RP-E2-SEGU-TIT              PIC 9(02).                244980      
005021     03 FILLER                          PIC X(06) VALUE SPACES.   245000      
005022     03 WSR-RP-E2-TITULO                PIC X(66) VALUE SPACES.   245100      
005023     03 FILLER                          PIC X(8)  VALUE SPACES.   245200      
005024     03 FILLER                          PIC X(21) VALUE           245300      
005025        "TIPO PROCESO: DIARIO ".                                  245400      
005026                                                                  245500      
005027 01 WSR-TIT3-RESUM.                                               245600      
005028     03 FILLER                            PIC X(21) VALUE SPACES. 245700      
005029     03 FILLER                            PIC X(23) VALUE SPACES. 245800      
005030     03 FILLER                            PIC X(13) VALUE         245900      
005031        "DEL SISTEMA S".                                          246000      
005032     03 WSR-RP-E3-SISTEMA                 PIC 9(03).              246100      
005033     03 FILLER                            PIC X(02) VALUE SPACES. 246200      
005034     03 WSR-RP-E3-NOMB-SIST               PIC X(20).              246300      
005035     03 FILLER                            PIC X(35) VALUE SPACES. 246400      
005036     03 FILLER                            PIC X(07) VALUE         246500      
005037        "HOJA : ".                                                246600      
005038     03 WSR-RP-E3-HOJA                    PIC ZZZZZ9.             246700      
005039                                                                  246800      
005040******************************************************************246900      
005041*                      REGISTRO DE RECHAZOS                      *247000      
005042******************************************************************247100      
005043  01 WKS-RECHAZOS-ERR.                                            247200      
005044    02 REC-ERR-LIBRO                      PIC 9(02).              247300      
005045    02 FILLER                             PIC X     VALUE ",".    247400      
005046    02 REC-ERR-PROD                       PIC 9(04).              247500      
005047    02 FILLER                             PIC X     VALUE ",".    247600      
005048    02 REC-ERR-CONTRATO                   PIC 9(16).              247700      
005049    02 FILLER                             PIC X     VALUE ",".    247800      
005050    02 REC-ERR-FOLIO                      PIC 9(04).              247900      
005051    02 FILLER                             PIC X     VALUE ",".    248000      
005052    02 REC-ERR-ESQ                        PIC 9(02).              248100      
005053    02 FILLER                             PIC X     VALUE ",".    248200      
005054    02 REC-ERR-CVETRAN                    PIC 9(04).              248300      
005055    02 FILLER                             PIC X     VALUE ",".    248400      
005056    02 REC-ERR-IMPORTE                    PIC 9(14)V99.           248500      
005057    02 FILLER                             PIC X     VALUE ",".    248600      
005058    02 REC-ERR-AUT-APL                    PIC 9(08).              248700      
005059    02 FILLER                             PIC X     VALUE ",".    248800      
005060    02 REC-ERR-MONEDA                     PIC 9(04).              248900      
005061    02 FILLER                             PIC X     VALUE ",".    249000      
005062    02 REC-ERR-TIPOERR                    PIC 9(02).              249100      
005063    02 FILLER                             PIC X     VALUE ",".    249200      
005064    02 REC-ERR-INSTRUMENTO                PIC 9(04).              249300      
005065    02 FILLER                             PIC X     VALUE ",".    249400      
005066    02 REC-ERR-EVENTO                     PIC 9(04).              249500      
005067    02 FILLER                             PIC X     VALUE ",".    249600      
005068    02 REC-ERR-SUC-PROM                   PIC 9(04).              249700      
005069    02 FILLER                             PIC X     VALUE ",".    249800      
005070    02 REC-ERR-SUC-TRAN                   PIC 9(04).              249900      
005071    02 FILLER                             PIC X     VALUE ",".    250000      
005072    02 REC-ERR-AUT-S151                   PIC 9(08).              250100      
005073***************************************************************** 250200      
005074****  VARIABLES PARA MENSAJE COMMAND POST                     *** 250300      
005075***************************************************************** 250400      
005076  01 W-MSG                                PIC X(163).             250500      
005077  01 WKS-MSG-COMMPOST    REDEFINES  W-MSG.                        250600      
005078     03 WKS-MSG-EVENTO                    PIC 9(07).              250700      
005079     03 WKS-ESPACIO1                      PIC X(01).              250800      
005080     03 WKS-MSG-TIPO                      PIC 9(01).              250900      
005081     03 WKS-ESPACIO2                      PIC X(01).              251000      
005082     03 WKS-MSG-ORIGEN                    PIC X(09).              251100      
005083     03 WKS-ESPACIO3                      PIC X(01).              251200      
005084     03 WKS-MSG-CONCEPTO                  PIC X(04).              251300      
005085     03 WKS-MSG-SISTEMA   REDEFINES       WKS-MSG-CONCEPTO.       251400      
005086        05 WKS-MSG-S                      PIC X(01).              251500      
005087        05 WKS-MSG-SIS                    PIC 9(03).              251600      
005088     03 WKS-ESPACIO4                      PIC X(01).              251700      
005089     03 WKS-MSG-SUBCON                    PIC X(09).              251800      
005090     03 WKS-MSG-RED-SUBCON REDEFINES      WKS-MSG-SUBCON.         251900      
005091        05 WKS-RSU-PROCESO                PIC X(07).              252000      
005092        05 WKS-RSU-NUMERO                 PIC X(02).              252100      
005093     03 WKS-ESPACIO5                      PIC X(01).              252200      
005094     03 WKS-MSG-TEXTO1                    PIC X(55).              252300      
005095     03 WKS-ESPACIO6                      PIC X(01).              252400      
005096     03 WKS-MSG-TEXTO2                    PIC X(62).              252500      
005097     03 WKS-MSG-RED-TEXTO2 REDEFINES      WKS-MSG-TEXTO2.         252600      
005098        05 WKS-RT2-CORCHETE21             PIC X(01).              252700      
005099        05 WKS-RT2-TEXTDATMAL             PIC X(10).              252800      
005100        05 WKS-RT2-DATOMAL                PIC X(08).              252900      
005101        05 WKS-RT2-TEXTAUTAPL             PIC X(15).              253000      
005102        05 WKS-RT2-AUTAPL                 PIC X(08).              253100      
005103        05 WKS-RT2-ESPACIO                PIC X(01).              253200      
005104        05 WKS-RT2-TEXTAUT151             PIC X(10).              253300      
005105        05 WKS-RT2-AUTS151                PIC X(08).              253400      
005106        05 WKS-RT2-CORCHETE22             PIC X(01).              253500      
005107  01 WKS-CLAVE-CIA                        PIC 9(05) VALUE ZERO.   253600      
005108  01 WKS-BAN-DESVIOA                      PIC 9(01) VALUE 0.      253700      
005109  01 WKS-BAN-DESVIOB                      PIC 9(01) VALUE 0.      253800      
005110  01 WKS-BAN-DESVIOC                      PIC 9(01) VALUE 0.      253900      
005111  01 WKS-BAN-DESVIOD                      PIC 9(01) VALUE 0.      254000      
005112  01 WKS-BAN-DESVIOE                      PIC 9(01) VALUE 0.      254100      
005113  01 WKS-BAN-DESVIOF                      PIC 9(01) VALUE 0.      254200      
005114  01 WKS-BAN-DESVIOG                      PIC 9(01) VALUE 0.      254300      
005115/**************************************************************** 254400      
005116*             P R O C E D U R E     D I V I S I O N             * 254500      
005117***************************************************************** 254600      
005118 PROCEDURE DIVISION USING W77-SISTEMA-PARAM.                      254700      
005119 000000-PROGRAMA.                                                 254800      
005120*===============                                                  254900      
005121     MOVE "S"                         TO WKS-INT-S-C  .           255000      
005122     MOVE W77-SISTEMA-PARAM           TO WKS-SISTEMA              255100      
005123                                         WKS-HDR-ATL-SIS          255200      
005124                                         W77-CUADRECON            255300      
005125                                         W77-SIST-CS              255400      
005126                                         W77-SIST-CENTRAL         255500      
005127                                         W77-SIST-CRED            255600      
005128                                         W77-SIST-INTELAR         255650      
005129                                         W77-INTELAR-C600         255660      
005130                                         WKS-INT-S151     .       255662      
005131     IF W77-SISTEMA-PARAM = 252                                   255665      
005132        MOVE W77-SISTEMA-PARAM        TO WKS-INT-SIS              255670      
005133                                         WKS-INT-SIS-I            255680      
005134        MOVE 1                        TO WKS-INT-SERVICIO         255685      
005135     ELSE                                                         255692      
005136        MOVE 151                      TO WKS-INT-SIS              255694      
005137                                         WKS-INT-SIS-I            255696      
005138        IF WKS-SISTEMA = 402                                      255698      
005139           MOVE 2                     TO WKS-INT-SERV-600         255700      
005140        ELSE                                                      255702      
005141        IF WKS-SISTEMA = 600                                      255704      
005142           MOVE 4                     TO WKS-INT-SERV-600.        255706      
005143     IF WKS-SISTEMA = 402 OR WKS-SISTEMA = 600                    255710      
005144        MOVE "C" TO WKS-START-S-C,WKS-MC-S-C,WKS-DES-S-C,         255800      
005145                    WKS-CC-S-C,WKS-CVE-S-C,WKS-MOVC-S-C,          255900      
005146                    WKS-CVEMER-S-C,WKS-ERR-S-C,WKS-SIST-S-C,      256000      
005147                    WKS-SIS-S-C,WKS-SIS-PAQ2-S-C,WKS-S-C-SIST,    256100      
005148                    WKS-TITU-S-C,WKS-S-C,WKS-HD-S-C,WKS-PUNTEO-S-C256200      
005149                    A00-R00-MERC-S-C, WKS-CVETRAN-S-C,            256300      
005150                    WKS-MOVIMIENTOS-S-C, WKS-MOVERR-S-C           256350      
005151     ELSE                                                         256400      
005152        MOVE "S" TO WKS-START-S-C,WKS-MC-S-C,WKS-DES-S-C,         256500      
005153                    WKS-CC-S-C,WKS-CVE-S-C,WKS-MOVC-S-C,          256600      
005154                    WKS-CVEMER-S-C,WKS-ERR-S-C,WKS-SIST-S-C,      256700      
005155                    WKS-SIS-S-C,WKS-SIS-PAQ2-S-C,WKS-S-C-SIST,    256800      
005156                    WKS-TITU-S-C,WKS-S-C,WKS-HD-S-C,WKS-PUNTEO-S-C256900      
005157                    A00-R00-MERC-S-C, WKS-CVETRAN-S-C,            257000      
005158                    WKS-MOVIMIENTOS-S-C, WKS-MOVERR-S-C.          257100      
005159     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   257200      
005160        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          257300      
005161                                                                  257400      
005162     MOVE "S151" TO SISTEMA-LJ                                    257500      
005163     MOVE "P107" TO PASO-LJ                                       257600      
005164     MOVE "002"  TO MTP-LJ                                        257700      
005165     PERFORM 10000-INICIO-PROGRAMA                                257800      
005166     PERFORM 11000-CARGA-ESTRUCTURA.                              257900      
005167*RGV PERFORM 11500-CARGA-NODOS-EST.                               258000      
005168     PERFORM 12000-CARGA-CATALOGOS.                               258100      
005169     PERFORM 12900-OBTEN-TIT940.                                  258200      
005170     PERFORM 20000-PROCESA-MOVIMIENTOS                            258300      
005171     PERFORM 30000-GENERA-BITACORA.                               258400      
005172     PERFORM 35000-GENERA-TOTXCVE.                                258500      
005173     PERFORM 60000-GENERA-RECHAZOS.                               258600      
005174                                                                  258700      
005175     STOP RUN.                                                    258800      
005176                                                                  258900      
005177 10000-INICIO-PROGRAMA.                                           259000      
005178*=====================                                            259100      
005179                                                                  259102      
005180     CHANGE ATTRIBUTE LIBACCESS    OF "ADMONXFERS" TO BYFUNCTION. 259104      
005181     CHANGE ATTRIBUTE FUNCTIONNAME OF "ADMONXFERS"                259106      
005182                                   TO "ADMONXFERS".               259108      
005183                                                                  259110      
005184     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.259200      
005185     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            259300      
005186                                      "SOPORTECOMS".              259400      
005187     CALL "CSIID OF SOPORTECOMS"                                  259500      
005188          USING WKS-DATOSHOST                                     259600      
005189                                                                  259700      
005190     CHANGE ATTRIBUTE LIBACCESS    OF "CTRLVERS" TO BYFUNCTION.   259800      
005191     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".    259900      
005192                                                                  260000      
005193     MOVE "S151L001CTL"         TO WKS-CTLVERS-LIBRERIA           260100      
005194     CALL "DAME_TIT IN CTRLVERS"                                  260200      
005195          USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO          260300      
005196          GIVING WKS-CTLVERS-STATUS.                              260400      
005197                                                                  260500      
005198     IF WKS-CTLVERS-STATUS < 0                                    260600      
005199        MOVE "I"    TO TIPO-LJ                                    260700      
005200        MOVE 020101 TO CODIGO-LJ                                  260800      
005201        STRING "ERROR EN CTLVERS, USO LICBRERIA DE CONTROL SIN ", 260900      
005202               "RELEASE NI MTP." DELIMITED BY SIZE INTO TEXTO-LJ  261000      
005203        CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ       261100      
005204        CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL"   TO           261200      
005205            "(S151)S151/OBJECT/L001/CONTROL          ON CMEMP."   261300      
005206     ELSE                                                         261400      
005207        CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL" TO             261500      
005208               WKS-CTLVERS-TITULO.                                261600      
005209                                                                  261700      
005210     MOVE W77-SISTEMA-PARAM           TO WKS-B01-SISTEMA          261800      
005211                                         WKS-TL-SISTEMA           261900      
005212                                         WKS-TIT-SIST             262000      
005213                                         WKS-SIS-ERR              262100      
005214                                         A00-R00-MERC-SIST        262200      
005215                                         WKS-SIST-AL              262300      
005216                                         WKS-SIST-AUX             262400      
005217                                         WKS-ERR-SIST.            262500      
005218                                                                  262600      
005219     MOVE 1                               TO WKS-B01-FUNCION      262700      
005220     MOVE ZEROES                          TO WKS-TR-ATLAS-TOTIMP. 262800      
005221     MOVE WKS-DH-NUMCSI                   TO WKS-B01-CSI          262900      
005222                                             WKS-HD-CSI.          263000      
005223                                                                  263100      
005224     CALL "CONSISDIA IN S151LIBCONTROL"                           263200      
005225          USING  WKS-S151B01SISDIA                                263300      
005226          GIVING W77-RESULT                                       263400      
005227                                                                  263500      
005228     IF ATTRIBUTE VALUE OF MYSELF = 0                             263600      
005229        MOVE WKS-B01-FECPRO               TO WKS-FECHA-PROCESO    263700      
005230        MOVE WKS-B01-NOMPACMOV            TO WKS-PACK-LOG,        263800      
005231                                             WKS-PACK-DES,        263900      
005232                                             WKS-PACK-ERR         264000      
005233        PERFORM 10100-CIERRA-DESC                                 264100      
005234     ELSE                                                         264200      
005235        MOVE WKS-B01-NOMPACMOV            TO WKS-PACK-LOG,        264300      
005236                                             WKS-PACK-DES,        264400      
005237                                             WKS-PACK-ERR         264500      
005238        MOVE ATTRIBUTE VALUE OF MYSELF    TO WKS-FECHA-PROCESO.   264600      
005239                                                                  264700      
005240     MOVE WKS-FECHA-PROCESO               TO WKS-HDR-ATL-FEC.     264800      
005241                                                                  264900      
005242                                                                  265000      
005243                                                                  265100      
005244                                                                  265200      
005245                                                                  265300      
005246                                                                  265400      
005247     MOVE WKS-DH-NUMCSI                   TO W77-CSI-PROCESO      265500      
005248                                             A00-R00-MERC-CSI-ORI 265600      
005249                                             WKS-HDR-ATL-CSI      265700      
005250                                             WKS-CSI-OR.          265800      
005251                                                                  265900      
005252     MOVE W77-SISTEMA-PARAM               TO WKS-B03-SISTEMA      266000      
005253     MOVE 1                               TO WKS-B03-FUNCION      266100      
005254                                                                  266200      
005255     CALL "CONSISMEN IN S151LIBCONTROL"                           266300      
005256          USING  WKS-S151B03SISMEN                                266400      
005257          GIVING W77-RESULT-LIBCON.                               266500      
005258                                                                  266600      
005259     STRING "INICIO PROCESO CON FECHA ",                          266700      
005260            WKS-FECHA-PROCESO                                     266800      
005261            DELIMITED BY SIZE                                     266900      
005262            INTO TEXTO-LJ                                         267000      
005263     CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         267100      
005264                                                                  267200      
005265     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          267300      
005266             A2K-ACCEPT-TODAYS-DATE-EXIT.                         267400      
005267     MOVE A2K-FEC-MDCA-001  TO WKS-FECHA-TEMP.                    267500      
005268*     MOVE WKS-FECHA-TEMP    TO WLI-RP-E2-FECHA-PROC              267600      
005269     MOVE WKS-MES-TEMP                     TO WKS-FM-MES,         267700      
005270                                              A00-R00-MERC-MM-MM. 267800      
005271     MOVE WKS-DIA-TEMP                     TO WKS-FM-DIA,         267900      
005272                                              A00-R00-MERC-DD-MM. 268000      
005273     MOVE WKS-AMO-TEMP                     TO WKS-FM-AMO,         268100      
005274                                              A00-R00-MERC-AA-MM. 268200      
005275                                                                  268300      
005276     MOVE WKS-FP-AMO                       TO A00-R00-MERC-AA-PP  268400      
005277     MOVE WKS-FP-MES                       TO A00-R00-MERC-MM-PP  268500      
005278     MOVE WKS-FP-DIA                       TO A00-R00-MERC-DD-PP  268600      
005279                                                                  268700      
005280     ACCEPT   WKS-HORA-MAQ                FROM TIME               268800      
005281                                                                  268900      
005282**********************************                                269000      
005283*  FECHA Y HORA DE COMPILACION                                    269100      
005284**********************************                                269200      
005285     CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION.     269300      
005286     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP".       269400      
005287                                                                  269700      
005288     MOVE ATTRIBUTE NAME OF MYSELF TO WKS-HORA-COMPILACION        269800      
005289                                                                  269900      
005290     CALL "CONVERT-DATE OF LOCSUP"                                270000      
005291          USING WKS-HORA-COMPILACION    A2K-FEC-DMA-001           270100      
005292        PERFORM A2K-CONV-DMA-TO-DMCA THRU                         270200      
005293                A2K-CONV-DMA-TO-DMCA-EXIT                         270300      
005294        MOVE A2K-FEC-DMCA-001 TO WKS-FECHA-COMPILACION            270400      
005295                                                                  270500      
005296     MOVE WKS-FECHA-COMPILACION           TO WKS-FECHA-TEMP       270600      
005297     MOVE WKS-DIA-TEMP                     TO WKS-FECHA-COMP-DD   270700      
005298     MOVE WKS-MES-TEMP                     TO WKS-FECHA-COMP-MM   270800      
005299     MOVE WKS-AMO-TEMP                     TO WKS-FECHA-COMP-AA   270900      
005300                                                                  271000      
005301     COMPUTE WKS-HORA-COMP = WKS-HORA-COMP / 60                   271100      
005302     COMPUTE WKS-HORA-COMP-HH    =                                271200      
005303             FUNCTION DIV (WKS-HORA-COMP, 3600 )                  271300      
005304     COMPUTE W77-IND          =                                   271400      
005305             FUNCTION DIV (WKS-HORA-COMP, 60 )                    271500      
005306     COMPUTE WKS-HORA-COMP-MM    =                                271600      
005307             FUNCTION MOD (W77-IND   , 60 )                       271700      
005308     COMPUTE WKS-HORA-COMP-SS    =                                271800      
005309             FUNCTION MOD (WKS-HORA-COMP, 60 )                    271900      
005310                                                                  272000      
005311     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-VALUE.             272100      
005312     IF WKS-VALUE > 0                                             272200      
005313        MOVE WKS-VALUE         TO W77-940-FECPRO                  272300      
005314     ELSE                                                         272400      
005315        MOVE WKS-FECHA-PROCESO TO W77-940-FECPRO.                 272500      
005316*     DISPLAY " FECHA 940 "  W77-940-FECPRO.                      272600      
005317     CHANGE ATTRIBUTE VALUE OF MYSELF TO W77-940-FECPRO.          272700      
005318**********************************                                272800      
005319*  INICIALIZA VARIABLES                                           272900      
005320**********************************                                273000      
005321     MOVE "S080BD01CON"                    TO WKS-CTLVERS-LIBRERIA273100      
005322     CALL "DAME_TIT IN CTRLVERS"                                  273200      
005323          USING  WKS-CTLVERS-LIBRERIA                             273300      
005324                 WKS-CTLVERS-TITULO                               273400      
005325          GIVING WKS-CTLVERS-STATUS.                              273500      
005326                                                                  273600      
005327     IF WKS-CTLVERS-STATUS < 0                                    273700      
005328        MOVE "ERROR AL OBTENER NOMBRE S08BD01CON"                 273800      
005329                                           TO TEXTO-LJ            273900      
005330        MOVE "O"                           TO TIPO-LJ             274000      
005331        MOVE 020901                        TO CODIGO-LJ           274100      
005332        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       274200      
005333        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                   274300      
005334     ELSE                                                         274400      
005335        CHANGE ATTRIBUTE TITLE OF "S080BD01CON" TO                274500      
005336               WKS-CTLVERS-TITULO.                                274600      
005337                                                                  274700      
005338     MOVE 151                             TO S080-CD-SISTEMA      274800      
005339     MOVE 107                             TO S080-CD-PROGRAMA     274900      
005340     MOVE 8                               TO S080-CDPE-CATALOGO   275000      
005341     MOVE 20                              TO S080-CDPE-CLAVE      275100      
005342     MOVE 1                               TO S080-CDPE-ORDEN-BUSQ 275200      
005343     MOVE 1                               TO S080-CDPE-REGISTROS  275300      
005344     MOVE W77-SISTEMA-PARAM           TO S080-CDPE-CVE-REGIST     275400      
005345     MOVE 0                               TO                      275500      
005346                                         S080-CDPE-CVE-REGIST-ASOC275600      
005347     MOVE 0                               TO S080-CDPE-NIVEL-INI  275700      
005348     MOVE 0                               TO S080-CDPE-FECHA-CONS 275800      
005349                                                                  275900      
005350     CALL "L700_CONSUL_DESC IN S080BD01CON"                       276000      
005351           USING S080-CD-SISTEMA          S080-CD-PROGRAMA        276100      
005352                 S080-CD-PARAMETRO-ENT    S080-CD-PARAMETRO-SAL   276200      
005353           GIVING S080-CD-RESULT                                  276300      
005354                                                                  276400      
005355     IF S080-CD-RESULT = 0 OR = 1                                 276500      
005356        MOVE S080-CDPS-TEXTO-CORTO        TO WSR-RB-E3-NOMB-SIST  276600      
005357                                             WSR-RC-E3-NOMB-SIST  276700      
005358                                             WSR-RP-E3-NOMB-SIST  276800      
005359     ELSE                                                         276900      
005360        MOVE SPACES                       TO WSR-RB-E3-NOMB-SIST  277000      
005361                                             WSR-RC-E3-NOMB-SIST. 277100      
005362                                                                  277200      
005363     MOVE W77-SISTEMA-PARAM               TO WKS-TB-SISTEMA       277300      
005364                                             WKS-TT-SISTEMA       277400      
005365                                             WKS-MC-SISTEMA       277600      
005366                                             WKS-START-SIS        277700      
005367                                             WKS-DES-SISTEMA      277800      
005368                                             WKS-CC-SISTEMA       277900      
005369                                             WKS-CVE-SISTEMA      278000      
005370                                             WKS-CVETRAN-SISTEMA  278050      
005371                                             WKS-CVEMER-SIS       278100      
005372                                             WKS-MOVC-SISTEMA     278200      
005373                                             WKS-MOVIMIENTOS-SIST 278250      
005374                                             WKS-MOVERR-SIST      278270      
005375                                             WKS-NUM-SIST         278300      
005376                                             WKS-SIS-ERRORES      278400      
005377                                             WKS-SIS-RECHA        278500      
005378                                             WKS-SIS-PROCESP      278600      
005379                                             A00-R00-PUN-SIST     278700      
005380                                             WKS-PUNTEO-SIS       278800      
005381                                             WSR-RP-E3-SISTEMA.   278900      
005382     MOVE WKS-FPROCESO-A6                 TO WKS-TB-FECHA-BACKUP  279000      
005383                                             WKS-TT-FECHA-BACKUP  279100      
005384                                             WKS-TR-FECHA-BACKUP  279200      
005385                                             WKS-FEC-SAL          279400      
005386                                             WKS-FEC-LOG          279500      
005387                                             WKS-FEC-ERR          279600      
005388                                             WKS-FEC-DES.         279700      
005389     MOVE WKS-FECHA-MAQ                   TO WKS-HD-FECHA-PROC    279800      
005390                                             WLI-RP-E2-FECHA-PROC 279900      
005391                                             WSR-RP-E2-FECHA-PROC 280000      
005392                                             WLI-RP-E5-FECHA-PROC.280100      
005393     MOVE WKS-FECHA-PROCESO               TO WKS-DES-FECHA        280200      
005394                                             WKS-CC-FECHA         280400      
005395                                             WKS-CVE-FECHA        280500      
005396                                             WKS-CVETRAN-FECHA    280550      
005397                                             WKS-MOVC-FECHA       280600      
005398                                             WKS-MOVIMIENTOS-FECHA280650      
005399                                             WKS-MOVERR-FECHA     280750      
005400                                             WKS-MC-FECHA         280800      
005401                                             WKS-CVEMER-FECHA     280900      
005402                                             WKS-HD-FECHA-INF     281000      
005403                                             WKS-HD-FECHA-FIN     281100      
005404                                             WKS-START-FEC        281200      
005405                                             WKS-FECHA-RECHA      281300      
005406                                             WKS-FECHA-PROCESP    281500      
005407                                             A00-R00-PUN-FECPRO   281600      
005408                                             WKS-PUNTEO-FECHA     281700      
005409                                             WKS-ACTFIJ-FEC       281750      
005410                                             WKS-INT-FECHA        281770      
005411                                             WKS-INT-FEC-600      281780      
005412                                             WKS-ACTF-FEC-INT     281790      
005413                                             WKS-ERR-FECHA.       281800      
005414     MOVE ATTRIBUTE STACKNO OF MYSELF     TO WKS-TB-MIX           281900      
005415                                             WKS-TT-MIX           282000      
005416                                             WKS-TC-MIX           282100      
005417                                             WKS-TR-MIX           282200      
005418                                             WKS-MIX-RECHA        282300      
005419                                             WKS-MIX-PROCESP      282400      
005420     MOVE W77-CSI-PROCESO                 TO WKS-TR-CSI           282500      
005421                                             WKS-START-CSI        282800      
005422                                             WKS-CSI-RECHA        282900      
005423                                             WKS-DES-CSI          283000      
005424                                             WKS-CC-CSI           283100      
005425                                             WKS-CVE-CSI          283200      
005426                                             WKS-CVETRAN-CSI      283250      
005427                                             WKS-MOVC-CSI         283300      
005428                                             WKS-MOVIMIENTOS-CSI  283350      
005429                                             WKS-MOVERR-CSI       283370      
005430                                             WKS-CVEMER-CSI       283400      
005431                                             WKS-MC-CSI           283500      
005432                                             WKS-ERR-CSI          283600      
005433                                             WKS-PUNTEO-CSIO      283700      
005434                                             WKS-PUNTEO-CSID      283800      
005435                                             WKS-CSI-PROCESP      283900      
005436                                             WKS-INT-CSI          283920      
005437                                             WKS-INT-CSI-600      283925      
005438                                             WKS-ACTF-CSI-INT     283940      
005439                                             WKS-ACTFIJ-CSI.      283950      
005440     SET BITACORA(USERBACKUPNAME)         TO VALUE TRUE           284800      
005441     SET TOTALESTRANS(USERBACKUPNAME)     TO VALUE TRUE           284900      
005442     SET REPORTE     (USERBACKUPNAME)     TO VALUE TRUE           285000      
005443                                                                  285100      
005444     OPEN OUTPUT REPORTE                                          285200      
005445                 MOVSCIG                                          285400      
005446                 PUNTEO.                                          285500      
005447     ACCEPT WKS-HORA-PROCESO      FROM TIME.                      285600      
005448     MOVE WKS-HORA-HMS            TO      WLI-RP-E2-HORA-TIT      285700      
005449                                          WSR-RP-E2-HORA-TIT      285800      
005450                                          WLI-RP-E5-HORA-PROC     285900      
005451     MOVE WKS-MINU-HMS            TO      WLI-RP-E2-MINU-TIT      285910      
005452                                          WSR-RP-E2-MINU-TIT      285920      
005453                                          WLI-RP-E5-MINU-PROC     285930      
005454     MOVE WKS-SEGU-HMS            TO      WLI-RP-E2-SEGU-TIT      285940      
005455                                          WSR-RP-E2-SEGU-TIT      285950      
005456                                          WLI-RP-E5-SEGU-PROC     285960      
005457     MOVE WKS-HORA-HHMMSS         TO WKS-HD-HORA-PROC.            286100      
005458     MOVE W77-SISTEMA-PARAM       TO WKS-HD-SIST-ORI.             286200      
005459     WRITE REG-MOVSCIG FROM WKS-HEADER-CIG.                       286300      
005460     MOVE SPACES                  TO WKS-TABLA-LEYENDAS-TRANS1    286400      
005461                                     WKS-TABLA-LEYENDAS-TRANS2.   286500      
005462                                                                  286600      
005463     MOVE 0                       TO A00-R00-PUN-CVEREG.          286700      
005464     WRITE REG-PUNTEO FROM A00-R00-HDR-PUNTEO.                    286800      
005465                                                                  286900      
005466                                                                  287000      
005467****************************************************              287100      
005468* CARGA DE LOS CONCEPTOS DE LAS TABLAS CAJA Y CSI                 287200      
005469****************************************************              287300      
005470        MOVE "CONTABILIDAD BANCO    "     TO WKS-NOMBCON-CAJA(1)  287400      
005471        MOVE "CONTABILIDAD UDIS     "     TO WKS-NOMBCON-CAJA(2)  287500      
005472        MOVE "CONTABILIDAD FOBA-UDIS"     TO WKS-NOMBCON-CAJA(3)  287600      
005473        MOVE "CONTABILIDAD FOBAPROA "     TO WKS-NOMBCON-CAJA(4)  287700      
005474        MOVE "LIBRO MEXICO          "     TO WKS-NOMBCON-CAJA(5)  287800      
005475        MOVE "LIBRO NASSAU          "     TO WKS-NOMBCON-CAJA(6)  287900      
005476        MOVE "LIBRO HOUSTON         "     TO WKS-NOMBCON-CAJA(7)  288000      
005477        MOVE "LIBRO NUEVA YORK      "     TO WKS-NOMBCON-CAJA(8)  288100      
005478        MOVE "LIBRO LONDRES         "     TO WKS-NOMBCON-CAJA(9)  288200      
005479        MOVE "LIBRO FOBAPROA MEXICO "     TO WKS-NOMBCON-CAJA(10) 288300      
005480        MOVE "CARTERA BURSATILIZADA "     TO WKS-NOMBCON-CAJA(11) 288400      
005481        MOVE "ARRENDADORA CITI      "     TO WKS-NOMBCON-CAJA(12) 288500      
005482        MOVE "FIDEICOMISO A CITI    "     TO WKS-NOMBCON-CAJA(13) 288600      
005483        MOVE "FIDEICOMISO B CITI    "     TO WKS-NOMBCON-CAJA(14) 288700      
005484        MOVE "LIBRO CREDITO FAMILIAR"     TO WKS-NOMBCON-CAJA(15) 288800      
005485        MOVE "DESCONOCIDA           "     TO WKS-NOMBCON-CAJA(16) 288850      
005486                                                                  288900      
005487        MOVE "CONTABILIDAD BANCO    "     TO  WKS-NOMBTOT-CSI(1)  289000      
005488        MOVE "CONTABILIDAD UDIS     "     TO  WKS-NOMBTOT-CSI(2)  289100      
005489        MOVE "CONTABILIDAD FOBA-UDIS"     TO  WKS-NOMBTOT-CSI(3)  289200      
005490        MOVE "CONTABILIDAD FOBAPROA "     TO  WKS-NOMBTOT-CSI(4)  289300      
005491        MOVE "LIBRO MEXICO          "     TO  WKS-NOMBTOT-CSI(5)  289400      
005492        MOVE "LIBRO NASSAU          "     TO  WKS-NOMBTOT-CSI(6)  289500      
005493        MOVE "LIBRO HOUSTON         "     TO  WKS-NOMBTOT-CSI(7)  289600      
005494        MOVE "LIBRO NUEVA YORK      "     TO  WKS-NOMBTOT-CSI(8)  289700      
005495        MOVE "LIBRO LONDRES         "     TO  WKS-NOMBTOT-CSI(9)  289800      
005496        MOVE "LIBRO FOBAPROA MEXICO "     TO  WKS-NOMBTOT-CSI(10) 289900      
005497        MOVE "CARTERA BURSATILIZADA "     TO  WKS-NOMBTOT-CSI(11) 290000      
005498        MOVE "ARRENDADORA CITI      "     TO  WKS-NOMBTOT-CSI(12) 290100      
005499        MOVE "FIDEICOMISO A CITI    "     TO  WKS-NOMBTOT-CSI(13) 290200      
005500        MOVE "FIDEICOMISO B CITI    "     TO  WKS-NOMBTOT-CSI(14) 290300      
005501        MOVE "LIBRO CREDITO FAMILIAR"     TO  WKS-NOMBTOT-CSI(15) 290400      
005502        MOVE "DESCONOCIDA           "     TO  WKS-NOMBTOT-CSI(16).290450      
005503                                                                  290500      
005504 10100-CIERRA-DESC.                                               290600      
005505*=================                                                290700      
005506     MOVE ZEROS   TO      W77-DESC.                               290800      
005507      IF WKS-B01-FECARCMOV(1)  = WKS-FECHA-PROCESO                290900      
005508        MOVE 1    TO      W77-DESC                                291000      
005509        MOVE 10   TO      WKS-DEL-FUNCION                         291100      
005510     ELSE                                                         291200      
005511      IF WKS-B01-FECARCMOV(2)  = WKS-FECHA-PROCESO                291300      
005512        MOVE 1    TO      W77-DESC                                291400      
005513        MOVE 11   TO      WKS-DEL-FUNCION                         291500      
005514     ELSE                                                         291600      
005515      IF WKS-B01-FECARCMOV(3)  = WKS-FECHA-PROCESO                291700      
005516        MOVE 1    TO      W77-DESC                                291800      
005517        MOVE 12   TO      WKS-DEL-FUNCION                         291900      
005518     ELSE                                                         292000      
005519      IF WKS-B01-FECARCMOV(4)  = WKS-FECHA-PROCESO                292100      
005520        MOVE 1    TO      W77-DESC                                292200      
005521        MOVE 13   TO      WKS-DEL-FUNCION                         292300      
005522     ELSE                                                         292400      
005523      IF WKS-B01-FECARCMOV(5)  = WKS-FECHA-PROCESO                292500      
005524        MOVE 1    TO      W77-DESC                                292600      
005525        MOVE 14   TO      WKS-DEL-FUNCION                         292700      
005526     ELSE                                                         292800      
005527      IF WKS-B01-FECARCMOV(6)  = WKS-FECHA-PROCESO                292900      
005528        MOVE 1    TO      W77-DESC                                293000      
005529        MOVE 15   TO      WKS-DEL-FUNCION                         293100      
005530     ELSE                                                         293200      
005531      IF WKS-B01-FECARCMOV(7)  = WKS-FECHA-PROCESO                293300      
005532        MOVE 1    TO      W77-DESC                                293400      
005533        MOVE 16   TO      WKS-DEL-FUNCION                         293500      
005534     ELSE                                                         293600      
005535      IF WKS-B01-FECARCMOV(8)  = WKS-FECHA-PROCESO                293700      
005536        MOVE 1    TO      W77-DESC                                293800      
005537        MOVE 17   TO      WKS-DEL-FUNCION                         293900      
005538     ELSE                                                         294000      
005539      IF WKS-B01-FECARCMOV(9)  = WKS-FECHA-PROCESO                294100      
005540        MOVE 1    TO      W77-DESC                                294200      
005541        MOVE 18   TO      WKS-DEL-FUNCION                         294300      
005542     ELSE                                                         294400      
005543      IF WKS-B01-FECARCMOV(10) = WKS-FECHA-PROCESO                294500      
005544        MOVE 1    TO      W77-DESC                                294600      
005545        MOVE 19   TO      WKS-DEL-FUNCION.                        294700      
005546                                                                  294800      
005547     MOVE ZEROS                 TO        WKS-CTLVERS-STATUS      294900      
005548     MOVE "S151L002R"           TO        WKS-LIBID-NOMB          295000      
005549     MOVE W77-SISTEMA-PARAM     TO        WKS-LIBID-SIST          295100      
005550                                                                  295200      
005551     IF W88-DESC                                                  295300      
005552        CALL "DAME_TIT IN CTRLVERS"                               295400      
005553              USING WKS-CTLVERS-LIBID , WKS-CTLVERS-TITULO        295500      
005554              GIVING WKS-CTLVERS-STATUS.                          295600      
005555                                                                  295700      
005556     IF W88-DESC                                                  295800      
005557       IF WKS-CTLVERS-STATUS < 0                                  295900      
005558          MOVE W77-SISTEMA-PARAM TO WKS-TIT-SISREG                296000      
005559          MOVE "I"    TO TIPO-LJ                                  296100      
005560          MOVE 020101 TO CODIGO-LJ                                296200      
005561          STRING "ERROR EN CTLVERS, USO LIBRERIA REGISTRA SIN ",  296300      
005562                 "RELEASE NI MTP." DELIMITED BY SIZE INTO TEXTO-LJ296400      
005563          CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ     296500      
005564          CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA"   TO           296600      
005565                 WKS-TIT-REGISTRA                                 296700      
005566       ELSE                                                       296800      
005567          CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA" TO             296900      
005568          WKS-CTLVERS-TITULO.                                     297000      
005569                                                                  297100      
005570     MOVE ZEROS TO        WKS-DEL-FECHA,   WKS-DEL-NUMLOG,        297200      
005571                          WKS-DEL-PRODUCTO,WKS-DEL-PROCESO,       297300      
005572                          W77-RESULT.                             297400      
005573     IF W88-DESC                                                  297500      
005574        CALL "CONTROLES IN LIB-REGISTRA" USING WKS-151-DATOS      297600      
005575                                      GIVING W77-RESULT.          297700      
005576     IF W88-DESC                                                  297800      
005577        IF W77-RESULT = 0                                         297900      
005578           NEXT SENTENCE                                          298000      
005579        ELSE                                                      298100      
005580           MOVE "I"    TO TIPO-LJ                                 298200      
005581           MOVE 020101 TO CODIGO-LJ                               298300      
005582           STRING "ERROR AL CERRAR ARCHIVO DE MOVIMIENTOS Y ARCHI"298400      
005583                , "VO DE DESCRIPCIONES PARA EL SIS. ",            298500      
005584           W77-SISTEMA-PARAM DELIMITED BY SIZE INTO TEXTO-LJ      298600      
005585           CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ.   298700      
005586                                                                  298800      
005587     MOVE ZEROS   TO      W77-RESULT                              298900      
005588     MOVE 85      TO      WKS-DEL-FUNCION                         299000      
005589     MOVE ZEROS   TO      WKS-DEL-FECHA,   WKS-DEL-NUMLOG,        299100      
005590                          WKS-DEL-PRODUCTO,WKS-DEL-PROCESO,       299200      
005591                          W77-RESULT.                             299300      
005592                                                                  299400      
005593     CALL "CONTROLES IN LIB-REGISTRA" USING WKS-151-DATOS         299500      
005594                                      GIVING W77-RESULT.          299600      
005595     IF W77-RESULT = 0                                            299700      
005596        NEXT SENTENCE                                             299800      
005597     ELSE                                                         299900      
005598        MOVE "I"    TO TIPO-LJ                                    300000      
005599        MOVE 020101 TO CODIGO-LJ                                  300100      
005600        STRING "ERROR AL CERRAR ARCHIVO DE ERRORES "              300200      
005601             , " PARA EL SIS. ",                                  300300      
005602        W77-SISTEMA-PARAM DELIMITED BY SIZE INTO TEXTO-LJ         300400      
005603        CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ.      300500      
005604                                                                  300600      
005605                                                                  300700      
005606******************************************************************300800      
005607*          CARGA INFORMACION DE ESTRUCTURA                       *300900      
005608******************************************************************301000      
005609 11000-CARGA-ESTRUCTURA.                                          301100      
005610*======================                                           301200      
005611                                                                  301300      
005612     MOVE "S080ESTLIN"          TO WKS-CTLVERS-LIBRERIA           301400      
005613     CALL "DAME_TIT IN CTRLVERS"                                  301500      
005614          USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO          301600      
005615          GIVING WKS-CTLVERS-STATUS.                              301700      
005616                                                                  301800      
005617     IF WKS-CTLVERS-STATUS < 0                                    301900      
005618        MOVE "ERROR EN CTLVERS, USO LIBEST SIN RELEASE NI MTP"    302000      
005619                                          TO TEXTO-LJ             302100      
005620        MOVE "O"               TO TIPO-LJ                         302200      
005621        MOVE 020901            TO CODIGO-LJ                       302300      
005622        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       302400      
005623        CHANGE ATTRIBUTE TITLE OF "ESTRUCTURA" TO                 302500      
005624              "(S080)S080/OBJECT/LIBRARY/LIBEST ON BNA."          302600      
005625     ELSE                                                         302700      
005626        CHANGE ATTRIBUTE TITLE OF "ESTRUCTURA" TO                 302800      
005627               WKS-CTLVERS-TITULO.                                302900      
005628                                                                  303000      
005629     PERFORM 11100-LLAMA-ESTRUCTURA VARYING W77-IND FROM 1        303100      
005630             BY 1 UNTIL W77-IND > 10000.                          303200      
005631                                                                  303300      
005632 11100-LLAMA-ESTRUCTURA.                                          303400      
005633*======================                                           303500      
005634*   MOVE W77-IND               TO  WKS-EST-SUC                    303600      
005635*   MOVE 56                    TO  WKS-EST-CLAVE                  303700      
005636*   CALL "LIBEST IN ESTRUCTURA"                                   303800      
005637*         USING WKS-EST-CODIGO  WKS-EST-RESPUESTA.                303900      
005638*                                                                 304000      
005639*   IF WKS-EST-RESUL = 0                                          304100      
005640*      IF WKS-EST-FEC-BAJA > 0                                    304200      
005641*         MOVE 1                  TO WKS-SUC-VALIDA(W77-IND)      304300      
005642*      ELSE                                                       304400      
005643*         MOVE 0                  TO WKS-SUC-VALIDA(W77-IND)      304500      
005644*   ELSE                                                          304600      
005645*      MOVE 1                     TO WKS-SUC-VALIDA(W77-IND).     304700      
005646*                                                                 304800      
005647     MOVE W77-IND                 TO WKS-EST-SUC                  304900      
005648     MOVE   25                    TO WKS-EST-CLAVE.               305000      
005649     CALL "LIBEST IN ESTRUCTURA"                                  305100      
005650          USING WKS-EST-CODIGO  WKS-EST-RESPUESTA.                305200      
005651    IF WKS-EST-RESUL = 0                                          305300      
005652        IF WKS-EST-NODO-IMP > 0                                   305400      
005653           MOVE WKS-EST-NODO-IMP  TO WKS-SUC-NODO-IMP(W77-IND)    305500      
005654           IF  W77-IND < 100 AND WKS-NODO-EST > 0                 305600      
005655               MOVE WKS-NODO-EST TO WKS-TAB-NODO(WKS-NODO-EST)    305700      
005656            ELSE                                                  305800      
005657               NEXT SENTENCE                                      305900      
005658        ELSE                                                      306000      
005659           COMPUTE WKS-SUC-NODO-IMP(W77-IND) =                    306100      
005660                   W77-CSI-PROCESO * 100                          306200      
005661     ELSE                                                         306300      
005662           COMPUTE WKS-SUC-NODO-IMP(W77-IND) =                    306400      
005663                   W77-CSI-PROCESO * 100.                         306500      
005664*RGV 11500-CARGA-NODOS-EST.                                       306600      
005665*RGV ----------------------                                       306700      
005666*RGV     PERFORM 11600-CARGA-TABLA-NODOS VARYING W77-IND FROM     306800      
005667*RGV                                1 BY 1 UNTIL W77-IND > 99.    306900      
005668*RGV 11600-CARGA-TABLA-NODOS.                                     307000      
005669*RGV ------------------------                                     307100      
005670*RGV     MOVE W77-IND          TO      WKS-EST-SUC.               307200      
005671*RGV     MOVE 25              TO      WKS-EST-CLAVE.              307300      
005672*RGV     CALL "LIBEST IN ESTRUCTURA"                              307400      
005673*RGV     USING WKS-EST-CODIGO, WKS-EST-RESPUESTA.                 307500      
005674*RGV     IF WKS-EST-RESUL = 0                                     307600      
005675*RGV        IF WKS-NODO-EST > 0                                   307700      
005676*RGV           MOVE WKS-NODO-EST TO WKS-TAB-NODO(WKS-NODO-EST).   307800      
005677*RGV                                                              307900      
005678*RGV 11600-CARGA-CSI.                                             308000      
005679*RGV ----------------                                             308100      
005680*RGV     MOVE W77-IND          TO      WKS-EST-SUC.               308200      
005681*RGV     MOVE 1               TO      WKS-EST-CLAVE.              308300      
005682*RGV     CALL "LIBEST IN ESTRUCTURA"                              308400      
005683*RGV     USING WKS-EST-CODIGO, WKS-EST-RESPUESTA.                 308500      
005684*RGV                                                              308600      
005685 11700-INICIALIZA-TABLA.                                          308700      
005686*=======================                                          308800      
005687     MOVE 99 TO WKS-LIBRO(W77-IND),WKS-MONEDAOP(W77-IND),         308900      
005688     MOVE ZEROS    TO WKS-CENT-CONT(W77-IND).                     309000      
005689                                                                  309100      
005690 12000-CARGA-CATALOGOS.                                           309200      
005691*======================                                           309300      
005692     MOVE 011                             TO S080-CDPE-CATALOGO   309400      
005693     MOVE 20                              TO S080-CDPE-CLAVE      309500      
005694     MOVE 1                               TO S080-CDPE-ORDEN-BUSQ 309600      
005695     MOVE 1                               TO S080-CDPE-REGISTROS  309700      
005696     MOVE 0                               TO S080-CDPE-CVE-REGIST 309800      
005697     MOVE 0                         TO  S080-CDPE-CVE-REGIST-ASOC 309900      
005698     MOVE 0                               TO S080-CDPE-NIVEL-INI  310000      
005699     MOVE 0                               TO S080-CDPE-FECHA-CONS 310100      
005700     MOVE 0                               TO W77-EOF.             310200      
005701     PERFORM 12050-CARGA-MONEDAS  UNTIL W77-EOF > 0.              310300      
005702                                                                  310400      
005703                                                                  310500      
005704     IF W77-SISTEMA-PARAM = 403                                   310600      
005705        MOVE 492                          TO S080-CDPE-CATALOGO   310700      
005706        MOVE 20                           TO S080-CDPE-CLAVE      310800      
005707        MOVE 1                            TO S080-CDPE-ORDEN-BUSQ 310900      
005708        MOVE 1                            TO S080-CDPE-REGISTROS  311000      
005709        MOVE 0                            TO S080-CDPE-CVE-REGIST 311100      
005710        MOVE 0                            TO                      311200      
005711                                         S080-CDPE-CVE-REGIST-ASOC311300      
005712        MOVE 0                            TO S080-CDPE-NIVEL-INI  311400      
005713        MOVE 0                            TO S080-CDPE-FECHA-CONS 311500      
005714        MOVE 0                            TO W77-EOF              311600      
005715        PERFORM 12070-CARGA-TIPOFONDO UNTIL W77-EOF > 0.          311700      
005716                                                                  311800      
005717                                                                  311900      
005718     MOVE 523                             TO S080-CPPE-CATALOGO   312000      
005719     MOVE 20                              TO S080-CPPE-CLAVE      312100      
005720     MOVE 1                               TO S080-CPPE-ORDEN-BUSQ 312200      
005721     MOVE 10                              TO S080-CPPE-REGISTROS  312300      
005722     MOVE W77-SISTEMA-PARAM               TO S080-CPPE-LLAVE1     312400      
005723     MOVE 0                               TO S080-CPPE-LLAVE2     312500      
005724                                             S080-CPPE-LLAVE3     312600      
005725                                             S080-CPPE-LLAVE4     312700      
005726                                             S080-CPPE-LLAVE5     312800      
005727                                             S080-CPPE-LLAVE6     312900      
005728     MOVE 0                               TO S080-CPPE-FECHA-VIG  313000      
005729     MOVE 0                               TO S080-CPPE-FECHA-CONS 313100      
005730                                             S080-CPPE-NIVEL-INI  313200      
005731     MOVE 0                               TO W77-EOF.             313300      
005732     PERFORM 12100-CARGA-CATALOGO-CAT  UNTIL W77-EOF > 0.         313400      
005733                                                                  313500      
005734     IF WKS-CAT-NUM(5) > 0                                        313600      
005735        MOVE WKS-CAT-NUM(5)               TO S080-CDPE-CATALOGO   313700      
005736                                             WKS-NUM-CATA         313800      
005737        MOVE 20                           TO S080-CDPE-CLAVE      313900      
005738        MOVE 1                            TO S080-CDPE-ORDEN-BUSQ 314000      
005739        MOVE 1                            TO S080-CDPE-REGISTROS  314100      
005740        MOVE 0                            TO S080-CDPE-CVE-REGIST 314200      
005741        MOVE 0                            TO                      314300      
005742                                        S080-CDPE-CVE-REGIST-ASOC 314400      
005743        MOVE 0                            TO S080-CDPE-NIVEL-INI  314500      
005744        MOVE 0                            TO S080-CDPE-FECHA-CONS 314600      
005745        MOVE 0                            TO W77-EOF              314700      
005746        PERFORM 12150-CARGA-LEYENDAS UNTIL W77-EOF > 0.           314800      
005747                                                                  314900      
005748     IF WKS-CAT-NUM(1) > 0                                        315000      
005749        MOVE WKS-CAT-NUM(1)               TO S080-CPPE-CATALOGO   315100      
005750                                             WKS-NUM-CATA         315200      
005751        MOVE 20                           TO S080-CPPE-CLAVE      315300      
005752        MOVE 1                            TO S080-CPPE-ORDEN-BUSQ 315400      
005753        MOVE 10                           TO S080-CPPE-REGISTROS  315500      
005754        MOVE 0                            TO S080-CPPE-LLAVE1     315600      
005755        MOVE 0                            TO S080-CPPE-LLAVE2     315700      
005756                                             S080-CPPE-LLAVE3     315800      
005757                                             S080-CPPE-LLAVE4     315900      
005758                                             S080-CPPE-LLAVE5     316000      
005759                                             S080-CPPE-LLAVE6     316100      
005760        MOVE 0                            TO S080-CPPE-FECHA-VIG  316200      
005761        MOVE 0                            TO S080-CPPE-FECHA-CONS 316300      
005762                                             S080-CPPE-NIVEL-INI  316400      
005763        MOVE 0                            TO W77-EOF              316500      
005764        PERFORM 12200-CARGA-TRANSACCIONES UNTIL W77-EOF > 0.      316600      
005765                                                                  316700      
005766     IF WKS-CAT-NUM(11) > 0  AND W88-SIST-CRED                    316800      
005767        MOVE WKS-CAT-NUM(11)              TO S080-CDPE-CATALOGO   316900      
005768                                             WKS-NUM-CATA         317000      
005769        MOVE 20                           TO S080-CDPE-CLAVE      317100      
005770        MOVE 1                            TO S080-CDPE-ORDEN-BUSQ 317200      
005771        MOVE 1                            TO S080-CDPE-REGISTROS  317300      
005772        MOVE 0                            TO S080-CDPE-CVE-REGIST 317400      
005773        MOVE 0                            TO                      317500      
005774                                        S080-CDPE-CVE-REGIST-ASOC 317600      
005775        MOVE 0                            TO S080-CDPE-NIVEL-INI  317700      
005776        MOVE 0                            TO S080-CDPE-FECHA-CONS 317800      
005777        MOVE 0                            TO W77-EOF              317900      
005778        PERFORM 12500-CARGA-TIPOCRED UNTIL W77-EOF > 0.           318000      
005779                                                                  318100      
005780                                                                  318200      
005781     MOVE 525                             TO S080-CPPE-CATALOGO   318300      
005782     MOVE 20                              TO S080-CPPE-CLAVE      318400      
005783     MOVE 1                               TO S080-CPPE-ORDEN-BUSQ 318500      
005784     MOVE 10                              TO S080-CPPE-REGISTROS  318600      
005785     MOVE 0                               TO S080-CPPE-LLAVE1     318700      
005786                                             S080-CPPE-LLAVE2     318800      
005787                                             S080-CPPE-LLAVE3     318900      
005788                                             S080-CPPE-LLAVE4     319000      
005789                                             S080-CPPE-LLAVE5     319100      
005790                                             S080-CPPE-LLAVE6     319200      
005791                                             S080-CPPE-FECHA-VIG  319300      
005792                                             S080-CPPE-FECHA-CONS 319400      
005793                                             S080-CPPE-NIVEL-INI  319500      
005794     MOVE 0                               TO W77-EOF.             319600      
005795*    IF W77-SISTEMA-PARAM = 403                                   319700      
005796*       PERFORM 12700-CARGA-CAT-UOCS UNTIL W77-EOF > 0.           319800      
005797*                                                                 319900      
005798     PERFORM 11700-INICIALIZA-TABLA VARYING W77-IND FROM 1 BY 1   320000      
005799             UNTIL W77-IND > 29.                                  320100      
005800     IF W77-SISTEMA-PARAM = 252                                   320200      
005801        MOVE 803                          TO S080-CPPE-CATALOGO   320300      
005802     ELSE                                                         320400      
005803        MOVE 791                          TO S080-CPPE-CATALOGO.  320500      
005804     MOVE 20                              TO S080-CPPE-CLAVE      320600      
005805     MOVE 1                               TO S080-CPPE-ORDEN-BUSQ 320700      
005806     MOVE 10                              TO S080-CPPE-REGISTROS  320800      
005807     MOVE 0                               TO S080-CPPE-LLAVE1     320900      
005808                                             S080-CPPE-LLAVE2     321000      
005809                                             S080-CPPE-LLAVE3     321100      
005810                                             S080-CPPE-LLAVE4     321200      
005811                                             S080-CPPE-LLAVE5     321300      
005812                                             S080-CPPE-LLAVE6     321400      
005813                                             S080-CPPE-FECHA-VIG  321500      
005814                                             S080-CPPE-FECHA-CONS 321600      
005815                                             S080-CPPE-NIVEL-INI  321700      
005816                                             W77-EOF, W77-IND.    321800      
005817     PERFORM 12800-CARGA-LIBROS   UNTIL W77-EOF > 0.              321900      
005818                                                                  322000      
005819     IF WKS-CAT-NUM(15) > 0                                       322100      
005820        MOVE WKS-CAT-NUM(15)              TO S080-CPPE-CATALOGO   322200      
005821                                             WKS-NUM-CATA         322300      
005822        MOVE 20                           TO S080-CPPE-CLAVE      322400      
005823        MOVE 1                            TO S080-CPPE-ORDEN-BUSQ 322500      
005824        MOVE 10                           TO S080-CPPE-REGISTROS  322600      
005825        MOVE 0                            TO S080-CPPE-LLAVE1     322700      
005826        MOVE 0                            TO S080-CPPE-LLAVE2     322800      
005827                                             S080-CPPE-LLAVE3     322900      
005828                                             S080-CPPE-LLAVE4     323000      
005829                                             S080-CPPE-LLAVE5     323100      
005830                                             S080-CPPE-LLAVE6     323200      
005831        MOVE 0                            TO S080-CPPE-FECHA-VIG  323300      
005832        MOVE 0                            TO S080-CPPE-FECHA-CONS 323400      
005833                                             S080-CPPE-NIVEL-INI  323500      
005834        MOVE 0                            TO W77-EOF              323600      
005835        PERFORM 12900-CARGA-DESVIOS UNTIL W77-EOF > 0.            323700      
005836                                                                  323800      
005837     IF W77-SISTEMA-PARAM = 402                                   323900      
005838        MOVE 209                          TO S080-CPPE-CATALOGO   324000      
005839                                             WKS-NUM-CATA         324100      
005840        MOVE 20                           TO S080-CPPE-CLAVE      324200      
005841        MOVE 1                            TO S080-CPPE-ORDEN-BUSQ 324300      
005842        MOVE 10                           TO S080-CPPE-REGISTROS  324400      
005843        MOVE 0                            TO S080-CPPE-LLAVE1     324500      
005844                                             S080-CPPE-LLAVE2     324600      
005845                                             S080-CPPE-LLAVE3     324700      
005846                                             S080-CPPE-LLAVE4     324800      
005847                                             S080-CPPE-LLAVE5     324900      
005848                                             S080-CPPE-LLAVE6     325000      
005849                                             S080-CPPE-FECHA-VIG  325100      
005850                                             S080-CPPE-FECHA-CONS 325200      
005851                                             S080-CPPE-NIVEL-INI  325300      
005852                                             W77-EOF              325400      
005853        PERFORM 12900-CARGA-CAT-209 UNTIL W77-EOF > 0.            325500      
005854                                                                  325600      
005855 12050-CARGA-MONEDAS.                                             325700      
005856*=====================                                            325800      
005857     CALL "L700_CONSUL_DESC IN S080BD01CON"                       325900      
005858           USING S080-CD-SISTEMA                                  326000      
005859                 S080-CD-PROGRAMA                                 326100      
005860                 S080-CD-PARAMETRO-ENT                            326200      
005861                 S080-CD-PARAMETRO-SAL                            326300      
005862           GIVING S080-CD-RESULT                                  326400      
005863                                                                  326500      
005864     IF S080-CD-RESULT = 0 OR = 1                                 326600      
005865        MOVE S080-CDPS-CVE-REGIST         TO W77-IND              326700      
005866                                             S080-CDPE-CVE-REGIST 326800      
005867        MOVE S080-CDPS-NIVEL-INI          TO S080-CDPE-NIVEL-INI  326900      
005868        IF W77-IND > 0 AND W77-IND < 100                          327000      
005869           MOVE S080-CDPS-TEXTO-CORTO     TO                      327100      
005870                                    WKS-LEYENDA-MON(W77-IND)      327200      
005871        ELSE                                                      327300      
005872           NEXT SENTENCE                                          327400      
005873     ELSE                                                         327500      
005874        MOVE 1                            TO W77-EOF              327600      
005875        MOVE S080-CD-RESULT               TO W77-CAMPO-DISPLAY    327700      
005876        MOVE "O"                          TO TIPO-LJ              327800      
005877        MOVE 020901                       TO CODIGO-LJ            327900      
005878        STRING "ERROR EN CALL S080BD01CON,RESULT = ",             328000      
005879                W77-CAMPO-DISPLAY, "CATALOGO MONEDAS : 011"       328100      
005880                DELIMITED BY SIZE                                 328200      
005881                INTO TEXTO-LJ                                     328300      
005882        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      328400      
005883                                                                  328500      
005884     IF S080-CD-RESULT = 0                                        328600      
005885        MOVE 1                            TO W77-EOF.             328700      
005886                                                                  328800      
005887 12070-CARGA-TIPOFONDO.                                           328900      
005888*======================                                           329000      
005889     CALL "L700_CONSUL_DESC IN S080BD01CON"                       329100      
005890           USING S080-CD-SISTEMA                                  329200      
005891                 S080-CD-PROGRAMA                                 329300      
005892                 S080-CD-PARAMETRO-ENT                            329400      
005893                 S080-CD-PARAMETRO-SAL                            329500      
005894           GIVING S080-CD-RESULT                                  329600      
005895                                                                  329700      
005896     IF S080-CD-RESULT = 0 OR = 1                                 329800      
005897        MOVE S080-CDPS-CVE-REGIST         TO W77-IND              329900      
005898                                             S080-CDPE-CVE-REGIST 330000      
005899        MOVE S080-CDPS-NIVEL-INI          TO S080-CDPE-NIVEL-INI  330100      
005900        IF W77-IND > 0 AND W77-IND < 100                          330200      
005901           MOVE S080-CDPS-CVE-REGIST      TO WKS-NUM-TF(W77-IND)  330300      
005902           MOVE S080-CDPS-TEXTO-PANTALLA  TO WKS-NOM-TF(W77-IND)  330400      
005903        ELSE                                                      330500      
005904           NEXT SENTENCE                                          330600      
005905*          IF W77-SW-CAT492 = 0                                   330700      
005906*             MOVE 1                      TO W77-SW-CAT492        330800      
005907*             MOVE S080-CDPS-CVE-REGIST   TO W77-IND              330900      
005908*             MOVE "O"                    TO TIPO-LJ              331000      
005909*             MOVE 020601                 TO CODIGO-LJ            331100      
005910*             STRING "ERROR CAT : 492",                           331200      
005911*                    "TIPOS DE FONDO S", W77-SISTEMA-PARAM,       331300      
005912*                    " LIMITE 100 "                               331400      
005913*                    " # TF  " W77-IND                            331500      
005914*                    " AVISAR A SISTEMAS "                        331600      
005915*             DELIMITED BY SIZE                                   331700      
005916*             INTO TEXTO-LJ                                       331800      
005917*             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 331900      
005918*          ELSE                                                   332000      
005919*             NEXT SENTENCE                                       332100      
005920     ELSE                                                         332200      
005921        MOVE 1                            TO W77-EOF              332300      
005922        MOVE S080-CD-RESULT               TO W77-CAMPO-DISPLAY    332400      
005923        MOVE "O"                          TO TIPO-LJ              332500      
005924        MOVE 020901                       TO CODIGO-LJ            332600      
005925        STRING "ERROR EN CALL S080BD01CON,RESULT = ",             332700      
005926                W77-CAMPO-DISPLAY, "CAT : 492 ",                  332800      
005927                "CATALOGO DE TIPOS DE FONDO "                     332900      
005928                DELIMITED BY SIZE INTO TEXTO-LJ                   333000      
005929        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      333100      
005930                                                                  333200      
005931     IF S080-CD-RESULT = 0                                        333300      
005932        MOVE 1                            TO W77-EOF.             333400      
005933                                                                  333500      
005934                                                                  333600      
005935 12100-CARGA-CATALOGO-CAT.                                        333700      
005936*=========================                                        333800      
005937     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    333900      
005938           USING  S080-CP-SISTEMA          S080-CP-PROGRAMA       334000      
005939                  S080-CP-PARAMETRO-ENT    S080-CP-PARAMETRO-SAL  334100      
005940           GIVING S080-CP-RESULT                                  334200      
005941                                                                  334300      
005942     IF S080-CP-RESULT = 0 OR = 1                                 334400      
005943        MOVE S080-CPPS-NUM-REGISTRO    TO W77-IND5                334500      
005944        PERFORM 12110-CATALOGO-CAT VARYING W77-IND6 FROM 1 BY 1   334600      
005945                UNTIL W77-IND6 > W77-IND5                         334700      
005946        MOVE S080-CPPS-DATOS(W77-IND5,1) TO S080-CPPE-LLAVE1      334800      
005947        MOVE S080-CPPS-DATOS(W77-IND5,2) TO S080-CPPE-LLAVE2      334900      
005948        MOVE S080-CPPS-DATOS(W77-IND5,3) TO S080-CPPE-LLAVE3      335000      
005949        MOVE S080-CPPS-DATOS(W77-IND5,4) TO S080-CPPE-LLAVE4      335100      
005950        MOVE S080-CPPS-DATOS(W77-IND5,5) TO S080-CPPE-LLAVE5      335200      
005951        MOVE S080-CPPS-DATOS(W77-IND5,6) TO S080-CPPE-LLAVE6      335300      
005952        MOVE S080-CPPS-NIVEL-INI         TO S080-CPPE-NIVEL-INI   335400      
005953        MOVE S080-CPPS-FECHA-CONS        TO S080-CPPE-FECHA-CONS  335500      
005954        MOVE S080-CPPS-FECHA-VIG(W77-IND5)                        335600      
005955                                         TO S080-CPPE-FECHA-VIG   335700      
005956     ELSE                                                         335800      
005957        MOVE 1                            TO W77-EOF              335900      
005958        MOVE S080-CP-RESULT               TO W77-CAMPO-DISPLAY    336000      
005959        MOVE "O"                          TO TIPO-LJ              336100      
005960        MOVE 020601                       TO CODIGO-LJ            336200      
005961        STRING "ERROR EN CALL CATALOGO DE CATALOGOS (P523), ",    336300      
005962               " RESULT = ",  W77-CAMPO-DISPLAY DELIMITED BY SIZE 336400      
005963                INTO TEXTO-LJ                                     336500      
005964        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       336600      
005965        SET MYSELF(STATUS)                TO -1.                  336700      
005966                                                                  336800      
005967     IF S080-CP-RESULT = 0   MOVE 1       TO W77-EOF.             336900      
005968                                                                  337000      
005969 12110-CATALOGO-CAT.                                              337100      
005970*===================                                              337200      
005971     MOVE S080-CPPS-DATOS(W77-IND6,2)     TO W77-IND              337300      
005972     IF W77-IND > 0 AND W77-IND < 21                              337400      
005973        MOVE S080-CPPS-DATOS(W77-IND6,4) TO WKS-CAT-NUM (W77-IND) 337500      
005974        MOVE S080-CPPS-DATOS(W77-IND6,5) TO WKS-CAT-FORM(W77-IND) 337600      
005975     ELSE                                                         337700      
005976        MOVE "O"              TO TIPO-LJ                          337800      
005977        MOVE 020601           TO CODIGO-LJ                        337900      
005978        STRING "ERROR CATALOGO DE CATALOGOS (P523), ",            338000      
005979             "S080-CPPS-DATOS(2) > 14, SOBREPASA " ,              338100      
005980             " ARREGLO "                                          338200      
005981        DELIMITED BY SIZE INTO TEXTO-LJ                           338300      
005982        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       338400      
005983        SET MYSELF(STATUS)    TO -1.                              338500      
005984                                                                  338600      
005985 12150-CARGA-LEYENDAS.                                            338700      
005986*=====================                                            338800      
005987     CALL "L700_CONSUL_DESC IN S080BD01CON"                       338900      
005988           USING S080-CD-SISTEMA                                  339000      
005989                 S080-CD-PROGRAMA                                 339100      
005990                 S080-CD-PARAMETRO-ENT                            339200      
005991                 S080-CD-PARAMETRO-SAL                            339300      
005992           GIVING S080-CD-RESULT                                  339400      
005993                                                                  339500      
005994     IF S080-CD-RESULT = 0 OR = 1                                 339600      
005995        MOVE S080-CDPS-CVE-REGIST         TO W77-IND              339700      
005996                                             S080-CDPE-CVE-REGIST 339800      
005997        MOVE S080-CDPS-NIVEL-INI          TO S080-CDPE-NIVEL-INI  339900      
005998        IF W77-IND < 10001                                        340000      
005999           IF W77-IND > 9000                                      340100      
006000              COMPUTE W77-IND = W77-IND - 9000                    340200      
006001              MOVE S080-CDPS-TEXTO-CORTO                 TO       340300      
006002                                 WKS-LEYENDA-TRANS4(W77-IND)      340400      
006003           ELSE                                                   340500      
006004              IF W77-IND < 9001                                   340600      
006005                 IF W77-IND > 6000                                340700      
006006                    COMPUTE W77-IND = W77-IND - 6000              340800      
006007                    MOVE S080-CDPS-TEXTO-CORTO           TO       340900      
006008                                 WKS-LEYENDA-TRANS3(W77-IND)      341000      
006009                 ELSE                                             341100      
006010                    IF W77-IND < 6001                             341200      
006011                       IF W77-IND > 3000                          341300      
006012                          COMPUTE W77-IND = W77-IND - 3000        341400      
006013                          MOVE S080-CDPS-TEXTO-CORTO     TO       341500      
006014                                 WKS-LEYENDA-TRANS2(W77-IND)      341600      
006015                       ELSE                                       341700      
006016                          MOVE S080-CDPS-TEXTO-CORTO     TO       341800      
006017                                 WKS-LEYENDA-TRANS1(W77-IND)      341900      
006018        ELSE                                                      342000      
006019           IF W77-SW-CAT500 = 0                                   342100      
006020              MOVE 1                      TO W77-SW-CAT500        342200      
006021              MOVE S080-CDPS-CVE-REGIST   TO W77-IND              342300      
006022              MOVE "O"                    TO TIPO-LJ              342400      
006023              MOVE 020601                 TO CODIGO-LJ            342500      
006024              STRING "ERROR CAT. 500 ( LEY. TRAN. ) "             342600      
006025                     " S" W77-SISTEMA-PARAM                       342700      
006026                     " LIMITE 10000 "                             342800      
006027                     " # LEY " W77-IND                            342900      
006028                     " AVISAR A SISTEMAS "                        343000      
006029              DELIMITED BY SIZE                                   343100      
006030              INTO TEXTO-LJ                                       343200      
006031              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 343300      
006032           ELSE                                                   343400      
006033              NEXT SENTENCE                                       343500      
006034     ELSE                                                         343600      
006035        MOVE 1                            TO W77-EOF              343700      
006036        MOVE S080-CD-RESULT               TO W77-CAMPO-DISPLAY    343800      
006037        MOVE "O"                          TO TIPO-LJ              343900      
006038        MOVE 020901                       TO CODIGO-LJ            344000      
006039        STRING "ERROR EN CALL S080BD01CON,RESULT = ",             344100      
006040                W77-CAMPO-DISPLAY, "CATALOGO 500"                 344200      
006041                DELIMITED BY SIZE                                 344300      
006042                INTO TEXTO-LJ                                     344400      
006043        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      344500      
006044                                                                  344600      
006045     IF S080-CD-RESULT = 0                                        344700      
006046        MOVE 1                            TO W77-EOF.             344800      
006047                                                                  344900      
006048 12200-CARGA-TRANSACCIONES.                                       345000      
006049*==========================                                       345100      
006050     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    345200      
006051           USING  S080-CP-SISTEMA          S080-CP-PROGRAMA       345300      
006052                  S080-CP-PARAMETRO-ENT    S080-CP-PARAMETRO-SAL  345400      
006053           GIVING S080-CP-RESULT                                  345500      
006054                                                                  345600      
006055     IF S080-CP-RESULT = 0 OR = 1                                 345700      
006056        MOVE S080-CPPS-NUM-REGISTRO    TO W77-IND5                345800      
006057        PERFORM 12210-CARGA-TRAN   VARYING W77-IND6 FROM 1 BY 1   345900      
006058                UNTIL W77-IND6 > W77-IND5                         346000      
006059        MOVE S080-CPPS-DATOS(W77-IND5,1) TO S080-CPPE-LLAVE1      346100      
006060        MOVE S080-CPPS-DATOS(W77-IND5,2) TO S080-CPPE-LLAVE2      346200      
006061        MOVE S080-CPPS-DATOS(W77-IND5,3) TO S080-CPPE-LLAVE3      346300      
006062        MOVE S080-CPPS-DATOS(W77-IND5,4) TO S080-CPPE-LLAVE4      346400      
006063        MOVE S080-CPPS-DATOS(W77-IND5,5) TO S080-CPPE-LLAVE5      346500      
006064        MOVE S080-CPPS-DATOS(W77-IND5,6) TO S080-CPPE-LLAVE6      346600      
006065        MOVE S080-CPPS-NIVEL-INI       TO S080-CPPE-NIVEL-INI     346700      
006066        MOVE S080-CPPS-FECHA-CONS      TO S080-CPPE-FECHA-CONS    346800      
006067        MOVE S080-CPPS-FECHA-VIG(W77-IND5) TO S080-CPPE-FECHA-VIG 346900      
006068     ELSE                                                         347000      
006069        MOVE 1                            TO W77-EOF              347100      
006070        MOVE S080-CP-RESULT               TO W77-CAMPO-DISPLAY    347200      
006071        MOVE "I"                          TO TIPO-LJ              347300      
006072        MOVE 020901                       TO CODIGO-LJ            347400      
006073        STRING "ERROR EN CALL PARAMETROS S080BD01CON,RESULT = ",  347500      
006074               ,W77-CAMPO-DISPLAY," SISTEMA: ",                   347600      
006075               W77-SISTEMA-PARAM,                                 347700      
006076               " CVETRA: ",S080-CPPS-DATOS(W77-IND5,1),           347800      
006077               "NUM.CATA: ",WKS-NUM-CATA,                         347900      
006078               " CATALOGO DE TRANSACCIONES. " DELIMITED BY SIZE   348000      
006079               INTO TEXTO-LJ                                      348100      
006080        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       348200      
006081        SET MYSELF(STATUS)               TO -1.                   348300      
006082                                                                  348400      
006083     IF S080-CP-RESULT = 0   MOVE 1       TO W77-EOF.             348500      
006084                                                                  348600      
006085 12210-CARGA-TRAN.                                                348700      
006086*=================                                                348800      
006087     MOVE S080-CPPS-DATOS(W77-IND6,1) TO  W77-IND                 348900      
006088     IF W77-IND > 0 AND W77-IND < 10001                           349000      
006089        IF S080-CPPS-DATOS(W77-IND6,2) = 1                        349100      
006090           MOVE 1 TO      WKS-PT-EXISTE(W77-IND,1)                349200      
006091           MOVE S080-CPPS-DATOS(W77-IND6,3) TO                    349300      
006092                          WKS-PT-NUM-LEYEN (W77-IND,1)            349400      
006093           MOVE S080-CPPS-DATOS(W77-IND6,4) TO                    349500      
006094                          WKS-PT-EVENTO  (W77-IND,1)              349600      
006095           MOVE S080-CPPS-DATOS(W77-IND6,5) TO                    349700      
006096                          WKS-PT-CGENTRA (W77-IND,1)              349800      
006097           MOVE S080-CPPS-DATOS(W77-IND6,6) TO                    349900      
006098                          WKS-PT-NATS028 (W77-IND,1)              350000      
006099           MOVE S080-CPPS-DATOS(W77-IND6,7) TO                    350100      
006100                          WKS-PT-INDS254 (W77-IND,1)              350200      
006101           MOVE S080-CPPS-DATOS(W77-IND6,8) TO                    350220      
006102                          WKS-PT-INDBITA (W77-IND,1)              350240      
006103           MOVE S080-CPPS-DATOS(W77-IND6,11) TO                   350300      
006104                          WKS-PT-INDAM   (W77-IND,1)              350400      
006105*+    DISPLAY WKS-PT-INDS254(W77-IND,1)" "WKS-PT-INDAM(W77-IND,1) 350410      
006106*+        DISPLAY "INDS254      " S080-CPPS-DATOS(W77-IND6,7)     350420      
006107*+        DISPLAY "INDAM        " S080-CPPS-DATOS(W77-IND6,7)     350440      
006108*+        DISPLAY "TRANSACCION  " W77-IND6" "W77-IND" 1"          350490      
006109        ELSE                                                      350500      
006110          MOVE 1 TO       WKS-PT-EXISTE(W77-IND,2)                350600      
006111          MOVE S080-CPPS-DATOS(W77-IND6,3) TO                     350700      
006112                          WKS-PT-NUM-LEYEN (W77-IND,2)            350800      
006113          MOVE S080-CPPS-DATOS(W77-IND6,4) TO                     350900      
006114                          WKS-PT-EVENTO (W77-IND,2)               351000      
006115          MOVE S080-CPPS-DATOS(W77-IND6,5) TO                     351100      
006116                          WKS-PT-CGENTRA (W77-IND,2)              351200      
006117          MOVE S080-CPPS-DATOS(W77-IND6,6) TO                     351300      
006118                          WKS-PT-NATS028 (W77-IND,2)              351400      
006119          MOVE S080-CPPS-DATOS(W77-IND6,7) TO                     351500      
006120                          WKS-PT-INDS254 (W77-IND,2)              351600      
006121          MOVE S080-CPPS-DATOS(W77-IND6,8) TO                     351700      
006122                          WKS-PT-INDBITA (W77-IND,2)              351800      
006123          MOVE S080-CPPS-DATOS(W77-IND6,11) TO                    351810      
006124                          WKS-PT-INDAM     (W77-IND,2)            351820      
006125*+   DISPLAY WKS-PT-INDS254(W77-IND,2)" "WKS-PT-INDAM(W77-IND,2)  351830      
006126*+        DISPLAY "INDS254      " S080-CPPS-DATOS(W77-IND6,7)     351840      
006127*+        DISPLAY "INDAM        " S080-CPPS-DATOS(W77-IND6,11)    351860      
006128*+        DISPLAY "TRANSACCION  " W77-IND6" "W77-IND              351880      
006129  ELSE                                                            351900      
006130     MOVE 1                      TO W77-SW-CAT502                 352000      
006131     MOVE "O"                    TO TIPO-LJ                       352100      
006132     MOVE 020601                 TO CODIGO-LJ                     352200      
006133     STRING "ERROR CAT ", WKS-NUM-CATA ,                          352300      
006134            " S" , W77-SISTEMA-PARAM                              352400      
006135            " LIMITE 10000 ",   " CVETRAN ",  W77-IND             352500      
006136             DELIMITED BY SIZE        INTO TEXTO-LJ               352600      
006137     CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ          352700      
006138     SET MYSELF(STATUS)          TO -1.                           352800      
006139                                                                  352900      
006140 12500-CARGA-TIPOCRED.                                            353000      
006141*=====================                                            353100      
006142     CALL "L700_CONSUL_DESC IN S080BD01CON"                       353200      
006143           USING S080-CD-SISTEMA                                  353300      
006144                 S080-CD-PROGRAMA                                 353400      
006145                 S080-CD-PARAMETRO-ENT                            353500      
006146                 S080-CD-PARAMETRO-SAL                            353600      
006147           GIVING S080-CD-RESULT                                  353700      
006148                                                                  353800      
006149     IF S080-CD-RESULT = 0 OR = 1                                 353900      
006150        MOVE S080-CDPS-CVE-REGIST         TO W77-IND              354000      
006151                                             S080-CDPE-CVE-REGIST 354100      
006152        MOVE S080-CDPS-NIVEL-INI          TO S080-CDPE-NIVEL-INI  354200      
006153        IF W77-IND < 100                                          354300      
006154           MOVE S080-CDPS-CVE-REGIST      TO WKS-NUM-TC(W77-IND)  354400      
006155           MOVE S080-CDPS-TEXTO-PANTALLA  TO WKS-NOM-TC(W77-IND)  354500      
006156        ELSE                                                      354600      
006157           IF W77-SW-CAT500 = 0                                   354700      
006158              MOVE 1                      TO W77-SW-CAT500        354800      
006159              MOVE S080-CDPS-CVE-REGIST   TO W77-IND              354900      
006160              MOVE "O"                    TO TIPO-LJ              355000      
006161              MOVE 020601                 TO CODIGO-LJ            355100      
006162              STRING "ERROR CAT: ",WKS-NUM-CATA,                  355200      
006163                     "TIPOS DE CREDITO S", W77-SISTEMA-PARAM,     355300      
006164                     " LIMITE 100 "                               355400      
006165                     " # TC  " W77-IND                            355500      
006166                     " AVISAR A SISTEMAS "                        355600      
006167              DELIMITED BY SIZE                                   355700      
006168              INTO TEXTO-LJ                                       355800      
006169              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 355900      
006170           ELSE                                                   356000      
006171              NEXT SENTENCE                                       356100      
006172     ELSE                                                         356200      
006173        MOVE 1                            TO W77-EOF              356300      
006174        MOVE S080-CD-RESULT               TO W77-CAMPO-DISPLAY    356400      
006175        MOVE "O"                          TO TIPO-LJ              356500      
006176        MOVE 020901                       TO CODIGO-LJ            356600      
006177        STRING "ERROR EN CALL S080BD01CON,RESULT = ",             356700      
006178                W77-CAMPO-DISPLAY, "CAT: ", WKS-NUM-CATA,         356800      
006179                "CATALOGO DE TIPOS DE CREDITO "                   356900      
006180                DELIMITED BY SIZE INTO TEXTO-LJ                   357000      
006181        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      357100      
006182                                                                  357200      
006183     IF S080-CD-RESULT = 0                                        357300      
006184        MOVE 1                            TO W77-EOF.             357400      
006185                                                                  357500      
006186*RGV 12700-CARGA-CAT-UOCS.                                        357600      
006187*RGV =====================                                        357700      
006188*RGV CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    357800      
006189*RGV       USING  S080-CP-SISTEMA           S080-CP-PROGRAMA      357900      
006190*RGV              S080-CP-PARAMETRO-ENT     S080-CP-PARAMETRO-SAL 358000      
006191*RGV       GIVING S080-CP-RESULT.                                 358100      
006192*RGV                                                              358200      
006193*RGV IF S080-CP-RESULT = 0 OR = 1                                 358300      
006194*RGV    MOVE S080-CPPS-NUM-REGISTRO    TO W77-IND5                358400      
006195*RGV    PERFORM 12210-CARGA-TRAN VARYING W77-IND6 FROM 1 BY 1     358500      
006196*RGV            UNTIL W77-IND6 > W77-IND5                         358600      
006197*RGV    MOVE S080-CPPS-DATOS(W77-IND5,1) TO S080-CPPE-LLAVE1      358700      
006198*RGV    MOVE S080-CPPS-DATOS(W77-IND5,2) TO S080-CPPE-LLAVE2      358800      
006199*RGV    MOVE S080-CPPS-DATOS(W77-IND5,3) TO S080-CPPE-LLAVE3      358900      
006200*RGV    MOVE S080-CPPS-DATOS(W77-IND5,4) TO S080-CPPE-LLAVE4      359000      
006201*RGV    MOVE S080-CPPS-DATOS(W77-IND5,5) TO S080-CPPE-LLAVE5      359100      
006202*RGV    MOVE S080-CPPS-DATOS(W77-IND5,6) TO S080-CPPE-LLAVE6      359200      
006203*RGV    MOVE S080-CPPS-NIVEL-INI         TO S080-CPPE-NIVEL-INI   359300      
006204*RGV    MOVE S080-CPPS-FECHA-CONS        TO S080-CPPE-FECHA-CONS  359400      
006205*RGV    MOVE S080-CPPS-FECHA-VIG(W77-IND5) TO S080-CPPE-FECHA-VIG 359500      
006206*RGV ELSE                                                         359600      
006207*RGV    IF S080-CP-RESULT = 20                                    359700      
006208*RGV       MOVE 1                           TO W77-EOF            359800      
006209*RGV    ELSE                                                      359900      
006210*RGV       MOVE 1                            TO W77-LEE-FIN       360000      
006211*RGV       MOVE S080-CP-RESULT               TO W77-CAMPO-DISPLAY 360100      
006212*RGV       MOVE "O"                          TO TIPO-LJ           360200      
006213*RGV       MOVE 020601                       TO CODIGO-LJ         360300      
006214*RGV       MOVE S080-CPPE-CATALOGO           TO WKS-NUM-CATA      360400      
006215*RGV       STRING "ERROR EN CALL PARAMETROS S080BD01CON,RESULT = "360500      
006216*RGV            ,W77-CAMPO-DISPLAY," SISTEMA: ",W77-SISTEMA-PARAM,360600      
006217*RGV             " NUM.CATALOGO : ",WKS-NUM-CATA,                 360700      
006218*RGV             " CATALOGO DE SUC-UOCS. " DELIMITED BY SIZE      360800      
006219*RGV             INTO TEXTO-LJ                                    360900      
006220*RGV       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ    361000      
006221*RGV       SET MYSELF(STATUS)               TO -1.                361100      
006222*RGV                                                              361200      
006223*RGV IF S080-CP-RESULT = 0 MOVE 1        TO W77-EOF.              361300      
006224*RGV                                                              361400      
006225*RGV 12710-CARGA-UOCS.                                            361500      
006226*RGV =================                                            361600      
006227*RGV MOVE S080-CPPS-DATOS(W77-IND6,1)     TO W77-IND              361700      
006228*RGV IF W77-IND > 0 AND W77-IND < 5000                            361800      
006229*RGV    MOVE S080-CPPS-DATOS(W77-IND6,2) TO WKS-NUM-UOC(W77-IND)  361900      
006230*RGV ELSE                                                         362000      
006231*RGV    MOVE "O"                    TO TIPO-LJ                    362100      
006232*RGV    MOVE 020601                 TO CODIGO-LJ                  362200      
006233*RGV    STRING "ERROR: CAT. UOCS ,SUC:", W77-IND ,                362300      
006234*RGV            "MAYOR A 5000 NOTIFICAR A SISTEMA 151 "           362400      
006235*RGV    DELIMITED BY SIZE INTO TEXTO-LJ                           362500      
006236*RGV     CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ      362600      
006237*RGV     SET MYSELF(STATUS)        TO -1.                         362700      
006238*RGV                                                              362800      
006239 12800-CARGA-LIBROS.                                              362900      
006240*===================                                              363000      
006241     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    363100      
006242           USING  S080-CP-SISTEMA           S080-CP-PROGRAMA      363200      
006243                  S080-CP-PARAMETRO-ENT     S080-CP-PARAMETRO-SAL 363300      
006244           GIVING S080-CP-RESULT.                                 363400      
006245                                                                  363500      
006246     IF S080-CP-RESULT = 0 OR = 1                                 363600      
006247        MOVE S080-CPPS-NUM-REGISTRO    TO W77-IND5                363700      
006248        PERFORM 12810-CARGA-LIB  VARYING W77-IND6 FROM 1 BY 1     363800      
006249                UNTIL W77-IND6 > W77-IND5                         363900      
006250        MOVE S080-CPPS-DATOS(W77-IND5,1) TO S080-CPPE-LLAVE1      364000      
006251        MOVE S080-CPPS-DATOS(W77-IND5,2) TO S080-CPPE-LLAVE2      364100      
006252        MOVE S080-CPPS-DATOS(W77-IND5,3) TO S080-CPPE-LLAVE3      364200      
006253        MOVE S080-CPPS-DATOS(W77-IND5,4) TO S080-CPPE-LLAVE4      364300      
006254        MOVE S080-CPPS-DATOS(W77-IND5,5) TO S080-CPPE-LLAVE5      364400      
006255        MOVE S080-CPPS-DATOS(W77-IND5,6) TO S080-CPPE-LLAVE6      364500      
006256        MOVE S080-CPPS-NIVEL-INI         TO S080-CPPE-NIVEL-INI   364600      
006257        MOVE S080-CPPS-FECHA-CONS        TO S080-CPPE-FECHA-CONS  364700      
006258        MOVE S080-CPPS-FECHA-VIG(W77-IND5) TO S080-CPPE-FECHA-VIG 364800      
006259     ELSE                                                         364900      
006260           MOVE 1                            TO W77-LEE-FIN       365000      
006261           MOVE S080-CP-RESULT               TO W77-CAMPO-DISPLAY 365100      
006262           MOVE "O"                          TO TIPO-LJ           365200      
006263           MOVE 020901                       TO CODIGO-LJ         365300      
006264           MOVE S080-CPPE-CATALOGO           TO WKS-NUM-CATA      365400      
006265           STRING "ERROR EN CALL PARAMETROS S080BD01CON,RESULT = "365500      
006266               ,W77-CAMPO-DISPLAY," SISTEMA: ",W77-SISTEMA-PARAM, 365600      
006267               ," NUM.CATA: ",WKS-NUM-CATA,                       365700      
006268               " CATALOGO DE LIBROS. "                            365800      
006269               DELIMITED BY SIZE INTO TEXTO-LJ                    365900      
006270           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ    366000      
006271           SET MYSELF(STATUS)            TO -1.                   366100      
006272                                                                  366200      
006273     IF S080-CP-RESULT = 0                                        366300      
006274        MOVE 1        TO W77-EOF.                                 366400      
006275                                                                  366500      
006276 12810-CARGA-LIB.                                                 366600      
006277*================                                                 366700      
006278     IF S080-CPPS-DATOS(W77-IND6,1) = W77-SISTEMA-PARAM           366800      
006279        COMPUTE W77-INDLIB = S080-CPPS-DATOS(W77-IND6,2) + 1      366900      
006280        MOVE S080-CPPS-DATOS(W77-IND6,2) TO WKS-LIBRO(W77-INDLIB) 367000      
006281        MOVE S080-CPPS-DATOS(W77-IND6,3) TO                       367100      
006282                                         WKS-MONEDAOP(W77-INDLIB) 367200      
006283        MOVE S080-CPPS-DATOS(W77-IND6,7) TO                       367300      
006284                                        WKS-CENT-CONT(W77-INDLIB).367400      
006285                                                                  367500      
006286 12900-CARGA-DESVIOS.                                             367600      
006287*====================                                             367700      
006288     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    367800      
006289           USING  S080-CP-SISTEMA          S080-CP-PROGRAMA       367900      
006290                  S080-CP-PARAMETRO-ENT    S080-CP-PARAMETRO-SAL  368000      
006291           GIVING S080-CP-RESULT                                  368100      
006292                                                                  368200      
006293     IF S080-CP-RESULT = 0 OR = 1                                 368300      
006294        MOVE S080-CPPS-NUM-REGISTRO    TO W77-IND5                368400      
006295        PERFORM 12910-CARGA-DESV   VARYING W77-IND6 FROM 1 BY 1   368500      
006296                UNTIL W77-IND6 > W77-IND5                         368600      
006297        MOVE S080-CPPS-DATOS(W77-IND5,1) TO S080-CPPE-LLAVE1      368700      
006298        MOVE S080-CPPS-DATOS(W77-IND5,2) TO S080-CPPE-LLAVE2      368800      
006299        MOVE S080-CPPS-DATOS(W77-IND5,3) TO S080-CPPE-LLAVE3      368900      
006300        MOVE S080-CPPS-DATOS(W77-IND5,4) TO S080-CPPE-LLAVE4      369000      
006301        MOVE S080-CPPS-DATOS(W77-IND5,5) TO S080-CPPE-LLAVE5      369100      
006302        MOVE S080-CPPS-DATOS(W77-IND5,6) TO S080-CPPE-LLAVE6      369200      
006303        MOVE S080-CPPS-NIVEL-INI       TO S080-CPPE-NIVEL-INI     369300      
006304        MOVE S080-CPPS-FECHA-CONS      TO S080-CPPE-FECHA-CONS    369400      
006305        MOVE S080-CPPS-FECHA-VIG(W77-IND5) TO S080-CPPE-FECHA-VIG 369500      
006306     ELSE                                                         369600      
006307        MOVE 1                            TO W77-EOF              369700      
006308        MOVE S080-CP-RESULT               TO W77-CAMPO-DISPLAY    369800      
006309        MOVE "I"                          TO TIPO-LJ              369900      
006310        MOVE 020901                       TO CODIGO-LJ            370000      
006311        STRING "ERROR EN CALL PARAMETROS S080BD01CON,RESULT = ",  370100      
006312               ,W77-CAMPO-DISPLAY," SISTEMA: ",                   370200      
006313               W77-SISTEMA-PARAM,                                 370300      
006314               "NUM.CATA: ",WKS-NUM-CATA,                         370400      
006315               " CATALOGO DE DESVIOS " DELIMITED BY SIZE          370500      
006316               INTO TEXTO-LJ                                      370600      
006317        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       370700      
006318        SET MYSELF(STATUS)               TO -1.                   370800      
006319                                                                  370900      
006320     IF S080-CP-RESULT = 0   MOVE 1       TO W77-EOF.             371000      
006321                                                                  371100      
006322 12910-CARGA-DESV.                                                371200      
006323*=================                                                371300      
006324     MOVE S080-CPPS-DATOS(W77-IND6,1) TO  WKS-SUCINI-DESVIO       371400      
006325     MOVE S080-CPPS-DATOS(W77-IND6,2) TO  WKS-CVETRA-DESVIO       371500      
006326     MOVE S080-CPPS-DATOS(W77-IND6,3) TO  WKS-TM-DESVIO           371600      
006327     MOVE S080-CPPS-DATOS(W77-IND6,4) TO  WKS-TC-DESVIO           371700      
006328     MOVE S080-CPPS-DATOS(W77-IND6,5) TO  WKS-LIBRO-DESVIO.       371800      
006329                                                                  371900      
006330 12900-CARGA-CAT-209.                                             372000      
006331*====================                                             372100      
006332     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    372200      
006333           USING  S080-CP-SISTEMA          S080-CP-PROGRAMA       372300      
006334                  S080-CP-PARAMETRO-ENT    S080-CP-PARAMETRO-SAL  372400      
006335           GIVING S080-CP-RESULT                                  372500      
006336                                                                  372600      
006337     IF S080-CP-RESULT = 0 OR = 1                                 372700      
006338        MOVE S080-CPPS-NUM-REGISTRO      TO W77-IND5              372800      
006339        PERFORM 12910-CARGA-C209   VARYING W77-IND6 FROM 1 BY 1   372900      
006340                UNTIL W77-IND6 > W77-IND5                         373000      
006341        MOVE S080-CPPS-DATOS(W77-IND5,1) TO S080-CPPE-LLAVE1      373100      
006342        MOVE S080-CPPS-DATOS(W77-IND5,2) TO S080-CPPE-LLAVE2      373200      
006343        MOVE S080-CPPS-DATOS(W77-IND5,3) TO S080-CPPE-LLAVE3      373300      
006344        MOVE S080-CPPS-DATOS(W77-IND5,4) TO S080-CPPE-LLAVE4      373400      
006345        MOVE S080-CPPS-DATOS(W77-IND5,5) TO S080-CPPE-LLAVE5      373500      
006346        MOVE S080-CPPS-DATOS(W77-IND5,6) TO S080-CPPE-LLAVE6      373600      
006347        MOVE S080-CPPS-NIVEL-INI         TO S080-CPPE-NIVEL-INI   373700      
006348        MOVE S080-CPPS-FECHA-CONS        TO S080-CPPE-FECHA-CONS  373800      
006349        MOVE S080-CPPS-FECHA-VIG(W77-IND5) TO S080-CPPE-FECHA-VIG 373900      
006350     ELSE                                                         374000      
006351        MOVE 1                             TO W77-EOF             374100      
006352        MOVE S080-CP-RESULT                TO W77-CAMPO-DISPLAY   374200      
006353        MOVE "I"                           TO TIPO-LJ             374300      
006354        MOVE 020901                        TO CODIGO-LJ           374400      
006355        STRING "ERROR EN CALL PARAMETROS S080BD01CON,RESULT = ",  374500      
006356               ,W77-CAMPO-DISPLAY," SISTEMA: ",                   374600      
006357               W77-SISTEMA-PARAM,                                 374700      
006358               "NUM.CATA: ",WKS-NUM-CATA,                         374800      
006359               "  CATALOGO BIVA " DELIMITED BY SIZE               374900      
006360               INTO TEXTO-LJ                                      375000      
006361        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       375100      
006362        SET MYSELF(STATUS)               TO -1.                   375200      
006363                                                                  375300      
006364     IF S080-CP-RESULT = 0   MOVE 1       TO W77-EOF.             375400      
006365                                                                  375500      
006366 12910-CARGA-C209.                                                375600      
006367*=================                                                375700      
006368*RGV v                                                            375800      
006369     MOVE S080-CPPS-DATOS(W77-IND6,3) TO W77-209.                 375900      
006370     IF W77-209                       <  10000                    376000      
006371        MOVE 1                        TO WKS-C209-EXISTE(W77-209).376100      
006372*RGV ^                                                            376200      
006373 12900-OBTEN-TIT940.                                              376300      
006374*===================                                              376400      
006375     MOVE "S006P940"         TO WKS-CTLVERS-LIBRERIA.             376500      
006376     CALL "DAME_TIT IN CTRLVERS"                                  376600      
006377           USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO         376700      
006378           GIVING WKS-CTLVERS-STATUS.                             376800      
006379                                                                  376900      
006380     IF WKS-CTLVERS-STATUS < 0                                    377000      
006381        MOVE "I"    TO TIPO-LJ                                    377100      
006382        MOVE 020101 TO CODIGO-LJ                                  377200      
006383        STRING "ERROR EN CTLVERS, USO S006/OBJECT/P940 SIN ",     377300      
006384               "RELEASE NI MTP." DELIMITED BY SIZE INTO TEXTO-LJ  377400      
006385        CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ       377500      
006386        MOVE "(S006)S006/OBJECT/P940/CTRLFTP/01MTP001 ON XFER"    377600      
006387        TO WKS-START-PROG                                         377700      
006388     ELSE                                                         377800      
006389        STRING WKS-CTLVERS-TITULO DELIMITED BY SIZE               377900      
006390               INTO WKS-START-PROG.                               378000      
006391                                                                  378100      
006392******************************************************************378200      
006393*                 LEE ARCHIVO DE MOVIMIENTOS Y                   *378300      
006394*                  GENERA ARCHIVOS DE TRABAJO                    *378400      
006395******************************************************************378500      
006396 20000-PROCESA-MOVIMIENTOS.                                       378600      
006397*=========================                                        378700      
006398     CHANGE ATTRIBUTE LIBACCESS OF "OUTBOARD" TO BYFUNCTION.      378800      
006399                                                                  378900      
006400     MOVE 9                         TO WKS-NUM-BACKUP             379000      
006401     MOVE "DESVIOS  "               TO WKS-NOMBRE-BACKUP          379100      
006402     MOVE WKS-TB-NOMB-REPORTE        TO                           379200      
006403                                      WSR-RB-E1-NOMB-REPORTE      379300      
006404     MOVE "                 REPORTE DE DESVIOS      "             379400      
006405                                    TO WSR-RB-E2-TITULO           379500      
006406     MOVE WKS-FECHA-MAQ             TO WSR-RB-E2-FECHA-PROC       379600      
006407     MOVE WKS-FECHA-PROCESO         TO WSR-RB-E1-FECHA-INF        379700      
006408     MOVE "DIARIO"                  TO WSR-RB-E2-TIPO-PROC        379800      
006409     MOVE WKS-HORA-HHMM             TO WSR-RB-E2-HORA-TIT         379900      
006410     MOVE WKS-MINU-HHMM             TO WSR-RB-E2-MINU-TIT         379920      
006411     MOVE WKS-SEGU-HHMM             TO WSR-RB-E2-SEGU-TIT         379940      
006412     MOVE W77-SISTEMA-PARAM         TO WSR-RB-E3-SISTEMA          380000      
006413     MOVE WKS-FECHA-COMP            TO WSR-RB-E3-VERSION          380100      
006414     MOVE 59                        TO WKS-NUM-LINEAS             380200      
006415     MOVE 0                         TO W77-BAN-DESVIOS.           380300      
006416     OPEN INPUT  LOG151.                                          380400      
006417     OPEN INPUT  LOG151-COMP.                                     380500      
006418     OPEN OUTPUT MOVIMIENTOS.                                     380600      
006419     OPEN OUTPUT MOVCONTABLES.                                    380700      
006420     OPEN OUTPUT A01-ATLAS.                                       380800      
006421     OPEN OUTPUT CVETRAN.                                         380900      
006422     OPEN OUTPUT DESVIOS.                                         381000      
006423     IF W88-INTELAR-C600 AND W88-SIST-INTELAR                     381100      
006424        CHANGE ATTRIBUTE TITLE OF FILE-AM TO WKS-TIT-ACTF-INT     381102      
006425     ELSE                                                         381104      
006426        CHANGE ATTRIBUTE TITLE OF FILE-AM TO WKS-TIT-AM      .    381106      
006427                                                                  381108      
006428     IF W77-SISTEMA-PARAM = 600                                   381120      
006429        OPEN  OUTPUT FILE-AM                                      381140      
006430        MOVE  0       TO  WKS-AM-SW                               381150      
006431        PERFORM  20075-GRAB-ARCH-AM.                              381160      
006432                                                                  381180      
006433*    IF W77-SISTEMA-PARAM = 252                                   381200      
006434*       OPEN OUTPUT CVEMARCATOR.                                  381300      
006435*                                                                 381400      
006436     MOVE 1       TO      W77-ARCH-RESIDENT                       381500      
006437                                                                  381600      
006438     READ LOG151 INTO  A00-R00-HDR-MOV                            381700      
006439                                                                  381800      
006440     IF A00-R00-HDR-HD OF A00-R00-HDR-MOV = "HD"                  381900      
006441        IF WKS-FECHA-PROCESO  = A00-R00-HDR-FCH OF A00-R00-HDR-MOV382000      
006442           NEXT SENTENCE                                          382100      
006443        ELSE                                                      382200      
006444           MOVE  "O"                      TO      TIPO-LJ         382300      
006445           MOVE 010401                    TO      CODIGO-LJ       382400      
006446           STRING "ERROR EN FECHAS,ARCHIVO : " ,A00-R00-HDR-FCH   382500      
006447               OF A00-R00-HDR-MOV                                 382600      
006448               " DIFERENTE A FECHA DE PROCESO : ",                382700      
006449               WKS-FECHA-PROCESO                                  382800      
006450               DELIMITED BY SIZE                                  382900      
006451               INTO TEXTO-LJ                                      383000      
006452           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ    383100      
006453     ELSE                                                         383200      
006454        MOVE  "O"                         TO      TIPO-LJ         383300      
006455        MOVE 010401                       TO      CODIGO-LJ       383400      
006456        STRING "ERROR EN HEADER ARCHIVO : " ,A00-R00-HDR-HD       383500      
006457                OF A00-R00-HDR-MOV                                383600      
006458               DELIMITED BY SIZE                                  383700      
006459               INTO TEXTO-LJ                                      383800      
006460        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      383900      
006461                                                                  384000      
006462     MOVE 0                               TO W77-EOF              384100      
006463                                             WKS-TR-ATLAS-NUREG.  384200      
006464     WRITE A01-REG-ATLAS FROM WKS-HDR-ATLAS.                      384300      
006465                                                                  384400      
006466     READ LOG151 INTO A00-R01-REGMOV AT END                       384500      
006467          MOVE 1                          TO W77-EOF.             384600      
006468                                                                  384700      
006469*    IF W77-SISTEMA-PARAM = 252                                   384800      
006470*       PERFORM 20500-GRABA-HD-MERCATOR                           384900      
006471*       IF W77-EOF = 1 OR A00-R01-FUNCION = 99                    385000      
006472*          MOVE 0 TO A00-R03-MERC-TOTREG,A00-R03-MERC-TOTIMP.     385100      
006473*                                                                 385200      
006474     MOVE ZEROS   TO      A00-R01-FIDEICO, A00-R01-PROGRAMA.      385300      
006475                                                                  385400      
006476     IF A00-R01-APUDES > 0                                        385500      
006477        MOVE ZEROS        TO      W77-APUDES                      385600      
006478        COMPUTE W77-APUDES = A00-R01-APUDES + 1                   385700      
006479        READ LOG151-COMP INTO A01-R01-DATOS                       385800      
006480             INVALID KEY                                          385900      
006481                 MOVE ZEROS TO A00-R01-FIDEICO,A00-R01-PROGRAMA   386000      
006482                 MOVE SPACES TO A00-R01-TIPOCREALFA.              386100      
006483                                                                  386200      
006484     MOVE 56 TO WKS-NUM-LINEAS                                    386300      
006485                                                                  386400      
006486     PERFORM 21000-ESCOGE-MOVS UNTIL W77-EOF > 0.                 386500      
006487                                                                  386600      
006488     WRITE A01-REG-ATLAS FROM WKS-TR-ATLAS.                       387100      
006489     WRITE REG-MOVSCIG     FROM WKS-TRAILER-CIG.                  387200      
006490                                                                  387300      
006491     MOVE 1                               TO A00-R02-PUN-CVEREG.  387400      
006492     MOVE W77-TOTREG-PUNTEO               TO A00-R02-PUN-TOTREG.  387500      
006493     WRITE REG-PUNTEO FROM A00-R02-TR-PUNTEO.                     387600      
006494     IF W88-BAN-DESVIOS                                           387700      
006495        CLOSE REPORTE WITH SAVE                                   387800      
006496     ELSE                                                         387900      
006497        PERFORM 21130-ENCABEZADO                                  388000      
006498        MOVE "            NO HUBO INFORMACION      "              388100      
006499                          TO REG-REPORTE                          388200      
006500        WRITE REG-REPORTE                                         388300      
006501        CLOSE REPORTE WITH SAVE.                                  388400      
006502                                                                  388500      
006503*    IF W77-SISTEMA-PARAM = 252                                   388600      
006504*       PERFORM 21180-GRABA-TR-MERCATOR.                          388700      
006505*                                                                 388800      
006506     CLOSE LOG151                                                 388900      
006507           LOG151-COMP                                            389000      
006508     CLOSE A01-ATLAS    WITH SAVE.                                389100      
006509     CLOSE MOVIMIENTOS  WITH SAVE                                 389200      
006510     CLOSE CVETRAN      WITH SAVE                                 389300      
006511     CLOSE MOVCONTABLES WITH SAVE                                 389400      
006512     CLOSE DESVIOS      WITH SAVE                                 389600      
006513     CLOSE MOVSCIG      WITH SAVE                                 389700      
006514     CLOSE PUNTEO       WITH SAVE                                 389800      
006515*                                                                 389900      
006516*    IF W77-SISTEMA-PARAM = 252                                   390000      
006517*       CLOSE CVEMARCATOR WITH SAVE.                              390100      
006518*                                                                 390200      
006519     IF W77-SISTEMA-PARAM = 600                                   390220      
006520        MOVE 2       TO   WKS-AM-SW                               390230      
006521        PERFORM  20075-GRAB-ARCH-AM                               390240      
006522        CLOSE FILE-AM   WITH SAVE                                 390260      
006523        IF W88-INTELAR-C600                                       390262      
006524           MOVE SPACES                   TO WKS-INTE-ARCHIVO      390264      
006525           UNSTRING WKS-TIT-ACTF-INT DELIMITED BY "."             390266      
006526           INTO     WKS-INTE-ARCHIVO                              390268      
006527           PERFORM 35100-ENVIO-INTELAR.                           390270      
006528                                                                  390280      
006529     CALL SYSTEM WFL USING WKS-TIT-WFL.                           390300      
006530     MOVE 0       TO      W77-ARCH-RESIDENT.                      390400      
006531                                                                  390500      
006532 20500-GRABA-HD-MERCATOR.                                         390600      
006533*========================                                         390700      
006534     MOVE 01               TO     A00-R00-MERC-VERSION.           390800      
006535     MOVE WKS-HORA-HHMM    TO     A00-R00-MERC-HH-CREA.           390900      
006536     MOVE WKS-MINU-HHMM    TO     A00-R00-MERC-MM-CREA.           391000      
006537     MOVE ZEROS            TO     A00-R00-FILLER.                 391100      
006538     WRITE REG-CVEMERCATOR FROM   A00-R00-HDR-MERC.               391200      
006539                                                                  391300      
006540 21000-ESCOGE-MOVS.                                               391400      
006541*==================                                               391500      
006542     ADD 1                        TO W77-TP-REG-LEIDOS            391600      
006543                                                                  391700      
006544     IF (A00-R01-FUNCION = 1 OR 2) AND                            391800      
006545        (A00-R01-ORIGEN  = 1 OR 2)                                391900      
006546        PERFORM 21150-GRABA-MOVSCIG.                              392000      
006547                                                                  392100      
006548     IF A00-R01-FUNCION =1 AND A00-R01-STATUS = 1 AND             392200      
006549        A00-R01-SISTEMA = 403                                     392300      
006550        IF A00-R01-MONEDA = 0 OR = 1 OR = 3                       392400      
006551           NEXT SENTENCE                                          392500      
006552        ELSE                                                      392600      
006553           PERFORM 21050-GRABA-ATLAS.                             392700      
006554                                                                  392800      
006555     IF A00-R01-FUNCION = 1                                       392900      
006556        IF A00-R01-STATUS = 1 OR 2                                393000      
006557           PERFORM 21100-GRABA-ARCHIVOS VARYING W77-INDCVE FROM   393100      
006558                    1 BY 1 UNTIL W77-INDCVE > 5 OR                393200      
006559                    (A00-R01-CVETRAN(W77-INDCVE) = 0 AND          393300      
006560                     A00-R01-IMPORTE(W77-INDCVE))                 393400      
006561           ADD 1                  TO W77-TP-REG-PROCESADOS        393500      
006562        ELSE                                                      393600      
006563           ADD 1                  TO W77-TP-REG-ELIMINADOS        393700      
006564     ELSE                                                         393800      
006565        ADD 1                     TO W77-TP-REG-ELIMINADOS.       393900      
006566                                                                  394000      
006567     READ LOG151  INTO A00-R01-REGMOV AT END                      394100      
006568          MOVE 1                          TO W77-EOF.             394200      
006569                                                                  394300      
006570      MOVE ZEROS   TO      A00-R01-FIDEICO, A00-R01-PROGRAMA.     394400      
006571                                                                  394500      
006572     IF A00-R01-APUDES > 0                                        394600      
006573        MOVE ZEROS        TO      W77-APUDES                      394700      
006574        COMPUTE W77-APUDES = A00-R01-APUDES + 1                   394800      
006575        READ LOG151-COMP INTO A01-R01-DATOS                       394900      
006576             INVALID KEY                                          395000      
006577                 MOVE ZEROS TO A00-R01-FIDEICO, A00-R01-PROGRAMA  395100      
006578                 MOVE SPACES TO A00-R01-TIPOCREALFA .             395200      
006579                                                                  395300      
006580     IF W77-EOF = 0                                               395400      
006581        IF A00-R01-FUNCION = 99                                   395500      
006582           MOVE 1                         TO W77-EOF.             395600      
006583                                                                  395700      
006584 21050-GRABA-ATLAS.                                               395800      
006585*==================                                               395900      
006586     MOVE A00-R01-FOLIO-S403       TO WKS-R-ATL-FOLIO.            396000      
006587     MOVE A00-R01-SUCPROM          TO WKS-R-ATL-SUCPROM.          396100      
006588     MOVE A00-R01-CONTRATO         TO WKS-R-ATL-CUENTA.           396200      
006589     MOVE A00-R01-IND-CONTA        TO WKS-R-ATL-BANCO.            396300      
006590     MOVE A00-R01-MONEDA           TO WKS-R-ATL-MONEDA.           396400      
006591     MOVE A00-R01-SUC-INIC         TO WKS-R-ATL-SUCTRAN.          396500      
006592     MOVE A00-R01-TIPOCREDITO      TO WKS-PROD-PASO.              396600      
006593     MOVE WKS-FON-PASO             TO WKS-RATL-FON.               396700      
006594     MOVE WKS-INS-PASO             TO WKS-RATL-INS.               396800      
006595     IF A00-R01-CVETRAN1 = 11 OR 5                                396900      
006596        MOVE A00-R01-CVETRAN1      TO WKS-R-ATL-CVETRAN           397000      
006597        MOVE A00-R01-IMPORTE1      TO WKS-R-ATL-IMPORTE           397100      
006598        ADD  A00-R01-IMPORTE1      TO WKS-TR-ATLAS-TOTIMP         397200      
006599        WRITE A01-REG-ATLAS FROM WKS-REG-ATLAS                    397300      
006600        ADD  1                     TO WKS-TR-ATLAS-NUREG.         397400      
006601     IF A00-R01-CVETRAN2 = 11 OR 5                                397500      
006602        MOVE A00-R01-CVETRAN2      TO WKS-R-ATL-CVETRAN           397600      
006603        MOVE A00-R01-IMPORTE2      TO WKS-R-ATL-IMPORTE           397700      
006604        ADD  A00-R01-IMPORTE2      TO WKS-TR-ATLAS-TOTIMP         397800      
006605        WRITE A01-REG-ATLAS FROM WKS-REG-ATLAS                    397900      
006606        ADD  1                     TO WKS-TR-ATLAS-NUREG.         398000      
006607     IF A00-R01-CVETRAN3 = 11 OR 5                                398100      
006608        MOVE A00-R01-CVETRAN3      TO WKS-R-ATL-CVETRAN           398200      
006609        MOVE A00-R01-IMPORTE3      TO WKS-R-ATL-IMPORTE           398300      
006610        ADD  A00-R01-IMPORTE3      TO WKS-TR-ATLAS-TOTIMP         398400      
006611        WRITE A01-REG-ATLAS FROM WKS-REG-ATLAS                    398500      
006612        ADD  1                     TO WKS-TR-ATLAS-NUREG.         398600      
006613     IF A00-R01-CVETRAN4 = 11 OR 5                                398700      
006614        MOVE A00-R01-CVETRAN4      TO WKS-R-ATL-CVETRAN           398800      
006615        MOVE A00-R01-IMPORTE4      TO WKS-R-ATL-IMPORTE           398900      
006616        ADD  A00-R01-IMPORTE4      TO WKS-TR-ATLAS-TOTIMP         399000      
006617        WRITE A01-REG-ATLAS FROM WKS-REG-ATLAS                    399100      
006618        ADD  1                     TO WKS-TR-ATLAS-NUREG.         399200      
006619     IF A00-R01-CVETRAN5 = 11 OR 5                                399300      
006620        MOVE A00-R01-CVETRAN5      TO WKS-R-ATL-CVETRAN           399400      
006621        MOVE A00-R01-IMPORTE5      TO WKS-R-ATL-IMPORTE           399500      
006622        ADD  A00-R01-IMPORTE5      TO WKS-TR-ATLAS-TOTIMP         399600      
006623        WRITE A01-REG-ATLAS FROM WKS-REG-ATLAS                    399700      
006624        ADD  1                     TO WKS-TR-ATLAS-NUREG.         399800      
006625                                                                  399805      
006626 20075-GRAB-ARCH-AM.                                              399810      
006627*=====================                                            399815      
006628     IF WKS-AM-SW  = 0                                            399817      
006629        MOVE "HR"                  TO WKS-HDAM-TIP-REG            399820      
006630        MOVE "S151"                TO WKS-HDAM-SISTEMA            399822      
006631        MOVE WKS-FECHA-PROCESO     TO WKS-FECHA-CONT-R            399824      
006632        PERFORM                       20080-CAM-FECHA             399826      
006633        MOVE WKS-DEAM-FECHA        TO WKS-HDAM-FECHA-PROC         399827      
006634        WRITE REG-ACT-FIJO       FROM WKS-HEADER-AM.              399829      
006635     IF WKS-AM-SW  = 1                                            399830      
006636        MOVE "DE"                  TO WKS-DEAM-TIP-REG            399833      
006637        MOVE A00-R01-CONTRATO      TO WKS-DEAM-CONTRATO           399835      
006638        MOVE A01-R01-FOLIO-AM      TO WKS-DEAM-FOLIO              399840      
006639        MOVE A01-R01-LINEA-AM      TO WKS-DEAM-LINEA              399845      
006640        MOVE A01-R01-CANTIDAD-AM   TO WKS-DEAM-CANTIDAD           399850      
006641        MOVE A01-R01-NUMBIEN-AM    TO WKS-DEAM-ID-BIEN            399855      
006642        MOVE A01-R01-TIPBIEN-AM    TO WKS-DEAM-TIP-BIEN           399860      
006643        MOVE A01-R01-PROPIET-AM    TO WKS-DEAM-PROPIETA           399865      
006644        MOVE RMC-CVETRAN           TO WKS-DEAM-CVEMOV             399867      
006645        MOVE RMC-TM                TO WKS-DEAM-TIPMOV             399869      
006646        MOVE RMC-IMPORTE           TO WKS-DEAM-IMPORTE            399870      
006647        MOVE A00-R01-FECCONT       TO WKS-FECHA-CONT-R            399871      
006648        PERFORM                       20080-CAM-FECHA             399872      
006649        MOVE A00-R01-PRODUCTO      TO WKS-DEAM-PRODUCTO           399875      
006650        MOVE A00-R01-SUCPROM       TO WKS-DEAM-DEP                399876      
006651        MOVE A01-R01-VALVTA-AM     TO WKS-DEAM-VALVTA             399880      
006652        WRITE REG-ACT-FIJO  FROM   WKS-DETALLE-AM                 399881      
006653        ADD  1                     TO WKS-AM-SUM-REGS             399882      
006654        ADD RMC-IMPORTE            TO WKS-AM-SUM-IMP.             399883      
006655     IF WKS-AM-SW  = 2                                            399884      
006656        MOVE "TR"                  TO WKS-TRAM-TIP-REG            399885      
006657        MOVE WKS-AM-SUM-REGS       TO WKS-TRAM-TOT-REG            399890      
006658        MOVE WKS-AM-SUM-IMP        TO WKS-TRAM-TOT-IMP            399895      
006659        WRITE REG-ACT-FIJO       FROM WKS-TRAILER-AM.             399900      
006660 20080-CAM-FECHA.                                                 399910      
006661*===============                                                  399920      
006662                                                                  399930      
006663        MOVE WKS-FECHA-CONT-AA     TO WKS-FECCO10-AA              399940      
006664        MOVE WKS-FECHA-CONT-MM     TO WKS-FECCO10-MM              399950      
006665        MOVE WKS-FECHA-CONT-DD     TO WKS-FECCO10-DD              399960      
006666        MOVE WKS-FECCO-10          TO WKS-DEAM-FECHA.             399970      
006667                                                                  399980      
006668 21100-GRABA-ARCHIVOS.                                            400000      
006669*=====================                                            400100      
006670     MOVE A00-R01-CVETRAN(W77-INDCVE)     TO RMC-CVETRAN          400200      
006671*    DISPLAY "CVE TRA " A00-R01-CVETRAN(W77-INDCVE)               400250      
006672     MOVE A00-R01-TM(W77-INDCVE)          TO RMC-TM               400300      
006673*    DISPLAY "TM " A00-R01-TM(W77-INDCVE)                         400350      
006674     MOVE A00-R01-IMPORTE(W77-INDCVE)     TO RMC-IMPORTE          400400      
006675*    DISPLAY "IMP " A00-R01-IMPORTE(W77-INDCVE)                   400450      
006676     MOVE A00-R01-FECCONT                 TO RMC-FECHA            400500      
006677     MOVE A00-R01-SUC-INIC                TO RMC-SUC-INIC         400600      
006678     MOVE A00-R01-IND-CONTA               TO RMC-LIBRO            400700      
006679     MOVE A00-R01-SUCPROM                 TO RMC-SUC-PROM         400800      
006680     MOVE A00-R01-TIPOCREDITO             TO RMC-TIPOCRED         400900      
006681     MOVE A00-R01-TIPOCON                 TO RMC-TIPOCON          401000      
006682     PERFORM 21125-VALIDA-INFORMACION.                            401100      
006683     IF A00-R01-STATUS = 1 OR 2                                   401200      
006684      IF WKS-PT-INDBITA(RMC-CVETRAN,RMC-TM) = 2                   401300      
006685        MOVE RMC-TIPOCRED           TO  RM-TIPO-CRED              401400      
006686        MOVE A00-R01-FONDO          TO  RM-FONDO                  401500      
006687        MOVE RMC-SUC-PROM           TO  RM-SUC-PROM               401600      
006688        MOVE A00-R01-CONTRATO       TO  RM-CONTRATO               401700      
006689        MOVE A00-R01-HORMOV         TO  RM-HORA                   401800      
006690        MOVE A00-R01-FECMOV         TO  RM-FECHA-REAL             401900      
006691        MOVE A00-R01-FECVAL         TO  RM-FECHA-VALOR            402000      
006692        MOVE A00-R01-AUTORIZA       TO  RM-AUT-APLIC              402100      
006693        MOVE A00-R01-AUT3ER         TO  RM-AUT-3NIVEL             402200      
006694        MOVE A00-R01-AUT-S151       TO  RM-AUT-S151               402300      
006695        MOVE A00-R01-REFNUM         TO  RM-REFERENCIA             402400      
006696        MOVE RMC-SUC-INIC           TO  RM-SUC-INIC               402500      
006697        MOVE A00-R01-CAJA-INIC      TO  RM-CAJA-INIC              402600      
006698        MOVE A00-R01-NOMINA-OPE     TO  RM-NOMINA-OPER            402700      
006699        MOVE A00-R01-ORIGEN         TO  RM-ORIGEN                 402800      
006700        MOVE A00-R01-MONEDA         TO  RM-MONEDA                 402900      
006701        MOVE A00-R01-CVEMDA         TO  RM-CVE-MDA                403000      
006702        MOVE A00-R01-MDA-SUC        TO  RM-MDA-SUC                403100      
006703        MOVE A00-R01-MDA-CTA        TO  RM-MDA-CTA                403200      
006704        MOVE A00-R01-STATUS         TO  RM-ESTATUS                403300      
006705        MOVE A00-R01-TIPO-PROC      TO  RM-TIPO-PROC              403400      
006706        MOVE RMC-LIBRO              TO  RM-LIBRO                  403500      
006707        MOVE A00-R01-TIPOCREALFA    TO  RM-TC-ALFA                403600      
006708        PERFORM 21110-GRABA-MOV-BITACORA.                         403700      
006709                                                                  403800      
006710     IF A00-R01-STATUS = 1                                        403900      
006711        MOVE A00-R01-TIPO-PROC            TO W77-NPROCESO         404000      
006712        IF  W88-NPROCESO                                          404100      
006713            MOVE A00-R01-TIPO-PROC        TO RMC-NPROCESO         404200      
006714        ELSE                                                      404300      
006715            MOVE 1                        TO RMC-NPROCESO.        404400      
006716                                                                  404500      
006717     IF A00-R01-STATUS = 1                                        404600      
006718        MOVE A00-R01-MONEDA               TO RMC-MONEDA           404700      
006719        MOVE A00-R01-FONDO                TO RMC-FONDO            404800      
006720        MOVE WKS-PT-EVENTO(RMC-CVETRAN,RMC-TM) TO RMC-EVENTO      404900      
006721        IF A00-R01-SISTEMA = 402                                  405000      
006722           MOVE A00-R01-FIDEICO402        TO RMC-FID              405100      
006723           WRITE REG-CVETRAN                                      405200      
006724        ELSE                                                      405300      
006725           MOVE A00-R01-FIDEICO           TO RMC-FID              405400      
006726           WRITE REG-CVETRAN.                                     405500      
006727                                                                  405600      
006728     IF A00-R01-STATUS = 1                                        405700      
006729*       PERFORM 21150-GRABA-MOVSCIG                               405900      
006730        PERFORM 21155-GRABA-PUNTEO.                               406000      
006731*                                                                 406100      
006732*    IF W77-SISTEMA-PARAM = 252                                   406200      
006733*       IF A00-R01-STATUS = 1                                     406300      
006734*          PERFORM 21170-GRABA-MERCATOR-S252.                     406400      
006735                                                                  406405      
006736*+     DISPLAY RMC-CVETRAN" "RMC-TM" "RMC-IMPORTE                 406407      
006737     IF W77-SISTEMA-PARAM = 600                                   406410      
006738        IF  A00-R01-STATUS = 1                                    406420      
006739            IF WKS-PT-INDS254 (RMC-CVETRAN, RMC-TM) = 1  AND      406430      
006740               WKS-PT-INDAM   (RMC-CVETRAN, RMC-TM) = 2           406440      
006741               MOVE   1                       TO  WKS-AM-SW       406450      
006742               PERFORM  20075-GRAB-ARCH-AM.                       406460      
006743                                                                  406500      
006744 21110-GRABA-MOV-BITACORA.                                        406600      
006745*========================                                         406700      
006746     MOVE ZEROS TO  WKS-BAN-SUCINI                                406800      
006747     IF RM-SUC-INIC = 0                                           406900      
006748        MOVE 1 TO WKS-BAN-SUCINI                                  407000      
006749     ELSE                                                         407100      
006750        IF WKS-SUC-NODO-IMP(RM-SUC-INIC) > 0                      407200      
006751           MOVE WKS-SUC-NODO-IMP(RM-SUC-INIC) TO RM-NODO-IMP      407300      
006752        ELSE                                                      407400      
006753           COMPUTE RM-NODO-IMP = W77-CSI-PROCESO * 100.           407500      
006754                                                                  407600      
006755     IF WKS-BAN-SUCINI = 0                                        407700      
006756        MOVE RMC-CVETRAN                     TO RM-CVE-TRANS      407800      
006757        MOVE RMC-TM                          TO RM-TM             407900      
006758        MOVE RMC-IMPORTE                     TO RM-IMPORTE        408000      
006759        MOVE WKS-PT-NATS028(RM-CVE-TRANS,RMC-TM) TO RM-NATS28     408100      
006760        WRITE REG-MOVIMIENTOS.                                    408200      
006761                                                                  408300      
006762 21125-VALIDA-INFORMACION.                                        408400      
006763*=========================                                        408500      
006764     MOVE 0 TO W77-DESVIOA,W77-DESVIOB,W77-DESVIOC,W77-DESVIOD,   408600      
006765               W77-DESVIOE,W77-DESVIOF,W77-DESVIOG.               408700      
006766     MOVE SPACES TO WKS-ERRORA,WKS-ERRORB,WKS-ERRORC,             408800      
006767              WKS-ERRORD,WKS-ERRORE,WKS-ERRORF                    408900      
006768              WKS-ERRORG.                                         409000      
006769     MOVE 0 TO DES-DEFFECHAD,DES-DEFSUCIND,DES-DEFSUCPD,          409100      
006770               DES-DEFCVED,DES-DEFTCD,DES-DEFLIBD,                409200      
006771               DES-DEFTMD,DES-AUT-APLIC,DES-CONTRATO,             409300      
006772               DES-FOLIO,DES-LIBRO,DES-MONEDA,DES-TIPOCRED,       409400      
006773               DES-EVENTO,DES-SUC-PROM,DES-SUC-TRAN,DES-AUT-S151, 409500      
006774               DES-CVETRAN,DES-TM,DES-IMPORTE,                    409600      
006775               WLI-DES-DEFFECHAD,WLI-DES-DEFSUCIND,               409700      
006776               WLI-DES-DEFSUCPD, WLI-DES-DEFCVED,                 409800      
006777               WLI-DES-DEFTCD, WLI-DES-DEFLIBDZZ,                 409900      
006778               WLI-DES-DEFTMD,WLI-DES-AUT-APLIC,WLI-DES-CONTRATO, 410000      
006779               WLI-DES-FOLIO,WLI-DES-LIBRO,WLI-DES-MONEDA,        410100      
006780               WLI-DES-TIPOCRED,WLI-DES-EVENTO,WLI-DES-SUC-PROM,  410200      
006781               WLI-DES-SUC-TRAN,WLI-DES-AUT-S151,WLI-DES-CVETRAN, 410300      
006782               WLI-DES-TM,WLI-DES-IMPORTE,WLI-DES-FECCONT.        410400      
006783                                                                  410500      
006784     MOVE RMC-CVETRAN     TO      WLI-DES-CVETRAN, DES-CVETRAN.   410600      
006785     MOVE RMC-TM          TO      WLI-DES-TM, DES-TM.             410700      
006786                                                                  410800      
006787** VALIDA CLAVE Y TM OK                                           410900      
006788     IF RMC-CVETRAN = WKS-CVETRA-DESVIO                           411000      
006789        MOVE WKS-CVETRA-DESVIO TO RMC-CVETRAN,                    411100      
006790                                 ,DES-DEFCVED, WLI-DES-DEFCVED    411200      
006791        MOVE 1 TO W77-DESVIOD                                     411300      
006792        IF RMC-TM  = 1 OR 2                                       411400      
006793           NEXT SENTENCE                                          411500      
006794        ELSE                                                      411600      
006795           MOVE WKS-TM-DESVIO TO RMC-TM,DES-DEFTMD,WLI-DES-DEFTMD 411700      
006796           MOVE 1 TO W77-DESVIOG                                  411800      
006797     ELSE                                                         411900      
006798     IF RMC-CVETRAN < 1 OR RMC-CVETRAN > 10000                    412000      
006799        MOVE WKS-CVETRA-DESVIO TO RMC-CVETRAN,                    412100      
006800                                 ,DES-DEFCVED, WLI-DES-DEFCVED    412200      
006801        MOVE 1    TO W77-DESVIOD                                  412300      
006802        IF RMC-TM  = 1 OR 2                                       412400      
006803           NEXT SENTENCE                                          412500      
006804        ELSE                                                      412600      
006805           MOVE WKS-TM-DESVIO TO RMC-TM,DES-DEFTMD,WLI-DES-DEFTMD 412700      
006806           MOVE 1 TO W77-DESVIOG                                  412800      
006807     ELSE                                                         412900      
006808        IF RMC-TM  = 1 OR 2                                       413000      
006809           IF WKS-PT-EXISTE(RMC-CVETRAN,RMC-TM)= 1                413100      
006810              NEXT SENTENCE                                       413200      
006811           ELSE                                                   413300      
006812              MOVE WKS-CVETRA-DESVIO TO RMC-CVETRAN,              413400      
006813                   DES-DEFCVED, WLI-DES-DEFCVED                   413500      
006814              MOVE 1 TO W77-DESVIOD                               413600      
006815        ELSE                                                      413700      
006816           MOVE WKS-TM-DESVIO TO RMC-TM,DES-DEFTMD,WLI-DES-DEFTMD 413800      
006817           MOVE 1    TO W77-DESVIOG                               413900      
006818           IF WKS-PT-EXISTE(RMC-CVETRAN,WKS-TM-DESVIO)= 1         414000      
006819              NEXT SENTENCE                                       414100      
006820           ELSE                                                   414200      
006821              MOVE RMC-CVETRAN TO DES-CVETRAN                     414300      
006822              MOVE WKS-CVETRA-DESVIO TO RMC-CVETRAN,DES-DEFCVED,  414400      
006823                                        WLI-DES-DEFCVED           414500      
006824              MOVE 1 TO W77-DESVIOD.                              414600      
006825                                                                  414700      
006826** VALIDA QUE LA FECHA CONTABLE ESTE OK                           414800      
006827     MOVE A00-R01-FECCONT      TO WLI-DES-FECCONT                 414900      
006828     IF A00-R01-FECCONT = WKS-FECHA-PROCESO                       415000      
006829        IF A00-R01-FECVAL > 0                                     415100      
006830           MOVE A00-R01-FECVAL    TO RMC-FECHA                    415200      
006831        ELSE                                                      415300      
006832           MOVE A00-R01-FECCONT   TO RMC-FECHA                    415400      
006833     ELSE                                                         415500      
006834        MOVE WKS-FECHA-PROCESO    TO RMC-FECHA                    415600      
006835        MOVE 1    TO W77-DESVIOA.                                 415700      
006836                                                                  415800      
006837                                                                  415900      
006838** VALIDA QUE LA SUCURSAL DE LA INICIATIVA ESTE OK                416000      
006839     IF WKS-PT-NATS028(RMC-CVETRAN,RMC-TM) = 1 OR 2               416100      
006840        IF (A00-R01-SUC-INIC > 0 AND < 1000) OR                   416200      
006841           (A00-R01-SUC-INIC > 3999 AND < 4900) OR                416300      
006842           (W77-SISTEMA-PARAM = 252)                              416400      
006843              NEXT SENTENCE                                       416500      
006844        ELSE                                                      416600      
006845           IF W77-SISTEMA-PARAM = 402 AND                         416700      
006846             (A00-R01-SUC-INIC > 0)                               416800      
006847              IF WKS-C209-EXISTE(A00-R01-SUC-INIC) = 1            416900      
006848                 NEXT SENTENCE                                    417000      
006849              ELSE                                                417100      
006850                 MOVE 1 TO W77-DESVIOB                            417200      
006851           ELSE                                                   417300      
006852              MOVE 1 TO W77-DESVIOB.                              417400      
006853     MOVE WKS-PT-NATS028(RMC-CVETRAN,RMC-TM) TO WLI-DES-AFEC028.  417500      
006854                                                                  417600      
006855** VALIDA QUE EL LIBRO ESTE CATALOGADO                            417700      
006856     IF W88-SIST-CRED OR W88-SIST-CENTRAL OR W88-SIST-CS          417800      
006857        COMPUTE W77-INDLIB = A00-R01-IND-CONTA + 1                417900      
006858        IF W77-INDLIB < 60                                        418000      
006859           IF WKS-LIBRO(W77-INDLIB) = A00-R01-IND-CONTA           418100      
006860              NEXT SENTENCE                                       418200      
006861           ELSE                                                   418300      
006862              MOVE WKS-LIBRO-DESVIO TO RMC-LIBRO,DES-DEFLIBD,     418400      
006863                                    WLI-DES-DEFLIBDZ9,W77-INDLIB  418500      
006864              MOVE 1 TO      W77-DESVIOF                          418600      
006865        ELSE                                                      418700      
006866           MOVE WKS-LIBRO-DESVIO TO RMC-LIBRO,DES-DEFLIBD,        418800      
006867                                    WLI-DES-DEFLIBDZ9,W77-INDLIB  418900      
006868           MOVE 1   TO W77-DESVIOF.                               419000      
006869                                                                  419100      
006870** VALIDA QUE LA SUC. PROM. ESTE OK Y MUEVE EL CENTRALIZADOR      419200      
006871** CONTABLE (PARA LOS SISTEMAS DE CREDITO)                        419300      
006872*    IF W88-SIST-CRED OR W88-SIST-CENTRAL                         419400      
006873     IF W88-SIST-CRED OR W88-SIST-CS                              419500      
006874        IF WKS-PT-INDS254(RMC-CVETRAN,RMC-TM) = 2                 419600      
006875           IF A00-R01-SUCPROM > 0                                 419700      
006876              IF W77-DESVIOF = 0                                  419800      
006877                 IF WKS-CENT-CONT(W77-INDLIB) > 0                 419900      
006878                    MOVE WKS-CENT-CONT(W77-INDLIB)                420000      
006879                                                TO RMC-SUC-PROM   420100      
006880                 ELSE                                             420200      
006881                    MOVE A00-R01-SUCPROM        TO RMC-SUC-PROM   420300      
006882              ELSE                                                420400      
006883                 MOVE A00-R01-SUCPROM           TO RMC-SUC-PROM   420500      
006884           ELSE                                                   420600      
006885              MOVE 1 TO W77-DESVIOC                               420700      
006886              IF W77-DESVIOF = 0                                  420800      
006887                 IF WKS-CENT-CONT(W77-INDLIB) > 0                 420900      
006888                    MOVE WKS-CENT-CONT(W77-INDLIB) TO RMC-SUC-PROM421000      
006889                 ELSE                                             421100      
006890                    MOVE 907                     TO RMC-SUC-PROM  421200      
006891              ELSE                                                421300      
006892                MOVE 907                         TO RMC-SUC-PROM  421400      
006893        ELSE                                                      421500      
006894            NEXT SENTENCE                                         421600      
006895     ELSE                                                         421700      
006896        IF A00-R01-SUCPROM > 0                                    421800      
006897           MOVE A00-R01-SUCPROM        TO RMC-SUC-PROM            421900      
006898        ELSE                                                      422000      
006899           MOVE 907                    TO RMC-SUC-PROM.           422100      
006900                                                                  422200      
006901* MUEVE EL EVENTO                                                 422300      
006902     MOVE WKS-PT-EVENTO(RMC-CVETRAN,RMC-TM) TO                    422400      
006903                                  DES-EVENTO,WLI-DES-EVENTO.      422500      
006904                                                                  422600      
006905** TIPO DE CREDITO CATALOGADO                                     422700      
006906     IF W88-SIST-CRED                                             422800      
006907        IF A00-R01-TIPOCREDITO = WKS-TC-DESVIO                    422900      
006908           MOVE WKS-TC-DESVIO TO RMC-TIPOCRED                     423000      
006909           MOVE 1 TO W77-DESVIOE                                  423100      
006910        ELSE                                                      423200      
006911           IF A00-R01-TIPOCREDITO > 0 AND < 100                   423300      
006912              IF WKS-NUM-TC(A00-R01-TIPOCREDITO) > 0              423400      
006913                 NEXT SENTENCE                                    423500      
006914              ELSE                                                423600      
006915                 MOVE WKS-TC-DESVIO TO RMC-TIPOCRED               423700      
006916                 MOVE 1 TO W77-DESVIOE                            423800      
006917           ELSE                                                   423900      
006918              MOVE WKS-TC-DESVIO TO RMC-TIPOCRED                  424000      
006919              MOVE 1 TO W77-DESVIOE.                              424100      
006920                                                                  424200      
006921     IF W88-DESVIOA OR W88-DESVIOB OR W88-DESVIOC OR              424300      
006922        W88-DESVIOD OR W88-DESVIOE OR W88-DESVIOF OR              424400      
006923        W88-DESVIOG                                               424500      
006924        PERFORM 21128-VALIDA-DESVIO.                              424600      
006925                                                                  424700      
006926 21128-VALIDA-DESVIO.                                             424800      
006927*====================                                             424900      
006928     MOVE 1 TO  W77-BAN-DESVIOS.                                  425000      
006929                                                                  425100      
006930     MOVE 5308000           TO      WKS-MSG-EVENTO.               425200      
006931     MOVE 3                 TO      WKS-MSG-TIPO.                 425300      
006932     MOVE "S151/P107"       TO      WKS-MSG-ORIGEN.               425400      
006933     MOVE WKS-S-C           TO      WKS-MSG-S.                    425500      
006934     MOVE W77-SISTEMA-PARAM TO      WKS-MSG-SIS.                  425600      
006935     MOVE "PROCESO"         TO      WKS-RSU-PROCESO.              425700      
006936     MOVE A00-R01-TIPO-PROC TO      WKS-RSU-NUMERO.               425800      
006937     MOVE " "               TO      WKS-ESPACIO1 WKS-ESPACIO2     425900      
006938                                    WKS-ESPACIO3 WKS-ESPACIO5     426000      
006939                                    WKS-ESPACIO6 WKS-RT2-ESPACIO. 426100      
006940     MOVE "/"               TO      WKS-ESPACIO4.                 426200      
006941     MOVE "["               TO      WKS-RT2-CORCHETE21.           426300      
006942     MOVE "]"               TO      WKS-RT2-CORCHETE22.           426400      
006943     MOVE "AUT-APLICACION." TO      WKS-RT2-TEXTAUTAPL.           426500      
006944     MOVE "AUT-S151."       TO      WKS-RT2-TEXTAUT151.           426600      
006945     MOVE A00-R01-AUTORIZA  TO      WKS-RT2-AUTAPL                426700      
006946     MOVE A00-R01-AUT-S151  TO      WKS-RT2-AUTS151               426800      
006947                                                                  426900      
006948     IF W88-DESVIOA                                               427000      
006949        MOVE "A"               TO WKS-ERRORA                      427100      
006950        MOVE A00-R01-FECCONT   TO WLI-DES-FECCONT                 427200      
006951        MOVE WKS-FECHA-PROCESO TO DES-DEFFECHAD,WLI-DES-DEFFECHAD 427300      
006952        IF WKS-BAN-DESVIOA = 0                                    427400      
006953           MOVE                                                   427500      
006954           "[ENVIO DE MOVIMIENTOS CON FECHA CONTABLE ERRONEA]"    427600      
006955                                 TO      WKS-MSG-TEXTO1           427700      
006956           MOVE "FECHA : "       TO      WKS-RT2-TEXTDATMAL       427800      
006957           MOVE A00-R01-FECCONT  TO      WKS-RT2-DATOMAL          427900      
006958           CALL "ESENDAUTO OF OUTBOARD" USING  W-MSG              428000      
006959*          DISPLAY W-MSG                                          428100      
006960           MOVE   1              TO WKS-BAN-DESVIOA               428200      
006961           CANCEL "OUTBOARD".                                     428300      
006962     IF W88-DESVIOB                                               428400      
006963        MOVE "B"               TO WKS-ERRORB                      428500      
006964        MOVE WKS-SUCINI-DESVIO TO DES-DEFSUCIND,WLI-DES-DEFSUCIND,428600      
006965                                  RMC-SUC-INIC                    428700      
006966        IF WKS-BAN-DESVIOB = 0                                    428800      
006967           MOVE                                                   428900      
006968           "[ENVIO DE MOVIMIENTOS, SUCURSAL INICIATIVA ERRONEA]"  429000      
006969                                 TO      WKS-MSG-TEXTO1           429100      
006970           MOVE "SUC.INIC: "     TO      WKS-RT2-TEXTDATMAL       429200      
006971           MOVE A00-R01-SUC-INIC TO      WKS-RT2-DATOMAL          429300      
006972           CALL "ESENDAUTO OF OUTBOARD" USING  W-MSG              429400      
006973*          DISPLAY W-MSG                                          429500      
006974           MOVE   1              TO WKS-BAN-DESVIOB               429600      
006975           CANCEL "OUTBOARD".                                     429700      
006976     IF W88-DESVIOC                                               429800      
006977        MOVE "C"                 TO WKS-ERRORC                    429900      
006978        MOVE RMC-SUC-PROM        TO DES-DEFSUCPD,WLI-DES-DEFSUCPD 430000      
006979        IF WKS-BAN-DESVIOC = 0                                    430100      
006980           MOVE                                                   430200      
006981           "[ENVIO DE MOVIMIENTOS, SUCURSAL PROMOTORA ERRONEA]"   430300      
006982                                 TO      WKS-MSG-TEXTO1           430400      
006983           MOVE "SUC.PROM: "     TO      WKS-RT2-TEXTDATMAL       430500      
006984           MOVE A00-R01-SUCPROM  TO      WKS-RT2-DATOMAL          430600      
006985           CALL "ESENDAUTO OF OUTBOARD" USING  W-MSG              430700      
006986*          DISPLAY W-MSG                                          430800      
006987           MOVE   1              TO WKS-BAN-DESVIOC               430900      
006988           CANCEL "OUTBOARD".                                     431000      
006989     IF W88-DESVIOD                                               431100      
006990        MOVE "D"                 TO WKS-ERRORD                    431200      
006991        IF WKS-BAN-DESVIOD = 0                                    431300      
006992           MOVE                                                   431400      
006993         "[ENVIO DE MOVIMIENTOS, CLAVE TRANSACCION NO CATALOGADA]"431500      
006994                                 TO      WKS-MSG-TEXTO1           431600      
006995           MOVE "CVETRAN: "      TO      WKS-RT2-TEXTDATMAL       431700      
006996           MOVE RMC-CVETRAN      TO      WKS-RT2-DATOMAL          431800      
006997           CALL "ESENDAUTO OF OUTBOARD" USING  W-MSG              431900      
006998*          DISPLAY W-MSG                                          432000      
006999           MOVE   1              TO WKS-BAN-DESVIOD               432100      
007000           CANCEL "OUTBOARD".                                     432200      
007001     IF W88-DESVIOE                                               432300      
007002        MOVE "E"                 TO WKS-ERRORE                    432400      
007003        MOVE WKS-TC-DESVIO       TO DES-DEFTCD,WLI-DES-DEFTCD     432500      
007004        IF WKS-BAN-DESVIOE = 0                                    432600      
007005           MOVE "[ENVIO DE MOVIMIENTOS, TIPO DE CREDITO ERRONEO]" 432700      
007006                                    TO     WKS-MSG-TEXTO1         432800      
007007           MOVE "TIPO CRED: "       TO     WKS-RT2-TEXTDATMAL     432900      
007008           MOVE A00-R01-TIPOCREDITO TO     WKS-RT2-DATOMAL        433000      
007009           CALL "ESENDAUTO OF OUTBOARD" USING  W-MSG              433100      
007010*          DISPLAY W-MSG                                          433200      
007011           MOVE   1              TO WKS-BAN-DESVIOE               433300      
007012           CANCEL "OUTBOARD".                                     433400      
007013     IF W88-DESVIOF                                               433500      
007014        MOVE "F"                 TO WKS-ERRORF                    433600      
007015        IF WKS-BAN-DESVIOF = 0                                    433700      
007016           MOVE "[ENVIO DE MOVIMIENTOS CON LIBRO NO CATALOGADO]"  433800      
007017                                  TO      WKS-MSG-TEXTO1          433900      
007018           MOVE "LIBRO :"         TO      WKS-RT2-TEXTDATMAL      434000      
007019           MOVE A00-R01-IND-CONTA TO      WKS-RT2-DATOMAL         434100      
007020           CALL "ESENDAUTO OF OUTBOARD" USING  W-MSG              434200      
007021*          DISPLAY W-MSG                                          434300      
007022           MOVE   1               TO WKS-BAN-DESVIOF              434400      
007023           CANCEL "OUTBOARD".                                     434500      
007024     IF W88-DESVIOG                                               434600      
007025        MOVE "G"                  TO WKS-ERRORG                   434700      
007026        IF WKS-BAN-DESVIOG = 0                                    434800      
007027           MOVE                                                   434900      
007028           "[ENVIO DE MOVIMIENTOS,TIPO DE MOVIMIENTO ERRONEO]"    435000      
007029                                  TO      WKS-MSG-TEXTO1          435100      
007030           MOVE "TIPO MOV: "      TO      WKS-RT2-TEXTDATMAL      435200      
007031           MOVE RMC-TM            TO      WKS-RT2-DATOMAL         435300      
007032           CALL "ESENDAUTO OF OUTBOARD" USING  W-MSG              435400      
007033*          DISPLAY W-MSG                                          435500      
007034           MOVE   1               TO WKS-BAN-DESVIOG              435600      
007035           CANCEL "OUTBOARD".                                     435700      
007036                                                                  435800      
007037     MOVE A00-R01-AUTORIZA        TO      DES-AUT-APLIC,          435900      
007038                                          WLI-DES-AUT-APLIC.      436000      
007039     MOVE A00-R01-CONTRATO        TO      DES-CONTRATO,           436100      
007040                                          WLI-DES-CONTRATO.       436200      
007041*    MOVE A00-R01-FOLIO-S403      TO      DES-FOLIO,              436300      
007042     MOVE A00-R01-REFNUM          TO      DES-FOLIO,              436400      
007043                                          WLI-DES-FOLIO.          436500      
007044     MOVE A00-R01-IND-CONTA       TO      DES-LIBRO,              436600      
007045                                          WLI-DES-LIBRO.          436700      
007046     MOVE A00-R01-MONEDA          TO      DES-MONEDA,             436800      
007047                                          WLI-DES-MONEDA.         436900      
007048     MOVE A00-R01-SUCPROM         TO      DES-SUC-PROM,           437000      
007049                                          WLI-DES-SUC-PROM.       437100      
007050     MOVE A00-R01-SUC-INIC        TO      DES-SUC-TRAN,           437200      
007051                                          WLI-DES-SUC-TRAN.       437300      
007052     MOVE A00-R01-AUT-S151        TO      DES-AUT-S151,           437400      
007053                                          WLI-DES-AUT-S151.       437500      
007054     MOVE RMC-IMPORTE             TO      DES-IMPORTE,            437600      
007055                                          WLI-DES-IMPORTE.        437700      
007056     MOVE WKS-ERROR-ALFA          TO      DES-TIPOERR,            437800      
007057                                          WLI-DES-TIPOERR.        437900      
007058     MOVE A00-R01-TIPOCREDITO     TO      DES-TIPOCRED,           438000      
007059                                          WLI-DES-TIPOCRED.       438100      
007060     WRITE REG-DESVIOS FROM WKS-DESVIOS.                          438200      
007061                                                                  438300      
007062     IF WKS-NUM-LINEAS > 54                                       438400      
007063        PERFORM 21130-ENCABEZADO.                                 438500      
007064                                                                  438600      
007065     WRITE REG-REPORTE FROM WLI-DESVIOS.                          438700      
007066     WRITE REG-REPORTE FROM WLI-DESVIOS-2.                        438800      
007067     MOVE SPACES TO REG-REPORTE.                                  438900      
007068     WRITE REG-REPORTE.                                           439000      
007069     ADD 3 TO WKS-NUM-LINEAS.                                     439100      
007070                                                                  439200      
007071 21130-ENCABEZADO.                                                439300      
007072*=================                                                439400      
007073     ADD 1 TO WKS-NUM-HOJAS.                                      439500      
007074     MOVE WKS-NUM-HOJAS    TO      WSR-RB-E3-HOJA                 439600      
007075     WRITE REG-REPORTE    FROM    WSR-ENCAB-1     AFTER PAGE.     439700      
007076     WRITE REG-REPORTE    FROM    WSR-ENCAB-2                     439800      
007077     WRITE REG-REPORTE    FROM    WSR-ENCAB-3                     439900      
007078     MOVE SPACES TO REG-REPORTE.                                  440000      
007079     WRITE REG-REPORTE                                            440100      
007080     IF W88-SIST-CRED                                             440200      
007081        WRITE REG-REPORTE    FROM    WLI-TIT1-DESVIOS             440300      
007082        WRITE REG-REPORTE    FROM    WLI-TIT2-DESVIOS             440400      
007083     ELSE                                                         440500      
007084        WRITE REG-REPORTE    FROM    WLI-TIT1-DESVIOS-NCRED       440600      
007085        WRITE REG-REPORTE    FROM    WLI-TIT2-DESVIOS-NCRED.      440700      
007086     MOVE SPACES TO REG-REPORTE.                                  440800      
007087     WRITE REG-REPORTE.                                           440900      
007088     MOVE 7       TO WKS-NUM-LINEAS.                              441000      
007089                                                                  441100      
007090 21145-GRABA-MOVSXSUC.                                            441200      
007091*====================                                             441300      
007092                                                                  444200      
007093 21150-GRABA-MOVSCIG.                                             444300      
007094*====================                                             444400      
007095      PERFORM  30000-LIMPIA-BIT.                                  444500      
007096                                                                  444600      
007097      IF A00-R01-CVETRAN1 > 0 AND ( A00-R01-ESQCON1 = 1 OR 2)     444700      
007098         MOVE WKS-PT-INDS254(A00-R01-CVETRAN1,A00-R01-ESQCON1)    444800      
007099                                   TO A00-BIT-INDALFA (1)    .    444900      
007100      IF A00-R01-CVETRAN2 > 0 AND ( A00-R01-ESQCON2 = 1 OR 2)     445000      
007101         MOVE WKS-PT-INDS254(A00-R01-CVETRAN2,A00-R01-ESQCON2)    445100      
007102                                   TO A00-BIT-INDALFA (2)    .    445200      
007103      IF A00-R01-CVETRAN3 > 0 AND ( A00-R01-ESQCON3 = 1 OR 2)     445300      
007104         MOVE WKS-PT-INDS254(A00-R01-CVETRAN3,A00-R01-ESQCON3)    445400      
007105                                   TO A00-BIT-INDALFA (3)    .    445500      
007106      IF A00-R01-CVETRAN4 > 0 AND ( A00-R01-ESQCON4 = 1 OR 2)     445600      
007107         MOVE WKS-PT-INDS254(A00-R01-CVETRAN4,A00-R01-ESQCON4)    445700      
007108                                   TO A00-BIT-INDALFA (4)    .    445800      
007109      IF A00-R01-CVETRAN5 > 0 AND ( A00-R01-ESQCON5 = 1 OR 2)     445900      
007110         MOVE WKS-PT-INDS254(A00-R01-CVETRAN5,A00-R01-ESQCON5)    446000      
007111                                   TO A00-BIT-INDALFA (5)    .    446100      
007112      PERFORM  30100-GRABA-BIT .                                  446200      
007113                                                                  446300      
007114      MOVE ZERO                    TO W77-BIT-SALIDA.             446400      
007115      PERFORM 30190-CUENTA-CVES VARYING W77-IND FROM 1 BY 1       446500      
007116                                UNTIL   W77-IND > 5 OR            446600      
007117                                        W77-BIT-SALIDA = 1.       446700      
007118                                                                  446800      
007119*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
007120* COPY "CITIDIRECT/S151/COPY/GRABABIT ON CMEMP.".                 446900      
007121 30000-LIMPIA-BIT.                                                000100      
007122*=================                                                000200      
007123    MOVE SPACES                     TO A00-BIT-REGMOV.            000300      
007124    MOVE ZERO                       TO A00-BIT-FUNCION            000400      
007125                                       A00-BIT-SISTEMA            000500      
007126                                       A00-BIT-PRODUCTO           000600      
007127                                       A00-BIT-INSTRUMENTO        000700      
007128                                       A00-BIT-SUCPROM            000800      
007129                                       A00-BIT-CONTRATO           000900      
007130                                       A00-BIT-CVETRAN (1)        001000      
007131                                       A00-BIT-INDALFA (1)        001100      
007132                                       A00-BIT-INDLEY  (1)        001200      
007133                                       A00-BIT-ESQCON  (1)        001300      
007134                                       A00-BIT-IMPORTE (1)        001400      
007135                                       A00-BIT-CVETRAN (2)        001500      
007136                                       A00-BIT-INDALFA (2)        001600      
007137                                       A00-BIT-INDLEY  (2)        001700      
007138                                       A00-BIT-ESQCON  (2)        001800      
007139                                       A00-BIT-IMPORTE (2)        001900      
007140                                       A00-BIT-CVETRAN (3)        002000      
007141                                       A00-BIT-INDALFA (3)        002100      
007142                                       A00-BIT-INDLEY  (3)        002200      
007143                                       A00-BIT-ESQCON  (3)        002300      
007144                                       A00-BIT-IMPORTE (3)        002400      
007145                                       A00-BIT-CVETRAN (4)        002500      
007146                                       A00-BIT-INDALFA (4)        002600      
007147                                       A00-BIT-INDLEY  (4)        002700      
007148                                       A00-BIT-ESQCON  (4)        002800      
007149                                       A00-BIT-IMPORTE (4)        002900      
007150                                       A00-BIT-CVETRAN (5)        003000      
007151                                       A00-BIT-INDALFA (5)        003100      
007152                                       A00-BIT-INDLEY  (5)        003200      
007153                                       A00-BIT-ESQCON  (5)        003300      
007154                                       A00-BIT-IMPORTE (5)        003400      
007155                                       A00-BIT-IND-EFEC           003450      
007156                                       A00-BIT-FECMOV             003500      
007157                                       A00-BIT-HORMOV             003600      
007158                                       A00-BIT-FECCONT            003700      
007159                                       A00-BIT-FECVAL             003800      
007160                                       A00-BIT-AUTORIZA           003900      
007161                                       A00-BIT-AUT3ER             004000      
007162                                       A00-BIT-REFNUM             004100      
007163                                       A00-BIT-CVEMDA             004200      
007164                                       A00-BIT-NUMMDA             004300      
007165                                       A00-BIT-MDA-SUC            004400      
007166                                       A00-BIT-MDA-CTA            004500      
007167                                       A00-BIT-CVEMDE             004600      
007168                                       A00-BIT-SUC-INIC           004700      
007169                                       A00-BIT-CAJA-INIC          004800      
007170                                       A00-BIT-SUCOPER            004900      
007171                                       A00-BIT-CAJAOPER           005000      
007172                                       A00-BIT-SUCTRAN            005100      
007173                                       A00-BIT-CAJATRAN           005200      
007174                                       A00-BIT-NOMINA-OPE         005300      
007175                                       A00-BIT-ORIGEN             005400      
007176                                       A00-BIT-MONEDA             005500      
007177                                       A00-BIT-AUT-S151           005600      
007178                                       A00-BIT-AUTELI-S151        005700      
007179                                       A00-BIT-AUTELI-ANT-S151    005800      
007180                                       A00-BIT-TIPO-PROC          005900      
007181                                       A00-BIT-SOBREGIRO          006000      
007182                                       A00-BIT-CVEAVISO           006100      
007183                                       A00-BIT-IND-EDOCTA         006200      
007184                                       A00-BIT-IND-DATOS-ADIC     006300      
007185                                       A00-BIT-FECUM-NDIAS        006400      
007186                                       A00-BIT-SECTOR             006500      
007187                                       A00-BIT-BANCA              006600      
007188                                       WKS-DATAGRUP1-PROD-TPROD   006700      
007189                                       WKS-DATAGRUP2-INST-TCRED   006800      
007190                                       WKS-SIRH-DEPTO             006900      
007191                                       WKS-LIBRO-CONTABLE         007000      
007192                                       WKS-CVE-DESVIO (1)         007100      
007193                                       WKS-GUIA-DESVIO(1)         007200      
007194                                       WKS-CVE-DESVIO (2)         007300      
007195                                       WKS-GUIA-DESVIO(2)         007400      
007196                                       WKS-CVE-DESVIO (3)         007500      
007197                                       WKS-GUIA-DESVIO(3)         007600      
007198                                       WKS-CVE-DESVIO (4)         007700      
007199                                       WKS-GUIA-DESVIO(4)         007800      
007200                                       WKS-CVE-DESVIO (5)         007900      
007201                                       WKS-GUIA-DESVIO(5)         008000      
007202                                       A00-BIT-NODO-ORIG          008100      
007203                                       A00-BIT-STATUS             008200      
007204                                       A00-BIT-NOMINA-FUN1        008300      
007205                                       A00-BIT-NOMINA-FUN2        008400      
007206                                       A00-BIT-SIST-ORIG          008500      
007207                                       A00-BIT-PROD-ORIG          008600      
007208                                       A00-BIT-INST-ORIG          008700      
007209                                       A00-BIT-SALDO.             008800      
007210     MOVE SPACES                     TO A00-BIT-FIL-FUTURO        008900      
007211                                        A00-BIT-CVECON-YREFLOC    009000      
007212                                        A00-BIT-FILXAPL           009100      
007213                                        A00-BIT-LEYENDA           009200      
007214                                        A00-BIT-INF-CBII          009300      
007215                                        A00-BIT-SIN-USO.          009400      
007216 30190-CUENTA-CVES.                                               009500      
007217*==================                                               009600      
007218    IF A00-BIT-FUNCION = 1                                        009700      
007219       IF A00-BIT-CVETRAN(W77-IND) = 0 AND                        009800      
007220          A00-BIT-IMPORTE(W77-IND) = 0                            009900      
007221          IF W77-IND = 1                                          010000      
007222             ADD 1                  TO WKS-TR-TOT-CVES            010100      
007223          ELSE                                                    010200      
007224             MOVE 1                 TO W77-BIT-SALIDA             010300      
007225       ELSE                                                       010400      
007226          ADD 1                     TO WKS-TR-TOT-CVES            010500      
007227    ELSE                                                          010600      
007228       MOVE 1                       TO W77-BIT-SALIDA             010700      
007229       ADD 1                        TO WKS-TR-TOT-CVES.           010800      
007230                                                                  010900      
007231 30100-GRABA-BIT.                                                 011000      
007232*================                                                 011100      
007233    MOVE "5"                        TO A00-BIT-TIPO-REG       .   011200      
007234    MOVE A00-R01-FUNCION            TO A00-BIT-FUNCION        .   011300      
007235    MOVE A00-R01-SISTEMA            TO A00-BIT-SISTEMA        .   011400      
007236    MOVE A00-R01-PRODUCTO           TO A00-BIT-PRODUCTO       .   011500      
007237    MOVE A00-R01-INSTRUMENTO        TO A00-BIT-INSTRUMENTO    .   011600      
007238    MOVE A00-R01-SUCPROM            TO A00-BIT-SUCPROM        .   011700      
007239    MOVE A00-R01-CONTRATO           TO A00-BIT-CONTRATO       .   011800      
007240    MOVE A00-R01-CVETRAN1           TO A00-BIT-CVETRAN (1)    .   011900      
007241    MOVE A00-R01-INDLEY1            TO A00-BIT-INDLEY  (1)    .   012000      
007242    MOVE A00-R01-ESQCON1            TO A00-BIT-ESQCON  (1)    .   012100      
007243    MOVE A00-R01-IMPORTE1           TO A00-BIT-IMPORTE (1)    .   012200      
007244    ADD  A00-R01-IMPORTE1           TO WKS-TR-TOT-IMP         .   012300      
007245    MOVE A00-R01-CVETRAN2           TO A00-BIT-CVETRAN (2)    .   012400      
007246    MOVE A00-R01-INDLEY2            TO A00-BIT-INDLEY  (2)    .   012500      
007247    MOVE A00-R01-ESQCON2            TO A00-BIT-ESQCON  (2)    .   012600      
007248    MOVE A00-R01-IMPORTE2           TO A00-BIT-IMPORTE (2)    .   012700      
007249    ADD  A00-R01-IMPORTE2           TO WKS-TR-TOT-IMP         .   012800      
007250    MOVE A00-R01-CVETRAN3           TO A00-BIT-CVETRAN (3)    .   012900      
007251    MOVE A00-R01-INDLEY3            TO A00-BIT-INDLEY  (3)    .   013000      
007252    MOVE A00-R01-ESQCON3            TO A00-BIT-ESQCON  (3)    .   013100      
007253    MOVE A00-R01-IMPORTE3           TO A00-BIT-IMPORTE (3)    .   013200      
007254    ADD  A00-R01-IMPORTE3           TO WKS-TR-TOT-IMP         .   013300      
007255    MOVE A00-R01-CVETRAN4           TO A00-BIT-CVETRAN (4)    .   013400      
007256    MOVE A00-R01-INDLEY4            TO A00-BIT-INDLEY  (4)    .   013500      
007257    MOVE A00-R01-ESQCON4            TO A00-BIT-ESQCON  (4)    .   013600      
007258    MOVE A00-R01-IMPORTE4           TO A00-BIT-IMPORTE (4)    .   013700      
007259    ADD  A00-R01-IMPORTE4           TO WKS-TR-TOT-IMP         .   013800      
007260    MOVE A00-R01-CVETRAN5           TO A00-BIT-CVETRAN (5)    .   013900      
007261    MOVE A00-R01-INDLEY5            TO A00-BIT-INDLEY  (5)    .   014000      
007262    MOVE A00-R01-ESQCON5            TO A00-BIT-ESQCON  (5)    .   014100      
007263    MOVE A00-R01-IMPORTE5           TO A00-BIT-IMPORTE (5)    .   014200      
007264    ADD  A00-R01-IMPORTE5           TO WKS-TR-TOT-IMP         .   014300      
007265    MOVE A00-R01-FECMOV             TO A00-BIT-FECMOV         .   014400      
007266    MOVE A00-R01-HORMOV             TO A00-BIT-HORMOV         .   014500      
007267    MOVE A00-R01-FECCONT            TO A00-BIT-FECCONT        .   014600      
007268                                                                  014700      
007269    MOVE A00-R01-FECVAL             TO A00-BIT-FECVAL         .   015000      
007270    MOVE A00-R01-AUTORIZA           TO A00-BIT-AUTORIZA       .   015100      
007271    MOVE A00-R01-AUT3ER             TO A00-BIT-AUT3ER         .   015200      
007272    MOVE A00-R01-REFNUM             TO A00-BIT-REFNUM         .   015300      
007273    MOVE A00-R01-MDA-SUC            TO A00-BIT-MDA-SUC        .   015400      
007274    MOVE A00-R01-MDA-CTA            TO A00-BIT-MDA-CTA        .   015500      
007275    MOVE A00-R01-CVEMDA             TO A00-BIT-CVEMDA         .   015550      
007276    MOVE A00-R01-IND-EFEC           TO A00-BIT-IND-EFEC       .   015600      
007277    MOVE A00-R01-CVEMDE             TO A00-BIT-CVEMDE         .   015700      
007278    MOVE A00-R01-SUC-INIC           TO A00-BIT-SUC-INIC       .   015800      
007279    MOVE A00-R01-CAJA-INIC          TO A00-BIT-CAJA-INIC      .   015900      
007280    MOVE A00-R01-SUCOPER            TO A00-BIT-SUCOPER        .   016000      
007281    MOVE A00-R01-CAJAOPER           TO A00-BIT-CAJAOPER       .   016100      
007282    MOVE A00-R01-SUCTRAN            TO A00-BIT-SUCTRAN        .   016200      
007283    MOVE A00-R01-CAJATRAN           TO A00-BIT-CAJATRAN       .   016300      
007284    MOVE A00-R01-NOMINA-OPE         TO A00-BIT-NOMINA-OPE     .   016400      
007285                                                                  016500      
007286    MOVE A00-R01-ORIGEN             TO A00-BIT-ORIGEN         .   016600      
007287    MOVE A00-R01-MONEDA             TO A00-BIT-MONEDA         .   016700      
007288    MOVE A00-R01-AUT-S151           TO A00-BIT-AUT-S151       .   016800      
007289                                                                  016900      
007290    MOVE A00-R01-AUT-AELIM-S151     TO A00-BIT-AUTELI-S151    .   017000      
007291    MOVE A00-R01-AUT-ANT-S151       TO A00-BIT-AUTELI-ANT-S151.   017100      
007292    MOVE A00-R01-TIPO-PROC          TO A00-BIT-TIPO-PROC      .   017200      
007293                                                                  017300      
007294    MOVE A00-R01-SOBREGIRO          TO A00-BIT-SOBREGIRO      .   017600      
007295                                                                  017700      
007296    MOVE A00-R01-CVEAVISO           TO A00-BIT-CVEAVISO       .   018000      
007297                                                                  018100      
007298    MOVE A00-R01-IND-EDOCTA         TO A00-BIT-IND-EDOCTA     .   018400      
007299    MOVE A00-R01-IND-DATOS-ADIC     TO A00-BIT-IND-DATOS-ADIC .   018500      
007300    MOVE A00-R01-PLAZO              TO A00-BIT-FECUM-NDIAS    .   018600      
007301    MOVE A00-R01-SECTOR             TO A00-BIT-SECTOR         .   018700      
007302    MOVE A00-R01-BANCA              TO A00-BIT-BANCA          .   018800      
007303    MOVE SPACES                     TO A00-BIT-FIL-FUTURO     .   018850      
007304    IF A00-R01-SISTEMA = 701                                      018900      
007305       MOVE A00-R01-CLIENTE         TO A00-BIT-CLIENTE            019200      
007306    ELSE                                                          019250      
007307    IF A00-R01-SISTEMA = 87                                       019260      
007308       MOVE A00-R01-CTE-087         TO A00-BIT-FECVEN-087         019270      
007309       MOVE A00-R01-SUFIJO          TO A00-BIT-SUFIJO             019300      
007310       MOVE A00-R01-CLIENTE         TO A00-BIT-CTE-S087           019302      
007311    ELSE                                                          019305      
007312    IF A00-R01-SISTEMA = 18                                       019365      
007313       MOVE A00-R01-BCO-S018        TO A00-BIT-BCO-S018       .   019370      
007314                                                                  019400      
007315    MOVE A00-R01-NODO-ORIG          TO A00-BIT-NODO-ORIG      .   019500      
007316    MOVE A00-R01-STATUS             TO A00-BIT-STATUS         .   019600      
007317    MOVE WKS-CLAVE-CIA              TO A00-BIT-INTERCOMPANY   .   019700      
007318    MOVE A00-R01-SIST-ORIG          TO A00-BIT-SIST-ORIG          019800      
007319    MOVE A00-R01-PROD-ORIG          TO A00-BIT-PROD-ORIG          019900      
007320    MOVE A00-R01-INST-ORIG          TO A00-BIT-INST-ORIG          020000      
007321                                                                  020100      
007322    MOVE A00-R01-CVETR-ORIG         TO A00-BIT-CVETR-ORIG         020200      
007323    MOVE A00-R01-VERIF-FIRMA        TO A00-BIT-REFLOC-VF          020250      
007324                                                                  020270      
007325    IF A00-R01-SISTEMA = 84                                       020300      
007326       MOVE WKS-MOV-SUCEJE          TO A00-BIT-SUCEJE             020450      
007327       MOVE WKS-MOV-CTAEJE          TO A00-BIT-CTAEJE             020500      
007328       MOVE WKS-MOV-MENSUALIDAD     TO A00-BIT-MENSUALIDAD        020600      
007329       MOVE WKS-MOV-ASESOR          TO A00-BIT-ASESOR             020700      
007330    ELSE                                                          021200      
007331    IF A00-R01-SISTEMA = 252                                      021700      
007332       IF A00-R01-FORMATO0 = 0                                    021800      
007333          MOVE A00-R01-FORMATO0     TO A00-BIT-FORMATO            021900      
007334          MOVE A00-R01-DESCRIPCION  TO A00-BIT-DESCRIPCION        022000      
007335          MOVE A00-R01-NATUTRAN     TO A00-BIT-NATUTRAN           022100      
007336       ELSE                                                       022200      
007337       IF A00-R01-FORMATO0 = 1                                    022300      
007338          MOVE A00-R01-FORMATO1     TO A00-BIT-FORMATO1           022400      
007339          MOVE A00-R01-DESCRIPCION1 TO A00-BIT-DESCRIPCION1       022500      
007340          MOVE A00-R01-NATUTRAN1    TO A00-BIT-NATUTRAN1          022600      
007341          MOVE A00-R01-TIPOAUX      TO A00-BIT-TIPOAUX            022700      
007342          MOVE A00-R01-NUMEROCTE    TO A00-BIT-NUMEROCTE          022800      
007343          MOVE A00-R01-NOMBRECTE    TO A00-BIT-NOMBRECTE          022900      
007344          MOVE A00-R01-NUMPARTIDA   TO A00-BIT-NUMPARTIDA         023000      
007345          MOVE A00-R01-ENTSAL       TO A00-BIT-ENTSAL             023100      
007346          MOVE A00-R01-SALDO        TO A00-BIT-SDO                023200      
007347                                       A00-BIT-SALDO              023300      
007348       ELSE                                                       023400      
007349       IF A00-R01-FORMATO0 = 2                                    023500      
007350          MOVE A00-R01-FORMATO2     TO A00-BIT-FORMATO2           023600      
007351          MOVE A00-R01-DESCRIPCION2 TO A00-BIT-DESCRIPCION2       023700      
007352          MOVE A00-R01-NATUTRAN2    TO A00-BIT-NATUTRAN2          023800      
007353          MOVE A00-R01-NUMACREEDOR  TO A00-BIT-NUMACREEDOR        023900      
007354          MOVE A00-R01-NOMACREEDOR  TO A00-BIT-NOMACREEDOR        024000      
007355          MOVE A00-R01-FUNCAUTOR2   TO A00-BIT-FUNCAUTOR2         024100      
007356          MOVE A00-R01-FECHAAUTOR2  TO A00-BIT-FECHAAUTOR2        024200      
007357       ELSE                                                       024300      
007358       IF A00-R01-FORMATO0 = 3                                    024400      
007359          MOVE A00-R01-FORMATO3     TO A00-BIT-FORMATO3           024500      
007360          MOVE A00-R01-DESCRIPCION3 TO A00-BIT-DESCRIPCION3       024600      
007361          MOVE A00-R01-NATUTRAN3    TO A00-BIT-NATUTRAN3          024700      
007362          MOVE A00-R01-FUNCAUTOR3   TO A00-BIT-FUNCAUTOR3         024800      
007363          MOVE A00-R01-FUNCPROPO3   TO A00-BIT-FUNCPROPO3         024900      
007364          MOVE A00-R01-NUMDEUDOR    TO A00-BIT-NUMDEUDOR          025000      
007365          MOVE A00-R01-NOMDEUDOR    TO A00-BIT-NOMDEUDOR          025100      
007366          MOVE A00-R01-FECHAAUTOR3  TO A00-BIT-FECHAAUTOR3        025200      
007367       ELSE                                                       025300      
007368       IF A00-R01-FORMATO0 = 4                                    025400      
007369          MOVE A00-R01-FORMATO4     TO A00-BIT-FORMATO4           025500      
007370          MOVE A00-R01-DESCRIPCION4 TO A00-BIT-DESCRIPCION4       025600      
007371          MOVE A00-R01-NATUTRAN4    TO A00-BIT-NATUTRAN4          025700      
007372          MOVE A00-R01-TIPOPERS     TO A00-BIT-TIPOPERS           025800      
007373          MOVE A00-R01-RFCFT04      TO A00-BIT-RFCFT04            025900      
007374          MOVE A00-R01-ENTIDADFED   TO A00-BIT-ENTIDADFED         026000      
007375          MOVE A00-R01-DIRECCION    TO A00-BIT-DIRECCION          026100      
007376       ELSE                                                       026200      
007377          NEXT SENTENCE                                           026300      
007378    ELSE                                                          026400      
007379    IF A00-R01-SISTEMA = 402                                      027400      
007380       MOVE A00-R01-4CEROS          TO A00-BIT-4CEROS             027500      
007381       MOVE A00-R01-FIDEICO402      TO A00-BIT-FIDEICO402         027600      
007382    ELSE                                                          027700      
007383    IF A00-R01-SISTEMA = 403                                      027800      
007384       MOVE A00-R01-OPCION          TO A00-BIT-OPCION             027900      
007385       MOVE A00-R01-FECCOTI         TO A00-BIT-FECCOTI            028000      
007386       MOVE A00-R01-FIDEICO         TO A00-BIT-FIDEICO            028100      
007387       MOVE A00-R01-IMPVAL          TO A00-BIT-IMPVAL             028200      
007388       MOVE A00-R01-SUCADIC         TO A00-BIT-SUCADIC            028300      
007389       MOVE A00-R01-CAJAADIC        TO A00-BIT-CAJAADIC           028400      
007390       MOVE A00-R01-PROGRAMA        TO A00-BIT-PROGRAMA           028500      
007391       MOVE A00-R01-PLAZO           TO A00-BIT-PLAZO              028600      
007392       MOVE A00-R01-TIPOPLAZO       TO A00-BIT-TIPOPLAZO          028700      
007393       MOVE A00-R01-TASAREF         TO A00-BIT-TASAREF            028800      
007394       MOVE A00-R01-TASAREAL        TO A00-BIT-TASAREAL           028900      
007395       MOVE A00-R01-CTE-403         TO A00-BIT-CTE                029000      
007396       MOVE A00-R01-TIPOCREALFA     TO A00-BIT-TIPOCREALFA        029100      
007397       MOVE A00-R01-AUTS151ORI      TO A00-BIT-AUTS151ORI         029200      
007398       MOVE A00-R01-TIPOCON         TO A00-BIT-TIPOCON            029300      
007399       MOVE A00-R01-INDCONTABLE     TO A00-BIT-INDCONTABLE        029400      
007400    ELSE                                                          029500      
007401    IF A00-R01-SISTEMA = 404                                      029600      
007402       MOVE A00-R01-PRODGEN         TO A00-BIT-PRODGEN            029700      
007403       MOVE A00-R01-SUBPRODGEN      TO A00-BIT-SUBPRODGEN         029800      
007404       MOVE A00-R01-CRE-FOLIO       TO A00-BIT-CRE-FOLIO          029900      
007405       MOVE A00-R01-MON-CONTRUC     TO A00-BIT-MON-CONTRUC        030000      
007406       MOVE A00-R01-OPCION-404      TO A00-BIT-OPCION-404         030100      
007407       MOVE A00-R01-FECCOTI-404     TO A00-BIT-FECCOTI-404        030200      
007408       MOVE A00-R01-FIDEICO-404     TO A00-BIT-FIDEICO-404        030300      
007409       MOVE A00-R01-IMPVAL-404      TO A00-BIT-IMPVAL-404         030400      
007410       MOVE A00-R01-SUCADIC-404     TO A00-BIT-SUCADIC-404        030500      
007411       MOVE A00-R01-CAJAADIC-404    TO A00-BIT-CAJAADIC-404       030600      
007412       MOVE A00-R01-PROGRAMA-404    TO A00-BIT-PROGRAMA-404       030700      
007413       MOVE A00-R01-PLAZO-404       TO A00-BIT-PLAZO-404          030800      
007414       MOVE A00-R01-TIPOPLAZO-404   TO A00-BIT-TIPOPLAZO-404      030900      
007415       MOVE A00-R01-TASAREF-404     TO A00-BIT-TASAREF-404        031000      
007416       MOVE A00-R01-TASAREAL-404    TO A00-BIT-TASAREAL-404       031100      
007417       MOVE A00-R01-CTE-404         TO A00-BIT-CTE-404            031200      
007418       MOVE A00-R01-CRE-CAUSACV     TO A00-BIT-CRE-CAUSACV        031300      
007419       MOVE A00-R01-PAG-PAGNUM    (1) TO A00-BIT-PAG-PAGNUM    (1)031400      
007420       MOVE A00-R01-CRE-STATUS    (1) TO A00-BIT-CRE-STATUS    (1)031500      
007421       MOVE A00-R01-CRE-FASE      (1) TO A00-BIT-CRE-FASE      (1)031600      
007422       MOVE A00-R01-PAG-STATUS    (1) TO A00-BIT-PAG-STATUS    (1)031700      
007423       MOVE A00-R01-PAG-STAVEN    (1) TO A00-BIT-PAG-STAVEN    (1)031800      
007424       MOVE A00-R01-PAG-STACARV   (1) TO A00-BIT-PAG-STACARV   (1)031900      
007425       MOVE A00-R01-MOV-CONCEPTO  (1) TO A00-BIT-MOV-CONCEPTO  (1)032000      
007426       MOVE A00-R01-MOV-TM        (1) TO A00-BIT-MOV-TM        (1)032100      
007427       MOVE A00-R01-MOV-MOVIMIENTO(1) TO A00-BIT-MOV-MOVIMIENTO(1)032200      
007428       MOVE A00-R01-CONSEC        (1) TO A00-BIT-CONSEC        (1)032300      
007429                                                                  032400      
007430       MOVE A00-R01-PAG-PAGNUM    (2) TO A00-BIT-PAG-PAGNUM    (2)032500      
007431       MOVE A00-R01-CRE-STATUS    (2) TO A00-BIT-CRE-STATUS    (2)032600      
007432       MOVE A00-R01-CRE-FASE      (2) TO A00-BIT-CRE-FASE      (2)032700      
007433       MOVE A00-R01-PAG-STATUS    (2) TO A00-BIT-PAG-STATUS    (2)032800      
007434       MOVE A00-R01-PAG-STAVEN    (2) TO A00-BIT-PAG-STAVEN    (2)032900      
007435       MOVE A00-R01-PAG-STACARV   (2) TO A00-BIT-PAG-STACARV   (2)033000      
007436       MOVE A00-R01-MOV-CONCEPTO  (2) TO A00-BIT-MOV-CONCEPTO  (2)033100      
007437       MOVE A00-R01-MOV-TM        (2) TO A00-BIT-MOV-TM        (2)033200      
007438       MOVE A00-R01-MOV-MOVIMIENTO(2) TO A00-BIT-MOV-MOVIMIENTO(2)033300      
007439       MOVE A00-R01-CONSEC        (2) TO A00-BIT-CONSEC        (2)033400      
007440                                                                  033500      
007441       MOVE A00-R01-PAG-PAGNUM    (3) TO A00-BIT-PAG-PAGNUM    (3)033600      
007442       MOVE A00-R01-CRE-STATUS    (3) TO A00-BIT-CRE-STATUS    (3)033700      
007443       MOVE A00-R01-CRE-FASE      (3) TO A00-BIT-CRE-FASE      (3)033800      
007444       MOVE A00-R01-PAG-STATUS    (3) TO A00-BIT-PAG-STATUS    (3)033900      
007445       MOVE A00-R01-PAG-STAVEN    (3) TO A00-BIT-PAG-STAVEN    (3)034000      
007446       MOVE A00-R01-PAG-STACARV   (3) TO A00-BIT-PAG-STACARV   (3)034100      
007447       MOVE A00-R01-MOV-CONCEPTO  (3) TO A00-BIT-MOV-CONCEPTO  (3)034200      
007448       MOVE A00-R01-MOV-TM        (3) TO A00-BIT-MOV-TM        (3)034300      
007449       MOVE A00-R01-MOV-MOVIMIENTO(3) TO A00-BIT-MOV-MOVIMIENTO(3)034400      
007450       MOVE A00-R01-CONSEC        (3) TO A00-BIT-CONSEC        (3)034500      
007451                                                                  034600      
007452       MOVE A00-R01-PAG-PAGNUM    (4) TO A00-BIT-PAG-PAGNUM    (4)034700      
007453       MOVE A00-R01-CRE-STATUS    (4) TO A00-BIT-CRE-STATUS    (4)034800      
007454       MOVE A00-R01-CRE-FASE      (4) TO A00-BIT-CRE-FASE      (4)034900      
007455       MOVE A00-R01-PAG-STATUS    (4) TO A00-BIT-PAG-STATUS    (4)035000      
007456       MOVE A00-R01-PAG-STAVEN    (4) TO A00-BIT-PAG-STAVEN    (4)035100      
007457       MOVE A00-R01-PAG-STACARV   (4) TO A00-BIT-PAG-STACARV   (4)035200      
007458       MOVE A00-R01-MOV-CONCEPTO  (4) TO A00-BIT-MOV-CONCEPTO  (4)035300      
007459       MOVE A00-R01-MOV-TM        (4) TO A00-BIT-MOV-TM        (4)035400      
007460       MOVE A00-R01-MOV-MOVIMIENTO(4) TO A00-BIT-MOV-MOVIMIENTO(4)035500      
007461       MOVE A00-R01-CONSEC        (4) TO A00-BIT-CONSEC        (4)035600      
007462                                                                  035700      
007463       MOVE A00-R01-PAG-PAGNUM    (5) TO A00-BIT-PAG-PAGNUM    (5)035800      
007464       MOVE A00-R01-CRE-STATUS    (5) TO A00-BIT-CRE-STATUS    (5)035900      
007465       MOVE A00-R01-CRE-FASE      (5) TO A00-BIT-CRE-FASE      (5)036000      
007466       MOVE A00-R01-PAG-STATUS    (5) TO A00-BIT-PAG-STATUS    (5)036100      
007467       MOVE A00-R01-PAG-STAVEN    (5) TO A00-BIT-PAG-STAVEN    (5)036200      
007468       MOVE A00-R01-PAG-STACARV   (5) TO A00-BIT-PAG-STACARV   (5)036300      
007469       MOVE A00-R01-MOV-CONCEPTO  (5) TO A00-BIT-MOV-CONCEPTO  (5)036400      
007470       MOVE A00-R01-MOV-TM        (5) TO A00-BIT-MOV-TM        (5)036500      
007471       MOVE A00-R01-MOV-MOVIMIENTO(5) TO A00-BIT-MOV-MOVIMIENTO(5)036600      
007472       MOVE A00-R01-CONSEC        (5) TO A00-BIT-CONSEC        (5)036700      
007473    ELSE                                                          036800      
007474    IF A00-R01-SISTEMA =     408                                  036900      
007475       MOVE A00-R01-FOLIO           TO A00-BIT-FOLIO              037000      
007476       MOVE A00-R01-NUMLIN          TO A00-BIT-NUMLIN             037100      
007477       MOVE A00-R01-TASA-S408       TO A00-BIT-TASA-S408          037200      
007478       MOVE A00-R01-FINI-S408       TO A00-BIT-FINI-S408          037300      
007479       MOVE A00-R01-FFIN-S408       TO A00-BIT-FFIN-S408          037400      
007480       MOVE A00-R01-IMPORTE-S408    TO A00-BIT-IMPORTE-S408       037500      
007481    ELSE                                                          037600      
007482    IF A00-R01-SISTEMA = 600                                      039410      
007483       MOVE A01-R01-FOLIO-AM        TO A00-BIT-FOLIO-600          039420      
007484       MOVE A01-R01-LINEA-AM        TO A00-BIT-LINEA-600          039430      
007485       MOVE A01-R01-CANTIDAD-AM     TO A00-BIT-CANTID-600         039440      
007486       MOVE A01-R01-NUMBIEN-AM      TO A00-BIT-NUMBIE-600         039450      
007487       MOVE A01-R01-TIPBIEN-AM      TO A00-BIT-TIPBIE-600         039460      
007488       MOVE A01-R01-PROPIET-AM      TO A00-BIT-PROPIET-600        039470      
007489       MOVE A01-R01-VALVTA-AM       TO A00-BIT-VALVTA-600         039480      
007490    ELSE                                                          039490      
007491    IF A00-R01-SISTEMA = 701                                      039500      
007492       MOVE A00-R01-DATOS-S701      TO A00-BIT-DATOS-S701         039600      
007493    ELSE                                                          039700      
007494    IF A00-R01-SISTEMA = 702                                      039800      
007495       MOVE A00-R01-CTE-S702        TO A00-BIT-CTE-S702           039900      
007496       MOVE A00-R01-CTA-S702        TO A00-BIT-CTA-S702.          040000      
007497    IF A00-R01-APUDES > 0                                         040100      
007498       MOVE A01-R01-NOMINA-FUN1     TO A00-BIT-NOMINA-FUN1        040200      
007499       MOVE A01-R01-NOMINA-FUN2     TO A00-BIT-NOMINA-FUN2        040300      
007500       MOVE A01-R01-CONT-ORIG       TO A00-BIT-CONT-ORIG.         040400      
007501    MOVE ZERO                       TO W77-ERROR-BIT.             040500      
007502                                                                  040600      
007503    IF A00-R01-APUDES > 0                                         040700      
007504       MOVE A01-R01-LEY1               TO WKS-LEY-ARCH            040800      
007505       IF A00-R01-SISTEMA = 500                                   040900      
007506          IF WKS-LEY-P1 IS NUMERIC                                041000      
007507             MOVE WKS-LEY-P1           TO A00-BIT-REF-CBII        041100      
007508          ELSE                                                    041200      
007509             MOVE SPACES               TO A00-BIT-INF-CBII.       041300      
007510                                                                  041400      
007511*   IF A01-R01-APUDES >  0                                        041500      
007512*      READ LOG151-COMP  INTO  A01-R02-LEY                        041600      
007513*           INVALID KEY                                           041700      
007514*           MOVE 1                     TO W77-ERROR-BIT.          041800      
007515*                                                                 041900      
007516*   IF A01-R01-APUDES >  0 AND W77-ERROR-BIT = 0                  042000      
007517*      MOVE A01-R02-SALDO              TO A00-BIT-SALDO.          042100      
007518                                                                  042200      
007519    WRITE REG-MOVSCIG FROM  A00-BIT-REGMOV.                       042300      
007520    ADD 1                              TO WKS-TR-TOT-REG.         042400      
007521*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
007522                                                                  447000      
007523 21155-GRABA-PUNTEO.                                              447100      
007524*===================                                              447200      
007525      ADD  1                           TO W77-TOTREG-PUNTEO.      447300      
007526      MOVE 2                           TO A00-R01-PUN-CVEREG.     447400      
007527      MOVE A00-R01-IND-CONTA           TO A00-R01-PUN-LIBRO.      447500      
007528      MOVE A00-R01-CONTRATO            TO A00-R01-PUN-CONTRATO.   447600      
007529      MOVE A00-R01-MONEDA              TO A00-R01-PUN-MONEDA.     447700      
007530      MOVE A00-R01-CVETRAN(W77-INDCVE) TO A00-R01-PUN-CVETRA.     447800      
007531      MOVE A00-R01-TM(W77-INDCVE)      TO A00-R01-PUN-TM.         447900      
007532      MOVE A00-R01-IMPORTE(W77-INDCVE) TO A00-R01-PUN-IMPORTE.    448000      
007533      MOVE A00-R01-AUT-S151            TO A00-R01-PUN-AUTS151.    448100      
007534      MOVE A00-R01-AUTORIZA            TO A00-R01-PUN-AUTAPL.     448200      
007535      MOVE A00-R01-SUC-INIC            TO A00-R01-PUN-SUCINI.     448300      
007536      MOVE A00-R01-CAJA-INIC           TO A00-R01-PUN-CAJAINI.    448400      
007537      MOVE A00-R01-PRODUCTO            TO A00-R01-PUN-PRODUCTO.   448500      
007538      MOVE A00-R01-INSTRUMENTO         TO A00-R01-PUN-INST.       448600      
007539      WRITE REG-PUNTEO FROM A00-R01-PUN-DETALLE.                  448700      
007540                                                                  448800      
007541 21170-GRABA-MERCATOR-S252.                                       448900      
007542*==========================                                       449000      
007543     MOVE RMC-NPROCESO                TO A00-R01-MERC-CVE-REG.    449100      
007544     MOVE RMC-LIBRO                   TO A00-R01-MERC-LIBRO.      449200      
007545     MOVE RMC-MONEDA                  TO A00-R01-MERC-MONEDA.     449300      
007546     MOVE RMC-SUC-PROM                TO A00-R01-MERC-SUC.        449400      
007547     IF W88-SIST-CRED                                             449500      
007548        MOVE A00-R01-FIDEICO          TO A00-R01-MERC-FIDEICOMISO 449600      
007549     ELSE                                                         449700      
007550        MOVE ZEROS                    TO A00-R01-MERC-FIDEICOMISO.449800      
007551     MOVE RMC-TIPOCRED                TO A00-R01-MERC-PROD-TC.    449900      
007552     MOVE RMC-FONDO                   TO A00-R01-MERC-INST-FONDO. 450000      
007553     MOVE RMC-CVETRAN                 TO A00-R01-MERC-CVE.        450100      
007554     MOVE RMC-TM                      TO A00-R01-MERC-TM.         450200      
007555     MOVE WKS-FECHA-PROCESO           TO A00-R01-MERC-FECHA.      450300      
007556     MOVE RMC-IMPORTE                 TO A00-R01-MERC-IMPORTE.    450400      
007557     IF A00-R01-FORMATO0 = 1                                      450600      
007558        MOVE 1                        TO A00-R01-MERC-TIP-TRA     450700      
007559        MOVE A00-R01-TIPOAUX          TO A00-R01-MERC-TIP-AUX     450800      
007560        MOVE A00-R01-NUMPARTIDA       TO A00-R01-MERC-FOL-AUX     450900      
007561        MOVE A00-R01-NUMEROCTE        TO A00-R01-MERC-NUM-AUX     451000      
007562        MOVE A00-R01-DESCRIPCION1     TO A00-R01-MERC-DES-AUX     451100      
007563        MOVE A00-R01-AUTORIZA         TO A00-R01-MERC-CVE-AUT     451200      
007564        PERFORM 21190-VERIFICA-FECHAS252                          451300      
007565        PERFORM 21195-VERIFICA-SIG-SALDO                          451400      
007566        MOVE A00-R01-SALDO            TO A00-R01-MERC-SDO-AUX     451500      
007567     ELSE                                                         451600      
007568        MOVE ZEROES                   TO A00-R01-MERC-TIP-TRA     451700      
007569                                         A00-R01-MERC-TIP-AUX     451800      
007570                                         A00-R01-MERC-FOL-AUX     451900      
007571                                         A00-R01-MERC-NUM-AUX     452000      
007572                                         A00-R01-MERC-CVE-AUT     452100      
007573                                         A00-R01-MERC-FEC-PART    452200      
007574                                         A00-R01-MERC-SDO-AUX     452300      
007575        MOVE SPACES                   TO A00-R01-MERC-DES-AUX     452400      
007576                                         A00-R01-MERC-SIG-SAUX.   452500      
007577                                                                  453600      
007578     MOVE ZEROS                       TO A00-R01-FILLER.          453700      
007579                                                                  453800      
007580     IF WKS-PT-INDS254(RMC-CVETRAN,RMC-TM) = 2                    453900      
007581        WRITE REG-CVEMERCATOR           FROM A00-R01-MERC-REGMOV  454000      
007582        ADD 1                           TO A00-R03-MERC-TOTREG    454100      
007583        ADD RMC-IMPORTE                 TO A00-R03-MERC-TOTIMP.   454200      
007584                                                                  454300      
007585 21180-GRABA-TR-MERCATOR.                                         454400      
007586*========================                                         454500      
007587     MOVE ZEROS             TO      A00-R03-FILLER.               454600      
007588     WRITE REG-CVEMERCATOR FROM A00-R03-MERC-TRAILER.             454700      
007589                                                                  454800      
007590 21190-VERIFICA-FECHAS252.                                        454900      
007591*=========================                                        455000      
007592     IF A00-R01-FEC-PARTIDA = 0                                   455100      
007593        MOVE WKS-FECHA-PROCESO     TO A00-R01-MERC-FEC-PART       455200      
007594     ELSE                                                         455300      
007595        MOVE A00-R01-FEC-PARTIDA   TO A00-R01-MERC-FEC-PART.      455400      
007596                                                                  455500      
007597 21195-VERIFICA-SIG-SALDO.                                        455600      
007598*=========================                                        455700      
007599     IF A00-R01-ENTSAL = "E"                                      455800      
007600        IF A00-R01-NATUTRAN1 = 1                                  455900      
007601           MOVE "+"                TO A00-R01-MERC-SIG-SAUX       456000      
007602        ELSE                                                      456100      
007603           IF A00-R01-NATUTRAN1 = 2                               456200      
007604              MOVE "-"             TO A00-R01-MERC-SIG-SAUX       456300      
007605           ELSE                                                   456400      
007606              NEXT SENTENCE                                       456500      
007607     ELSE                                                         456600      
007608     IF A00-R01-ENTSAL = "S"                                      456700      
007609        IF A00-R01-NATUTRAN1 = 1                                  456800      
007610           MOVE "-"                TO A00-R01-MERC-SIG-SAUX       456900      
007611        ELSE                                                      457000      
007612           IF A00-R01-NATUTRAN1 = 2                               457100      
007613              MOVE "+"             TO A00-R01-MERC-SIG-SAUX.      457200      
007614                                                                  457300      
007615******************************************************************457400      
007616*                 GENERACION DE  LA BITACORA Y                   *457500      
007617*                 ARCHIVO PARA EL SISTEMA S028                   *457600      
007618******************************************************************457700      
007619 30000-GENERA-BITACORA.                                           457800      
007620*====================                                             457900      
007621     IF W88-SIST-CRED                                             458000      
007622        OPEN INPUT MOVIMIENTOS                                    458005      
007623         COMPUTE W77-FRAMESIZE        =                           458010      
007624            (ATTRIBUTE FRAMESIZE  OF MOVIMIENTOS)                 458015      
007625         COMPUTE W77-MAXRECSIZE       =                           458020      
007626            (ATTRIBUTE MAXRECSIZE OF MOVIMIENTOS)                 458025      
007627         COMPUTE W77-LASTRECORD       =                           458030      
007628            (ATTRIBUTE LASTRECORD OF MOVIMIENTOS                  458035      
007629                                  +   1)                          458040      
007630         CLOSE MOVIMIENTOS SAVE                                   458045      
007631         PERFORM                      70000-CALCULA-ESPACIO       458050      
007632        SORT SMOVIMIENTOS                                         458100      
007633             ON ASCENDING KEY                                     458200      
007634                SM-NODO-IMP                                       458300      
007635                SM-SUC-INIC                                       458400      
007636                SM-CAJA-INIC                                      458500      
007637                SM-FONDO                                          458600      
007638                SM-TIPO-CRED                                      458700      
007639                SM-AUT-S151                                       458800      
007640             MEMORY SIZE IS W77-MEMORY-SIZE WORDS                 458900      
007641             DISK   SIZE IS W77-DISK-SIZE   WORDS                 459000      
007642             USING  MOVIMIENTOS                                   459100      
007643             GIVING MOVIMIENTOS                                   459200      
007644     ELSE                                                         459300      
007645         OPEN INPUT MOVIMIENTOS                                   459305      
007646         COMPUTE W77-FRAMESIZE        =                           459310      
007647            (ATTRIBUTE FRAMESIZE  OF MOVIMIENTOS)                 459315      
007648         COMPUTE W77-MAXRECSIZE       =                           459320      
007649            (ATTRIBUTE MAXRECSIZE OF MOVIMIENTOS)                 459325      
007650         COMPUTE W77-LASTRECORD       =                           459330      
007651            (ATTRIBUTE LASTRECORD OF MOVIMIENTOS                  459335      
007652                                  +   1)                          459340      
007653         CLOSE MOVIMIENTOS SAVE                                   459345      
007654         PERFORM                      70000-CALCULA-ESPACIO       459350      
007655        SORT SMOVIMIENTOS                                         459400      
007656             ON ASCENDING KEY                                     459500      
007657                SM-NODO-IMP                                       459600      
007658                SM-SUC-INIC                                       459700      
007659                SM-CAJA-INIC                                      459800      
007660                SM-AUT-S151                                       459900      
007661             MEMORY SIZE IS W77-MEMORY-SIZE WORDS                 460000      
007662             DISK   SIZE IS W77-DISK-SIZE   WORDS                 460100      
007663             USING  MOVIMIENTOS                                   460200      
007664             GIVING MOVIMIENTOS.                                  460300      
007665                                                                  460400      
007666                                                                  460500      
007667     OPEN INPUT MOVIMIENTOS                                       460600      
007668     PERFORM 31000-INICIA-MOVSXTERM.                              460700      
007669                                                                  460800      
007670     MOVE 0                               TO W77-EOF              460900      
007671                                                                  461000      
007672     READ MOVIMIENTOS AT END                                      461100      
007673          MOVE 1                          TO W77-EOF              461200      
007674          MOVE  "I"                       TO TIPO-LJ              461300      
007675          MOVE 010401                     TO CODIGO-LJ            461400      
007676          MOVE "ARCHIVO DE MOVIMIENTOS PARA BITACORA VACIO "      461500      
007677                                          TO TEXTO-LJ             461600      
007678          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.    461700      
007679                                                                  461800      
007680     MOVE 2                               TO WKS-NUM-BACKUP       461900      
007681     MOVE "MOVSXCAJA"                     TO WKS-NOMBRE-BACKUP    462000      
007682     MOVE WKS-TB-NOMB-REPORTE              TO                     462100      
007683                                            WSR-RB-E1-NOMB-REPORTE462200      
007684     MOVE "           BITACORA DE MOVIMIENTOS TRANSMITIDOS"       462300      
007685                                          TO WSR-RB-E2-TITULO     462400      
007686     MOVE WKS-FECHA-MAQ                   TO WSR-RB-E2-FECHA-PROC 462500      
007687                                             WSR-RC-E2-FECHA-PROC 462600      
007688     MOVE WKS-FECHA-PROCESO               TO WSR-RB-E1-FECHA-INF  462700      
007689                                             WSR-RC-E1-FECHA-INF  462800      
007690                                             WLI-RP-E1-FECHA-INF  462900      
007691                                             WSR-RP-E1-FECHA-INF  463000      
007692                                             WLI-RP-E5-FECHA-INF  463100      
007693     MOVE "DIARIO"                        TO WSR-RB-E2-TIPO-PROC  463200      
007694                                             WSR-RC-E2-TIPO-PROC  463300      
007695     MOVE WKS-HORA-HHMM                   TO WSR-RB-E2-HORA-TIT   463400      
007696                                             WSR-RC-E2-HORA-TIT.  463500      
007697     MOVE WKS-MINU-HHMM                   TO WSR-RB-E2-MINU-TIT   463520      
007698                                             WSR-RC-E2-MINU-TIT.  463540      
007699     MOVE WKS-SEGU-HHMM                   TO WSR-RB-E2-SEGU-TIT   463560      
007700                                             WSR-RC-E2-SEGU-TIT.  463580      
007701     MOVE W77-SISTEMA-PARAM               TO WSR-RB-E3-SISTEMA    463600      
007702                                             WSR-RB-P2-SISTEMA    463700      
007703                                             WSR-RC-E3-SISTEMA.   463800      
007704     MOVE WKS-FECHA-COMP                  TO WSR-RB-E3-VERSION    463900      
007705                                             WSR-RC-E3-VERSION.   464000      
007706                                                                  464100      
007707     IF W77-EOF = 0                                               464200      
007708        PERFORM 31400-CAMBIA-NODO-IMP.                            464300      
007709                                                                  464400      
007710     MOVE   RM-SUC-INIC           TO WKS-EST-SUC                  464500      
007711     MOVE     3                   TO WKS-EST-CLAVE                464600      
007712     CALL "LIBEST IN ESTRUCTURA"                                  464700      
007713          USING WKS-EST-CODIGO,                                   464800      
007714                WKS-EST-RESPUESTA                                 464900      
007715                                                                  465000      
007716    IF WKS-EST-RESUL = 0                                          465100      
007717        MOVE WKS-EST-NOMBRE-LARGO TO WSR-SUCURSAL-NOMBRE          465200      
007718    ELSE                                                          465300      
007719        MOVE SPACES               TO WSR-SUCURSAL-NOMBRE.         465400      
007720                                                                  465500      
007721     IF W77-EOF = 0                                               465600      
007722        IF W88-SIST-CRED                                          465700      
007723           PERFORM 31110-IMPRIME-ENCABEZADO                       465800      
007724           PERFORM 31000-GENERA-BITACORA UNTIL W77-EOF > 0        465900      
007725           PERFORM 31200-GRABA-MOVSXTERM                          466000      
007726           PERFORM 31200-CORTE-CAJA                               466100      
007727           PERFORM 31300-CORTE-SUC                                466200      
007728           CLOSE BITACORA                                         466300      
007729        ELSE                                                      466400      
007730           PERFORM 31110-IMPRIME-ENCABEZADO                       466500      
007731           PERFORM 31050-GENERA-BITACORA UNTIL W77-EOF > 0        466600      
007732           PERFORM 31200-GRABA-MOVSXTERM                          466700      
007733           PERFORM 31200-CORTE-CAJA                               466800      
007734           PERFORM 31300-CORTE-SUC                                466900      
007735           CLOSE BITACORA.                                        467000      
007736                                                                  467100      
007737     PERFORM 32000-TOTALES-CSI.                                   467200      
007738                                                                  467300      
007739     PERFORM 32300-TERMINA-MOVSXTERM.                             467400      
007740                                                                  467500      
007741    MOVE ZEROS    TO      W77-SALIDA, W77-CAJA-ANT, WKS-NUM-HOJAS,467600      
007742                          WKS-TOTAL-HOJAS, W77-SUC-ANT.           467700      
007743    MOVE SPACES   TO      WSR-SUCURSAL-NOMBRE.                    467800      
007744    PERFORM 39500-IMPRIME-DEMAS VARYING W77-IND3 FROM 1 BY 1      467900      
007745            UNTIL W77-IND3 > 99 OR W77-SALIDA = 1.                468000      
007746                                                                  468100      
007747                                                                  468200      
007748 31000-INICIA-MOVSXTERM.                                          468300      
007749*======================                                           468400      
007750                                                                  468500      
007751     SET   MOVSXTERM (NEWFILE)            TO VALUE TRUE           468600      
007752                                                                  468700      
007753     MOVE WKS-FPROCESO-A6                 TO WKS-FECHA-MOVSXTERM  468800      
007754     MOVE W77-SISTEMA-PARAM               TO WKS-SIS-MOVSXTERM    468900      
007755     OPEN OUTPUT MOVSXTERM.                                       469000      
007756                                                                  469100      
007757     MOVE "HR"                            TO A00-R00-S028-CVE-REG 469200      
007758     MOVE WKS-FP-DIA                      TO A00-R00-S028-DIA-PROC469300      
007759     MOVE WKS-FP-MES                      TO A00-R00-S028-MES-PROC469400      
007760     MOVE WKS-FP-AMO                      TO A00-R00-S028-AMO-PROC469500      
007761     MOVE WKS-FM-DIA                      TO A00-R00-S028-DIA-REAL469600      
007762     MOVE WKS-FM-MES                      TO A00-R00-S028-MES-REAL469700      
007763     MOVE WKS-FM-AMO                      TO A00-R00-S028-AMO-REAL469800      
007764     MOVE WKS-HORA-HHMMSS                TO A00-R00-S028-HORA-REAL469900      
007765                                                                  470000      
007766*     IF W77-SISTEMA-PARAM = 43                                   470100      
007767*        MOVE "S043"               TO A00-R00-S028-CVE-SISTEMA    470200      
007768*        MOVE "CCORRE"             TO A00-R00-S028-NOMBRE-EXT     470300      
007769*     ELSE                                                        470400      
007770     IF W77-SISTEMA-PARAM = 402                                   470500      
007771        MOVE "C402"               TO A00-R00-S028-CVE-SISTEMA     470600      
007772        MOVE "PAGMIN"             TO A00-R00-S028-NOMBRE-EXT      470700      
007773     ELSE                                                         470800      
007774     IF W77-SISTEMA-PARAM = 403                                   470900      
007775        MOVE "S403"               TO A00-R00-S028-CVE-SISTEMA     471000      
007776        MOVE "CEMPRE"             TO A00-R00-S028-NOMBRE-EXT      471100      
007777     ELSE                                                         471200      
007778     IF W77-SISTEMA-PARAM = 404                                   471300      
007779        MOVE "S404"               TO A00-R00-S028-CVE-SISTEMA     471400      
007780        MOVE "INTCRE"             TO A00-R00-S028-NOMBRE-EXT      471500      
007781     ELSE                                                         471600      
007782     IF W77-SISTEMA-PARAM = 252                                   471700      
007783        MOVE "S252"               TO A00-R00-S028-CVE-SISTEMA     471800      
007784        MOVE "SAI   "             TO A00-R00-S028-NOMBRE-EXT      471900      
007785     ELSE                                                         472000      
007786     IF W77-SISTEMA-PARAM = 600                                   472100      
007787        MOVE "C600"               TO A00-R00-S028-CVE-SISTEMA     472200      
007788        MOVE "BIVA  "             TO A00-R00-S028-NOMBRE-EXT      472300      
007789     ELSE                                                         472400      
007790        MOVE W77-SISTEMA-PARAM    TO WKS-TITU-SIST                472500      
007791        MOVE WSR-TIT-SIST-HD-R    TO A00-R00-S028-CVE-SISTEMA     472600      
007792        MOVE "******"             TO A00-R00-S028-NOMBRE-EXT.     472700      
007793                                                                  472800      
007794     WRITE REG-MOVSXTERM    FROM A00-R00-HDR-S028 INVALID KEY     472900      
007795           MOVE "O"                       TO TIPO-LJ              473000      
007796           MOVE 010105                    TO CODIGO-LJ            473100      
007797           MOVE "ERROR EN WRITE, HEADER ARCHIVO MOVSXTERM1"       473200      
007798                                          TO TEXTO-LJ             473300      
007799           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ     473400      
007800           SET MYSELF(STATUS)      TO -1.                         473500      
007801                                                                  473600      
007802 31000-GENERA-BITACORA.                                           473700      
007803*======================                                           473800      
007804                                                                  473900      
007805        IF RM-NODO-IMP =  W77-NODO-ANT                            474000      
007806           IF RM-SUC-INIC = W77-SUC-ANT                           474100      
007807              IF RM-CAJA-INIC = W77-CAJA-ANT                      474200      
007808                 IF RM-FONDO =  W77-FONDO-ANT                     474300      
007809                    IF RM-TIPO-CRED = W77-TC-ANT                  474400      
007810                       PERFORM 31100-IMPRIME-MOV                  474500      
007811                    ELSE                                          474600      
007812                       PERFORM 31200-GRABA-MOVSXTERM              474700      
007813                       PERFORM 31100-IMPRIME-MOV                  474800      
007814                 ELSE                                             474900      
007815                    PERFORM 31200-GRABA-MOVSXTERM                 475000      
007816*                   PERFORM 31110-IMPRIME-ENCABEZADO              475100      
007817                    PERFORM 31100-IMPRIME-MOV                     475200      
007818              ELSE                                                475300      
007819                 PERFORM 31200-GRABA-MOVSXTERM                    475400      
007820                 PERFORM 31200-CORTE-CAJA                         475500      
007821                 MOVE RM-CAJA-INIC TO  W77-CAJA-ANT               475600      
007822                 PERFORM 31110-IMPRIME-ENCABEZADO                 475700      
007823                 PERFORM 31100-IMPRIME-MOV                        475800      
007824           ELSE                                                   475900      
007825              PERFORM 31200-GRABA-MOVSXTERM                       476000      
007826              PERFORM 31200-CORTE-CAJA                            476100      
007827              PERFORM 31300-CORTE-SUC                             476200      
007828              MOVE RM-SUC-INIC    TO W77-SUC-ANT                  476300      
007829              MOVE RM-CAJA-INIC   TO W77-CAJA-ANT                 476400      
007830              PERFORM 31110-IMPRIME-ENCABEZADO                    476500      
007831              PERFORM 31100-IMPRIME-MOV                           476600      
007832        ELSE                                                      476700      
007833           PERFORM 31200-GRABA-MOVSXTERM                          476800      
007834           PERFORM 31200-CORTE-CAJA                               476900      
007835           PERFORM 31300-CORTE-SUC                                477000      
007836           PERFORM 31400-CAMBIA-NODO-IMP                          477100      
007837           MOVE RM-SUC-INIC  TO W77-SUC-ANT                       477200      
007838           MOVE RM-CAJA-INIC TO W77-CAJA-ANT                      477300      
007839           PERFORM 31110-IMPRIME-ENCABEZADO                       477400      
007840           PERFORM 31100-IMPRIME-MOV.                             477500      
007841                                                                  477600      
007842     READ MOVIMIENTOS AT END                                      477700      
007843          MOVE 1                          TO W77-EOF.             477800      
007844                                                                  477900      
007845 31050-GENERA-BITACORA.                                           478000      
007846*======================                                           478100      
007847                                                                  478200      
007848        IF RM-NODO-IMP = W77-NODO-ANT                             478300      
007849           IF RM-SUC-INIC = W77-SUC-ANT                           478400      
007850              IF RM-CAJA-INIC = W77-CAJA-ANT                      478500      
007851                 PERFORM 31100-IMPRIME-MOV                        478600      
007852              ELSE                                                478700      
007853                 PERFORM 31200-GRABA-MOVSXTERM                    478800      
007854                 PERFORM 31200-CORTE-CAJA                         478900      
007855                 MOVE RM-CAJA-INIC TO  W77-CAJA-ANT               479000      
007856                 PERFORM 31110-IMPRIME-ENCABEZADO                 479100      
007857                 PERFORM 31100-IMPRIME-MOV                        479200      
007858           ELSE                                                   479300      
007859              PERFORM 31200-GRABA-MOVSXTERM                       479400      
007860              PERFORM 31200-CORTE-CAJA                            479500      
007861              PERFORM 31300-CORTE-SUC                             479600      
007862              MOVE RM-SUC-INIC    TO W77-SUC-ANT                  479700      
007863              MOVE RM-CAJA-INIC   TO W77-CAJA-ANT                 479800      
007864              PERFORM 31110-IMPRIME-ENCABEZADO                    479900      
007865              PERFORM 31100-IMPRIME-MOV                           480000      
007866        ELSE                                                      480100      
007867           PERFORM 31200-GRABA-MOVSXTERM                          480200      
007868           PERFORM 31200-CORTE-CAJA                               480300      
007869           PERFORM 31300-CORTE-SUC                                480400      
007870           PERFORM 31400-CAMBIA-NODO-IMP                          480500      
007871           MOVE RM-SUC-INIC    TO W77-SUC-ANT                     480600      
007872           MOVE RM-CAJA-INIC   TO W77-CAJA-ANT                    480700      
007873           PERFORM 31110-IMPRIME-ENCABEZADO                       480800      
007874           PERFORM 31100-IMPRIME-MOV.                             480900      
007875                                                                  481000      
007876     READ MOVIMIENTOS AT END                                      481100      
007877          MOVE 1                          TO W77-EOF.             481200      
007878                                                                  481300      
007879***************************************************************** 481400      
007880*              IMPRIME LINEA DE DETALLE                         * 481500      
007881***************************************************************** 481600      
007882                                                                  481700      
007883 31100-IMPRIME-MOV.                                               481800      
007884*=================                                                481900      
007885                                                                  482000      
007886     MOVE 0                               TO WSR-AUTORIZACION     482100      
007887                                             WSR-TC               482200      
007888                                             WSR-FONDO            482300      
007889                                             WSR-MONEDA           482400      
007890                                             WSR-IMPORTE          482500      
007891                                             WSR-SUC-PROM         482600      
007892                                             WSR-CONTRATO         482700      
007893                                             WSR-HORA-HH          482800      
007894                                             WSR-HORA-MM          482850      
007895                                             WSR-OPERADOR         482900      
007896                                             WSR-CVETRAN          483000      
007897                                             WSR-TM               483100      
007898                                             WSR-REFERENCIA       483200      
007899     MOVE SPACES                          TO WSR-CONCEPTO         483300      
007900                                             WSR-LEYENDA          483400      
007901                                                                  483500      
007902     MOVE 0                               TO WKS-NUM-CAR          483600      
007903                                             WKS-IMP-CAR          483700      
007904                                             WKS-NUM-ABO          483800      
007905                                             WKS-IMP-ABO          483900      
007906                                             WKS-NUM-NCONT        484000      
007907                                             WKS-IMP-NCONT        484100      
007908                                                                  484200      
007909     IF RM-ORIGEN = 1                                             484300      
007910        MOVE SPACES                       TO WSR-LOCAL-FOR        484400      
007911     ELSE                                                         484500      
007912        MOVE "FOR"                        TO WSR-LOCAL-FOR.       484600      
007913                                                                  484700      
007914     MOVE RM-TIPO-CRED                     TO WSR-TC              484800      
007915     MOVE RM-FONDO                         TO WSR-FONDO           484900      
007916                                                                  485000      
007917     IF RM-AUT-3NIVEL = 0                                         485100      
007918        MOVE RM-AUT-APLIC                 TO WSR-AUTORIZACION     485200      
007919     ELSE                                                         485300      
007920        MOVE RM-AUT-3NIVEL                TO WSR-AUTORIZACION.    485400      
007921                                                                  485500      
007922     MOVE RM-MONEDA                       TO WSR-MONEDA           485600      
007923     MOVE RM-IMPORTE                      TO WSR-IMPORTE          485700      
007924                                                                  485800      
007925     MOVE "CTO"                           TO WSR-MEDIO-ACCESO     485900      
007926     MOVE RM-SUC-PROM                     TO WSR-SUC-PROM         486000      
007927     MOVE RM-CONTRATO                     TO WSR-CONTRATO.        486100      
007928                                                                  486200      
007929     MOVE RM-HORA-HH                      TO WSR-HORA-HH.         486300      
007930     MOVE RM-HORA-MM                      TO WSR-HORA-MM.         486350      
007931     MOVE RM-NOMINA-OPER                  TO WSR-OPERADOR         486400      
007932     MOVE RM-CVE-TRANS                    TO WSR-CVETRAN          486500      
007933     MOVE RM-REFERENCIA                   TO WSR-REFERENCIA       486600      
007934                                                                  486700      
007935     IF RM-ESTATUS = 1                                            486800      
007936        IF RM-NATS28 = 1                                          486900      
007937           MOVE "CAR"                     TO WSR-CONCEPTO         487000      
007938           MOVE        1                  TO WKS-NUM-CAR          487100      
007939           MOVE RM-IMPORTE                TO WKS-IMP-CAR          487200      
007940        ELSE                                                      487300      
007941        IF RM-NATS28 = 2                                          487400      
007942           MOVE "ABO"                     TO WSR-CONCEPTO         487500      
007943           MOVE        1                  TO WKS-NUM-ABO          487600      
007944           MOVE RM-IMPORTE                TO WKS-IMP-ABO          487700      
007945        ELSE                                                      487800      
007946           MOVE "N/C"                     TO WSR-CONCEPTO         487900      
007947           MOVE       1                   TO WKS-NUM-NCONT        488000      
007948           MOVE RM-IMPORTE                TO WKS-IMP-NCONT        488100      
007949     ELSE                                                         488200      
007950        MOVE "ELI"                        TO WSR-CONCEPTO.        488300      
007951                                                                  488400      
007952     MOVE WKS-PT-NUM-LEYEN(RM-CVE-TRANS,RM-TM) TO W77-IND.        488500      
007953                                                                  488600      
007954     IF W77-IND = 0 OR W77-IND > 10000                            488700      
007955        MOVE SPACES                       TO WSR-LEYENDA          488800      
007956     ELSE                                                         488900      
007957        IF W77-IND > 9000                                         489000      
007958           COMPUTE W77-IND = W77-IND - 9000                       489100      
007959           MOVE WKS-LEYENDA-TRANS4(W77-IND)                       489200      
007960                                          TO WSR-LEYENDA          489300      
007961        ELSE                                                      489400      
007962           IF W77-IND > 6000                                      489500      
007963              COMPUTE W77-IND = W77-IND - 6000                    489600      
007964              MOVE WKS-LEYENDA-TRANS3(W77-IND)                    489700      
007965                                          TO WSR-LEYENDA          489800      
007966           ELSE                                                   489900      
007967              IF W77-IND > 3000                                   490000      
007968                 COMPUTE W77-IND = W77-IND - 3000                 490100      
007969                 MOVE WKS-LEYENDA-TRANS2(W77-IND)                 490200      
007970                                          TO WSR-LEYENDA          490300      
007971              ELSE                                                490400      
007972                 MOVE WKS-LEYENDA-TRANS1(W77-IND)                 490500      
007973                                          TO WSR-LEYENDA.         490600      
007974                                                                  490700      
007975     IF WKS-NUM-LINEAS > 55                                       490800      
007976        PERFORM 31110-IMPRIME-ENCABEZADO.                         490900      
007977                                                                  491000      
007978     WRITE REG-BITACORA           FROM WSR-LINEA-DETALLE          491100      
007979     ADD 1                        TO WKS-NUM-LINEAS.              491200      
007980                                                                  491300      
007981     IF RM-ESTATUS = 1                                            491400      
007982        PERFORM 31110-ACUMULA.                                    491500      
007983                                                                  491600      
007984 31110-ACUMULA.                                                   491700      
007985*==============                                                   491800      
007986     MOVE RM-LIBRO        TO      W77-LIB-TEMP                    491900      
007987     PERFORM 31150-IND-LIBRO.                                     492000      
007988                                                                  492100      
007989     IF RM-MONEDA > 0 AND < 100                                   492200      
007990        MOVE RM-MONEDA            TO      W77-IND2                492300      
007991     ELSE                                                         492400      
007992        MOVE 100                  TO      W77-IND2.               492500      
007993                                                                  492600      
007994     IF  RM-NATS28  = 1 OR 2 OR 9                                 492700      
007995       MOVE 1      TO WKS-CAJA-INDICA(W77-IND,W77-IND2)           492800      
007996                      WKS-SUC-INDICA(W77-IND,W77-IND2)            492900      
007997       ADD WKS-NUM-CAR TO WKS-CAJA-NUMCAR(W77-IND,W77-IND2)       493000      
007998                      WKS-SUC-NUMCAR(W77-IND,W77-IND2)            493100      
007999                      WKS-TOTCSI-NUMCAR(W77-IND,W77-IND2)         493200      
008000       ADD WKS-IMP-CAR TO WKS-CAJA-IMPCAR(W77-IND,W77-IND2)       493300      
008001                      WKS-SUC-IMPCAR(W77-IND,W77-IND2)            493400      
008002                      WKS-TOTCSI-IMPCAR(W77-IND,W77-IND2)         493500      
008003       ADD WKS-NUM-ABO TO WKS-CAJA-NUMABO(W77-IND,W77-IND2)       493600      
008004                      WKS-SUC-NUMABO(W77-IND,W77-IND2)            493700      
008005                      WKS-TOTCSI-NUMABO(W77-IND,W77-IND2)         493800      
008006       ADD WKS-IMP-ABO TO WKS-CAJA-IMPABO(W77-IND,W77-IND2)       493900      
008007                      WKS-SUC-IMPABO(W77-IND,W77-IND2)            494000      
008008                      WKS-TOTCSI-IMPABO(W77-IND,W77-IND2)         494100      
008009       ADD WKS-NUM-NCONT   TO                                     494200      
008010                      WKS-CAJA-NUMNCONT(W77-IND,W77-IND2)         494300      
008011                      WKS-SUC-NUMNCONT(W77-IND,W77-IND2)          494400      
008012                      WKS-TOTCSI-NUMNCONT(W77-IND,W77-IND2)       494500      
008013       ADD WKS-IMP-NCONT   TO                                     494600      
008014                      WKS-CAJA-IMPNCONT(W77-IND,W77-IND2)         494700      
008015                      WKS-SUC-IMPNCONT(W77-IND,W77-IND2)          494800      
008016                      WKS-TOTCSI-IMPNCONT(W77-IND,W77-IND2).      494900      
008017                                                                  495000      
008018*****************************                                     495100      
008019***  ACUMULA PARA EL S028                                         495200      
008020*****************************                                     495300      
008021                                                                  495400      
008022     IF W77-IND < 16                                              495500      
008023        IF RM-NATS28 = 1                                          495600      
008024           COMPUTE WKS-S028-NUMCAR(W77-IND,W77-IND2 ) =           495700      
008025                  WKS-S028-NUMCAR(W77-IND,W77-IND2 ) + WKS-NUM-CAR495800      
008026           COMPUTE WKS-S028-IMPCAR(W77-IND,W77-IND2 ) =           495900      
008027                  WKS-S028-IMPCAR(W77-IND,W77-IND2 ) + WKS-IMP-CAR496000      
008028        ELSE                                                      496100      
008029           IF RM-NATS28 = 2                                       496200      
008030              COMPUTE WKS-S028-NUMABO(W77-IND,W77-IND2 ) =        496300      
008031                  WKS-S028-NUMABO(W77-IND,W77-IND2 ) + WKS-NUM-ABO496400      
008032              COMPUTE WKS-S028-IMPABO(W77-IND,W77-IND2 ) =        496500      
008033                 WKS-S028-IMPABO(W77-IND,W77-IND2 ) + WKS-IMP-ABO.496600      
008034                                                                  496700      
008035 31150-IND-LIBRO.                                                 496800      
008036*================                                                 496900      
008037     IF W77-LIB-TEMP = 0                                          497000      
008038        MOVE 1    TO      W77-IND                                 497100      
008039     ELSE                                                         497200      
008040     IF W77-LIB-TEMP = 1                                          497300      
008041        MOVE 2    TO      W77-IND                                 497400      
008042     ELSE                                                         497500      
008043     IF W77-LIB-TEMP = 2                                          497600      
008044        MOVE 3    TO      W77-IND                                 497700      
008045     ELSE                                                         497800      
008046     IF W77-LIB-TEMP = 3                                          497900      
008047        MOVE 4    TO      W77-IND                                 498000      
008048     ELSE                                                         498100      
008049     IF W77-LIB-TEMP = 11                                         498200      
008050        MOVE 5    TO      W77-IND                                 498300      
008051     ELSE                                                         498400      
008052     IF W77-LIB-TEMP = 12                                         498500      
008053        MOVE 6    TO      W77-IND                                 498600      
008054     ELSE                                                         498700      
008055     IF W77-LIB-TEMP = 13                                         498800      
008056        MOVE 7    TO      W77-IND                                 498900      
008057     ELSE                                                         499000      
008058     IF W77-LIB-TEMP = 14                                         499100      
008059        MOVE 8    TO      W77-IND                                 499200      
008060     ELSE                                                         499300      
008061     IF W77-LIB-TEMP = 15                                         499400      
008062        MOVE 9    TO      W77-IND                                 499500      
008063     ELSE                                                         499600      
008064     IF W77-LIB-TEMP = 16                                         499700      
008065        MOVE 10   TO      W77-IND                                 499800      
008066     ELSE                                                         499900      
008067     IF W77-LIB-TEMP = 17                                         500000      
008068        MOVE 11   TO      W77-IND                                 500100      
008069     ELSE                                                         500200      
008070     IF W77-LIB-TEMP = 20                                         500300      
008071        MOVE 12   TO      W77-IND                                 500400      
008072     ELSE                                                         500500      
008073     IF W77-LIB-TEMP = 31                                         500600      
008074        MOVE 13   TO      W77-IND                                 500700      
008075     ELSE                                                         500800      
008076     IF W77-LIB-TEMP = 32                                         500900      
008077        MOVE 14   TO      W77-IND                                 501000      
008078     ELSE                                                         501020      
008079     IF W77-LIB-TEMP = 39                                         501040      
008080        MOVE 15   TO      W77-IND                                 501060      
008081     ELSE                                                         501100      
008082        MOVE 16   TO      W77-IND.                                501200      
008083                                                                  501300      
008084                                                                  501400      
008085******************************************************************501500      
008086*                     CORTE DE CAJA                              *501600      
008087******************************************************************501700      
008088 31200-CORTE-CAJA.                                                501800      
008089*================                                                 501900      
008090                                                                  502000      
008091     MOVE "TOTAL DE LA CAJA"          TO WSR-TCB-LEYENDA          502100      
008092     WRITE REG-BITACORA    FROM WSR-TITULO-CORTE-BITACORA AFTER 2 502200      
008093     WRITE REG-BITACORA    FROM WSR-TITULO-CORTE-BITACORA-2       502300      
008094                                                                  502400      
008095     PERFORM 31210-CORTE-CAJA    VARYING W77-IND FROM 1 BY 1      502500      
008096                                 UNTIL W77-IND > 16               502600      
008097                                                                  502700      
008098     MOVE LOW-VALUES   TO  TABLA-CORTES-POR-CAJA.                 502800      
008099                                                                  502900      
008100 31210-CORTE-CAJA.                                                503000      
008101*=================                                                503100      
008102        MOVE ZEROS        TO      W77-LIBRO.                      503200      
008103                                                                  503300      
008104        PERFORM 31211-IMPRIME-CORTE-CAJA VARYING W77-IND2         503400      
008105                FROM 1 BY 1 UNTIL W77-IND2 > 100.                 503500      
008106                                                                  503600      
008107 31211-IMPRIME-CORTE-CAJA.                                        503700      
008108*=========================                                        503800      
008109                                                                  503900      
008110     MOVE ZEROS   TO      WSR-NUM-CARGOS     WSR-IMP-CARGOS       504000      
008111                          WSR-NUM-ABONOS     WSR-IMP-ABONOS       504100      
008112                          WSR-NUM-NCONTABLES WSR-IMP-NCONTABLES.  504200      
008113                                                                  504300      
008114     IF WKS-CAJA-INDICA(W77-IND,W77-IND2) > 0                     504400      
008115        AND W88-LIBRO                                             504500      
008116        PERFORM 31213-NOMBRE-LIBRO.                               504600      
008117                                                                  504700      
008118     IF WKS-CAJA-INDICA(W77-IND,W77-IND2) > 0                     504800      
008119        MOVE WKS-CAJA-NUMCAR(W77-IND,W77-IND2)                    504900      
008120                                          TO WSR-NUM-CARGOS       505000      
008121                                             WKS-NUM-CAR          505100      
008122        MOVE WKS-CAJA-IMPCAR(W77-IND,W77-IND2)                    505200      
008123                                          TO WSR-IMP-CARGOS       505300      
008124                                             WKS-IMP-CAR          505400      
008125        MOVE WKS-CAJA-NUMABO(W77-IND,W77-IND2)                    505500      
008126                                          TO WSR-NUM-ABONOS       505600      
008127                                             WKS-NUM-ABO          505700      
008128        MOVE WKS-CAJA-IMPABO(W77-IND,W77-IND2)                    505800      
008129                                          TO WSR-IMP-ABONOS       505900      
008130                                             WKS-IMP-ABO          506000      
008131        MOVE WKS-CAJA-NUMNCONT(W77-IND,W77-IND2)                  506100      
008132                                          TO WSR-NUM-NCONTABLES   506200      
008133                                             WKS-NUM-NCONT        506300      
008134        MOVE WKS-CAJA-IMPNCONT(W77-IND,W77-IND2)                  506400      
008135                                          TO WSR-IMP-NCONTABLES   506500      
008136                                             WKS-IMP-NCONT        506600      
008137        PERFORM 31212-DET-MONEDA                                  506700      
008138        WRITE REG-BITACORA         FROM   WSR-DETALLE-CORTE.      506800      
008139                                                                  506900      
008140 31212-DET-MONEDA.                                                507000      
008141*=================                                                507100      
008142     IF W77-IND2 > 0 AND < 100                                    507200      
008143        MOVE WKS-LEYENDA-MON(W77-IND2)                            507300      
008144                                  TO      WSR-DC-CONCEPTO         507400      
008145     ELSE                                                         507500      
008146        MOVE "DESCONOCIDA "       TO      WSR-DC-CONCEPTO.        507600      
008147                                                                  507700      
008148 31213-NOMBRE-LIBRO.                                              507800      
008149*===================                                              507900      
008150     MOVE WKS-NOMBCON-CAJA(W77-IND)                               508000      
008151                          TO      WSR-CORTE-NOMBRE-LIBRO          508100      
008152     MOVE 1               TO      W77-LIBRO                       508200      
008153     WRITE REG-BITACORA   FROM    WSR-TITULO-CORTE-LIBRO AFTER 1. 508300      
008154                                                                  508400      
008155 31215-NOMBRE-LIBRO.                                              508500      
008156*===================                                              508600      
008157     MOVE WKS-NOMBCON-CAJA(W77-IND)                               508700      
008158                           TO      WSR-CORTE-NOMBRE-LIBRO         508800      
008159     MOVE 1                TO      W77-LIBRO                      508900      
008160     WRITE REG-TOTALESTRANS FROM   WSR-TITULO-CORTE-LIBRO AFTER 1.509000      
008161                                                                  509100      
008162 31200-GRABA-MOVSXTERM.                                           509200      
008163*======================                                           509300      
008164     PERFORM 31210-GRABA-MOVSXTERM VARYING W77-IND FROM 1 BY 1    509400      
008165                     UNTIL W77-IND > 16.                          509500      
008166     MOVE RM-FONDO      TO  W77-FONDO-ANT                         509600      
008167     MOVE RM-TIPO-CRED  TO  W77-TC-ANT                            509700      
008168     MOVE LOW-VALUES    TO  TABLA-CORTES-MOVSXTERM.               509800      
008169                                                                  509900      
008170 31210-GRABA-MOVSXTERM.                                           510000      
008171*=====================                                            510100      
008172     PERFORM 31220-GRABA-MOVSXTERM VARYING W77-IND2 FROM 1 BY 1   510200      
008173                           UNTIL W77-IND2 > 100.                  510300      
008174                                                                  510400      
008175                                                                  510500      
008176 31220-GRABA-MOVSXTERM.                                           510600      
008177*======================                                           510700      
008178                                                                  510800      
008179   MOVE SPACES          TO        A00-R02-S028-CVECR.             510900      
008180   MOVE ZEROS           TO        A00-R02-S028-NUMCR.             511000      
008181                                                                  511100      
008182   IF WKS-S028-IMPCAR(W77-IND,W77-IND2) > 0 OR                    511200      
008183      WKS-S028-IMPABO(W77-IND,W77-IND2) > 0                       511300      
008184      MOVE WKS-S028-NUMCAR(W77-IND,W77-IND2)  TO                  511400      
008185                          A00-R02-S028-NUMCAR                     511500      
008186      MOVE WKS-S028-IMPCAR(W77-IND,W77-IND2)  TO                  511600      
008187                          A00-R02-S028-IMPCAR                     511700      
008188      MOVE WKS-S028-NUMABO(W77-IND,W77-IND2)  TO                  511800      
008189                          A00-R02-S028-NUMABO                     511900      
008190      MOVE WKS-S028-IMPABO(W77-IND,W77-IND2)  TO                  512000      
008191                          A00-R02-S028-IMPABO                     512100      
008192      MOVE W77-IND2               TO A00-R02-S028-TIPMON          512200      
008193      MOVE W77-CAJA-ANT           TO A00-R02-S028-NUMTERM         512300      
008194      MOVE W77-SUC-ANT            TO A00-R02-S028-SUCORI          512400      
008195      PERFORM 31211-MUEVE-LEYENDA                                 512500      
008196*     PERFORM 31212-GRABA-CR-S403                                 512600      
008197*      PERFORM 31222-GRABA-CR-S043                                512700      
008198      PERFORM 31233-GRABA-CR-S252                                 512710      
008199      WRITE REG-MOVSXTERM        FROM A00-R02-REGMOV-S028         512800      
008200      ADD 1                       TO W77-MOVSXTERM-NUMREG         512900      
008201      ADD A00-R02-S028-IMPCAR     TO W77-MOVSXTERM-CARGOS         513000      
008202      ADD A00-R02-S028-IMPABO     TO W77-MOVSXTERM-ABONOS.        513100      
008203                                                                  513200      
008204 31211-MUEVE-LEYENDA.                                             513300      
008205*====================                                             513400      
008206     MOVE "PROD"                  TO A00-R02-S028-CVEPRD          513500      
008207     MOVE 1                       TO A00-R02-S028-NUMPRD          513600      
008208     MOVE SPACES                  TO A00-R02-S028-LEY.            513700      
008209                                                                  513800      
008210     IF W77-IND = 1                                               513900      
008211        MOVE 0 TO A00-R02-S028-BANCO                              514000      
008212     ELSE                                                         514100      
008213     IF W77-IND = 2                                               514200      
008214        MOVE 1 TO A00-R02-S028-BANCO                              514300      
008215     ELSE                                                         514400      
008216     IF W77-IND = 3                                               514500      
008217        MOVE 2 TO A00-R02-S028-BANCO                              514600      
008218     ELSE                                                         514700      
008219     IF W77-IND = 4                                               514800      
008220        MOVE 3  TO A00-R02-S028-BANCO                             514900      
008221     ELSE                                                         515000      
008222     IF W77-IND = 5                                               515100      
008223        MOVE 11 TO A00-R02-S028-BANCO                             515200      
008224     ELSE                                                         515300      
008225     IF W77-IND = 6                                               515400      
008226        MOVE 12 TO A00-R02-S028-BANCO                             515500      
008227     ELSE                                                         515600      
008228     IF W77-IND = 7                                               515700      
008229        MOVE 13 TO A00-R02-S028-BANCO                             515800      
008230     ELSE                                                         515900      
008231     IF W77-IND = 8                                               516000      
008232        MOVE 14 TO A00-R02-S028-BANCO                             516100      
008233     ELSE                                                         516200      
008234     IF W77-IND = 9                                               516300      
008235        MOVE 15 TO A00-R02-S028-BANCO                             516400      
008236     ELSE                                                         516500      
008237     IF W77-IND = 10                                              516600      
008238        MOVE 16 TO A00-R02-S028-BANCO                             516700      
008239     ELSE                                                         516800      
008240     IF W77-IND = 11                                              516900      
008241        MOVE 17 TO A00-R02-S028-BANCO                             517000      
008242     ELSE                                                         517100      
008243     IF W77-IND = 12                                              517200      
008244        MOVE 20 TO A00-R02-S028-BANCO                             517300      
008245     ELSE                                                         517400      
008246     IF W77-IND = 13                                              517500      
008247        MOVE 31 TO A00-R02-S028-BANCO                             517600      
008248     ELSE                                                         517700      
008249     IF W77-IND = 14                                              517800      
008250        MOVE 32 TO A00-R02-S028-BANCO                             517900      
008251     ELSE                                                         518000      
008252     IF W77-IND = 15                                              518020      
008253        MOVE 39 TO A00-R02-S028-BANCO                             518040      
008254     ELSE                                                         518060      
008255        MOVE 18 TO A00-R02-S028-BANCO.                            518100      
008256                                                                  518200      
008257     IF W88-SIST-CRED                                             518300      
008258        IF W77-TC-ANT < 101 AND W77-FONDO-ANT < 101               518400      
008259           IF W77-SISTEMA-PARAM = 403                             518500      
008260              MOVE WKS-NOM-TF(W77-FONDO-ANT)      TO              518600      
008261                                             WKS-LEY-FONDO        518700      
008262              MOVE WKS-NOM-TC(W77-TC-ANT) TO WKS-LEY-TCRED        518800      
008263              MOVE WKS-LEY-FONTCRED-S403  TO A00-R02-S028-LEY     518900      
008264              MOVE WKS-NUM-TF(W77-FONDO-ANT) TO WKS-NUM-FONDO     519000      
008265              MOVE WKS-NUM-TC(W77-TC-ANT) TO WKS-NUM-TCRED        519100      
008266              MOVE WKS-NUM-FONTCRED-S403  TO A00-R02-S028-NUMPRD  519200      
008267           ELSE                                                   519300      
008268              MOVE WKS-NOM-TC(W77-TC-ANT) TO A00-R02-S028-LEY     519400      
008269              MOVE W77-TC-ANT             TO A00-R02-S028-NUMPRD  519500      
008270        ELSE                                                      519600      
008271           MOVE SPACES                 TO A00-R02-S028-LEY        519700      
008272           MOVE W77-TC-ANT             TO A00-R02-S028-NUMPRD.    519800      
008273                                                                  519900      
008274 31212-GRABA-CR-S403.                                             520000      
008275*====================                                             520100      
008276                                                                  520200      
008277     IF W77-SISTEMA-PARAM = 403 AND                               520300      
008278        (W77-CAJA-ANT = 70 OR 71 OR 72 OR 73 OR 74 OR 75)         520400      
008279        MOVE "CR"         TO      A00-R02-S028-CVECR              520500      
008280        MOVE 540          TO      A00-R02-S028-NUMCR.             520600      
008281                                                                  520700      
008282 31222-GRABA-CR-S043.                                             520800      
008283*====================                                             520900      
008284     IF W77-SISTEMA-PARAM = 43                                    521000      
008285        MOVE  "CR"        TO      A00-R02-S028-CVECR              521100      
008286        IF W77-IND2 = 1                                           521200      
008287           MOVE 432       TO      A00-R02-S028-NUMCR              521300      
008288        ELSE                                                      521400      
008289           IF W77-IND2 = 5                                        521500      
008290              MOVE 140    TO      A00-R02-S028-NUMCR.             521600      
008291                                                                  521610      
008292 31233-GRABA-CR-S252.                                             521620      
008293*====================                                             521630      
008294     IF W77-SISTEMA-PARAM = 252                                   521640      
008295        MOVE  "CR"        TO      A00-R02-S028-CVECR              521650      
008296        IF W77-IND = 15                                           521660      
008297           MOVE 7290      TO      A00-R02-S028-NUMCR              521670      
008298        ELSE                                                      521680      
008299           MOVE 3579      TO      A00-R02-S028-NUMCR.             521690      
008300                                                                  521700      
008301 31300-CORTE-SUC.                                                 521800      
008302*===============                                                  521900      
008303                                                                  522000      
008304     PERFORM 31110-IMPRIME-ENCABEZADO-SUC                         522100      
008305                                                                  522200      
008306     WRITE REG-BITACORA   FROM WSR-TITULO-CORTE-PARCIAL-SUC       522300      
008307                          AFTER 2                                 522400      
008308     WRITE REG-BITACORA   FROM WSR-TITULO-CORTE-BITACORA-2        522500      
008309                                                                  522600      
008310     PERFORM 31310-CORTE-SUC VARYING W77-IND FROM 1 BY 1          522700      
008311                             UNTIL W77-IND > 16                   522800      
008312     MOVE   LOW-VALUES            TO TABLA-CORTES-POR-SUCURSAL    522900      
008313                                                                  523000      
008314     MOVE   RM-SUC-INIC           TO WKS-EST-SUC                  523100      
008315     MOVE     3                   TO WKS-EST-CLAVE                523200      
008316     CALL "LIBEST IN ESTRUCTURA"                                  523300      
008317          USING WKS-EST-CODIGO,                                   523400      
008318                WKS-EST-RESPUESTA                                 523500      
008319    IF WKS-EST-RESUL = 0                                          523600      
008320        MOVE WKS-EST-NOMBRE-LARGO TO WSR-SUCURSAL-NOMBRE          523700      
008321    ELSE                                                          523800      
008322        MOVE SPACES               TO WSR-SUCURSAL-NOMBRE.         523900      
008323                                                                  524000      
008324 31310-CORTE-SUC.                                                 524100      
008325*===============                                                  524200      
008326                                                                  524300      
008327        MOVE ZEROS        TO      W77-LIBRO.                      524400      
008328                                                                  524500      
008329        PERFORM 31311-IMPRIME-CORTE-SUCREGION VARYING W77-IND2    524600      
008330                               FROM 1 BY 1 UNTIL W77-IND2 > 100.  524700      
008331                                                                  524800      
008332 31311-IMPRIME-CORTE-SUCREGION.                                   524900      
008333*==============================                                   525000      
008334                                                                  525100      
008335     IF WKS-SUC-INDICA(W77-IND,W77-IND2) > 0                      525200      
008336        AND W88-LIBRO                                             525300      
008337        PERFORM 31213-NOMBRE-LIBRO.                               525400      
008338                                                                  525500      
008339     IF WKS-SUC-INDICA(W77-IND,W77-IND2) > 0                      525600      
008340        MOVE WKS-SUC-NUMCAR(W77-IND,W77-IND2)                     525700      
008341                                            TO WSR-NUM-CARGOS     525800      
008342                                               WKS-NUM-CAR        525900      
008343        MOVE WKS-SUC-IMPCAR(W77-IND,W77-IND2)                     526000      
008344                                            TO WSR-IMP-CARGOS     526100      
008345                                               WKS-IMP-CAR        526200      
008346        MOVE WKS-SUC-NUMABO(W77-IND,W77-IND2)                     526300      
008347                                            TO WSR-NUM-ABONOS     526400      
008348                                               WKS-NUM-ABO        526500      
008349        MOVE WKS-SUC-IMPABO(W77-IND,W77-IND2)                     526600      
008350                                            TO WSR-IMP-ABONOS     526700      
008351                                               WKS-IMP-ABO        526800      
008352        MOVE WKS-SUC-NUMNCONT(W77-IND,W77-IND2)                   526900      
008353                                            TO WSR-NUM-NCONTABLES 527000      
008354                                               WKS-NUM-NCONT      527100      
008355        MOVE WKS-SUC-IMPNCONT(W77-IND,W77-IND2)                   527200      
008356                                            TO WSR-IMP-NCONTABLES 527300      
008357                                               WKS-IMP-NCONT      527400      
008358        PERFORM 31212-DET-MONEDA                                  527500      
008359        WRITE REG-BITACORA        FROM    WSR-DETALLE-CORTE.      527600      
008360                                                                  527700      
008361                                                                  527800      
008362 31400-CAMBIA-NODO-IMP.                                           527900      
008363*=====================                                            528000      
008364                                                                  528100      
008365     IF W77-SW-1VEZ-BITA = 0                                      528200      
008366        MOVE 1                    TO W77-SW-1VEZ-BITA             528300      
008367     ELSE                                                         528400      
008368        CLOSE BITACORA.                                           528500      
008369                                                                  528600      
008370     MOVE RM-NODO-IMP             TO WKS-CENTRO-IMPRESION         528700      
008371                                      W77-NODO-ANT                528800      
008372                                                                  528900      
008373     MOVE 0       TO      W77-SALIDA                              529000      
008374     PERFORM 31450-CHECA-IMPRESOS VARYING W77-IND3 FROM 1 BY 1    529100      
008375                         UNTIL W77-IND3 > 99 OR W77-SALIDA = 1    529200      
008376                                                                  529300      
008377     MOVE  2                      TO WKS-NUM-BACKUP               529400      
008378                                     WKS-TT-NUM-BACK              529500      
008379     MOVE  "MOVSXCAJA"            TO WKS-NOMBRE-BACKUP            529600      
008380                                     WKS-TT-NOMBRE-BACK           529700      
008381     MOVE  0                      TO WKS-NUM-HOJAS.               529800      
008382     CHANGE ATTRIBUTE TITLE OF BITACORA    TO                     529900      
008383                               WKS-TIT-BITACORA                   530000      
008384     MOVE WKS-TT-NOMB-BACKUP      TO WSR-RB-E1-NOMB-REPORTE       530100      
008385     OPEN  OUTPUT             BITACORA.                           530200      
008386                                                                  530300      
008387***************************************************************   530400      
008388*                IMPRIME ENCABEZADOS DE BITACORA              *   530500      
008389***************************************************************   530600      
008390 31110-IMPRIME-ENCABEZADO.                                        530700      
008391*=========================                                        530800      
008392    ADD 1                         TO WKS-NUM-HOJAS                530900      
008393                                     WKS-TOTAL-HOJAS.             531000      
008394    MOVE WKS-NUM-HOJAS             TO WSR-RB-E3-HOJA              531100      
008395    MOVE W77-SUC-ANT               TO WSR-NUM-SUCURSAL            531200      
008396    MOVE W77-CAJA-ANT              TO WSR-CAJA.                   531300      
008397                                                                  531400      
008398    WRITE REG-BITACORA   FROM WSR-ENCAB-1         AFTER PAGE.     531500      
008399    WRITE REG-BITACORA   FROM WSR-ENCAB-2                         531600      
008400    WRITE REG-BITACORA   FROM WSR-ENCAB-3                         531700      
008401    WRITE REG-BITACORA   FROM WSR-ENCAB-4                         531800      
008402    WRITE REG-BITACORA   FROM WSR-ENCAB-5                         531900      
008403    WRITE REG-BITACORA   FROM WSR-ENCAB-6         AFTER 2         532000      
008404    WRITE REG-BITACORA   FROM WSR-ENCAB-7                         532100      
008405    MOVE SPACES TO REG-BITACORA                                   532200      
008406    WRITE REG-BITACORA                                            532300      
008407    MOVE 09                       TO WKS-NUM-LINEAS.              532400      
008408                                                                  532500      
008409******************************************************************532600      
008410*         IMPRIME ENCABEZADOS DE BITACORA CORTE POR SUC          *532700      
008411******************************************************************532800      
008412 31110-IMPRIME-ENCABEZADO-SUC.                                    532900      
008413*============================                                     533000      
008414    ADD 1                         TO WKS-NUM-HOJAS                533100      
008415                                     WKS-TOTAL-HOJAS.             533200      
008416    MOVE WKS-NUM-HOJAS             TO WSR-RB-E3-HOJA              533300      
008417    MOVE W77-SUC-ANT               TO WSR-NUM-SUCURSAL            533400      
008418    MOVE W77-CAJA-ANT              TO WSR-CAJA.                   533500      
008419                                                                  533600      
008420    WRITE REG-BITACORA   FROM WSR-ENCAB-1         AFTER PAGE.     533700      
008421    WRITE REG-BITACORA   FROM WSR-ENCAB-2                         533800      
008422    WRITE REG-BITACORA   FROM WSR-ENCAB-3                         533900      
008423    WRITE REG-BITACORA   FROM WSR-ENCAB-4                         534000      
008424    WRITE REG-BITACORA   FROM WSR-ENCAB-5                         534100      
008425    WRITE REG-BITACORA   FROM WSR-ENCAB-7         AFTER 2.        534200      
008426    MOVE SPACES TO REG-BITACORA                                   534300      
008427    WRITE REG-BITACORA                                            534400      
008428    MOVE 08                       TO WKS-NUM-LINEAS.              534500      
008429                                                                  534600      
008430 31450-CHECA-IMPRESOS.                                            534700      
008431*---------------------                                            534800      
008432                                                                  534900      
008433    MOVE RM-NODO-IMP      TO      RM-IMP-NODO.                    535000      
008434                                                                  535100      
008435    IF RM-IMP-NOD = WKS-TAB-NODO(W77-IND3)                        535200      
008436       MOVE 1     TO      WKS-BAN-NODO(W77-IND3)                  535300      
008437                          W77-SALIDA.                             535400      
008438                                                                  535500      
008439                                                                  535600      
008440****************************************************************  535700      
008441*          TOTALES DE TRANSMISION DEL CSI                      *  535800      
008442****************************************************************  535900      
008443 32000-TOTALES-CSI.                                               536000      
008444*=================                                                536100      
008445                                                                  536200      
008446     MOVE ZERO                              TO WKS-REP-TCSI-VACIO.536300      
008447                                                                  536400      
008448     MOVE W77-CSI-PROCESO                   TO WKS-TT-CENTRO-IMP  536500      
008449     MOVE  1                                TO WKS-TT-NUM-BACK    536600      
008450     MOVE  "TOTALES"                        TO WKS-TT-NOMBRE-BACK 536700      
008451     CHANGE ATTRIBUTE TITLE OF TOTALESTRANS TO WKS-TIT-TOTALES    536800      
008452                                                                  536900      
008453     MOVE WKS-TT-NOMB-BACKUP             TO WSR-RB-E1-NOMB-REPORTE537000      
008454     OPEN  OUTPUT  TOTALESTRANS                                   537100      
008455     IF W77-CSI-PROCESO > 10                                      537200      
008456        MOVE WKS-NOMB-LARGO-CSI(10)               TO WSR-TIT-CSI  537300      
008457     ELSE                                                         537400      
008458        MOVE WKS-NOMB-LARGO-CSI(W77-CSI-PROCESO)  TO WSR-TIT-CSI. 537500      
008459                                                                  537600      
008460     MOVE 1                       TO   WSR-RB-E3-HOJA             537700      
008461     MOVE SPACES                  TO   WSR-TCB-LEYENDA            537800      
008462                                       WSR-TIT-CONT               537900      
008463     WRITE REG-TOTALESTRANS       FROM WSR-ENCAB-1 AFTER PAGE     538000      
008464     WRITE REG-TOTALESTRANS       FROM WSR-ENCAB-2                538100      
008465     WRITE REG-TOTALESTRANS       FROM WSR-ENCAB-3                538200      
008466     WRITE REG-TOTALESTRANS       FROM WSR-TITULO-CSI             538300      
008467     WRITE REG-TOTALESTRANS       FROM WSR-TITULO-CORTE-BITACORA  538400      
008468                                       AFTER 2                    538500      
008469     WRITE REG-TOTALESTRANS       FROM WSR-TITULO-CORTE-BITACORA-2538600      
008470                                                                  538700      
008471     PERFORM 32010-TOTALES-CSI VARYING W77-IND FROM 1 BY 1        538800      
008472             UNTIL W77-IND > 16.                                  538900      
008473                                                                  539000      
008474     IF WKS-REP-TCSI-VACIO = 0                                    539100      
008475        WRITE REG-TOTALESTRANS    FROM WKS-TITULO-NO-INFORMACION  539200      
008476                                       AFTER 22.                  539300      
008477                                                                  539400      
008478 32010-TOTALES-CSI.                                               539500      
008479*==================                                               539600      
008480                                                                  539700      
008481     MOVE ZEROS        TO      W77-LIBRO.                         539800      
008482                                                                  539900      
008483     PERFORM 32020-TOTALES-CSI VARYING W77-IND2 FROM 1 BY 1       540000      
008484             UNTIL W77-IND2 > 100.                                540100      
008485                                                                  540200      
008486 32020-TOTALES-CSI.                                               540300      
008487*==================                                               540400      
008488                                                                  540500      
008489     IF (WKS-TOTCSI-NUMCAR(W77-IND,W77-IND2) > 0   OR             540600      
008490         WKS-TOTCSI-NUMABO(W77-IND,W77-IND2) > 0   OR             540700      
008491         WKS-TOTCSI-NUMNCONT(W77-IND,W77-IND2) > 0 )              540800      
008492         AND W88-LIBRO                                            540900      
008493         PERFORM 31215-NOMBRE-LIBRO.                              541000      
008494                                                                  541100      
008495     IF WKS-TOTCSI-NUMCAR(W77-IND,W77-IND2) > 0   OR              541200      
008496        WKS-TOTCSI-NUMABO(W77-IND,W77-IND2) > 0   OR              541300      
008497        WKS-TOTCSI-NUMNCONT(W77-IND,W77-IND2) > 0                 541400      
008498        MOVE WKS-TOTCSI-NUMCAR(W77-IND,W77-IND2)   TO             541500      
008499                                                 W77-TTC-NUMCAR   541600      
008500        MOVE WKS-TOTCSI-IMPCAR(W77-IND,W77-IND2)   TO             541700      
008501                                                 W77-TTC-IMPCAR   541800      
008502        MOVE WKS-TOTCSI-NUMABO(W77-IND,W77-IND2)   TO             541900      
008503                                                 W77-TTC-NUMABO   542000      
008504        MOVE WKS-TOTCSI-IMPABO(W77-IND,W77-IND2)   TO             542100      
008505                                                 W77-TTC-IMPABO   542200      
008506        MOVE WKS-TOTCSI-NUMNCONT(W77-IND,W77-IND2) TO             542300      
008507                                                 W77-TTC-NUMNCONT 542400      
008508        MOVE WKS-TOTCSI-IMPNCONT(W77-IND,W77-IND2) TO             542500      
008509                                                 W77-TTC-IMPNCONT 542600      
008510        MOVE W77-TTC-NUMCAR          TO      WSR-NUM-CARGOS       542700      
008511        MOVE W77-TTC-IMPCAR          TO      WSR-IMP-CARGOS       542800      
008512        MOVE W77-TTC-NUMABO          TO      WSR-NUM-ABONOS       542900      
008513        MOVE W77-TTC-IMPABO          TO      WSR-IMP-ABONOS       543000      
008514        MOVE W77-TTC-NUMNCONT        TO      WSR-NUM-NCONTABLES   543100      
008515        MOVE W77-TTC-IMPNCONT        TO      WSR-IMP-NCONTABLES   543200      
008516        PERFORM 31212-DET-MONEDA                                  543300      
008517        WRITE REG-TOTALESTRANS     FROM  WSR-DETALLE-CORTE.       543400      
008518                                                                  543500      
008519        IF W77-TTC-NUMCAR > 0   OR W77-TTC-IMPCAR > 0 OR          543600      
008520           W77-TTC-NUMABO > 0   OR W77-TTC-IMPABO > 0 OR          543700      
008521           W77-TTC-NUMNCONT > 0 OR W77-TTC-IMPNCONT > 0           543800      
008522           MOVE 1 TO WKS-REP-TCSI-VACIO.                          543900      
008523                                                                  544000      
008524 32200-ENCABEZADO-TOT.                                            544100      
008525*---------------------                                            544200      
008526     IF W77-CSI-PROCESO > 10                                      544300      
008527        MOVE WKS-NOMB-LARGO-CSI(10)               TO WSR-TIT-CSI  544400      
008528     ELSE                                                         544500      
008529        MOVE WKS-NOMB-LARGO-CSI(W77-CSI-PROCESO)  TO WSR-TIT-CSI. 544600      
008530                                                                  544700      
008531     MOVE 2                       TO WSR-RB-E3-HOJA               544800      
008532     MOVE SPACES                  TO  WSR-TCB-LEYENDA             544900      
008533     WRITE REG-TOTALESTRANS       FROM WSR-ENCAB-1 AFTER PAGE     545000      
008534     WRITE REG-TOTALESTRANS       FROM WSR-ENCAB-2                545100      
008535     WRITE REG-TOTALESTRANS       FROM WSR-ENCAB-3                545200      
008536     WRITE REG-TOTALESTRANS       FROM WSR-TITULO-CSI             545300      
008537     WRITE REG-TOTALESTRANS       FROM WSR-TITULO-CORTE-BITACORA  545400      
008538                                       AFTER 2                    545500      
008539     WRITE REG-TOTALESTRANS      FROM WSR-TITULO-CORTE-BITACORA-2.545600      
008540                                                                  545700      
008541                                                                  545800      
008542 32300-TERMINA-MOVSXTERM.                                         545900      
008543*=======================                                          546000      
008544                                                                  546100      
008545     MOVE "TR"                            TO A00-R03-S028-CVEREG  546200      
008546                                                                  546300      
008547     MOVE W77-MOVSXTERM-NUMREG           TO A00-R03-S028-TOTREG   546400      
008548     MOVE W77-MOVSXTERM-CARGOS           TO A00-R03-S028-TOTCAR   546500      
008549     MOVE W77-MOVSXTERM-ABONOS           TO A00-R03-S028-TOTABO   546600      
008550     WRITE REG-MOVSXTERM FROM A00-R03-TRAILER-S028 INVALID KEY    546700      
008551           MOVE "O"                       TO TIPO-LJ              546800      
008552           MOVE 010105                    TO CODIGO-LJ            546900      
008553           MOVE "ERROR EN WRITE, TRAILER ARCHIVO MOVSXTERM1 "     547000      
008554                                          TO TEXTO-LJ             547100      
008555           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ.    547200      
008556                                                                  547300      
008557     CLOSE MOVSXTERM LOCK.                                        547400      
008558                                                                  547500      
008559 39500-IMPRIME-DEMAS.                                             547600      
008560*--------------------                                             547700      
008561                                                                  547800      
008562    IF WKS-BAN-NODO(W77-IND3) = 0   AND WKS-TAB-NODO(W77-IND3) > 0547900      
008563       MOVE WKS-TAB-NODO(W77-IND3)  TO      WKS-IMPRESION-NODO    548000      
008564       MOVE ZEROS                 TO      WKS-IMPRESION-SUBNODO   548100      
008565       MOVE 2                     TO      WKS-NUM-BACKUP          548200      
008566                                          WKS-TT-NUM-BACK         548300      
008567       MOVE "MOVSXCAJA"           TO      WKS-NOMBRE-BACKUP       548400      
008568                                          WKS-TT-NOMBRE-BACK      548500      
008569       CHANGE ATTRIBUTE TITLE OF BITACORA TO WKS-TIT-BITACORA     548600      
008570       MOVE WKS-TT-NOMB-BACKUP    TO      WSR-RB-E1-NOMB-REPORTE  548700      
008571       OPEN OUTPUT BITACORA                                       548800      
008572                                                                  548900      
008573       PERFORM 31110-IMPRIME-ENCABEZADO                           549000      
008574       WRITE REG-BITACORA FROM WKS-TITULO-NO-INFORMACION AFTER 22 549100      
008575                                                                  549200      
008576       CLOSE BITACORA WITH SAVE.                                  549300      
008577                                                                  549400      
008578    MOVE ZEROS                    TO      WKS-NUM-HOJAS,          549500      
008579                                          WKS-TOTAL-HOJAS.        549600      
008580                                                                  549700      
008581**********************************************************        549800      
008582*                   TOTALES POR CLAVE                    *        549900      
008583**********************************************************        550000      
008584 35000-GENERA-TOTXCVE.                                            550100      
008585*=====================                                            550200      
008586     OPEN INPUT CVETRAN                                           550205      
008587         COMPUTE W77-FRAMESIZE        =                           550210      
008588            (ATTRIBUTE FRAMESIZE  OF CVETRAN)                     550215      
008589         COMPUTE W77-MAXRECSIZE       =                           550220      
008590            (ATTRIBUTE MAXRECSIZE OF CVETRAN)                     550225      
008591         COMPUTE W77-LASTRECORD       =                           550230      
008592            (ATTRIBUTE LASTRECORD OF CVETRAN                      550235      
008593                                  +   1)                          550240      
008594         CLOSE CVETRAN SAVE                                       550245      
008595         PERFORM                      70000-CALCULA-ESPACIO       550250      
008596     SORT SMOVCONTABLES   ON ASCENDING KEY                        550300      
008597          SRMC-LIBRO                                              550400      
008598          SRMC-MONEDA                                             550500      
008599          SRMC-TIPOCRED                                           550600      
008600          SRMC-CVETRAN                                            550700      
008601          SRMC-TM                                                 550800      
008602          SRMC-EVENTO                                             550900      
008603          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    551000      
008604          DISK SIZE IS W77-DISK-SIZE   WORDS                      551100      
008605          USING CVETRAN                                           551200      
008606          GIVING CVETRAN.                                         551300      
008607                                                                  551400      
008608     MOVE 0       TO      W77-EOF                                 551500      
008609     MOVE "/004S151TOTCVE."       TO WKS-LEY-RECHA                551600      
008610     MOVE "C"                     TO WKS-C-RECHA                  551700      
008611     SET V00-REP-CVES(USERBACKUPNAME)                             551800      
008612                                  TO VALUE TRUE                   551900      
008613     CHANGE ATTRIBUTE TITLE OF V00-REP-CVES TO                    552000      
008614                                     WKS-TIT-RECHAZOS.            552100      
008615                                                                  552200      
008616     OPEN OUTPUT V00-REP-CVES.                                    552300      
008617     OPEN OUTPUT TOTCVETRAN                                       552400      
008618     OPEN INPUT  CVETRAN.                                         552500      
008619     READ CVETRAN AT END MOVE 1 TO W77-EOF.                       552600      
008620     MOVE 0       TO WKS-NUM-HOJAS                                552700      
008621     IF W77-EOF = 0                                               552800      
008622        MOVE 56 TO        W77-NUM-LINEAS                          552900      
008623        PERFORM 36000-LEE-TOTXCVE UNTIL W77-EOF = 1               553000      
008624     ELSE                                                         553100      
008625        MOVE 1             TO   WKS-NUM-HOJAS                     553200      
008626        MOVE WKS-NUM-HOJAS  TO  WSR-RC-E3-HOJA                    553300      
008627        WRITE V00-R00-CVES FROM WLI-TIT1-RESUM AFTER PAGE         553400      
008628        WRITE V00-R00-CVES FROM WLI-TIT2-RESUM                    553500      
008629        WRITE V00-R00-CVES FROM WKS-TIT3-CUADCON                  553600      
008630        MOVE SPACES       TO      V00-R00-CVES                    553700      
008631        WRITE V00-R00-CVES                                        553800      
008632        MOVE "                              NO HUBO INFORMACION " 553900      
008633                          TO    V00-R00-CVES                      554000      
008634        WRITE V00-R00-CVES.                                       554100      
008635                                                                  554200      
008636     CLOSE CVETRAN      WITH SAVE.                                554300      
008637     CLOSE V00-REP-CVES WITH SAVE.                                554400      
008638     CLOSE TOTCVETRAN   WITH SAVE.                                554500      
008639***************************************************               554600      
008640*           TOTALES POR CLAVE PARA MERCATOR       *               554700      
008641***************************************************               554800      
008642     OPEN INPUT CVETRAN                                           554805      
008643         COMPUTE W77-FRAMESIZE        =                           554810      
008644            (ATTRIBUTE FRAMESIZE  OF CVETRAN)                     554815      
008645         COMPUTE W77-MAXRECSIZE       =                           554820      
008646            (ATTRIBUTE MAXRECSIZE OF CVETRAN)                     554825      
008647         COMPUTE W77-LASTRECORD       =                           554830      
008648            (ATTRIBUTE LASTRECORD OF CVETRAN                      554835      
008649                                  +   1)                          554840      
008650         CLOSE CVETRAN SAVE                                       554845      
008651         PERFORM                      70000-CALCULA-ESPACIO       554850      
008652     SORT SMOVCONTABLES   ON ASCENDING KEY                        554900      
008653          SRMC-NPROCESO                                           555000      
008654          SRMC-LIBRO                                              555100      
008655          SRMC-MONEDA                                             555200      
008656          SRMC-SUC-PROM                                           555300      
008657          SRMC-FID                                                555400      
008658          SRMC-TIPOCRED                                           555500      
008659          SRMC-FONDO                                              555600      
008660          SRMC-TIPOCON                                            555700      
008661          SRMC-CVETRAN                                            555800      
008662          SRMC-TM                                                 555900      
008663          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    556000      
008664          DISK SIZE IS W77-DISK-SIZE   WORDS                      556100      
008665          USING CVETRAN                                           556200      
008666          GIVING CVETRAN.                                         556300      
008667                                                                  556400      
008668     MOVE 0                       TO W77-EOF WKS-NUM-HOJAS        556500      
008669     MOVE "/005S151TOTPRO."       TO WKS-LEY-PROCESP              556600      
008670     MOVE "C"                     TO WKS-C-PROCESP                556700      
008671     SET V00-REP-PROC(USERBACKUPNAME)                             556800      
008672                                  TO VALUE TRUE                   556900      
008673     CHANGE ATTRIBUTE TITLE OF V00-REP-PROC TO                    557000      
008674                                     WKS-TIT-TOTPROC.             557100      
008675                                                                  557200      
008676     IF W88-SIST-INTELAR                                          557300      
008677        IF W77-SISTEMA-PARAM = 252                                557310      
008678           CHANGE ATTRIBUTE TITLE OF CVEMARCATOR                  557320      
008679                                  TO WKS-TIT-INTELAR              557322      
008680        ELSE                                                      557324      
008681           CHANGE ATTRIBUTE TITLE OF CVEMARCATOR                  557326      
008682                                  TO WKS-TIT-INTELAR-600          557328      
008683     ELSE                                                         557340      
008684        CHANGE ATTRIBUTE TITLE OF CVEMARCATOR TO WKS-TIT-MERCATOR.557360      
008685                                                                  557380      
008686     OPEN OUTPUT CVEMARCATOR.                                     557400      
008687     OPEN OUTPUT V00-REP-PROC.                                    557500      
008688     OPEN INPUT  CVETRAN.                                         557600      
008689     READ CVETRAN AT END MOVE 1   TO W77-EOF.                     557700      
008690*    IF W77-SISTEMA-PARAM NOT = 252                               557800      
008691        PERFORM 37000-INICIA-MARCATOR.                            557900      
008692                                                                  558000      
008693     IF W77-EOF = 0                                               558100      
008694        MOVE 56   TO        W77-NUM-LINEAS                        558200      
008695        PERFORM 37100-LEE-TOTXCVE UNTIL W77-EOF = 1               558300      
008696        PERFORM 37300-GRABA-TR-MERCATOR                           558400      
008697     ELSE                                                         558500      
008698        MOVE 0    TO  A00-R03-MERC-TOTREG,A00-R03-MERC-TOTIMP     558600      
008699        PERFORM 37300-GRABA-TR-MERCATOR.                          558700      
008700     IF WKS-IMP-TOTPRO = 0                                        558800      
008701        MOVE WKS-NUM-HOJAS TO     WSR-RC-E3-HOJA                  558900      
008702        WRITE V00-R00-PROC FROM   WLI-TIT1-PROCE AFTER PAGE       559000      
008703        WRITE V00-R00-PROC FROM   WLI-TIT2-PROCE                  559100      
008704        WRITE V00-R00-PROC FROM   WKS-TIT3-CUADCON                559200      
008705        MOVE SPACES        TO     V00-R00-PROC                    559300      
008706        WRITE V00-R00-PROC                                        559400      
008707        MOVE "                              NO HUBO INFORMACION " 559500      
008708                           TO     V00-R00-PROC                    559600      
008709        WRITE V00-R00-PROC.                                       559700      
008710                                                                  559800      
008711     CLOSE CVETRAN        WITH    SAVE.                           559900      
008712*                                                                 560000      
008713     CLOSE CVEMARCATOR WITH    SAVE.                              560200      
008714                                                                  560210      
008715     IF W88-SIST-INTELAR-252                                      560211      
008716        MOVE SPACES                   TO WKS-INTE-ARCHIVO         560213      
008717        UNSTRING WKS-TIT-INTELAR DELIMITED BY "."                 560214      
008718        INTO     WKS-INTE-ARCHIVO                                 560234      
008719        PERFORM 35100-ENVIO-INTELAR                               560254      
008720     ELSE                                                         560259      
008721        MOVE SPACES                   TO WKS-INTE-ARCHIVO         560264      
008722        UNSTRING WKS-TIT-INTELAR-600 DELIMITED BY "."             560269      
008723        INTO     WKS-INTE-ARCHIVO                                 560274      
008724        PERFORM 35100-ENVIO-INTELAR.                              560279      
008725                                                                  560284      
008726                                                                  560300      
008727     CLOSE V00-REP-PROC   WITH    SAVE.                           560400      
008728                                                                  560500      
008729 35100-ENVIO-INTELAR.                                             560502      
008730*====================                                             560504      
008731     CALL "INTELARSND IN ADMONXFERS" USING  WKS-INTE-ARCHIVO      560508      
008732                                     GIVING W77-INTE-SNT.         560510      
008733     MOVE W77-INTE-SNT             TO WKS-ERROR-INTELAR.          560511      
008734     MOVE WKS-ERROR-INTELAR        TO WKS-ERR-INTELAR  .          560512      
008735     IF W77-INTE-SNT = 0                                          560513      
008736        NEXT SENTENCE                                             560514      
008737     ELSE                                                         560516      
008738        MOVE SPACES                TO MENSAJE-LJ                  560518      
008739        MOVE "E"                   TO TIPO-LJ                     560520      
008740        MOVE 020901                TO CODIGO-LJ                   560522      
008741        STRING "ERROR # " WKS-ERR-INTELAR                         560524      
008742               " EN EL ENVIO DEL ARCHIVO "                        560525      
008743               WKS-INTE-ARCHIVO                                   560526      
008744               " AL ALFA"                                         560528      
008745        DELIMITED BY SIZE                                         560530      
008746        INTO TEXTO-LJ                                             560532      
008747        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      560534      
008748                                                                  560536      
008749 36000-LEE-TOTXCVE.                                               560600      
008750*==================                                               560700      
008751     MOVE 0               TO      W77-IMPMOV , W77-NUMMOV         560800      
008752     MOVE RMC-LIBRO       TO      WKS-LIBRO-ANT                   560900      
008753     MOVE RMC-MONEDA      TO      WKS-MON-ANT                     561000      
008754     MOVE RMC-TIPOCRED    TO      WKS-TC-ANT                      561100      
008755     MOVE RMC-EVENTO      TO      WKS-EVE-ANT                     561200      
008756     MOVE RMC-CVETRAN     TO      WKS-CVE-ANT                     561300      
008757     MOVE RMC-TM          TO      WKS-TM-ANT                      561400      
008758     PERFORM 36100-ACUMULA UNTIL                                  561500      
008759             RMC-LIBRO    NOT = WKS-LIBRO-ANT     OR              561600      
008760             RMC-MONEDA   NOT = WKS-MON-ANT       OR              561700      
008761             RMC-TIPOCRED NOT = WKS-TC-ANT        OR              561800      
008762             RMC-CVETRAN  NOT = WKS-CVE-ANT       OR              561900      
008763             RMC-TM       NOT = WKS-TM-ANT        OR              562000      
008764             RMC-EVENTO   NOT = WKS-EVE-ANT       OR              562100      
008765             W77-EOF          = 1.                                562200      
008766     PERFORM 36200-IMPRIME-TOTXCVE.                               562300      
008767                                                                  562400      
008768 36100-ACUMULA.                                                   562500      
008769*==============                                                   562600      
008770     ADD 1            TO  W77-NUMMOV                              562700      
008771     ADD RMC-IMPORTE  TO  W77-IMPMOV.                             562800      
008772     READ CVETRAN AT END MOVE 1 TO W77-EOF.                       562900      
008773                                                                  563000      
008774 36200-IMPRIME-TOTXCVE.                                           563100      
008775*======================                                           563200      
008776     IF W77-NUM-LINEAS > 55                                       563300      
008777        PERFORM 36300-IMP-ENCABEZADO.                             563400      
008778                                                                  563500      
008779     MOVE WKS-LIBRO-ANT   TO      WLI-LIBRO,WKS-CVE-LIBRO         563600      
008780     MOVE WKS-MON-ANT     TO      WLI-MONEDA,WKS-CVE-MONEDA       563700      
008781     MOVE WKS-TC-ANT      TO      WLI-TC,WKS-CVE-TC               563800      
008782     MOVE WKS-EVE-ANT     TO      WLI-EVENTO,WKS-EVENTO           563900      
008783     MOVE WKS-CVE-ANT     TO      WLI-CVET,WKS-CVE-CVET           564000      
008784     MOVE WKS-TM-ANT      TO      WLI-TM,WKS-CVE-TM               564100      
008785     MOVE W77-IMPMOV      TO      WLI-IMPC,WKS-CVE-IMPC           564200      
008786     MOVE W77-NUMMOV      TO      WLI-NUMC,WKS-CVE-NUMC           564300      
008787     MOVE 0 TO W77-AFECS254,W77-NATS028,W77-CVEEXISTE.            564400      
008788     MOVE SPACES TO WLI-NOMBRE, WLI-AFECS028,WKS-CVE-AFECS028,    564500      
008789                    WLI-AFECS115, WKS-CVE-AFECS115,WKS-CVE-NOMBRE,564600      
008790                    WLI-AST.                                      564700      
008791                                                                  564800      
008792     MOVE WKS-PT-EXISTE (WKS-CVE-ANT,WKS-TM-ANT) TO W77-CVEEXISTE 564900      
008793     MOVE WKS-PT-NATS028(WKS-CVE-ANT,WKS-TM-ANT) TO W77-NATS028   565000      
008794     MOVE WKS-PT-INDS254(WKS-CVE-ANT,WKS-TM-ANT) TO W77-AFECS254  565100      
008795     MOVE WKS-PT-NUM-LEYEN(WKS-CVE-ANT,WKS-TM-ANT) TO W77-IND     565200      
008796                                                                  565300      
008797     IF W77-CVEEXISTE = 1                                         565400      
008798        IF W77-IND > 9000                                         565500      
008799           COMPUTE W77-IND = W77-IND - 9000                       565600      
008800           MOVE WKS-LEYENDA-TRANS4(W77-IND)                       565700      
008801                          TO      WLI-NOMBRE,WKS-CVE-NOMBRE       565800      
008802        ELSE                                                      565900      
008803           IF W77-IND > 6000                                      566000      
008804              COMPUTE W77-IND = W77-IND - 6000                    566100      
008805              MOVE WKS-LEYENDA-TRANS3(W77-IND)                    566200      
008806                          TO      WLI-NOMBRE,WKS-CVE-NOMBRE       566300      
008807           ELSE                                                   566400      
008808              IF W77-IND > 3000                                   566500      
008809                 COMPUTE W77-IND = W77-IND - 3000                 566600      
008810                 MOVE WKS-LEYENDA-TRANS2(W77-IND)                 566700      
008811                          TO      WLI-NOMBRE,WKS-CVE-NOMBRE       566800      
008812              ELSE                                                566900      
008813                 MOVE WKS-LEYENDA-TRANS1(W77-IND)                 567000      
008814                          TO      WLI-NOMBRE,WKS-CVE-NOMBRE       567100      
008815     ELSE                                                         567200      
008816       MOVE "*"           TO      WLI-AST                         567300      
008817       MOVE "CLAVE INEXISTENTE  " TO WLI-NOMBRE,WKS-CVE-NOMBRE.   567400      
008818                                                                  567500      
008819     IF W77-CVEEXISTE = 1                                         567600      
008820        IF W77-NATS028 = 1                                        567700      
008821           MOVE "CAR" TO WLI-AFECS028, WKS-CVE-AFECS028           567800      
008822        ELSE                                                      567900      
008823        IF W77-NATS028 = 2                                        568000      
008824           MOVE "ABO" TO WLI-AFECS028, WKS-CVE-AFECS028           568100      
008825        ELSE                                                      568200      
008826        IF W77-NATS028 = 9                                        568300      
008827           MOVE "N/C" TO WLI-AFECS028, WKS-CVE-AFECS028           568400      
008828        ELSE                                                      568500      
008829           MOVE SPACES TO WLI-AFECS028, WKS-CVE-AFECS028          568600      
008830     ELSE                                                         568700      
008831        MOVE SPACES    TO WLI-AFECS028, WKS-CVE-AFECS028.         568800      
008832                                                                  568900      
008833     IF W77-CVEEXISTE = 1                                         569000      
008834        IF W77-AFECS254 = 2                                       569100      
008835           MOVE "SI" TO WLI-AFECS115, WKS-CVE-AFECS115            569200      
008836        ELSE                                                      569300      
008837           MOVE "NO" TO WLI-AFECS115, WKS-CVE-AFECS115            569400      
008838     ELSE                                                         569500      
008839        MOVE SPACES  TO WLI-AFECS115, WKS-CVE-AFECS115.           569600      
008840                                                                  569700      
008841     WRITE V00-R00-CVES   FROM WLI-DET-CVE.                       569800      
008842     WRITE REG-TOTCVETRAN FROM WKS-DET-CVES.                      569900      
008843     ADD 1 TO W77-NUM-LINEAS.                                     570000      
008844                                                                  570100      
008845 36300-IMP-ENCABEZADO.                                            570200      
008846*====================                                             570300      
008847    ADD  1                TO      WKS-NUM-HOJAS                   570400      
008848    MOVE WKS-NUM-HOJAS    TO      WSR-RC-E3-HOJA                  570500      
008849    WRITE V00-R00-CVES    FROM    WLI-TIT1-RESUM  AFTER PAGE.     570600      
008850    WRITE V00-R00-CVES    FROM    WLI-TIT2-RESUM                  570700      
008851    WRITE V00-R00-CVES    FROM    WKS-TIT3-CUADCON                570800      
008852    MOVE SPACES           TO      V00-R00-CVES                    570900      
008853    WRITE V00-R00-CVES                                            571000      
008854    IF W88-SIST-CRED                                              571100      
008855       WRITE V00-R00-CVES    FROM    WLI-TIT5-CVES                571200      
008856     ELSE                                                         571300      
008857        WRITE V00-R00-CVES   FROM    WLI-TIT5-CVES-NCRED.         571400      
008858    MOVE SPACES           TO      V00-R00-CVES                    571500      
008859    WRITE V00-R00-CVES.                                           571600      
008860    MOVE 6 TO W77-NUM-LINEAS.                                     571700      
008861                                                                  571800      
008862 37000-INICIA-MARCATOR.                                           571900      
008863*======================                                           572000      
008864    MOVE 01               TO      A00-R00-MERC-VERSION.           572100      
008865    MOVE WKS-HORA-HHMM    TO      A00-R00-MERC-HH-CREA.           572200      
008866    MOVE WKS-MINU-HHMM    TO      A00-R00-MERC-MM-CREA.           572300      
008867    MOVE ZEROS            TO      A00-R00-FILLER.                 572400      
008868    WRITE REG-CVEMERCATOR FROM    A00-R00-HDR-MERC.               572500      
008869                                                                  572600      
008870 37100-LEE-TOTXCVE.                                               572700      
008871*==================                                               572800      
008872     MOVE 0               TO      W77-IMPMOV , W77-NUMMOV         572900      
008873     MOVE RMC-NPROCESO    TO      WKS-NPROCESO-ANT                573000      
008874     MOVE RMC-LIBRO       TO      WKS-LIBRO-ANT                   573100      
008875     MOVE RMC-MONEDA      TO      WKS-MON-ANT                     573200      
008876     MOVE RMC-SUC-PROM    TO      WKS-SUC-ANT                     573300      
008877     MOVE RMC-FID         TO      WKS-FID-ANT                     573400      
008878     MOVE RMC-TIPOCRED    TO      WKS-TC-ANT                      573500      
008879     MOVE RMC-FONDO       TO      WKS-FONDO-ANT                   573600      
008880     MOVE RMC-TIPOCON     TO      WKS-TIPOCON-ANT                 573700      
008881     MOVE RMC-CVETRAN     TO      WKS-CVE-ANT                     573800      
008882     MOVE RMC-TM          TO      WKS-TM-ANT                      573900      
008883     PERFORM 36100-ACUMULA UNTIL                                  574000      
008884             RMC-NPROCESO NOT = WKS-NPROCESO-ANT  OR              574100      
008885             RMC-LIBRO    NOT = WKS-LIBRO-ANT     OR              574200      
008886             RMC-MONEDA   NOT = WKS-MON-ANT       OR              574300      
008887             RMC-SUC-PROM NOT = WKS-SUC-ANT       OR              574400      
008888             RMC-FID      NOT = WKS-FID-ANT       OR              574500      
008889             RMC-TIPOCRED NOT = WKS-TC-ANT        OR              574600      
008890             RMC-FONDO    NOT = WKS-FONDO-ANT     OR              574700      
008891             RMC-TIPOCON  NOT = WKS-TIPOCON-ANT   OR              574800      
008892             RMC-CVETRAN  NOT = WKS-CVE-ANT       OR              574900      
008893             RMC-TM       NOT = WKS-TM-ANT        OR              575000      
008894             W77-EOF          = 1.                                575100      
008895*    IF W77-SISTEMA-PARAM NOT = 252                               575200      
008896        PERFORM 37200-GRABA-MERCATOR.                             575300      
008897     MOVE WKS-NPROCESO-ANT  TO W77-NPROCESO                       575400      
008898     IF W88-NPROCESO                                              575500      
008899        MOVE      1         TO WKS-IMP-TOTPRO                     575600      
008900        PERFORM 38100-IMPRIME-TOTXPRO.                            575700      
008901                                                                  575800      
008902     MOVE 0                 TO      W77-IMPMOV                    575900      
008903     MOVE RMC-NPROCESO      TO      WKS-NPROCESO-ANT              576000      
008904     MOVE RMC-LIBRO         TO      WKS-LIBRO-ANT                 576100      
008905     MOVE RMC-MONEDA        TO      WKS-MON-ANT                   576200      
008906     MOVE RMC-SUC-PROM      TO      WKS-SUC-ANT                   576300      
008907     MOVE RMC-FID           TO      WKS-FID-ANT                   576400      
008908     MOVE RMC-TIPOCRED      TO      WKS-TC-ANT                    576500      
008909     MOVE RMC-FONDO         TO      WKS-FONDO-ANT                 576600      
008910     MOVE RMC-TIPOCON       TO      WKS-TIPOCON-ANT               576700      
008911     MOVE RMC-CVETRAN       TO      WKS-CVE-ANT                   576800      
008912     MOVE RMC-TM            TO      WKS-TM-ANT.                   576900      
008913                                                                  577000      
008914 37200-GRABA-MERCATOR.                                            577100      
008915*=====================                                            577200      
008916     MOVE WKS-NPROCESO-ANT  TO      A00-R01-MERC-CVE-REG          577300      
008917     MOVE WKS-LIBRO-ANT     TO      A00-R01-MERC-LIBRO            577400      
008918     MOVE WKS-MON-ANT       TO      A00-R01-MERC-MONEDA           577500      
008919     MOVE WKS-SUC-ANT       TO      A00-R01-MERC-SUC              577600      
008920     IF   W88-SIST-CRED                                           577700      
008921          MOVE WKS-FID-ANT  TO      A00-R01-MERC-FIDEICOMISO      577800      
008922     ELSE                                                         577900      
008923          MOVE ZEROS        TO      A00-R01-MERC-FIDEICOMISO.     578000      
008924     MOVE WKS-TC-ANT        TO      A00-R01-MERC-PROD-TC          578100      
008925     MOVE WKS-FONDO-ANT     TO      A00-R01-MERC-INST-FONDO       578200      
008926     IF W77-SISTEMA-PARAM = 403                                   578300      
008927        MOVE WKS-TIPOCON-ANT TO     A00-R01-MERC-TIP-TRA          578400      
008928     ELSE                                                         578500      
008929        MOVE ZEROES          TO     A00-R01-MERC-TIP-TRA.         578600      
008930     MOVE WKS-CVE-ANT       TO      A00-R01-MERC-CVE              578700      
008931     MOVE WKS-TM-ANT        TO      A00-R01-MERC-TM               578800      
008932     MOVE WKS-FECHA-PROCESO TO      A00-R01-MERC-FECHA            578900      
008933     MOVE W77-IMPMOV        TO      A00-R01-MERC-IMPORTE          579000      
008934*    MOVE ZEROES            TO      A00-R01-MERC-TIP-TRA          579100      
008935     MOVE ZEROES            TO      A00-R01-MERC-TIP-AUX          579200      
008936                                    A00-R01-MERC-FOL-AUX          579300      
008937                                    A00-R01-MERC-NUM-AUX          579400      
008938                                    A00-R01-MERC-CVE-AUT          579500      
008939                                    A00-R01-MERC-FEC-PART         579600      
008940                                    A00-R01-MERC-SDO-AUX          579700      
008941     MOVE SPACES            TO      A00-R01-MERC-DES-AUX          579800      
008942                                    A00-R01-MERC-SIG-SAUX         579900      
008943     MOVE ZEROS             TO      A00-R01-FILLER.               580000      
008944                                                                  580020      
008945     IF W77-SISTEMA-PARAM = 600                                   580025      
008946        PERFORM  37225-ELIM-MV-AM                                 580030      
008947     ELSE                                                         580035      
008948     IF WKS-PT-INDS254(WKS-CVE-ANT,WKS-TM-ANT) = 2                580050      
008949        PERFORM  37250-GRABA-MV-MERCATOR.                         580060      
008950                                                                  580075      
008951 37225-ELIM-MV-AM.                                                580080      
008952*=================                                                580085      
008953      IF WKS-PT-INDS254(WKS-CVE-ANT,WKS-TM-ANT) = 1               580095      
008954         IF WKS-PT-INDAM(WKS-CVE-ANT,WKS-TM-ANT) = 2              580100      
008955            NEXT SENTENCE                                         580105      
008956*    DISPLAY WKS-PT-INDS254(WKS-CVE-ANT,WKS-TM-ANT)" "WKS-CVE-ANT 580106      
008957*    " "WKS-PT-INDAM(WKS-CVE-ANT,WKS-TM-ANT)" " WKS-TM-ANT        580107      
008958         ELSE                                                     580110      
008959            PERFORM  37250-GRABA-MV-MERCATOR                      580120      
008960      ELSE                                                        580130      
008961            PERFORM  37250-GRABA-MV-MERCATOR.                     580140      
008962                                                                  580150      
008963 37250-GRABA-MV-MERCATOR.                                         580160      
008964*=================                                                580180      
008965        WRITE REG-CVEMERCATOR FROM  A00-R01-MERC-REGMOV           580200      
008966        ADD 1               TO      A00-R03-MERC-TOTREG           580300      
008967        ADD W77-IMPMOV      TO      A00-R03-MERC-TOTIMP.          580400      
008968                                                                  580500      
008969 37300-GRABA-TR-MERCATOR.                                         580600      
008970*========================                                         580700      
008971*    IF W77-SISTEMA-PARAM NOT = 252                               580800      
008972        MOVE ZEROS          TO      A00-R03-FILLER                580900      
008973        WRITE REG-CVEMERCATOR FROM A00-R03-MERC-TRAILER.          581000      
008974                                                                  581100      
008975 38100-IMPRIME-TOTXPRO.                                           581200      
008976*======================                                           581300      
008977                                                                  581400      
008978     IF W77-NUM-LINEAS > 55                                       581500      
008979        PERFORM 38200-IMP-ENCABEZADO.                             581600      
008980                                                                  581700      
008981     MOVE WKS-LIBRO-ANT   TO      WLI-LIBRO,WKS-CVE-LIBRO         581800      
008982     MOVE WKS-MON-ANT     TO      WLI-MONEDA,WKS-CVE-MONEDA       581900      
008983     MOVE WKS-TC-ANT      TO      WLI-TC,WKS-CVE-TC               582000      
008984     MOVE WKS-EVE-ANT     TO      WLI-EVENTO,WKS-EVENTO           582100      
008985     MOVE WKS-CVE-ANT     TO      WLI-CVET,WKS-CVE-CVET           582200      
008986     MOVE WKS-TM-ANT      TO      WLI-TM,WKS-CVE-TM               582300      
008987     MOVE W77-IMPMOV      TO      WLI-IMPC,WKS-CVE-IMPC           582400      
008988     MOVE W77-NUMMOV      TO      WLI-NUMC,WKS-CVE-NUMC           582500      
008989     MOVE 0 TO W77-AFECS254,W77-NATS028,W77-CVEEXISTE.            582600      
008990     MOVE SPACES TO WLI-NOMBRE, WLI-AFECS028,WKS-CVE-AFECS028,    582700      
008991                    WLI-AFECS115, WKS-CVE-AFECS115,WKS-CVE-NOMBRE,582800      
008992                    WLI-AST.                                      582900      
008993                                                                  583000      
008994     MOVE WKS-PT-EXISTE (WKS-CVE-ANT,WKS-TM-ANT) TO W77-CVEEXISTE 583100      
008995     MOVE WKS-PT-NATS028(WKS-CVE-ANT,WKS-TM-ANT) TO W77-NATS028   583200      
008996     MOVE WKS-PT-INDS254(WKS-CVE-ANT,WKS-TM-ANT) TO W77-AFECS254  583300      
008997     MOVE WKS-PT-NUM-LEYEN(WKS-CVE-ANT,WKS-TM-ANT) TO W77-IND     583400      
008998                                                                  583500      
008999     IF W77-CVEEXISTE = 1                                         583600      
009000        IF W77-IND > 9000                                         583700      
009001           COMPUTE W77-IND = W77-IND - 9000                       583800      
009002           MOVE WKS-LEYENDA-TRANS4(W77-IND)                       583900      
009003                          TO      WLI-NOMBRE,WKS-CVE-NOMBRE       584000      
009004        ELSE                                                      584100      
009005           IF W77-IND > 6000                                      584200      
009006              COMPUTE W77-IND = W77-IND - 6000                    584300      
009007              MOVE WKS-LEYENDA-TRANS3(W77-IND)                    584400      
009008                          TO      WLI-NOMBRE,WKS-CVE-NOMBRE       584500      
009009           ELSE                                                   584600      
009010              IF W77-IND > 3000                                   584700      
009011                 COMPUTE W77-IND = W77-IND - 3000                 584800      
009012                 MOVE WKS-LEYENDA-TRANS2(W77-IND)                 584900      
009013                          TO      WLI-NOMBRE,WKS-CVE-NOMBRE       585000      
009014              ELSE                                                585100      
009015                 MOVE WKS-LEYENDA-TRANS1(W77-IND)                 585200      
009016                          TO      WLI-NOMBRE,WKS-CVE-NOMBRE       585300      
009017     ELSE                                                         585400      
009018       MOVE "*"           TO      WLI-AST                         585500      
009019       MOVE "CLAVE INEXISTENTE  " TO WLI-NOMBRE,WKS-CVE-NOMBRE.   585600      
009020                                                                  585700      
009021     IF W77-CVEEXISTE = 1                                         585800      
009022        IF W77-NATS028 = 1                                        585900      
009023           MOVE "CAR" TO WLI-AFECS028, WKS-CVE-AFECS028           586000      
009024        ELSE                                                      586100      
009025        IF W77-NATS028 = 2                                        586200      
009026           MOVE "ABO" TO WLI-AFECS028, WKS-CVE-AFECS028           586300      
009027        ELSE                                                      586400      
009028        IF W77-NATS028 = 9                                        586500      
009029           MOVE "N/C" TO WLI-AFECS028, WKS-CVE-AFECS028           586600      
009030        ELSE                                                      586700      
009031           MOVE SPACES TO WLI-AFECS028, WKS-CVE-AFECS028          586800      
009032     ELSE                                                         586900      
009033        MOVE SPACES    TO WLI-AFECS028, WKS-CVE-AFECS028.         587000      
009034                                                                  587100      
009035     IF W77-CVEEXISTE = 1                                         587200      
009036        IF W77-AFECS254 = 2                                       587300      
009037           MOVE "SI" TO WLI-AFECS115, WKS-CVE-AFECS115            587400      
009038        ELSE                                                      587500      
009039           MOVE "NO" TO WLI-AFECS115, WKS-CVE-AFECS115            587600      
009040     ELSE                                                         587700      
009041        MOVE SPACES  TO WLI-AFECS115, WKS-CVE-AFECS115.           587800      
009042                                                                  587900      
009043     WRITE V00-R00-PROC FROM WLI-DET-CVE.                         588000      
009044     ADD 1 TO W77-NUM-LINEAS.                                     588100      
009045                                                                  588200      
009046     IF RMC-NPROCESO      NOT = WKS-NPROCESO-ANT                  588300      
009047        MOVE 0            TO    W77-NUM-LINEAS                    588400      
009048        MOVE RMC-NPROCESO TO    WKS-NPROCESO-ANT                  588500      
009049        PERFORM 38200-IMP-ENCABEZADO.                             588600      
009050                                                                  588700      
009051 38200-IMP-ENCABEZADO.                                            588800      
009052*====================                                             588900      
009053    ADD  1                TO   WKS-NUM-HOJAS                      589000      
009054    MOVE WKS-NPROCESO-ANT TO   WSR-CORTE-NUM-PROCESO.             589100      
009055    MOVE WKS-NUM-HOJAS    TO   WSR-RC-E3-HOJA                     589200      
009056    WRITE V00-R00-PROC    FROM WLI-TIT1-PROCE  AFTER PAGE.        589300      
009057    WRITE V00-R00-PROC    FROM WLI-TIT2-PROCE                     589400      
009058    WRITE V00-R00-PROC    FROM WKS-TIT3-CUADCON                   589500      
009059    WRITE V00-R00-PROC    FROM WSR-TITULO-CORTE-PROCESO AFTER 2   589600      
009060    MOVE SPACES           TO   V00-R00-PROC                       589700      
009061    WRITE V00-R00-PROC                                            589800      
009062    IF W88-SIST-CRED                                              589900      
009063       WRITE V00-R00-PROC    FROM    WLI-TIT5-CVES                590000      
009064     ELSE                                                         590100      
009065        WRITE V00-R00-PROC   FROM    WLI-TIT5-CVES-NCRED.         590200      
009066    MOVE SPACES           TO   V00-R00-PROC                       590300      
009067    WRITE V00-R00-PROC.                                           590400      
009068    MOVE 6                TO   W77-NUM-LINEAS.                    590500      
009069                                                                  590600      
009070 60000-GENERA-RECHAZOS.                                           590700      
009071*======================                                           590800      
009072     OPEN OUTPUT MOVCONERROR.                                     590900      
009073     CHANGE ATTRIBUTE TITLE OF LOGERR  TO WKS-TIT-LOGERR          591000      
009074     IF ATTRIBUTE RESIDENT  OF LOGERR = 1                         591100      
009075        PERFORM 60050-LEE-LOG-ERRORES.                            591200      
009076                                                                  591300      
009077     CLOSE MOVCONERROR WITH SAVE.                                 591400      
009078                                                                  591410      
009079     OPEN INPUT MOVCONERROR                                       591420      
009080         COMPUTE W77-FRAMESIZE        =                           591430      
009081            (ATTRIBUTE FRAMESIZE  OF MOVCONERROR)                 591440      
009082         COMPUTE W77-MAXRECSIZE       =                           591450      
009083            (ATTRIBUTE MAXRECSIZE OF MOVCONERROR)                 591460      
009084         COMPUTE W77-LASTRECORD       =                           591470      
009085            (ATTRIBUTE LASTRECORD OF MOVCONERROR                  591480      
009086                                  +   1)                          591490      
009087         CLOSE MOVCONERROR SAVE                                   591500      
009088         PERFORM                      70000-CALCULA-ESPACIO       591510      
009089     SORT SMOVCONERROR                                            591600      
009090          ON ASCENDING KEY                                        591700      
009091          SRE-PROD                                                591800      
009092          SRE-CONTRATO                                            591900      
009093          SRE-FOLIO                                               592000      
009094          SRE-ESQ                                                 592100      
009095          SRE-CVE                                                 592200      
009096          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    592300      
009097          DISK   SIZE IS W77-DISK-SIZE   WORDS                    592400      
009098       USING  MOVCONERROR                                         592500      
009099       GIVING MOVCONERROR.                                        592600      
009100                                                                  592700      
009101     MOVE "/003S151RECHAZOS."             TO WKS-LEY-RECHA        592800      
009102     MOVE "R"                             TO WKS-C-RECHA          592900      
009103     SET RECHAZOS(USERBACKUPNAME)         TO VALUE TRUE.          593000      
009104     OPEN OUTPUT RECHAZOS                                         593100      
009105     MOVE 0                               TO WKS-NUM-HOJAS        593200      
009106     MOVE "RECHAZOS"                      TO WKS-TC-NOMBRE-BACK   593300      
009107     MOVE 3                               TO WKS-TC-NUM-BACK      593400      
009108     MOVE "           MOVIMIENTOS RECHAZADOS POR EL S151"         593500      
009109                                          TO WSR-RP-E2-TITULO     593600      
009110     PERFORM 60300-IMP-ENCABEZADOS.                               593700      
009111                                                                  593800      
009112     OPEN INPUT MOVCONERROR.                                      593900      
009113     OPEN OUTPUT ERRORES                                          594000      
009114     MOVE ZEROS TO W77-EOF.                                       594100      
009115     READ MOVCONERROR AT END MOVE 1 TO W77-EOF.                   594200      
009116                                                                  594300      
009117     IF W77-EOF = 0                                               594400      
009118        PERFORM 60400-LEE-RECHAZOS UNTIL W77-EOF > 0              594500      
009119     ELSE                                                         594600      
009120        MOVE "   NO HUBO INFORMACION      "       TO              594700      
009121                                                  REG-RECHAZOS    594800      
009122     WRITE REG-RECHAZOS .                                         594900      
009123                                                                  595000      
009124     CLOSE RECHAZOS WITH SAVE.                                    595100      
009125     CLOSE MOVCONERROR WITH PURGE.                                595200      
009126                                                                  595300      
009127     MOVE ZERO                            TO WKS-REP-TMREC-VACIO. 595400      
009128                                                                  595500      
009129     MOVE "/007S151TOTRECHA."             TO WKS-LEY-RECHA        595600      
009130     MOVE "C"                             TO WKS-C-RECHA          595700      
009131     SET TOTRECHA(USERBACKUPNAME)         TO VALUE TRUE.          595800      
009132     OPEN OUTPUT TOTRECHA                                         595900      
009133     MOVE 0                               TO WKS-NUM-HOJAS        596000      
009134     MOVE "TOTRECHA"                      TO WKS-TC-NOMBRE-BACK   596100      
009135     MOVE 7                               TO WKS-TC-NUM-BACK      596200      
009136     MOVE "     TOTAL DE MOVIMIENTOS RECHAZADOS POR EL S151"      596300      
009137                                          TO WSR-RP-E2-TITULO     596400      
009138     PERFORM 60350-IMP-ENCABEZADOS.                               596500      
009139                                                                  596600      
009140     PERFORM 60600-IMP-TOTALES VARYING W77-IND FROM 1 BY 1        596700      
009141             UNTIL W77-IND > 14.                                  596800      
009142                                                                  596900      
009143     IF WKS-REP-TMREC-VACIO = 0                                   597000      
009144        WRITE REG-TOTRECHA        FROM WKS-TITULO-NO-INFORMACION  597100      
009145                                       AFTER 15.                  597200      
009146                                                                  597300      
009147     CLOSE TOTRECHA WITH SAVE.                                    597400      
009148     CLOSE ERRORES WITH SAVE.                                     597500      
009149                                                                  597600      
009150 60050-LEE-LOG-ERRORES.                                           597700      
009151*======================                                           597800      
009152     OPEN INPUT  LOGERR                                           597900      
009153     MOVE ZEROS TO W77-EOF.                                       598000      
009154     MOVE 1     TO W77-IND.                                       598100      
009155     READ LOGERR  INTO    WKS-ERR-HEADER AT END                   598200      
009156                  MOVE 1 TO W77-EOF.                              598300      
009157                                                                  598400      
009158     IF W77-EOF = 0                                               598500      
009159        PERFORM 60100-LEE-ERRORES UNTIL W77-EOF = 1.              598600      
009160                                                                  598700      
009161     CLOSE LOGERR WITH SAVE.                                      598800      
009162                                                                  598900      
009163 60100-LEE-ERRORES.                                               599000      
009164*==================                                               599100      
009165     READ LOGERR  INTO    WKS-ERR-DATOS  AT END                   599200      
009166                          MOVE 1 TO W77-EOF.                      599300      
009167                                                                  599400      
009168     IF W77-SISTEMA-PARAM = 403 AND WKS-ERR-IND-CONTA = 2         599500      
009169        MOVE ZEROS TO WKS-ERR-IND-CONTA.                          599600      
009170                                                                  599700      
009171     MOVE WKS-ERR-ESTATUS-ERR     TO      W77-ERR-STATUS.         599800      
009172     IF W77-EOF = 0 AND W88-ERR-STATUS                            599900      
009173        MOVE ZEROS                TO      W77-NOCVE               600000      
009174        MOVE WKS-ERR-IND-CONTA    TO      RE-LIBRO                600100      
009175        MOVE WKS-ERR-PRODUCTO     TO      RE-PROD                 600200      
009176        MOVE WKS-ERR-CONTRATO     TO      RE-CONTRATO             600300      
009177        MOVE WKS-ERR-FOLIO-S403   TO      RE-FOLIO                600400      
009178        MOVE WKS-ERR-AUTORIZA     TO      RE-AUTAPL               600500      
009179        MOVE WKS-ERR-MONEDA       TO      RE-MON                  600600      
009180        MOVE WKS-ERR-ESTATUS-ERR  TO      RE-TIPOERR              600700      
009181        MOVE WKS-ERR-SUCPROM      TO      RE-SUC-PROM             600800      
009182        MOVE WKS-ERR-SUCTRAN      TO      RE-SUC-TRAN             600900      
009183        MOVE WKS-ERR-AUT-S151     TO      RE-AUT-S151             601000      
009184        MOVE WKS-ERR-INSTRUMENTO  TO      RE-INSTRUMENTO          601100      
009185        PERFORM 60150-MUEVE-ERROR2                                601200      
009186        IF WKS-ERR-IND-CONTA = 1 OR 2                             601300      
009187           MOVE WKS-ERR-FIDEICO   TO      RE-FIDEICOMISO          601400      
009188           PERFORM 60200-GRABA-CVE VARYING W77-IND FROM 1 BY 1    601500      
009189                   UNTIL W77-IND  > 5 OR W77-NOCVE = 1            601600      
009190        ELSE                                                      601700      
009191           MOVE ZEROS             TO      RE-FIDEICOMISO          601800      
009192           PERFORM 60200-GRABA-CVE VARYING W77-IND FROM 1 BY 1    601900      
009193                   UNTIL W77-IND  > 5 OR W77-NOCVE = 1.           602000      
009194                                                                  602100      
009195 60150-MUEVE-ERROR2.                                              602200      
009196*===================                                              602300      
009197     IF WKS-ERR-ESTATUS-ERR = 1                                   602400      
009198        MOVE WKS-ERR-SISTEMA              TO      RE-ERROR2       602500      
009199     ELSE                                                         602600      
009200     IF WKS-ERR-ESTATUS-ERR = 2                                   602700      
009201        MOVE WKS-ERR-FUNCION              TO      RE-ERROR2       602800      
009202     ELSE                                                         602900      
009203     IF WKS-ERR-ESTATUS-ERR = 3                                   603000      
009204        MOVE ZEROS                        TO      RE-ERROR2       603100      
009205     ELSE                                                         603200      
009206     IF WKS-ERR-ESTATUS-ERR = 4                                   603300      
009207        MOVE WKS-ERR-FECCONT              TO      RE-ERROR2       603400      
009208     ELSE                                                         603500      
009209     IF WKS-ERR-ESTATUS-ERR = 5                                   603600      
009210        MOVE WKS-ERR-SUCPROM              TO      RE-ERROR2       603700      
009211     ELSE                                                         603800      
009212     IF WKS-ERR-ESTATUS-ERR = 6                                   603900      
009213        MOVE WKS-ERR-SUC-INIC             TO      RE-ERROR2       604000      
009214     ELSE                                                         604100      
009215     IF WKS-ERR-ESTATUS-ERR = 8                                   604200      
009216        MOVE WKS-ERR-AUT-AELIM-S151       TO      RE-ERROR2       604300      
009217     ELSE                                                         604400      
009218     IF WKS-ERR-ESTATUS-ERR = 9                                   604500      
009219        MOVE WKS-ERR-AUT-AELIM-S151       TO      RE-ERROR2       604600      
009220     ELSE                                                         604700      
009221     IF WKS-ERR-ESTATUS-ERR = 10                                  604800      
009222        MOVE WKS-ERR-ORIGEN               TO      RE-ERROR2       604900      
009223     ELSE                                                         605000      
009224     IF WKS-ERR-ESTATUS-ERR = 11                                  605100      
009225        MOVE WKS-ERR-FUNCION              TO      RE-ERROR2       605200      
009226     ELSE                                                         605300      
009227     IF WKS-ERR-ESTATUS-ERR = 12                                  605400      
009228        MOVE WKS-ERR-AUT-AELIM-S151       TO      RE-ERROR2       605500      
009229     ELSE                                                         605600      
009230     IF WKS-ERR-ESTATUS-ERR = 13                                  605700      
009231        MOVE WKS-ERR-AUT-AELIM-S151       TO      RE-ERROR2.      605800      
009232                                                                  605900      
009233 60200-GRABA-CVE.                                                 606000      
009234*================                                                 606100      
009235     MOVE WKS-ERR-CVETRAN(W77-IND)        TO     RE-CVE           606200      
009236     MOVE WKS-ERR-ESQCON(W77-IND)         TO     RE-ESQ           606300      
009237     MOVE WKS-ERR-IMPORTE(W77-IND)        TO     RE-IMPORTE       606400      
009238     IF WKS-ERR-FUNCION = 01 AND WKS-ERR-CVETRAN(W77-IND) = 0     606500      
009239        MOVE 1 TO W77-NOCVE                                       606600      
009240     ELSE                                                         606700      
009241     IF WKS-ERR-FUNCION NOT = 01                                  606800      
009242        MOVE 1 TO W77-NOCVE                                       606900      
009243        WRITE REG-ERROR                                           607000      
009244     ELSE                                                         607100      
009245        WRITE REG-ERROR.                                          607200      
009246                                                                  607300      
009247 60300-IMP-ENCABEZADOS.                                           607400      
009248*======================                                           607500      
009249     ADD 1                  TO   WKS-NUM-HOJAS                    607600      
009250     MOVE WKS-NUM-HOJAS     TO   WSR-RP-E3-HOJA                   607700      
009251     MOVE 3                 TO   WSR-RP-E1-NUM-TIT                607800      
009252     MOVE "RECHAZOS"        TO   WSR-RP-E1-NOM-TIT                607900      
009253     WRITE REG-RECHAZOS     FROM WSR-TIT1-RESUM AFTER PAGE        608000      
009254     WRITE REG-RECHAZOS     FROM WSR-TIT2-RESUM                   608100      
009255     WRITE REG-RECHAZOS     FROM WSR-TIT3-RESUM                   608200      
009256     MOVE SPACES TO REG-RECHAZOS                                  608300      
009257     WRITE REG-RECHAZOS    .                                      608400      
009258     IF W88-SIST-CRED                                             608500      
009259        WRITE REG-RECHAZOS  FROM WLI-ENCDET-RECHAZOS-CRED AFTER 2 608600      
009260     ELSE                                                         608700      
009261        WRITE REG-RECHAZOS  FROM WLI-ENCDET-RECHAZOS AFTER 2.     608800      
009262     MOVE SPACES TO REG-RECHAZOS                                  608900      
009263     WRITE REG-RECHAZOS                                           609000      
009264     MOVE 7                 TO  WKS-NUM-LINEAS.                   609100      
009265                                                                  609200      
009266 60350-IMP-ENCABEZADOS.                                           609300      
009267*======================                                           609400      
009268     ADD 1                  TO   WKS-NUM-HOJAS                    609500      
009269     MOVE WKS-NUM-HOJAS     TO   WSR-RP-E3-HOJA                   609600      
009270     MOVE 7                 TO   WSR-RP-E1-NUM-TIT                609700      
009271     MOVE "TOTRECHA"        TO   WSR-RP-E1-NOM-TIT                609800      
009272     WRITE REG-TOTRECHA     FROM WSR-TIT1-RESUM AFTER PAGE        609900      
009273     WRITE REG-TOTRECHA     FROM WSR-TIT2-RESUM                   610000      
009274     WRITE REG-TOTRECHA     FROM WSR-TIT3-RESUM                   610100      
009275     MOVE SPACES TO REG-TOTRECHA                                  610200      
009276     WRITE REG-TOTRECHA    .                                      610300      
009277     WRITE REG-TOTRECHA     FROM WLI-ENCDET-TOTRECHA AFTER 2.     610400      
009278     MOVE SPACES TO REG-TOTRECHA                                  610500      
009279     WRITE REG-TOTRECHA                                           610600      
009280     MOVE 7                 TO  WKS-NUM-LINEAS.                   610700      
009281                                                                  610800      
009282 60400-LEE-RECHAZOS.                                              610900      
009283*===================                                              611000      
009284                                                                  611100      
009285     MOVE RE-LIBRO        TO WLI-RECHA-LIBRO                      611200      
009286                             REC-ERR-LIBRO.                       611300      
009287     MOVE RE-PROD         TO WLI-RECHA-PROD                       611400      
009288                             REC-ERR-PROD.                        611500      
009289     MOVE RE-CONTRATO     TO WLI-RECHA-CTO                        611600      
009290                             REC-ERR-CONTRATO.                    611700      
009291     MOVE RE-FOLIO        TO WLI-RECHA-FOLIO                      611800      
009292                             REC-ERR-FOLIO                        611900      
009293     MOVE RE-ESQ          TO WLI-RECHA-ESQ                        612000      
009294                             REC-ERR-ESQ.                         612100      
009295     MOVE RE-CVE          TO WLI-RECHA-CVE                        612200      
009296                             REC-ERR-CVETRAN                      612300      
009297     MOVE RE-IMPORTE      TO WLI-RECHA-IMP                        612400      
009298                             REC-ERR-IMPORTE.                     612500      
009299     MOVE RE-AUTAPL       TO WLI-RECHA-AUTAPL                     612600      
009300                             REC-ERR-AUT-APL.                     612700      
009301     MOVE RE-MON          TO WLI-RECHA-MON                        612800      
009302                             REC-ERR-MONEDA.                      612900      
009303     MOVE RE-ERROR2       TO WLI-RECHA-ERROR2.                    613000      
009304     MOVE RE-TIPOERR      TO WLI-RECHA-TERROR                     613100      
009305                             REC-ERR-TIPOERR.                     613200      
009306     MOVE RE-SUC-PROM     TO REC-ERR-SUC-PROM.                    613300      
009307     MOVE RE-SUC-TRAN     TO REC-ERR-SUC-TRAN.                    613400      
009308     MOVE RE-AUT-S151     TO REC-ERR-AUT-S151.                    613500      
009309     MOVE RE-INSTRUMENTO  TO REC-ERR-INSTRUMENTO.                 613600      
009310                                                                  613700      
009311     IF (RE-LIBRO = 1 OR 2) AND RE-FIDEICOMISO > 0                613800      
009312        MOVE RE-FIDEICOMISO TO    WLI-RECHA-FID                   613900      
009313     ELSE                                                         614000      
009314        MOVE ZEROS          TO    WLI-RECHA-FID.                  614100      
009315                                                                  614200      
009316     IF RE-TIPOERR = 1                                            614300      
009317        ADD 1             TO      WKS-TOT-RECHAZOS(1)             614400      
009318        MOVE "SISTEMA NO HABILITADO EN S151 " TO WLI-RECHA-ERROR  614500      
009319        MOVE "SIS."       TO      WLI-NUM-ERR                     614600      
009320        MOVE RE-ERROR2    TO      WLI-TIPOERR                     614700      
009321        MOVE WLI-DET-ERR  TO      WLI-RECHA-ERROR2                614800      
009322     ELSE                                                         614900      
009323     IF RE-TIPOERR = 2                                            615000      
009324        ADD 1             TO      WKS-TOT-RECHAZOS(2)             615100      
009325        MOVE "FUN. NO VALIDA DIF. 1 O 2 O 3 " TO WLI-RECHA-ERROR  615200      
009326        MOVE "FUN."       TO      WLI-NUM-ERR                     615300      
009327        MOVE RE-ERROR2    TO      WLI-TIPOERR                     615400      
009328        MOVE WLI-DET-ERR  TO      WLI-RECHA-ERROR2                615500      
009329     ELSE                                                         615600      
009330     IF RE-TIPOERR = 3                                            615700      
009331        ADD 1             TO      WKS-TOT-RECHAZOS(3)             615800      
009332        MOVE "CLAVE NO CATALOGADA           " TO WLI-RECHA-ERROR  615900      
009333        MOVE SPACES       TO      WLI-RECHA-ERROR2                616000      
009334     ELSE                                                         616100      
009335     IF RE-TIPOERR = 4                                            616200      
009336        ADD 1             TO      WKS-TOT-RECHAZOS(4)             616300      
009337        MOVE "FECHA CONTABLE NO VALIDA      " TO WLI-RECHA-ERROR  616400      
009338        MOVE "FEC "       TO      WLI-NUM-ERR                     616500      
009339        MOVE RE-ERROR2    TO      WLI-TIPOERR                     616600      
009340        MOVE WLI-DET-ERR  TO      WLI-RECHA-ERROR2                616700      
009341     ELSE                                                         616800      
009342     IF RE-TIPOERR = 5                                            616900      
009343        ADD 1             TO      WKS-TOT-RECHAZOS(5)             617000      
009344        MOVE "FALTA LA SUCURSAL PROMOTORA   " TO WLI-RECHA-ERROR  617100      
009345        MOVE "SUC."       TO      WLI-NUM-ERR                     617200      
009346        MOVE RE-ERROR2    TO      WLI-TIPOERR                     617300      
009347        MOVE WLI-DET-ERR  TO      WLI-RECHA-ERROR2                617400      
009348     ELSE                                                         617500      
009349     IF RE-TIPOERR = 6                                            617600      
009350        ADD 1             TO      WKS-TOT-RECHAZOS(6)             617700      
009351        MOVE "FALTA SUC. DE LA INICIATIVA   " TO WLI-RECHA-ERROR  617800      
009352        MOVE "SUC."       TO      WLI-NUM-ERR                     617900      
009353        MOVE RE-ERROR2    TO      WLI-TIPOERR                     618000      
009354        MOVE WLI-DET-ERR  TO      WLI-RECHA-ERROR2                618100      
009355     ELSE                                                         618200      
009356     IF RE-TIPOERR = 8                                            618300      
009357        ADD 1             TO      WKS-TOT-RECHAZOS(8)             618400      
009358        MOVE "FALTA AUT. DEL S151 PARA ELI. " TO WLI-RECHA-ERROR  618500      
009359        MOVE "AUT."       TO      WLI-NUM-ERR                     618600      
009360        MOVE ZEROS        TO      WLI-TIPOERR                     618700      
009361        MOVE WLI-DET-ERR  TO      WLI-RECHA-ERROR2                618800      
009362     ELSE                                                         618900      
009363     IF RE-TIPOERR = 9                                            619000      
009364        ADD 1             TO      WKS-TOT-RECHAZOS(9)             619100      
009365        MOVE "MOV. A ELIMINAR NO EXISTE    "  TO WLI-RECHA-ERROR  619200      
009366        MOVE "AUT."       TO      WLI-NUM-ERR                     619300      
009367        MOVE RE-ERROR2    TO      WLI-TIPOERR                     619400      
009368        MOVE WLI-DET-ERR  TO      WLI-RECHA-ERROR2                619500      
009369     ELSE                                                         619600      
009370     IF RE-TIPOERR = 10                                           619700      
009371        ADD 1             TO      WKS-TOT-RECHAZOS(10)            619800      
009372        MOVE "ORIGEN INVALIDO              "  TO WLI-RECHA-ERROR  619900      
009373        MOVE "ORI."       TO      WLI-NUM-ERR                     620000      
009374        MOVE RE-ERROR2    TO      WLI-TIPOERR                     620100      
009375        MOVE WLI-DET-ERR  TO      WLI-RECHA-ERROR2                620200      
009376     ELSE                                                         620300      
009377     IF RE-TIPOERR = 11                                           620400      
009378        ADD 1             TO      WKS-TOT-RECHAZOS(11)            620500      
009379        MOVE "ELIM. INVALIDA, FUNCION <> 1 "  TO WLI-RECHA-ERROR  620600      
009380        MOVE "FUN."       TO      WLI-NUM-ERR                     620700      
009381        MOVE RE-ERROR2    TO      WLI-TIPOERR                     620800      
009382        MOVE WLI-DET-ERR  TO      WLI-RECHA-ERROR2                620900      
009383     ELSE                                                         621000      
009384     IF RE-TIPOERR = 12                                           621100      
009385        ADD 1             TO      WKS-TOT-RECHAZOS(12)            621200      
009386        MOVE "FALTA AUT.S151 PARA ELIM.(2) "  TO WLI-RECHA-ERROR  621300      
009387        MOVE "AUT."       TO      WLI-NUM-ERR                     621400      
009388        MOVE RE-ERROR2    TO      WLI-TIPOERR                     621500      
009389        MOVE WLI-DET-ERR  TO      WLI-RECHA-ERROR2                621600      
009390     ELSE                                                         621700      
009391     IF RE-TIPOERR = 13                                           621800      
009392        ADD 1             TO      WKS-TOT-RECHAZOS(13)            621900      
009393        MOVE "ELIMINANDO MOV. PREV. ELIM.  "  TO WLI-RECHA-ERROR  622000      
009394        MOVE "AUT."       TO      WLI-NUM-ERR                     622100      
009395        MOVE RE-ERROR2    TO      WLI-TIPOERR                     622200      
009396        MOVE WLI-DET-ERR  TO      WLI-RECHA-ERROR2                622300      
009397     ELSE                                                         622400      
009398        ADD 1             TO      WKS-TOT-RECHAZOS(14)            622500      
009399        MOVE "NO CATALOGADO                "  TO WLI-RECHA-ERROR. 622600      
009400                                                                  622700      
009401     IF WKS-NUM-LINEAS > 48                                       622800      
009402        PERFORM 60300-IMP-ENCABEZADOS.                            622900      
009403     ADD 1                TO  WKS-NUM-LINEAS.                     623000      
009404     WRITE REG-RECHAZOS   FROM WLI-DET-RECHAZOS.                  623100      
009405     WRITE REG-ERRORES    FROM WKS-RECHAZOS-ERR.                  623200      
009406                                                                  623300      
009407     READ MOVCONERROR AT END MOVE 1 TO W77-EOF.                   623400      
009408                                                                  623500      
009409 60600-IMP-TOTALES.                                               623600      
009410*==================                                               623700      
009411     MOVE WKS-TOT-RECHAZOS(W77-IND)           TO WLI-NUM-RECHA    623800      
009412     IF W77-IND = 1                                               623900      
009413        MOVE "SISTEMA NO HABILITADO EN S151 " TO WLI-TIPO-RECHA   624000      
009414     ELSE                                                         624100      
009415     IF W77-IND = 2                                               624200      
009416        MOVE "FUN. NO VALIDA DIF. 1 O 2 O 3 " TO WLI-TIPO-RECHA   624300      
009417     ELSE                                                         624400      
009418     IF W77-IND = 3                                               624500      
009419        MOVE "CLAVE NO CATALOGADA           " TO WLI-TIPO-RECHA   624600      
009420     ELSE                                                         624700      
009421     IF W77-IND = 4                                               624800      
009422        MOVE "FECHA CONTABLE NO VALIDA      " TO WLI-TIPO-RECHA   624900      
009423     ELSE                                                         625000      
009424     IF W77-IND = 5                                               625100      
009425        MOVE "FALTA LA SUCURSAL PROMOTORA   " TO WLI-TIPO-RECHA   625200      
009426     ELSE                                                         625300      
009427     IF W77-IND = 6                                               625400      
009428        MOVE "FALTA SUC. DE LA INICIATIVA   " TO WLI-TIPO-RECHA   625500      
009429     ELSE                                                         625600      
009430     IF W77-IND = 8                                               625700      
009431        MOVE "FALTA AUT. DEL S151 PARA ELI. " TO WLI-TIPO-RECHA   625800      
009432     ELSE                                                         625900      
009433     IF W77-IND = 9                                               626000      
009434        MOVE "MOV. A ELIMINAR NO EXISTE    "  TO WLI-TIPO-RECHA   626100      
009435     ELSE                                                         626200      
009436     IF W77-IND = 10                                              626300      
009437        MOVE "ORIGEN INVALIDO              "  TO WLI-TIPO-RECHA   626400      
009438     ELSE                                                         626500      
009439     IF W77-IND = 11                                              626600      
009440        MOVE "ELIM. INVALIDA, FUNCION <> 1 "  TO WLI-TIPO-RECHA   626700      
009441     ELSE                                                         626800      
009442     IF W77-IND = 12                                              626900      
009443        MOVE "FALTA AUT.S151 PARA ELIM.(2) "  TO WLI-TIPO-RECHA   627000      
009444     ELSE                                                         627100      
009445     IF W77-IND = 13                                              627200      
009446        MOVE "ELIMINANDO MOV. PREV. ELIM.  "  TO WLI-TIPO-RECHA   627300      
009447     ELSE                                                         627400      
009448        MOVE "NO CATALOGADO                "  TO WLI-TIPO-RECHA.  627500      
009449                                                                  627600      
009450    IF W77-IND = 7                                                627700      
009451       NEXT SENTENCE                                              627800      
009452    ELSE                                                          627900      
009453       MOVE  W77-IND         TO   WLI-TIPO-ERROR                  628000      
009454       WRITE REG-TOTRECHA    FROM WLI-DET-TOTRECHA.               628100      
009455                                                                  628200      
009456    IF WKS-TOT-RECHAZOS(W77-IND) > 0                              628300      
009457       MOVE 1 TO WKS-REP-TMREC-VACIO.                             628400      
009458                                                                  628420      
009459*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
009460* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP002 ON CMEMP."         628440      
009461*                                      FROM 100000 TO 999999      628460      
009462                                                                  100000      
009463*----------------------------------------------------------------*100100      
009464*   PROCEDIMIENTO DE CALCULO DINAMICO DE ESPACIO PARA EL SORT    *100200      
009465*----------------------------------------------------------------*100300      
009466 70000-CALCULA-ESPACIO.                                           100400      
009467*======================                                           100500      
009468     IF W77-FRAMESIZE             =   8                           100600      
009469        COMPUTE WS-CALC-WORD      =   W77-MAXRECSIZE              100700      
009470                                  /   6                           100800      
009471        IF WS-WORD-RES            >   ZEROS                       100900      
009472           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                 101000      
009473                                  +   1                           101100      
009474        ELSE                                                      101200      
009475           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                .101300      
009476     COMPUTE W77-MEMORY-65K  =   66000 * W77-MAXRECSIZE     .     101400      
009477                                                                  101402      
009478     COMPUTE W77-MEMORY-SIZE ROUNDED                              101500      
009479                                  =   (W77-MAXRECSIZE + 3)        101600      
009480                                  *   (W77-LASTRECORD / 16)       101700      
009481                                  +   1500                       .101750      
009482                                                                  101770      
009483     IF W77-MEMORY-SIZE > 258435000                               101800      
009484        MOVE 258435000              TO W77-MEMORY-SIZE            101820      
009485     ELSE                                                         101850      
009486     IF W77-MEMORY-SIZE < 400000                                  101870      
009487        MOVE W77-MEMORY-65K         TO W77-MEMORY-SIZE.           101900      
009488                                                                  101990      
009489     COMPUTE W77-DISK-SIZE ROUNDED                                102000      
009490                                  =  (W77-MAXRECSIZE + 3)         102100      
009491                                  *   W77-LASTRECORD              102200      
009492                                  *   3.5                        .102300      
009493                                                                  102400      
009494*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
009495                                                                  628480      
009496                                                                  628500      
009497   A2K-CPY-SECTION.                                               628600      
009498*==================                                               628700      
009499*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
009500*   COPY "S151/CRONOS2K/CPY/PD".                                  628800      
009501** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
009502** Unisys has defined for CRONOS2K project                     ** 000200      
009503** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
009504***************************************************************** 000400      
009505***************************************************************** 000600      
009506** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
009507** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
009508** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
009509** date MMDDCCAA, which is returned into the variable          ** 001000      
009510** A2K-FEC-MDCA-001.                                           ** 001100      
009511***************************************************************** 001200      
009512                                                                  001300      
009513 A2K-ACCEPT-TODAYS-DATE.                                          001400      
009514        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
009515*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
009516        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
009517        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
009518        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
009519        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
009520        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
009521                                                                  002200      
009522 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
009523        EXIT.                                                     002240      
009524                                                                  002500      
009525****************************************************************  002600      
009526** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
009527**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
009528**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
009529**baseyear to add the century to the year part.               **  003000      
009530**INPUT is A2K-FEC-AMD-001                                    **  003100      
009531**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
009532****************************************************************  003300      
009533                                                                  003400      
009534 A2K-CONV-AMD-TO-CAMD.                                            003500      
009535         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
009536         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
009537         IF A2K-FEC-AMD-001 = 0                                   003720      
009538            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
009539         ELSE                                                     003741      
009540          IF A2K-FEC-AMD-001 = 999999                             003742      
009541             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
009542         ELSE                                                     003760      
009543         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
009544                 A2K-OBTAIN-CENTURY-EXIT                          003900      
009545         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
009546         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
009547         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
009548         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
009549                                                                  004400      
009550 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
009551         EXIT.                                                    004600      
009552                                                                  004700      
009553******************************************************************004800      
009554**A2K-CONV-MDA-TO-MDCA.                                         **004900      
009555**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
009556** an eight digit format as MMDDCCAA. It use a                  **005100      
009557** baseyear to add century to the yaer.                         **005200      
009558** INPUT is A2K-FEC-MDA-001                                     **005300      
009559** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
009560                                                                  005500      
009561 A2K-CONV-MDA-TO-MDCA.                                            005600      
009562     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
009563     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
009564     IF A2K-FEC-MDA-001 = 0                                       005820      
009565        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
009566     ELSE                                                         005845      
009567      IF A2K-FEC-MDA-001 = 999999                                 005850      
009568         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
009569     ELSE                                                         005860      
009570     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
009571             A2K-OBTAIN-CENTURY-EXIT                              006000      
009572     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
009573     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
009574     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
009575     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
009576                                                                  006500      
009577 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
009578     EXIT.                                                        006700      
009579                                                                  006800      
009580***************************************************************** 006900      
009581**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
009582**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
009583**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
009584**baseyear to add century to the year.                         ** 007300      
009585**INPUT is A2K-FEC-DMA-001                                     ** 007400      
009586**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
009587                                                                  007600      
009588 A2K-CONV-DMA-TO-DMCA.                                            007700      
009589       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
009590       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
009591       IF  A2K-FEC-DMA-001   = 0                                  007920      
009592          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
009593       ELSE                                                       007945      
009594        IF A2K-FEC-DMA-001 = 999999                               007950      
009595          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
009596       ELSE                                                       007960      
009597       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
009598               A2K-OBTAIN-CENTURY-EXIT                            008100      
009599       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
009600       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
009601       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
009602       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
009603                                                                  008600      
009604 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
009605       EXIT.                                                      008800      
009606                                                                  008900      
009607***************************************************************** 009000      
009608** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
009609** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
009610** a 6 digit format as AAMMDD.                                 ** 009300      
009611** It simply removes the century information in the output     ** 009400      
009612** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
009613** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
009614                                                                  009700      
009615 A2K-CONV-CAMD-TO-AMD.                                            009800      
009616     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
009617     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
009618     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
009619     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
009620                                                                  010300      
009621 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
009622      EXIT.                                                       010500      
009623                                                                  010600      
009624******************************************************************010700      
009625******************************************************************010800      
009626** A2K-CONV-MDCA-TO-MDA.                                        **010900      
009627** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
009628** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
009629** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
009630** INPUT is A2K-FEC-MDCA-001                                    **011300      
009631** OUTPUT is A2K-FEC-MDA-001                                    **011400      
009632                                                                  011500      
009633 A2K-CONV-MDCA-TO-MDA.                                            011600      
009634     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
009635     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
009636     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
009637     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
009638                                                                  012100      
009639 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
009640      EXIT.                                                       012300      
009641                                                                  012400      
009642******************************************************************012500      
009643***************************************************************** 012600      
009644** A2K-CONV-DMCA-TO-DMA.                                        **012700      
009645** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
009646** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
009647** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
009648** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
009649** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
009650                                                                  013300      
009651 A2K-CONV-DMCA-TO-DMA.                                            013400      
009652     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
009653     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
009654     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
009655     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
009656                                                                  013900      
009657 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
009658      EXIT.                                                       014100      
009659                                                                  014200      
009660***************************************************************** 014300      
009661 A2K-CONV-MDCA-TO-CAMD.                                           014400      
009662      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
009663      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
009664      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
009665      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
009666      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
009667 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
009668      EXIT.                                                       015100      
009669***************************************************************** 015200      
009670** This paragraph adds century to an year field which is 9(02) ** 015300      
009671** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
009672** Output is A2K-FEC-CCAA-001.                                 ** 015600      
009673***************************************************************** 015700      
009674 A2K-CONV-AA-TO-CCAA.                                             015800      
009675      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
009676      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
009677              A2K-OBTAIN-CENTURY-EXIT.                            016100      
009678      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
009679 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
009680      EXIT.                                                       016400      
009681***************************************************************** 016500      
009682** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
009683** format.                                                     ** 016700      
009684** Input is A2K-FEC-DMCA-001.                                  ** 016800      
009685** Output is A2K-FEC-CAMD-001.                                 ** 016900      
009686***************************************************************** 017000      
009687 A2K-CONV-DMCA-TO-CAMD.                                           017100      
009688      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
009689      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
009690      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
009691      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
009692      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
009693 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
009694      EXIT.                                                       017800      
009695***************************************************************** 017900      
009696** This paragraph desides the Century to be added depending    ** 018000      
009697** on the base year.                                           ** 018100      
009698** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
009699** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
009700***************************************************************** 018400      
009701 A2K-OBTAIN-CENTURY.                                              018500      
009702      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
009703          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
009704      ELSE                                                        018800      
009705          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
009706 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
009707      EXIT.                                                       019100      
009708                                                                  019200      
009709***************************************************************** 019300      
009710** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
009711**  Format                                                     ** 019500      
009712** Input Is A2K-FEC-CAMD-001                                   ** 019600      
009713** Output Is A2K-FEC-DMCA-001                                  ** 019700      
009714***************************************************************** 019800      
009715 A2K-CONV-CAMD-TO-DMCA.                                           019900      
009716      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
009717      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
009718      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
009719      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
009720      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
009721                                                                  020500      
009722 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
009723      EXIT.                                                       020700      
009724                                                                  020800      
009725******************************************************************020900      
009726******************************************************************021000      
009727 A2K-CONV-AM-TO-CAM.                                              021100      
009728      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
009729      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
009730      IF A2K-FEC-AM-001 = 0                                       021220      
009731         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
009732      ELSE                                                        021245      
009733      IF A2K-FEC-AM-001 = 9999                                    021250      
009734         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
009735      ELSE                                                        021260      
009736      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
009737      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
009738      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
009739              A2K-OBTAIN-CENTURY-EXIT                             021600      
009740      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
009741                                                                  021800      
009742 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
009743      EXIT.                                                       022000      
009744                                                                  022100      
009745******************************************************************022200      
009746******************************************************************022300      
009747 A2K-CONV-CAM-TO-AM.                                              022400      
009748      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
009749      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
009750      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
009751                                                                  022800      
009752 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
009753   EXIT.                                                          023000      
009754                                                                  023100      
009755                                                                  023200      
009756                                                                  023500      
009757*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
009758   A2K-CPY-EXIT-PARA.                                             628900      
009759   EXIT.                                                          629000      
