000001*$SET TARGET=LEVEL2                                               000100      
000002$SET LIST                                                         000200      
000003*$SET TADS                                                        000300      
000004***********************************************************       000320      
000005* RECOMPILACION POR EL UPGRADE DEL MCP A 60               *       000340      
000006* 20221230 23MTP001 CLLC                                  *       000360      
000007***********************************************************       000380      
000008 IDENTIFICATION DIVISION.                                         000400      
000009 PROGRAM-ID.             LEE-MOVSNNN.                             000500      
000010 AUTHOR.                 JAVIER MERCADO FLORES.                   000600      
000011 INSTALLATION.           BANAMEX                                  000700      
000012                         INGENIERIA DE SISTEMAS                   000800      
000013                         CENTRO DE DESARROLLO LEON.               000900      
000014 DATE-WRITTEN.           JUNIO DE 2004.                           001000      
000015 DATE-COMPILED.                                                   001100      
000016 SECURITY.               COPYRIGHT 2004 BY THE AUTHOR.            001200      
000017 ENVIRONMENT DIVISION.                                            001300      
000018 CONFIGURATION SECTION.                                           001400      
000019 SOURCE-COMPUTER.        A10.                                     001500      
000020 OBJECT-COMPUTER.        A10.                                     001600      
000021 INPUT-OUTPUT SECTION.                                            001700      
000022 FILE-CONTROL.                                                    001800      
000023      SELECT A01-MOVSNNN     ASSIGN       TO DISK                 001900      
000024                             ORGANIZATION IS SEQUENTIAL           002000      
000025                             ACCESS MODE  IS SEQUENTIAL           002100      
000026                             ACTUAL KEY   IS A01-KEY-NUMREG.      002200      
000027 DATA DIVISION.                                                   002300      
000028 FILE SECTION.                                                    002400      
000029*                                                                 002500      
000030 FD A01-MOVSNNN                                                   002600      
000031    BLOCK CONTAINS 100 RECORDS                                    002700      
000032    VALUE OF                                                      002800      
000033                 SECURITYTYPE IS PUBLIC                           002900      
000034                 TITLE WKS-ETI-S151-MOVANT.                       003000      
000035                                                                  003100      
000036*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000037*    COPY "S151/FORMATO/ARCHIVO/MOVTOS".                          003200      
000038                                                                  000100      
000039******************************************************************000200      
000040**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
000041**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
000042**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
000043******************************************************************000600      
000044                                                                  000700      
000045 01 A00-R00-HDR-MOV .                                             000800      
000046    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
000047    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
000048    02 FILLER                          PIC  X(08).                001100      
000049    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
000050    02 FILLER                          PIC  X(430).               001300      
000051                                                                  001400      
000052 01 A00-R01-REGMOV .                                              001500      
000053    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
000054    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
000055    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
000056                                                                  001900      
000057    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
000058    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
000059                                       PIC  9(04)      COMP.      002200      
000060    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
000061                                       PIC  9(04)      COMP.      002400      
000062                                                                  002500      
000063    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000064    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
000065                                       PIC  9(02)      COMP.      002800      
000066    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
000067                                       PIC  9(02)      COMP.      003000      
000068    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
000069    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
000070                                       A00-R01-SERVICIO-ALERTA.   003060      
000071       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
000072       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
000073    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
000074    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
000075    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
000076                                       PIC  9(04)      COMP.      003420      
000077    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
000078    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
000079                                       PIC  9(04)      COMP.      003520      
000080    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
000081    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
000082    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
000083                                       PIC  9(02)      COMP.      003900      
000084                                                                  004000      
000085    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
000086    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
000087       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
000088          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
000089          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
000090          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
000091          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
000092          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
000093          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
000094          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
000095                                                                  005100      
000096    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
000097       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
000098       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
000099       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
000100       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
000101       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
000102       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
000103       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
000104                                                                  006000      
000105       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
000106       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
000107       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
000108       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
000109       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
000110       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
000111       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
000112                                                                  006800      
000113       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
000114       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
000115       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
000116       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
000117       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
000118       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
000119       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
000120                                                                  007600      
000121       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
000122       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
000123       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
000124       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
000125       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
000126       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
000127       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
000128                                                                  008400      
000129       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
000130       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
000131       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
000132       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
000133       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
000134       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
000135       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
000136                                                                  009200      
000137    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
000138    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
000139    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
000140    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
000141    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
000142    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
000143       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
000144    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
000145    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
000146    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
000147    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
000148    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
000149    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
000150    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
000151    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
000152       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
000153       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
000154    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
000155    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
000156    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
000157    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
000158    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
000159    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
000160    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
000161    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
000162    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
000163    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
000164    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
000165    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
000166    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
000167    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
000168                                       PIC X(10).                 012600      
000169    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
000170       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
000171       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
000172    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
000173    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
000174    03 A00-R01-FILIAL                  PIC  X(05).                013200      
000175    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
000176       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
000177       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
000178                                                                  013300      
000179    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
000180    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
000181                                       PIC  X(09).                013600      
000182    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
000183                                       PIC  9(18)      COMP.      013800      
000184    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
000185    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
000186                                       PIC  X(9).                 014100      
000187    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
000188    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
000189                                       PIC  X(05).                014400      
000190    03 A00-R01-NIO                     PIC  X(16).                014500      
000191    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
000192    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
000193    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
000194       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
000195    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
000196    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
000197       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
000198    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
000199    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
000200    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
000201    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
000202    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
000203    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
000204                                       PIC  X(04).                015900      
000205    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
000206    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
000207    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
000208                                       PIC  9(04)      COMP.      016300      
000209    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
000210    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
000211    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
000212    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
000213    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
000214                                                                  016900      
000215    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
000216    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
000217       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
000218    03 A00-R01-FILXAPL                 PIC X(165).                017300      
000219                                                                  017400      
000220    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
000221       05 FILLER                       PIC X(96).                 017510      
000222       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
000223       05 FILLER                       PIC X(67).                 017700      
000224                                                                  017702      
000225    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
000226       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
000227       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
000228       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
000229       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
000230       06 WKS-MOV-FILS084              PIC X(154).                017714      
000231                                                                  017800      
000232    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
000233       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
000234       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
000235       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
000236       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
000237       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
000238       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
000239       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
000240       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
000241       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018155      
000242*      CAMPOS NUEVOS                                              018160      
000243       05 A00-R01-SUCFOND              PIC 9(04)      COMP.       018161      
000244       05 A00-R01-CTAFOND              PIC 9(16)      COMP.       018162      
000245       05 A00-R01-OPBANEL              PIC 9(04)      COMP.       018163      
000246       05 A00-R01-GATN                 PIC S9(03)V99   COMP.      018164      
000247       05 A00-R01-GATR                 PIC S9(03)V99   COMP.      018165      
000248       05 A00-R01-FECGAT               PIC 9(08)      COMP.       018166      
000249       05 FILLER                       PIC X(40).                 018167      
000250*       05 FILLER                       PIC X(62).                018170      
000251       05 A00-R01-CTE-087              PIC X(07).                 018210      
000252       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
000253          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
000254          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
000255          07 FILLER                    PIC X(01).                 018281      
000256       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
000257       05 FILLER                       PIC X(61).                 018400      
000258                                                                  018500      
000259    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
000260       05 FILLER                       PIC  X(96).                018610      
000261       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
000262       05 FILLER                       PIC  X(65).                018630      
000263                                                                  018640      
000264    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
000265       05 A00-R01-FORMATO0             PIC  9(02).                018700      
000266       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
000267       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
000268       05 FILLER                       PIC  X(141).               018910      
000269                                                                  019100      
000270    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
000271       05 A00-R01-FORMATO1             PIC  9(02).                019300      
000272       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
000273       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
000274       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
000275       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
000276       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
000277       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
000278       05 A00-R01-ENTSAL               PIC  X(01).                020000      
000279       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
000280       05 FILLER                       PIC  X(69).                020200      
000281                                                                  020300      
000282    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
000283       05 A00-R01-FORMATO2             PIC  9(02).                020500      
000284       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
000285       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
000286       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
000287       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
000288       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
000289       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
000290       05 FILLER                       PIC  X(77).                021200      
000291                                                                  021300      
000292    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
000293       05 A00-R01-FORMATO3             PIC  9(02).                021500      
000294       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
000295       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
000296       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
000297       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
000298       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
000299       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
000300       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
000301       05 FILLER                       PIC  X(69).                022300      
000302                                                                  022400      
000303    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
000304       05 A00-R01-FORMATO4             PIC  9(02).                022600      
000305       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
000306       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
000307       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
000308       05 A00-R01-RFCFT04              PIC  X(13).                023000      
000309       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
000310       05 A00-R01-DIRECCION            PIC  X(40).                023200      
000311       05 FILLER                       PIC  X(85).                023300      
000312                                                                  023400      
000313    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
000314       05 A00-R01-COBERTURA            PIC  X(01).                023408      
000315       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
000316       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
000317       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
000318       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
000319       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
000320       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
000321       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
000322       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
000323       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
000324       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
000325       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
000326       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
000327       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
000328       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
000329       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
000330       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
000331       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
000332       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
000333       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
000334       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
000335       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
000336       05 FILLER                       PIC  X(05).                023492      
000337                                                                  023497      
000338    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
000339       05 A00-R01-4CEROS               PIC  9(04).                023600      
000340       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
000341       05 FILLER                       PIC  X(157).               023800      
000342                                                                  023900      
000343    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
000344       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
000345        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
000346       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
000347       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
000348       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
000349       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
000350       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
000351       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
000352       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
000353       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
000354       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
000355       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
000356       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
000357       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
000358       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
000359       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
000360       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
000361       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
000362       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
000363       05 A00-R01-FILLER               PIC  X(41).                025850      
000364       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
000365       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
000366       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
000367       05 A00-R01-INDPAGO              PIC  9(01).                026200      
000368       05 FILLER                       PIC  X(01).                026210      
000369       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
000370       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
000371       05 FILLER                       PIC  X(52).                026300      
000372                                                                  026400      
000373    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
000374       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
000375       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
000376       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
000377       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
000378       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
000379       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
000380       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
000381       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
000382       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
000383       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
000384       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
000385       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
000386       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
000387          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
000388          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
000389       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
000390       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
000391          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
000392       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
000393          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
000394       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
000395          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
000396       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
000397          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
000398       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
000399          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
000400       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
000401          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
000402       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
000403          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
000404       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
000405          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
000406       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
000407          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
000408       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
000409          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
000410          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
000411       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
000412       05 FILLER                       PIC X(01).                 030101      
000413       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
000414       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
000415       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
000416       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
000417       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
000418       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
000419       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
000420       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
000421          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
000422       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
000423       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
000424       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
000425       05 FILLER                       PIC X(14).                 030700      
000426                                                                  030800      
000427    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
000428       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
000429       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
000430       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
000431       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
000432       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
000433       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
000434       05 A00-R01-151-CITI             PIC  9(02)     COMP.       031520      
000435       05 A00-R01-151-IND-BNE          PIC  9(02)     COMP.       031540      
000436       05 FILLER                       PIC  X(140).               031600      
000437                                                                  031700      
000438    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
000439       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
000440       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
000441       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
000442       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
000443       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
000444       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
000445       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
000446       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
000447       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
000448       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
000449          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
000450          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
000451          07 FILLER                    PIC  X(08).                032740      
000452       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
000453       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
000454       05 A00-R01-NOMORD               PIC  X(30).                033000      
000455       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
000456       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
000457       05 A00-R01-REF-CECO             PIC  X(07).                033500      
000458       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
000459       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
000460          A00-R01-NUM-ORD-PAGO.                                   033800      
000461          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
000462          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
000463                                                                  034100      
000464    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
000465       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
000466       05 A00-R01-RFC-S501             PIC  X(13).                034160      
000467       05 FILLER                       PIC  X(151).               034180      
000468                                                                  034190      
000469    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
000470       05 A00-R01-DATOS-S701           PIC X(116).                034300      
000471       05 A00-R01-PAG-SERV             REDEFINES                  034400      
000472                                       A00-R01-DATOS-S701.        034500      
000473          07 A00-R01-ID                PIC X(30).                 034600      
000474          07 A00-R01-FECREC            PIC 9(06).                 034700      
000475          07 A00-R01-REF1              PIC X(20).                 034800      
000476          07 A00-R01-REF2              PIC X(20).                 034900      
000477          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
000478          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
000479                                       A00-R01-TIPOPAGO.          035200      
000480             09 A00-R01-ESTAB          PIC 9(04).                 035300      
000481             09 A00-R01-SEQ            PIC 9(02).                 035400      
000482          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
000483          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
000484          07 A00-R01-EBPP              PIC 9(03).                 035700      
000485          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
000486          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
000487          07 FILLER                    PIC X(01).                 035728      
000488          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
000489          07 FILLER                    PIC X(18).                 035760      
000490       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
000491                                       A00-R01-DATOS-S701.        035900      
000492          07 A00-R01-RFC               PIC X(13).                 036000      
000493          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
000494          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
000495          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
000496          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
000497          07 FILLER                    PIC X(85).                 036200      
000498       05 FILLER                       PIC X(49).                 036300      
000499                                                                  036400      
000500    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
000501       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
000502       05 A00-R01-CTA-S702             PIC X(40).                 036700      
000503       05 FILLER                       PIC X(113).                036710      
000504                                                                  036720      
000505    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
000506       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
000507       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
000508       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
000509       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
000510       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
000511       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
000512       05 FILLER                       PIC X(72).                 036800      
000513                                                                  036810      
000514                                                                  036820      
000515    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
000516       05 A00-R01-TRUI-S711.                                      036915      
000517          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
000518          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
000519          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
000520           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
000521          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
000522       05 A00-R01-MICR-S711.                                      036945      
000523          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
000524          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
000525          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
000526          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
000527          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
000528          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
000529          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
000530          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
000531       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
000532       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
000533       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
000534       05 A00-R01-FIL-S711             PIC X(05).                 036965      
000535       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
000536       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
000537       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
000538                                                                  036990      
000539    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
000540       05 A00-R01-RFC-502              PIC  X(13).                037100      
000541       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
000542          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
000543          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
000544          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
000545          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
000546          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
000547          07 FILLER                    PIC  9(01) COMP.           037650      
000548       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
000549       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
000550       05 FILLER                       PIC  X(06).                038680      
000551                                                                  038682      
000552    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
000553       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
000554       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
000555       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
000556       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
000557       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
000558       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
000559       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
000560       05 FILLER                       PIC  X(81).                038750      
000561                                                                  038755      
000562    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
000563       05 A00-R01-COP                  PIC  9(13)        .        038900      
000564       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
000565       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
000566       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
000567       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
000568       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
000569       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
000570       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
000571       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
000572       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
000573       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
000574       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
000575       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
000576       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
000577       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
000578       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
000579       05 FILLER                       PIC  X(81)        .        040800      
000580                                                                  040810      
000581    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
000582       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
000583       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
000584       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
000585       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
000586       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
000587       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
000588       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
000589       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
000590       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
000591       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
000592       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
000593       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
000594       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
000595       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
000596       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
000597       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
000598       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
000599       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
000600       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
000601       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
000602       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
000603       05 FILLER                       PIC  X(18).                041040      
000604                                                                  041400      
000605    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
000606    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
000607*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000608*                                                                 003300      
000609 WORKING-STORAGE SECTION.                                         003400      
000610                                                                  003500      
000611****************************************************************  003600      
000612*              RUTINAS PARA LIBRERIA CONCEPTOS                 *  003700      
000613****************************************************************  003800      
000614 01 WKS-CTLVER-LIBID             PIC X(12).                       003900      
000615 01 WKS-CTLVER-NOMLIB            PIC X(72).                       004000      
000616 01 W77-CTLVER-RESULT            PIC S9(11) BINARY.               004100      
000617  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  004200      
000618  01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                         004300      
000619     03 WKS-B01-FUNCION             PIC 9(02).                    004400      
000620     03 WKS-B01-SISTEMA             PIC 9(04).                    004500      
000621     03 WKS-B01-CSI                 PIC 9(02).                    004600      
000622     03 WKS-B01-FECPRO              PIC 9(08).                    004700      
000623     03 WKS-B01-FECCON              PIC 9(08).                    004800      
000624     03 WKS-B01-FECPRO151           PIC 9(08).                    004900      
000625     03 WKS-B01-STAREG              PIC 9(02).                    005000      
000626     03 WKS-B01-NOMARCSAL           PIC X(34).                    005100      
000627     03 WKS-B01-NOMPACSAL           PIC X(17).                    005200      
000628     03 WKS-B01-NOMARCMOV           PIC X(34).                    005300      
000629     03 WKS-B01-NOMPACMOV           PIC X(17).                    005400      
000630     03 WKS-B01-NOMARCDES           PIC X(34).                    005500      
000631     03 WKS-B01-NOMPACDES           PIC X(17).                    005600      
000632     03 WKS-B01-NOMARCERR           PIC X(34).                    005700      
000633     03 WKS-B01-NOMPACERR           PIC X(17).                    005800      
000634     03 WKS-B01-NOMBDSEM            PIC X(17).                    005900      
000635     03 WKS-B01-STABDSEM            PIC 9(02).                    006000      
000636     03 WKS-B01-NUMARC              PIC 9(02).                    006100      
000637     03 WKS-B01-3ERNIV              PIC 9(02).                    006200      
000638     03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                      006300      
000639        05 WKS-B01-FECARCMOV        PIC 9(08).                    006400      
000640        05 WKS-B01-NIVARCMOV        PIC 9(08).                    006500      
000641        05 WKS-B01-NIVBDMOV         PIC 9(08).                    006600      
000642        05 WKS-B01-STAARCLOG        PIC 9(02).                    006700      
000643                                                                  006800      
000644  01 MENSAJE-LJ.                                                  006900      
000645     02 SISTEMA-LJ     PIC X(04).                                 007000      
000646     02 FILLER         PIC X VALUE "/".                           007100      
000647     02 PASO-LJ        PIC X(04).                                 007200      
000648     02 FILLER         PIC X VALUE "/".                           007300      
000649     02 MTP-LJ         PIC 9(03).                                 007400      
000650     02 FILLER         PIC X VALUE ":".                           007500      
000651     02 TIPO-LJ        PIC X.                                     007600      
000652     02 FILLER         PIC X VALUE ">".                           007700      
000653     02 CODIGO-LJ      PIC 9(06).                                 007800      
000654     02 FILLER         PIC X VALUE "<".                           007900      
000655     02 TEXTO-LJ       PIC X(250).                                008000      
000656 77 W77-ERROR                    PIC 9(02).                       008100      
000657*==========================================================       008200      
000658*         VARIABLES LIBRERIA CONTROL DE VERSIONES         =       008300      
000659*==========================================================       008400      
000660 01  WKS-TABLA-PROCESOS.                                          008500      
000661     03 WKS-TAB-PROCESOS OCCURS 2000 TIMES.                       008600      
000662        05 WKS-TAB-PROC1           PIC 9(08) COMP.                008700      
000663        05 WKS-TAB-SUC1            PIC 9(04) COMP.                008800      
000664        05 WKS-TAB-CAJ1            PIC 9(02) COMP.                008900      
000665        05 WKS-TAB-PROC2           PIC 9(08) COMP.                009000      
000666        05 WKS-TAB-SUC2            PIC 9(04) COMP.                009100      
000667        05 WKS-TAB-CAJ2            PIC 9(02) COMP.                009200      
000668        05 WKS-TAB-PROC3           PIC 9(08) COMP.                009300      
000669        05 WKS-TAB-SUC3            PIC 9(04) COMP.                009400      
000670        05 WKS-TAB-CAJ3            PIC 9(02) COMP.                009500      
000671 01 W77-RESULT-B01               PIC 9(08).                       009600      
000672 01  WKS-DIASEM                    PIC 9(02).                     009700      
000673 01  WKS-LIBID                     PIC X(12).                     009800      
000674 01  WKS-NOMLIB                    PIC X(72).                     009900      
000675 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             010000      
000676 77  A01-KEY-NUMREG                PIC 9(08).                     010100      
000677 77  LOG-KEY                       PIC 9(08).                     010200      
000678 77  WKS-CON-LEI                   PIC 9(08).                     010300      
000679 01  WKS-ETI-S151-MOVANT.                                         010400      
000680     02 FILLER                     PIC X(20) VALUE                010500      
000681        "(S151)S151/FILE/MOVS".                                   010600      
000682     02 WKS-SIS-NUM                PIC 9(03).                     010620      
000683     02 FILLER                     PIC X(01) VALUE "/".           010640      
000684     02 WKS-SIS-FEC                PIC 9(06).                     010700      
000685     02 FILLER                     PIC X(06) VALUE " ON ".        010800      
000686     02 WKS-PACK-MOVS              PIC X(17).                     010900      
000687     02 FILLER                     PIC X(01) VALUE ".".           011000      
000688 77  W77-FIN              PIC 9(02) COMP VALUE ZEROS.             011100      
000689 77  W77-NUMMOV           PIC 9(06).                              011200      
000690 77  W77-IMP-TOTAL        PIC 9(14)V9(02) COMP.                   011300      
000691 77  W77-AUT              PIC 9(06).                              011400      
000692 77  W77-PARAM-FECHA      PIC 9(06).                              011500      
000693 77  W77-OK               PIC 9(06).                              011600      
000694 77  W77-REG-ACTUAL       PIC 9(08).                              011700      
000695 77  W77-REG-ELIMINAR     PIC 9(08).                              011800      
000696 77  W77-PROCESO          PIC 9(02).                              011900      
000697 77  W77-REG-REAL-ELIM    PIC 9(08).                              012000      
000698 77  W77-MONEDA           PIC 9(02).                              012100      
000699 77  W77-IND              PIC 9(04).                              012200      
000700 77  W77-IND1             PIC 9(04).                              012300      
000701 77  W77-IND2             PIC 9(04).                              012400      
000702 77  W77-IND3             PIC 9(04).                              012500      
000703 77  W77-NUMREG           PIC 9(09).                              012600      
000704 77  WKS-CONTADOR         PIC 9(09) VALUE ZERO.                   012700      
000705                                                                  012800      
000706 01  WKS-PARAMETRO.                                               012900      
000707     03 WKS-PARAM-FECHA   PIC 9(06).                              013000      
000708     03 WKS-PARAM-NUMREG  PIC 9(08).                              013100      
000709 77  W77-SISTEMA-PARAMETRO         PIC 9(03).                     013150      
000710                                                                  013200      
000711 PROCEDURE DIVISION USING W77-SISTEMA-PARAMETRO.                  013300      
000712 000000-INIC-PROGRAMA.                                            013400      
000713*====================                                             013500      
000714     MOVE "S151"                  TO SISTEMA-LJ.                  013600      
000715     MOVE "P690"                  TO PASO-LJ.                     013700      
000716     MOVE "001"                   TO MTP-LJ.                      013800      
000717     MOVE "I"                     TO TIPO-LJ.                     013900      
000718     MOVE 020201                  TO CODIGO-LJ.                   014000      
000719     PERFORM 020400-LIBRERIAS.                                    014100      
000720     MOVE WKS-B01-FECCON          TO WKS-SIS-FEC.                 014200      
000721     PERFORM 100-BUSCA-IND-FECARCMOV                              014220      
000722             VARYING W77-IND FROM 1 BY 1                          014240      
000723             UNTIL WKS-B01-FECCON = WKS-B01-FECARCMOV (W77-IND).  014260      
000724     MOVE W77-IND                 TO WKS-DIASEM                   014300      
000725     MOVE W77-SISTEMA-PARAMETRO   TO WKS-SIS-NUM                  014350      
000726     OPEN I-O A01-MOVSNNN.                                        014400      
000727*    MOVE WKS-PARAM-NUMREG        TO A01-KEY-NUMREG.              014500      
000728*    SEEK A01-MOVSNNN RECORD.                                     014600      
000729     MOVE ZERO TO WKS-CONTADOR                                    014700      
000730     PERFORM 500-LEE-A01-MOVSNNN                                  014800      
000731     PERFORM 200-REGRABA UNTIL                                    014900      
000732             WKS-CONTADOR > WKS-B01-NIVARCMOV(WKS-DIASEM) OR      015000      
000733             W77-FIN = 1.                                         015100      
000734*    MOVE 38880                   TO WKS-CONTADOR.                015200      
000735*    PERFORM 210-REGRABA-REG.                                     015300      
000736     CLOSE A01-MOVSNNN WITH SAVE.                                 015400      
000737     STOP RUN.                                                    015500      
000738                                                                  015600      
000739 100-BUSCA-IND-FECARCMOV.                                         015620      
000740*========================                                         015640      
000741     EXIT.                                                        015660      
000742                                                                  015680      
000743 200-REGRABA.                                                     015700      
000744*============                                                     015800      
000745     PERFORM 500-LEE-A01-MOVSNNN                                  015900      
000746     IF A00-R01-FUNCION = 99 AND W77-FIN = ZERO                   016000      
000747        MOVE 11                     TO A00-R01-FUNCION            016100      
000748        MOVE W77-SISTEMA-PARAMETRO  TO A00-R01-SISTEMA            016120      
000749        COMPUTE  A00-R01-AUT-S151 = WKS-CONTADOR - 1              016140      
000750        MOVE WKS-B01-FECCON         TO A00-R01-FECCONT            016160      
000751        MOVE 1                      TO A00-R01-STATUS             016180      
000752        REWRITE A00-R01-REGMOV  INVALID KEY NEXT SENTENCE.        016200      
000753                                                                  016300      
000754*    PERFORM 500-LEE-A01-MOVSNNN.                                 016400      
000755                                                                  016500      
000756 210-REGRABA-REG.                                                 016600      
000757*================                                                 016700      
000758   IF A00-R01-FUNCION = 99     AND                                016800      
000759      WKS-CONTADOR < 2000000   AND                                016900      
000760      W77-FIN = 0                                                 017000      
000761      ADD 1                 TO W77-NUMREG                         017100      
000762      MOVE 11               TO A00-R01-FUNCION                    017200      
000763      REWRITE A00-R01-REGMOV  INVALID KEY                         017300      
000764           MOVE A00-R01-AUT-S151     TO W77-AUT                   017400      
000765           DISPLAY "ERROR EN REG. " W77-AUT.                      017500      
000766     PERFORM 500-LEE-A01-MOVSNNN.                                 017600      
000767                                                                  017700      
000768 500-LEE-A01-MOVSNNN.                                             017800      
000769*====================                                             017900      
000770    ADD 1 TO WKS-CONTADOR                                         018000      
000771    READ A01-MOVSNNN AT END                                       018100      
000772         MOVE 1          TO W77-FIN.                              018200      
000773                                                                  018300      
000774 020400-LIBRERIAS.                                                018400      
000775*=================                                                018500      
000776    CHANGE ATTRIBUTE LIBACCESS         OF "CTRLVERS"              018600      
000777                                       TO BYFUNCTION.             018700      
000778    CHANGE ATTRIBUTE FUNCTIONNAME      OF "CTRLVERS"              018800      
000779                                       TO "CTLVERS".              018900      
000780    CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION.      019000      
000781    CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP".        019100      
000782    CHANGE ATTRIBUTE TITLE             OF "LIB-DISP"              019200      
000783       TO "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".        019300      
000784                                                                  019400      
000785*****************      LIGA S080 CONCEPTOS   *******************  019500      
000786    MOVE "S080BD01CON"                 TO     WKS-CTLVER-LIBID.   019600      
000787    CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID    019700      
000788                                              WKS-CTLVER-NOMLIB   019800      
000789                                       GIVING W77-CTLVER-RESULT.  019900      
000790     IF W77-CTLVER-RESULT = 0                                     020000      
000791        CHANGE ATTRIBUTE TITLE OF "S080L710"                      020100      
000792                                       TO     WKS-CTLVER-NOMLIB.  020200      
000793                                                                  020300      
000794                                                                  020400      
000795*********** OBTIENE NOMBRE DEL ARCHIVO DE MOVS ****************** 020500      
000796    MOVE "S151L001CTL"                 TO     WKS-CTLVER-LIBID.   020600      
000797    CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID    020700      
000798                                              WKS-CTLVER-NOMLIB   020800      
000799                                       GIVING W77-CTLVER-RESULT.  020900      
000800     IF W77-CTLVER-RESULT = 0                                     021000      
000801        CHANGE ATTRIBUTE TITLE         OF "S151-L001"             021100      
000802                                       TO WKS-CTLVER-NOMLIB       021200      
000803     ELSE                                                         021300      
000804        CHANGE ATTRIBUTE TITLE         OF "S151-L001" TO          021400      
000805               "(S151)S151/OBJECT/L001/CONTROL ON CMEMP.".        021500      
000806                                                                  021600      
000807     MOVE W77-SISTEMA-PARAMETRO        TO WKS-B01-SISTEMA         021700      
000808     MOVE 01                           TO WKS-B01-FUNCION.        021800      
000809     CALL "CONSISDIA IN S151-L001"     USING  WKS-S151B01SISDIA   021900      
000810                                       GIVING W77-RESULT-B01.     022000      
000811                                                                  022100      
000812     IF W77-RESULT-B01 > 0                                        022200      
000813        MOVE W77-RESULT-B01            TO W77-ERROR               022300      
000814        STRING "NO PUEDO OBTENER FECHA DE PROCESO "               022400      
000815               " ERROR EN S151-L001 S" W77-SISTEMA-PARAMETRO      022500      
000816               ", ERR #" W77-ERROR                                022550      
000817        DELIMITED BY SIZE INTO TEXTO-LJ                           022600      
000818        MOVE "O"                       TO TIPO-LJ                 022700      
000819        MOVE 020901                    TO CODIGO-LJ               022800      
000820        CALL "LJ IN LIB-DISP"          USING CONTADOR-LJ,         022900      
000821                                             MENSAJE-LJ           023000      
000822        SET MYSELF(STATUS) TO -1                                  023100      
000823     ELSE                                                         023200      
000824        MOVE WKS-B01-NOMPACMOV         TO WKS-PACK-MOVS.          023300      
