000001$SET LINEINFO OPTIMIZE LIST                                       000200      
000002$SET OPTIMIZE                                                     000400      
000003$SET LISTOMITTED                                                  000600      
000004*$SET TADS                                                        000800      
000005 IDENTIFICATION DIVISION.                                         001000      
000006 PROGRAM-ID. FILESCTAMDRED.                                       001200      
000007 AUTHOR. JUAN GERARDO TOVAR RAMIREZ.                              001400      
000008                                                                  001600      
000009 ENVIRONMENT DIVISION.                                            001800      
000010 INPUT-OUTPUT SECTION.                                            002000      
000011 FILE-CONTROL.                                                    002200      
000012                                                                  002400      
000013     SELECT A01-MOVS500   ASSIGN       TO DISK                    002600      
000014                          ORGANIZATION IS SEQUENTIAL              002800      
000015                          ACCESS MODE  IS SEQUENTIAL              003000      
000016                          ACTUAL KEY   IS W77-NUMREG-MOV500.      003200      
000017                                                                  003400      
000018     SELECT A02-DESS500   ASSIGN       TO DISK                    003600      
000019                          ACCESS MODE IS RANDOM                   003800      
000020                          ACTUAL KEY IS W77-LLAVE.                004000      
000021                                                                  004200      
000022     SELECT A03-CTL-ENVIO ASSIGN       TO DISK                    004400      
000023                          ACCESS MODE  IS SEQUENTIAL              004600      
000024                          ACTUAL KEY   IS W77-NUMREG-ACC.         004800      
000025                                                                  005000      
000026     SELECT A04-CTAMRE-ARCHIVO     ASSIGN   TO DISK.              005200      
000027                                                                  005400      
000028     SELECT A04-CTAMRE-ARCHIVO-D   ASSIGN   TO DISK.              005600      
000029                                                                  005800      
000030     SELECT A05-AUTORIZACIONES     ASSIGN   TO DISK               006000      
000031                                   ORGANIZATION IS INDEXED        006200      
000032                                   ACCESS MODE IS DYNAMIC         006400      
000033                                   RECORD KEY  IS KEY-AUTS151.    006600      
000034                                                                  006800      
000035 DATA        DIVISION.                                            007000      
000036 FILE SECTION.                                                    007200      
000037 FD A01-MOVS500                                                   007400      
000038*==============                                                   007600      
000039    VALUE OF TITLE       IS WKS-TITLE-MOVS500                     007800      
000040    VALUE OF BUFFERS IS 1                                         008000      
000041    BLOCK  CONTAINS 144 RECORDS.                                  008200      
000042                                                                  008400      
000043    01 A01-R01-S500               PIC X(450).                     008600      
000044                                                                  008800      
000045 FD A02-DESS500                                                   009000      
000046*==============                                                   009200      
000047    VALUE OF TITLE       IS WKS-TITLE-DESS500                     009400      
000048    VALUE OF BUFFERS IS 1                                         009600      
000049    BLOCK  CONTAINS 120 RECORDS.                                  009800      
000050                                                                  010000      
000051    01 A02-R01-S500               PIC X(540).                     010200      
000052                                                                  010400      
000053 FD A03-CTL-ENVIO                                                 010600      
000054    VALUE OF TITLE       IS WKS-CTLENV.                           010800      
000055                                                                  011000      
000056 01 R01-REG-ENVIO.                                                011200      
000057    03 R01-REG-AUTS500            PIC 9(08).                      011400      
000058    03 R01-REG-AUTS500-D          PIC 9(08).                      011600      
000059    03 R01-REG-SECDET             PIC 9(08).                      012200      
000060    03 R01-REG-SECDET-DOL         PIC 9(08).                      012400      
000061    03 R01-REG-IND-ENV            PIC 9(06).                      012600      
000062    03 R01-REG-IND-ENV-D          PIC 9(06).                      012800      
000063    03 FILLER                     PIC X(08).                      013000      
000064                                                                  013200      
000065    03 R01-REG-STATUS-FILE        PIC 9(01).                      013400      
000066    03 R01-REG-IND-ARCH           PIC 9(06).                      013600      
000067    03 R01-REG-STATUS-FILE-D      PIC 9(01).                      013800      
000068    03 R01-REG-IND-ARCH-D         PIC 9(06).                      014000      
000069                                                                  014200      
000070    03 R01-REG-TOTAL-MOV-PES         PIC 9(08).                   014400      
000071    03 R01-REG-ABON-PES              PIC 9(08).                   014600      
000072    03 R01-REG-TOTAL-ABON-PES        PIC 9(16)V99.                014800      
000073    03 R01-REG-CARG-PES              PIC 9(08).                   015000      
000074    03 R01-REG-TOTAL-CARG-PES        PIC 9(16)V99.                015200      
000075                                                                  015400      
000076    03 R01-REG-TOTAL-MOV-ELIM-PES    PIC 9(08).                   015600      
000077    03 R01-REG-ABON-ELIM-PES         PIC 9(08).                   015800      
000078    03 R01-REG-TOTAL-ABON-ELIM-PES   PIC 9(16)V99.                016000      
000079    03 R01-REG-CARG-ELIM-PES         PIC 9(08).                   016200      
000080    03 R01-REG-TOTAL-CARG-ELIM-PES   PIC 9(16)V99.                016400      
000081                                                                  016600      
000082    03 R01-REG-TOTAL-MOV-DOL         PIC 9(08).                   016800      
000083    03 R01-REG-ABON-DOL              PIC 9(08).                   017000      
000084    03 R01-REG-TOTAL-ABON-DOL        PIC 9(16)V99.                017200      
000085    03 R01-REG-CARG-DOL              PIC 9(08).                   017400      
000086    03 R01-REG-TOTAL-CARG-DOL        PIC 9(16)V99.                017600      
000087                                                                  017800      
000088    03 R01-REG-TOTAL-MOV-ELIM-DOL    PIC 9(08).                   018000      
000089    03 R01-REG-ABON-ELIM-DOL         PIC 9(08).                   018200      
000090    03 R01-REG-TOTAL-ABON-ELIM-DOL   PIC 9(16)V99.                018400      
000091    03 R01-REG-CARG-ELIM-DOL         PIC 9(08).                   018600      
000092    03 R01-REG-TOTAL-CARG-ELIM-DOL   PIC 9(16)V99.                018800      
000093                                                                  019000      
000094* ARCHIVO ITRADAY EN PESOS                                        019200      
000095 FD A04-CTAMRE-ARCHIVO                                            019400      
000096    VALUE OF MAXRECSIZE  IS 320                                   019600      
000097    BLOCK CONTAINS       198 RECORDS.                             019800      
000098                                                                  020000      
000099    01 A04-REG-CTAMRE             PIC X(320).                     020200      
000100* EN DOLAR                                                        020400      
000101 FD A04-CTAMRE-ARCHIVO-D                                          020600      
000102    VALUE OF MAXRECSIZE  IS 320                                   020800      
000103    BLOCK CONTAINS       198 RECORDS.                             021000      
000104                                                                  021200      
000105    01 A04-REG-CTAMRE-D           PIC X(320).                     021400      
000106                                                                  021600      
000107 FD A05-AUTORIZACIONES                                            021800      
000108    VALUE OF MAXRECSIZE  IS 162                                   022000      
000109    BLOCK CONTAINS       400 RECORDS                              022200      
000110    VALUE OF TITLE       IS WKS-TIT-AUTORIZA.                     022400      
000111                                                                  022600      
000112 01 R01-REG-AUTORIZA.                                             022800      
000113    03 KEY-AUTS151.                                               023000      
000114       05 R01-REG-AUTS500EXT      PIC 9(08).                      023200      
000115    03 R01-REG-AUTAELIM           PIC 9(08)       COMP.           023400      
000116    03 R01-REG-AUTANTS151         PIC 9(08)       COMP.           023600      
000117    03 R01-REG-TIP-PROC           PIC 9(02)       COMP.           023800      
000118    03 R01-REG-TRANSACCIONES     OCCURS 5 TIMES.                  024000      
000119       05 R01-REG-CVETRAN            PIC 9(04)    COMP.           024200      
000120       05 R01-REG-IMPORTE            PIC 9(16)V99 COMP.           024400      
000121    03 R01-REG-500SUCPRECU        PIC 9(04)       COMP.           024600      
000122    03 R01-REG-500NUMCUEMDA       PIC 9(12)       COMP.           024800      
000123    03 R01-REG-500MONEDA          PIC 9(04)       COMP.           025000      
000124    03 R01-REG-500REFNUM          PIC 9(12)       COMP.           025200      
000125    03 R01-REG-500NUMAUTORIZAS    PIC 9(08)       COMP.           025400      
000126    03 R01-REG-500SUCTRAS         PIC 9(04)       COMP.           025600      
000127    03 R01-REG-500NUMCAJTRA       PIC 9(02)       COMP.           025800      
000128    03 R01-REG-HORMOV             PIC 9(06)       COMP.           026000      
000129    03 R01-REG-FECMOV             PIC 9(06).                      026200      
000130    03 R01-REG-STATUS             PIC 9(02)       COMP.           026400      
000131    03 FILLER                     PIC X(57).                      026600      
000132                                                                  026800      
000133 WORKING-STORAGE SECTION.                                         027000      
000134                                                                  027200      
000135*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000136* COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS ON CMEMP.".             027400      
000137                                                                  000100      
000138******************************************************************000200      
000139**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
000140**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
000141**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
000142******************************************************************000600      
000143                                                                  000700      
000144 01 A00-R00-HDR-MOV .                                             000800      
000145    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
000146    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
000147    02 FILLER                          PIC  X(08).                001100      
000148    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
000149    02 FILLER                          PIC  X(430).               001300      
000150                                                                  001400      
000151 01 A00-R01-REGMOV .                                              001500      
000152    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
000153    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
000154    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
000155                                                                  001900      
000156    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
000157    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
000158                                       PIC  9(04)      COMP.      002200      
000159    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
000160                                       PIC  9(04)      COMP.      002400      
000161                                                                  002500      
000162    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000163    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
000164                                       PIC  9(02)      COMP.      002800      
000165    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
000166                                       PIC  9(02)      COMP.      003000      
000167    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
000168    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
000169                                       A00-R01-SERVICIO-ALERTA.   003060      
000170       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
000171       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
000172    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
000173    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
000174    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
000175                                       PIC  9(04)      COMP.      003420      
000176    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
000177    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
000178                                       PIC  9(04)      COMP.      003520      
000179    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
000180    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
000181    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
000182                                       PIC  9(02)      COMP.      003900      
000183                                                                  004000      
000184    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
000185    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
000186       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
000187          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
000188          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
000189          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
000190          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
000191          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
000192          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
000193          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
000194                                                                  005100      
000195    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
000196       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
000197       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
000198       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
000199       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
000200       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
000201       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
000202       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
000203                                                                  006000      
000204       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
000205       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
000206       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
000207       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
000208       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
000209       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
000210       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
000211                                                                  006800      
000212       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
000213       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
000214       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
000215       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
000216       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
000217       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
000218       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
000219                                                                  007600      
000220       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
000221       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
000222       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
000223       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
000224       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
000225       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
000226       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
000227                                                                  008400      
000228       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
000229       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
000230       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
000231       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
000232       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
000233       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
000234       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
000235                                                                  009200      
000236    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
000237    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
000238    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
000239    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
000240    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
000241    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
000242       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
000243    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
000244    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
000245    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
000246    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
000247    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
000248    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
000249    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
000250    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
000251       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
000252       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
000253    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
000254    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
000255    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
000256    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
000257    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
000258    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
000259    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
000260    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
000261    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
000262    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
000263    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
000264    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
000265    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
000266    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
000267                                       PIC X(10).                 012600      
000268    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
000269       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
000270       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
000271    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
000272    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
000273    03 A00-R01-FILIAL                  PIC  X(05).                013200      
000274    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
000275       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
000276       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
000277                                                                  013300      
000278    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
000279    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
000280                                       PIC  X(09).                013600      
000281    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
000282                                       PIC  9(18)      COMP.      013800      
000283    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
000284    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
000285                                       PIC  X(9).                 014100      
000286    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
000287    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
000288                                       PIC  X(05).                014400      
000289    03 A00-R01-NIO                     PIC  X(16).                014500      
000290    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
000291    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
000292    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
000293       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
000294    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
000295    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
000296       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
000297    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
000298    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
000299    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
000300    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
000301    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
000302    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
000303                                       PIC  X(04).                015900      
000304    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
000305    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
000306    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
000307                                       PIC  9(04)      COMP.      016300      
000308    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
000309    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
000310    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
000311    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
000312    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
000313                                                                  016900      
000314    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
000315    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
000316       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
000317    03 A00-R01-FILXAPL                 PIC X(165).                017300      
000318                                                                  017400      
000319    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
000320       05 FILLER                       PIC X(96).                 017510      
000321       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
000322       05 FILLER                       PIC X(67).                 017700      
000323                                                                  017702      
000324    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
000325       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
000326       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
000327       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
000328       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
000329       06 WKS-MOV-FILS084              PIC X(154).                017714      
000330                                                                  017800      
000331    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
000332       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
000333       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
000334       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
000335       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
000336       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
000337       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
000338       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
000339       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
000340       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018160      
000341       05 FILLER                       PIC X(62).                 018170      
000342       05 A00-R01-CTE-087              PIC X(07).                 018210      
000343       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
000344          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
000345          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
000346          07 FILLER                    PIC X(01).                 018281      
000347       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
000348       05 FILLER                       PIC X(61).                 018400      
000349                                                                  018500      
000350    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
000351       05 FILLER                       PIC  X(96).                018610      
000352       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
000353       05 FILLER                       PIC  X(65).                018630      
000354                                                                  018640      
000355    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
000356       05 A00-R01-FORMATO0             PIC  9(02).                018700      
000357       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
000358       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
000359       05 FILLER                       PIC  X(141).               018910      
000360                                                                  019100      
000361    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
000362       05 A00-R01-FORMATO1             PIC  9(02).                019300      
000363       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
000364       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
000365       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
000366       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
000367       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
000368       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
000369       05 A00-R01-ENTSAL               PIC  X(01).                020000      
000370       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
000371       05 FILLER                       PIC  X(69).                020200      
000372                                                                  020300      
000373    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
000374       05 A00-R01-FORMATO2             PIC  9(02).                020500      
000375       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
000376       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
000377       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
000378       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
000379       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
000380       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
000381       05 FILLER                       PIC  X(77).                021200      
000382                                                                  021300      
000383    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
000384       05 A00-R01-FORMATO3             PIC  9(02).                021500      
000385       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
000386       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
000387       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
000388       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
000389       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
000390       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
000391       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
000392       05 FILLER                       PIC  X(69).                022300      
000393                                                                  022400      
000394    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
000395       05 A00-R01-FORMATO4             PIC  9(02).                022600      
000396       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
000397       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
000398       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
000399       05 A00-R01-RFCFT04              PIC  X(13).                023000      
000400       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
000401       05 A00-R01-DIRECCION            PIC  X(40).                023200      
000402       05 FILLER                       PIC  X(85).                023300      
000403                                                                  023400      
000404    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
000405       05 A00-R01-COBERTURA            PIC  X(01).                023408      
000406       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
000407       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
000408       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
000409       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
000410       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
000411       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
000412       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
000413       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
000414       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
000415       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
000416       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
000417       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
000418       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
000419       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
000420       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
000421       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
000422       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
000423       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
000424       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
000425       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
000426       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
000427       05 FILLER                       PIC  X(05).                023492      
000428                                                                  023497      
000429    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
000430       05 A00-R01-4CEROS               PIC  9(04).                023600      
000431       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
000432       05 FILLER                       PIC  X(157).               023800      
000433                                                                  023900      
000434    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
000435       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
000436        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
000437       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
000438       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
000439       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
000440       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
000441       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
000442       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
000443       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
000444       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
000445       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
000446       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
000447       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
000448       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
000449       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
000450       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
000451       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
000452       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
000453       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
000454       05 A00-R01-FILLER               PIC  X(41).                025850      
000455       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
000456       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
000457       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
000458       05 A00-R01-INDPAGO              PIC  9(01).                026200      
000459       05 FILLER                       PIC  X(01).                026210      
000460       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
000461       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
000462       05 FILLER                       PIC  X(52).                026300      
000463                                                                  026400      
000464    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
000465       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
000466       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
000467       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
000468       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
000469       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
000470       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
000471       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
000472       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
000473       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
000474       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
000475       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
000476       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
000477       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
000478          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
000479          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
000480       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
000481       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
000482          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
000483       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
000484          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
000485       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
000486          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
000487       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
000488          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
000489       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
000490          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
000491       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
000492          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
000493       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
000494          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
000495       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
000496          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
000497       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
000498          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
000499       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
000500          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
000501          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
000502       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
000503       05 FILLER                       PIC X(01).                 030101      
000504       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
000505       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
000506       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
000507       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
000508       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
000509       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
000510       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
000511       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
000512          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
000513       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
000514       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
000515       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
000516       05 FILLER                       PIC X(14).                 030700      
000517                                                                  030800      
000518    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
000519       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
000520       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
000521       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
000522       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
000523       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
000524       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
000525       05 A00-R01-151-CITI             PIC  9(02)     COMP.       031520      
000526       05 A00-R01-151-IND-BNE          PIC  9(02)     COMP.       031540      
000527       05 FILLER                       PIC  X(140).               031600      
000528                                                                  031700      
000529    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
000530       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
000531       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
000532       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
000533       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
000534       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
000535       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
000536       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
000537       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
000538       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
000539       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
000540          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
000541          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
000542          07 FILLER                    PIC  X(08).                032740      
000543       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
000544       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
000545       05 A00-R01-NOMORD               PIC  X(30).                033000      
000546       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
000547       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
000548       05 A00-R01-REF-CECO             PIC  X(07).                033500      
000549       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
000550       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
000551          A00-R01-NUM-ORD-PAGO.                                   033800      
000552          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
000553          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
000554                                                                  034100      
000555    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
000556       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
000557       05 A00-R01-RFC-S501             PIC  X(13).                034160      
000558       05 FILLER                       PIC  X(151).               034180      
000559                                                                  034190      
000560    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
000561       05 A00-R01-DATOS-S701           PIC X(116).                034300      
000562       05 A00-R01-PAG-SERV             REDEFINES                  034400      
000563                                       A00-R01-DATOS-S701.        034500      
000564          07 A00-R01-ID                PIC X(30).                 034600      
000565          07 A00-R01-FECREC            PIC 9(06).                 034700      
000566          07 A00-R01-REF1              PIC X(20).                 034800      
000567          07 A00-R01-REF2              PIC X(20).                 034900      
000568          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
000569          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
000570                                       A00-R01-TIPOPAGO.          035200      
000571             09 A00-R01-ESTAB          PIC 9(04).                 035300      
000572             09 A00-R01-SEQ            PIC 9(02).                 035400      
000573          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
000574          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
000575          07 A00-R01-EBPP              PIC 9(03).                 035700      
000576          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
000577          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
000578          07 FILLER                    PIC X(01).                 035728      
000579          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
000580          07 FILLER                    PIC X(18).                 035760      
000581       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
000582                                       A00-R01-DATOS-S701.        035900      
000583          07 A00-R01-RFC               PIC X(13).                 036000      
000584          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
000585          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
000586          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
000587          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
000588          07 FILLER                    PIC X(85).                 036200      
000589       05 FILLER                       PIC X(49).                 036300      
000590                                                                  036400      
000591    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
000592       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
000593       05 A00-R01-CTA-S702             PIC X(40).                 036700      
000594       05 FILLER                       PIC X(113).                036710      
000595                                                                  036720      
000596    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
000597       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
000598       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
000599       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
000600       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
000601       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
000602       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
000603       05 FILLER                       PIC X(72).                 036800      
000604                                                                  036810      
000605                                                                  036820      
000606    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
000607       05 A00-R01-TRUI-S711.                                      036915      
000608          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
000609          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
000610          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
000611           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
000612          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
000613       05 A00-R01-MICR-S711.                                      036945      
000614          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
000615          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
000616          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
000617          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
000618          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
000619          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
000620          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
000621          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
000622       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
000623       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
000624       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
000625       05 A00-R01-FIL-S711             PIC X(05).                 036965      
000626       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
000627       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
000628       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
000629                                                                  036990      
000630    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
000631       05 A00-R01-RFC-502              PIC  X(13).                037100      
000632       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
000633          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
000634          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
000635          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
000636          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
000637          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
000638          07 FILLER                    PIC  9(01) COMP.           037650      
000639       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
000640       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
000641       05 FILLER                       PIC  X(06).                038680      
000642                                                                  038682      
000643    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
000644       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
000645       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
000646       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
000647       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
000648       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
000649       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
000650       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
000651       05 FILLER                       PIC  X(81).                038750      
000652                                                                  038755      
000653    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
000654       05 A00-R01-COP                  PIC  9(13)        .        038900      
000655       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
000656       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
000657       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
000658       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
000659       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
000660       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
000661       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
000662       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
000663       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
000664       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
000665       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
000666       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
000667       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
000668       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
000669       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
000670       05 FILLER                       PIC  X(81)        .        040800      
000671                                                                  040810      
000672    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
000673       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
000674       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
000675       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
000676       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
000677       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
000678       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
000679       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
000680       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
000681       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
000682       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
000683       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
000684       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
000685       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
000686       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
000687       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
000688       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
000689       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
000690       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
000691       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
000692       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
000693       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
000694       05 FILLER                       PIC  X(18).                041040      
000695                                                                  041400      
000696    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
000697    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
000698*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000699                                                                  027600      
000700*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000701* COPY "(S151)S151/FORMATO/ARCHIVO/DATOSADIC ON CMEMP.".          027800      
000702 01 A01-R00-HDR-DES .                                             000100      
000703     03 A00-R00-HDR-HD                 PIC X(02).                 000200      
000704     03 A00-R00-HDR-FCH                PIC 9(08).                 000300      
000705     03 FILLER                         PIC X(530).                000400      
000706 01 A01-R01-DATOS.                                                000500      
000707     03 A01-R01-AUTS151ORI             PIC 9(08) COMP.            000600      
000708     03 A01-R01-DATOS-1.                                          000610      
000709        05 A01-R01-REF-BANAMEX         PIC X(26).                 000620      
000710        05 A01-R01-CVECON-YREFLOC REDEFINES                       000640      
000711           A01-R01-REF-BANAMEX         PIC X(26).                 000700      
000712        05 A01-R01-CVECON-Y-REFV REDEFINES A01-R01-REF-BANAMEX.   000800      
000713           07 A01-R01-CONT-ORIG        PIC 9(20) COMP.            000900      
000714           07 A01-R01-REFLOC-BNM       PIC X(12).                 001000      
000715           07 A01-R01-REFLOC-23POS REDEFINES A01-R01-REFLOC-BNM.  001100      
000716              09 A01-R01-COMPREF       PIC 9(01) COMP.            001200      
000717              09 A01-R01-REF23POS      PIC 9(23) COMP.            001250      
000718           07 A01-R01-REFALFA REDEFINES A01-R01-REFLOC-BNM        001270      
000719                                       PIC X(12).                 001290      
000720           07 FILLER                   PIC X(04).                 001300      
000721        05 A01-R01-REFLOC7-BNM REDEFINES A01-R01-REF-BANAMEX.     001400      
000722           07 FILLER                   PIC X(02).                 001500      
000723           07 A01-R01-LOC07BNM         PIC X(24).                 001600      
000724        05 A01-R01-NOMINA-FUN1         PIC 9(14) COMP.            003600      
000725        05 A01-R01-NOMINA-FUN2         PIC 9(14) COMP.            003700      
000726        05 A01-R01-SDO-FIN.                                       003720      
000727           07 A01-R01-SDO-FIN-S500     PIC S9(15)V99 COMP.        003740      
000728           07 FILLER                   PIC X(05).                 003760      
000729        05 A01-R01-NOMINAS-MC REDEFINES A01-R01-SDO-FIN.          003780      
000730           07 A01-R01-NOM-MAKER        PIC 9(14) COMP.            003800      
000731           07 A01-R01-NOM-CHECKER      PIC 9(14) COMP.            003900      
000732        05 A01-R01-REF-CLIENTE         PIC X(16).                 004000      
000733        05 A01-R01-REFERENCIA1         PIC X(35).                 004100      
000734        05 A01-R01-REFERENCIA1-S500 REDEFINES A01-R01-REFERENCIA1.004110      
000735           07 A01-R01-ORIG-HRAMOV      PIC 9(06).                 004120      
000736           07 A01-R01-ORIG-FECMOV      PIC 9(06).                 004130      
000737           07 A01-R01-ORIG-FOLIO       PIC X(12).                 004140      
000738           07 A01-R01-ORIG-MDE         PIC 9(02).                 004150      
000739           07 A01-R01-ORIG-FILREF1     PIC X(09).                 004160      
000740        05 A01-R01-REF2-CTE            PIC X(35).                 004200      
000741        05 A01-R01-REF3-CTE            PIC X(35).                 004300      
000742        05 A01-R01-REF4-CTE            PIC X(35).                 004400      
000743        05 A01-R01-DATOS-2.                                       004450      
000744           07 A01-R01-LEY1             PIC X(40).                 004500      
000745           07 A01-R02-LEY2             PIC X(40).                 004600      
000746           07 A01-R02-LEY3             PIC X(40).                 004700      
000747           07 A01-R02-LEY4             PIC X(40).                 004800      
000748           07 A01-R02-LEY5             PIC X(40).                 004900      
000749           07 A01-R01-FILXAPL          PIC X(120).                004910      
000750           07 A01-R01-FILXAPL-S203 REDEFINES A01-R01-FILXAPL.     004912      
000751              09 A01-R01-CVE-IMPTO10   PIC 9(06).                 004914      
000752              09 A01-R01-FORMA-PAG10   PIC 9(03).                 004916      
000753              09 A01-R01-IMP-IMPTO10   PIC 9(12).                 004918      
000754              09 A01-R01-CVE-IMPTO11   PIC 9(06).                 004920      
000755              09 A01-R01-FORMA-PAG11   PIC 9(03).                 004922      
000756              09 A01-R01-IMP-IMPTO11   PIC 9(12).                 004924      
000757              09 A01-R01-CVE-IMPTO12   PIC 9(06).                 004926      
000758              09 A01-R01-FORMA-PAG12   PIC 9(03).                 004928      
000759              09 A01-R01-IMP-IMPTO12   PIC 9(12).                 004930      
000760              09 A01-R01-CVE-IMPTO13   PIC 9(06).                 004932      
000761              09 A01-R01-FORMA-PAG13   PIC 9(03).                 004934      
000762              09 A01-R01-IMP-IMPTO13   PIC 9(12).                 004936      
000763              09 A01-R01-CVE-IMPTO14   PIC 9(06).                 004938      
000764              09 A01-R01-FORMA-PAG14   PIC 9(03).                 004940      
000765              09 A01-R01-IMP-IMPTO14   PIC 9(12).                 004942      
000766              09 FILLER                PIC X(15).                 004944      
000767                                                                  004946      
000768*          07 A01-R01-FILXAPL-S711 REDEFINES A01-R01-FILXAPL.     004948      
000769*             09 A01-R01-TRUI-S711.                               004949      
000770*                11 A01-R01-CSIREC-S711 PIC 9(08) COMP.           004950      
000771*                11 A01-R01-CSIOR-S711  PIC 9(08) COMP.           004951      
000772*                11 A01-R01-NUMOP-S711  PIC 9(08) COMP.           004952      
000773*                11 A01-R01-NUMTR-S711  PIC 9(08) COMP.           004953      
000774*                11 A01-R01-INSMN-S711  PIC 9(02) COMP.           004954      
000775*             09 A01-R01-MICR-S711.                               004955      
000776*                11 A01-R01-CODSEG-S711 PIC 9(04) COMP.           004956      
000777*                11 A01-R01-VERPRE-S711 PIC 9(02) COMP.           004957      
000778*                11 A01-R01-CTRMON-S711 PIC 9(02) COMP.           004958      
000779*                11 A01-R01-PLCEC-S711  PIC 9(04) COMP.           004959      
000780*                11 A01-R01-BNCEM-S711  PIC 9(04) COMP.           004960      
000781*                11 A01-R01-DVEIN-S711  PIC 9(02) COMP.           004961      
000782*                11 A01-R01-CTACH-S711  PIC 9(12) COMP.           004962      
000783*                11 A01-R01-REFCH-S711  PIC 9(08) COMP.           004963      
000784*             09 A01-R01-CTABEN-S711    PIC 9(20) COMP.           004964      
000785*             09 A01-R01-BCREC-S711     PIC 9(04) COMP.           004965      
000786*             09 A01-R01-NOMBEN-S711    PIC X(40).                004966      
000787*             09 A01-R01-RFCBCO-S711    PIC X(13).                004967      
000788*             09 A01-R01-FILLER-S711    PIC X(19).                004968      
000789                                                                  004969      
000790           07 A01-R01-FILXAPL-S701 REDEFINES A01-R01-FILXAPL.     004970      
000791              09 A01-R01-NVAAUT-S701   PIC 9(08).                 004971      
000792              09 A01-R01-NVASUCTR-S701 PIC 9(04).                 004972      
000793              09 A01-R01-NVACAJTR-S701 PIC 9(02).                 004973      
000794              09 A01-R01-NVAFECT-S701  PIC 9(08).                 004974      
000795              09 A01-R01-NVOMDPA-S701  PIC 9(02).                 004975      
000796              09 A01-R01-NVALINC-S701  PIC X(30).                 004976      
000797              09 A01-R01-FILLER2-S701  PIC X(66).                 004977      
000798                                                                  004978      
000799           07 A01-R01-FILXAPL-S702 REDEFINES A01-R01-FILXAPL.     004979      
000800              09 A01-R01-STTRAN-S702   PIC 9(01).                 004980      
000801              09 A01-R01-CTEEMI-S702   PIC 9(12) COMP.            004981      
000802              09 A01-R01-CTADES-S702   PIC 9(20) COMP.            004982      
000803              09 A01-R01-IDEORI-S702   PIC 9(01).                 004983      
000804              09 A01-R01-IDEDES-S702   PIC 9(01).                 004984      
000805              09 A01-R01-TCTAEM-S702   PIC 9(02) COMP.            004985      
000806              09 A01-R01-TIARCH-S702   PIC X(01).                 004986      
000807              09 A01-R01-FECARC-S702   PIC 9(08) COMP.            004987      
000808              09 A01-R01-SECARC-S702   PIC 9(02) COMP.            004988      
000809              09 A01-R01-AUTORI-S702   PIC 9(20) COMP.            004989      
000810              09 A01-R01-NOMUSU-S702   PIC X(40).                 004990      
000811              09 A01-R01-TCTAUS-S702   PIC 9(02) COMP.            004991      
000812              09 A01-R01-SUCCON-S702   PIC 9(04) COMP.            004992      
000813              09 A01-R01-CAJCON-S702   PIC 9(04) COMP.            004993      
000814              09 A01-R01-FILLER-S702   PIC X(39).                 004994      
000815                                                                  004995      
000816           07 A01-R01-FILXAPL-S500 REDEFINES A01-R01-FILXAPL.     004996      
000817              09 A01-R01-NOMB-CTE          PIC  X(36).            004997      
000818              09 A01-R01-NOMB-BENEF        PIC  X(50).            004998      
000819              09 A01-R01-CVE-RASTREO-S500  PIC  X(30).            004999      
000820* INI VML                                                         005000      
000821              09 A01-R01-CVE-RASTREO-S500-R REDEFINES             005001      
000822                              A01-R01-CVE-RASTREO-S500.           005002      
000823                 11 A01-R01-TIP-CTA-TRASP  PIC 9(02).             005004      
000824                 11 A01-R01-BCO-CTA-TRASP  PIC 9(05).             005006      
000825                 11 A01-R01-NUM-CTA-TRASP  PIC 9(18).             005007      
000826                 11 A01-R01-FILLER-TRASP   PIC X(05).             005008      
000827* FIN VML                                                         005009      
000828              09 A01-R01-FECHA-PAGO        PIC  9(08)     COMP.   005010      
000829        05 A01-R01-DATOS-2-S264 REDEFINES A01-R01-DATOS-2.        005012      
000830           07 A01-R01-NOMINA-FUN3      PIC 9(14) COMP.            005014      
000831           07 A01-R01-COMISION         PIC 9(10)V99 COMP.         005016      
000832           07 A01-R01-SITUACION        PIC 9(10)V99 COMP.         005018      
000833           07 A01-R01-IVA-COMIS        PIC 9(08)V99 COMP.         005020      
000834           07 A01-R01-IVA-SITUACION    PIC 9(08)V99 COMP.         005022      
000835           07 A01-R01-IVA-FISCAL       PIC 9(12)V99 COMP.         005024      
000836           07 A01-R01-FOLIO-RECEP      PIC 9(10) COMP.            005026      
000837           07 A01-R01-OCUPACION        PIC X(40).                 005028      
000838           07 A01-R01-POBLACION        PIC X(40).                 005030      
000839           07 A01-R01-TIPO-CTA         PIC 9(02) COMP.            005032      
000840           07 A01-R01-NUM-CTE          PIC 9(12) COMP.            005034      
000841           07 A01-R01-NUM-CTA          PIC 9(20) COMP.            005036      
000842           07 A01-R01-CVE-TIPO-IDEN    PIC 9(02) COMP.            005038      
000843           07 A01-R01-NUM-IDEN-OFIC    PIC X(18).                 005040      
000844           07 A01-R01-FECHA-NAC-BEN    PIC 9(08) COMP.            005042      
000845           07 A01-R01-DOMICILIO        PIC X(55).                 005044      
000846           07 A01-R01-COLONIA          PIC X(30).                 005046      
000847           07 A01-R01-TELEFONO         PIC X(10).                 005048      
000848           07 A01-R01-COD-POS          PIC 9(06) COMP.            005050      
000849           07 A01-R01-REF-EMISOR       PIC X(20).                 005052      
000850           07 A01-R01-PIN              PIC 9(12) COMP.            005054      
000851           07 A01-R01-TIPO-CHQ-ORD     PIC 9(02) COMP.            005056      
000852           07 A01-R01-FECHA-EVENTO     PIC 9(08) COMP.            005058      
000853           07 A01-R01-CVE-RASTREO-S264 PIC X(30).                 005060      
000854     03 A01-R01-DATOS-1-R    REDEFINES A01-R01-DATOS-1.           005062      
000855        05 A01-R01-SUB-STA-DOC         PIC 9(02) COMP.            005064      
000856        05 A01-R01-SUC-DESTINO         PIC 9(04) COMP.            005066      
000857        05 A01-R01-TIPO-PREV           PIC X(01).                 005068      
000858        05 A01-R01-CAUSA-CAN-DEV       PIC 9(04) COMP.            005070      
000859        05 A01-R01-NVO-BCO-ORI         PIC 9(06) COMP.            005072      
000860        05 A01-R01-NVO-BCO-DES         PIC 9(06) COMP.            005074      
000861        05 A01-R01-NOM-BENEF-IDEN      PIC X(55).                 005076      
000862        05 A01-R01-NVO-NOM-BENEF       PIC X(55).                 005078      
000863        05 A01-R01-RFC-CURP-BENEF      PIC X(18).                 005080      
000864        05 A01-R01-GTOS-ORD-PAGO       PIC 9(16)V99 COMP.         005082      
000865        05 A01-R01-TIPO-PAGO-CECO      PIC 9(02) COMP.            005084      
000866        05 A01-R01-TIPO-PAGO-SPEI      PIC 9(02) COMP.            005086      
000867        05 A01-R01-TIPO-CONVENIO       PIC 9(02) COMP.            005088      
000868        05 A01-R01-PZA-EDO             PIC 9(06) COMP.            005090      
000869        05 A01-R01-TIPO-CTA-ABO        PIC 9(02) COMP.            005092      
000870        05 A01-R01-NUM-CTE-ABO         PIC 9(12) COMP.            005094      
000871        05 A01-R01-NUM-CTA-ABO         PIC 9(20) COMP.            005096      
000872        05 FILLER                      PIC X(358).                005098      
000873                                                                  005100      
000874     03 A01-R01-DATOS-2-S500 REDEFINES A01-R01-DATOS-1.           005102      
000875        05 A01-R01-TRUI.                                          005104      
000876           07 A01-R01-CSIID-RECEPTOR   PIC 9(08) COMP.            005106      
000877           07 A01-R01-CSIID-ORIGEN     PIC 9(08) COMP.            005108      
000878           07 A01-R01-NUM-OPERACION    PIC 9(08) COMP.            005110      
000879           07 A01-R01-NUM-TRANSACCI    PIC 9(08) COMP.            005112      
000880           07 A01-R01-INST-MONETARIO   PIC 9(02) COMP.            005114      
000881        05 A01-R01-MICR.                                          005116      
000882           07 A01-R01-COD-SEGURIDAD    PIC 9(04) COMP.            005118      
000883           07 A01-R01-VER-PREMARCADO   PIC 9(02) COMP.            005120      
000884           07 A01-R01-COD-TRANSMONE    PIC 9(02) COMP.            005122      
000885           07 A01-R01-PLAZA-CECOBAN    PIC 9(04) COMP.            005124      
000886           07 A01-R01-COD-BCOEMISOR    PIC 9(04) COMP.            005126      
000887           07 A01-R01-DIG-VINTERCAM    PIC 9(02) COMP.            005128      
000888           07 A01-R01-NUM-CTACHEQUE    PIC 9(12) COMP.            005130      
000889           07 A01-R01-NUM-REFCHEQUE    PIC 9(08) COMP.            005132      
000890        05 A01-R01-CTA-BENEFOTROBCO    PIC 9(20) COMP.            005134      
000891        05 A01-R01-BCO-RECEPOTROBCO    PIC 9(04) COMP.            005136      
000892        05 A01-R01-NOM-BENEFOTROBCO    PIC X(40).                 005138      
000893        05 A01-R01-RFC-OTROBCO         PIC X(13).                 005140      
000894        05 A01-R01-NOMPAN-S500         PIC X(05).                 005142      
000895        05 A01-R01-OPCPAN-S500         PIC X(01).                 005144      
000896        05 A01-R01-NUMCTO1-S500        PIC 9(16) COMP.            005146      
000897        05 A01-R01-NUMCTO2-S500        PIC 9(16) COMP.            005148      
000898        05 A01-R01-NUMCTO3-S500        PIC 9(16) COMP.            005150      
000899        05 A01-R01-INDIC-EST           PIC 9(08) COMP.            005152      
000900        05 A01-R01-IND-SUBC            PIC 9(01) COMP.            005154      
000901        05 A01-R01-PRO-SUBC            PIC 9(04) COMP.            005156      
000902        05 A01-R01-INST-SUBC           PIC 9(04) COMP.            005158      
000903        05 A01-R01-MON-SUBC            PIC 9(03) COMP.            005160      
000904        05 A01-R01-CONT-SUBC           PIC 9(16) COMP.            005162      
000905        05 A01-R01-CTAMDA-SUBC         PIC 9(16) COMP.            005164      
000906        05 A01-R01-STA-SUBC            PIC 9(04) COMP.            005166      
000907        05 A01-R01-INDALER-SUBC        PIC 9(04) COMP.            005168      
000908        05 A01-R01-INDCTACON-SUBC      PIC 9(02) COMP.            005170      
000909        05 A01-R01-LEYENDA-SUBC        PIC X(40).                 005171      
000910        05 A01-R01-VALOR-IND           PIC X(02).                 005172      
000911        05 A01-R01-NOMB-BENEF-AMPLI    PIC X(120).                005173      
000912        05 A01-R01-IND-EXTNET          PIC 9(01) COMP.            005174      
000913        05 A01-R01-FILLER              PIC 9(01) COMP.            005176      
000914        05 A01-R01-FILLER-DATOS2-S500  PIC X(205).                005178      
000915*        05 A01-R01-FILLER-DATOS2-S500  PIC X(328).               005180      
000916*        05 A01-R01-FILLER-DATOS2-S500  PIC X(395).               005182      
000917                                                                  005184      
000918     03 FILLER                         PIC X(01).                 005198      
000919     03 A01-R01-APUDES                 PIC 9(08) COMP.            005200      
000920     03 A01-R01-TIPREG                 PIC 9(02) COMP.            005300      
000921                                                                  005400      
000922******************************************************************005500      
000923*          VARIABLES DE LECTURA DATOS ADICIONALES "2"            *005600      
000924******************************************************************005700      
00092501 A01-R02-TESOFE.                                                005800      
000926    03 A01-R02-AUTS151ORI             PIC 9(08) COMP.             005900      
000927    03 A01-R02-DATOS-2-S500.                                      006000      
000928       05 A01-R02-TRUI.                                           006100      
000929          07 A01-R02-CSIID-RECEPTOR   PIC 9(08) COMP.             006200      
000930          07 A01-R02-CSIID-ORIGEN     PIC 9(08) COMP.             006300      
000931          07 A01-R02-NUM-OPERACION    PIC 9(08) COMP.             006400      
000932          07 A01-R02-NUM-TRANSACCI    PIC 9(08) COMP.             006500      
000933          07 A01-R02-INST-MONETARIO   PIC 9(02) COMP.             006600      
000934       05 A01-R02-MICR.                                           006700      
000935          07 A01-R02-COD-SEGURIDAD    PIC 9(04) COMP.             006800      
000936          07 A01-R02-VER-PREMARCADO   PIC 9(02) COMP.             006900      
000937          07 A01-R02-COD-TRANSMONE    PIC 9(02) COMP.             007000      
000938          07 A01-R02-PLAZA-CECOBAN    PIC 9(04) COMP.             007100      
000939          07 A01-R02-COD-BCOEMISOR    PIC 9(04) COMP.             007200      
000940          07 A01-R02-DIG-VINTERCAM    PIC 9(02) COMP.             007300      
000941          07 A01-R02-NUM-CTACHEQUE    PIC 9(12) COMP.             007400      
000942          07 A01-R02-NUM-REFCHEQUE    PIC 9(08) COMP.             007500      
000943       05 A01-R02-CTA-BENEFOTROBCO    PIC 9(20) COMP.             007600      
000944       05 A01-R02-BCO-RECEPOTROBCO    PIC 9(04) COMP.             007700      
000945       05 A01-R02-NOM-BENEFOTROBCO    PIC X(40).                  007800      
000946       05 A01-R02-RFC-OTROBCO         PIC X(13).                  007900      
000947       05 A01-R02-NOMPAN-S500         PIC X(05).                  008000      
000948       05 A01-R02-OPCPAN-S500         PIC X(01).                  008100      
000949       05 A01-R02-NUMCTO1-S500        PIC 9(16) COMP.             008200      
000950       05 A01-R02-NUMCTO2-S500        PIC 9(16) COMP.             008300      
000951       05 A01-R02-NUMCTO3-S500        PIC 9(16) COMP.             008400      
000952       05 A01-R02-INDIC-EST           PIC 9(08) COMP.             008500      
000953       05 A01-R02-IND-SUBC            PIC 9(01) COMP.             008600      
000954       05 A01-R02-PRO-SUBC            PIC 9(04) COMP.             008700      
000955       05 A01-R02-INST-SUBC           PIC 9(04) COMP.             008800      
000956       05 A01-R02-MON-SUBC            PIC 9(03) COMP.             008900      
000957       05 A01-R02-CONT-SUBC           PIC 9(16) COMP.             009000      
000958       05 A01-R02-CTAMDA-SUBC         PIC 9(16) COMP.             009100      
000959       05 A01-R02-STA-SUBC            PIC 9(04) COMP.             009200      
000960       05 A01-R02-INDALER-SUBC        PIC 9(04) COMP.             009300      
000961       05 A01-R02-INDCTACON-SUBC      PIC 9(02) COMP.             009400      
000962       05 A01-R02-LEYENDA-SUBC        PIC X(40).                  009500      
000963       05 A01-R02-VALOR-IND           PIC X(02).                  009520      
000964       05 A01-R02-NOMB-BENEF-AMPLI    PIC X(120).                 009540      
000965       05 A01-R02-IND-EXTNET          PIC 9(01) COMP.             009545      
000966       05 A01-R02-FILLER              PIC 9(01) COMP.             009550      
000967       05 A01-R02-FILLER-DATOS2-S500  PIC X(205).                 009560      
000968*       05 A01-R02-FILLER-DATOS2-S500  PIC X(327).                009600      
000969                                                                  009700      
000970    03 FILLER                         PIC X(01).                  009800      
000971    03 A01-R02-APUDES                 PIC 9(08) COMP.             009900      
000972    03 A01-R02-TIPREG                 PIC 9(02) COMP.             010000      
000973                                                                  010100      
000974*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000975                                                                  028000      
000976*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000977* COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS/S500/CTAMDRE ON CMEMP.".028200      
000978 01 500-R01-HDR.                                                  001000      
000979   03 500-R01-TIPREG         PIC 9(01)  VALUE 1.                  002000      
000980   03 500-R01-NODORI         PIC 9(02).                           003000      
000981   03 500-R01-FECPROC        PIC 9(06).                           004000      
000982   03 500-R01-SISCTE         PIC 9(12).                           005000      
000983   03 500-R01-SECARC         PIC 9(04).                           006000      
000984   03 500-R01-DESCTESIS      PIC X(41).                           007000      
000985   03 500-R01-FILLER         PIC X(254) VALUE SPACES.             008000      
000986                                                                  009000      
000987 01 500-R02-DET WITH LOWER-BOUNDS.                                010000      
000988   03 500-R02-TIPREG         PIC 9(01)  VALUE 2.                  010500      
000989   03 500-R02-NUMAUTORIZAS   PIC 9(08).                           011000      
000990   03 500-R02-SUCPRECU       PIC 9(04).                           012000      
000991   03 500-R02-NUMCUEMDA      PIC 9(12).                           013000      
000992   03 500-R02-NATUCON        PIC 9(01).                           014000      
000993   03 500-R02-REFNUM         PIC 9(16).                           015000      
000994   03 500-R02-IMPORTRAN      PIC 9(14)V99.                        016000      
000995   03 500-R02-SUCTRANS       PIC 9(04).                           017000      
000996   03 500-R02-NUMCAJTRA      PIC 9(04).                           018000      
000997   03 500-R02-HORAMOV        PIC 9(04).                           019000      
000998   03 500-R02-FECMOV         PIC 9(06).                           020000      
000999   03 500-R02-NUMAUT151      PIC 9(08).                           021000      
001000   03 500-R02-MONEDA         PIC 9(03).                           022000      
001001   03 500-R02-DESC           PIC X(30).                           023000      
001002   03 500-R02-FILLER         PIC X(203) VALUE SPACES.             023500      
001003                                                                  024000      
001004 01 500-R03-TRA.                                                  025000      
001005   03 500-R03-TIPREG         PIC 9(01)  VALUE 9.                  025500      
001006   03 500-R03-TOTMOV         PIC 9(08).                           026000      
001007   03 500-R03-NUMABO         PIC 9(08).                           027000      
001008   03 500-R03-TOTABO         PIC 9(16)V99.                        028000      
001009   03 500-R03-NUMCAR         PIC 9(08).                           029000      
001010   03 500-R03-TOTCAR         PIC 9(16)V99.                        030000      
001011   03 500-R03-TOTMOV-ELIM    PIC 9(08).                           030200      
001012   03 500-R03-NUMABO-ELIM    PIC 9(08).                           030300      
001013   03 500-R03-TOTABO-ELIM    PIC 9(16)V99.                        030400      
001014   03 500-R03-NUMCAR-ELIM    PIC 9(08).                           030500      
001015   03 500-R03-TOTCAR-ELIM    PIC 9(16)V99.                        030600      
001016   03 500-R03-FILLER         PIC X(199) VALUE SPACES.             031000      
001017*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001018                                                                  028400      
001019 01 WKS-TITLE-MOVS500.                                            028600      
001020    02 FILLER                     PIC X(17) VALUE                 028800      
001021                                  "S151/FILE/MOVS500".            029000      
001022    02 FILLER                     PIC X(01) VALUE "/".            029200      
001023    02 WKS-MOVS1-FECHA            PIC 9(06).                      029400      
001024    02 FILLER                     PIC X(04) VALUE " ON ".         029600      
001025    02 WKS-PACK-MOVS              PIC X(17).                      029800      
001026    02 FILLER                     PIC X(01) VALUE ".".            030000      
001027                                                                  030200      
001028 01 WKS-TITLE-DESS500.                                            030400      
001029    02 FILLER                     PIC X(17) VALUE                 030600      
001030                                  "S151/FILE/DESS500".            030800      
001031    02 FILLER                     PIC X(01) VALUE "/".            031000      
001032    02 WKS-DESS1-FECHA            PIC 9(06).                      031200      
001033    02 FILLER                     PIC X(04) VALUE " ON ".         031400      
001034    02 WKS-PACK-DESS              PIC X(17).                      031600      
001035    02 FILLER                     PIC X(01) VALUE ".".            031800      
001036                                                                  032000      
001037 01 WKS-CTLENV.                                                   032200      
001038    03 FILLER                     PIC X(27) VALUE                 032400      
001039                                  "(S151)S151/FILE/CTLENVP055/".  032600      
001040    03 WKS-FECHA-ENV              PIC 9(06).                      032800      
001041    03 FILLER                     PIC X(10) VALUE                 033000      
001042        " ON CMEMP.".                                             033200      
001043                                                                  033400      
001044  01 WKS-TIT-AUTORIZA.                                            033600      
001045    03 FILLER                     PIC X(29) VALUE                 033800      
001046                                  "(S151)S151/FILE/AUTORIZAP055/".034000      
001047    03 WKS-FECHA-AUT              PIC 9(06).                      034200      
001048    03 FILLER                     PIC X(10) VALUE                 034400      
001049        " ON CMEMP.".                                             034600      
001050                                                                  034800      
001051 01 WKS-TITLE-CTAMRE-ARCHIVO.                                     035000      
001052    03 FILLER                     PIC X(24) VALUE                 035200      
001053                                  "S151/FILE/INTS/15122S01/".     035400      
001054    03 WKS-CTAMRE-NODO            PIC 9(02).                      035600      
001055    03 FILLER                     PIC X VALUE "/".                035800      
001056    03 WKS-CTAMRE-FECHA           PIC 9(08).                      036000      
001057    03 FILLER                     PIC X VALUE "/".                036200      
001058    03 WKS-CTAMRE-ARCHIVO         PIC X(12).                      036400      
001059    03 FILLER                     PIC X VALUE "/".                036600      
001060    03 WKS-CTAMRE-SECUENCIA       PIC 9(04).                      036800      
001061    03 FILLER                     PIC X(10) VALUE                 037000      
001062       " ON CMEMP.".                                              037200      
001063                                                                  037400      
001064 01 WKS-TITLE-CTAMRE-ARCHIVO-D.                                   037600      
001065    03 FILLER                     PIC X(24) VALUE                 037800      
001066                                  "S151/FILE/INTS/15122S01/".     038000      
001067    03 WKS-CTAMRE-NODO-D          PIC 9(02).                      038200      
001068    03 FILLER                     PIC X VALUE "/".                038400      
001069    03 WKS-CTAMRE-FECHA-D         PIC 9(08).                      038600      
001070    03 FILLER                     PIC X VALUE "/".                038800      
001071    03 WKS-CTAMRE-ARCHIVO-D       PIC X(12).                      039000      
001072    03 FILLER                     PIC X VALUE "/".                039200      
001073    03 WKS-CTAMRE-SECUENCIA-D     PIC 9(04).                      039400      
001074    03 FILLER                     PIC X(10) VALUE                 039600      
001075       " ON CMEMP.".                                              039800      
001076                                                                  040000      
001077 77 W77-ERROR                     PIC 9(02).                      040200      
001078 77 W77-FIN                       PIC 9(02).                      040400      
001079 77 W77-NUMREG-MOV500             PIC 9(08).                      040600      
001080 77 W77-LLAVE                     PIC 9(08) VALUE ZERO.           040800      
001081 77 W77-MOV-NIVDES                PIC 9(08) VALUE ZERO.           041000      
001082 77 W77-NUMREG-ACC                PIC 9(08).                      041200      
001083                                                                  041400      
001084 77 CONTADOR-LJ                   PIC 9(11) BINARY VALUE 0.       041600      
001085 01 MENSAJE-LJ.                                                   041800      
001086    02 SISTEMA-LJ                 PIC X(04).                      042000      
001087    02 FILLER                     PIC X VALUE "/".                042200      
001088    02 PASO-LJ                    PIC X(04).                      042400      
001089    02 FILLER                     PIC X VALUE "/".                042600      
001090    02 MTP-LJ                     PIC 9(03).                      042800      
001091    02 FILLER                     PIC X VALUE ":".                043000      
001092    02 TIPO-LJ                    PIC X.                          043200      
001093    02 FILLER                     PIC X VALUE ">".                043400      
001094    02 CODIGO-LJ                  PIC 9(06).                      043600      
001095    02 FILLER                     PIC X VALUE "<".                043800      
001096    02 TEXTO-LJ                   PIC X(250).                     044000      
001097                                                                  044200      
001098 77 W77-RESULT-B01                PIC 9(02).                      044400      
001099 01 WKS-FECPRO-S500               PIC 9(08).                      044600      
001100 01 WKS-FECHA-PROCESO REDEFINES WKS-FECPRO-S500.                  044800      
001101    03 WKS-FECPRO-CC              PIC 9(02).                      045000      
001102    03 WKS-FECPRO-6D              PIC 9(06).                      045200      
001103    03 WKS-FECPRO-6D-R REDEFINES WKS-FECPRO-6D.                   045400      
001104       05 WKS-FECPRO-AA           PIC 9(02).                      045600      
001105       05 WKS-FECPRO-MM           PIC 9(02).                      045800      
001106       05 WKS-FECPRO-DD           PIC 9(02).                      046000      
001107                                                                  046200      
001108 01 WKS-CTLVER-LIBID              PIC X(12).                      046400      
001109 01 WKS-CTLVERS-LIBID-R REDEFINES WKS-CTLVER-LIBID.               046600      
001110    03 WKS-LIBID-NOMB             PIC X(09).                      046800      
001111    03 WKS-LIBID-SIST             PIC X(03).                      047000      
001112 01 WKS-CTLVER-NOMLIB             PIC X(72).                      047200      
001113 01 W77-CTLVER-RESULT             PIC S9(11) BINARY.              047400      
001114                                                                  047600      
001115 01 WKS-DATOS-HOST.                                               047800      
001116    03 WKS-NUMCSI-HOST            PIC 9(02).                      048000      
001117    03 WKS-NOMEQUIPO              PIC X(10).                      048200      
001118    03 WKS-NOMCSI                 PIC X(26).                      048400      
001119    03 WKS-LINEA-BATCH            PIC X(05).                      048600      
001120                                                                  048800      
001121 01 WKS-FECHAS.                                                   049000      
001122    03 WKS-FECHA-MAQUINA          PIC X(10) TYPE IS NUMERIC-DATE. 049200      
001123    03 WKS-FECHA-MAQUINA-R REDEFINES WKS-FECHA-MAQUINA.           049400      
001124       05 WKS-FECMAQ-MM           PIC 9(02).                      049600      
001125       05 WKS-DIAGONAL1           PIC X(01).                      049800      
001126       05 WKS-FECMAQ-DD           PIC 9(02).                      050000      
001127       05 WKS-DIAGONAL2           PIC X(01).                      050200      
001128       05 WKS-FECMAQ-AAAA         PIC 9(04).                      050400      
001129       05 WKS-FECMAQ-AAAA-R REDEFINES WKS-FECMAQ-AAAA.            050600      
001130          07 WKS-FECMAQ-CC        PIC 9(02).                      050800      
001131          07 WKS-FECMAQ-AA        PIC 9(02).                      051000      
001132    03 WKS-FECHA-MAQ-8D.                                          051200      
001133       05 WKS-CC-MAQ              PIC 9(02).                      051400      
001134       05 WKS-FECHA-MAQ-6D.                                       051600      
001135          07 WKS-AA-MAQ           PIC 9(02).                      051800      
001136          07 WKS-MM-MAQ           PIC 9(02).                      052000      
001137          07 WKS-DD-MAQ           PIC 9(02).                      052200      
001138    03 WKS-FECHA-MAQ-ANT-8D.                                      052400      
001139       05 WKS-CC-MAQ-ANT          PIC 9(02).                      052600      
001140       05 WKS-FECHA-MAQ-ANT-6D.                                   052800      
001141          07 WKS-AA-MAQ-ANT       PIC 9(02).                      053000      
001142          07 WKS-MM-MAQ-ANT       PIC 9(02).                      053200      
001143          07 WKS-DD-MAQ-ANT       PIC 9(02).                      053400      
001144 01 WKS-HM-MAQ-4D.                                                053600      
001145    03 WKS-HM-HH                  PIC 9(02).                      053800      
001146    03 WKS-HM-MM                  PIC 9(02).                      054000      
001147                                                                  054200      
001148 01 WKS-HORA-MOVTO                PIC 9(06).                      054400      
001149 01 WKS-HORA-MOVTO-R REDEFINES WKS-HORA-MOVTO.                    054600      
001150    03 WKS-HH-MOVTO               PIC 9(02).                      054800      
001151    03 WKS-MM-MOVTO               PIC 9(02).                      055000      
001152    03 WKS-SS-MOVTO               PIC 9(02).                      055200      
001153                                                                  055400      
001154 01 WKS-HM-MOVTO-4D.                                              055600      
001155    03 WKS-HM-HH-MOVTO            PIC 9(02).                      055800      
001156    03 WKS-HM-MM-MOVTO            PIC 9(02).                      056000      
001157                                                                  056200      
001158 01 WKS-SEG-MAQUINA               PIC 9(08).                      056400      
001159 01 WKS-SEG-MAQUINA-ANT           PIC 9(08).                      056600      
001160 01 WKS-HR-MAQUINA                PIC 9(08) TYPE IS NUMERIC-TIME. 056800      
001161 01 WKS-HR-MAQUINA-R REDEFINES WKS-HR-MAQUINA.                    057000      
001162     03 WKS-HH-MAQUINA            PIC 9(02).                      057200      
001163     03 FILLER                    PIC X(01).                      057400      
001164     03 WKS-MM-MAQUINA            PIC 9(02).                      057600      
001165     03 FILLER                    PIC X(01).                      057800      
001166     03 WKS-SS-MAQUINA            PIC 9(02).                      058000      
001167                                                                  058200      
001168 01 WKS-TIT-TASKFILE.                                             058400      
001169    03 FILLER                     PIC X(30) VALUE                 058600      
001170       "FILE TASKFILE (USERBACKUPNAME=".                          058800      
001171    03 FILLER                     PIC X(30) VALUE                 059000      
001172       "TRUE,TITLE=S151/TASKFILE/P055/".                          059200      
001173    03 WKS-TSK-NODO               PIC 9(02).                      059400      
001174    03 WKS-TSK-SUBNODO            PIC 9(02) VALUE ZERO.           059600      
001175    03 FILLER                     PIC X(06) VALUE "/R000/".       059800      
001176    03 WKS-TSK-FECHA.                                             060000      
001177       05 WKS-TSK-AA              PIC 9(02).                      060200      
001178       05 WKS-TSK-MM              PIC 9(02).                      060400      
001179       05 WKS-TSK-DD              PIC 9(02).                      060600      
001180    03 FILLER                     PIC X(01) VALUE "/".            060800      
001181    03 WKS-TSK-MIX                PIC 9(07).                      061000      
001182    03 FILLER                     PIC X(01) VALUE "/".            061200      
001183    03 WKS-TSK-MNEMONICO          PIC X(14) VALUE                 061400      
001184                                  "001TASKFILE );".               061600      
001185 01 WKS-MSG-COMS                 PIC X(1926) WITH LOWER-BOUNDS.   061800      
001186 01 WKS-MSG-COMS-R               REDEFINES WKS-MSG-COMS.          062000      
001187    02 WKS-HEADER-COMS.                                           062200      
001188       03 WKS-HDR-COMS-PREFIJO   PIC X.                           062400      
001189       03 WKS-HDR-COMS-APL-DES   PIC X.                           062600      
001190       03 WKS-HDR-COMS-CCR-DES   PIC 9(02).                       062800      
001191       03 WKS-HDR-COMS-LST-ORG   PIC 9(04).                       063000      
001192       03 WKS-HDR-COMS-LST-ORG-R REDEFINES                        063200      
001193          WKS-HDR-COMS-LST-ORG   PIC 9(08) COMP.                  063400      
001194       03 WKS-HDR-COMS-STATION.                                   063600      
001195          04 WKS-HDR-COMS-TPO    PIC X(01).                       063800      
001196          04 WKS-HDR-COMS-SUC    PIC 9(04).                       064000      
001197          04 WKS-HDR-COMS-PRIV   PIC X(01).                       064200      
001198          04 WKS-HDR-COMS-CAJ    PIC 9(02).                       064400      
001199       03 WKS-HDR-COMS-CCR-ORG   PIC 9(02).                       064600      
001200       03 WKS-HDR-COMS-COP-ORG   PIC 9(02).                       064800      
001201       03 WKS-HDR-COMS-FAC       PIC 9(02).                       065000      
001202       03 WKS-HDR-COMS-APL-ORG   PIC X(01).                       065200      
001203       03 WKS-HDR-COMS-RES       PIC 9(02).                       065400      
001204       03 WKS-HDR-COMS-MASC      PIC X(05).                       065600      
001205       03 WKS-HDR-COMS-PWR       PIC X(06).                       065800      
001206    02 WKS-TEXTO-COMS-SA2        PIC X(1890).                     066000      
001207    02 WKS-TEXTO-COMS-R          REDEFINES WKS-TEXTO-COMS-SA2.    066200      
001208       03 WKS-TRANCODE-COMS      PIC 9(06).                       066400      
001209       03 WKS-TEXTO-COMS         PIC X(1884).                     066600      
001210                                                                  066800      
001211 01 WKS-FECHA1                    PIC 9(08).                      067000      
001212 01 WKS-FECHA1-R  REDEFINES WKS-FECHA1 PIC X(08).                 067200      
001213 01 WKS-FECHA1-RE  REDEFINES WKS-FECHA1.                          067400      
001214    03 WKS-FECHA1-CC              PIC 9(02).                      067600      
001215    03 WKS-FECHA1-6D              PIC 9(06).                      067800      
001216    03 WKS-FECHA1-6D-R  REDEFINES WKS-FECHA1-6D.                  068000      
001217       05 WKS-FECHA1-AA           PIC 9(02).                      068200      
001218       05 WKS-FECHA1-MM           PIC 9(02).                      068400      
001219       05 WKS-FECHA1-DD           PIC 9(02).                      068600      
001220                                                                  068800      
001221 01 WKS-FECHA2                    PIC 9(08).                      069000      
001222 01 WKS-FECHA2-R  REDEFINES WKS-FECHA2 PIC X(08).                 069200      
001223 77 W77-FORMATO                   PIC S9(11) BINARY.              069400      
001224 77 W77-FUNCION                   PIC S9(11) BINARY.              069600      
001225                                                                  069800      
001226 77 W77-HABIL                     PIC 9(02).                      070000      
001227    88 W88-HABIL                  VALUE 0.                        070200      
001228    88 W88-INHABIL                VALUE 1.                        070400      
001229                                                                  070600      
001230 01 WKS-L710-ENT.                                                 070800      
001231    03 WKS-EL710-CAT              PIC 9(06) COMP.                 071000      
001232    03 WKS-EL710-CLAVE            PIC 9(02) COMP.                 071200      
001233    03 WKS-EL710-BUSQUEDA         PIC 9(02) COMP.                 071400      
001234    03 WKS-EL710-REGISTROS        PIC 9(02) COMP.                 071600      
001235    03 WKS-EL710-LLAVE1           PIC 9(12).                      071800      
001236    03 WKS-EL710-LLAVE2           PIC 9(12).                      072000      
001237    03 WKS-EL710-LLAVE3           PIC 9(12).                      072200      
001238    03 WKS-EL710-LLAVE4           PIC 9(12).                      072400      
001239    03 WKS-EL710-LLAVE5           PIC 9(12).                      072600      
001240    03 WKS-EL710-LLAVE6           PIC 9(12).                      072800      
001241    03 WKS-EL710-FEC-VIG          PIC 9(06) COMP.                 073000      
001242    03 WKS-EL710-FECINI           PIC 9(06) COMP.                 073200      
001243    03 WKS-EL710-NIVINI           PIC 9(02) COMP.                 073400      
001244    03 FILLER                     PIC X(11).                      073600      
001245                                                                  073800      
001246 01 WKS-COMS-AG-SALIDA-NAME       PIC X(50).                      074000      
001247 77 W77-COMS-AG-SALIDA-DESG       REAL.                           074200      
001248 77 W77-COMS-RESULT               PIC S9(011) BINARY.             074400      
001249    88 W88-COMS-OK                VALUE     0.                    074600      
001250 01 WKS-COMS-DEFSTATION-NAME      PIC X(18).                      074800      
001251 77 W77-COMS-DEFSTATION-DESG      REAL.                           075000      
001252 01 WKS-NOAPLINCLUDE-PARAMETRO    PIC  X(30).                     075200      
001253 77 W77-NOAPLINCLUDE-DESG         REAL.                           075400      
001254 77 W77-NOAPL-RESULT              PIC S9(11) BINARY.              075600      
001255    88 W88-NOAPL-OK               VALUE 0.                        075800      
001256 77 W77-ACEPTA-MSG                PIC S9(11) BINARY.              076000      
001257    88 W88-ACEPTA-MSG             VALUE 1.                        076200      
001258 77 W77-ESPERACOMS-TIEMPO         PIC S9(11) BINARY VALUE 300.    076500      
001259 77 W77-ESPERACOMS-TIPO-EVENTO    PIC S9(11) BINARY.              076600      
001260    88 W88-POR-MSG                VALUE  1.                       076800      
001261    88 W88-POR-ACCEPT             VALUE  2.                       077000      
001262    88 W88-POR-HI                 VALUE  3.                       077200      
001263    88 W88-POR-TIMEOUT            VALUE  4.                       077400      
001264    88 W88-POR-EVENTO             VALUE  5.                       077600      
001265 01 WKS-TIPO-EVENTO               PIC 9(02).                      077800      
001266 77 W77-EVENTO                    USAGE IS EVENT.                 078000      
001267 01 WKS-SMCOMS-COMANDO.                                           078200      
001268    03 WKS-SMCOMS-STRING1         PIC X(20).                      078400      
001269    03 WKS-SMCOMS-STRING2         PIC X(20).                      078600      
001270 01 WKS-SMCOMS-TRABAJO            PIC X(132).                     078800      
001271 77 W77-SMCOMS-RESULT             PIC S9(11) BINARY.              079000      
001272    88 W88-SMCOMS-OK              VALUE 0.                        079200      
001273 77 W77-STATUS-KEY                PIC 9(04).                      079400      
001274 77 W77-LONGMSG                   PIC 9(04).                      079600      
001275                                                                  079800      
001276*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001277* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         080000      
001278*================================================================ 000100      
001279*         ENTRY-POINT CONSISDIA :                               = 000200      
001280*                                                                 000300      
001281* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
001282* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
001283* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
001284* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
001285* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
001286* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
001287* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
001288* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
001289* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
001290* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
001291*                                                               = 001400      
001292*================================================================ 001500      
001293                                                                  001600      
001294                                                                  001700      
001295*================================================================ 001800      
001296* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
001297*                                                               = 002000      
001298* ENTRADA REQUERIDA :                                           = 002100      
001299*                                                               = 002200      
001300*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
001301*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
001302*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
001303*================================================================ 002600      
001304 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
001305    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
001306    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
001307    03 WKS-B01-CSI                 PIC 9(02).                     003000      
001308    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
001309    03 WKS-B01-FECCON              PIC 9(08).                     003202      
001310    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
001311    03 WKS-B01-STAREG              PIC 9(02).                     003400      
001312    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
001313    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
001314    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
001315    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
001316    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
001317    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
001318    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
001319    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
001320    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
001321    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
001322    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
001323    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
001324    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
001325       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
001326       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
001327       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
001328       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
001329*==============================================================   005200      
001330*                                                             =   005300      
001331* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
001332*                                                             =   005500      
001333* CAMPOS REQUERIDOS :                                         =   005600      
001334*                                                             =   005700      
001335* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
001336* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
001337* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
001338* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
001339*==============================================================   006200      
001340 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
001341    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
001342    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
001343    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
001344    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
001345                                                                  006800      
001346*==============================================================   006900      
001347*                                                             =   007000      
001348* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
001349*                                                             =   007200      
001350* CAMPOS REQUERIDOS :                                         =   007300      
001351*                                                             =   007400      
001352* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
001353* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
001354* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
001355* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
001356*==============================================================   007900      
001357 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
001358    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
001359    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
001360    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
001361    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
001362                                                                  008500      
001363*==============================================================   008600      
001364*                                                             =   008700      
001365* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
001366*                                                             =   008900      
001367* CAMPOS REQUERIDOS :                                         =   009000      
001368*                                                             =   009100      
001369* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
001370* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
001371* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
001372* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
001373*==============================================================   009600      
001374 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
001375    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
001376    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
001377    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
001378    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
001379                                                                  010200      
001380*============================================================     010300      
001381* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
001382*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
001383*                                                           =     010600      
001384*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
001385*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
001386*                                                           =     010900      
001387*  ENTRADA REQUERIDA.                                       =     011000      
001388*                                                           =     011100      
001389*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
001390*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
001391*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
001392*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
001393*============================================================     011600      
001394                                                                  011700      
001395 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
001396     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
001397     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
001398     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
001399     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
001400                                                                  012300      
001401*=============================================================    012400      
001402*                                                            =    012500      
001403* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
001404*             B01-SIS-FECARMOV.                              =    012700      
001405*                                                            =    012800      
001406* ENTRADA REQUERIDAD :                                       =    012900      
001407*                                                            =    013000      
001408*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
001409*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
001410*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
001411*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
001412*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
001413*=============================================================    013600      
001414                                                                  013700      
001415 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
001416     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
001417     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
001418     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
001419     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
001420     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
001421*================================================================ 014400      
001422*                                                               = 014500      
001423* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
001424*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
001425*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
001426*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
001427*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
001428*                                                               = 015100      
001429* ENTRADA REQUERIDA :                                           = 015200      
001430*                                                               = 015300      
001431* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
001432* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
001433* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
001434* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
001435* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
001436*================================================================ 015900      
001437 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
001438    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
001439    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
001440    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
001441    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
001442    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
001443                                                                  016600      
001444*============================================================     016700      
001445*                                                           =     016800      
001446* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
001447*                                                           =     017000      
001448* DATOS REQUERIDOS :                                        =     017100      
001449*                                                           =     017200      
001450* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
001451* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
001452* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
001453* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
001454* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
001455*============================================================     017800      
001456                                                                  017900      
001457 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
001458     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
001459     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
001460     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
001461     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
001462     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
001463                                                                  018600      
001464*============================================================     018700      
001465*                                                           =     018800      
001466* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
001467*                                                           =     019000      
001468* DATOS REQUERIDOS :                                        =     019100      
001469*                                                           =     019200      
001470* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
001471* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
001472* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
001473* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
001474* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
001475*============================================================     019800      
001476                                                                  019900      
001477 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
001478     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
001479     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
001480     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
001481     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
001482     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
001483                                                                  020600      
001484*===============================================================  020700      
001485*                                                              =  020800      
001486* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
001487*              MOVIMIENTOS.                                    =  021000      
001488* DATOS REQUERIDOS :                                           =  021100      
001489*                                                              =  021200      
001490* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
001491* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
001492* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
001493* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
001494* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
001495* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
001496*==============================================================   021900      
001497                                                                  022000      
001498 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
001499     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
001500     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
001501     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
001502     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
001503     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
001504     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
001505*==============================================================   022800      
001506*                                                             =   022900      
001507* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
001508*                                                             =   023100      
001509* CAMPOS REQUERIDOS :                                         =   023200      
001510*                                                             =   023300      
001511* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
001512* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
001513* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
001514* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
001515*==============================================================   023800      
001516 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
001517    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
001518    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
001519    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
001520    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
001521                                                                  024304      
001522*=================================================================024306      
001523*                ENTRY POINT CONSISB01                           =024308      
001524*                                                                =024310      
001525*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
001526*                                                                =024314      
001527*  FUNCIONES DISPONIBLES :                                       =024316      
001528*                                                                =024318      
001529*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
001530*                                                                =024322      
001531*  PARAMETROS REQUERIDOS                                         =024324      
001532*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
001533*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
001534*=================================================================024330      
001535                                                                  024332      
001536 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
001537     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
001538     03 WKS-CON-CSI                PIC 9(02).                     024336      
001539     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
001540     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
001541        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
001542        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
001543        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
001544        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
001545        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
001546                                                                  024400      
001547*=================================================================024500      
001548*                ENTRY POINT B02ARCINTER                         =024600      
001549*                                                                =024700      
001550*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
001551*                                                                =024900      
001552*  FUNCIONES DISPONIBLES :                                       =025000      
001553*                                                                =025100      
001554*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
001555* 19.- ALTAS DE ARCHIVOS.                                        =025300      
001556* 22.- BAJAS DE ARCHIVOS.                                        =025400      
001557* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
001558*                                                                =025600      
001559*  PARAMETROS REQUERIDOS                                         =025700      
001560*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
001561*                                                                =025900      
001562*=================================================================026000      
001563 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
001564     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
001565     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
001566     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
001567     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
001568     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
001569     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
001570     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
001571     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
001572     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
001573     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
001574     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
001575     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
001576     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
001577     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
001578     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
001579     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
001580     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
001581     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
001582     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
001583     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
001584     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
001585     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
001586     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
001587     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
001588     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
001589     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
001590     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
001591     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
001592                                                                  029000      
001593*=================================================================029100      
001594*                ENTRY POINT B04SISTEMA                          =029200      
001595*                                                                =029300      
001596*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
001597*                                                                =029500      
001598*  FUNCIONES DISPONIBLES :                                       =029600      
001599*                                                                =029700      
001600*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
001601*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
001602*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
001603*                                                                =030100      
001604*  PARAMETROS REQUERIDOS                                         =030200      
001605*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
001606*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
001607*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
001608*                                                                =030600      
001609*=================================================================030700      
001610 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
001611     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
001612     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
001613     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
001614     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
001615     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
001616     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
001617     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
001618                                                                  031600      
001619*================================================================ 031700      
001620*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
001621*                                                               = 031900      
001622*  FUNCION                                                      = 032000      
001623*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
001624*   19       ALTAS.                                             = 032200      
001625*   22       BAJAS                                              = 032300      
001626*   37       CAMBIOS.                                           = 032400      
001627*                                                               = 032500      
001628*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
001629*                      FECHA DE PROCESO                         = 032700      
001630*                      NUMERO DE PROCESO                        = 032800      
001631*                      FECHA INICIO                             = 032900      
001632*                      REGISTRO INICIAL                         = 033000      
001633*================================================================ 033100      
001634                                                                  033200      
001635 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
001636     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
001637     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
001638     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
001639     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
001640     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
001641     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
001642     03 WKS-B05-MIX                PIC 9(08).                     034000      
001643     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
001644     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
001645     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
001646     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
001647     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
001648     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
001649                                                                  034700      
001650                                                                  034800      
001651*================================================================ 034900      
001652*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
001653*                                                               = 035100      
001654*  FUNCION                                                      = 035200      
001655*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
001656*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
001657*                                                               = 035500      
001658*================================================================ 035600      
001659                                                                  035700      
001660 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
001661     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
001662     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
001663     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
001664     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
001665     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
001666     03 WKS-B09-NOMREN             PIC X(15).                     036400      
001667                                                                  036500      
001668*===============================================================  036600      
001669*                                                              =  036700      
001670*         ENTRY-POINT CONSISMEN                                =  036800      
001671*                                                              =  036900      
001672*   DATOS REQUERIDOS : FUNCION                                 =  037000      
001673*                      SISTEMA                                 =  037100      
001674*                                                              =  037200      
001675*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
001676*                                                              =  037400      
001677*===============================================================  037500      
001678 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
001679     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
001680     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
001681     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
001682     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
001683     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
001684     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
001685     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
001686     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
001687     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
001688     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
001689     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
001690     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
001691     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
001692     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
001693     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
001694        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
001695        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
001696        05 WKS-B03-AAMM            PIC 9(06).                     039402      
001697        05 WKS-B03-SECOK           PIC 9(10).                     039500      
001698        05 WKS-B03-SECINF          PIC 9(10).                     039600      
001699        05 WKS-B03-SECERR          PIC 9(10).                     039700      
001700        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
001701                                                                  039900      
001702*=====================================================            040000      
001703*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
001704*=====================================================            040200      
001705 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
001706     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
001707     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
001708     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
001709                                                                  040700      
001710*=====================================================            040800      
001711*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
001712*=====================================================            041000      
001713 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
001714     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
001715     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
001716     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
001717                                                                  041500      
001718*=====================================================            041600      
001719*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
001720*=====================================================            041800      
001721 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
001722     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
001723     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
001724     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
001725*=====================================================            042300      
001726*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
001727*=====================================================            042500      
001728 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
001729     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
001730     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
001731     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
001732                                                                  043000      
001733*=====================================================            043100      
001734*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
001735*=====================================================            043300      
001736 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
001737     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
001738     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
001739     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
001740                                                                  043800      
001741*=====================================================            043900      
001742*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
001743*=====================================================            044100      
001744 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
001745     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
001746     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
001747     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
001748                                                                  044600      
001749*=====================================================            044700      
001750*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
001751*=====================================================            044900      
001752 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
001753     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
001754     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
001755     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
001756                                                                  045400      
001757*=====================================================            045500      
001758*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
001759*=====================================================            045700      
001760 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
001761     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
001762     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
001763     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
001764                                                                  046200      
001765*=====================================================            046300      
001766*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
001767*=====================================================            046500      
001768 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
001769     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
001770     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
001771     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
001772                                                                  047000      
001773*=====================================================            047100      
001774*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
001775*=====================================================            047300      
001776 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
001777     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
001778     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
001779     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001780                                                                  047800      
001781*=====================================================            047900      
001782*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001783*=====================================================            048100      
001784 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001785     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001786     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001787     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001788                                                                  048600      
001789*=====================================================            048700      
001790*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001791*=====================================================            048900      
001792 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001793     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001794     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001795     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001796                                                                  049400      
001797*=====================================================            049500      
001798*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001799*=====================================================            049700      
001800 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001801     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001802     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001803     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001804     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001805     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001806     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001807     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001808     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001809     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001810     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001811                                                                  050900      
001812*=====================================================            051000      
001813*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001814*=====================================================            051200      
001815 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001816     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001817     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001818     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001819     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001820                                                                  051800      
001821*=====================================================            051900      
001822*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001823*=====================================================            052100      
001824 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001825     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001826     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001827     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001828     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001829                                                                  052700      
001830*=====================================================            052800      
001831*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001832*=====================================================            053000      
001833 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001834     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001835     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001836     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001837     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001838                                                                  053600      
001839*=====================================================            053700      
001840*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001841*=====================================================            053900      
001842 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001843     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001844     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001845     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001846     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001847                                                                  054500      
001848*=====================================================            054600      
001849*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001850*=====================================================            054800      
001851 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001852     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001853     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001854     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001855     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001856                                                                  055400      
001857*=====================================================            055500      
001858*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001859*=====================================================            055700      
001860 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001861     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001862     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001863     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001864     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001865                                                                  056300      
001866*=====================================================            056400      
001867*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001868*=====================================================            056600      
001869 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001870     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001871     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001872     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001873     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001874                                                                  057200      
001875 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001876*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001877                                                                  080200      
001878 LINKAGE SECTION.                                                 080400      
001879 01 WKS-COMS-MY-PROGRAM-NAME      PIC X(0018).                    080600      
001880 77 W77-COMS-MY-PROGRAM-DESG      REAL.                           080800      
001881                                                                  081000      
001882 77 W77-L710-RESULT               PIC S9(11) BINARY.              081200      
001883 77 W77-RESULT-COMS               PIC 9(06).                      081400      
001884 01 WKS-NUM-CVETRANS              PIC 9(06).                      081600      
001885 77 W77-EOF                       PIC 9(02).                      081800      
001886 77 W77-EOF-ENVIO                 PIC 9(02).                      082000      
001887 01 WKS-NUM-OCCURS                PIC 9(02).                      082200      
001888 01 CVETRAN-CTAMRE.                                               082400      
001889    05 WKS-CVETRAN-CTAMRE   OCCURS 10000 TIMES.                   082600      
001890       10 WKS-CAT6-CVETRAN        PIC 9(06) COMP.                 082800      
001891       10 WKS-CAT6-AFC            PIC 9(02) COMP.                 083000      
001892                                                                  083200      
001893 77  W77-L710-SISTEMA             PIC S9(11) BINARY.              083400      
001894 77  W77-L710-PROGRAMA            PIC S9(11) BINARY.              083600      
001895                                                                  083800      
001896 01  WKS-L710-SAL.                                                084000      
001897     03 WKS-SL710-NUMREG          PIC 9(02) COMP.                 084200      
001898     03 WKS-SL710-CAT             PIC 9(06) COMP.                 084400      
001899     03 WKS-SL710-FECINI          PIC 9(06) COMP.                 084600      
001900     03 WKS-SL710-NIVINI          PIC 9(02) COMP.                 084800      
001901     03 FILLER                    PIC X(22).                      085000      
001902     03 WKS-SL710-REG OCCURS 10 TIMES.                            085200      
001903        05 WKS-SL710-DAT          PIC 9(12) OCCURS 28 TIMES.      085400      
001904        05 WKS-SL710-FECALTA      PIC 9(06) COMP.                 085600      
001905        05 WKS-SL710-FECBAJA      PIC 9(06) COMP.                 085800      
001906        05 WKS-SL710-FECMOD       PIC 9(06) COMP.                 086000      
001907        05 WKS-SL710-FECVIG       PIC 9(06) COMP.                 086200      
001908        05 FILLER                 PIC X(42).                      086400      
001909                                                                  086600      
001910 77 W77-ERR-CAT                   PIC 9(02).                      086800      
001911 77 W77-HI                        PIC 9(08) VALUE 0.              087000      
001912    88 W88-HI-0                   VALUE 0.                        087200      
001913    88 W88-HI-1                   VALUE 1.                        087400      
001914    88 W88-HI-2                   VALUE 2.                        087600      
001915    88 W88-HI-3                   VALUE 3.                        087800      
001916    88 W88-HI-4                   VALUE 4.                        088000      
001917    88 W88-HI-5                   VALUE 5.                        088200      
001918    88 W88-HI-6                   VALUE 6.                        088400      
001919    88 W88-HI-10                  VALUE 10.                       088600      
001920    88 W88-HI-1822                VALUE 1822.                     088800      
001921                                                                  089000      
001922 01 WKS-VALOR-HI                  PIC 9(08).                      089200      
001923 01 WKS-VALOR-HI-R     REDEFINES WKS-VALOR-HI.                    089400      
001924    03 WKS-NUM-HI                 PIC 9(04).                      089600      
001925    03 WKS-TIEMPO-HI              PIC 9(04).                      089800      
001926    03 WKS-TIEMPO-HI-R REDEFINES WKS-TIEMPO-HI.                   090000      
001927       05 WKS-HH-HI               PIC 9(02).                      090200      
001928       05 WKS-MM-HI               PIC 9(02).                      090400      
001929 01 WKS-VALOR-HI-99    REDEFINES WKS-VALOR-HI.                    090600      
001930    03 WKS-NUM-HI99-FILL          PIC 9(04).                      090800      
001931    03 WKS-NUM-HI-99              PIC 9(02).                      091000      
001932    03 WKS-NUM-HI99-PROC          PIC 9(02).                      091200      
001933                                                                  091400      
001934 77 W77-MONITOR                   PIC 9(01).                      091600      
001935    88 W88-MONITOR                VALUE 1.                        091800      
001936 77 W77-FIN-ARCH                  PIC 9(02).                      092000      
001937 77 W77-FIN-ARCH-D                PIC 9(02).                      092200      
001938 77 W77-MSG-OK                   PIC 9(02).                       092400      
001939    88 W88-MSG-OK                   VALUE 1.                      092600      
001940                                                                  092800      
001941 01 WKS-BASURA                    PIC X(10).                      093000      
001942 01 MY-ID                         PIC X(10) VALUE "S151/P055>".   093200      
001943                                                                  093400      
001944 77 W77-RUTA-CTAMRE-P            PIC 9(02).                       093600      
001945 77 W77-RUTA-CTAMRE-D            PIC 9(02).                       093800      
001946                                                                  094000      
001947 77 W77-ENVIO-CTAMRE              PIC 9(02).                      094200      
001948     88 W88-ENVIO-CTAMRE          VALUE 1.                        094400      
001949 77 W77-ENVIO-CTAMRE-D            PIC 9(02).                      094600      
001950     88 W88-ENVIO-CTAMRE-D        VALUE 1.                        094800      
001951                                                                  095000      
001952 77 W77-AUT-ENVIO500              PIC 9(08).                      095200      
001953 77 W77-SEC-DET                   PIC 9(08).                      095600      
001954 77 W77-AUT-ENVIO500-D            PIC 9(08).                      095800      
001955 77 W77-SEC-DET-DOL               PIC 9(08).                      096200      
001956                                                                  096400      
001957 77 W77-STATUS-FILE               PIC 9(01).                      096600      
001958 77 W77-IND-ARCH                  PIC 9(06).                      096800      
001959 77 W77-STATUS-FILE-D               PIC 9(01).                    097000      
001960 77 W77-IND-ARCH-D                PIC 9(06).                      097200      
001961                                                                  098000      
001962 77 W77-NUM-TOTAL-MOV-PES         PIC 9(08).                      098200      
001963 77 W77-NUM-ABON-PES              PIC 9(08).                      098400      
001964 77 W77-NUM-TOTAL-ABON-PES        PIC 9(16)V99.                   098600      
001965 77 W77-NUM-CARG-PES              PIC 9(08).                      098800      
001966 77 W77-NUM-TOTAL-CARG-PES        PIC 9(16)V99.                   099000      
001967 77 W77-NUM-NO-CONT-PES           PIC 9(08).                      099200      
001968                                                                  099400      
001969 77 W77-NUM-TOTAL-MOV-ELIM-PES    PIC 9(08).                      099600      
001970 77 W77-NUM-ABON-ELIM-PES         PIC 9(08).                      099800      
001971 77 W77-NUM-TOTAL-ABON-ELIM-PES   PIC 9(16)V99.                   100000      
001972 77 W77-NUM-CARG-ELIM-PES         PIC 9(08).                      100200      
001973 77 W77-NUM-TOTAL-CARG-ELIM-PES   PIC 9(16)V99.                   100400      
001974 77 W77-NUM-NO-CONT-ELIM-PES      PIC 9(08).                      100600      
001975                                                                  100800      
001976 77 W77-NUM-TOTAL-MOV-DOL         PIC 9(08).                      101000      
001977 77 W77-NUM-ABON-DOL              PIC 9(08).                      101200      
001978 77 W77-NUM-TOTAL-ABON-DOL        PIC 9(16)V99.                   101400      
001979 77 W77-NUM-CARG-DOL              PIC 9(08).                      101600      
001980 77 W77-NUM-TOTAL-CARG-DOL        PIC 9(16)V99.                   101800      
001981 77 W77-NUM-NO-CONT-DOL           PIC 9(08).                      102000      
001982                                                                  102200      
001983 77 W77-NUM-TOTAL-MOV-ELIM-DOL    PIC 9(08).                      102400      
001984 77 W77-NUM-ABON-ELIM-DOL         PIC 9(08).                      102600      
001985 77 W77-NUM-TOTAL-ABON-ELIM-DOL   PIC 9(16)V99.                   102800      
001986 77 W77-NUM-CARG-ELIM-DOL         PIC 9(08).                      103000      
001987 77 W77-NUM-TOTAL-CARG-ELIM-DOL   PIC 9(16)V99.                   103200      
001988 77 W77-NUM-NO-CONT-ELIM-DOL      PIC 9(08).                      103400      
001989                                                                  103600      
001990 77 W77-ARCHIVO-ANT               PIC 9(01).                      103800      
001991                                                                  104000      
001992*========================================================         104200      
001993* VARIABLES PARA ENVIO POR INTELAR                                104400      
001994*========================================================         104600      
001995 01 WKS-INTE-ARCHIVO              PIC X(120).                     104800      
001996 77 W77-INTE-SNT                  PIC S9(11) BINARY.              105000      
001997                                                                  105200      
001998 77 W77-IND                       PIC 9(06).                      105400      
001999 77 W77-IND-D                     PIC 9(06).                      105600      
002000 77 W77-IND-ENV                   PIC 9(06).                      105800      
002001 77 W77-IND-ENV-D                 PIC 9(06).                      106000      
002002                                                                  106200      
002003 01 WKS-IND-EXTNET                PIC 9(01).                      106400      
002004 01 WKS-NULO-NUM                  PIC 9(02) COMP VALUE @00@.      106600      
002005 01 WKS-NULO                      REDEFINES                       106800      
002006    WKS-NULO-NUM                  PIC X(01).                      107000      
002007                                                                  107200      
002008*========================================================         107400      
002009* VARIABLES CTAMRE TRAILER                                        107600      
002010*========================================================         107800      
002011 01 WKS-NUM-TOTAL-MOV-PES         PIC 9(08).                      108000      
002012 01 WKS-NUM-ABON-PES              PIC 9(08).                      108200      
002013 01 WKS-NUM-TOTAL-ABON-PES        PIC 9(16)V99.                   108400      
002014 01 WKS-NUM-CARG-PES              PIC 9(08).                      108600      
002015 01 WKS-NUM-TOTAL-CARG-PES        PIC 9(16)V99.                   108800      
002016 01 WKS-NUM-NO-CONT-PES           PIC 9(08).                      109000      
002017                                                                  109200      
002018 01 WKS-NUM-TOTAL-MOV-ELIM-PES    PIC 9(08).                      109400      
002019 01 WKS-NUM-ABON-ELIM-PES         PIC 9(08).                      109600      
002020 01 WKS-NUM-TOTAL-ABON-ELIM-PES   PIC 9(16)V99.                   109800      
002021 01 WKS-NUM-CARG-ELIM-PES         PIC 9(08).                      110000      
002022 01 WKS-NUM-TOTAL-CARG-ELIM-PES   PIC 9(16)V99.                   110200      
002023 01 WKS-NUM-NO-CONT-ELIM-PES      PIC 9(08).                      110400      
002024                                                                  110600      
002025 01 WKS-NUM-TOTAL-MOV-DOL         PIC 9(08).                      110800      
002026 01 WKS-NUM-ABON-DOL              PIC 9(08).                      111000      
002027 01 WKS-NUM-TOTAL-ABON-DOL        PIC 9(16)V99.                   111200      
002028 01 WKS-NUM-CARG-DOL              PIC 9(08).                      111400      
002029 01 WKS-NUM-TOTAL-CARG-DOL        PIC 9(16)V99.                   111600      
002030 01 WKS-NUM-NO-CONT-DOL           PIC 9(08).                      111800      
002031                                                                  112000      
002032 01 WKS-NUM-TOTAL-MOV-ELIM-DOL    PIC 9(08).                      112200      
002033 01 WKS-NUM-ABON-ELIM-DOL         PIC 9(08).                      112400      
002034 01 WKS-NUM-TOTAL-ABON-ELIM-DOL   PIC 9(16)V99.                   112600      
002035 01 WKS-NUM-CARG-ELIM-DOL         PIC 9(08).                      112800      
002036 01 WKS-NUM-TOTAL-CARG-ELIM-DOL   PIC 9(16)V99.                   113000      
002037 01 WKS-NUM-NO-CONT-ELIM-DOL      PIC 9(08).                      113200      
002038                                                                  113400      
002039 77 W77-AFC                       PIC 9(04) VALUE 0.              113600      
002040                                                                  113800      
002041*========================================================         114000      
002042* VARIABLES CORTE DE HORARIO CAT1822                              114200      
002043*========================================================         114400      
002044 77 W77-CORTE                     PIC 9(04).                      114600      
002045 77 W77-CORTE-D                   PIC 9(04).                      114800      
002046 01 WKS-TABLA-CORTES.                                             115000      
002047    05 WKS-TAB-CORTES      OCCURS 1000 TIMES.                     115200      
002048       10 WKS-HORA-CORTE          PIC 9(04).                      115400      
002049       10 WKS-HORA-CORTE-D        PIC 9(04).                      115600      
002050       10 WKS-INDSERV             PIC 9(01).                      115800      
002051       10 WKS-INDSERV-D           PIC 9(01).                      116000      
002052                                                                  116200      
002053 77 W77-LEE                       PIC 9(01).                      116400      
002054 77 W77-VECES                     PIC 9(01).                      116600      
002055 77 W77-EXISTE-ELI-EXT             PIC 9(01) VALUE 0.             116800      
002056    88 W88-EXISTE-MOV-EXT          VALUE 1.                       117000      
002057 77 WKS-AUTORIZA-151-KEY           PIC 9(08).                     117200      
002058*========================================================         117400      
002059* VARIABLES ARCHIVO AUTORIZACIÓN                                  117600      
002060*========================================================         117800      
002061 01 WKS-REG-AUTS500EXT         PIC 9(08).                         118000      
002062 01 WKS-REG-AUTAELIM           PIC 9(08).                         118200      
002063 01 WKS-REG-AUTANTS151         PIC 9(08).                         118400      
002064 01 WKS-REG-TIP-PROC           PIC 9(02).                         118600      
002065 01 WKS-REG-DATOS-TR.                                             118800      
002066    02 WKS-REG-TRANSACCIONES OCCURS 5 TIMES.                      119000      
002067       03 WKS-REG-CVETRAN            PIC 9(04).                   119200      
002068       03 WKS-REG-IMPORTE            PIC 9(16)V99.                119400      
002069 01 WKS-REG-500SUCPRECU        PIC 9(04).                         119600      
002070 01 WKS-REG-500NUMCUEMDA       PIC 9(12).                         119800      
002071 01 WKS-REG-500NATUCON         PIC 9(01).                         120000      
002072 01 WKS-REG-500MONEDA          PIC 9(04).                         120200      
002073 01 WKS-REG-500REFNUM          PIC 9(12).                         120400      
002074 01 WKS-REG-500NUMAUTORIZAS    PIC 9(08).                         120600      
002075 01 WKS-REG-500IMPORTRAN       PIC 9(14)V99.                      120800      
002076 01 WKS-REG-500SUCTRANS        PIC 9(04).                         121000      
002077 01 WKS-REG-500NUMCAJTRA       PIC 9(02).                         121200      
002078 01 WKS-REG-HORAMOV            PIC 9(06).                         121400      
002079 01 WKS-REG-FECMOV             PIC 9(06).                         121600      
002080 01 WKS-REG-NUMAUT151          PIC 9(08).                         121800      
002081 01 WKS-REG-STATUS             PIC 9(02).                         122000      
002082 01 WKS-HAYARCH-P              PIC 9 VALUE 0.                     122200      
002083 01 WKS-HAYARCH-D              PIC 9 VALUE 0.                     122400      
002084                                                                  122600      
002085  COMMUNICATION SECTION.                                          122800      
002086  INPUT  HEADER COMS-IN;                                          123000      
002087         PROGRAMDESG            IS CS-COMS-IN-PROGRAM;            123200      
002088         FUNCTIONSTATUS         IS CS-COMS-IN-FUNCTION-STATUS;    123400      
002089         FUNCTIONINDEX          IS CS-COMS-IN-FUNCTION-INDEX;     123600      
002090         USERCODE               IS CS-COMS-IN-USERCODE;           123800      
002091         SECURITYDESG           IS CS-COMS-IN-SECURITY-DESG;      124000      
002092         TRANSPARENT            IS CS-COMS-IN-TRANSPARENT;        124200      
002093         VTFLAG                 IS CS-COMS-IN-VT-FLAG;            124400      
002094         TIMESTAMP              IS CS-COMS-IN-TIMESTAMP;          124600      
002095         STATION                IS CS-COMS-IN-STATION;            124800      
002096         TEXTLENGTH             IS CS-COMS-IN-TEXT-LENGTH;        125000      
002097         STATUSVALUE            IS CS-COMS-IN-STATUS-KEY;         125200      
002098         MESSAGECOUNT           IS CS-COMS-IN-MSG-COUNT;          125400      
002099         RESTART                IS CS-COMS-IN-RST-LOC;            125600      
002100         AGENDA                 IS CS-COMS-IN-AGENDA.             125800      
002101  OUTPUT HEADER COMS-OUT;                                         126000      
002102         DESTCOUNT              IS CS-COMS-OUT-COUNT;             126200      
002103         TEXTLENGTH             IS CS-COMS-OUT-TEXT-LENGTH;       126400      
002104         STATUSVALUE            IS CS-COMS-OUT-STATUS-KEY;        126600      
002105         TRANSPARENT            IS CS-COMS-OUT-TRANSPARENT;       126800      
002106         VTFLAG                 IS CS-COMS-OUT-VT-FLAG;           127000      
002107         CONFIRMFLAG            IS CS-COMS-OUT-CONFIRM-FLAG;      127200      
002108         CONFIRMKEY             IS CS-COMS-OUT-CONFIRM-KEY;       127400      
002109         DESTINATIONDESG        IS CS-COMS-OUT-DESTINATION;       127600      
002110         NEXTINPUTAGENDA        IS CS-COMS-OUT-NEXT-INPUT-AGENDA; 127800      
002111         SETNEXTINPUTAGENDA     IS CS-COMS-OUT-SNEXT-INPUT-AGENDA;128000      
002112         RETAINTRANSACTIONMODE  IS CS-COMS-OUT-SAVE-TRANS-MODE;   128200      
002113         AGENDA                 IS CS-COMS-OUT-AGENDA.            128400      
002114                                                                  128600      
002115 PROCEDURE DIVISION.                                              128800      
002116 DECLARATIVES.                                                    129000      
002117 INTERRUPT-BY-HI SECTION.                                         129200      
002118     USE AS INTERRUPT PROCEDURE.                                  129400      
002119 000A-BEGIN-INTERRUPT.                                            129600      
002120    DISALLOW INTERRUPT.                                           129800      
002121    MOVE "I"                           TO TIPO-LJ.                130000      
002122    MOVE 050104                        TO CODIGO-LJ               130200      
002123    MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-HI.                 130400      
002124* INI VML                                                         130600      
002125    MOVE W77-HI                        TO WKS-VALOR-HI.           130800      
002126    IF WKS-NUM-HI > 0                                             131000      
002127       IF WKS-NUM-HI = 99                                         131200      
002128          NEXT SENTENCE                                           131400      
002129       ELSE                                                       131600      
002130          MOVE WKS-NUM-HI              TO W77-HI.                 131800      
002131    IF WKS-NUM-HI-99 = 99                                         132000      
002132       MOVE WKS-NUM-HI-99              TO W77-HI.                 132200      
002133                                                                  132400      
002134    IF W88-HI-0                                                   132600      
002135       NEXT SENTENCE                                              132800      
002136    ELSE                                                          133000      
002137    IF W88-HI-2                                                   133200      
002138       MOVE SPACES                     TO TEXTO-LJ                133400      
002139       MOVE "PRENDE MONITOR"           TO TEXTO-LJ                133600      
002140       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        133800      
002141       MOVE 1 TO W77-MONITOR                                      134000      
002142    ELSE                                                          134200      
002143    IF W88-HI-3                                                   134400      
002144       MOVE SPACES                     TO TEXTO-LJ                134600      
002145       MOVE "APAGA MONITOR"            TO TEXTO-LJ                134800      
002146       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        135000      
002147       MOVE 0 TO W77-MONITOR                                      135200      
002148    ELSE                                                          135400      
002149    IF W88-HI-4 OR W88-HI-5                                       135600      
002150          MOVE SPACES                     TO TEXTO-LJ             135800      
002151          PERFORM 800000-HI-SALIDA                                136000      
002152          PERFORM 999999-FIN.                                     136200      
002153                                                                  136400      
002154    CHANGE ATTRIBUTE TASKVALUE OF MYSELF TO 0.                    136600      
002155                                                                  136800      
002156     ALLOW INTERRUPT.                                             137000      
002157 0000A-END.                                                       137200      
002158 END DECLARATIVES.                                                137400      
002159 010000-INICIO-PGMA SECTION.                                      137600      
002160 010100-INICIA-CONTROL.                                           137800      
002161*============                                                     138000      
002162    MOVE "S151"                        TO SISTEMA-LJ.             138200      
002163    MOVE "P055"                        TO PASO-LJ.                138400      
002164    MOVE 1                             TO MTP-LJ.                 138600      
002165    MOVE "I"                           TO TIPO-LJ.                138800      
002166    MOVE 050104                        TO CODIGO-LJ.              139000      
002167    PERFORM 020000-INICIO.                                        139100      
002168    IF WKS-FECHA1 = 1                                             139200      
002169       PERFORM 030301-STATUS-FILE-P                               139300      
002170       PERFORM 030301-STATUS-FILE-D.                              139400      
002171    PERFORM 030100-PROCESO UNTIL W77-FIN = 1.                     139500      
002172    STOP RUN.                                                     139600      
002173                                                                  139800      
002174 020000-INICIO.                                                   140000      
002175*==============                                                   140200      
002176     PERFORM 020100-LIBRERIAS.                                    140400      
002177     PERFORM 020200-TASKFILE.                                     140600      
002178     PERFORM 020300-ARCHIVOS.                                     140800      
002179     PERFORM 020400-COMS.                                         141000      
002180     PERFORM 020500-CATALOGO.                                     141200      
002181     PERFORM 020800-CREA-MEZCLA.                                  141400      
002182                                                                  141600      
002183 020100-LIBRERIAS.                                                141800      
002184*=================                                                142000      
002185    CHANGE ATTRIBUTE LIBACCESS         OF "SOPORTECOMS"           142200      
002186                                       TO BYFUNCTION.             142400      
002187    CHANGE ATTRIBUTE FUNCTIONNAME      OF "SOPORTECOMS"           142600      
002188                                       TO "SOPORTECOMS".          142800      
002189                                                                  143000      
002190    CHANGE ATTRIBUTE LIBACCESS         OF "DCILIBRARY"            143200      
002191                                       TO  BYFUNCTION.            143400      
002192    CHANGE ATTRIBUTE FUNCTIONNAME      OF "DCILIBRARY"            143600      
002193                                       TO "COMSSUPPORT".          143800      
002194                                                                  144000      
002195    CHANGE ATTRIBUTE LIBACCESS         OF "CTRLVERS"              144200      
002196                                       TO BYFUNCTION.             144400      
002197    CHANGE ATTRIBUTE FUNCTIONNAME      OF "CTRLVERS"              144600      
002198                                       TO "CTLVERS".              144800      
002199                                                                  145000      
002200    CHANGE ATTRIBUTE LIBACCESS         OF "ADMONXFERS"            145200      
002201                                       TO BYFUNCTION.             145400      
002202    CHANGE ATTRIBUTE FUNCTIONNAME      OF "ADMONXFERS"            145600      
002203                                       TO "ADMONXFERS".           145800      
002204                                                                  146000      
002205    CHANGE ATTRIBUTE LIBACCESS         OF "XFER"                  146200      
002206                                       TO BYFUNCTION.             146400      
002207    CHANGE ATTRIBUTE FUNCTIONNAME      OF "XFER"                  146600      
002208                                       TO "XFER".                 146800      
002209                                                                  147000      
002210    CHANGE ATTRIBUTE LIBACCESS         OF "LOCSUP" TO BYFUNCTION. 147200      
002211    CHANGE ATTRIBUTE FUNCTIONNAME      OF "LOCSUP" TO "LOCSUP".   147400      
002212    CHANGE ATTRIBUTE TITLE             OF "LIB-DISP"              147600      
002213               TO "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".147800      
002214                                                                  148000      
002215    MOVE "S080BD01CON"                 TO     WKS-CTLVER-LIBID.   148200      
002216    CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID    148400      
002217                                              WKS-CTLVER-NOMLIB   148600      
002218                                       GIVING W77-CTLVER-RESULT.  148800      
002219     IF W77-CTLVER-RESULT = 0                                     149000      
002220        CHANGE ATTRIBUTE TITLE OF "S080L710"                      149200      
002221                                       TO     WKS-CTLVER-NOMLIB.  149400      
002222                                                                  149600      
002223    MOVE "S151L001CTL"                 TO     WKS-CTLVER-LIBID.   149800      
002224    CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID    150000      
002225                                              WKS-CTLVER-NOMLIB   150200      
002226                                       GIVING W77-CTLVER-RESULT.  150400      
002227     IF W77-CTLVER-RESULT = 0                                     150600      
002228        CHANGE ATTRIBUTE TITLE         OF "S151-L001"             150800      
002229                                       TO WKS-CTLVER-NOMLIB       151000      
002230     ELSE                                                         151200      
002231        CHANGE ATTRIBUTE TITLE         OF "S151-L001" TO          151400      
002232               "(S151)S151/OBJECT/L001/CONTROL ON CMEMP.".        151600      
002233                                                                  151800      
002234     MOVE 500                          TO WKS-B01-SISTEMA         152000      
002235     MOVE 01                           TO WKS-B01-FUNCION.        152200      
002236     CALL "CONSISDIA IN S151-L001"     USING  WKS-S151B01SISDIA   152400      
002237                                       GIVING W77-RESULT-B01.     152600      
002238                                                                  152800      
002239     IF W77-RESULT-B01 > 0                                        153000      
002240        MOVE W77-RESULT-B01            TO W77-ERROR               153200      
002241        STRING "NO PUEDO OBTENER FECHA DE PROCESO "               153400      
002242               " ERROR EN S151-L001 S500, ERR #" W77-ERROR        153600      
002243        DELIMITED BY SIZE INTO TEXTO-LJ                           153800      
002244        MOVE "O"                       TO TIPO-LJ                 154000      
002245        MOVE 020901                    TO CODIGO-LJ               154200      
002246        CALL "LJ IN LIB-DISP"          USING CONTADOR-LJ,         154400      
002247                                             MENSAJE-LJ           154600      
002248        SET MYSELF(STATUS) TO -1                                  154800      
002249     ELSE                                                         155000      
002250        MOVE WKS-B01-NOMPACMOV         TO WKS-PACK-MOVS           155200      
002251        MOVE WKS-B01-NOMPACDES         TO WKS-PACK-DESS           155400      
002252        MOVE WKS-B01-FECCON            TO WKS-FECHA-PROCESO.      155600      
002253                                                                  156400      
002254     CALL "CSIID OF SOPORTECOMS"       USING WKS-DATOS-HOST.      156600      
002255                                                                  156800      
002256     ALLOW INTERRUPT.                                             157000      
002257     ATTACH INTERRUPT-BY-HI            TO ATTRIBUTE EXCEPTIONEVENT157200      
002258                                       OF MYSELF.                 157400      
002259                                                                  157600      
002260 020200-TASKFILE.                                                 157800      
002261*================                                                 158000      
002262    MOVE ZERO                          TO W77-FIN                 158200      
002263    MOVE "/"                           TO WKS-DIAGONAL1           158400      
002264                                          WKS-DIAGONAL2.          158600      
002265    ACCEPT WKS-FECHA-MAQUINA           FROM TODAYS-DATE.          158800      
002266    MOVE WKS-FECMAQ-CC                 TO WKS-CC-MAQ.             159000      
002267    MOVE WKS-FECMAQ-AA                 TO WKS-TSK-AA              159400      
002268                                          WKS-AA-MAQ.             159600      
002269    MOVE WKS-FECMAQ-MM                 TO WKS-TSK-MM              160200      
002270                                          WKS-MM-MAQ.             160400      
002271    MOVE WKS-FECMAQ-DD                 TO WKS-TSK-DD              161000      
002272                                          WKS-DD-MAQ.             161200      
002273                                                                  161800      
002274    MOVE WKS-NUMCSI-HOST               TO WKS-TSK-NODO.           162000      
002275    MOVE ATTRIBUTE MIXNUMBER           OF MYSELF TO WKS-TSK-MIX.  162200      
002276    SET  MYSELF (OPTION)               TO 1926.                   162400      
002277    SET  MYSELF (FILECARDS)            TO WKS-TIT-TASKFILE.       162600      
002278                                                                  162800      
002279     MOVE 18                           TO W77-FUNCION             163000      
002280     MOVE WKS-FECHA-MAQ-8D             TO WKS-FECHA1              163200      
002281                                          WKS-FECHA-MAQ-ANT-8D    163400      
002282     MOVE 0                            TO WKS-FECHA2              163600      
002283     MOVE 13                           TO W77-FORMATO             163800      
002284     CALL "THECALENDAR IN LOCSUP"      USING W77-FUNCION,         164000      
002285                                             WKS-FECHA1,          164200      
002286                                             WKS-FECHA2,          164400      
002287                                             W77-FORMATO.         164600      
002288                                                                  164800      
002289     IF WKS-FECHA1 = 1                                            165000      
002290* dia habil                                                       165200      
002291        MOVE ZERO                      TO W77-HABIL               165400      
002292     ELSE                                                         165600      
002293* dia inhabil                                                     165800      
002294        MOVE 1                         TO W77-HABIL.              166000      
002295                                                                  166200      
002296 020300-ARCHIVOS.                                                 166400      
002297*================                                                 166600      
002298    MOVE WKS-FECPRO-6D                 TO WKS-MOVS1-FECHA         166800      
002299                                          WKS-DESS1-FECHA         167000      
002300                                          WKS-FECHA-AUT           167200      
002301                                          WKS-FECHA-ENV.          167400      
002302                                                                  167600      
002303    CHANGE ATTRIBUTE TITLE             OF A01-MOVS500             167800      
002304                                       TO WKS-TITLE-MOVS500.      168000      
002305    CHANGE ATTRIBUTE TITLE             OF A02-DESS500             168200      
002306                                       TO WKS-TITLE-DESS500.      168400      
002307                                                                  168600      
002308    CHANGE ATTRIBUTE TITLE             OF A05-AUTORIZACIONES      168800      
002309                                       TO WKS-TIT-AUTORIZA.       169000      
002310    IF ATTRIBUTE RESIDENT              OF A05-AUTORIZACIONES = 1  169200      
002311       NEXT SENTENCE                                              169400      
002312    ELSE                                                          169600      
002313       OPEN OUTPUT A05-AUTORIZACIONES                             169800      
002314       CLOSE A05-AUTORIZACIONES        WITH SAVE.                 170000      
002315                                                                  170200      
002316    CHANGE ATTRIBUTE TITLE             OF A03-CTL-ENVIO           170400      
002317                                       TO WKS-CTLENV.             170600      
002318    IF ATTRIBUTE RESIDENT              OF A03-CTL-ENVIO = 1       170800      
002319      NEXT SENTENCE                                               171000      
002320    ELSE                                                          171200      
002321       OPEN OUTPUT A03-CTL-ENVIO                                  171400      
002322       MOVE 1                          TO R01-REG-AUTS500         171600      
002323                                          R01-REG-AUTS500-D       171800      
002324                                          R01-REG-IND-ENV         172000      
002325                                          R01-REG-IND-ENV-D       172200      
002326       MOVE ZEROS                      TO R01-REG-SECDET          172400      
002327                                          R01-REG-SECDET-DOL      172450      
002328                                                                  172800      
002329       WRITE R01-REG-ENVIO                                        173200      
002330       CLOSE A03-CTL-ENVIO             WITH SAVE.                 173400      
002331                                                                  173600      
002332 030318-VALIDA-PROX-CORTE.                                        173800      
002333*============                                                     174000      
002334    IF WKS-HM-MAQ-4D < WKS-HORA-CORTE(W77-IND-ENV)                174200      
002335       MOVE 1                          TO W77-EOF-ENVIO           174400      
002336       IF W77-IND-ENV > 1                                         174600      
002337         COMPUTE W77-IND-ENV = W77-IND-ENV - 1                    174800      
002338       ELSE                                                       175000      
002339          MOVE ZEROS                   TO W77-IND-ENV             175200      
002340    ELSE                                                          175400      
002341       NEXT SENTENCE.                                             175600      
002342                                                                  175800      
002343 030318-VALIDA-PROX-CORTE-D.                                      176000      
002344*============                                                     176200      
002345    IF WKS-HM-MAQ-4D < WKS-HORA-CORTE-D(W77-IND-ENV-D)            176400      
002346       MOVE 1                          TO W77-EOF-ENVIO           176600      
002347       IF W77-IND-ENV-D > 1                                       176800      
002348         COMPUTE W77-IND-ENV-D = W77-IND-ENV-D - 1                177000      
002349       ELSE                                                       177200      
002350          MOVE ZEROS                   TO W77-IND-ENV-D           177400      
002351    ELSE                                                          177600      
002352       NEXT SENTENCE.                                             177800      
002353                                                                  178000      
002354 020400-COMS.                                                     178200      
002355*============                                                     178400      
002356     ENABLE INPUT COMS-IN    KEY "ONLINE".                        178600      
002357                                                                  178800      
002358*=============== VALIDACION DE AGENDA DE SALIDA ================= 179000      
002359     MOVE "OUTPUT OF LINEA"           TO WKS-COMS-AG-SALIDA-NAME. 179200      
002360     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               179400      
002361           USING  WKS-COMS-AG-SALIDA-NAME                         179600      
002362                  VALUE AGENDA                                    179800      
002363                  W77-COMS-AG-SALIDA-DESG                         180000      
002364           GIVING W77-COMS-RESULT.                                180200      
002365     IF W88-COMS-OK                                               180400      
002366        NEXT SENTENCE                                             180600      
002367     ELSE                                                         180800      
002368        PERFORM 900000-FIN-MAL.                                   181000      
002369                                                                  181200      
002370     MOVE CS-COMS-IN-PROGRAM          TO W77-COMS-MY-PROGRAM-DESG.181400      
002371     CALL "GET-NAME-USING-DESIGNATOR OF DCILIBRARY"               181600      
002372           USING  W77-COMS-MY-PROGRAM-DESG                        181800      
002373                  WKS-COMS-MY-PROGRAM-NAME                        182000      
002374           GIVING W77-COMS-RESULT.                                182200      
002375     IF W88-COMS-OK                                               182400      
002376        NEXT SENTENCE                                             182600      
002377     ELSE                                                         182800      
002378        PERFORM 900000-FIN-MAL.                                   183000      
002379*=============== DESIGNACION DE ESTACION DEFAULT  =============   183200      
002380     MOVE "DEFAULTSTATION"            TO WKS-COMS-DEFSTATION-NAME 183400      
002381     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               183600      
002382           USING  WKS-COMS-DEFSTATION-NAME                        183800      
002383           VALUE  STATION                                         184000      
002384                  W77-COMS-DEFSTATION-DESG                        184200      
002385           GIVING W77-COMS-RESULT.                                184400      
002386     IF W88-COMS-OK                                               184600      
002387        NEXT SENTENCE                                             184800      
002388     ELSE                                                         185000      
002389        PERFORM 900000-FIN-MAL.                                   185200      
002390*=============== DESIGNACION DE ESTACION DEFAULT  =============   185400      
002391     MOVE "DEFAULTSTATION"            TO WKS-COMS-DEFSTATION-NAME.185600      
002392     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               185800      
002393           USING WKS-COMS-DEFSTATION-NAME                         186000      
002394                 VALUE STATION                                    186200      
002395                 W77-COMS-DEFSTATION-DESG                         186400      
002396           GIVING W77-COMS-RESULT.                                186600      
002397     IF W88-COMS-OK                                               186800      
002398        NEXT SENTENCE                                             187000      
002399     ELSE                                                         187200      
002400        PERFORM 900000-FIN-MAL.                                   187400      
002401     MOVE "NOAPL"                    TO WKS-NOAPLINCLUDE-PARAMETRO187600      
002402     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               187800      
002403           USING  WKS-NOAPLINCLUDE-PARAMETRO                      188000      
002404           VALUE  PROGRAM                                         188200      
002405                  W77-NOAPLINCLUDE-DESG                           188400      
002406           GIVING W77-NOAPL-RESULT.                               188600      
002407     IF W88-NOAPL-OK                                              188800      
002408        NEXT SENTENCE                                             189000      
002409     ELSE                                                         189200      
002410        PERFORM 900000-FIN-MAL.                                   189400      
002411                                                                  189600      
002412 020500-CATALOGO.                                                 189800      
002413*================                                                 190000      
002414     PERFORM 020500-CATALOGO-6.                                   190200      
002415     PERFORM 020500-CATALOGO-1822.                                190400      
002416 020500-CATALOGO-6.                                               190600      
002417*==================                                               190800      
002418     MOVE 6                           TO WKS-EL710-CAT.           191000      
002419     MOVE 2                           TO WKS-EL710-BUSQUEDA.      191200      
002420     MOVE ZERO                        TO WKS-EL710-LLAVE1.        191400      
002421     MOVE 500                         TO WKS-EL710-LLAVE2.        191600      
002422     MOVE 151                         TO W77-L710-SISTEMA.        191800      
002423     MOVE 55                          TO W77-L710-PROGRAMA.       192000      
002424     MOVE 20                          TO WKS-EL710-CLAVE.         192200      
002425     MOVE 10                          TO WKS-EL710-REGISTROS.     192400      
002426     MOVE ZERO                        TO WKS-EL710-LLAVE3         192600      
002427                                         WKS-EL710-LLAVE4         192800      
002428                                         WKS-EL710-LLAVE5         193000      
002429                                         WKS-EL710-LLAVE6         193200      
002430                                         WKS-EL710-FECINI         193400      
002431                                         WKS-EL710-NIVINI         193600      
002432                                         WKS-EL710-FEC-VIG.       193800      
002433     MOVE 0                           TO WKS-NUM-CVETRANS.        194000      
002434     MOVE ZERO                        TO W77-EOF.                 194200      
002435     PERFORM 010610-CLAVES-TRAN       UNTIL W77-EOF = 1.          194400      
002436                                                                  194600      
002437 020500-CATALOGO-1822.                                            194800      
002438*=====================                                            195000      
002439    PERFORM 020550-INICIALIZA-OCC-CORTES VARYING W77-IND-ENV      195200      
002440                                     FROM 1 BY 1 UNTIL            195400      
002441                                     W77-IND-ENV = 1000.          195600      
002442                                                                  195800      
002443    PERFORM 020550-INICIALIZA-OCC-CORTES-D VARYING W77-IND-ENV-D  196000      
002444                                     FROM 1 BY 1 UNTIL            196200      
002445                                     W77-IND-ENV-D = 1000.        196400      
002446                                                                  196600      
002447    MOVE 151                         TO WKS-EL710-LLAVE1.         196800      
002448    MOVE 1822                        TO WKS-EL710-CAT.            197000      
002449    MOVE 2                           TO WKS-EL710-LLAVE2.         197200      
002450    MOVE 2                           TO WKS-EL710-BUSQUEDA.       197400      
002451    MOVE 151                         TO W77-L710-SISTEMA.         197600      
002452    MOVE 55                          TO W77-L710-PROGRAMA.        197800      
002453    MOVE 20                          TO WKS-EL710-CLAVE.          198000      
002454    MOVE 10                          TO WKS-EL710-REGISTROS.      198200      
002455    MOVE ZEROS                       TO WKS-EL710-LLAVE3          198400      
002456                                        WKS-EL710-LLAVE4          198600      
002457                                        WKS-EL710-LLAVE5          198800      
002458                                        WKS-EL710-LLAVE6          199000      
002459                                        WKS-EL710-FECINI          199200      
002460                                        WKS-EL710-NIVINI          199400      
002461                                        WKS-EL710-FEC-VIG.        199600      
002462    MOVE 0                           TO W77-CORTE                 199800      
002463                                        W77-CORTE-D.              200000      
002464    MOVE ZERO                        TO W77-EOF.                  200200      
002465    PERFORM 010610-CORTES-HORA       UNTIL W77-EOF = 1.           200400      
002466                                                                  200600      
002467    MOVE 151                         TO WKS-EL710-LLAVE1.         200800      
002468    MOVE 1822                        TO WKS-EL710-CAT.            201000      
002469    MOVE 3                           TO WKS-EL710-LLAVE2.         201200      
002470    MOVE 2                           TO WKS-EL710-BUSQUEDA.       201400      
002471    MOVE 151                         TO W77-L710-SISTEMA.         201600      
002472    MOVE 55                          TO W77-L710-PROGRAMA.        201800      
002473    MOVE 20                          TO WKS-EL710-CLAVE.          202000      
002474    MOVE 10                          TO WKS-EL710-REGISTROS.      202200      
002475    MOVE ZEROS                       TO WKS-EL710-LLAVE3          202400      
002476                                        WKS-EL710-LLAVE4          202600      
002477                                        WKS-EL710-LLAVE5          202800      
002478                                        WKS-EL710-LLAVE6          203000      
002479                                        WKS-EL710-FECINI          203200      
002480                                        WKS-EL710-NIVINI          203400      
002481                                        WKS-EL710-FEC-VIG.        203600      
002482    MOVE 0                           TO W77-CORTE                 203800      
002483                                        W77-CORTE-D.              204000      
002484    MOVE ZERO                        TO W77-EOF.                  204200      
002485    PERFORM 010610-CORTES-HORA       UNTIL W77-EOF = 1.           204400      
002486                                                                  204600      
002487    ACCEPT  WKS-HR-MAQUINA           FROM TIME.                   204800      
002488    MOVE WKS-HH-MAQUINA              TO WKS-HM-HH.                205000      
002489    MOVE WKS-MM-MAQUINA              TO WKS-HM-MM.                205200      
002490    PERFORM 030318-VALIDA-PROX-CORTE VARYING W77-IND-ENV          205400      
002491                           FROM 1 BY 1                            205600      
002492                           UNTIL W77-EOF-ENVIO = 1                205800      
002493                           OR WKS-HORA-CORTE(W77-IND-ENV) = 9999. 206000      
002494    MOVE 0                 TO W77-EOF-ENVIO.                      206200      
002495    PERFORM 030318-VALIDA-PROX-CORTE-D VARYING W77-IND-ENV-D      206400      
002496                        FROM 1 BY 1                               206600      
002497                        UNTIL W77-EOF-ENVIO = 1                   206800      
002498                        OR WKS-HORA-CORTE-D(W77-IND-ENV-D) = 9999.207000      
002499                                                                  207200      
002500 020550-INICIALIZA-OCC-CORTES.                                    207400      
002501    MOVE 9999                  TO WKS-HORA-CORTE(W77-IND-ENV).    207600      
002502                                                                  207800      
002503 020550-INICIALIZA-OCC-CORTES-D.                                  208000      
002504    MOVE 9999                  TO WKS-HORA-CORTE-D(W77-IND-ENV-D).208200      
002505                                                                  208400      
002506 010610-CLAVES-TRAN.                                              208600      
002507*=========================================                        208800      
002508     CALL "L710_CONSUL_DETALLE IN S080L710"                       209000      
002509          USING  W77-L710-SISTEMA,                                209200      
002510                 W77-L710-PROGRAMA,                               209400      
002511                 WKS-L710-ENT,                                    209600      
002512                 WKS-L710-SAL,                                    209800      
002513          GIVING W77-L710-RESULT.                                 210000      
002514                                                                  210200      
002515     IF W77-L710-RESULT = 0 OR 1                                  210400      
002516        PERFORM 010620-LLENA-CATALOGO                             210600      
002517                VARYING WKS-NUM-OCCURS FROM 1 BY 1                210800      
002518                UNTIL WKS-NUM-OCCURS > WKS-SL710-NUMREG           211000      
002519        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,1) TO WKS-EL710-LLAVE1211200      
002520        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,2) TO WKS-EL710-LLAVE2211400      
002521        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,3) TO WKS-EL710-LLAVE3211600      
002522        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,4) TO WKS-EL710-LLAVE4211800      
002523        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,5) TO WKS-EL710-LLAVE5212000      
002524        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,6) TO WKS-EL710-LLAVE6212200      
002525        MOVE WKS-SL710-NIVINI                  TO WKS-EL710-NIVINI212400      
002526        MOVE WKS-SL710-FECINI                  TO WKS-EL710-FECINI212600      
002527     ELSE                                                         212800      
002528        MOVE 1                        TO W77-EOF                  213000      
002529        MOVE W77-L710-RESULT          TO W77-ERR-CAT              213200      
002530        IF W77-ERR-CAT = 20                                       213400      
002531           IF WKS-NUM-CVETRANS = 0                                213600      
002532             MOVE  1                       TO  W77-FIN            213800      
002533             MOVE  "EN CAT 6 NO EXISTEN REG CON MARCA DM"         214000      
002534                                           TO TEXTO-LJ            214200      
002535              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 214400      
002536           ELSE                                                   214600      
002537              NEXT SENTENCE                                       214800      
002538        ELSE                                                      215000      
002539           MOVE  1                    TO  W77-FIN                 215200      
002540           MOVE "I"                   TO TIPO-LJ                  215400      
002541           MOVE 020901                TO CODIGO-LJ                215600      
002542           STRING "ERROR AL LLAMAR S080BD01CON, RESULT = "        215800      
002543                  W77-ERR-CAT                                     216000      
002544           DELIMITED BY SIZE                                      216200      
002545           INTO TEXTO-LJ                                          216400      
002546           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.   216600      
002547                                                                  216800      
002548 010610-CORTES-HORA.                                              217000      
002549*=========================================                        217200      
002550     CALL "L710_CONSUL_DETALLE IN S080L710"                       217400      
002551          USING  W77-L710-SISTEMA,                                217600      
002552                 W77-L710-PROGRAMA,                               217800      
002553                 WKS-L710-ENT,                                    218000      
002554                 WKS-L710-SAL,                                    218200      
002555          GIVING W77-L710-RESULT.                                 218400      
002556                                                                  218600      
002557     IF W77-L710-RESULT = 0 OR 1                                  218800      
002558        PERFORM 010620-LLENA-CATALOGO-CORTES                      219000      
002559                VARYING WKS-NUM-OCCURS FROM 1 BY 1                219200      
002560                UNTIL WKS-NUM-OCCURS > WKS-SL710-NUMREG           219400      
002561        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,1) TO WKS-EL710-LLAVE1219600      
002562        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,2) TO WKS-EL710-LLAVE2219800      
002563        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,3) TO WKS-EL710-LLAVE3220000      
002564        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,4) TO WKS-EL710-LLAVE4220200      
002565        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,5) TO WKS-EL710-LLAVE5220400      
002566        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,6) TO WKS-EL710-LLAVE6220600      
002567        MOVE WKS-SL710-NIVINI         TO WKS-EL710-NIVINI         220800      
002568        MOVE WKS-SL710-FECINI         TO WKS-EL710-FECINI         221000      
002569     ELSE                                                         221200      
002570        MOVE 1                        TO W77-EOF                  221400      
002571        MOVE W77-L710-RESULT          TO W77-ERR-CAT              221600      
002572        IF W77-ERR-CAT = 20                                       221800      
002573              NEXT SENTENCE                                       222000      
002574        ELSE                                                      222200      
002575           MOVE  1                    TO  W77-FIN                 222400      
002576           MOVE "I"                   TO TIPO-LJ                  222600      
002577           MOVE 020901                TO CODIGO-LJ                222800      
002578           STRING "ERROR AL LLAMAR S080BD01CON, RESULT = "        223000      
002579                  W77-ERR-CAT                                     223200      
002580           DELIMITED BY SIZE                                      223400      
002581           INTO TEXTO-LJ                                          223600      
002582           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.   223800      
002583                                                                  224000      
002584 010620-LLENA-CATALOGO.                                           224200      
002585*=========================================                        224400      
002586    MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,1) TO WKS-NUM-CVETRANS.     224600      
002587    MOVE WKS-NUM-CVETRANS TO WKS-CAT6-CVETRAN(WKS-NUM-CVETRANS).  224800      
002588    MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,11)                         225000      
002589                              TO WKS-CAT6-AFC(WKS-NUM-CVETRANS).  225200      
002590                                                                  225400      
002591 010620-LLENA-CATALOGO-CORTES.                                    225600      
002592*=========================================                        225800      
002593* INDICADOR 2 PESOS Y EL 3 DOLAR                                  226000      
002594   IF WKS-SL710-DAT(WKS-NUM-OCCURS,2) = 2                         226200      
002595      ADD 1                          TO W77-CORTE                 226400      
002596      MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,2)                        226600      
002597                                     TO WKS-INDSERV(W77-CORTE)    226800      
002598      MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,3)                        227000      
002599                                     TO WKS-HORA-CORTE(W77-CORTE).227200      
002600   IF WKS-SL710-DAT(WKS-NUM-OCCURS,2) = 3                         227400      
002601      ADD 1                       TO W77-CORTE-D                  227600      
002602      MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,2)                        227800      
002603                                  TO WKS-INDSERV-D(W77-CORTE-D)   228000      
002604      MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,3)                        228200      
002605                                 TO WKS-HORA-CORTE-D(W77-CORTE-D).228400      
002606                                                                  228600      
002607 900000-FIN-MAL.                                                  228800      
002608*===============                                                  229000      
002609    MOVE SPACES                       TO TEXTO-LJ.                229200      
002610    STRING " ERROR EN COMS, FIN ERRONEO DE PROGRAMA "             229400      
002611           " AVISAR AL RESPONSABLE DEL SISTEMA "                  229600      
002612    DELIMITED BY SIZE                                             229800      
002613    INTO TEXTO-LJ.                                                230000      
002614    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.          230200      
002615    PERFORM 999999-FIN.                                           230400      
002616                                                                  230600      
002617 999999-FIN.                                                      230800      
002618*===========                                                      231000      
002619     IF W88-HI-5                                                  231200      
002620        MOVE "DISABLE NOW PROGRAM "   TO WKS-SMCOMS-STRING1       231400      
002621     ELSE                                                         231600      
002622        MOVE "DISABLE PROGRAM "       TO WKS-SMCOMS-STRING1.      231800      
002623     MOVE WKS-COMS-MY-PROGRAM-NAME    TO WKS-SMCOMS-STRING2       232000      
002624     CALL "SMCOMS OF SOPORTECOMS"                                 232200      
002625           USING  WKS-SMCOMS-COMANDO                              232400      
002626                  WKS-SMCOMS-TRABAJO                              232600      
002627           GIVING W77-SMCOMS-RESULT.                              232800      
002628     IF W88-SMCOMS-OK                                             233000      
002629        NEXT SENTENCE                                             233200      
002630     ELSE                                                         233400      
002631        MOVE SPACES                   TO TEXTO-LJ                 233600      
002632        MOVE W77-SMCOMS-RESULT        TO W77-RESULT-COMS          233800      
002633        STRING                                                    234000      
002634             " ERROR DISABLE RESULTS "                            234200      
002635             W77-RESULT-COMS                                      234400      
002636        DELIMITED BY SIZE                                         234600      
002637        INTO TEXTO-LJ                                             234800      
002638        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      235000      
002639                                                                  235200      
002640 800000-HI-SALIDA.                                                235400      
002641*=================                                                235600      
002642    MOVE  020201                      TO CODIGO-LJ.               235800      
002643    MOVE  "I"                         TO TIPO-LJ.                 236000      
002644                                                                  236200      
002645    IF W88-HI-4                                                   236400      
002646       MOVE "TERMINACION NORMAL"      TO TEXTO-LJ                 236600      
002647    ELSE                                                          236800      
002648    IF W88-HI-5                                                   237000      
002649       MOVE "TERMINACION DE EMERGENCIA" TO TEXTO-LJ.              237200      
002650    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                      237400      
002651                                MENSAJE-LJ.                       237600      
002652                                                                  237800      
002653 020800-CREA-MEZCLA.                                              238000      
002654*=====================                                            238200      
002655  MOVE LOW-VALUES                 TO WKS-B05PROCESOS              238400      
002656  MOVE 1                          TO WKS-B05-FUNCION              238600      
002657  MOVE 151                        TO WKS-B05-SISTEMA              238800      
002658  MOVE 55                         TO WKS-B05-FCHPRO               239000      
002659                                     WKS-B05-NUMPRO               239200      
002660  MOVE 9999                       TO WKS-B05-NUMREGINI            239400      
002661  MOVE 0                          TO W77-RESULT-LIBCON            239600      
002662  CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS          239800      
002663                                  GIVING W77-RESULT-LIBCON        240000      
002664  IF W77-RESULT-LIBCON = 0                                        240200      
002665     MOVE 22                         TO WKS-B05-FUNCION           240400      
002666     MOVE 151                        TO WKS-B05-SISTEMA           240600      
002667     MOVE 55                         TO WKS-B05-FCHPRO            240800      
002668                                        WKS-B05-NUMPRO            241000      
002669     MOVE ZEROS                      TO WKS-B05-FCHINI            241200      
002670     MOVE 9999                       TO WKS-B05-NUMREGINI         241400      
002671     MOVE 0                          TO W77-RESULT-LIBCON         241600      
002672     CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS       241800      
002673                                     GIVING W77-RESULT-LIBCON     242000      
002674     IF W77-RESULT-LIBCON = 0                                     242200      
002675        MOVE 19                         TO WKS-B05-FUNCION        242400      
002676        MOVE 151                        TO WKS-B05-SISTEMA        242600      
002677        MOVE WKS-TSK-MIX                TO WKS-B05-MIX            242800      
002678        MOVE 55                         TO WKS-B05-FCHPRO         243000      
002679                                           WKS-B05-NUMPRO         243200      
002680        MOVE ZEROS                      TO WKS-B05-FCHINI         243400      
002681        MOVE 9999                       TO WKS-B05-NUMREGINI      243600      
002682        MOVE 0                          TO W77-RESULT-LIBCON      243800      
002683        CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS    244000      
002684                                        GIVING W77-RESULT-LIBCON  244200      
002685        IF W77-RESULT-LIBCON NOT = 0                              244400      
002686           PERFORM 020860-MENSAJE-LJ                              244600      
002687        ELSE                                                      244800      
002688          NEXT SENTENCE                                           245000      
002689     ELSE                                                         245200      
002690        PERFORM 020860-MENSAJE-LJ                                 245400      
002691  ELSE                                                            245600      
002692     MOVE 19                         TO WKS-B05-FUNCION           245800      
002693     MOVE 151                        TO WKS-B05-SISTEMA           246000      
002694     MOVE WKS-TSK-MIX                TO WKS-B05-MIX               246200      
002695     MOVE 55                         TO WKS-B05-FCHPRO            246400      
002696                                        WKS-B05-NUMPRO            246600      
002697     MOVE ZEROS                      TO WKS-B05-FCHINI            246800      
002698     MOVE 9999                       TO WKS-B05-NUMREGINI         247000      
002699     MOVE 0                          TO W77-RESULT-LIBCON         247200      
002700     CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS       247400      
002701                                     GIVING W77-RESULT-LIBCON     247600      
002702     IF W77-RESULT-LIBCON = 0                                     247800      
002703        NEXT SENTENCE                                             248000      
002704     ELSE                                                         248200      
002705        PERFORM 020860-MENSAJE-LJ.                                248400      
002706                                                                  248600      
002707 020860-MENSAJE-LJ.                                               248800      
002708*==================                                               249000      
002709    MOVE "I" TO TIPO-LJ                                           249200      
002710    MOVE 051010 TO CODIGO-LJ                                      249400      
002711    MOVE W77-RESULT-LIBCON            TO W77-ERROR                249600      
002712                                                                  249800      
002713    STRING "FUNCION " WKS-B05-FUNCION " ERROR # " W77-ERROR       250000      
002714    "ERROR AL LLAMADO DE B05PROCESOS" WKS-B05-SISTEMA " "         250200      
002715                  WKS-B05-NUMPRO " " WKS-FECHA-MAQ-8D             250400      
002716    DELIMITED BY SIZE INTO TEXTO-LJ                               250600      
002717    CALL "LJ IN LIB-DISP"       USING CONTADOR-LJ,                250800      
002718                                      MENSAJE-LJ.                 251000      
002719                                                                  251200      
002720 030100-PROCESO.                                                  251400      
002721*===============                                                  251600      
002722    PERFORM 030100-ACEPTA-MENSAGE.                                251800      
002723    IF W88-ACEPTA-MSG                                             252000      
002724       PERFORM 030200-ANALIZA-MSG                                 252200      
002725       IF W88-MSG-OK                                              252400      
002726          PERFORM 030800-ENVIA-RESPUESTA.                         252600      
002727                                                                  252800      
002728 030100-ACEPTA-MENSAGE.                                           253000      
002729*======================                                           253200      
002730    MOVE ZERO                       TO W77-ACEPTA-MSG             253400      
002731                                       WKS-HDR-COMS-RES           253600      
002732                                       W77-ESPERACOMS-TIPO-EVENTO.253800      
002733    CALL "ESPERACOMS OF SOPORTECOMS"                              254000      
002734         USING  W77-ESPERACOMS-TIEMPO                             254200      
002735         GIVING W77-ESPERACOMS-TIPO-EVENTO.                       254400      
002736                                                                  254600      
002737    IF W88-MONITOR                                                254800      
002738       MOVE SPACES                     TO TEXTO-LJ                255000      
002739       MOVE W77-ESPERACOMS-TIPO-EVENTO TO WKS-TIPO-EVENTO         255200      
002740       STRING "EVENTO ESPERACOMS " WKS-TIPO-EVENTO                255400      
002741       DELIMITED BY SIZE INTO TEXTO-LJ                            255600      
002742       CALL "LJ IN LIB-DISP"           USING CONTADOR-LJ          255800      
002743                                             MENSAJE-LJ.          256000      
002744                                                                  256200      
002745    IF W88-POR-MSG                                                256400      
002746       MOVE 1                          TO W77-ACEPTA-MSG          256600      
002747    ELSE                                                          256800      
002748    IF W88-POR-TIMEOUT                                            257000      
002749       NEXT SENTENCE                                              257200      
002750    ELSE                                                          257400      
002751    IF W88-POR-HI                                                 257600      
002752       IF W88-HI-4 OR W88-HI-5                                    257800      
002753          MOVE SPACES                     TO TEXTO-LJ             258000      
002754          PERFORM 800000-HI-SALIDA                                258200      
002755          PERFORM 999999-FIN                                      258400      
002756       ELSE                                                       258600      
002757          IF W88-HI-6                                             258800      
002758             PERFORM 020500-CATALOGO-6                            259000      
002759             MOVE SPACES                      TO TEXTO-LJ         259200      
002760             MOVE "CATALOGO ACTUALIZADO 6"    TO TEXTO-LJ         259400      
002761             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  259600      
002762             MOVE ZERO TO W77-HI                                  259800      
002763          ELSE                                                    260000      
002764          IF W88-HI-1822                                          260200      
002765             PERFORM 020500-CATALOGO-1822                         260400      
002766             MOVE SPACES                      TO TEXTO-LJ         260600      
002767             MOVE "CATALOGO ACTUALIZADO 1822" TO TEXTO-LJ         260800      
002768             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  261000      
002769             MOVE ZERO TO W77-HI                                  261200      
002770          ELSE                                                    261400      
002771             NEXT SENTENCE                                        261600      
002772    ELSE                                                          261800      
002773    IF W88-POR-EVENTO                                             262000      
002774       MOVE 1                          TO W77-ACEPTA-MSG          262200      
002775*      WAIT AND RESET UNTIL 15, ATTRIBUTE EXCEPTIONEVENT OF MYSELF262400      
002776    ELSE                                                          262600      
002777    IF W88-POR-ACCEPT                                             262800      
002778       ACCEPT WKS-BASURA.                                         263000      
002779                                                                  263200      
002780    ACCEPT WKS-FECHA-MAQUINA           FROM TODAYS-DATE.          263400      
002781                                                                  264400      
002782    MOVE WKS-FECMAQ-CC                 TO WKS-CC-MAQ.             264600      
002783    MOVE WKS-FECMAQ-AA                 TO WKS-AA-MAQ.             264800      
002784    MOVE WKS-FECMAQ-MM                 TO WKS-MM-MAQ.             265000      
002785    MOVE WKS-FECMAQ-DD                 TO WKS-DD-MAQ.             265200      
002786                                                                  265400      
002787    IF WKS-FECHA-MAQ-8D = WKS-FECHA-MAQ-ANT-8D                    265600      
002788       NEXT SENTENCE                                              265800      
002789    ELSE                                                          266000      
002790       MOVE WKS-FECHA-MAQ-8D           TO WKS-FECHA-MAQ-ANT-8D    266200      
002791       MOVE 18                         TO W77-FUNCION             266400      
002792       MOVE WKS-FECHA-MAQ-8D           TO WKS-FECHA1              266600      
002793       MOVE 0                          TO WKS-FECHA2              266800      
002794       MOVE 13                         TO W77-FORMATO             267000      
002795       CALL "THECALENDAR IN LOCSUP"    USING W77-FUNCION,         267200      
002796                                          WKS-FECHA1,             267400      
002797                                          WKS-FECHA2,             267600      
002798                                          W77-FORMATO             267800      
002799       IF WKS-FECHA1 = 1                                          268000      
002800          MOVE ZERO                    TO W77-HABIL               268200      
002801       ELSE                                                       268400      
002802          MOVE 1                       TO W77-HABIL.              268600      
002803                                                                  268800      
002804       PERFORM 030300-GENERA-ARCHIVO.                             269000      
002805                                                                  269200      
002806 030200-ANALIZA-MSG.                                              269400      
002807*===================                                              269600      
002808    MOVE ZERO                          TO W77-MSG-OK              269800      
002809                                          W77-LONGMSG.            270000      
002810    MOVE LOW-VALUES                    TO WKS-MSG-COMS.           270200      
002811    RECEIVE COMS-IN MESSAGE INTO WKS-MSG-COMS                     270400      
002812                         NO DATA NEXT SENTENCE.                   270600      
002813    IF CS-COMS-IN-STATUS-KEY = 99                                 270800      
002814       MOVE 1                          TO W77-FIN                 271000      
002815    ELSE                                                          271200      
002816    IF CS-COMS-IN-STATUS-KEY = 0 OR 89 OR 91 OR 92 OR 93          271400      
002817       MOVE 1                          TO W77-MSG-OK              271600      
002818       MOVE CS-COMS-IN-TEXT-LENGTH     TO W77-LONGMSG             271800      
002819    ELSE                                                          272000      
002820       MOVE SPACES                     TO TEXTO-LJ                272200      
002821       MOVE "ERROR EN RECEIVE COMS"    TO TEXTO-LJ                272400      
002822       CALL "LJ IN LIB-DISP"           USING CONTADOR-LJ          272600      
002823                                             MENSAJE-LJ.          272800      
002824                                                                  273000      
002825    IF W88-MSG-OK OR W77-FIN = 1                                  273200      
002826       IF W88-MONITOR                                             273400      
002827          STRING "MSG ENTRADA " WKS-MSG-COMS                      273600      
002828          DELIMITED BY SIZE INTO MENSAJE-LJ                       273800      
002829          CALL "LJ IN LIB-DISP"        USING CONTADOR-LJ          274000      
002830                                             MENSAJE-LJ           274200      
002831       ELSE                                                       274400      
002832          NEXT SENTENCE                                           274600      
002833    ELSE                                                          274800      
002834       MOVE CS-COMS-IN-STATUS-KEY      TO W77-STATUS-KEY          275000      
002835       MOVE SPACE                      TO TEXTO-LJ                275200      
002836       MOVE "RESULT DEL HEADER NO TRATADO "  TO TEXTO-LJ          275400      
002837       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        275600      
002838       MOVE SPACES                     TO TEXTO-LJ                275800      
002839       MOVE WKS-MSG-COMS               TO TEXTO-LJ                276000      
002840       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        276200      
002841       MOVE 1                          TO W77-MSG-OK.             276400      
002842                                                                  276600      
002843 030800-ENVIA-RESPUESTA.                                          276800      
002844*=======================                                          277000      
002845    MOVE WKS-NUMCSI-HOST              TO WKS-HDR-COMS-CCR-DES     277200      
002846                                         WKS-HDR-COMS-CCR-ORG.    277400      
002847    MOVE "CONSULTA NO DISPONIBLE"     TO WKS-TEXTO-COMS.          277600      
002848    MOVE WKS-HDR-COMS-APL-ORG         TO WKS-HDR-COMS-APL-DES.    277800      
002849    MOVE W77-LONGMSG                  TO CS-COMS-OUT-TEXT-LENGTH. 278000      
002850    MOVE 1                            TO CS-COMS-OUT-COUNT.       278200      
002851    MOVE 0                            TO CS-COMS-OUT-STATUS-KEY.  278400      
002852    MOVE W77-COMS-AG-SALIDA-DESG      TO CS-COMS-OUT-AGENDA.      278600      
002853    MOVE W77-COMS-DEFSTATION-DESG     TO CS-COMS-OUT-DESTINATION. 278800      
002854    MOVE 015155                       TO WKS-TRANCODE-COMS.       279000      
002855    PERFORM 030710-ENVIA-COMS.                                    279200      
002856                                                                  279400      
002857 030710-ENVIA-COMS.                                               279600      
002858*==================                                               279800      
002859    SEND COMS-OUT FROM WKS-MSG-COMS.                              280000      
002860    IF W88-MONITOR                                                280200      
002861       STRING "MSG SALIDA  " WKS-MSG-COMS                         280400      
002862       DELIMITED BY SIZE INTO MENSAJE-LJ                          280600      
002863       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       280800      
002864                                                                  281000      
002865    IF CS-COMS-OUT-STATUS-KEY = 0 OR 96                           281200      
002866       NEXT SENTENCE                                              281400      
002867    ELSE                                                          281600      
002868       MOVE CS-COMS-OUT-STATUS-KEY    TO W77-STATUS-KEY           281800      
002869       STRING MY-ID " ERROR EN SEND MSG ST-KEY "                  282000      
002870              W77-STATUS-KEY                                      282200      
002871       DELIMITED BY SIZE INTO MENSAJE-LJ                          282400      
002872       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       282600      
002873                                                                  282800      
002874 030300-GENERA-ARCHIVO.                                           283000      
002875*======================                                           283200      
002876    PERFORM 030302-VERIFICA-ENVIO.                                284200      
002877    IF WKS-HAYARCH-P = 0                                          284400      
002878       PERFORM  030300-GENERA-ARCHIVO-P.                          284600      
002879                                                                  284800      
002880    IF WKS-HAYARCH-D = 0                                          285000      
002881       PERFORM  030300-GENERA-ARCHIVO-D.                          285200      
002882                                                                  285400      
002883    IF WKS-HAYARCH-D = 1 AND WKS-HAYARCH-P = 1                    285600      
002884       PERFORM 999999-FIN.                                        285800      
002885                                                                  286000      
002886 030301-STATUS-FILE-P.                                            286200      
002887*===============================                                  286400      
002888    PERFORM 030318-LEE-CONTROL.                                   286600      
002889    IF W77-STATUS-FILE = 1 AND W77-IND-ARCH > 0                   286800      
002890       ACCEPT  WKS-HR-MAQUINA             FROM TIME               287000      
002891                                                                  287200      
002892       MOVE WKS-HH-MAQUINA                TO WKS-HM-HH            287400      
002893       MOVE WKS-MM-MAQUINA                TO WKS-HM-MM            287600      
002894                                                                  287800      
002895       IF WKS-HM-MAQ-4D > WKS-HORA-CORTE(W77-IND-ARCH)            288000      
002896          MOVE 1 TO W77-ENVIO-CTAMRE                              288200      
002897          PERFORM 020500-ABRE-ARCH-CTAMRE-P                       288400      
002898          PERFORM 020500-TRAILER-CTAMRE                           288600      
002899          CLOSE A04-CTAMRE-ARCHIVO           WITH SAVE            288800      
002900          PERFORM 030300-ENVIO-ARCHIVO-P.                         289000      
002901                                                                  289200      
002902 030301-STATUS-FILE-D.                                            289400      
002903*===============================                                  289600      
002904    PERFORM 030318-LEE-CONTROL-D.                                 289800      
002905    IF W77-STATUS-FILE-D = 1  AND W77-IND-ARCH-D > 0              290000      
002906       ACCEPT  WKS-HR-MAQUINA             FROM TIME               290200      
002907                                                                  290400      
002908       MOVE WKS-HH-MAQUINA                TO WKS-HM-HH            290600      
002909       MOVE WKS-MM-MAQUINA                TO WKS-HM-MM            290800      
002910                                                                  291000      
002911       IF WKS-HM-MAQ-4D > WKS-HORA-CORTE-D(W77-IND-ARCH-D)        291200      
002912          MOVE 1 TO W77-ENVIO-CTAMRE-D                            291400      
002913          PERFORM 020500-ABRE-ARCH-CTAMRE-D2                      291600      
002914          PERFORM 020500-TRAILER-CTAMRE-D                         291800      
002915          CLOSE A04-CTAMRE-ARCHIVO-D           WITH SAVE          292000      
002916          PERFORM 030300-ENVIO-ARCHIVO-D.                         292200      
002917                                                                  292400      
002918                                                                  292600      
002919 030300-GENERA-ARCHIVO-P.                                         292800      
002920*===============================                                  293000      
002921    PERFORM 030318-LEE-CONTROL.                                   293200      
002922    PERFORM 030374-GENERA-ARCH-CTAMRE.                            293400      
002923    PERFORM 030300-ENVIO-ARCHIVO-P.                               293600      
002924                                                                  293800      
002925 030300-ENVIO-ARCHIVO-P.                                          294000      
002926*===============================                                  294200      
002927    IF W88-ENVIO-CTAMRE AND W88-HABIL                             294400      
002928       UNSTRING WKS-TITLE-CTAMRE-ARCHIVO DELIMITED BY " "         294600      
002929           INTO WKS-INTE-ARCHIVO                                  294800      
002930       MOVE ZERO                       TO W77-INTE-SNT            295000      
002931       PERFORM 030705-ENVIO-POR-INTELAR                           295200      
002932       MOVE ZERO                       TO W77-ENVIO-CTAMRE        295600      
002933                                                                  295800      
002934       PERFORM 400021-LIMPIA-TRAILER                              296200      
002935       PERFORM 400022-LIMPIA-CTLTOT-P                             296400      
002936       MOVE ZERO                       TO W77-RUTA-CTAMRE-P.      296600      
002937                                                                  299000      
002938 030300-GENERA-ARCHIVO-D.                                         299200      
002939*=========================                                        299400      
002940    PERFORM 030318-LEE-CONTROL-D.                                 299600      
002941    PERFORM 030374-GENERA-ARCH-CTAMRE-D.                          299800      
002942    PERFORM 030300-ENVIO-ARCHIVO-D.                               300000      
002943                                                                  300200      
002944 030300-ENVIO-ARCHIVO-D.                                          300400      
002945*=========================                                        300600      
002946    IF W88-ENVIO-CTAMRE-D AND  W88-HABIL                          300800      
002947       UNSTRING WKS-TITLE-CTAMRE-ARCHIVO-D DELIMITED BY " "       301000      
002948           INTO WKS-INTE-ARCHIVO                                  301200      
002949       MOVE ZERO                       TO W77-INTE-SNT            301400      
002950       PERFORM 030705-ENVIO-POR-INTELAR                           301600      
002951       MOVE ZERO                       TO W77-ENVIO-CTAMRE-D      301800      
002952                                                                  302000      
002953       PERFORM 400021-LIMPIA-TRAILER-D                            302400      
002954       PERFORM 400022-LIMPIA-CTLTOT-D                             302600      
002955       MOVE ZERO                       TO W77-RUTA-CTAMRE-D.      302800      
002956                                                                  305200      
002957 030302-VERIFICA-ENVIO.                                           305400      
002958*======================                                           305600      
002959    ACCEPT  WKS-HR-MAQUINA             FROM TIME.                 305800      
002960                                                                  306000      
002961    MOVE WKS-HH-MAQUINA                TO WKS-HM-HH.              306200      
002962    MOVE WKS-MM-MAQUINA                TO WKS-HM-MM.              306400      
002963                                                                  306600      
002964    IF ((WKS-HM-MAQ-4D = WKS-HORA-CORTE(W77-IND-ENV) OR           306800      
002965        WKS-HM-MAQ-4D > WKS-HORA-CORTE(W77-IND-ENV)) AND          307000      
002966                        WKS-INDSERV(W77-IND-ENV) = 2 AND          307200      
002967                        W77-ENVIO-CTAMRE = 0) AND W88-HABIL       307400      
002968        MOVE 1                         TO W77-ENVIO-CTAMRE.       307600      
002969                                                                  307800      
002970    IF WKS-HORA-CORTE(W77-IND-ENV) = 9999                         308000      
002971       MOVE 1        TO   WKS-HAYARCH-P                           308200      
002972    ELSE                                                          308400      
002973        PERFORM 020500-ABRE-ARCH-CTAMRE.                          308600      
002974                                                                  308800      
002975    IF ((WKS-HM-MAQ-4D = WKS-HORA-CORTE-D(W77-IND-ENV-D) OR       309000      
002976        WKS-HM-MAQ-4D > WKS-HORA-CORTE-D(W77-IND-ENV-D)) AND      309200      
002977                        WKS-INDSERV-D(W77-IND-ENV-D) = 3 AND      309400      
002978                        W77-ENVIO-CTAMRE-D = 0) AND W88-HABIL     309600      
002979        MOVE 1                         TO W77-ENVIO-CTAMRE-D.     309800      
002980                                                                  310000      
002981    IF WKS-HORA-CORTE-D(W77-IND-ENV-D) = 9999                     310200      
002982       MOVE 1        TO   WKS-HAYARCH-D                           310400      
002983    ELSE                                                          310600      
002984        PERFORM 020500-ABRE-ARCH-CTAMRE-D.                        310800      
002985                                                                  311000      
002986 030318-LEE-CONTROL.                                              311200      
002987*===================                                              311400      
002988    OPEN  I-O A03-CTL-ENVIO.                                      311600      
002989    READ  A03-CTL-ENVIO.                                          311800      
002990    MOVE  R01-REG-AUTS500              TO W77-AUT-ENVIO500.       312000      
002991*    MOVE  R01-REG-SECARCH              TO W77-SEC-ARCH.          312200      
002992    MOVE  R01-REG-SECDET               TO W77-SEC-DET.            312400      
002993                                                                  312600      
002994    MOVE  R01-REG-STATUS-FILE          TO W77-STATUS-FILE.        312800      
002995    MOVE  R01-REG-IND-ARCH             TO W77-IND-ARCH.           313000      
002996                                                                  313200      
002997    MOVE  R01-REG-TOTAL-MOV-PES        TO WKS-NUM-TOTAL-MOV-PES.  313400      
002998    MOVE  R01-REG-CARG-PES             TO WKS-NUM-CARG-PES.       313600      
002999    MOVE  R01-REG-TOTAL-CARG-PES       TO WKS-NUM-TOTAL-CARG-PES. 313800      
003000    MOVE  R01-REG-ABON-PES             TO WKS-NUM-ABON-PES.       314000      
003001    MOVE  R01-REG-TOTAL-ABON-PES       TO WKS-NUM-TOTAL-ABON-PES. 314200      
003002                                                                  314400      
003003    MOVE  R01-REG-TOTAL-MOV-ELIM-PES   TO                         314600      
003004                                       WKS-NUM-TOTAL-MOV-ELIM-PES.314800      
003005    MOVE  R01-REG-CARG-ELIM-PES        TO WKS-NUM-CARG-ELIM-PES.  315000      
003006    MOVE  R01-REG-TOTAL-CARG-ELIM-PES  TO                         315200      
003007                                      WKS-NUM-TOTAL-CARG-ELIM-PES.315400      
003008    MOVE  R01-REG-ABON-ELIM-PES        TO WKS-NUM-ABON-ELIM-PES.  315600      
003009    MOVE  R01-REG-TOTAL-ABON-ELIM-PES  TO                         315800      
003010                                      WKS-NUM-TOTAL-ABON-ELIM-PES.316000      
003011                                                                  316200      
003012    CLOSE A03-CTL-ENVIO WITH SAVE.                                316400      
003013                                                                  316600      
003014                                                                  316800      
003015 400022-LIMPIA-CTLTOT-P.                                          317000      
003016*===================                                              317200      
003017    OPEN  I-O A03-CTL-ENVIO.                                      317400      
003018    SEEK A03-CTL-ENVIO RECORD.                                    317600      
003019    READ A03-CTL-ENVIO.                                           317800      
003020    MOVE 0                         TO W77-STATUS-FILE.            317850      
003021    MOVE W77-STATUS-FILE           TO R01-REG-STATUS-FILE.        317900      
003022    MOVE 0                         TO R01-REG-TOTAL-MOV-PES       318000      
003023                                      R01-REG-CARG-PES            318200      
003024                                      R01-REG-TOTAL-CARG-PES      318400      
003025                                      R01-REG-ABON-PES            318600      
003026                                      R01-REG-TOTAL-ABON-PES      318800      
003027                                                                  319000      
003028                                      R01-REG-TOTAL-MOV-ELIM-PES  319200      
003029                                      R01-REG-CARG-ELIM-PES       319400      
003030                                      R01-REG-TOTAL-CARG-ELIM-PES 319600      
003031                                      R01-REG-ABON-ELIM-PES       319800      
003032                                      R01-REG-TOTAL-ABON-ELIM-PES.320000      
003033    REWRITE R01-REG-ENVIO             INVALID KEY NEXT SENTENCE.  320200      
003034    CLOSE A03-CTL-ENVIO WITH SAVE.                                320400      
003035                                                                  320600      
003036 030318-LEE-CONTROL-D.                                            320800      
003037*===================                                              321000      
003038    OPEN  I-O A03-CTL-ENVIO.                                      321200      
003039    READ  A03-CTL-ENVIO.                                          321400      
003040    MOVE  R01-REG-AUTS500-D            TO W77-AUT-ENVIO500-D.     321600      
003041    MOVE  R01-REG-SECDET-DOL           TO W77-SEC-DET-DOL.        322000      
003042                                                                  322200      
003043    MOVE  R01-REG-STATUS-FILE-D        TO W77-STATUS-FILE-D.      322400      
003044    MOVE  R01-REG-IND-ARCH-D           TO W77-IND-ARCH-D.         322600      
003045                                                                  322800      
003046    MOVE  R01-REG-TOTAL-MOV-DOL        TO WKS-NUM-TOTAL-MOV-DOL.  323000      
003047    MOVE  R01-REG-CARG-DOL             TO WKS-NUM-CARG-DOL.       323200      
003048    MOVE  R01-REG-TOTAL-CARG-DOL       TO WKS-NUM-TOTAL-CARG-DOL. 323400      
003049    MOVE  R01-REG-ABON-DOL             TO WKS-NUM-ABON-DOL.       323600      
003050    MOVE  R01-REG-TOTAL-ABON-DOL       TO WKS-NUM-TOTAL-ABON-DOL. 323800      
003051                                                                  324000      
003052    MOVE  R01-REG-TOTAL-MOV-ELIM-DOL   TO                         324200      
003053                                       WKS-NUM-TOTAL-MOV-ELIM-DOL.324400      
003054    MOVE  R01-REG-CARG-ELIM-DOL        TO WKS-NUM-CARG-ELIM-DOL.  324600      
003055    MOVE  R01-REG-TOTAL-CARG-ELIM-DOL  TO                         324800      
003056                                      WKS-NUM-TOTAL-CARG-ELIM-DOL.325000      
003057    MOVE  R01-REG-ABON-ELIM-DOL        TO WKS-NUM-ABON-ELIM-DOL.  325200      
003058    MOVE  R01-REG-TOTAL-ABON-ELIM-DOL  TO                         325400      
003059                                      WKS-NUM-TOTAL-ABON-ELIM-DOL.325600      
003060                                                                  325800      
003061    CLOSE A03-CTL-ENVIO WITH SAVE.                                326000      
003062                                                                  326200      
003063 400022-LIMPIA-CTLTOT-D.                                          326400      
003064*===================                                              326600      
003065    OPEN  I-O A03-CTL-ENVIO.                                      326800      
003066    SEEK A03-CTL-ENVIO RECORD.                                    327000      
003067    READ A03-CTL-ENVIO.                                           327200      
003068    MOVE 0                         TO W77-STATUS-FILE-D.          327250      
003069    MOVE W77-STATUS-FILE-D         TO R01-REG-STATUS-FILE-D.      327300      
003070    MOVE 0                         TO R01-REG-TOTAL-MOV-DOL       327400      
003071                                      R01-REG-CARG-DOL            327600      
003072                                      R01-REG-TOTAL-CARG-DOL      327800      
003073                                      R01-REG-ABON-DOL            328000      
003074                                      R01-REG-TOTAL-ABON-DOL      328200      
003075                                                                  328400      
003076                                      R01-REG-TOTAL-MOV-ELIM-DOL  328600      
003077                                      R01-REG-CARG-ELIM-DOL       328800      
003078                                      R01-REG-TOTAL-CARG-ELIM-DOL 329000      
003079                                      R01-REG-ABON-ELIM-DOL       329200      
003080                                      R01-REG-TOTAL-ABON-ELIM-DOL.329400      
003081    REWRITE R01-REG-ENVIO             INVALID KEY NEXT SENTENCE.  329600      
003082    CLOSE A03-CTL-ENVIO WITH SAVE.                                329800      
003083                                                                  330000      
003084                                                                  330200      
003085 030318-LEE-CONTROL-CORTE.                                        330400      
003086*===================                                              330600      
003087    OPEN  I-O A03-CTL-ENVIO.                                      330800      
003088    READ  A03-CTL-ENVIO.                                          331000      
003089    MOVE R01-REG-IND-ENV               TO W77-IND-ENV.            331200      
003090    CLOSE A03-CTL-ENVIO WITH SAVE.                                331600      
003091                                                                  331800      
003092 030318-LEE-CONTROL-CORTE-D.                                      332000      
003093*===================                                              332200      
003094    OPEN  I-O A03-CTL-ENVIO.                                      332400      
003095    READ  A03-CTL-ENVIO.                                          332600      
003096    MOVE R01-REG-IND-ENV-D             TO W77-IND-ENV-D.          332800      
003097    CLOSE A03-CTL-ENVIO WITH SAVE.                                333200      
003098                                                                  333400      
003099 020400-GENERA-RUTA-ARCH.                                         333600      
003100*=======================                                          333800      
003101    MOVE WKS-FECHA-PROCESO             TO WKS-CTAMRE-FECHA        334000      
003102                                                                  334200      
003103    IF WKS-NUMCSI-HOST = 32 OR 10                                 334400      
003104       MOVE 10                         TO WKS-CTAMRE-NODO         334600      
003105    ELSE                                                          334800      
003106       MOVE WKS-NUMCSI-HOST            TO WKS-CTAMRE-NODO.        335000      
003107    MOVE W77-IND-ENV                   TO WKS-CTAMRE-SECUENCIA.   335200      
003108    MOVE "000000145886"                TO WKS-CTAMRE-ARCHIVO.     335400      
003109                                                                  335600      
003110    CHANGE ATTRIBUTE TITLE         OF A04-CTAMRE-ARCHIVO          335800      
003111                                   TO WKS-TITLE-CTAMRE-ARCHIVO.   336000      
003112                                                                  336200      
003113 020400-GENERA-RUTA-ARCH-2.                                       336400      
003114*=======================                                          336600      
003115    MOVE WKS-FECHA-PROCESO             TO WKS-CTAMRE-FECHA        336800      
003116                                                                  337000      
003117    IF WKS-NUMCSI-HOST = 32 OR 10                                 337200      
003118       MOVE 10                         TO WKS-CTAMRE-NODO         337400      
003119    ELSE                                                          337600      
003120       MOVE WKS-NUMCSI-HOST            TO WKS-CTAMRE-NODO.        337800      
003121    MOVE W77-IND-ARCH                  TO WKS-CTAMRE-SECUENCIA.   338000      
003122    MOVE "000000145886"                TO WKS-CTAMRE-ARCHIVO.     338200      
003123                                                                  338400      
003124    CHANGE ATTRIBUTE TITLE         OF A04-CTAMRE-ARCHIVO          338600      
003125                                   TO WKS-TITLE-CTAMRE-ARCHIVO.   338800      
003126                                                                  339000      
003127020500-ABRE-ARCH-CTAMRE-P.                                        339200      
003128*=======================                                          339400      
003129    IF W77-RUTA-CTAMRE-P = 0                                      339600      
003130       MOVE 1 TO W77-RUTA-CTAMRE-P                                339800      
003131       PERFORM 020400-GENERA-RUTA-ARCH-2.                         340000      
003132                                                                  340200      
003133    IF ATTRIBUTE RESIDENT OF A04-CTAMRE-ARCHIVO = VALUE TRUE      340400      
003134       OPEN EXTEND A04-CTAMRE-ARCHIVO                             340600      
003135    ELSE                                                          340800      
003136       OPEN OUTPUT A04-CTAMRE-ARCHIVO                             341000      
003137       PERFORM 020500-HEADER-CTAMRE.                              341200      
003138                                                                  341400      
003139 020500-ABRE-ARCH-CTAMRE.                                         341600      
003140*=======================                                          341800      
003141    IF W77-RUTA-CTAMRE-P = 0                                      342000      
003142       MOVE 1 TO W77-RUTA-CTAMRE-P                                342200      
003143       PERFORM 020400-GENERA-RUTA-ARCH.                           342400      
003144                                                                  342600      
003145    IF ATTRIBUTE RESIDENT OF A04-CTAMRE-ARCHIVO = VALUE TRUE      342800      
003146       OPEN EXTEND A04-CTAMRE-ARCHIVO                             343000      
003147    ELSE                                                          343200      
003148       OPEN OUTPUT A04-CTAMRE-ARCHIVO                             343400      
003149       PERFORM 400020-ACTUALIZA-IND-ARCH                          343600      
003150       PERFORM 020500-HEADER-CTAMRE.                              343800      
003151                                                                  344000      
003152 400020-ACTUALIZA-IND-ARCH.                                       344200      
003153*=========================                                        344400      
003154    OPEN I-O A03-CTL-ENVIO.                                       344600      
003155    MOVE W77-IND-ENV TO W77-IND-ARCH.                             344800      
003156    SEEK A03-CTL-ENVIO RECORD.                                    345000      
003157    READ A03-CTL-ENVIO.                                           345200      
003158    MOVE W77-IND-ARCH               TO R01-REG-IND-ARCH.          345400      
003159    REWRITE R01-REG-ENVIO              INVALID KEY NEXT SENTENCE. 345600      
003160    CLOSE A03-CTL-ENVIO WITH SAVE.                                345800      
003161                                                                  346000      
003162                                                                  346200      
003163 020400-GENERA-RUTA-ARCH-D.                                       346400      
003164*=======================                                          346600      
003165    MOVE WKS-FECHA-PROCESO             TO WKS-CTAMRE-FECHA-D.     346800      
003166                                                                  347000      
003167    IF WKS-NUMCSI-HOST = 32 OR 10                                 347200      
003168       MOVE 10                         TO WKS-CTAMRE-NODO-D       347400      
003169    ELSE                                                          347600      
003170       MOVE WKS-NUMCSI-HOST            TO WKS-CTAMRE-NODO-D.      347800      
003171    MOVE W77-IND-ENV-D                 TO WKS-CTAMRE-SECUENCIA-D. 348000      
003172    MOVE "000000145857"                TO WKS-CTAMRE-ARCHIVO-D.   348200      
003173                                                                  348400      
003174    CHANGE ATTRIBUTE TITLE         OF A04-CTAMRE-ARCHIVO-D        348600      
003175                                   TO WKS-TITLE-CTAMRE-ARCHIVO-D. 348800      
003176                                                                  349000      
003177020400-GENERA-RUTA-ARCH-D2.                                       349200      
003178*=======================                                          349400      
003179    MOVE WKS-FECHA-PROCESO             TO WKS-CTAMRE-FECHA-D.     349600      
003180                                                                  349800      
003181    IF WKS-NUMCSI-HOST = 32 OR 10                                 350000      
003182       MOVE 10                         TO WKS-CTAMRE-NODO-D       350200      
003183    ELSE                                                          350400      
003184       MOVE WKS-NUMCSI-HOST            TO WKS-CTAMRE-NODO-D.      350600      
003185    MOVE W77-IND-ARCH-D                 TO WKS-CTAMRE-SECUENCIA-D.350800      
003186    MOVE "000000145857"                TO WKS-CTAMRE-ARCHIVO-D.   351000      
003187                                                                  351200      
003188    CHANGE ATTRIBUTE TITLE         OF A04-CTAMRE-ARCHIVO-D        351400      
003189                                   TO WKS-TITLE-CTAMRE-ARCHIVO-D. 351600      
003190                                                                  351800      
003191020500-ABRE-ARCH-CTAMRE-D2.                                       352000      
003192*=======================                                          352200      
003193    IF W77-RUTA-CTAMRE-D = 0                                      352400      
003194       MOVE 1 TO W77-RUTA-CTAMRE-D                                352600      
003195       PERFORM 020400-GENERA-RUTA-ARCH-D2.                        352800      
003196                                                                  353000      
003197    IF ATTRIBUTE RESIDENT OF A04-CTAMRE-ARCHIVO-D = VALUE TRUE    353200      
003198       OPEN EXTEND A04-CTAMRE-ARCHIVO-D                           353400      
003199    ELSE                                                          353600      
003200       OPEN OUTPUT A04-CTAMRE-ARCHIVO-D                           353800      
003201       PERFORM 020500-HEADER-CTAMRE-D.                            354000      
003202                                                                  354200      
003203 020500-ABRE-ARCH-CTAMRE-D.                                       354400      
003204*=======================                                          354600      
003205    IF W77-RUTA-CTAMRE-D = 0                                      354800      
003206       MOVE 1 TO W77-RUTA-CTAMRE-D                                355000      
003207       PERFORM 020400-GENERA-RUTA-ARCH-D.                         355200      
003208                                                                  355400      
003209    IF ATTRIBUTE RESIDENT OF A04-CTAMRE-ARCHIVO-D = VALUE TRUE    355600      
003210       OPEN EXTEND A04-CTAMRE-ARCHIVO-D                           355800      
003211    ELSE                                                          356000      
003212       OPEN OUTPUT A04-CTAMRE-ARCHIVO-D                           356200      
003213       PERFORM 400020-ACTUALIZA-IND-ARCH-D                        356400      
003214       PERFORM 020500-HEADER-CTAMRE-D.                            356600      
003215                                                                  356800      
003216 400020-ACTUALIZA-IND-ARCH-D.                                     357000      
003217*=========================                                        357200      
003218    OPEN I-O A03-CTL-ENVIO.                                       357400      
003219    MOVE W77-IND-ENV-D TO W77-IND-ARCH-D                          357600      
003220    SEEK A03-CTL-ENVIO RECORD.                                    357800      
003221    READ A03-CTL-ENVIO.                                           358000      
003222    MOVE  W77-IND-ARCH-D               TO R01-REG-IND-ARCH-D.     358200      
003223    REWRITE R01-REG-ENVIO              INVALID KEY NEXT SENTENCE. 358400      
003224    CLOSE A03-CTL-ENVIO WITH SAVE.                                358600      
003225                                                                  358800      
003226 020500-HEADER-CTAMRE.                                            359000      
003227*====================                                             359200      
003228    MOVE WKS-NUMCSI-HOST               TO 500-R01-NODORI.         359400      
003229    MOVE WKS-FECHA-MAQ-6D              TO 500-R01-FECPROC.        359600      
003230    MOVE 000000145886                  TO 500-R01-SISCTE.         359800      
003231    MOVE W77-IND-ENV                   TO 500-R01-SECARC.         360000      
003232    MOVE "BARRIDO DE CUENTAS CONCENTRADORAS PESOS"                360200      
003233                                       TO 500-R01-DESCTESIS.      360400      
003234    WRITE A04-REG-CTAMRE   FROM 500-R01-HDR.                      360600      
003235                                                                  360800      
003236 020500-HEADER-CTAMRE-D.                                          361000      
003237*====================                                             361200      
003238    MOVE WKS-NUMCSI-HOST               TO 500-R01-NODORI.         361400      
003239    MOVE WKS-FECHA-MAQ-6D              TO 500-R01-FECPROC.        361600      
003240    MOVE  000000145857                 TO 500-R01-SISCTE.         361800      
003241    MOVE W77-IND-ENV-D                 TO 500-R01-SECARC.         362000      
003242    MOVE "BARRIDO DE CUENTAS CONCENTRADORAS DOLARES"              362200      
003243                                       TO 500-R01-DESCTESIS.      362400      
003244    WRITE A04-REG-CTAMRE-D FROM 500-R01-HDR.                      362600      
003245                                                                  362800      
003246 020500-TRAILER-CTAMRE.                                           363000      
003247*=====================                                            363200      
003248    MOVE WKS-NUM-TOTAL-MOV-PES         TO 500-R03-TOTMOV.         363400      
003249    MOVE WKS-NUM-ABON-PES              TO 500-R03-NUMABO.         363600      
003250    MOVE WKS-NUM-TOTAL-ABON-PES        TO 500-R03-TOTABO.         363800      
003251    MOVE WKS-NUM-CARG-PES              TO 500-R03-NUMCAR.         364000      
003252    MOVE WKS-NUM-TOTAL-CARG-PES        TO 500-R03-TOTCAR.         364200      
003253                                                                  364400      
003254    MOVE WKS-NUM-TOTAL-MOV-ELIM-PES    TO 500-R03-TOTMOV-ELIM.    364600      
003255    MOVE WKS-NUM-ABON-ELIM-PES         TO 500-R03-NUMABO-ELIM.    364800      
003256    MOVE WKS-NUM-TOTAL-ABON-ELIM-PES   TO 500-R03-TOTABO-ELIM.    365000      
003257    MOVE WKS-NUM-CARG-ELIM-PES         TO 500-R03-NUMCAR-ELIM.    365200      
003258    MOVE WKS-NUM-TOTAL-CARG-ELIM-PES   TO 500-R03-TOTCAR-ELIM.    365400      
003259    WRITE A04-REG-CTAMRE     FROM 500-R03-TRA.                    365600      
003260                                                                  365800      
003261 020500-TRAILER-CTAMRE-D.                                         366000      
003262*=====================                                            366200      
003263    MOVE WKS-NUM-TOTAL-MOV-DOL         TO 500-R03-TOTMOV.         366400      
003264    MOVE WKS-NUM-ABON-DOL              TO 500-R03-NUMABO.         366600      
003265    MOVE WKS-NUM-TOTAL-ABON-DOL        TO 500-R03-TOTABO.         366800      
003266    MOVE WKS-NUM-CARG-DOL              TO 500-R03-NUMCAR.         367000      
003267    MOVE WKS-NUM-TOTAL-CARG-DOL        TO 500-R03-TOTCAR.         367200      
003268                                                                  367400      
003269    MOVE WKS-NUM-TOTAL-MOV-ELIM-DOL    TO 500-R03-TOTMOV-ELIM.    367600      
003270    MOVE WKS-NUM-ABON-ELIM-DOL         TO 500-R03-NUMABO-ELIM.    367800      
003271    MOVE WKS-NUM-TOTAL-ABON-ELIM-DOL   TO 500-R03-TOTABO-ELIM.    368000      
003272    MOVE WKS-NUM-CARG-ELIM-DOL         TO 500-R03-NUMCAR-ELIM.    368200      
003273    MOVE WKS-NUM-TOTAL-CARG-ELIM-DOL   TO 500-R03-TOTCAR-ELIM.    368400      
003274    WRITE A04-REG-CTAMRE-D   FROM 500-R03-TRA.                    368600      
003275                                                                  368800      
003276 030705-ENVIO-POR-INTELAR.                                        369000      
003277*======================                                           369200      
003278* PARA ENVIAR EL ARCHIVO POR INTELAR SE REQUIERE QUE LA VARIABLE  369400      
003279* WKS-INTE-ARCHIVO CONTENGA EL NOMBRE DEL ARCHIVO A ENVIAR        369600      
003280*==============================================================   369800      
003281    CALL "INTELARSND IN ADMONXFERS" USING  WKS-INTE-ARCHIVO       370000      
003282                                    GIVING W77-INTE-SNT.          370200      
003283    IF W77-INTE-SNT NOT = 0                                       370400      
003284       MOVE "E"                       TO TIPO-LJ                  370600      
003285       MOVE 020901                    TO CODIGO-LJ                370800      
003286       STRING "ERROR EN EL ENVIO POR INTELAR DEL ARCHIVO "        371000      
003287              WKS-INTE-ARCHIVO                                    371200      
003288       DELIMITED BY SIZE                                          371400      
003289       INTO TEXTO-LJ                                              371600      
003290       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       371800      
003291                                                                  372000      
003292 030374-GENERA-ARCH-CTAMRE.                                       372200      
003293*========================                                         372400      
003294    MOVE ZERO                          TO   W77-FIN-ARCH.         372600      
003295    MOVE W77-AUT-ENVIO500              TO   W77-NUMREG-MOV500.    372800      
003296    ADD 1                              TO   W77-NUMREG-MOV500.    373000      
003297    OPEN INPUT A01-MOVS500.                                       373200      
003298    SEEK A01-MOVS500 RECORD.                                      373800      
003299    READ A01-MOVS500                   INTO A00-R01-REGMOV AT END 374000      
003300                                       MOVE 1 TO W77-FIN-ARCH.    374200      
003301    IF A00-R01-FUNCION = 99                                       374400      
003302       MOVE 1                          TO  W77-FIN-ARCH.          374600      
003303    OPEN INPUT A02-DESS500.                                       374800      
003304    OPEN I-O A05-AUTORIZACIONES.                                  375000      
003305    PERFORM 030373-SELECCIONA-CTAMRE    UNTIL W77-FIN-ARCH = 1.   375200      
003306    IF W88-ENVIO-CTAMRE AND W88-HABIL                             375400      
003307       PERFORM 020500-TRAILER-CTAMRE                              375600      
003308       ADD 1                          TO W77-IND-ENV.             375800      
003309                                                                  376000      
003310    PERFORM 030350-ACTUALIZA-CONTROL.                             376200      
003311    MOVE ZERO                          TO W77-AUT-ENVIO500.       376400      
003312    CLOSE A01-MOVS500                  WITH RELEASE.              376600      
003313    CLOSE A02-DESS500.                                            376800      
003314    CLOSE A04-CTAMRE-ARCHIVO           WITH SAVE.                 377000      
003315    CLOSE A05-AUTORIZACIONES           WITH SAVE.                 377200      
003316                                                                  377400      
003317 030374-GENERA-ARCH-CTAMRE-D.                                     377600      
003318*========================                                         377800      
003319    MOVE ZERO                          TO   W77-FIN-ARCH-D.       378000      
003320    MOVE W77-AUT-ENVIO500-D            TO   W77-NUMREG-MOV500.    378200      
003321    ADD 1                              TO   W77-NUMREG-MOV500.    378400      
003322    OPEN INPUT A01-MOVS500.                                       378600      
003323    SEEK A01-MOVS500 RECORD.                                      379400      
003324    READ A01-MOVS500                   INTO A00-R01-REGMOV AT END 379600      
003325                                       MOVE 1 TO W77-FIN-ARCH-D.  379800      
003326    IF A00-R01-FUNCION = 99                                       380000      
003327       MOVE 1                          TO  W77-FIN-ARCH-D.        380200      
003328    OPEN INPUT A02-DESS500.                                       380400      
003329    OPEN I-O A05-AUTORIZACIONES.                                  380500      
003330    PERFORM 030373-SELECCIONA-CTAMRE-D  UNTIL W77-FIN-ARCH-D = 1. 380600      
003331    IF W88-ENVIO-CTAMRE-D AND W88-HABIL                           380800      
003332       PERFORM 020500-TRAILER-CTAMRE-D                            381000      
003333       ADD 1                           TO W77-IND-ENV-D.          381200      
003334                                                                  381400      
003335    PERFORM 030350-ACTUALIZA-CONTROL-D.                           381600      
003336    MOVE ZERO                          TO W77-AUT-ENVIO500-D.     381800      
003337    CLOSE A01-MOVS500                  WITH RELEASE.              382000      
003338    CLOSE A02-DESS500.                                            382200      
003339    CLOSE A04-CTAMRE-ARCHIVO-D         WITH SAVE.                 382400      
003340    CLOSE A05-AUTORIZACIONES           WITH SAVE.                 382600      
003341                                                                  382800      
003342 030350-ACTUALIZA-CONTROL.                                        383000      
003343*=========================                                        383200      
003344    OPEN I-O A03-CTL-ENVIO.                                       383400      
003345    MOVE 1                             TO W77-NUMREG-ACC.         383600      
003346    SEEK A03-CTL-ENVIO RECORD.                                    383800      
003347    READ A03-CTL-ENVIO.                                           384000      
003348    MOVE W77-AUT-ENVIO500              TO R01-REG-AUTS500.        384200      
003349    MOVE W77-SEC-DET                   TO R01-REG-SECDET.         384600      
003350    MOVE W77-IND-ENV                   TO R01-REG-IND-ENV.        384800      
003351                                                                  385000      
003352    MOVE  WKS-NUM-TOTAL-MOV-PES        TO R01-REG-TOTAL-MOV-PES.  385200      
003353    MOVE  WKS-NUM-CARG-PES             TO R01-REG-CARG-PES.       385400      
003354    MOVE  WKS-NUM-TOTAL-CARG-PES       TO R01-REG-TOTAL-CARG-PES. 385600      
003355    MOVE  WKS-NUM-ABON-PES             TO R01-REG-ABON-PES.       385800      
003356    MOVE  WKS-NUM-TOTAL-ABON-PES       TO R01-REG-TOTAL-ABON-PES. 386000      
003357                                                                  386200      
003358    MOVE  WKS-NUM-TOTAL-MOV-ELIM-PES   TO                         386400      
003359                                      R01-REG-TOTAL-MOV-ELIM-PES. 386600      
003360    MOVE  WKS-NUM-CARG-ELIM-PES        TO R01-REG-CARG-ELIM-PES.  386800      
003361    MOVE  WKS-NUM-TOTAL-CARG-ELIM-PES  TO                         387000      
003362                                      R01-REG-TOTAL-CARG-ELIM-PES.387200      
003363    MOVE  WKS-NUM-ABON-ELIM-PES        TO R01-REG-ABON-ELIM-PES.  387400      
003364    MOVE  WKS-NUM-TOTAL-ABON-ELIM-PES  TO                         387600      
003365                                      R01-REG-TOTAL-ABON-ELIM-PES.387800      
003366                                                                  388000      
003367    MOVE  1                            TO W77-STATUS-FILE.        388200      
003368    MOVE  W77-STATUS-FILE              TO R01-REG-STATUS-FILE.    388400      
003369                                                                  388600      
003370    REWRITE R01-REG-ENVIO              INVALID KEY NEXT SENTENCE. 388800      
003371    CLOSE A03-CTL-ENVIO WITH SAVE.                                389000      
003372                                                                  389200      
003373 030350-ACTUALIZA-CONTROL-D.                                      389400      
003374*=========================                                        389600      
003375    OPEN I-O A03-CTL-ENVIO.                                       389800      
003376    MOVE 1                             TO W77-NUMREG-ACC.         390000      
003377    SEEK A03-CTL-ENVIO RECORD.                                    390200      
003378    READ A03-CTL-ENVIO.                                           390400      
003379    MOVE W77-AUT-ENVIO500-D              TO R01-REG-AUTS500-D.    390600      
003380    MOVE W77-SEC-DET-DOL                 TO R01-REG-SECDET-DOL.   391000      
003381    MOVE W77-IND-ENV-D                   TO R01-REG-IND-ENV-D.    391200      
003382                                                                  391400      
003383    MOVE  WKS-NUM-TOTAL-MOV-DOL        TO R01-REG-TOTAL-MOV-DOL.  391600      
003384    MOVE  WKS-NUM-CARG-DOL             TO R01-REG-CARG-DOL.       391800      
003385    MOVE  WKS-NUM-TOTAL-CARG-DOL       TO R01-REG-TOTAL-CARG-DOL. 392000      
003386    MOVE  WKS-NUM-ABON-DOL             TO R01-REG-ABON-DOL.       392200      
003387    MOVE  WKS-NUM-TOTAL-ABON-DOL       TO R01-REG-TOTAL-ABON-DOL. 392400      
003388                                                                  392600      
003389    MOVE  WKS-NUM-TOTAL-MOV-ELIM-DOL   TO                         392800      
003390                                      R01-REG-TOTAL-MOV-ELIM-DOL. 393000      
003391    MOVE  WKS-NUM-CARG-ELIM-DOL        TO R01-REG-CARG-ELIM-DOL.  393200      
003392    MOVE  WKS-NUM-TOTAL-CARG-ELIM-DOL  TO                         393400      
003393                                      R01-REG-TOTAL-CARG-ELIM-DOL.393600      
003394    MOVE  WKS-NUM-ABON-ELIM-DOL        TO R01-REG-ABON-ELIM-DOL.  393800      
003395    MOVE  WKS-NUM-TOTAL-ABON-ELIM-DOL  TO                         394000      
003396                                      R01-REG-TOTAL-ABON-ELIM-DOL.394200      
003397                                                                  394400      
003398    MOVE  1                            TO W77-STATUS-FILE-D.      394600      
003399    MOVE  W77-STATUS-FILE-D            TO R01-REG-STATUS-FILE-D.  394800      
003400                                                                  395000      
003401    REWRITE R01-REG-ENVIO              INVALID KEY NEXT SENTENCE. 395200      
003402    CLOSE A03-CTL-ENVIO WITH SAVE.                                395400      
003403                                                                  395600      
003404 030373-SELECCIONA-CTAMRE.                                        395800      
003405*========================                                         396000      
003406    ADD 1                              TO W77-AUT-ENVIO500.       396200      
003407    IF A00-R01-MONEDA = 1                                         396400      
003408       PERFORM 030374-VALIDA-REGISTRO.                            396600      
003409    PERFORM 030375-LEE-SIG-REG.                                   396800      
003410                                                                  397000      
003411 030375-LEE-SIG-REG.                                              397200      
003412*===================                                              397400      
003413    READ A01-MOVS500 INTO A00-R01-REGMOV                          397600      
003414         AT END MOVE 1     TO W77-FIN-ARCH.                       397800      
003415                                                                  398000      
003416    IF A00-R01-FUNCION = 99                                       398200      
003417       MOVE 1                          TO W77-FIN-ARCH.           398400      
003418                                                                  398600      
003419 030374-VALIDA-REGISTRO.                                          398800      
003420*========================                                         399000      
003421    MOVE ZERO                        TO WKS-IND-EXTNET.           399200      
003422                                                                  399400      
003423    IF A00-R01-FORMATO = 2 AND A00-R01-FUNCION = 1                399600      
003424       MOVE 0 TO W77-LEE                                          399800      
003425       MOVE 0 TO W77-VECES                                        400000      
003426       PERFORM 030376-LEE-DATOS-ADIC UNTIL W77-VECES = 3          400200      
003427                                                                  400400      
003428       IF A01-R01-APUDES > 0 AND A00-R01-APUDES > 0               400600      
003429          MOVE 0 TO W77-LEE, W77-VECES                            400800      
003430          PERFORM 030376-LEE-DATOS-ADIC2 UNTIL W77-VECES = 3      401000      
003431          MOVE A01-R02-IND-EXTNET    TO WKS-IND-EXTNET.           401200      
003432                                                                  401400      
003433    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 1              401600      
003434       AND (A00-R01-STATUS = 1 OR 2 OR 3 OR 4)                    401800      
003435       AND (A00-R01-ORIGEN = 1 OR 3)                              402000      
003436       AND (A00-R01-FORMATO = 2)                                  402200      
003437       AND WKS-IND-EXTNET = 4 AND A00-R01-MONEDA = 1              402400      
003438         PERFORM 400023-GENERA-MOV-AUTORIZA                       402600      
003439         PERFORM 400040-MUEVE-DATOS-CTAMRE VARYING W77-IND FROM 1 402800      
003440         BY 1 UNTIL W77-IND >5 OR A00-R01-CVETRAN (W77-IND)=0     403000      
003441    ELSE                                                          403200      
003442    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 2              403400      
003443          MOVE A00-R01-AUT-AELIM-S151     TO WKS-AUTORIZA-151-KEY 403600      
003444          PERFORM 400050-VALIDACION-ELIM-CTAMRE                   403800      
003445          PERFORM 400040-ELIM-CTAMRE                              404000      
003446    ELSE                                                          404200      
003447    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 21             404400      
003448       PERFORM 500010-ELIMINA-POR-PROCESO                         404600      
003449    ELSE                                                          404800      
003450    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 22             405000      
003451       PERFORM 500030-ELIMINA-POR-PROCESO-AUT                     405200      
003452    ELSE                                                          405400      
003453       NEXT SENTENCE.                                             405600      
003454                                                                  405800      
003455 030373-SELECCIONA-CTAMRE-D.                                      406000      
003456*========================                                         406200      
003457    ADD 1                              TO W77-AUT-ENVIO500-D.     406400      
003458    IF A00-R01-MONEDA = 5                                         406600      
003459       PERFORM 030374-VALIDA-REGISTRO-D.                          406800      
003460    PERFORM 030375-LEE-SIG-REG-D.                                 407000      
003461                                                                  407200      
003462 030375-LEE-SIG-REG-D.                                            407400      
003463*===================                                              407600      
003464    READ A01-MOVS500 INTO A00-R01-REGMOV                          407800      
003465         AT END MOVE 1     TO W77-FIN-ARCH-D.                     408000      
003466                                                                  408200      
003467    IF A00-R01-FUNCION = 99                                       408400      
003468       MOVE 1                          TO W77-FIN-ARCH-D.         408600      
003469                                                                  408800      
003470 030374-VALIDA-REGISTRO-D.                                        409000      
003471*=========================                                        409200      
003472    MOVE ZERO                        TO WKS-IND-EXTNET.           409400      
003473                                                                  409600      
003474    IF A00-R01-FORMATO = 2 AND A00-R01-FUNCION = 1                409800      
003475       MOVE 0 TO W77-LEE                                          410000      
003476       MOVE 0 TO W77-VECES                                        410200      
003477       PERFORM 030376-LEE-DATOS-ADIC UNTIL W77-VECES = 3          410400      
003478                                                                  410600      
003479       IF A01-R01-APUDES > 0 AND A00-R01-APUDES > 0               410800      
003480          MOVE 0 TO W77-LEE, W77-VECES                            411000      
003481          PERFORM 030376-LEE-DATOS-ADIC2 UNTIL W77-VECES = 3      411200      
003482          MOVE A01-R02-IND-EXTNET    TO WKS-IND-EXTNET.           411400      
003483                                                                  411600      
003484    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 1              411800      
003485       AND (A00-R01-STATUS = 1 OR 2 OR 3 OR 4)                    412000      
003486       AND (A00-R01-ORIGEN = 1 OR 3)                              412200      
003487       AND (A00-R01-FORMATO = 2)                                  412400      
003488       AND WKS-IND-EXTNET = 4 AND A00-R01-MONEDA = 5              412600      
003489          PERFORM 400023-GENERA-MOV-AUTORIZA-D                    412800      
003490          PERFORM 400040-MUEVE-DATOS-CTAMRE-D VARYING             413000      
003491                                                W77-IND-D FROM 1  413200      
003492          BY 1 UNTIL W77-IND-D >5 OR A00-R01-CVETRAN (W77-IND-D)=0413400      
003493    ELSE                                                          413600      
003494    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 2              413800      
003495          MOVE A00-R01-AUT-AELIM-S151     TO WKS-AUTORIZA-151-KEY 414000      
003496          PERFORM 400050-VALIDACION-ELIM-D                        414200      
003497          PERFORM 400040-ELIM-CTAMRE-D                            414400      
003498    ELSE                                                          414600      
003499    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 21             414800      
003500       PERFORM 500010-ELIMINA-POR-PROCESO-D                       415000      
003501    ELSE                                                          415200      
003502    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 22             415400      
003503       PERFORM 500030-ELIM-POR-PROCESO-AUT-D                      415600      
003504    ELSE                                                          415800      
003505       NEXT SENTENCE.                                             416000      
003506                                                                  416200      
003507 400040-ELIM-CTAMRE.                                              416400      
003508*========================                                         416600      
003509    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 2              416800      
003510    AND W88-EXISTE-MOV-EXT                                        417000      
003511       PERFORM 400040-MUEVE-DATOS-ELIM-CTAMRE                     417200      
003512                     VARYING W77-IND FROM 1 BY 1                  417400      
003513                     UNTIL   W77-IND >5                           417600      
003514                     OR      A00-R01-CVETRAN (W77-IND)=0          417800      
003515                                                                  418000      
003516       PERFORM 400030-ACTUALIZA-STATUS                            418200      
003517                                                                  418400      
003518       IF WKS-REG-AUTANTS151 > 0                                  418600      
003519          PERFORM 400020-ELIMINA-AUT-ANTERIORES UNTIL             418800      
003520                                    A00-R01-AUT-ANT-S151 = 0.     419000      
003521                                                                  419200      
003522 400040-ELIM-CTAMRE-D.                                            419400      
003523*========================                                         419600      
003524    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 2              419800      
003525    AND W88-EXISTE-MOV-EXT                                        420000      
003526       PERFORM 400040-MUEVE-DATOS-ELIM-D                          420200      
003527                     VARYING W77-IND-D FROM 1 BY 1                420400      
003528                     UNTIL   W77-IND-D >5                         420600      
003529                     OR      A00-R01-CVETRAN (W77-IND-D)=0        420800      
003530                                                                  421000      
003531       PERFORM 400030-ACTUALIZA-STATUS                            421200      
003532                                                                  421400      
003533       IF WKS-REG-AUTANTS151 > 0                                  421600      
003534          PERFORM 400020-ELIMINA-AUT-ANT-D UNTIL                  421800      
003535                                    A00-R01-AUT-ANT-S151 = 0.     422000      
003536                                                                  422200      
003537 400030-ACTUALIZA-STATUS.                                         422400      
003538*========================                                         422600      
003539   IF A00-R01-FUNCION = 2                                         422800      
003540      MOVE 2         TO  R01-REG-STATUS                           423000      
003541   ELSE IF A00-R01-FUNCION = 21                                   423200      
003542      MOVE 3         TO  R01-REG-STATUS                           423400      
003543   ELSE IF A00-R01-FUNCION = 22                                   423600      
003544      MOVE 4         TO  R01-REG-STATUS.                          423800      
003545                                                                  424000      
003546   REWRITE R01-REG-AUTORIZA.                                      424200      
003547                                                                  424400      
003548 400020-ELIMINA-AUT-ANTERIORES.                                   424600      
003549*========================                                         424800      
003550    MOVE A00-R01-AUT-ANT-S151      TO WKS-AUTORIZA-151-KEY.       425000      
003551    PERFORM 400050-VALIDACION-ELIM-CTAMRE.                        425200      
003552                                                                  425400      
003553    IF W88-EXISTE-MOV-EXT                                         425600      
003554       PERFORM 400040-MUEVE-DATOS-ELIM-CTAMRE                     425800      
003555                  VARYING W77-IND FROM 1 BY 1                     426000      
003556                  UNTIL   W77-IND >5                              426200      
003557                  OR      A00-R01-CVETRAN (W77-IND)=0             426400      
003558                                                                  426600      
003559       PERFORM 400030-ACTUALIZA-STATUS.                           426800      
003560                                                                  427000      
003561 400020-ELIMINA-AUT-ANT-D.                                        427200      
003562*========================                                         427400      
003563    MOVE A00-R01-AUT-ANT-S151      TO WKS-AUTORIZA-151-KEY.       427600      
003564    PERFORM 400050-VALIDACION-ELIM-D.                             427800      
003565                                                                  428000      
003566    IF W88-EXISTE-MOV-EXT                                         428200      
003567       PERFORM 400040-MUEVE-DATOS-ELIM-D                          428400      
003568                  VARYING W77-IND-D FROM 1 BY 1                   428600      
003569                  UNTIL   W77-IND-D >5                            428800      
003570                  OR      A00-R01-CVETRAN (W77-IND-D)=0           429000      
003571                                                                  429200      
003572       PERFORM 400030-ACTUALIZA-STATUS.                           429400      
003573                                                                  429600      
003574 500010-ELIMINA-POR-PROCESO.                                      429800      
003575*========================                                         430000      
003576   MOVE 0 TO W77-EOF.                                             430200      
003577   CLOSE A05-AUTORIZACIONES WITH SAVE.                            430400      
003578   OPEN I-O A05-AUTORIZACIONES.                                   430600      
003579                                                                  430800      
003580   PERFORM 500020-BARRE-AUT-TP UNTIL W77-EOF = 1.                 431000      
003581                                                                  431200      
003582 500010-ELIMINA-POR-PROCESO-D.                                    431400      
003583*========================                                         431600      
003584   MOVE 0 TO W77-EOF.                                             431800      
003585   CLOSE A05-AUTORIZACIONES WITH SAVE.                            432000      
003586   OPEN I-O A05-AUTORIZACIONES.                                   432200      
003587                                                                  432400      
003588   PERFORM 500020-BARRE-AUT-TP-D UNTIL W77-EOF = 1.               432600      
003589                                                                  432800      
003590 500020-BARRE-AUT-TP.                                             433000      
003591*========================                                         433200      
003592   READ A05-AUTORIZACIONES NEXT RECORD                            433400      
003593         AT END                                                   433600      
003594            MOVE 1 TO W77-EOF                                     433800      
003595            EXIT PERFORM.                                         434000      
003596                                                                  434200      
003597   IF R01-REG-TIP-PROC = A00-R01-TIPO-PROC                        434400      
003598      IF R01-REG-STATUS = 1                                       434600      
003599         PERFORM 400053-MUEVE-AUTORIZA-TRABAJO                    434800      
003600         PERFORM 400040-MUEVE-DATOS-ELIM-CTAMRE                   435000      
003601                  VARYING W77-IND FROM 1 BY 1                     435200      
003602                  UNTIL   W77-IND >5                              435400      
003603                  OR      A00-R01-CVETRAN (W77-IND)=0             435600      
003604         PERFORM 400030-ACTUALIZA-STATUS                          435800      
003605      ELSE                                                        436000      
003606         NEXT SENTENCE                                            436200      
003607   ELSE                                                           436400      
003608      NEXT SENTENCE.                                              436600      
003609                                                                  436800      
003610 500020-BARRE-AUT-TP-D.                                           437000      
003611*========================                                         437200      
003612   READ A05-AUTORIZACIONES NEXT RECORD                            437400      
003613         AT END                                                   437600      
003614            MOVE 1 TO W77-EOF                                     437800      
003615            EXIT PERFORM.                                         438000      
003616                                                                  438200      
003617   IF R01-REG-TIP-PROC = A00-R01-TIPO-PROC                        438400      
003618      IF R01-REG-STATUS = 1                                       438600      
003619         PERFORM 400053-MUEVE-AUT-TRABAJO-D                       438800      
003620         PERFORM 400040-MUEVE-DATOS-ELIM-D                        439000      
003621                  VARYING W77-IND-D FROM 1 BY 1                   439200      
003622                  UNTIL   W77-IND-D >5                            439400      
003623                  OR      A00-R01-CVETRAN (W77-IND-D)=0           439600      
003624                                                                  439800      
003625         PERFORM 400030-ACTUALIZA-STATUS                          440000      
003626      ELSE                                                        440200      
003627         NEXT SENTENCE                                            440400      
003628   ELSE                                                           440600      
003629      NEXT SENTENCE.                                              440800      
003630                                                                  441000      
003631 500030-ELIMINA-POR-PROCESO-AUT.                                  441200      
003632*========================                                         441400      
003633   MOVE 0 TO W77-EOF.                                             441600      
003634                                                                  441800      
003635   MOVE A00-R01-AUT-AELIM-S151  TO  R01-REG-AUTS500EXT            442000      
003636   START A05-AUTORIZACIONES KEY > KEY-AUTS151                     442200      
003637         INVALID KEY                                              442400      
003638            MOVE 1   TO W77-EOF.                                  442600      
003639                                                                  442800      
003640   PERFORM 500020-BARRE-AUT-TP UNTIL W77-EOF = 1.                 443000      
003641                                                                  443200      
003642 500030-ELIM-POR-PROCESO-AUT-D.                                   443400      
003643*========================                                         443600      
003644   MOVE 0 TO W77-EOF.                                             443800      
003645                                                                  444000      
003646   MOVE A00-R01-AUT-AELIM-S151  TO  R01-REG-AUTS500EXT            444200      
003647   START A05-AUTORIZACIONES KEY > KEY-AUTS151                     444400      
003648         INVALID KEY                                              444600      
003649            MOVE 1   TO W77-EOF.                                  444800      
003650                                                                  445000      
003651   PERFORM 500020-BARRE-AUT-TP-D UNTIL W77-EOF = 1.               445200      
003652                                                                  445400      
003653 400040-MUEVE-DATOS-CTAMRE.                                       445600      
003654*=========================                                        445800      
003655     MOVE ZEROS                       TO W77-AFC.                 446000      
003656                                                                  446200      
003657     IF A00-R01-CVETRAN(W77-IND) > 0 AND                          446400      
003658        A00-R01-CVETRAN(W77-IND) < 5001                           446600      
003659         MOVE WKS-CAT6-AFC(A00-R01-CVETRAN(W77-IND))  TO W77-AFC. 446800      
003660                                                                  447000      
003661                                                                  447200      
003662        PERFORM 400022-CARGA-DATOS-CTAMRE.                        447400      
003663                                                                  447600      
003664 400040-MUEVE-DATOS-CTAMRE-D.                                     447800      
003665*=========================                                        448000      
003666     MOVE ZEROS                       TO W77-AFC.                 448200      
003667                                                                  448400      
003668     IF A00-R01-CVETRAN(W77-IND-D) > 0 AND                        448600      
003669        A00-R01-CVETRAN(W77-IND-D) < 5001                         448800      
003670        MOVE WKS-CAT6-AFC(A00-R01-CVETRAN(W77-IND-D))  TO W77-AFC.449000      
003671                                                                  449200      
003672        PERFORM 400022-CARGA-DATOS-CTAMRE-D.                      449400      
003673                                                                  449600      
003674 400040-MUEVE-DATOS-ELIM-CTAMRE.                                  449800      
003675*===============================                                  450000      
003676     MOVE ZEROS                       TO W77-AFC.                 450200      
003677                                                                  450400      
003678     IF A00-R01-CVETRAN(W77-IND) > 0 AND                          450600      
003679        A00-R01-CVETRAN(W77-IND) < 5001                           450800      
003680           MOVE WKS-CAT6-AFC(A00-R01-CVETRAN(W77-IND)) TO W77-AFC.451000      
003681                                                                  451200      
003682     IF WKS-REG-500MONEDA = 1                                     451400      
003683        PERFORM 400022-CARGA-DATOS-CTAMRE-ELIM                    451600      
003684     ELSE                                                         451800      
003685        NEXT SENTENCE.                                            452000      
003686                                                                  452200      
003687 400040-MUEVE-DATOS-ELIM-D.                                       452400      
003688*===============================                                  452600      
003689     MOVE ZEROS                       TO W77-AFC.                 452800      
003690                                                                  453000      
003691     IF A00-R01-CVETRAN(W77-IND-D) > 0 AND                        453200      
003692        A00-R01-CVETRAN(W77-IND-D) < 5001                         453400      
003693         MOVE WKS-CAT6-AFC(A00-R01-CVETRAN(W77-IND-D)) TO W77-AFC.453600      
003694                                                                  453800      
003695     IF WKS-REG-500MONEDA = 5                                     454000      
003696        PERFORM 400022-CARGA-DATOS-ELIM-D                         454200      
003697     ELSE                                                         454400      
003698        NEXT SENTENCE.                                            454600      
003699                                                                  454800      
003700 400050-VALIDACION-ELIM-CTAMRE.                                   455000      
003701*===================================                              455200      
003702    MOVE 0                           TO W77-EXISTE-ELI-EXT.       455400      
003703    MOVE ZEROS                       TO WKS-REG-500MONEDA         455600      
003704                                        WKS-REG-STATUS.           455800      
003705                                                                  456000      
003706    PERFORM 400050-LEE-AUTORIZA.                                  456200      
003707                                                                  456400      
003708    IF W88-EXISTE-MOV-EXT                                         456600      
003709       PERFORM 400053-MUEVE-AUTORIZA-TRABAJO.                     456800      
003710                                                                  457000      
003711 400050-VALIDACION-ELIM-D.                                        457200      
003712*===================================                              457400      
003713    MOVE 0                           TO W77-EXISTE-ELI-EXT.       457600      
003714    MOVE ZEROS                       TO WKS-REG-500MONEDA         457800      
003715                                        WKS-REG-STATUS.           458000      
003716                                                                  458200      
003717    PERFORM 400050-LEE-AUTORIZA-D.                                458400      
003718                                                                  458600      
003719    IF W88-EXISTE-MOV-EXT                                         458800      
003720       PERFORM 400053-MUEVE-AUT-TRABAJO-D.                        459000      
003721                                                                  459200      
003722 400053-MUEVE-AUTORIZA-TRABAJO.                                   459400      
003723*========================                                         459600      
003724    MOVE R01-REG-500MONEDA           TO WKS-REG-500MONEDA.        459800      
003725    MOVE R01-REG-STATUS              TO WKS-REG-STATUS.           460000      
003726                                                                  460200      
003727 400053-MUEVE-AUT-TRABAJO-D.                                      460400      
003728*========================                                         460600      
003729    MOVE R01-REG-500MONEDA           TO WKS-REG-500MONEDA.        460800      
003730    MOVE R01-REG-STATUS              TO WKS-REG-STATUS.           461000      
003731                                                                  461200      
003732 400051-MUEVE-CLAVES-ORIG.                                        461400      
003733*========================                                         461600      
003734   MOVE R01-REG-CVETRAN(W77-IND)   TO WKS-REG-CVETRAN(W77-IND).   461800      
003735   MOVE R01-REG-IMPORTE(W77-IND)   TO WKS-REG-IMPORTE(W77-IND).   462000      
003736                                                                  462200      
003737 400051-MUEVE-CLAVES-ORIG-D.                                      462400      
003738*========================                                         462600      
003739   MOVE R01-REG-CVETRAN(W77-IND-D)  TO WKS-REG-CVETRAN(W77-IND-D).462800      
003740   MOVE R01-REG-IMPORTE(W77-IND-D)  TO WKS-REG-IMPORTE(W77-IND-D).463000      
003741                                                                  463200      
003742 400050-LEE-AUTORIZA.                                             463400      
003743*========================                                         463600      
003744   MOVE WKS-AUTORIZA-151-KEY          TO R01-REG-AUTS500EXT       463800      
003745   READ A05-AUTORIZACIONES                                        464000      
003746         INVALID KEY                                              464200      
003747           MOVE 0 TO W77-EXISTE-ELI-EXT                           464400      
003748           EXIT PERFORM.                                          464600      
003749                                                                  464800      
003750   MOVE 1 TO W77-EXISTE-ELI-EXT.                                  465000      
003751                                                                  465200      
003752 400050-LEE-AUTORIZA-D.                                           465400      
003753*========================                                         465600      
003754   MOVE WKS-AUTORIZA-151-KEY          TO R01-REG-AUTS500EXT       465800      
003755   READ A05-AUTORIZACIONES                                        466000      
003756         INVALID KEY                                              466200      
003757           MOVE 0 TO W77-EXISTE-ELI-EXT                           466400      
003758           EXIT PERFORM.                                          466600      
003759                                                                  466800      
003760   MOVE 1 TO W77-EXISTE-ELI-EXT.                                  467000      
003761                                                                  467200      
003762 400021-LIMPIA-TRAILER.                                           467400      
003763*=========================                                        467600      
003764    MOVE ZEROS                       TO 500-R03-TOTMOV            467800      
003765                                        500-R03-NUMABO            468000      
003766                                        500-R03-TOTABO            468200      
003767                                        500-R03-NUMCAR            468400      
003768                                        500-R03-TOTCAR            468600      
003769                                                                  468800      
003770                                        WKS-NUM-TOTAL-MOV-PES     469000      
003771                                        WKS-NUM-ABON-PES          469200      
003772                                        WKS-NUM-TOTAL-ABON-PES    469400      
003773                                        WKS-NUM-CARG-PES          469600      
003774                                        WKS-NUM-TOTAL-CARG-PES    469800      
003775                                                                  470000      
003776                                        500-R03-TOTMOV-ELIM       470200      
003777                                        500-R03-NUMABO-ELIM       470400      
003778                                        500-R03-TOTABO-ELIM       470600      
003779                                        500-R03-NUMCAR-ELIM       470800      
003780                                        500-R03-TOTCAR-ELIM       471000      
003781                                                                  471200      
003782                                     WKS-NUM-TOTAL-MOV-ELIM-PES   471400      
003783                                     WKS-NUM-ABON-ELIM-PES        471600      
003784                                     WKS-NUM-TOTAL-ABON-ELIM-PES  471800      
003785                                     WKS-NUM-CARG-ELIM-PES        472000      
003786                                     WKS-NUM-TOTAL-CARG-ELIM-PES. 472200      
003787                                                                  472400      
003788 400021-LIMPIA-TRAILER-D.                                         472600      
003789*=========================                                        472800      
003790    MOVE ZEROS                       TO 500-R03-TOTMOV            473000      
003791                                        500-R03-NUMABO            473200      
003792                                        500-R03-TOTABO            473400      
003793                                        500-R03-NUMCAR            473600      
003794                                        500-R03-TOTCAR            473800      
003795                                                                  474000      
003796                                        WKS-NUM-TOTAL-MOV-DOL     474200      
003797                                        WKS-NUM-ABON-DOL          474400      
003798                                        WKS-NUM-TOTAL-ABON-DOL    474600      
003799                                        WKS-NUM-CARG-DOL          474800      
003800                                        WKS-NUM-TOTAL-CARG-DOL    475000      
003801                                                                  475200      
003802                                        500-R03-TOTMOV-ELIM       475400      
003803                                        500-R03-NUMABO-ELIM       475600      
003804                                        500-R03-TOTABO-ELIM       475800      
003805                                        500-R03-NUMCAR-ELIM       476000      
003806                                        500-R03-TOTCAR-ELIM       476200      
003807                                                                  476400      
003808                                     WKS-NUM-TOTAL-MOV-ELIM-DOL   476600      
003809                                     WKS-NUM-ABON-ELIM-DOL        476800      
003810                                     WKS-NUM-TOTAL-ABON-ELIM-DOL  477000      
003811                                     WKS-NUM-CARG-ELIM-DOL        477200      
003812                                     WKS-NUM-TOTAL-CARG-ELIM-DOL. 477400      
003813                                                                  477600      
003814 400021-LIMPIA-VARIABLES.                                         477800      
003815*=========================                                        478000      
003816    MOVE ZEROS                       TO 500-R02-NUMAUTORIZAS      478200      
003817                                        500-R02-SUCPRECU          478400      
003818                                        500-R02-NUMCUEMDA         478600      
003819                                        500-R02-NATUCON           478800      
003820                                        500-R02-REFNUM            479000      
003821                                        500-R02-IMPORTRAN         479200      
003822                                        500-R02-SUCTRANS          479400      
003823                                        500-R02-NUMCAJTRA         479600      
003824                                        500-R02-HORAMOV           479800      
003825                                        500-R02-FECMOV            480000      
003826                                        500-R02-NUMAUT151         480200      
003827                                        500-R02-MONEDA            480400      
003828    MOVE SPACES                      TO 500-R02-DESC.             480600      
003829                                                                  480800      
003830 400023-GENERA-MOV-AUTORIZA.                                      481000      
003831*========================                                         481200      
003832    PERFORM 400024-LIMPIA-CAMPOS-AUT.                             481400      
003833                                                                  481600      
003834    MOVE A00-R01-AUT-S151         TO R01-REG-AUTS500EXT.          481800      
003835    MOVE A00-R01-AUT-AELIM-S151   TO R01-REG-AUTAELIM.            482000      
003836    MOVE A00-R01-AUT-ANT-S151     TO R01-REG-AUTANTS151.          482200      
003837    MOVE A00-R01-TIPO-PROC        TO R01-REG-TIP-PROC.            482400      
003838                                                                  482600      
003839    PERFORM 400025-LLENA-CLAVES VARYING W77-IND FROM 1 BY 1       482800      
003840                                UNTIL W77-IND > 5                 483000      
003841                                OR A00-R01-CVETRAN (W77-IND)=0.   483200      
003842                                                                  483400      
003843    MOVE A00-R01-MDA-SUC          TO R01-REG-500SUCPRECU.         483600      
003844    MOVE A00-R01-MDA-CTA          TO R01-REG-500NUMCUEMDA.        483800      
003845                                                                  484000      
003846    MOVE A00-R01-MONEDA           TO R01-REG-500MONEDA.           484200      
003847    MOVE A00-R01-REFNUM           TO R01-REG-500REFNUM.           484400      
003848                                                                  484600      
003849    MOVE A00-R01-AUTORIZA         TO R01-REG-500NUMAUTORIZAS.     484800      
003850    MOVE A00-R01-SUCTRAN          TO R01-REG-500SUCTRAS.          485000      
003851    MOVE A00-R01-CAJATRAN         TO R01-REG-500NUMCAJTRA.        485200      
003852                                                                  485400      
003853    MOVE A00-R01-HORMOV           TO WKS-HORA-MOVTO.              485600      
003854                                                                  485800      
003855    MOVE WKS-HH-MOVTO             TO WKS-HM-HH-MOVTO.             486000      
003856    MOVE WKS-MM-MOVTO             TO WKS-HM-MM-MOVTO.             486200      
003857    MOVE WKS-HM-MOVTO-4D          TO R01-REG-HORMOV.              486400      
003858                                                                  486600      
003859    MOVE A00-R01-FECMOV           TO R01-REG-FECMOV.              486800      
003860    MOVE 1                        TO R01-REG-STATUS.              487000      
003861    WRITE R01-REG-AUTORIZA.                                       487200      
003862                                                                  487400      
003863 400023-GENERA-MOV-AUTORIZA-D.                                    487600      
003864*========================                                         487800      
003865    PERFORM 400024-LIMPIA-CAMPOS-AUT-D.                           488000      
003866                                                                  488200      
003867    MOVE A00-R01-AUT-S151         TO R01-REG-AUTS500EXT.          488400      
003868    MOVE A00-R01-AUT-AELIM-S151   TO R01-REG-AUTAELIM.            488600      
003869    MOVE A00-R01-AUT-ANT-S151     TO R01-REG-AUTANTS151.          488800      
003870    MOVE A00-R01-TIPO-PROC        TO R01-REG-TIP-PROC.            489000      
003871                                                                  489200      
003872    PERFORM 400025-LLENA-CLAVES-D VARYING W77-IND-D FROM 1 BY 1   489400      
003873                                UNTIL W77-IND-D > 5               489600      
003874                                OR A00-R01-CVETRAN (W77-IND-D)=0. 489800      
003875                                                                  490000      
003876    MOVE A00-R01-MDA-SUC          TO R01-REG-500SUCPRECU.         490200      
003877    MOVE A00-R01-MDA-CTA          TO R01-REG-500NUMCUEMDA.        490400      
003878                                                                  490600      
003879    MOVE A00-R01-MONEDA           TO R01-REG-500MONEDA.           490800      
003880    MOVE A00-R01-REFNUM           TO R01-REG-500REFNUM.           491000      
003881                                                                  491200      
003882    MOVE A00-R01-AUTORIZA         TO R01-REG-500NUMAUTORIZAS.     491400      
003883    MOVE A00-R01-SUCTRAN          TO R01-REG-500SUCTRAS.          491600      
003884    MOVE A00-R01-CAJATRAN         TO R01-REG-500NUMCAJTRA.        491800      
003885                                                                  492000      
003886    MOVE A00-R01-HORMOV           TO WKS-HORA-MOVTO.              492200      
003887                                                                  492400      
003888    MOVE WKS-HH-MOVTO             TO WKS-HM-HH-MOVTO.             492600      
003889    MOVE WKS-MM-MOVTO             TO WKS-HM-MM-MOVTO.             492800      
003890    MOVE WKS-HM-MOVTO-4D          TO R01-REG-HORMOV.              493000      
003891                                                                  493200      
003892    MOVE A00-R01-FECMOV           TO R01-REG-FECMOV.              493400      
003893    MOVE 1                        TO R01-REG-STATUS.              493600      
003894    WRITE R01-REG-AUTORIZA.                                       493800      
003895                                                                  494000      
003896 400025-LLENA-CLAVES.                                             494200      
003897*========================                                         494400      
003898    MOVE A00-R01-CVETRAN(W77-IND)TO R01-REG-CVETRAN(W77-IND).     494600      
003899    MOVE A00-R01-IMPORTE(W77-IND)TO R01-REG-IMPORTE(W77-IND).     494800      
003900                                                                  495000      
003901 400025-LLENA-CLAVES-D.                                           495200      
003902*========================                                         495400      
003903   MOVE A00-R01-CVETRAN(W77-IND-D)TO R01-REG-CVETRAN(W77-IND-D).  495600      
003904   MOVE A00-R01-IMPORTE(W77-IND-D)TO R01-REG-IMPORTE(W77-IND-D).  495800      
003905                                                                  496000      
003906 400024-LIMPIA-CAMPOS-AUT.                                        496200      
003907*========================                                         496400      
003908   MOVE ZEROES                   TO R01-REG-AUTS500EXT            496600      
003909                                    R01-REG-AUTAELIM              496800      
003910                                    R01-REG-AUTANTS151            497000      
003911                                    R01-REG-TIP-PROC              497200      
003912                                    R01-REG-CVETRAN(1)            497400      
003913                                    R01-REG-IMPORTE(1)            497600      
003914                                    R01-REG-CVETRAN(2)            497800      
003915                                    R01-REG-IMPORTE(2)            498000      
003916                                    R01-REG-CVETRAN(3)            498200      
003917                                    R01-REG-IMPORTE(3)            498400      
003918                                    R01-REG-CVETRAN(4)            498600      
003919                                    R01-REG-IMPORTE(4)            498800      
003920                                    R01-REG-CVETRAN(5)            499000      
003921                                    R01-REG-IMPORTE(5)            499200      
003922                                    R01-REG-500SUCPRECU           499400      
003923                                    R01-REG-500NUMCUEMDA          499600      
003924                                    R01-REG-500REFNUM             499800      
003925                                    R01-REG-500NUMAUTORIZAS       500000      
003926                                    R01-REG-500SUCTRAS            500200      
003927                                    R01-REG-500NUMCAJTRA          500400      
003928                                    R01-REG-HORMOV                500600      
003929                                    R01-REG-FECMOV                500800      
003930                                    R01-REG-STATUS.               501000      
003931                                                                  501200      
003932 400024-LIMPIA-CAMPOS-AUT-D.                                      501400      
003933*========================                                         501600      
003934   MOVE ZEROES                   TO R01-REG-AUTS500EXT            501800      
003935                                    R01-REG-AUTAELIM              502000      
003936                                    R01-REG-AUTANTS151            502200      
003937                                    R01-REG-TIP-PROC              502400      
003938                                    R01-REG-CVETRAN(1)            502600      
003939                                    R01-REG-IMPORTE(1)            502800      
003940                                    R01-REG-CVETRAN(2)            503000      
003941                                    R01-REG-IMPORTE(2)            503200      
003942                                    R01-REG-CVETRAN(3)            503400      
003943                                    R01-REG-IMPORTE(3)            503600      
003944                                    R01-REG-CVETRAN(4)            503800      
003945                                    R01-REG-IMPORTE(4)            504000      
003946                                    R01-REG-CVETRAN(5)            504200      
003947                                    R01-REG-IMPORTE(5)            504400      
003948                                    R01-REG-500SUCPRECU           504600      
003949                                    R01-REG-500NUMCUEMDA          504800      
003950                                    R01-REG-500REFNUM             505000      
003951                                    R01-REG-500NUMAUTORIZAS       505200      
003952                                    R01-REG-500SUCTRAS            505400      
003953                                    R01-REG-500NUMCAJTRA          505600      
003954                                    R01-REG-HORMOV                505800      
003955                                    R01-REG-FECMOV                506000      
003956                                    R01-REG-STATUS.               506200      
003957                                                                  506400      
003958 400022-CARGA-DATOS-CTAMRE.                                       506600      
003959*========================                                         506800      
003960    PERFORM 400021-LIMPIA-VARIABLES.                              507000      
003961    ADD 1                         TO W77-SEC-DET.                 507200      
003962    MOVE A00-R01-AUTORIZA         TO 500-R02-NUMAUTORIZAS.        507400      
003963    MOVE A00-R01-MDA-SUC          TO 500-R02-SUCPRECU.            507600      
003964    MOVE A00-R01-MDA-CTA          TO 500-R02-NUMCUEMDA.           507800      
003965    MOVE A00-R01-REFNUM           TO 500-R02-REFNUM.              508000      
003966    MOVE W77-AFC                  TO 500-R02-NATUCON.             508200      
003967    MOVE A00-R01-IMPORTE(W77-IND) TO 500-R02-IMPORTRAN.           508400      
003968    MOVE A00-R01-SUCTRAN          TO 500-R02-SUCTRANS.            508600      
003969    MOVE A00-R01-CAJATRAN         TO 500-R02-NUMCAJTRA.           508800      
003970                                                                  509000      
003971    MOVE A00-R01-HORMOV           TO WKS-HORA-MOVTO.              509200      
003972                                                                  509400      
003973    MOVE WKS-HH-MOVTO             TO WKS-HM-HH-MOVTO.             509600      
003974    MOVE WKS-MM-MOVTO             TO WKS-HM-MM-MOVTO.             509800      
003975    MOVE WKS-HM-MOVTO-4D          TO 500-R02-HORAMOV.             510000      
003976                                                                  510200      
003977    MOVE A00-R01-FECMOV           TO 500-R02-FECMOV.              510400      
003978    MOVE A00-R01-AUT-S151         TO 500-R02-NUMAUT151.           510600      
003979    MOVE A00-R01-MONEDA           TO 500-R02-MONEDA.              510800      
003980    ADD 1                         TO WKS-NUM-TOTAL-MOV-PES.       511000      
003981    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS = 1 AND W77-AFC = 1 511200      
003982       MOVE "MOVIMIENTO APLICADO DE CARGO" TO 500-R02-DESC        511400      
003983    ELSE                                                          511600      
003984    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS = 1 AND W77-AFC = 2 511800      
003985       MOVE "MOVIMIENTO APLICADO DE ABONO" TO 500-R02-DESC        512000      
003986    ELSE                                                          512200      
003987    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS = 1 AND W77-AFC = 9 512400      
003988       MOVE "MOVIMIENTO APLICADO NO CONTA" TO 500-R02-DESC        512600      
003989    ELSE                                                          512800      
003990    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS > 1 AND W77-AFC = 1 513000      
003991      MOVE "MOVIMIENTO ELIMINADO DE CARGO" TO 500-R02-DESC        513200      
003992    ELSE                                                          513400      
003993    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS > 1 AND W77-AFC = 2 513600      
003994       MOVE "MOVIMIENTO ELIMINADO DE ABONO" TO 500-R02-DESC       513800      
003995    ELSE                                                          514000      
003996    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS > 1 AND W77-AFC = 9 514200      
003997       MOVE "MOVIMIENTO ELIMINADO NO CONTA" TO 500-R02-DESC.      514400      
003998                                                                  514600      
003999    IF A00-R01-MONEDA = 1                                         514800      
004000       PERFORM 040040-ACUMULA-TOTALES                             515000      
004001       WRITE A04-REG-CTAMRE   FROM 500-R02-DET.                   515200      
004002                                                                  515400      
004003 400022-CARGA-DATOS-CTAMRE-D.                                     515600      
004004*========================                                         515800      
004005    PERFORM 400021-LIMPIA-VARIABLES.                              516000      
004006    ADD 1                         TO W77-SEC-DET-DOL.             516200      
004007    MOVE A00-R01-AUTORIZA         TO 500-R02-NUMAUTORIZAS.        516400      
004008    MOVE A00-R01-MDA-SUC          TO 500-R02-SUCPRECU.            516600      
004009    MOVE A00-R01-MDA-CTA          TO 500-R02-NUMCUEMDA.           516800      
004010    MOVE A00-R01-REFNUM           TO 500-R02-REFNUM.              517000      
004011    MOVE W77-AFC                  TO 500-R02-NATUCON.             517200      
004012    MOVE A00-R01-IMPORTE(W77-IND-D) TO 500-R02-IMPORTRAN.         517400      
004013    MOVE A00-R01-SUCTRAN          TO 500-R02-SUCTRANS.            517600      
004014    MOVE A00-R01-CAJATRAN         TO 500-R02-NUMCAJTRA.           517800      
004015                                                                  518000      
004016    MOVE A00-R01-HORMOV           TO WKS-HORA-MOVTO.              518200      
004017                                                                  518400      
004018    MOVE WKS-HH-MOVTO             TO WKS-HM-HH-MOVTO.             518600      
004019    MOVE WKS-MM-MOVTO             TO WKS-HM-MM-MOVTO.             518800      
004020    MOVE WKS-HM-MOVTO-4D          TO 500-R02-HORAMOV.             519000      
004021                                                                  519200      
004022    MOVE A00-R01-FECMOV           TO 500-R02-FECMOV.              519400      
004023    MOVE A00-R01-AUT-S151         TO 500-R02-NUMAUT151.           519600      
004024    MOVE A00-R01-MONEDA           TO 500-R02-MONEDA.              519800      
004025    ADD 1                         TO WKS-NUM-TOTAL-MOV-DOL.       520000      
004026                                                                  520200      
004027    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS = 1 AND W77-AFC = 1 520400      
004028       MOVE "MOVIMIENTO APLICADO DE CARGO" TO 500-R02-DESC        520600      
004029    ELSE                                                          520800      
004030    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS = 1 AND W77-AFC = 2 521000      
004031       MOVE "MOVIMIENTO APLICADO DE ABONO" TO 500-R02-DESC        521200      
004032    ELSE                                                          521400      
004033    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS = 1 AND W77-AFC = 9 521600      
004034       MOVE "MOVIMIENTO APLICADO NO CONTA" TO 500-R02-DESC        521800      
004035    ELSE                                                          522000      
004036    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS > 1 AND W77-AFC = 1 522200      
004037      MOVE "MOVIMIENTO ELIMINADO DE CARGO"                        522400      
004038                                          TO 500-R02-DESC         522600      
004039    ELSE                                                          522800      
004040    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS > 1 AND W77-AFC = 2 523000      
004041       MOVE "MOVIMIENTO ELIMINADO DE ABONO"                       523200      
004042                                           TO 500-R02-DESC        523400      
004043    ELSE                                                          523600      
004044    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS > 1 AND W77-AFC = 9 523800      
004045       MOVE "MOVIMIENTO ELIMINADO NO CONTA"                       524000      
004046                                          TO 500-R02-DESC.        524200      
004047                                                                  524400      
004048    IF A00-R01-MONEDA = 5                                         524600      
004049       PERFORM 040040-ACUMULA-TOTALES-DOLAR                       524800      
004050       WRITE A04-REG-CTAMRE-D FROM 500-R02-DET.                   525000      
004051                                                                  525200      
004052 400022-CARGA-DATOS-CTAMRE-ELIM.                                  525400      
004053*========================                                         525600      
004054 PERFORM 400021-LIMPIA-VARIABLES.                                 525800      
004055                                                                  526000      
004056    ADD 1                         TO W77-SEC-DET.                 526200      
004057    MOVE A00-R01-AUTORIZA         TO 500-R02-NUMAUTORIZAS.        526400      
004058    MOVE A00-R01-MDA-SUC          TO 500-R02-SUCPRECU.            526600      
004059    MOVE A00-R01-MDA-CTA          TO 500-R02-NUMCUEMDA.           526800      
004060    MOVE A00-R01-REFNUM           TO 500-R02-REFNUM.              527000      
004061    MOVE W77-AFC                  TO 500-R02-NATUCON.             527200      
004062    MOVE A00-R01-IMPORTE(W77-IND) TO 500-R02-IMPORTRAN.           527400      
004063    MOVE A00-R01-SUCTRAN          TO 500-R02-SUCTRANS.            527600      
004064    MOVE A00-R01-CAJATRAN         TO 500-R02-NUMCAJTRA.           527800      
004065                                                                  528000      
004066    MOVE A00-R01-HORMOV           TO WKS-HORA-MOVTO.              528200      
004067                                                                  528400      
004068    MOVE WKS-HH-MOVTO             TO WKS-HM-HH-MOVTO.             528600      
004069    MOVE WKS-MM-MOVTO             TO WKS-HM-MM-MOVTO.             528800      
004070    MOVE WKS-HM-MOVTO-4D          TO 500-R02-HORAMOV.             529000      
004071                                                                  529200      
004072    MOVE A00-R01-FECMOV           TO 500-R02-FECMOV.              529400      
004073    MOVE A00-R01-AUT-S151         TO 500-R02-NUMAUT151.           529600      
004074    MOVE WKS-REG-500MONEDA        TO 500-R02-MONEDA.              529800      
004075                                                                  530000      
004076    IF (A00-R01-FUNCION = 2 OR 21 OR 22) AND W77-AFC = 1          530200      
004077       MOVE "MOVIMIENTO ELIMINADO DE CARGO" TO 500-R02-DESC       530400      
004078    ELSE                                                          530600      
004079    IF (A00-R01-FUNCION = 2 OR 21 OR 22) AND W77-AFC = 2          530800      
004080       MOVE "MOVIMIENTO ELIMINADO DE ABONO" TO 500-R02-DESC       531000      
004081    ELSE                                                          531200      
004082    IF (A00-R01-FUNCION = 2 OR 21 OR 22) AND W77-AFC = 9          531400      
004083       MOVE "MOVIMIENTO ELIMINADO NO CONTA" TO 500-R02-DESC.      531600      
004084                                                                  531800      
004085    IF WKS-REG-500MONEDA  = 1                                     532000      
004086       PERFORM 040040-ACUM-TOT-ELIM                               532200      
004087       WRITE A04-REG-CTAMRE   FROM 500-R02-DET.                   532400      
004088                                                                  532600      
004089 400022-CARGA-DATOS-ELIM-D.                                       532800      
004090*========================                                         533000      
004091 PERFORM 400021-LIMPIA-VARIABLES.                                 533200      
004092                                                                  533400      
004093    ADD 1                           TO W77-SEC-DET.               533600      
004094    MOVE A00-R01-AUTORIZA           TO 500-R02-NUMAUTORIZAS.      533800      
004095    MOVE A00-R01-MDA-SUC            TO 500-R02-SUCPRECU.          534000      
004096    MOVE A00-R01-MDA-CTA            TO 500-R02-NUMCUEMDA.         534200      
004097    MOVE A00-R01-REFNUM             TO 500-R02-REFNUM.            534400      
004098    MOVE W77-AFC                    TO 500-R02-NATUCON.           534600      
004099    MOVE A00-R01-IMPORTE(W77-IND-D) TO 500-R02-IMPORTRAN.         534800      
004100    MOVE A00-R01-SUCTRAN            TO 500-R02-SUCTRANS.          535000      
004101    MOVE A00-R01-CAJATRAN           TO 500-R02-NUMCAJTRA.         535200      
004102                                                                  535400      
004103    MOVE A00-R01-HORMOV           TO WKS-HORA-MOVTO.              535600      
004104                                                                  535800      
004105    MOVE WKS-HH-MOVTO             TO WKS-HM-HH-MOVTO.             536000      
004106    MOVE WKS-MM-MOVTO             TO WKS-HM-MM-MOVTO.             536200      
004107    MOVE WKS-HM-MOVTO-4D          TO 500-R02-HORAMOV.             536400      
004108                                                                  536600      
004109    MOVE A00-R01-FECMOV             TO 500-R02-FECMOV.            536800      
004110    MOVE A00-R01-AUT-S151           TO 500-R02-NUMAUT151.         537000      
004111    MOVE WKS-REG-500MONEDA          TO 500-R02-MONEDA.            537200      
004112                                                                  537400      
004113    IF (A00-R01-FUNCION = 2 OR 21 OR 22) AND W77-AFC = 1          537600      
004114       MOVE "MOVIMIENTO ELIMINADO DE CARGO" TO 500-R02-DESC       537800      
004115    ELSE                                                          538000      
004116    IF (A00-R01-FUNCION = 2 OR 21 OR 22) AND W77-AFC = 2          538200      
004117       MOVE "MOVIMIENTO ELIMINADO DE ABONO" TO 500-R02-DESC       538400      
004118    ELSE                                                          538600      
004119    IF (A00-R01-FUNCION = 2 OR 21 OR 22) AND W77-AFC = 9          538800      
004120       MOVE "MOVIMIENTO ELIMINADO NO CONTA" TO 500-R02-DESC.      539000      
004121                                                                  539200      
004122    IF WKS-REG-500MONEDA = 5                                      539400      
004123       PERFORM 040040-ACUM-TOT-DOLAR-ELIM                         539600      
004124       WRITE A04-REG-CTAMRE-D FROM 500-R02-DET.                   539800      
004125                                                                  540000      
004126 030376-LEE-DATOS-ADIC.                                           540200      
004127*======================                                           540400      
004128     IF A00-R01-APUDES > 0                                        540600      
004129        COMPUTE W77-LLAVE = A00-R01-APUDES + 1                    540800      
004130        READ A02-DESS500 INTO A01-R01-DATOS                       541000      
004131             INVALID KEY                                          541200      
004132               MOVE 1      TO W77-LEE                             541400      
004133               MOVE A00-R01-APUDES TO W77-MOV-NIVDES              541600      
004134               MOVE "I"    TO TIPO-LJ                             541800      
004135               MOVE 020101 TO CODIGO-LJ                           542000      
004136               STRING "ERROR EN LECTURA DATOS ADICIONALES ",      542200      
004137                       W77-LLAVE, " ** ", W77-MOV-NIVDES          542400      
004138               DELIMITED BY SIZE INTO TEXTO-LJ                    542600      
004139               CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ542800      
004140               MOVE LOW-VALUES TO A01-R01-DATOS.                  543000      
004141     IF W77-LEE = 1                                               543200      
004142     ADD 1                       TO W77-VECES                     543400      
004143        CLOSE A02-DESS500 WITH RELEASE                            543600      
004144        WAIT(5)                                                   543800      
004145        OPEN INPUT A02-DESS500                                    544000      
004146        MOVE 0 TO W77-LEE                                         544200      
004147     ELSE                                                         544400      
004148        MOVE 3 TO W77-VECES.                                      544600      
004149                                                                  544800      
004150                                                                  545000      
004151 030376-LEE-DATOS-ADIC2.                                          545200      
004152*=======================                                          545400      
004153      COMPUTE W77-LLAVE = A01-R01-APUDES + 1                      545600      
004154      READ A02-DESS500 INTO A01-R02-TESOFE                        545800      
004155           INVALID KEY                                            546000      
004156               MOVE 1      TO W77-LEE                             546200      
004157               MOVE A00-R01-APUDES TO W77-MOV-NIVDES              546400      
004158               MOVE "I"    TO TIPO-LJ                             546600      
004159               MOVE 020101 TO CODIGO-LJ                           546800      
004160               STRING "ERROR EN LECTURA DATOS ADICIONALES ",      547000      
004161                       W77-LLAVE, " ** ", W77-MOV-NIVDES          547200      
004162               DELIMITED BY SIZE INTO TEXTO-LJ                    547400      
004163               CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ547600      
004164               MOVE LOW-VALUES TO A01-R02-TESOFE.                 547800      
004165                                                                  548000      
004166     IF W77-LEE = 1                                               548200      
004167     ADD 1                       TO W77-VECES                     548400      
004168        CLOSE A02-DESS500 WITH RELEASE                            548600      
004169        WAIT(5)                                                   548900      
004170        OPEN INPUT A02-DESS500                                    549000      
004171        MOVE 0 TO W77-LEE                                         549200      
004172     ELSE                                                         549400      
004173        MOVE 3 TO W77-VECES.                                      549600      
004174                                                                  549800      
004175                                                                  550000      
004176 040040-ACUMULA-TOTALES.                                          550200      
004177*=======================                                          550400      
004178       IF W77-AFC = 1                                             550600      
004179          ADD 1                     TO WKS-NUM-CARG-PES           550800      
004180          ADD A00-R01-IMPORTE(W77-IND)   TO WKS-NUM-TOTAL-CARG-PES551000      
004181       ELSE                                                       551200      
004182       IF W77-AFC = 2                                             551400      
004183          ADD 1                     TO WKS-NUM-ABON-PES           551600      
004184          ADD A00-R01-IMPORTE(W77-IND)   TO WKS-NUM-TOTAL-ABON-PES551800      
004185       ELSE                                                       552000      
004186       IF W77-AFC = 9                                             552200      
004187          ADD 1                     TO WKS-NUM-NO-CONT-PES.       552400      
004188                                                                  552600      
004189 040040-ACUMULA-TOTALES-DOLAR.                                    552800      
004190*=======================                                          553000      
004191       IF W77-AFC = 1                                             553200      
004192        ADD 1                       TO WKS-NUM-CARG-DOL           553400      
004193        ADD A00-R01-IMPORTE(W77-IND-D) TO WKS-NUM-TOTAL-CARG-DOL  553600      
004194       ELSE                                                       553800      
004195       IF W77-AFC = 2                                             554000      
004196        ADD 1                       TO WKS-NUM-ABON-DOL           554200      
004197        ADD A00-R01-IMPORTE(W77-IND-D) TO WKS-NUM-TOTAL-ABON-DOL  554400      
004198       ELSE                                                       554600      
004199       IF W77-AFC = 9                                             554800      
004200        ADD 1                       TO WKS-NUM-NO-CONT-DOL.       555000      
004201                                                                  555200      
004202 040040-ACUM-TOT-ELIM.                                            555400      
004203*=======================                                          555600      
004204       ADD 1                        TO WKS-NUM-TOTAL-MOV-ELIM-PES.555800      
004205                                                                  556000      
004206       IF W77-AFC = 1                                             556200      
004207          ADD 1                     TO WKS-NUM-CARG-ELIM-PES      556400      
004208          ADD A00-R01-IMPORTE(W77-IND)                            556600      
004209                                    TO WKS-NUM-TOTAL-CARG-ELIM-PES556800      
004210       ELSE                                                       557000      
004211       IF W77-AFC = 2                                             557200      
004212          ADD 1                     TO WKS-NUM-ABON-ELIM-PES      557400      
004213          ADD A00-R01-IMPORTE(W77-IND)                            557600      
004214                                    TO WKS-NUM-TOTAL-ABON-ELIM-PES557800      
004215       ELSE                                                       558000      
004216       IF W77-AFC = 9                                             558200      
004217          ADD 1                     TO WKS-NUM-NO-CONT-ELIM-PES.  558400      
004218                                                                  558600      
004219 040040-ACUM-TOT-DOLAR-ELIM.                                      558800      
004220*=======================                                          559000      
004221      ADD 1                         TO WKS-NUM-TOTAL-MOV-ELIM-DOL.559200      
004222                                                                  559400      
004223       IF W77-AFC = 1                                             559600      
004224          ADD 1                     TO WKS-NUM-CARG-ELIM-DOL      559800      
004225          ADD A00-R01-IMPORTE(W77-IND-D)                          560000      
004226                                    TO WKS-NUM-TOTAL-CARG-ELIM-DOL560200      
004227       ELSE                                                       560400      
004228       IF W77-AFC = 2                                             560600      
004229          ADD 1                     TO WKS-NUM-ABON-ELIM-DOL      560800      
004230          ADD A00-R01-IMPORTE(W77-IND-D)                          561000      
004231                                    TO WKS-NUM-TOTAL-ABON-ELIM-DOL561200      
004232       ELSE                                                       561400      
004233       IF W77-AFC = 9                                             561600      
004234          ADD 1                     TO WKS-NUM-NO-CONT-ELIM-DOL.  561800      
004235                                                                  562000      
