000001$SET LIST LINEINFO MAP XREF                                       000100      
000002$SET OPTIMIZE                                                     000200      
000003$SET LISTOMITTED                                                  000300      
000004*$SET TADS                                                        000400      
000005 IDENTIFICATION DIVISION.                                         000500      
000006 PROGRAM-ID. DGODOMI.                                             000600      
000007 AUTHOR. CHRISTIAN D DUENAS BARRIENTOS.                           000700      
000008******************************************************************000701      
000009**JNRB 251014 SE MODIFICA EN ATENCION AL INC0013018473           *000702      
000010**PARA VALIDAR FECHA SA2 Y FECHA CONTABLE P013 PARA ACTIVAR EL   *000703      
000011**SERVICIO DE ENVIO DE INFORMACION AL S702                       *000704      
000012*                                                                *000705      
000013*                                                                *000706      
000014*                                                                *000707      
000015*                                                                *000708      
000016*                                                                *000709      
000017*                                                                *000710      
000018*                                                                *000711      
000019*                                                                *000712      
000020*                                                                *000713      
000021*                                                                *000714      
000022******************************************************************000715      
000023                                                                  000800      
000024 ENVIRONMENT DIVISION.                                            000900      
000025 INPUT-OUTPUT SECTION.                                            001000      
000026 FILE-CONTROL.                                                    001100      
000027                                                                  001200      
000028     SELECT A01-MOVS500   ASSIGN       TO DISK                    001300      
000029                          ORGANIZATION IS SEQUENTIAL              001400      
000030                          ACCESS MODE  IS SEQUENTIAL              001500      
000031                          ACTUAL KEY   IS W77-NUMREG-MOV500.      001600      
000032                                                                  001700      
000033                                                                  001800      
000034     SELECT A02-CTL-DM ASSIGN       TO DISK                       001900      
000035                          ACCESS MODE  IS SEQUENTIAL              002000      
000036                          ACTUAL KEY   IS W77-NUMREG-CTL.         002100      
000037                                                                  002200      
000038     SELECT L01-DISPLAY ASSIGN TO DISK.                           002300      
000039                                                                  002400      
000040     SELECT L02-MONITOR ASSIGN TO DISK.                           002500      
000041                                                                  002600      
000042 DATA        DIVISION.                                            002700      
000043 FILE SECTION.                                                    002800      
000044                                                                  002900      
000045 FD A01-MOVS500                                                   003000      
000046*==============                                                   003100      
000047    VALUE OF TITLE            IS WKS-TITLE-MOVS500                003200      
000048    VALUE OF BUFFERS IS 1                                         003300      
000049    BLOCK  CONTAINS 144 RECORDS.                                  003400      
000050                                                                  003500      
000051    01 A01-R01-S500           PIC X(450).                         003600      
000052                                                                  003700      
000053                                                                  003800      
000054 FD A02-CTL-DM                                                    003900      
000055    VALUE OF PROTECTION IS PROTECTED,                             004000      
000056    VALUE OF TITLE            IS WKS-TITLE-CTLENV.                004100      
000057                                                                  004200      
000058 01 R01-REG-ENVIO.                                                004300      
000059    03 R01-REG-AUTS500        PIC 9(08).                          004400      
000060    03 R01-REG-SER            PIC 9(01).                          004500      
000061    03 R01-REG-BAN-HR         PIC 9(01).                          004501      
000062    03 FILLER                 PIC X(30).                          004600      
000063                                                                  004700      
000064                                                                  004800      
000065  FD L01-DISPLAY VALUE OF PROTECTION    IS PROTECTED,             004900      
000066                 VALUE OF SECURITYTYPE  IS PUBLIC   ,             005000      
000067                          BLOCK CONTAINS 100 RECORDS,             005100      
000068                 VALUE TITLE IS WKS-TITLE-DISPLAY.                005200      
000069  01 REG-DISPLAY                   PIC X(180).                    005300      
000070                                                                  005400      
000071  FD L02-MONITOR VALUE OF PROTECTION    IS PROTECTED,             005500      
000072                 VALUE OF SECURITYTYPE  IS PUBLIC   ,             005600      
000073                 VALUE TITLE IS WKS-TITLE-MONITOR.                005700      
000074  01 REG-MONITOR.                                                 005800      
000075     05 WKS-SENTIDO-MSG            PIC X(30).                     005900      
000076     05 WKS-ESPACIO1               PIC X(01).                     006000      
000077     05 WKS-FEC-MON                PIC 9(06).                     006100      
000078     05 WKS-HRS-MON                PIC 9(08).                     006200      
000079     05 WKS-ESPACIO2               PIC X(01).                     006300      
000080     05 WKS-LLAVE-MSG              PIC X(10).                     006400      
000081     05 WKS-ESPACIO3               PIC X(01).                     006500      
000082     05 WKS-DATOS-MSJ              PIC X(1000).                   006600      
000083                                                                  006700      
000084 DATA-BASE SECTION .                                              006800      
000085  DB S151BD13BIFIN.                                               006900      
000086                                                                  007000      
000087 WORKING-STORAGE SECTION.                                         007100      
000088                                                                  007200      
000089******************************************************************007300      
000090*         NOMBRE DEL ARCHIVO DE MOVIMIENTOS NVO S151             *007400      
000091******************************************************************007500      
000092*INICIO  COPY PARA CPBAS                                          007600      
000093*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000094* COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS    ON CMEMP.".          007700      
000095                                                                  000100      
000096******************************************************************000200      
000097**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
000098**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
000099**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
000100******************************************************************000600      
000101                                                                  000700      
000102 01 A00-R00-HDR-MOV .                                             000800      
000103    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
000104    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
000105    02 FILLER                          PIC  X(08).                001100      
000106    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
000107    02 FILLER                          PIC  X(430).               001300      
000108                                                                  001400      
000109 01 A00-R01-REGMOV .                                              001500      
000110    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
000111    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
000112    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
000113                                                                  001900      
000114    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
000115    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
000116                                       PIC  9(04)      COMP.      002200      
000117    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
000118                                       PIC  9(04)      COMP.      002400      
000119                                                                  002500      
000120    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000121    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
000122                                       PIC  9(02)      COMP.      002800      
000123    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
000124                                       PIC  9(02)      COMP.      003000      
000125    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
000126    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
000127                                       A00-R01-SERVICIO-ALERTA.   003060      
000128       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
000129       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
000130    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
000131    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
000132    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
000133                                       PIC  9(04)      COMP.      003420      
000134    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
000135    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
000136                                       PIC  9(04)      COMP.      003520      
000137    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
000138    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
000139    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
000140                                       PIC  9(02)      COMP.      003900      
000141                                                                  004000      
000142    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
000143    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
000144       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
000145          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
000146          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
000147          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
000148          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
000149          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
000150          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
000151          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
000152                                                                  005100      
000153    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
000154       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
000155       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
000156       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
000157       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
000158       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
000159       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
000160       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
000161                                                                  006000      
000162       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
000163       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
000164       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
000165       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
000166       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
000167       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
000168       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
000169                                                                  006800      
000170       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
000171       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
000172       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
000173       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
000174       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
000175       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
000176       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
000177                                                                  007600      
000178       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
000179       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
000180       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
000181       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
000182       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
000183       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
000184       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
000185                                                                  008400      
000186       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
000187       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
000188       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
000189       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
000190       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
000191       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
000192       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
000193                                                                  009200      
000194    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
000195    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
000196    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
000197    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
000198    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
000199    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
000200       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
000201    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
000202    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
000203    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
000204    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
000205    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
000206    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
000207    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
000208    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
000209       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
000210       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
000211    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
000212    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
000213    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
000214    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
000215    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
000216    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
000217    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
000218    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
000219    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
000220    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
000221    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
000222    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
000223    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
000224    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
000225                                       PIC X(10).                 012600      
000226    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
000227       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
000228       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
000229    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
000230    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
000231    03 A00-R01-FILIAL                  PIC  X(05).                013200      
000232    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
000233       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
000234       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
000235                                                                  013300      
000236    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
000237    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
000238                                       PIC  X(09).                013600      
000239    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
000240                                       PIC  9(18)      COMP.      013800      
000241    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
000242    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
000243                                       PIC  X(9).                 014100      
000244    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
000245    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
000246                                       PIC  X(05).                014400      
000247    03 A00-R01-NIO                     PIC  X(16).                014500      
000248    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
000249    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
000250    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
000251       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
000252    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
000253    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
000254       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
000255    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
000256    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
000257    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
000258    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
000259    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
000260    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
000261                                       PIC  X(04).                015900      
000262    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
000263    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
000264    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
000265                                       PIC  9(04)      COMP.      016300      
000266    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
000267    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
000268    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
000269    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
000270    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
000271                                                                  016900      
000272    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
000273    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
000274       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
000275    03 A00-R01-FILXAPL                 PIC X(165).                017300      
000276                                                                  017400      
000277    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
000278       05 FILLER                       PIC X(96).                 017510      
000279       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
000280       05 FILLER                       PIC X(67).                 017700      
000281                                                                  017702      
000282    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
000283       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
000284       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
000285       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
000286       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
000287       06 WKS-MOV-FILS084              PIC X(154).                017714      
000288                                                                  017800      
000289    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
000290       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
000291       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
000292       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
000293       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
000294       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
000295       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
000296       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
000297       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
000298       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018155      
000299*      CAMPOS NUEVOS                                              018160      
000300       05 A00-R01-SUCFOND              PIC 9(04)      COMP.       018161      
000301       05 A00-R01-CTAFOND              PIC 9(16)      COMP.       018162      
000302       05 A00-R01-OPBANEL              PIC 9(04)      COMP.       018163      
000303       05 A00-R01-GATN                 PIC S9(03)V99   COMP.      018164      
000304       05 A00-R01-GATR                 PIC S9(03)V99   COMP.      018165      
000305       05 A00-R01-FECGAT               PIC 9(08)      COMP.       018166      
000306       05 FILLER                       PIC X(43).                 018167      
000307*       05 FILLER                       PIC X(62).                018170      
000308       05 A00-R01-CTE-087              PIC X(07).                 018210      
000309       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
000310          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
000311          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
000312          07 FILLER                    PIC X(01).                 018281      
000313       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
000314       05 FILLER                       PIC X(58).                 018400      
000315                                                                  018500      
000316    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
000317       05 FILLER                       PIC  X(96).                018610      
000318       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
000319       05 FILLER                       PIC  X(65).                018630      
000320                                                                  018640      
000321    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
000322       05 A00-R01-FORMATO0             PIC  9(02).                018700      
000323       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
000324       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
000325       05 FILLER                       PIC  X(141).               018910      
000326                                                                  019100      
000327    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
000328       05 A00-R01-FORMATO1             PIC  9(02).                019300      
000329       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
000330       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
000331       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
000332       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
000333       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
000334       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
000335       05 A00-R01-ENTSAL               PIC  X(01).                020000      
000336       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
000337       05 FILLER                       PIC  X(69).                020200      
000338                                                                  020300      
000339    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
000340       05 A00-R01-FORMATO2             PIC  9(02).                020500      
000341       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
000342       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
000343       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
000344       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
000345       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
000346       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
000347       05 FILLER                       PIC  X(77).                021200      
000348                                                                  021300      
000349    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
000350       05 A00-R01-FORMATO3             PIC  9(02).                021500      
000351       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
000352       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
000353       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
000354       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
000355       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
000356       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
000357       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
000358       05 FILLER                       PIC  X(69).                022300      
000359                                                                  022400      
000360    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
000361       05 A00-R01-FORMATO4             PIC  9(02).                022600      
000362       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
000363       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
000364       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
000365       05 A00-R01-RFCFT04              PIC  X(13).                023000      
000366       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
000367       05 A00-R01-DIRECCION            PIC  X(40).                023200      
000368       05 FILLER                       PIC  X(85).                023300      
000369                                                                  023400      
000370    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
000371       05 A00-R01-COBERTURA            PIC  X(01).                023408      
000372       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
000373       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
000374       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
000375       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
000376       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
000377       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
000378       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
000379       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
000380       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
000381       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
000382       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
000383       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
000384       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
000385       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
000386       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
000387       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
000388       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
000389       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
000390       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
000391       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
000392       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
000393       05 FILLER                       PIC  X(05).                023492      
000394                                                                  023497      
000395    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
000396       05 A00-R01-4CEROS               PIC  9(04).                023600      
000397       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
000398       05 FILLER                       PIC  X(157).               023800      
000399                                                                  023900      
000400    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
000401       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
000402        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
000403       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
000404       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
000405       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
000406       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
000407       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
000408       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
000409       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
000410       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
000411       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
000412       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
000413       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
000414       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
000415       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
000416       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
000417       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
000418       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
000419       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
000420       05 A00-R01-FILLER               PIC  X(41).                025850      
000421       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
000422       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
000423       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
000424       05 A00-R01-INDPAGO              PIC  9(01).                026200      
000425       05 FILLER                       PIC  X(01).                026210      
000426       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
000427       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
000428       05 FILLER                       PIC  X(52).                026300      
000429                                                                  026400      
000430    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
000431       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
000432       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
000433       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
000434       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
000435       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
000436       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
000437       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
000438       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
000439       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
000440       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
000441       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
000442       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
000443       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
000444          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
000445          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
000446       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
000447       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
000448          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
000449       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
000450          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
000451       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
000452          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
000453       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
000454          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
000455       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
000456          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
000457       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
000458          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
000459       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
000460          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
000461       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
000462          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
000463       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
000464          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
000465       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
000466          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
000467          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
000468       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
000469       05 FILLER                       PIC X(01).                 030101      
000470       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
000471       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
000472       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
000473       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
000474       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
000475       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
000476       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
000477       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
000478          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
000479       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
000480       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
000481       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
000482       05 FILLER                       PIC X(14).                 030700      
000483                                                                  030800      
000484    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
000485       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
000486       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
000487       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
000488       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
000489       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
000490       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
000491       05 A00-R01-151-CITI             PIC  9(02)     COMP.       031520      
000492       05 A00-R01-151-IND-BNE          PIC  9(02)     COMP.       031540      
000493       05 FILLER                       PIC  X(140).               031600      
000494                                                                  031700      
000495    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
000496       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
000497       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
000498       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
000499       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
000500       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
000501       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
000502       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
000503       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
000504       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
000505       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
000506          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
000507          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
000508          07 FILLER                    PIC  X(08).                032740      
000509       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
000510       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
000511       05 A00-R01-NOMORD               PIC  X(30).                033000      
000512       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
000513       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
000514       05 A00-R01-REF-CECO             PIC  X(07).                033500      
000515       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
000516       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
000517          A00-R01-NUM-ORD-PAGO.                                   033800      
000518          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
000519          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
000520                                                                  034100      
000521    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
000522       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
000523       05 A00-R01-RFC-S501             PIC  X(13).                034160      
000524       05 FILLER                       PIC  X(151).               034180      
000525                                                                  034190      
000526    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
000527       05 A00-R01-DATOS-S701           PIC X(116).                034300      
000528       05 A00-R01-PAG-SERV             REDEFINES                  034400      
000529                                       A00-R01-DATOS-S701.        034500      
000530          07 A00-R01-ID                PIC X(30).                 034600      
000531          07 A00-R01-FECREC            PIC 9(06).                 034700      
000532          07 A00-R01-REF1              PIC X(20).                 034800      
000533          07 A00-R01-REF2              PIC X(20).                 034900      
000534          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
000535          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
000536                                       A00-R01-TIPOPAGO.          035200      
000537             09 A00-R01-ESTAB          PIC 9(04).                 035300      
000538             09 A00-R01-SEQ            PIC 9(02).                 035400      
000539          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
000540          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
000541          07 A00-R01-EBPP              PIC 9(03).                 035700      
000542          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
000543          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
000544          07 FILLER                    PIC X(01).                 035728      
000545          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
000546          07 FILLER                    PIC X(18).                 035760      
000547       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
000548                                       A00-R01-DATOS-S701.        035900      
000549          07 A00-R01-RFC               PIC X(13).                 036000      
000550          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
000551          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
000552          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
000553          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
000554          07 FILLER                    PIC X(85).                 036200      
000555       05 FILLER                       PIC X(49).                 036300      
000556                                                                  036400      
000557    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
000558       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
000559       05 A00-R01-CTA-S702             PIC X(40).                 036700      
000560       05 FILLER                       PIC X(113).                036710      
000561                                                                  036720      
000562    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
000563       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
000564       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
000565       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
000566       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
000567       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
000568       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
000569       05 FILLER                       PIC X(72).                 036800      
000570                                                                  036810      
000571                                                                  036820      
000572    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
000573       05 A00-R01-TRUI-S711.                                      036915      
000574          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
000575          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
000576          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
000577           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
000578          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
000579       05 A00-R01-MICR-S711.                                      036945      
000580          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
000581          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
000582          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
000583          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
000584          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
000585          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
000586          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
000587          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
000588       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
000589       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
000590       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
000591       05 A00-R01-FIL-S711             PIC X(05).                 036965      
000592       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
000593       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
000594       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
000595                                                                  036990      
000596    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
000597       05 A00-R01-RFC-502              PIC  X(13).                037100      
000598       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
000599          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
000600          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
000601          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
000602          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
000603          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
000604          07 FILLER                    PIC  9(01) COMP.           037650      
000605       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
000606       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
000607       05 FILLER                       PIC  X(06).                038680      
000608                                                                  038682      
000609    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
000610       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
000611       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
000612       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
000613       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
000614       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
000615       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
000616       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
000617       05 FILLER                       PIC  X(81).                038750      
000618                                                                  038755      
000619    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
000620       05 A00-R01-COP                  PIC  9(13)        .        038900      
000621       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
000622       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
000623       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
000624       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
000625       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
000626       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
000627       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
000628       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
000629       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
000630       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
000631       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
000632       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
000633       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
000634       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
000635       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
000636       05 FILLER                       PIC  X(81)        .        040800      
000637                                                                  040810      
000638    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
000639       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
000640       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
000641       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
000642       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
000643       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
000644       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
000645       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
000646       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
000647       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
000648       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
000649       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
000650       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
000651       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
000652       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
000653       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
000654       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
000655       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
000656       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
000657       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
000658       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
000659       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
000660       05 FILLER                       PIC  X(18).                041040      
000661                                                                  041400      
000662    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
000663    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
000664*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000665                                                                  007800      
000666 01 WKS-TITLE-MOVS500.                                            007900      
000667    02 FILLER                  PIC X(17) VALUE                    008000      
000668                               "S151/FILE/MOVS500".               008100      
000669    02 FILLER                  PIC X(01) VALUE "/".               008200      
000670    02 WKS-MOVS-FECHA          PIC 9(06).                         008300      
000671    02 FILLER                  PIC X(04) VALUE " ON ".            008400      
000672    02 WKS-PACK-MOVS           PIC X(17).                         008500      
000673    02 FILLER                  PIC X(01) VALUE ".".               008600      
000674                                                                  008700      
000675******************************************************************008800      
000676*  NOMBRE DE ARCHIVO DE CONTROL                                  *008900      
000677******************************************************************009000      
000678                                                                  009100      
000679 01 WKS-TITLE-CTLENV.                                             009200      
000680    03 FILLER                     PIC X(27) VALUE                 009300      
000681       "(S151)S151/FILE/CTLENVP013/".                             009400      
000682    03 WKS-FECHA-ENV              PIC 9(06).                      009500      
000683    03 FILLER                     PIC X(10) VALUE                 009600      
000684       " ON CMEMP.".                                              009700      
000685                                                                  009800      
000686******************************************************************009900      
000687*             NOMBRE DE ARCHIVO DE DISPLAY                       *010000      
000688******************************************************************010100      
000689 01 WKS-TITLE-DISPLAY.                                            010200      
000690    10 FILLER                    PIC X(27) VALUE                  010300      
000691        "S151/FILE/L01/DISPLAY/P013/"       .                     010400      
000692    10 WKS-RUT-DIS-CSI           PIC X(03)   .                    010500      
000693    10 FILLER                    PIC X(01) VALUE "/".             010600      
000694    10 WKS-RUT-DIS-FCH           PIC 9(06).                       010700      
000695    10 FILLER                    PIC X(01) VALUE "/".             010800      
000696    10 WKS-RUT-DIS-HORA          PIC 9(08)   .                    010900      
000697    10 FILLER                    PIC X(01) VALUE "." .            011000      
000698                                                                  011100      
000699******************************************************************011200      
000700*               NOMBRE DE ARCHIVO MONITOR                        *011300      
000701*                                                                *011400      
000702******************************************************************011500      
000703 01 WKS-TITLE-MONITOR.                                            011600      
000704    10 FILLER                    PIC X(27) VALUE                  011700      
000705        "S151/FILE/L02/MONITOR/P013/".                            011800      
000706    10 WKS-RUT-MON-CSI           PIC X(03)   .                    011900      
000707    10 FILLER                    PIC X(01) VALUE "/".             012000      
000708    10 WKS-RUT-MON-FCH           PIC 9(06)   .                    012100      
000709    10 FILLER                    PIC X(01) VALUE "/".             012200      
000710    10 WKS-RUT-MON-HORA          PIC 9(08).                       012300      
000711    10 FILLER                    PIC X(01) VALUE "." .            012400      
000712                                                                  012500      
000713******************************************************************012600      
000714*             VARIABLES ARCHIVO TASKFILE                         *012700      
000715******************************************************************012800      
000716 01 WKS-TIT-TASKFILE.                                             012900      
000717    03 FILLER                     PIC X(30) VALUE                 013000      
000718       "FILE TASKFILE (USERBACKUPNAME=".                          013100      
000719    03 FILLER                     PIC X(30) VALUE                 013200      
000720       "TRUE,TITLE=S151/TASKFILE/P013/".                          013300      
000721    03 WKS-TSK-NODO               PIC 9(02).                      013400      
000722    03 WKS-TSK-SUBN               PIC 9(02) VALUE ZERO.           013500      
000723    03 FILLER                     PIC X(06) VALUE                 013600      
000724       "/R000/".                                                  013700      
000725    03 WKS-TSK-FECHA              PIC 9(06).                      013800      
000726    03 FILLER                     PIC X(01) VALUE "/".            013900      
000727    03 WKS-TSK-MXNB               PIC 9(07).                      014000      
000728    03 FILLER                     PIC X(01) VALUE "/".            014100      
000729    03 WKS-TSK-MNEMONICO          PIC X(14) VALUE                 014200      
000730       "001TASKFILE );".                                          014300      
000731                                                                  014400      
000732** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ        014500      
000733*INICIO  COPY PARA CPBAS                                          014600      
000734*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000735* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           014700      
000736**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000737  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000738  01 MENSAJE-LJ.                                                  100300      
000739     02 SISTEMA-LJ     PIC X(04).                                 100400      
000740     02 FILLER         PIC X VALUE "/".                           100500      
000741     02 PASO-LJ        PIC X(04).                                 100600      
000742     02 FILLER         PIC X VALUE "/".                           100700      
000743     02 MTP-LJ         PIC 9(03).                                 100800      
000744     02 FILLER         PIC X VALUE ":".                           100900      
000745     02 TIPO-LJ        PIC X.                                     101000      
000746     02 FILLER         PIC X VALUE ">".                           101100      
000747     02 CODIGO-LJ      PIC 9(06).                                 101200      
000748     02 FILLER         PIC X VALUE "<".                           101300      
000749     02 TEXTO-LJ       PIC X(250).                                101400      
000750*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000751                                                                  014800      
000752****************************************************************  014900      
000753*   DESCRIPCION DE FORMATOS DE LLAMADO A LIBRERIA DE CONTROL   *  015000      
000754****************************************************************  015100      
000755*INICIO  COPY PARA CPBAS                                          015200      
000756*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000757* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         015300      
000758*================================================================ 000100      
000759*         ENTRY-POINT CONSISDIA :                               = 000200      
000760*                                                                 000300      
000761* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000762* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000763* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000764* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000765* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000766* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000767* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000768* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000769* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000770* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000771*                                                               = 001400      
000772*================================================================ 001500      
000773                                                                  001600      
000774                                                                  001700      
000775*================================================================ 001800      
000776* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000777*                                                               = 002000      
000778* ENTRADA REQUERIDA :                                           = 002100      
000779*                                                               = 002200      
000780*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000781*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000782*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000783*================================================================ 002600      
000784 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000785    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000786    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000787    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000788    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000789    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000790    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000791    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000792    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000793    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000794    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000795    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000796    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000797    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000798    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000799    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000800    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000801    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000802    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000803    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000804    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000805       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000806       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000807       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000808       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000809*==============================================================   005200      
000810*                                                             =   005300      
000811* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000812*                                                             =   005500      
000813* CAMPOS REQUERIDOS :                                         =   005600      
000814*                                                             =   005700      
000815* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000816* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000817* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000818* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000819*==============================================================   006200      
000820 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000821    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000822    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000823    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000824    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000825                                                                  006800      
000826*==============================================================   006900      
000827*                                                             =   007000      
000828* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000829*                                                             =   007200      
000830* CAMPOS REQUERIDOS :                                         =   007300      
000831*                                                             =   007400      
000832* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000833* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000834* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000835* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000836*==============================================================   007900      
000837 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000838    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000839    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000840    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000841    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000842                                                                  008500      
000843*==============================================================   008600      
000844*                                                             =   008700      
000845* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000846*                                                             =   008900      
000847* CAMPOS REQUERIDOS :                                         =   009000      
000848*                                                             =   009100      
000849* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000850* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000851* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000852* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000853*==============================================================   009600      
000854 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000855    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000856    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000857    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000858    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000859                                                                  010200      
000860*============================================================     010300      
000861* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000862*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000863*                                                           =     010600      
000864*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000865*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000866*                                                           =     010900      
000867*  ENTRADA REQUERIDA.                                       =     011000      
000868*                                                           =     011100      
000869*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000870*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000871*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000872*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000873*============================================================     011600      
000874                                                                  011700      
000875 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000876     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000877     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000878     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000879     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000880                                                                  012300      
000881*=============================================================    012400      
000882*                                                            =    012500      
000883* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000884*             B01-SIS-FECARMOV.                              =    012700      
000885*                                                            =    012800      
000886* ENTRADA REQUERIDAD :                                       =    012900      
000887*                                                            =    013000      
000888*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000889*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000890*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000891*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000892*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000893*=============================================================    013600      
000894                                                                  013700      
000895 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000896     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000897     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000898     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000899     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000900     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000901*================================================================ 014400      
000902*                                                               = 014500      
000903* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000904*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000905*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000906*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000907*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000908*                                                               = 015100      
000909* ENTRADA REQUERIDA :                                           = 015200      
000910*                                                               = 015300      
000911* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000912* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000913* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000914* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000915* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000916*================================================================ 015900      
000917 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000918    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000919    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000920    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000921    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000922    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000923                                                                  016600      
000924*============================================================     016700      
000925*                                                           =     016800      
000926* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000927*                                                           =     017000      
000928* DATOS REQUERIDOS :                                        =     017100      
000929*                                                           =     017200      
000930* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000931* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000932* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000933* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000934* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000935*============================================================     017800      
000936                                                                  017900      
000937 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000938     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000939     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000940     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000941     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000942     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000943                                                                  018600      
000944*============================================================     018700      
000945*                                                           =     018800      
000946* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000947*                                                           =     019000      
000948* DATOS REQUERIDOS :                                        =     019100      
000949*                                                           =     019200      
000950* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000951* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000952* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000953* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000954* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000955*============================================================     019800      
000956                                                                  019900      
000957 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000958     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000959     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000960     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000961     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000962     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000963                                                                  020600      
000964*===============================================================  020700      
000965*                                                              =  020800      
000966* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000967*              MOVIMIENTOS.                                    =  021000      
000968* DATOS REQUERIDOS :                                           =  021100      
000969*                                                              =  021200      
000970* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000971* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000972* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000973* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000974* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000975* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000976*==============================================================   021900      
000977                                                                  022000      
000978 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000979     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000980     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000981     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000982     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000983     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000984     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000985*==============================================================   022800      
000986*                                                             =   022900      
000987* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000988*                                                             =   023100      
000989* CAMPOS REQUERIDOS :                                         =   023200      
000990*                                                             =   023300      
000991* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000992* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000993* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000994* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000995*==============================================================   023800      
000996 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000997    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000998    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000999    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
001000    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
001001                                                                  024304      
001002*=================================================================024306      
001003*                ENTRY POINT CONSISB01                           =024308      
001004*                                                                =024310      
001005*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
001006*                                                                =024314      
001007*  FUNCIONES DISPONIBLES :                                       =024316      
001008*                                                                =024318      
001009*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
001010*                                                                =024322      
001011*  PARAMETROS REQUERIDOS                                         =024324      
001012*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
001013*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
001014*=================================================================024330      
001015                                                                  024332      
001016 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
001017     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
001018     03 WKS-CON-CSI                PIC 9(02).                     024336      
001019     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
001020     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
001021        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
001022        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
001023        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
001024        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
001025        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
001026                                                                  024400      
001027*=================================================================024500      
001028*                ENTRY POINT B02ARCINTER                         =024600      
001029*                                                                =024700      
001030*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
001031*                                                                =024900      
001032*  FUNCIONES DISPONIBLES :                                       =025000      
001033*                                                                =025100      
001034*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
001035* 19.- ALTAS DE ARCHIVOS.                                        =025300      
001036* 22.- BAJAS DE ARCHIVOS.                                        =025400      
001037* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
001038*                                                                =025600      
001039*  PARAMETROS REQUERIDOS                                         =025700      
001040*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
001041*                                                                =025900      
001042*=================================================================026000      
001043 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
001044     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
001045     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
001046     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
001047     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
001048     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
001049     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
001050     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
001051     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
001052     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
001053     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
001054     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
001055     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
001056     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
001057     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
001058     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
001059     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
001060     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
001061     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
001062     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
001063     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
001064     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
001065     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
001066     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
001067     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
001068     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
001069     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
001070     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
001071     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
001072                                                                  029000      
001073*=================================================================029100      
001074*                ENTRY POINT B04SISTEMA                          =029200      
001075*                                                                =029300      
001076*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
001077*                                                                =029500      
001078*  FUNCIONES DISPONIBLES :                                       =029600      
001079*                                                                =029700      
001080*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
001081*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
001082*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
001083*                                                                =030100      
001084*  PARAMETROS REQUERIDOS                                         =030200      
001085*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
001086*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
001087*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
001088*                                                                =030600      
001089*=================================================================030700      
001090 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
001091     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
001092     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
001093     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
001094     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
001095     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
001096     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
001097     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
001098                                                                  031600      
001099*================================================================ 031700      
001100*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
001101*                                                               = 031900      
001102*  FUNCION                                                      = 032000      
001103*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
001104*   19       ALTAS.                                             = 032200      
001105*   22       BAJAS                                              = 032300      
001106*   37       CAMBIOS.                                           = 032400      
001107*                                                               = 032500      
001108*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
001109*                      FECHA DE PROCESO                         = 032700      
001110*                      NUMERO DE PROCESO                        = 032800      
001111*                      FECHA INICIO                             = 032900      
001112*                      REGISTRO INICIAL                         = 033000      
001113*================================================================ 033100      
001114                                                                  033200      
001115 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
001116     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
001117     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
001118     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
001119     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
001120     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
001121     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
001122     03 WKS-B05-MIX                PIC 9(08).                     034000      
001123     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
001124     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
001125     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
001126     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
001127     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
001128     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
001129                                                                  034700      
001130                                                                  034800      
001131*================================================================ 034900      
001132*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
001133*                                                               = 035100      
001134*  FUNCION                                                      = 035200      
001135*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
001136*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
001137*                                                               = 035500      
001138*================================================================ 035600      
001139                                                                  035700      
001140 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
001141     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
001142     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
001143     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
001144     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
001145     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
001146     03 WKS-B09-NOMREN             PIC X(15).                     036400      
001147                                                                  036500      
001148*===============================================================  036600      
001149*                                                              =  036700      
001150*         ENTRY-POINT CONSISMEN                                =  036800      
001151*                                                              =  036900      
001152*   DATOS REQUERIDOS : FUNCION                                 =  037000      
001153*                      SISTEMA                                 =  037100      
001154*                                                              =  037200      
001155*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
001156*                                                              =  037400      
001157*===============================================================  037500      
001158 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
001159     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
001160     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
001161     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
001162     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
001163     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
001164     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
001165     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
001166     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
001167     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
001168     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
001169     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
001170     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
001171     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
001172     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
001173     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
001174        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
001175        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
001176        05 WKS-B03-AAMM            PIC 9(06).                     039402      
001177        05 WKS-B03-SECOK           PIC 9(10).                     039500      
001178        05 WKS-B03-SECINF          PIC 9(10).                     039600      
001179        05 WKS-B03-SECERR          PIC 9(10).                     039700      
001180        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
001181                                                                  039900      
001182*=====================================================            040000      
001183*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
001184*=====================================================            040200      
001185 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
001186     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
001187     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
001188     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
001189                                                                  040700      
001190*=====================================================            040800      
001191*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
001192*=====================================================            041000      
001193 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
001194     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
001195     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
001196     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
001197                                                                  041500      
001198*=====================================================            041600      
001199*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
001200*=====================================================            041800      
001201 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
001202     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
001203     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
001204     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
001205*=====================================================            042300      
001206*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
001207*=====================================================            042500      
001208 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
001209     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
001210     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
001211     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
001212                                                                  043000      
001213*=====================================================            043100      
001214*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
001215*=====================================================            043300      
001216 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
001217     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
001218     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
001219     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
001220                                                                  043800      
001221*=====================================================            043900      
001222*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
001223*=====================================================            044100      
001224 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
001225     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
001226     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
001227     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
001228                                                                  044600      
001229*=====================================================            044700      
001230*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
001231*=====================================================            044900      
001232 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
001233     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
001234     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
001235     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
001236                                                                  045400      
001237*=====================================================            045500      
001238*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
001239*=====================================================            045700      
001240 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
001241     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
001242     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
001243     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
001244                                                                  046200      
001245*=====================================================            046300      
001246*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
001247*=====================================================            046500      
001248 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
001249     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
001250     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
001251     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
001252                                                                  047000      
001253*=====================================================            047100      
001254*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
001255*=====================================================            047300      
001256 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
001257     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
001258     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
001259     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001260                                                                  047800      
001261*=====================================================            047900      
001262*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001263*=====================================================            048100      
001264 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001265     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001266     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001267     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001268                                                                  048600      
001269*=====================================================            048700      
001270*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001271*=====================================================            048900      
001272 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001273     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001274     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001275     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001276                                                                  049400      
001277*=====================================================            049500      
001278*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001279*=====================================================            049700      
001280 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001281     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001282     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001283     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001284     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001285     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001286     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001287     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001288     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001289     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001290     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001291                                                                  050900      
001292*=====================================================            051000      
001293*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001294*=====================================================            051200      
001295 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001296     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001297     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001298     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001299     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001300                                                                  051800      
001301*=====================================================            051900      
001302*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001303*=====================================================            052100      
001304 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001305     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001306     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001307     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001308     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001309                                                                  052700      
001310*=====================================================            052800      
001311*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001312*=====================================================            053000      
001313 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001314     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001315     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001316     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001317     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001318                                                                  053600      
001319*=====================================================            053700      
001320*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001321*=====================================================            053900      
001322 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001323     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001324     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001325     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001326     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001327                                                                  054500      
001328*=====================================================            054600      
001329*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001330*=====================================================            054800      
001331 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001332     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001333     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001334     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001335     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001336                                                                  055400      
001337*=====================================================            055500      
001338*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001339*=====================================================            055700      
001340 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001341     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001342     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001343     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001344     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001345                                                                  056300      
001346*=====================================================            056400      
001347*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001348*=====================================================            056600      
001349 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001350     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001351     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001352     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001353     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001354                                                                  057200      
001355 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001356*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001357                                                                  015400      
001358******************************************************************015500      
001359*             VARIABLES DE ARCHIVO ERRORES                       *015600      
001360*                                                                *015700      
001361******************************************************************015800      
001362 01 REGISTRO-DIS-HEADER                          .                015900      
001363    10 FILLER                    PIC X(05) VALUE "FECHA"  .       016000      
001364    10 FILLER                    PIC X(10) VALUE SPACES   .       016100      
001365    10 FILLER                    PIC X(04) VALUE "HORA"   .       016200      
001366    10 FILLER                    PIC X(04) VALUE SPACES   .       016300      
001367    10 FILLER                    PIC X(05) VALUE "PASO "  .       016400      
001368    10 FILLER                    PIC X(02) VALUE SPACES   .       016500      
001369    10 FILLER                    PIC X(07) VALUE "MENSAJE".       016600      
001370                                                                  016700      
001371 01 REGISTRO-DIS-DETALLE.                                         016800      
001372    10 WKS-DIS-FECHA-S           PIC ZZ.                          016900      
001373    10 WKS-DIS-FECHA-A           PIC ZZ.                          017000      
001374    10 FILLER                    PIC X(01) VALUE "/".             017100      
001375    10 WKS-DIS-FECHA-M           PIC ZZ.                          017200      
001376    10 FILLER                    PIC X(01) VALUE "/".             017300      
001377    10 WKS-DIS-FECHA-D           PIC ZZ.                          017400      
001378    10 FILLER                    PIC X(05) VALUE SPACES .         017500      
001379    10 WKS-DIS-HORA              PIC 9(02) .                      017600      
001380    10 FILLER                    PIC X(01) VALUE ":" .            017700      
001381    10 WKS-DIS-MINUTO            PIC 9(02) .                      017800      
001382    10 FILLER                    PIC X(03) VALUE SPACES.          017900      
001383    10 FILLER                    PIC X(01) VALUE "P" .            018000      
001384    10 WKS-DIS-PASO              PIC 9(03) VALUE 013.             018100      
001385    10 FILLER                    PIC X(03) VALUE SPACES.          018200      
001386    10 WKS-DIS-MENSAJE           PIC X(140) .                     018300      
001387                                                                  018400      
001388 01 WKS-DIS-TEXTO                 PIC X(140) .                    018500      
001389                                                                  018600      
001390*============================================================     018700      
001391*         VARIABLES PARA CARGA DE CATALOGOS                 *     018800      
001392*============================================================     018900      
001393 77  W77-L710-SISTEMA             PIC S9(11) BINARY.              019000      
001394 77  W77-L710-PROGRAMA            PIC S9(11) BINARY.              019100      
001395 01  WKS-L710-ENT.                                                019200      
001396      03 WKS-EL710-CAT             PIC 9(06) COMP.                019300      
001397      03 WKS-EL710-CLAVE           PIC 9(02) COMP.                019400      
001398      03 WKS-EL710-BUSQUEDA        PIC 9(02) COMP.                019500      
001399      03 WKS-EL710-REGISTROS       PIC 9(02) COMP.                019600      
001400      03 WKS-EL710-LLAVE1          PIC 9(12).                     019700      
001401      03 WKS-EL710-LLAVE2          PIC 9(12).                     019800      
001402      03 WKS-EL710-LLAVE3          PIC 9(12).                     019900      
001403      03 WKS-EL710-LLAVE4          PIC 9(12).                     020000      
001404      03 WKS-EL710-LLAVE5          PIC 9(12).                     020100      
001405      03 WKS-EL710-LLAVE6          PIC 9(12).                     020200      
001406      03 WKS-EL710-FEC-VIG         PIC 9(06) COMP.                020300      
001407      03 WKS-EL710-FECINI          PIC 9(06) COMP.                020400      
001408      03 WKS-EL710-NIVINI          PIC 9(02) COMP.                020500      
001409      03 FILLER                    PIC X(11).                     020600      
001410                                                                  020700      
001411 01  WKS-L710-SAL.                                                020800      
001412      03 WKS-SL710-NUMREG          PIC 9(02) COMP.                020900      
001413      03 WKS-SL710-CAT             PIC 9(06) COMP.                021000      
001414      03 WKS-SL710-FECINI          PIC 9(06) COMP.                021100      
001415      03 WKS-SL710-NIVINI          PIC 9(02) COMP.                021200      
001416      03 FILLER                    PIC X(22).                     021300      
001417      03 WKS-SL710-REG             OCCURS 10 TIMES.               021400      
001418         05 WKS-SL710-DAT          PIC 9(12) OCCURS 28 TIMES.     021500      
001419         05 WKS-SL710-FECALTA      PIC 9(06) COMP.                021600      
001420         05 WKS-SL710-FECBAJA      PIC 9(06) COMP.                021700      
001421         05 WKS-SL710-FECMOD       PIC 9(06) COMP.                021800      
001422         05 WKS-SL710-FECVIG       PIC 9(06) COMP.                021900      
001423         05 FILLER                 PIC X(42).                     022000      
001424  77 W77-L710-RESULT               PIC S9(11) BINARY.             022100      
001425  77 W77-ERR-CAT                   PIC 9(02).                     022200      
001426  77 W77-CAT-FORMATO               PIC 9(02).                     022300      
001427  77 W77-CAT-NUMCAT                PIC 9(04).                     022400      
001428  77 W77-NUMCAT                    PIC 9(04).                     022500      
001429  77 W77-EOF                       PIC 9(02).                     022600      
001430                                                                  022700      
001431******************************************************************022800      
001432*                CVE TRANSACCION DE DOMICILIACION                 022900      
001433******************************************************************023000      
001434  01 CVETRAN-DOMI.                                                023100      
001435     05 WKS-CVETRAN-DOMI   OCCURS 10000 TIMES.                    023200      
001436        10 WKS-CAT6-CVETRAN      PIC 9(06) COMP.                  023300      
001437        10 WKS-CAT6-SERV3        PIC 9(01) COMP.                  023400      
001438                                                                  023500      
001439 01 WKS-FECHAS.                                                   023600      
001440    03 WKS-FECHA-MAQUINA         PIC X(10) TYPE IS NUMERIC-DATE.  023700      
001441    03 WKS-FECHA-MAQUINA-R REDEFINES WKS-FECHA-MAQUINA.           023800      
001442       05 WKS-FECMAQ-MM          PIC 9(02).                       023900      
001443       05 WKS-DIAGONAL1          PIC X(01).                       024000      
001444       05 WKS-FECMAQ-DD          PIC 9(02).                       024100      
001445       05 WKS-DIAGONAL2          PIC X(01).                       024200      
001446       05 WKS-FECMAQ-AAAA        PIC 9(04).                       024300      
001447       05 WKS-FECMAQ-AAAA-R      REDEFINES WKS-FECMAQ-AAAA.       024400      
001448          07 WKS-FECMAQ-CC       PIC 9(02).                       024500      
001449          07 WKS-FECMAQ-AA       PIC 9(02).                       024600      
001450    03 WKS-FECHA-MAQ-8D.                                          024700      
001451       05 WKS-CC-MAQ             PIC 9(02).                       024800      
001452       05 WKS-FECHA-MAQ-6D.                                       024900      
001453          07 WKS-AA-MAQ          PIC 9(02).                       025000      
001454          07 WKS-MM-MAQ          PIC 9(02).                       025100      
001455          07 WKS-DD-MAQ          PIC 9(02).                       025200      
001456    03 WKS-FECHA-MAQ-ANT-8D.                                      025300      
001457       05 WKS-CC-MAQ-ANT         PIC 9(02).                       025400      
001458       05 WKS-FECHA-MAQ-ANT-6D.                                   025500      
001459          07 WKS-AA-MAQ-ANT      PIC 9(02).                       025600      
001460          07 WKS-MM-MAQ-ANT      PIC 9(02).                       025700      
001461          07 WKS-DD-MAQ-ANT      PIC 9(02).                       025800      
001462                                                                  025900      
001463 01 WKS-FECPRO-S500              PIC 9(08).                       026000      
001464 01 WKS-FECHA-PROCESO      REDEFINES WKS-FECPRO-S500.             026100      
001465    03 WKS-FECPRO-CC             PIC 9(02).                       026200      
001466    03 WKS-FECPRO-6D             PIC 9(06).                       026300      
001467    03 WKS-FECPRO-6D-R     REDEFINES WKS-FECPRO-6D.               026400      
001468       05 WKS-FECPRO-AA          PIC 9(02).                       026500      
001469       05 WKS-FECPRO-MM          PIC 9(02).                       026600      
001470       05 WKS-FECPRO-DD          PIC 9(02).                       026700      
001471 01 WKS-FEC-REINT                PIC 9(06).                       026800      
001472 01 WKS-FEC-PROC-ANT.                                             026900      
001473    03 WKS-FECPRO-ANT-CC         PIC 9(02).                       027000      
001474    03 WKS-FECPRO-ANT-6D         PIC 9(06).                       027100      
001475                                                                  027200      
001476 01 WKS-CTLVER-LIBID             PIC X(12).                       027300      
001477 01 WKS-CTLVER-NOMLIB            PIC X(72).                       027400      
001478 01 W77-CTLVER-RESULT            PIC S9(11) BINARY.               027500      
001479                                                                  027600      
001480******************************************************            027700      
001481*                ARREGLO PARA LOS SERVICIOS                       027800      
001482******************************************************            027900      
001483 01 ARR-SERV.                                                     028000      
001484     05 VAL-SERV  OCCURS 10 TIMES.                                028100      
001485        10 WKS-VAL-NUM-SERV               PIC 9(02).              028200      
001486        10 WKS-VAL-HR-INI                 PIC 9(08).              028300      
001487        10 WKS-VAL-HR-FIN                 PIC 9(08).              028400      
001488*1-DIA HABIL, 0-DIA INHABIL                                       028500      
001489        10 WKS-VAL-DIA-HAB                PIC 9(02).              028600      
001490        10 WKS-VAL-ACA-DES                PIC 9(06).              028700      
001491        10 WKS-VAL-CVE-TRAN-DES.                                  028800      
001492           20 WKS-VAL-CVE-TRAN-DES-SIS    PIC 9(04).              028900      
001493           20 WKS-VAL-CVE-TRAN-DES-COD    PIC 9(02).              029000      
001494           20 WKS-VAL-CVE-TRAN-DES-SUB    PIC 9(03).              029100      
001495        10 WKS-VAL-CVE-TRAN-OR.                                   029200      
001496           20 WKS-VAL-CVE-TRAN-OR-SIS     PIC 9(04).              029300      
001497           20 WKS-VAL-CVE-TRAN-OR-COD     PIC 9(02).              029400      
001498           20 WKS-VAL-CVE-TRAN-OR-SUB     PIC 9(03).              029500      
001499*0 Centralizado, 1 Descentralizado                                029600      
001500        10 WKS-VAL-CENTR                  PIC 9(02).              029700      
001501*0 Inactivos, 1 Activos                                           029800      
001502        10 WKS-REINT-ACT                  PIC 9(02).              029900      
001503        10 WKS-LONG-MSG                   PIC 9(04).              030000      
001504        10 WKS-VAL-SUC                    PIC 9(04).              030100      
001505        10 WKS-VAL-CAJA                   PIC 9(02).              030200      
001506        10 WKS-VAL-RDO                    PIC 9(02).              030300      
001507        10 WKS-VAL-TESP                   PIC 9(02).              030400      
001508        10 WKS-VAL-MODO                   PIC 9(01).              030500      
001509                                                                  030600      
001510*************************************************************     030700      
001511*                 VARIABLES DE DATOS GENERALES              *     030800      
001512*************************************************************     030900      
001513 01 WKS-DATGEN.                                                   031000      
001514    03 WKS-HORADG           PIC 9(06).                            031100      
001515    03 WKS-FECMOV           PIC 9(08).                            031200      
001516    03 WKS-FECMOV-2 REDEFINES WKS-FECMOV.                         031300      
001517       05 WKS-CENT          PIC 9(02).                            031400      
001518       05 WKS-FECHA         PIC 9(06).                            031500      
001519    03 WKS-FECHA-NATURAL    PIC 9(06).                            031600      
001520    03 WKS-HRS-ENV.                                               031700      
001521       05 WKS-HH-ENV        PIC 9(02).                            031800      
001522       05 WKS-MM-ENV        PIC 9(02).                            031900      
001523       05 WKS-SS-ENV        PIC 9(02).                            032000      
001524    03 WKS-FEC-NAT-CAN      PIC 9(06).                            032100      
001525    03 WKS-HRS-CAN.                                               032200      
001526       05 WKS-HH-CAN        PIC 9(02).                            032300      
001527       05 WKS-MM-CAN        PIC 9(02).                            032400      
001528       05 WKS-SS-CAN        PIC 9(02).                            032500      
001529    03 FILLER               PIC X(50).                            032600      
001530                                                                  032700      
001531*============================================================     032800      
001532*                    VARIABLES PARA HI                      *     032900      
001533*============================================================     033000      
001534 01 WKS-HI2                       PIC 9(3).                       033100      
001535                                                                  033200      
001536 01 WKS-HI-R                      REDEFINES                       033300      
001537    WKS-HI2.                                                      033400      
001538    05 WKS-HI-1                   PIC 9(02).                      033500      
001539       88 HI-14                   VALUE 14.                       033600      
001540       88 HI-15                   VALUE 15.                       033700      
001541       88 HI-16                   VALUE 16.                       033800      
001542    05 WKS-HI-TRANS               PIC 9(01).                      033900      
001543                                                                  034000      
001544 77 W77-HI                        PIC 9(02) VALUE 0.              034100      
001545    88 W88-HI-1                   VALUE 1.                        034200      
001546    88 W88-HI-2                   VALUE 2.                        034300      
001547    88 W88-HI-3                   VALUE 3.                        034400      
001548    88 W88-HI-4                   VALUE 4.                        034500      
001549    88 W88-HI-6                   VALUE 6.                        034600      
001550    88 W88-HI-12                  VALUE 12.                       034700      
001551    88 W88-HI-13                  VALUE 13.                       034800      
001552    88 W88-HI-17                  VALUE 17.                       034900      
001553    88 W88-HI-18                  VALUE 18.                       035000      
001554    88 W88-HI-19                  VALUE 19.                       035100      
001555    88 W88-HI-25                  VALUE 25.                       035200      
001556    88 W88-HI-80                  VALUE 80.                       035300      
001557 01 MY-ID                         PIC X(10) VALUE "S151/P013>".   035400      
001558 01 WKS-HR-AR.                                                    035500      
001559    03 WKS-HR-AR-HH               PIC 9(02).                      035600      
001560    03 WKS-HR-AR-MM               PIC 9(02).                      035700      
001561    03 WKS-HR-AR-SS               PIC 9(02).                      035800      
001562                                                                  035810      
001563 01 WKS-RESP-OPE                 PIC X(01).                       035820      
001564 01 WKS-BAN-HR                   PIC 9(01) VALUE 0.               035900      
001565 01 WKS-HR-AR-FORMATO.                                            036000      
001566    03 WKS-HH-MAQUINA            PIC 9(02).                       036100      
001567    03 WKS-DP1-MAQUINA           PIC X(01).                       036200      
001568    03 WKS-MM-MAQUINA            PIC 9(02).                       036300      
001569    03 WKS-DP2-MAQUINA           PIC X(01).                       036400      
001570    03 WKS-SS-MAQUINA            PIC 9(02).                       036500      
001571 01 WKS-HR-MAQUINA-RR      REDEFINES WKS-HR-AR-FORMATO PIC X(08). 036600      
001572 01 WKS-SEG-MAQUINA              PIC 9(08).                       036700      
001573 01 WKS-HR-DS.                                                    036800      
001574    03 WKS-HR-DS-HH              PIC 9(02).                       036900      
001575    03 WKS-HR-DS-MM              PIC 9(02).                       037000      
001576    03 WKS-HR-DS-SS              PIC 9(02).                       037100      
001577 01 WKS-HRS-ACT.                                                  037200      
001578    03 WKS-HR-ACT-HH              PIC 9(02).                      037300      
001579    03 WKS-HR-ACT-MM              PIC 9(02).                      037400      
001580    03 WKS-HR-ACT-SS              PIC 9(02).                      037500      
001581 01 WKS-HRS-FIN.                                                  037505      
001582    03 WKS-HR-FIN-HH              PIC 9(02).                      037510      
001583    03 WKS-HR-FIN-MM              PIC 9(02).                      037515      
001584    03 WKS-HR-FIN-SS              PIC 9(02).                      037520      
001585 01 WKS-HR-FIN                    PIC 9(08).                      037525      
001586 77 W77-LIMITE-ENVIOS             PIC 9(04) VALUE 300.            037600      
001587 77 W77-LIMITE-PENDIENTES         PIC 9(04) VALUE 150.            037700      
001588 77 W77-LIMITE-REINTENTOS         PIC 9(04) VALUE 050.            037800      
001589 77 W77-TEXTO-AUX-DISPLAY         PIC X(10).                      037900      
001590 77 W77-AUT-ENVIO500              PIC 9(08).                      038000      
001591 77 W77-STATUS-SERV               PIC 9(01) VALUE 0.              038100      
001592    88 W88-SER-INACT                VALUE 0.                      038200      
001593    88 W88-SER-ACT                  VALUE 1.                      038300      
001594 01 WKS-NUM-ENVIOS                PIC 9(08).                      038400      
001595 01 W77-FIN-ARCH                  PIC 9(01).                      038500      
001596 01 WKS-STATUS                    PIC 9(01).                      038600      
001597 01 WKS-STATUS-MONITOR            PIC 9(01).                      038700      
001598 01 WKS-MAS-PENDIENTES            PIC 9(01).                      038800      
001599 01 WKS-STATUS-CERO               PIC 9(01).                      038900      
001600 01 WKS-STATUS-CINCO              PIC 9(01).                      039000      
001601 01 WKS-ENV-PEN                   PIC 9(03).                      039100      
001602 01 WKS-ENV-REINT                 PIC 9(03).                      039200      
001603 01 WKS-DUPLICADO                 PIC 9(02).                      039300      
001604 01 WKS-DMCATEGORY                PIC 9(04).                      039400      
001605 01 WKS-DMERRORTYPE               PIC 9(04).                      039500      
001606 01 WKS-DMSTRUCTURE               PIC 9(04).                      039600      
001607 01 WKS-DMS-DSCERR                PIC X(140).                     039700      
001608 01 WS00-MIX                      PIC 9(07) VALUE 0.              039800      
001609 77 W77-RESULT-COMS               PIC 9(06).                      039900      
001610 01 WKS-ACA-DESTINO-AUX           PIC 9(06).                      040000      
001611 01 WKS-HDR-DEST-AUX              PIC 9(02).                      040020      
001612 01 WKS-HDR-ORI-AUX               PIC 9(02).                      040040      
001613* CONTADORES                                                      040100      
001614*************************************************************     040200      
001615 01 WKS-CONT-MSG-ENV             PIC 9(08) VALUE ZEROS.           040300      
001616 01 WKS-CONT-MSG-CANC            PIC 9(08) VALUE ZEROS.           040400      
001617 01 WRK-R01-FECMOV               PIC 9(08).                       040500      
001618 01 WKS-R01-FECMOV-AUX     REDEFINES  WRK-R01-FECMOV.             040600      
001619    03 WKS-FECMOV-CC-AUX         PIC 9(02).                       040700      
001620    03 WKS-FECMOV-6D-AUX         PIC 9(06).                       040800      
001621                                                                  040900      
001622 01 WKS-HORMAQ-HMSD               PIC 9(08).                      041000      
001623 01 WKS-HORA-R    REDEFINES WKS-HORMAQ-HMSD.                      041100      
001624    02  WKS-HORA-H               PIC 9(02).                       041200      
001625    02  WKS-HORA-M               PIC 9(02).                       041300      
001626    02  WKS-HORA-S               PIC 9(02).                       041400      
001627    02  WKS-HORA-D               PIC 9(02).                       041500      
001628                                                                  041600      
001629 01 WKS-R01-REFNUM.                                               041700      
001630    02 WKS-R01-FILER              PIC 9(06) COMP.                 041800      
001631    02 WKS-R01-REF-FECJUL         PIC 9(04) COMP.                 041900      
001632    02 WKS-R01-NUM-AUT702         PIC 9(08) COMP.                 042000      
001633                                                                  042100      
001634****************************************************************  042200      
001635*                   MENSAGE COMS                               *  042300      
001636****************************************************************  042400      
001637 01  WKS-REG-MSG               PIC X(534) WITH LOWER-BOUNDS.      042500      
001638 01  WKS-REG-MSG-R REDEFINES WKS-REG-MSG.                         042600      
001639     03  WKS-HDR-MSG.                                             042700      
001640         05  WKS-HDR-PREFIJO                      PIC X(001).     042800      
001641         05  WKS-HDR-APLDEST                      PIC X(001).     042900      
001642         05  WKS-HDR-CCRDEST                      PIC 9(002).     043000      
001643         05  WKS-HDR-LSNORGN                      PIC 9(004).     043100      
001644         05  WKS-HDR-LSNORGN-H                    REDEFINES       043200      
001645             WKS-HDR-LSNORGN                      PIC 9(08) COMP. 043300      
001646         05  WKS-HDR-STATION                      PIC X(008).     043400      
001647         05  WKS-HDR-STATION-R REDEFINES WKS-HDR-STATION.         043500      
001648             07  WKS-HDR-STA-TIPO                 PIC X(001).     043600      
001649             07  WKS-HDR-STA-SUC                  PIC 9(004).     043700      
001650             07  WKS-HDR-STA-PRIV                 PIC X(001).     043800      
001651             07  WKS-HDR-STA-CAJA                 PIC 9(002).     043900      
001652         05  WKS-HDR-CCRORGN                      PIC 9(002).     044000      
001653         05  WKS-HDR-COPORGN                      PIC 9(002).     044100      
001654         05  WKS-HDR-FACULTAD                     PIC X(002).     044200      
001655         05  WKS-HDR-APLORIG                      PIC X(001).     044300      
001656         05  WKS-HDR-RSLTDO                       PIC 9(002).     044400      
001657             88  W88-HDR-VINO-TERM            VALUE 11, 12.       044500      
001658             88  W88-HDR-VINO-APLI            VALUE 02, 04.       044600      
001659             88  W88-MSGRES-REDFOR            VALUE 12.           044700      
001660             88  W88-MSGRES-MAS               VALUE 3.            044800      
001661             88  W88-MSGRES-TER               VALUE 1.            044900      
001662             88  W88-MSGRES-ERR               VALUE 31, 32, 33.   045000      
001663         05  WKS-HDR-MASCARA                      PIC X(005).     045100      
001664         05  WKS-HDR-PASSWORD                     PIC X(006).     045200      
001665     03  WKS-MSG-TEXTO                            PIC X(498).     045300      
001666     03  WKS-MSG-TEXTO-R REDEFINES WKS-MSG-TEXTO.                 045400      
001667         05  WKS-ACA.                                             045500      
001668             10  WKS-ACA-DESTINO                  PIC 9(06).      045600      
001669             10  WKS-ACA-ORIGEN                   PIC 9(06).      045700      
001670         05  WKS-SA0.                                             045800      
001671             10  WKS-SA0-TRN-DEST                 PIC 9(09).      045900      
001672             10  WKS-SA0-TRN-DEST-R REDEFINES WKS-SA0-TRN-DEST.   046000      
001673                 15  WKS-SA0-TRN-DSIS             PIC 9(04).      046100      
001674                     88 W88-SA0-TRN-DSIS-S151     VALUE 0151.     046200      
001675                 15  WKS-SA0-TRN-DCOD             PIC 9(02).      046300      
001676                 15  WKS-SA0-TRN-DSCOD            PIC 9(03).      046400      
001677             10  WKS-SA0-TRN-ORIG                 PIC 9(09).      046500      
001678             10  WKS-SA0-TRN-DEST-O REDEFINES WKS-SA0-TRN-ORIG.   046600      
001679                 15  WKS-SA0-TRN-OSIS             PIC 9(04).      046700      
001680                     88 W88-SA0-TRN-OSIS-S702     VALUE 0702.     046800      
001681                 15  WKS-SA0-TRN-OCOD             PIC 9(02).      046900      
001682                 15  WKS-SA0-TRN-OSCOD            PIC 9(03).      047000      
001683             10  WKS-SA0-DIRECCION                PIC 9(01).      047100      
001684                 88  W88-SA0-ALTA                 VALUE  1.       047200      
001685                 88  W88-SA0-RESP                 VALUE  2.       047300      
001686                 88  W88-SA0-BAJA                 VALUE  3.       047400      
001687                 88  W88-SA0-RES-BAJA             VALUE  4.       047500      
001688             10  WKS-SA0-LONG                     PIC 9(04).      047600      
001689             10  WKS-SA0-TIEMPO-ESPERA            PIC 9(05).      047700      
001690             10  WKS-SA0-RESPUESTA                PIC 9(02).      047800      
001691         05  WKS-SA2.                                             047900      
001692             10  WKS-SA2-ID-FMT.                                  048000      
001693                 15 WKS-SA2-IDENT-FMT             PIC 9(02).      048100      
001694                 15 WKS-SA2-RECONOC               PIC 9(01).      048200      
001695             10  WKS-SA2-VERSION                  PIC X(01).      048300      
001696             10  WKS-SA2-CLASE                    PIC 9(01).      048400      
001697             10  WKS-SA2-RESULTADO                PIC 9(01).      048500      
001698             10  WKS-SA2-MODO                     PIC 9(01).      048600      
001699             10  WKS-SA2-IDENTIFICACION.                          048700      
001700                 15  WKS-SA2-SUCURSAL             PIC 9(04).      048800      
001701                 15  WKS-SA2-IDEN-CAJA            PIC 9(03).      048900      
001702                 15  WKS-SA2-IDEN-CAJA-R                          049000      
001703                                   REDEFINES WKS-SA2-IDEN-CAJA.   049100      
001704                     20 WKS-SA2-PRIV              PIC X(01).      049200      
001705                     20 WKS-SA2-CAJA              PIC 9(02).      049300      
001706                 15  WKS-SA2-TRN-NUM              PIC 9(08).      049400      
001707                 15  WKS-SA2-FEC-HR               PIC 9(12).      049500      
001708                 15  WKS-SA2-FEC-HR-R REDEFINES  WKS-SA2-FEC-HR.  049600      
001709                     20 WKS-SA2-FECHA             PIC 9(06).      049700      
001710                     20 WKS-SA2-HORA              PIC 9(06).      049800      
001711             10  WKS-SA2-MODALIDAD                PIC 9(02).      049900      
001712             10  WKS-SA2-IEFE-NOPE                PIC X(10).      050000      
001713             10  WKS-SA2-IEFE-NOPE-R              REDEFINES       050100      
001714                 WKS-SA2-IEFE-NOPE.                               050200      
001715                 15  WKS-SA2-INDEFECTIVO          PIC X(01).      050300      
001716                 15  WKS-SA2-FILLER               PIC X(01).      050400      
001717                 15  WKS-SA2-OPERADOR             PIC X(08).      050500      
001718             10  WKS-SA2-VER-OPC                  PIC X(01).      050600      
001719         05  WKS-AREA-USUARIO                    PIC X(409).      050700      
001720                                                                  050800      
001721 01 WKS-AREA-MSG-OBL                             PIC X(409).      050900      
001722 01 WKS-AREA-MSG-OBL-DOMI REDEFINES WKS-AREA-MSG-OBL.             051000      
001723    05  MSG-R01-CONTRATO                         PIC 9(16).       051100      
001724    05  MSG-R01-CVEMDA                           PIC 9(04).       051200      
001725    05  MSG-R01-MDA-SUC                          PIC 9(04).       051300      
001726    05  MSG-R01-MDA-CTA                          PIC 9(16).       051400      
001727    05  MSG-R01-AUTORIZA                         PIC 9(08).       051500      
001728    05  MSG-R01-REFNUM.                                           051600      
001729        10 MSG-R01-FECJUL                        PIC 9(04).       051700      
001730        10 MSG-R01-AUT702                        PIC 9(08).       051800      
001731    05  MSG-R01-AUT-S151                         PIC 9(08).       051900      
001732    05  MSG-R01-FECMOV                           PIC 9(06).       052000      
001733    05  MSG-R01-CVETRAN                          PIC 9(04).       052100      
001734    05  MSG-R01-OCCUR                            PIC 9(02).       052200      
001735    05  MSG-R01-IMPORTE                          PIC 9(14)V99.    052300      
001736    05  MSG-R01-ERROR                            PIC 9(04).       052400      
001737    05  FILLER                                   PIC X(309).      052500      
001738                                                                  052600      
001739                                                                  052700      
001740 01 WKS-NUM-TRANS.                                                052800      
001741    05 WKS-NUM-TRANS-OCCURS        PIC 9(01).                     052900      
001742    05 WKS-NUM-TRANS-AUTS151       PIC 9(07).                     053000      
001743                                                                  053100      
001744 01 WKS-DATOS-HOST.                                               053200      
001745    03 WKS-NUMCSI-HOST           PIC 9(02).                       053300      
001746    03 WKS-NOMEQUIPO             PIC X(10).                       053400      
001747    03 WKS-NOMCSI                PIC X(26).                       053500      
001748    03 WKS-LINEA-BATCH           PIC X(05).                       053600      
001749                                                                  053700      
001750 01 WKS-CSIDEST                  PIC 9(02).                       053800      
001751 01 W77-RESULT-B01               PIC 9(08).                       053900      
001752 77 W77-ERROR                    PIC 9(02).                       054000      
001753 01 W77-FIN                      PIC 9(04).                       054100      
001754 77 W77-CONTROL                  PIC 9(02) VALUE ZEROS.           054200      
001755 01 WKS-FIN-RECEIVE              PIC 9(01).                       054300      
001756 01 WKS-BASURA                   PIC X(10).                       054400      
001757 01 WKS-ESPERACOMS-TIPO-EVENTO   PIC 9(11).                       054500      
001758 01 WKS-COMS-IN-STATUS-KEY       PIC X(22).                       054600      
001759                                                                  054700      
001760 01 W77-INTENTO-BD               PIC 9(02).                       054800      
001761 01 CONT-REG-DISPLAY             PIC 9(06).                       054900      
001762 77 W77-NUMREG-MOV500            PIC 9(08).                       055000      
001763 77 W77-NUMREG-CTL               PIC 9(08).                       055100      
001764 01 WKS-NUM-OCCURS               PIC 9(02).                       055200      
001765                                                                  055300      
001766* CAMPOS PARA LIBRERIA DE FECHAS LOCSUP                           055400      
001767 77 WKS-FORMATO                     PIC   S9(11)  BINARY.         055500      
001768 77 WKS-FUNCION                     PIC   S9(11)  BINARY.         055600      
001769 01 WKS-FECHA1                      PIC   9(08).                  055700      
001770 01 WKS-FECHA2                      PIC   9(08).                  055800      
001771                                                                  055900      
001772 01 WKS-R01-FECMOV                PIC 9(06).                      056000      
001773 01 WKS-R01-CONTRATO              PIC 9(16).                      056100      
001774 01 WKS-R01-AUT-S151              PIC 9(08).                      056200      
001775 01 WKS-AUT-AELIM-S151            PIC 9(08).                      056300      
001776 01 WKS-AUT-ANT-S151              PIC 9(08).                      056400      
001777 01 WKS-PROC-CANCEL               PIC 9(02).                      056500      
001778 01 WKS-B10-HR-ENVIO              PIC 9(06).                      056600      
001779 01 WKS-NUM-CVETRANS              PIC 9(06).                      056700      
001780 01 WKS-EOF-B10                   PIC 9(01).                      056800      
001781* BANDERA PARA RUT RESETEA-HORA                                   056850      
001782 01 WKS-RESET-HORA                PIC 9(01) VA 0.                 056870      
001783 01 WKS-LOCK-OK                   PIC 9(01).                      056900      
001784                                                                  057000      
001785 LINKAGE SECTION.                                                 057100      
001786*================                                                 057200      
001787 01 WKS-COMS-MY-PROGRAM-NAME     PIC X(0018).                     057300      
001788 77 W77-COMS-MY-PROGRAM-DESG     REAL.                            057400      
001789                                                                  057500      
001790 01 WKS-COMS-EX-AGENDA-NAME.                                      057600      
001791    03 FILLER                    PIC X(01) VALUE   "S".           057700      
001792    03 WKS-COMS-EX-AGENDA-SIS    PIC 9(03) VALUE   151.           057800      
001793    03 WKS-COMS-EX-AGENDA-MOD    PIC 9(02) VALUE    13.           057900      
001794                                                                  058000      
001795 77 W77-COMS-EX-AGENDA-DESG      REAL.                            058100      
001796                                                                  058200      
001797 01 WKS-COMS-AG-SALIDA-NAME      PIC X(50).                       058300      
001798 77 W77-COMS-AG-SALIDA-DESG      REAL.                            058400      
001799 77 W77-COMS-RESULT              PIC S9(011) BINARY.              058500      
001800    88 W88-COMS-OK               VALUE     0.                     058600      
001801 01 WKS-COMS-DEFSTATION-NAME     PIC X(18).                       058700      
001802 77 W77-COMS-DEFSTATION-DESG     REAL.                            058800      
001803 01 WKS-NOAPLINCLUDE-PARAMETRO   PIC  X(30).                      058900      
001804 77 W77-NOAPLINCLUDE-DESG        REAL.                            059000      
001805 77 W77-NOAPL-RESULT             PIC S9(11) BINARY.               059100      
001806    88 W88-NOAPL-OK              VALUE 0.                         059200      
001807 77 W77-ACEPTA-MSG               PIC S9(11) BINARY.               059300      
001808    88 W88-ACEPTA-MSG            VALUE 1.                         059400      
001809 77 W77-ESPERACOMS-TIEMPO        PIC S9(11) BINARY VALUE 5.       059500      
001810 77 W77-ESPERACOMS-NUM           PIC 9(11).                       059600      
001811 77 W77-ESPERACOMS-TIPO-EVENTO   PIC S9(11) BINARY.               059700      
001812    88 W88-POR-MSG               VALUE  1.                        059800      
001813    88 W88-POR-ACCEPT            VALUE  2.                        059900      
001814    88 W88-POR-HI                VALUE  3.                        060000      
001815    88 W88-POR-TIMEOUT           VALUE  4.                        060100      
001816    88 W88-POR-EVENTO            VALUE  5.                        060200      
001817 01 WKS-TIPO-EVENTO              PIC 9(02).                       060300      
001818 77 W77-EVENTO                   USAGE IS EVENT.                  060400      
001819 01 WKS-SMCOMS-COMANDO.                                           060500      
001820    03 WKS-SMCOMS-STRING1        PIC X(20).                       060600      
001821    03 WKS-SMCOMS-STRING2        PIC X(20).                       060700      
001822 01 WKS-SMCOMS-TRABAJO           PIC X(132).                      060800      
001823 77 W77-SMCOMS-RESULT            PIC S9(11) BINARY.               060900      
001824    88 W88-SMCOMS-OK             VALUE 0.                         061000      
001825 77 W77-STATUS-KEY               PIC 9(04).                       061100      
001826                                                                  061200      
001827 77 W77-LLAVE                    PIC 9(08) VALUE ZERO.            061300      
001828 77 W77-MOV-NIVDES               PIC 9(08) VALUE ZERO.            061400      
001829 01 WKS-SEC-REF-CTE              PIC X(10) VALUE ZERO.            061500      
001830                                                                  061600      
001831 COMMUNICATION SECTION.                                           061700      
001832 INPUT  HEADER COMS-IN;                                           061800      
001833        PROGRAMDESG              IS CS-COMS-IN-PROGRAM;           061900      
001834        FUNCTIONSTATUS           IS CS-COMS-IN-FUNCTION-STATUS;   062000      
001835        FUNCTIONINDEX            IS CS-COMS-IN-FUNCTION-INDEX;    062100      
001836        USERCODE                 IS CS-COMS-IN-USERCODE;          062200      
001837        SECURITYDESG             IS CS-COMS-IN-SECURITY-DESG;     062300      
001838        TRANSPARENT              IS CS-COMS-IN-TRANSPARENT;       062400      
001839        VTFLAG                   IS CS-COMS-IN-VT-FLAG;           062500      
001840        TIMESTAMP                IS CS-COMS-IN-TIMESTAMP;         062600      
001841        STATION                  IS CS-COMS-IN-STATION;           062700      
001842        TEXTLENGTH               IS CS-COMS-IN-TEXT-LENGTH;       062800      
001843        STATUSVALUE              IS CS-COMS-IN-STATUS-KEY;        062900      
001844        MESSAGECOUNT             IS CS-COMS-IN-MSG-COUNT;         063000      
001845        RESTART                  IS CS-COMS-IN-RST-LOC;           063100      
001846        AGENDA                   IS CS-COMS-IN-AGENDA.            063200      
001847 OUTPUT HEADER COMS-OUT;                                          063300      
001848        DESTCOUNT              IS CS-COMS-OUT-COUNT;              063400      
001849        TEXTLENGTH             IS CS-COMS-OUT-TEXT-LENGTH;        063500      
001850        STATUSVALUE            IS CS-COMS-OUT-STATUS-KEY;         063600      
001851        TRANSPARENT            IS CS-COMS-OUT-TRANSPARENT;        063700      
001852        VTFLAG                 IS CS-COMS-OUT-VT-FLAG;            063800      
001853        CONFIRMFLAG            IS CS-COMS-OUT-CONFIRM-FLAG;       063900      
001854        CONFIRMKEY             IS CS-COMS-OUT-CONFIRM-KEY;        064000      
001855        DESTINATIONDESG        IS CS-COMS-OUT-DESTINATION;        064100      
001856        NEXTINPUTAGENDA        IS CS-COMS-OUT-NEXT-INPUT-AGENDA;  064200      
001857        SETNEXTINPUTAGENDA     IS CS-COMS-OUT-SNEXT-INPUT-AGENDA; 064300      
001858        RETAINTRANSACTIONMODE  IS CS-COMS-OUT-SAVE-TRANS-MODE;    064400      
001859        AGENDA                 IS CS-COMS-OUT-AGENDA.             064500      
001860 PROCEDURE DIVISION.                                              064600      
001861 DECLARATIVES.                                                    064700      
001862 INTERRUPT-BY-HI SECTION.                                         064800      
001863     USE AS INTERRUPT PROCEDURE.                                  064900      
001864 000A-BEGIN-INTERRUPT.                                            065000      
001865    DISALLOW INTERRUPT.                                           065100      
001866    MOVE "I"                           TO TIPO-LJ.                065200      
001867    MOVE 050104                        TO CODIGO-LJ.              065300      
001868    MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-HI2.                065400      
001869    MOVE WKS-HI2 TO W77-HI.                                       065500      
001870    MOVE LOW-VALUES  TO W77-TEXTO-AUX-DISPLAY                     065600      
001871                        WKS-DIS-TEXTO                             065700      
001872                        TEXTO-LJ.                                 065800      
001873    IF W88-HI-1                                                   065900      
001874       PERFORM 000100-MUESTRA-ESTADISTICO                         066000      
001875    ELSE                                                          066100      
001876    IF W88-HI-2                                                   066200      
001877       MOVE " SE ENCIENDE MONITOR "                               066300      
001878                             TO TEXTO-LJ WKS-DIS-TEXTO            066400      
001879       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        066500      
001880       PERFORM 010630-DISPLAY                                     066600      
001881       PERFORM 022119-ENCIENDE-MONITOR                            066700      
001882    ELSE                                                          066800      
001883    IF W88-HI-3                                                   066900      
001884       MOVE " SE APAGA MONITOR " TO TEXTO-LJ WKS-DIS-TEXTO        067000      
001885       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        067100      
001886       PERFORM 010630-DISPLAY                                     067200      
001887       PERFORM 022120-APAGA-MONITOR                               067300      
001888    ELSE                                                          067400      
001889    IF W88-HI-4 OR W88-HI-6                                       067500      
001890       PERFORM 800100-HI-SALIDA                                   067600      
001891    ELSE                                                          067700      
001892    IF HI-14                                                      067800      
001893       PERFORM 000100-HI14                                        067900      
001894    ELSE                                                          068000      
001895    IF HI-15                                                      068100      
001896       PERFORM 000100-HI15                                        068200      
001897    ELSE                                                          068300      
001898    IF HI-16                                                      068400      
001899       PERFORM 000100-HI16                                        068500      
001900    ELSE                                                          068600      
001901    IF W88-HI-17                                                  068700      
001902       ADD  1 TO W77-ESPERACOMS-TIEMPO                            068800      
001903       MOVE " SE INCREMENTA EN 1 EL ESPERACOMS"                   068900      
001904                          TO TEXTO-LJ WKS-DIS-TEXTO               069000      
001905    ELSE                                                          069100      
001906    IF W88-HI-18                                                  069200      
001907       SUBTRACT 1 FROM W77-ESPERACOMS-TIEMPO                      069300      
001908       MOVE " SE DECREMENTA EN 1 EL ESPERACOMS "                  069400      
001909                           TO TEXTO-LJ WKS-DIS-TEXTO              069500      
001910    ELSE                                                          069600      
001911    IF W88-HI-19                                                  069700      
001912       MOVE 5 TO W77-ESPERACOMS-TIEMPO                            069800      
001913       MOVE " RESTABLECE EL VALOR DE ESPERACOMS "                 069900      
001914                           TO TEXTO-LJ WKS-DIS-TEXTO              070000      
001915    ELSE                                                          070100      
001916    IF W88-HI-25                                                  070200      
001917       MOVE "  SE ACTIVO CAMBIO DE DIA "                          070300      
001918                     TO TEXTO-LJ WKS-DIS-TEXTO                    070400      
001919    ELSE                                                          070500      
001920    IF W88-HI-80                                                  070600      
001921       MOVE "  SE ACTIVO LLENADO DE CATALOGO "                    070700      
001922                          TO TEXTO-LJ WKS-DIS-TEXTO               070800      
001923    ELSE                                                          070900      
001924    IF W88-HI-12                                                  071000      
001925       MOVE 1 TO W77-STATUS-SERV                                  071100      
001926       MOVE "  SE ACTIVO INICIO DE SERVICIO DEL PROGRAMA"         071200      
001927                          TO TEXTO-LJ WKS-DIS-TEXTO               071300      
001928       PERFORM 021650-ACTUALIZA-CTRL-SERV                         071400      
001929    ELSE                                                          071500      
001930    IF W88-HI-13                                                  071600      
001931       MOVE 0 TO W77-STATUS-SERV                                  071700      
001932       MOVE 0 TO WKS-MAS-PENDIENTES                               071750      
001933       MOVE "  SE ACTIVO EL FIN DE SERVICIO DEL PROGRAMA"         071800      
001934                          TO TEXTO-LJ WKS-DIS-TEXTO               071900      
001935       PERFORM 021650-ACTUALIZA-CTRL-SERV                         072000      
001936    ELSE                                                          072100      
001937       MOVE " ERROR DE HI, HI NO VALIDO O NO IDENTIFICADO"        072200      
001938                                        TO TEXTO-LJ WKS-DIS-TEXTO.072300      
001939                                                                  072400      
001940    IF W88-HI-1 OR W88-HI-2 OR W88-HI-3 OR W88-HI-25              072500      
001941       OR W88-HI-4 OR W88-HI-6                                    072600      
001942       NEXT SENTENCE                                              072700      
001943    ELSE                                                          072800      
001944       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        072900      
001945       PERFORM 010630-DISPLAY.                                    073000      
001946                                                                  073100      
001947    CHANGE ATTRIBUTE TASKVALUE OF MYSELF TO 0.                    073200      
001948    ALLOW INTERRUPT.                                              073300      
001949 0000A-END.                                                       073400      
001950 END DECLARATIVES.                                                073500      
001951 000000-INICIO-PGMA SECTION.                                      073600      
001952 000000-INICIA.                                                   073700      
001953    MOVE "S151"                        TO SISTEMA-LJ.             073800      
001954    MOVE "P013"                        TO PASO-LJ.                073900      
001955    MOVE  02                           TO MTP-LJ.                 074000      
001956    MOVE "I"                           TO TIPO-LJ.                074100      
001957    MOVE 050104                        TO CODIGO-LJ.              074200      
001958    PERFORM 010000-INICIO.                                        074300      
001959    PERFORM 020000-PROCESO UNTIL W77-FIN = 1.                     074400      
001960    MOVE LOW-VALUES                 TO WKS-B05PROCESOS.           074500      
001961    MOVE 22                         TO WKS-B05-FUNCION.           074600      
001962    MOVE 151                        TO WKS-B05-SISTEMA.           074700      
001963    MOVE 13                         TO WKS-B05-FCHPRO             074800      
001964                                       WKS-B05-NUMPRO.            074900      
001965    PERFORM 011100-CALLB05.                                       075000      
001966    PERFORM 999999-FIN.                                           075100      
001967    CLOSE L01-DISPLAY WITH SAVE.                                  075200      
001968    STOP RUN.                                                     075300      
001969                                                                  075400      
001970 010000-INICIO.                                                   075500      
001971*=========================================                        075600      
001972     PERFORM 010100-TASKFILE.                                     075700      
001973     PERFORM 010200-LIBRERIAS.                                    075800      
001974     PERFORM 010300-COMS.                                         075900      
001975     PERFORM 010400-ARCHIVOS.                                     076000      
001976     PERFORM 010500-OPN-TSKFILE.                                  076100      
001977     PERFORM 010600-CATALOGO.                                     076200      
001978                                                                  076300      
001979     ALLOW INTERRUPT.                                             076400      
001980     ATTACH INTERRUPT-BY-HI            TO ATTRIBUTE EXCEPTIONEVENT076500      
001981                                       OF MYSELF .                076600      
001982     MOVE    1              TO    W77-FIN.                        076700      
001983     PERFORM 010700-ABRE-BD UNTIL W77-FIN = 0                     076800      
001984                     OR W77-INTENTO-BD > 6.                       076900      
001985     IF W77-FIN = 1                                               077000      
001986        MOVE "ERROR AL ABRIR BASE S151BD13BIFIN" TO WKS-DMS-DSCERR077100      
001987        PERFORM 010800-DMTERMINATE.                               077200      
001988                                                                  077300      
001989     IF  W77-FIN = ZERO                                           077400      
001990         PERFORM 010900-LLENAR-DAT-SERVS                          077500      
001991         PERFORM 011000-VALIDA-B05                                077600      
001992         PERFORM 011100-BUSCAR-LIM-ENV                            077700      
001993         PERFORM 011100-VALIDA-CSI                                077800      
001994         PERFORM 011200-PROYECTA-HABIL-ANT                        077900      
001995         PERFORM 011300-IMP-HRS.                                  078000      
001996                                                                  078100      
001997 010100-TASKFILE.                                                 078200      
001998*=========================================                        078300      
001999    MOVE ZERO                          TO W77-FIN.                078400      
002000    MOVE "/"                           TO WKS-DIAGONAL1           078500      
002001                                          WKS-DIAGONAL2.          078600      
002002    ACCEPT WKS-FECHA-MAQUINA           FROM TODAYS-DATE.          078700      
002003    MOVE WKS-FECMAQ-CC                 TO WKS-CC-MAQ.             078800      
002004    MOVE WKS-FECMAQ-AA                 TO WKS-AA-MAQ.             078900      
002005    MOVE WKS-FECMAQ-MM                 TO WKS-MM-MAQ.             079000      
002006    MOVE WKS-FECMAQ-DD                 TO WKS-DD-MAQ.             079100      
002007    MOVE WKS-FECHA-MAQ-8D              TO WKS-FECHA-MAQ-ANT-8D.   079200      
002008                                                                  079300      
002009 010200-LIBRERIAS.                                                079400      
002010*=========================================                        079500      
002011    CHANGE ATTRIBUTE LIBACCESS         OF "CTRLVERS"              079600      
002012                                       TO BYFUNCTION.             079700      
002013    CHANGE ATTRIBUTE FUNCTIONNAME      OF "CTRLVERS"              079800      
002014                                       TO "CTLVERS".              079900      
002015    CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION.      080000      
002016    CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP".        080100      
002017    CHANGE ATTRIBUTE TITLE             OF "LIB-DISP"              080200      
002018       TO "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".        080300      
002019                                                                  080400      
002020*****************      LIGA S080 CONCEPTOS   *******************  080500      
002021    MOVE "S080BD01CON"                 TO     WKS-CTLVER-LIBID.   080600      
002022    CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID    080700      
002023                                              WKS-CTLVER-NOMLIB   080800      
002024                                       GIVING W77-CTLVER-RESULT.  080900      
002025     IF W77-CTLVER-RESULT = 0                                     081000      
002026        CHANGE ATTRIBUTE TITLE OF "S080L710"                      081100      
002027                                       TO     WKS-CTLVER-NOMLIB.  081200      
002028                                                                  081300      
002029*********** OBTIENE NOMBRE DEL ARCHIVO DE MOVS500 *************** 081400      
002030    MOVE "S151L001CTL"                 TO     WKS-CTLVER-LIBID.   081500      
002031    CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID    081600      
002032                                              WKS-CTLVER-NOMLIB   081700      
002033                                       GIVING W77-CTLVER-RESULT.  081800      
002034    IF W77-CTLVER-RESULT = 0                                      081900      
002035       CHANGE ATTRIBUTE TITLE         OF "S151-L001"              082000      
002036                                      TO WKS-CTLVER-NOMLIB        082100      
002037    ELSE                                                          082200      
002038       CHANGE ATTRIBUTE TITLE         OF "S151-L001" TO           082300      
002039              "(S151)S151/OBJECT/L001/CONTROL ON CMEMP.".         082400      
002040    PERFORM 010200-OBTEN-FEC-CONT.                                082500      
002041                                                                  082600      
002042 010200-OBTEN-FEC-CONT.                                           082700      
002043*=========================================                        082800      
002044    MOVE LOW-VALUES                   TO WKS-S151B01SISDIA.       082900      
002045    MOVE ZERO                         TO W77-RESULT-B01.          083000      
002046    MOVE 500                          TO WKS-B01-SISTEMA.         083100      
002047    MOVE 01                           TO WKS-B01-FUNCION.         083200      
002048    CALL "CONSISDIA IN S151-L001"     USING  WKS-S151B01SISDIA    083300      
002049                                      GIVING W77-RESULT-B01.      083400      
002050                                                                  083500      
002051    IF W77-RESULT-B01 > 0                                         083600      
002052       MOVE W77-RESULT-B01            TO W77-ERROR                083700      
002053       STRING "NO PUEDO OBTENER FECHA DE PROCESO "                083800      
002054              " ERROR EN S151-L001 S500, ERR #" W77-ERROR         083900      
002055       DELIMITED BY SIZE INTO TEXTO-LJ                            084000      
002056       MOVE "O"                       TO TIPO-LJ                  084100      
002057       MOVE 020901                    TO CODIGO-LJ                084200      
002058       CALL "LJ IN LIB-DISP"          USING CONTADOR-LJ,          084300      
002059                                            MENSAJE-LJ            084400      
002060       SET MYSELF(STATUS) TO -1                                   084500      
002061    ELSE                                                          084600      
002062       MOVE WKS-B01-NOMPACMOV         TO WKS-PACK-MOVS            084700      
002063       MOVE WKS-B01-FECCON            TO WKS-FECHA-PROCESO.       084800      
002064                                                                  084900      
002065  010300-COMS.                                                    085000      
002066*=========================================                        085100      
002067     CHANGE ATTRIBUTE LIBACCESS         OF "SOPORTECOMS"          085200      
002068                                        TO BYFUNCTION.            085300      
002069     CHANGE ATTRIBUTE FUNCTIONNAME      OF "SOPORTECOMS"          085400      
002070                                        TO "SOPORTECOMS".         085500      
002071                                                                  085600      
002072     CHANGE ATTRIBUTE LIBACCESS         OF "DCILIBRARY"           085700      
002073                                        TO  BYFUNCTION.           085800      
002074     CHANGE ATTRIBUTE FUNCTIONNAME      OF "DCILIBRARY"           085900      
002075                                        TO "COMSSUPPORT".         086000      
002076     ENABLE INPUT COMS-IN    KEY "ONLINE".                        086100      
002077                                                                  086200      
002078* =============== VALIDACION DE AGENDA DE SALIDA =================086300      
002079     MOVE "OUTPUT OF LINEA"           TO WKS-COMS-AG-SALIDA-NAME. 086400      
002080     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               086500      
002081           USING  WKS-COMS-AG-SALIDA-NAME                         086600      
002082                  VALUE AGENDA                                    086700      
002083                  W77-COMS-AG-SALIDA-DESG                         086800      
002084           GIVING W77-COMS-RESULT.                                086900      
002085     IF W88-COMS-OK                                               087000      
002086        NEXT SENTENCE                                             087100      
002087     ELSE                                                         087200      
002088        PERFORM 900000-FIN-MAL.                                   087300      
002089                                                                  087400      
002090     MOVE CS-COMS-IN-PROGRAM          TO W77-COMS-MY-PROGRAM-DESG.087500      
002091     CALL "GET-NAME-USING-DESIGNATOR OF DCILIBRARY"               087600      
002092           USING  W77-COMS-MY-PROGRAM-DESG                        087700      
002093                  WKS-COMS-MY-PROGRAM-NAME                        087800      
002094           GIVING W77-COMS-RESULT.                                087900      
002095     IF W88-COMS-OK                                               088000      
002096        NEXT SENTENCE                                             088100      
002097     ELSE                                                         088200      
002098        PERFORM 900000-FIN-MAL.                                   088300      
002099* =============== DESIGNACION DE ESTACION DEFAULT  =============  088400      
002100     MOVE "DEFAULTSTATION"            TO WKS-COMS-DEFSTATION-NAME 088500      
002101     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               088600      
002102           USING  WKS-COMS-DEFSTATION-NAME                        088700      
002103           VALUE  STATION                                         088800      
002104                  W77-COMS-DEFSTATION-DESG                        088900      
002105           GIVING W77-COMS-RESULT.                                089000      
002106     IF W88-COMS-OK                                               089100      
002107        NEXT SENTENCE                                             089200      
002108     ELSE                                                         089300      
002109        PERFORM 900000-FIN-MAL.                                   089400      
002110                                                                  089500      
002111     CALL "CSIID OF SOPORTECOMS"       USING WKS-DATOS-HOST.      089600      
002112                                                                  089700      
002113 010400-ARCHIVOS.                                                 089800      
002114*=========================================                        089900      
002115    ACCEPT  WKS-HR-AR         FROM TIME.                          090000      
002116    MOVE WKS-HR-AR-HH         TO WKS-HH-MAQUINA.                  090100      
002117    MOVE WKS-HR-AR-MM         TO WKS-MM-MAQUINA.                  090200      
002118    MOVE WKS-HR-AR-SS         TO WKS-SS-MAQUINA.                  090300      
002119    MOVE WKS-FECPRO-6D                 TO WKS-MOVS-FECHA          090400      
002120                                          WKS-FECHA-ENV           090500      
002121                                          WKS-RUT-DIS-FCH         090600      
002122                                          WKS-RUT-MON-FCH.        090700      
002123    MOVE WKS-HR-AR                     TO WKS-RUT-DIS-HORA.       090800      
002124    MOVE "MTY"                         TO WKS-RUT-DIS-CSI         090900      
002125                                          WKS-RUT-MON-CSI.        091000      
002126                                                                  091100      
002127    IF WKS-NUMCSI-HOST = 10                                       091200      
002128       MOVE "VDM"                      TO WKS-RUT-DIS-CSI         091300      
002129                                          WKS-RUT-MON-CSI.        091400      
002130    CHANGE ATTRIBUTE TITLE             OF A01-MOVS500             091500      
002131                                       TO WKS-TITLE-MOVS500.      091600      
002132    CHANGE ATTRIBUTE TITLE             OF A02-CTL-DM              091700      
002133                                       TO WKS-TITLE-CTLENV.       091800      
002134    CHANGE ATTRIBUTE NEWFILE OF L01-DISPLAY TO VALUE FALSE.       091900      
002135    CHANGE ATTRIBUTE TITLE             OF L01-DISPLAY             092000      
002136                                       TO WKS-TITLE-DISPLAY.      092100      
002137                                                                  092200      
002138   IF  ATTRIBUTE RESIDENT  OF L01-DISPLAY  = VALUE TRUE           092300      
002139        OPEN EXTEND L01-DISPLAY                                   092400      
002140   ELSE                                                           092500      
002141        OPEN OUTPUT L01-DISPLAY                                   092600      
002142        ADD   1  TO  CONT-REG-DISPLAY                             092700      
002143        WRITE REG-DISPLAY       FROM REGISTRO-DIS-HEADER.         092800      
002144                                                                  092900      
002145   IF ATTRIBUTE RESIDENT OF A02-CTL-DM = VALUE TRUE               093000      
002146      OPEN I-O A02-CTL-DM                                         093100      
002147      PERFORM 021100-LEE-CONTROL                                  093200      
002148   ELSE                                                           093300      
002149      PERFORM 021100-CREA-CONTROL                                 093400      
002150      OPEN I-O A02-CTL-DM.                                        093500      
002151                                                                  093600      
002152 010410-VAL-SER.                                                  093700      
002153*=========================================                        093800      
002154   IF W88-SER-ACT                                                 093900      
002155      MOVE 1                          TO R01-REG-SER              094000      
002156   ELSE                                                           094100      
002157      MOVE 0                          TO R01-REG-SER.             094200      
002158                                                                  094300      
002159 010500-OPN-TSKFILE.                                              094400      
002160*=========================================                        094500      
002161    MOVE WKS-FECHA-MAQ-6D         TO WKS-TSK-FECHA.               094600      
002162    MOVE WKS-NUMCSI-HOST          TO WKS-TSK-NODO .               094700      
002163    MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WKS-TSK-MXNB.           094800      
002164    SET MYSELF (OPTION)           TO 1926.                        094900      
002165    SET MYSELF (FILECARDS)        TO WKS-TIT-TASKFILE.            095000      
002166                                                                  095100      
002167 010600-CATALOGO.                                                 095200      
002168*=========================================                        095300      
002169     MOVE 151                         TO W77-L710-SISTEMA.        095400      
002170     MOVE 13                          TO W77-L710-PROGRAMA.       095500      
002171     MOVE 6                           TO WKS-EL710-CAT.           095600      
002172     MOVE 20                          TO WKS-EL710-CLAVE.         095700      
002173     MOVE 10                          TO WKS-EL710-REGISTROS.     095800      
002174     MOVE 2                           TO WKS-EL710-BUSQUEDA.      095900      
002175     MOVE ZERO                        TO WKS-EL710-LLAVE1.        096000      
002176     MOVE 500                         TO WKS-EL710-LLAVE2.        096100      
002177     MOVE ZERO                        TO WKS-EL710-LLAVE3         096200      
002178                                         WKS-EL710-LLAVE4         096300      
002179                                         WKS-EL710-LLAVE5         096400      
002180                                         WKS-EL710-LLAVE6         096500      
002181                                         WKS-EL710-FECINI         096600      
002182                                         WKS-EL710-NIVINI         096700      
002183                                         WKS-EL710-FEC-VIG.       096800      
002184     MOVE 0                           TO WKS-NUM-CVETRANS.        096900      
002185     MOVE ZERO                        TO W77-EOF.                 097000      
002186     PERFORM 010610-CLAVES-TRAN       UNTIL W77-EOF = 1.          097100      
002187                                                                  097200      
002188 010610-CLAVES-TRAN.                                              097300      
002189*=========================================                        097400      
002190     CALL "L710_CONSUL_DETALLE IN S080L710"                       097500      
002191          USING  W77-L710-SISTEMA,                                097600      
002192                 W77-L710-PROGRAMA,                               097700      
002193                 WKS-L710-ENT,                                    097800      
002194                 WKS-L710-SAL,                                    097900      
002195          GIVING W77-L710-RESULT.                                 098000      
002196                                                                  098100      
002197     IF W77-L710-RESULT = 0 OR 1                                  098200      
002198        PERFORM 010620-LLENA-CATALOGO                             098300      
002199                VARYING WKS-NUM-OCCURS FROM 1 BY 1                098400      
002200                UNTIL WKS-NUM-OCCURS > WKS-SL710-NUMREG           098500      
002201        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,1) TO WKS-EL710-LLAVE1098600      
002202        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,2) TO WKS-EL710-LLAVE2098700      
002203        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,3) TO WKS-EL710-LLAVE3098800      
002204        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,4) TO WKS-EL710-LLAVE4098900      
002205        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,5) TO WKS-EL710-LLAVE5099000      
002206        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,6) TO WKS-EL710-LLAVE6099100      
002207        MOVE WKS-SL710-NIVINI         TO WKS-EL710-NIVINI         099200      
002208        MOVE WKS-SL710-FECINI         TO WKS-EL710-FECINI         099300      
002209     ELSE                                                         099400      
002210        MOVE 1                        TO W77-EOF                  099500      
002211        MOVE W77-L710-RESULT          TO W77-ERR-CAT              099600      
002212        IF W77-ERR-CAT = 20                                       099700      
002213           IF WKS-NUM-CVETRANS = 0                                099800      
002214             MOVE  1                       TO  W77-FIN            099900      
002215             MOVE  "EN CAT 6 NO EXISTEN REG CON MARCA DM"         100000      
002216                                           TO TEXTO-LJ            100100      
002217              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 100200      
002218            MOVE                                                  100300      
002219            "EN CAT 6 NO EXISTEN REG CON MARCA DM, FIN DE PROGAMA"100400      
002220                                           TO WKS-DIS-TEXTO       100500      
002221              PERFORM 010630-DISPLAY                              100600      
002222           ELSE                                                   100700      
002223              NEXT SENTENCE                                       100800      
002224        ELSE                                                      100900      
002225           MOVE  1                   TO  W77-FIN                  101000      
002226           MOVE "I"                   TO TIPO-LJ                  101100      
002227           MOVE 020901                TO CODIGO-LJ                101200      
002228           STRING "ERROR AL LLAMAR S080BD01CON, RESULT = "        101300      
002229                  W77-ERR-CAT                                     101400      
002230           DELIMITED BY SIZE                                      101500      
002231           INTO TEXTO-LJ                                          101600      
002232           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ    101700      
002233           STRING "ERROR AL LLAMAR S080BD01CON, RESULT = "        101800      
002234                   W77-ERR-CAT             DELIMITED BY SIZE      101900      
002235                   " , FIN DE PROGRAMA "   DELIMITED BY SIZE      102000      
002236           INTO WKS-DIS-TEXTO                                     102100      
002237           PERFORM 010630-DISPLAY.                                102200      
002238                                                                  102300      
002239 010620-LLENA-CATALOGO.                                           102400      
002240*=========================================                        102500      
002241    MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,1) TO WKS-NUM-CVETRANS.     102600      
002242    IF  WKS-SL710-DAT(WKS-NUM-OCCURS,14) = 8                      102700      
002243     MOVE 1       TO WKS-CAT6-SERV3(WKS-NUM-CVETRANS)             102800      
002244     MOVE WKS-NUM-CVETRANS TO WKS-CAT6-CVETRAN(WKS-NUM-CVETRANS). 102900      
002245                                                                  103000      
002246 010900-LLENAR-DAT-SERVS.                                         103100      
002247*=========================================                        103200      
002248     MOVE 3      TO WKS-VAL-NUM-SERV(1).                          103300      
002249     MOVE 21600  TO WKS-VAL-HR-INI(1).                            103400      
002250     MOVE 220000 TO WKS-VAL-HR-FIN(1).                            103500      
002251     MOVE 0      TO WKS-VAL-DIA-HAB(1).                           103600      
002252     MOVE 070282 TO WKS-VAL-ACA-DES(1).                           103700      
002253     MOVE 0702   TO WKS-VAL-CVE-TRAN-DES-SIS(1).                  103800      
002254     MOVE 10     TO WKS-VAL-CVE-TRAN-DES-COD(1).                  103900      
002255     MOVE 001    TO WKS-VAL-CVE-TRAN-DES-SUB(1).                  104000      
002256     MOVE 0151   TO WKS-VAL-CVE-TRAN-OR-SIS(1).                   104100      
002257     MOVE 01     TO WKS-VAL-CVE-TRAN-OR-COD(1).                   104200      
002258     MOVE 003    TO WKS-VAL-CVE-TRAN-OR-SUB(1).                   104300      
002259     MOVE 0      TO WKS-VAL-CENTR(1).                             104400      
002260     MOVE 225    TO WKS-LONG-MSG(1).                              104500      
002261     MOVE 342    TO WKS-VAL-SUC(1).                               104600      
002262     MOVE 50     TO WKS-VAL-CAJA (1).                             104700      
002263     MOVE 2      TO WKS-VAL-RDO (1).                              104800      
002264     MOVE 60     TO WKS-VAL-TESP(1).                              104900      
002265     MOVE 1      TO WKS-VAL-MODO (1).                             105000      
002266                                                                  105100      
002267 011000-VALIDA-B05.                                               105200      
002268*=========================================                        105300      
002269     MOVE LOW-VALUES                 TO WKS-B05PROCESOS.          105400      
002270     MOVE 0                          TO W77-RESULT-LIBCON.        105500      
002271     MOVE 1                          TO WKS-B05-FUNCION.          105600      
002272     MOVE 151                        TO WKS-B05-SISTEMA.          105700      
002273     MOVE 13                         TO WKS-B05-FCHPRO.           105800      
002274     MOVE 13                         TO WKS-B05-NUMPRO.           105900      
002275     PERFORM 011100-CALLB05.                                      106000      
002276     IF W77-RESULT-LIBCON = 0                                     106100      
002277        MOVE 22                         TO WKS-B05-FUNCION        106200      
002278        PERFORM 011100-CALLB05.                                   106300      
002279                                                                  106400      
002280     MOVE 19                            TO WKS-B05-FUNCION.       106500      
002281     MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WS00-MIX.              106600      
002282     MOVE WS00-MIX                        TO WKS-B05-MIX.         106700      
002283     PERFORM 011100-CALLB05.                                      106800      
002284                                                                  106900      
002285  011100-CALLB05.                                                 107000      
002286*=========================================                        107100      
002287    MOVE 0                          TO W77-RESULT-LIBCON          107200      
002288    MOVE 151                        TO WKS-B05-SISTEMA            107300      
002289    CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS        107400      
002290                                    GIVING W77-RESULT-LIBCON.     107500      
002291                                                                  107600      
002292 011300-IMP-HRS.                                                  107700      
002293*=========================================                        107800      
002294     MOVE ":" TO WKS-DP1-MAQUINA                                  107900      
002295                 WKS-DP2-MAQUINA.                                 108000      
002296     MOVE SPACES TO TEXTO-LJ WKS-DIS-TEXTO.                       108100      
002297     STRING "HORA LEVANTAMIENTO DEL PROGRAMA  : "                 108200      
002298                           WKS-HR-MAQUINA-RR  DELIMITED BY SIZE   108300      
002299                           INTO WKS-DIS-TEXTO.                    108400      
002300     MOVE WKS-DIS-TEXTO    TO TEXTO-LJ.                           108500      
002301     CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         108600      
002302     PERFORM 010630-DISPLAY.                                      108700      
002303                                                                  108800      
002304 010630-DISPLAY.                                                  108900      
002305*=========================================                        109000      
002306    IF CONT-REG-DISPLAY = 6500                                    109100      
002307        CLOSE  L01-DISPLAY        WITH SAVE                       109200      
002308        ACCEPT WKS-HR-AR          FROM  TIME                      109300      
002309        MOVE   WKS-HR-AR          TO WKS-RUT-DIS-HORA             109400      
002310        CHANGE ATTRIBUTE TITLE    OF L01-DISPLAY                  109500      
002311                                  TO WKS-TITLE-DISPLAY            109600      
002312        OPEN  OUTPUT  L01-DISPLAY                                 109700      
002313        MOVE    1                 TO  CONT-REG-DISPLAY            109800      
002314        WRITE REG-DISPLAY         FROM REGISTRO-DIS-HEADER.       109900      
002315                                                                  110000      
002316    ADD    1                      TO  CONT-REG-DISPLAY            110100      
002317    ACCEPT WKS-HR-DS              FROM  TIME                      110200      
002318    MOVE   WKS-CC-MAQ             TO WKS-DIS-FECHA-S              110300      
002319    MOVE   WKS-AA-MAQ             TO WKS-DIS-FECHA-A              110400      
002320    MOVE   WKS-MM-MAQ             TO WKS-DIS-FECHA-M              110500      
002321    MOVE   WKS-DD-MAQ             TO WKS-DIS-FECHA-D              110600      
002322    MOVE   WKS-HR-DS-HH           TO WKS-DIS-HORA                 110700      
002323    MOVE   WKS-HR-DS-MM           TO WKS-DIS-MINUTO               110800      
002324    MOVE   WKS-DIS-TEXTO          TO WKS-DIS-MENSAJE              110900      
002325    WRITE  REG-DISPLAY FROM  REGISTRO-DIS-DETALLE.                111000      
002326                                                                  111100      
002327 010640-CIERRA-DISPLAY.                                           111200      
002328*=========================================                        111300      
002329   CLOSE S151BD13BIFIN                                            111400      
002330   ON EXCEPTION                                                   111500      
002331      MOVE "ERROR AL CERRAR BD S151BD13BIFIN"  TO WKS-DIS-TEXTO   111600      
002332      PERFORM 010630-DISPLAY.                                     111700      
002333   CLOSE L01-DISPLAY WITH SAVE                                    111800      
002334   PERFORM 022120-APAGA-MONITOR.                                  111900      
002335                                                                  112000      
002336 011100-BUSCAR-LIM-ENV.                                           112100      
002337*=========================================                        112200      
002338     MOVE LOW-VALUES                 TO WKS-B05PROCESOS.          112300      
002339     MOVE 0                          TO W77-RESULT-LIBCON.        112400      
002340     MOVE 1                          TO WKS-B05-FUNCION.          112500      
002341     MOVE 1                          TO WKS-B05-FCHPRO.           112600      
002342     MOVE 13                         TO WKS-B05-NUMPRO.           112700      
002343     PERFORM 011100-CALLB05.                                      112800      
002344     IF W77-RESULT-LIBCON = ZERO                                  112900      
002345        MOVE WKS-B05-HORAINI         TO W77-LIMITE-PENDIENTES     113000      
002346        MOVE WKS-B05-HORAFIN         TO W77-LIMITE-REINTENTOS     113100      
002347        MOVE WKS-B05-NUMREGINI       TO W77-LIMITE-ENVIOS         113200      
002348     ELSE                                                         113300      
002349        MOVE 19                      TO WKS-B05-FUNCION           113400      
002350        MOVE 0                       TO WKS-B05-MIX               113500      
002351        MOVE 13                      TO WKS-B05-NUMPRO            113600      
002352        MOVE 1                       TO WKS-B05-FCHPRO            113700      
002353                                        WKS-B05-NUMREGINI         113800      
002354        MOVE W77-LIMITE-PENDIENTES   TO WKS-B05-HORAINI           113900      
002355        MOVE W77-LIMITE-REINTENTOS   TO WKS-B05-HORAFIN           114000      
002356        MOVE W77-LIMITE-ENVIOS       TO WKS-B05-NUMREGFIN         114100      
002357        PERFORM 011100-CALLB05.                                   114200      
002358     IF W77-LIMITE-ENVIOS < 80                                    114300      
002359        MOVE 80 TO W77-LIMITE-ENVIOS.                             114400      
002360     IF W77-LIMITE-PENDIENTES < 40                                114500      
002361        MOVE 40 TO W77-LIMITE-PENDIENTES.                         114600      
002362     IF W77-LIMITE-REINTENTOS < 40                                114700      
002363        MOVE 40 TO W77-LIMITE-REINTENTOS.                         114800      
002364                                                                  114900      
002365 011100-VALIDA-CSI.                                               115000      
002366*=========================================                        115100      
002367    IF WKS-NOMEQUIPO = "VDMBETA."                                 115200      
002368       MOVE 24 TO WKS-HDR-CCRDEST WKS-CSIDEST                     115300      
002369    ELSE                                                          115400      
002370    IF WKS-NOMEQUIPO = "ACYPGAMA."  OR WKS-NOMEQUIPO = "MONALFA." 115500      
002371    OR WKS-NOMEQUIPO = "ACYPOMEGA." OR WKS-NOMEQUIPO = "VDMKAPPA."115600      
002372       MOVE 23 TO WKS-HDR-CCRDEST WKS-CSIDEST                     115700      
002373    ELSE                                                          115800      
002374       IF WKS-NUMCSI-HOST = 10                                    115900      
002375                MOVE 24 TO WKS-HDR-CCRDEST WKS-CSIDEST            116000      
002376       ELSE                                                       116100      
002377          IF WKS-NUMCSI-HOST = 4                                  116200      
002378                MOVE 23 TO WKS-HDR-CCRDEST WKS-CSIDEST.           116300      
002379                                                                  116400      
002380 010700-ABRE-BD.                                                  116500      
002381*=========================================                        116600      
002382    MOVE ZERO  TO  W77-FIN                                        116700      
002383    OPEN UPDATE S151BD13BIFIN                                     116800      
002384    ON EXCEPTION                                                  116900      
002385       MOVE     1                               TO W77-FIN        117000      
002386       ADD      1                               TO W77-INTENTO-BD 117100      
002387       WAIT(10).                                                  117200      
002388                                                                  117300      
002389 010800-DMTERMINATE.                                              117400      
002390*=========================================                        117500      
002391     MOVE DMSTATUS(DMCATEGORY)     TO WKS-DMCATEGORY.             117600      
002392     MOVE DMSTATUS(DMERRORTYPE)    TO WKS-DMERRORTYPE.            117700      
002393     MOVE DMSTATUS(DMSTRUCTURE)    TO WKS-DMSTRUCTURE.            117800      
002394     STRING WKS-DMCATEGORY         DELIMITED BY SIZE,             117900      
002395     WKS-DMERRORTYPE               DELIMITED BY SIZE,             118000      
002396     WKS-DMSTRUCTURE               DELIMITED BY SIZE,             118100      
002397     "  :  "                       DELIMITED BY SIZE,             118200      
002398     WKS-DMS-DSCERR                DELIMITED BY SIZE              118300      
002399                                   INTO WKS-DIS-TEXTO.            118400      
002400     PERFORM 010630-DISPLAY.                                      118500      
002401     MOVE SPACES                       TO TEXTO-LJ.               118600      
002402     STRING WKS-DMS-DSCERR DELIMITED BY SIZE                      118700      
002403                           INTO TEXTO-LJ.                         118800      
002404     CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         118900      
002405     PERFORM 8500000-ERROR-FATAL.                                 119000      
002406                                                                  119100      
002407 8500000-ERROR-FATAL.                                             119200      
002408*=========================================                        119300      
002409     MOVE SPACES TO WKS-DIS-TEXTO                                 119400      
002410     IF DMSTATUS (SYSTEMERROR)                                    119500      
002411        MOVE "SYSTEM ERROR" TO WKS-DIS-TEXTO                      119600      
002412        PERFORM 010630-DISPLAY                                    119700      
002413        PERFORM 999999-FIN                                        119800      
002414     ELSE                                                         119900      
002415     IF DMSTATUS (OPENERROR)                                      120000      
002416        MOVE "OPEN ERROR" TO WKS-DIS-TEXTO                        120100      
002417        PERFORM 010630-DISPLAY                                    120200      
002418        PERFORM 999999-FIN                                        120300      
002419     ELSE                                                         120400      
002420     IF DMSTATUS (CLOSEERROR)                                     120500      
002421        MOVE "CLOSE ERROR" TO WKS-DIS-TEXTO                       120600      
002422        PERFORM 010630-DISPLAY                                    120700      
002423        PERFORM 999999-FIN                                        120800      
002424     ELSE                                                         120900      
002425     IF DMSTATUS (AUDITERROR)                                     121000      
002426        MOVE "AUDIT ERROR" TO WKS-DIS-TEXTO                       121100      
002427        PERFORM 010630-DISPLAY                                    121200      
002428        PERFORM 999999-FIN                                        121300      
002429     ELSE                                                         121400      
002430     IF DMSTATUS (VERSIONERROR)                                   121500      
002431        MOVE "VERSION ERROR" TO WKS-DIS-TEXTO                     121600      
002432        PERFORM 010630-DISPLAY                                    121700      
002433        PERFORM 999999-FIN.                                       121800      
002434                                                                  121900      
002435 900000-FIN-MAL.                                                  122000      
002436*=========================================                        122100      
002437    MOVE SPACES                       TO TEXTO-LJ.                122200      
002438    STRING " ERROR EN COMS, FIN ERRONEO DE PROGRAMA "             122300      
002439           " AVISAR AL RESPONSABLE DEL SISTEMA "                  122400      
002440    DELIMITED BY SIZE                                             122500      
002441    INTO TEXTO-LJ.                                                122600      
002442    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.          122700      
002443    PERFORM 999999-FIN.                                           122800      
002444                                                                  122900      
002445 999999-FIN.                                                      123000      
002446*=========================================                        123100      
002447    IF W88-HI-6                                                   123200      
002448       MOVE "DISABLE NOW PROGRAM "   TO WKS-SMCOMS-STRING1        123300      
002449    ELSE                                                          123400      
002450       MOVE "DISABLE PROGRAM "       TO WKS-SMCOMS-STRING1.       123500      
002451    MOVE WKS-COMS-MY-PROGRAM-NAME    TO WKS-SMCOMS-STRING2        123600      
002452    CALL "SMCOMS OF SOPORTECOMS"                                  123700      
002453          USING  WKS-SMCOMS-COMANDO                               123800      
002454                 WKS-SMCOMS-TRABAJO                               123900      
002455          GIVING W77-SMCOMS-RESULT.                               124000      
002456    IF W88-SMCOMS-OK                                              124100      
002457       NEXT SENTENCE                                              124200      
002458    ELSE                                                          124300      
002459       MOVE SPACES                   TO TEXTO-LJ                  124400      
002460       MOVE W77-SMCOMS-RESULT        TO W77-RESULT-COMS           124500      
002461       STRING                                                     124600      
002462            " ERROR DISABLE RESULTS "                             124700      
002463            W77-RESULT-COMS                                       124800      
002464       DELIMITED BY SIZE                                          124900      
002465       INTO TEXTO-LJ                                              125000      
002466       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       125100      
002467                                                                  125200      
002468 020000-PROCESO.                                                  125300      
002469*=========================================                        125400      
002470   IF WKS-BAN-HR = 0                                              125450      
002471       PERFORM 021222-VALIDA-SERV.                                125470      
002472   PERFORM 021000-PROCESA-MOVS.                                   125500      
002473   MOVE 0 TO WKS-FIN-RECEIVE.                                     125600      
002474   PERFORM 022000-ACEPTA-MENSAJE UNTIL WKS-FIN-RECEIVE = 1.       125700      
002475                                                                  125800      
002476 021000-PROCESA-MOVS.                                             125900      
002477*=========================================                        126000      
002478  ACCEPT WKS-FECHA-MAQ-6D           FROM DATE.                    126050      
002479   IF W88-SER-ACT AND WKS-MAS-PENDIENTES = 0                      126100      
002480      PERFORM 021200-ENV-PENDIENTES.                              126200      
002481                                                                  126300      
002482    ACCEPT  WKS-HRS-ACT             FROM TIME.                    126400      
002483    COMPUTE WKS-SEG-MAQUINA = WKS-HR-ACT-HH * 3600 +              126500      
002484                              WKS-HR-ACT-MM * 60   +              126600      
002485                              WKS-HR-ACT-SS.                      126700      
002486   IF W88-SER-ACT                                                 126800      
002487      PERFORM 021300-ENV-REINTENTOS.                              126900      
002488                                                                  127000      
002489  PERFORM 021600-MOVS500.                                         127100      
002490  PERFORM 021650-ACTUALIZA-CONTROL.                               127200      
002491  PERFORM 021700-VALIDA-HORARIO.                                  127205      
002492                                                                  127300      
002493 021100-LEE-CONTROL.                                              127400      
002494*=========================================                        127500      
002495    READ  A02-CTL-DM.                                             127600      
002496    MOVE  R01-REG-AUTS500         TO W77-AUT-ENVIO500.            127700      
002497    MOVE  R01-REG-SER             TO W77-STATUS-SERV.             127800      
002498    MOVE R01-REG-BAN-HR           TO WKS-RESET-HORA.              127801      
002499                                                                  127900      
002500 021100-CREA-CONTROL.                                             128000      
002501*=========================================                        128100      
002502   OPEN OUTPUT A02-CTL-DM.                                        128200      
002503   MOVE 1                          TO R01-REG-AUTS500             128300      
002504                                      W77-AUT-ENVIO500.           128400      
002505   MOVE W77-STATUS-SERV            TO R01-REG-SER.                128500      
002506   MOVE WKS-RESET-HORA             TO R01-REG-BAN-HR.             128501      
002507   WRITE R01-REG-ENVIO.                                           128600      
002508   CLOSE A02-CTL-DM                WITH SAVE.                     128700      
002509                                                                  128705      
002510 021700-VALIDA-HORARIO.                                           128710      
002511*=========================================                        128715      
002512   ACCEPT  WKS-HRS-FIN   FROM TIME.                               128720      
002513   COMPUTE WKS-HR-FIN =  WKS-HR-FIN-HH * 3600 +                   128725      
002514                         WKS-HR-FIN-MM * 60   +                   128730      
002515                         WKS-HR-FIN-SS.                           128735      
002516   IF WKS-HR-FIN > 79200 AND W88-SER-ACT                          128740      
002517      MOVE 0 TO W77-STATUS-SERV                                   128745      
002518      MOVE 0 TO WKS-MAS-PENDIENTES                                128750      
002519      MOVE "  SE ACTIVO EL FIN DE SERVICIO DEL PROGRAMA X HORARIO"128755      
002520              TO TEXTO-LJ WKS-DIS-TEXTO                           128760      
002521      PERFORM 021650-ACTUALIZA-CTRL-SERV                          128765      
002522      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ         128770      
002523      PERFORM 010630-DISPLAY.                                     128775      
002524                                                                  128800      
002525 021200-ENV-PENDIENTES.                                           128900      
002526*=========================================                        129000      
002527    MOVE 1                        TO WKS-ENV-PEN.                 129100      
002528    MOVE ZEROS                    TO WKS-STATUS.                  129200      
002529    MOVE 0        TO WKS-STATUS-CERO WKS-STATUS-CINCO.            129250      
002530    PERFORM 021210-BUSCA-PENDIENTES.                              129300      
002531    MOVE 5                        TO WKS-STATUS.                  129400      
002532    PERFORM 021210-BUSCA-PENDIENTES.                              129500      
002533    IF WKS-STATUS-CERO = 1 AND WKS-STATUS-CINCO = 1               129600      
002534          MOVE 1                  TO WKS-MAS-PENDIENTES.          129700      
002535                                                                  129800      
002536 021210-BUSCA-PENDIENTES.                                         129900      
002537*=========================================                        130000      
002538    IF NOT WKS-ENV-PEN > W77-LIMITE-PENDIENTES                    130050      
002539       PERFORM 021220-FIND-FIRST-PENDIENTE                        130100      
002540       IF WKS-EOF-B10 = 0                                         130200      
002541          PERFORM 021230-ENV-PENDIENTE UNTIL WKS-EOF-B10 = 1      130300      
002542       ELSE                                                       130325      
002543          NEXT SENTENCE.                                          130350      
002544                                                                  130400      
002545 021220-FIND-FIRST-PENDIENTE.                                     130500      
002546*=========================================                        130600      
002547    MOVE ZERO        TO WKS-EOF-B10.                              130700      
002548    LOCK FIRST B10SXFECSTA AT                                     130800      
002549         B10-NUM-ID    =  3 AND                                   130900      
002550         B10-FEC-CARGO =  WKS-FECPRO-6D AND                       131000      
002551         B10-STATUS    =  WKS-STATUS                              131100      
002552    ON EXCEPTION                                                  131200      
002553         MOVE  1    TO WKS-EOF-B10                                131300      
002554         IF DMSTATUS(NOTFOUND)                                    131400      
002555            MOVE  1    TO WKS-EOF-B10                             131500      
002556            PERFORM 021221-VALIDA-FINPEND                         131550      
002557         ELSE                                                     131600      
002558            MOVE "ERROR LOCK FIRST B10SXFECSTA" TO WKS-DMS-DSCERR 131700      
002559            PERFORM 010800-DMTERMINATE.                           131800      
002560*                                                                 131900      
002561 021230-ENV-PENDIENTE.                                            132000      
002562*=========================================                        132100      
002563    MOVE SPACES            TO WKS-DATGEN.                         132200      
002564    MOVE B10-DAT-GEN       TO WKS-DATGEN.                         132300      
002565    PERFORM 021232-ACT-HRS-ENV.                                   132400      
002566    IF B10-STATUS = 0                                             132500      
002567          MOVE 1 TO B10-STATUS B10-NUM-ENV B10-TIPO-MOV.          132600      
002568    IF B10-STATUS = 5                                             132700      
002569          MOVE 3 TO B10-STATUS                                    132800      
002570          MOVE 2 TO B10-TIPO-MOV                                  132900      
002571          MOVE 1 TO B10-NUM-ENV.                                  133000      
002572    PERFORM 021231-ARMA-DATOS-OBL.                                133100      
002573*    PERFORM 021232-ACT-HRS-ENV.                                  133200      
002574    PERFORM 021233-BEGIN-TRANS.                                   133300      
002575    PERFORM 021234-STORE-B10.                                     133400      
002576    PERFORM 021235-END-TRANS.                                     133500      
002577    MOVE    B10-NUM-OCURR  TO WKS-NUM-TRANS-OCCURS.               133600      
002578    MOVE    B10-AUT-S151   TO WKS-NUM-TRANS-AUTS151.              133700      
002579    PERFORM 021236-ARMAREST-ENV-DIALOGO.                          133800      
002580    PERFORM 021240-FINDNEXT-PENDIENTE.                            133900      
002581    IF WKS-EOF-B10 = 1 AND WKS-STATUS = 0                         134000      
002582       MOVE 1 TO WKS-STATUS-CERO.                                 134100      
002583    IF WKS-EOF-B10 = 1 AND WKS-STATUS = 5                         134200      
002584       MOVE 1 TO WKS-STATUS-CINCO.                                134300      
002585    IF WKS-ENV-PEN > W77-LIMITE-PENDIENTES                        134400      
002586       MOVE 1 TO WKS-EOF-B10.                                     134500      
002587                                                                  134600      
002588 021231-ARMA-DATOS-OBL.                                           134700      
002589*=========================================                        134800      
002590    MOVE B10-CONTRATO           TO  MSG-R01-CONTRATO.             134900      
002591    MOVE B10-MED-ACCESO         TO  MSG-R01-CVEMDA.               135000      
002592    MOVE B10-MDA-PREF           TO  MSG-R01-MDA-SUC.              135100      
002593    MOVE B10-MDA-CUENTA         TO  MSG-R01-MDA-CTA.              135200      
002594    MOVE B10-AUT-APLIC          TO  MSG-R01-AUTORIZA.             135300      
002595    MOVE B10-AUTD-FECJUL        TO  MSG-R01-FECJUL.               135400      
002596    MOVE B10-AUTD-AUT702        TO  MSG-R01-AUT702.               135500      
002597    MOVE B10-AUT-S151           TO  MSG-R01-AUT-S151.             135600      
002598    MOVE B10-FEC-CARGO          TO  MSG-R01-FECMOV.               135700      
002599    MOVE B10-CVE-TRANS          TO  MSG-R01-CVETRAN.              135800      
002600    MOVE B10-NUM-OCURR          TO  MSG-R01-OCCUR.                135900      
002601    MOVE B10-IMPORTE            TO  MSG-R01-IMPORTE.              136000      
002602    MOVE B10-NUM-ERROR          TO  MSG-R01-ERROR.                136100      
002603    MOVE WKS-AREA-MSG-OBL       TO  WKS-AREA-USUARIO.             136200      
002604                                                                  136300      
002605 021232-ACT-HRS-ENV.                                              136400      
002606*=========================================                        136500      
002607    IF (A00-R01-FUNCION = 2 OR 22 OR 21) OR                       136600      
002608        (WKS-EOF-B10 = 0 AND B10-STATUS= 5)                       136700      
002609          ACCEPT WKS-FEC-NAT-CAN        FROM DATE                 136800      
002610          ACCEPT WKS-HRS-CAN            FROM TIME                 136900      
002611     ELSE                                                         137000      
002612          IF  A00-R01-FUNCION=1 OR                                137100      
002613          (WKS-EOF-B10 = 0 AND B10-STATUS= 0)                     137200      
002614              ACCEPT WKS-FECHA-NATURAL  FROM DATE                 137300      
002615              ACCEPT WKS-HRS-ENV    FROM TIME.                    137400      
002616                                                                  137500      
002617    ACCEPT WKS-HRS-ACT                      FROM TIME.            137600      
002618    COMPUTE WKS-B10-HR-ENVIO =(WKS-HR-ACT-HH * 3600 +             137700      
002619                               WKS-HR-ACT-MM * 60 +               137800      
002620                               WKS-HR-ACT-SS +                    137900      
002621                               120).                              138000      
002622    MOVE WKS-B10-HR-ENVIO          TO B10-HR-ENVIO.               138100      
002623    MOVE WKS-DATGEN                TO B10-DAT-GEN.                138200      
002624                                                                  138300      
002625 700200-ALMACENA-REG.                                             138400      
002626*=========================================                        138500      
002627   MOVE ZERO    TO  WKS-DUPLICADO                                 138600      
002628   STORE  S151B10DOMI                                             138700      
002629        ON EXCEPTION                                              138800      
002630        IF DMSTATUS (DUPLICATES)                                  138900      
002631           MOVE A00-R01-CONTRATO  TO MSG-R01-CONTRATO             139000      
002632           MOVE A00-R01-REFNUM    TO MSG-R01-REFNUM               139100      
002633           MOVE A00-R01-AUT-S151  TO MSG-R01-AUT-S151             139200      
002634          STRING "REG DUPLICADO  "                                139300      
002635               MSG-R01-CONTRATO       DELIMITED BY SIZE ,         139400      
002636               MSG-R01-REFNUM         DELIMITED BY SIZE ,         139500      
002637               MSG-R01-AUT-S151       DELIMITED BY SIZE ,         139600      
002638               WKS-NUM-OCCURS         DELIMITED BY SIZE ,         139700      
002639                                      INTO WKS-DIS-TEXTO          139800      
002640          PERFORM 010630-DISPLAY                                  139900      
002641          MOVE    1  TO  WKS-DUPLICADO                            140000      
002642          MOVE LOW-VALUES TO MSG-R01-CONTRATO                     140100      
002643                             MSG-R01-REFNUM                       140200      
002644                             MSG-R01-AUT-S151                     140300      
002645        ELSE                                                      140400      
002646           MOVE "ERROR STORE S151B10DOMI" TO WKS-DMS-DSCERR       140500      
002647           PERFORM 010800-DMTERMINATE.                            140600      
002648                                                                  140700      
002649 021233-BEGIN-TRANS.                                              140800      
002650*=========================================                        140900      
002651    BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL                    141000      
002652    ON EXCEPTION                                                  141100      
002653       MOVE "ERROR EN BEGIN TRANS " TO WKS-DMS-DSCERR             141200      
002654       PERFORM 010800-DMTERMINATE.                                141300      
002655                                                                  141400      
002656 021234-STORE-B10.                                                141500      
002657*=========================================                        141600      
002658    MOVE ZERO    TO  WKS-DUPLICADO                                141700      
002659    STORE  S151B10DOMI                                            141800      
002660         ON EXCEPTION                                             141900      
002661         IF DMSTATUS (DUPLICATES)                                 142000      
002662            MOVE A00-R01-CONTRATO  TO MSG-R01-CONTRATO            142100      
002663            MOVE A00-R01-REFNUM    TO MSG-R01-REFNUM              142200      
002664            MOVE A00-R01-AUT-S151  TO MSG-R01-AUT-S151            142300      
002665           STRING "REG DUPLICADO  "                               142400      
002666                MSG-R01-CONTRATO       DELIMITED BY SIZE ,        142500      
002667                MSG-R01-REFNUM         DELIMITED BY SIZE ,        142600      
002668                MSG-R01-AUT-S151       DELIMITED BY SIZE ,        142700      
002669                WKS-NUM-OCCURS         DELIMITED BY SIZE ,        142800      
002670                                       INTO WKS-DIS-TEXTO         142900      
002671           PERFORM 010630-DISPLAY                                 143000      
002672           MOVE    1  TO  WKS-DUPLICADO                           143100      
002673           MOVE LOW-VALUES TO MSG-R01-CONTRATO                    143200      
002674                              MSG-R01-REFNUM                      143300      
002675                              MSG-R01-AUT-S151                    143400      
002676         ELSE                                                     143500      
002677            MOVE "ERROR STORE S151B10PROTCOB" TO WKS-DMS-DSCERR   143600      
002678            PERFORM 010800-DMTERMINATE.                           143700      
002679                                                                  143800      
002680 021235-END-TRANS.                                                143900      
002681*=========================================                        144000      
002682    END-TRANSACTION AUDIT S151B99REINICTL                         144100      
002683    ON EXCEPTION                                                  144200      
002684       MOVE "ERROR EN END TRANS "  TO WKS-DMS-DSCERR              144300      
002685       PERFORM 010800-DMTERMINATE.                                144400      
002686                                                                  144500      
002687 021236-ARMAREST-ENV-DIALOGO.                                     144600      
002688*=========================================                        144700      
002689    MOVE "F"                    TO WKS-HDR-PREFIJO.               144800      
002690    MOVE "0"                    TO WKS-HDR-APLDEST.               144900      
002691    IF WKS-VAL-CENTR(1) = 0                                       145000      
002692       MOVE 10                  TO WKS-HDR-CCRDEST                145100      
002693    ELSE                                                          145200      
002694    IF WKS-NOMEQUIPO = "VDMBETA."                                 145300      
002695        MOVE WKS-CSIDEST TO WKS-HDR-CCRDEST                       145400      
002696    ELSE                                                          145500      
002697    IF WKS-NOMEQUIPO = "ACYPGAMA." OR WKS-NOMEQUIPO = "MONALFA."  145600      
002698        MOVE WKS-CSIDEST TO WKS-HDR-CCRDEST                       145700      
002699    ELSE                                                          145800      
002700    IF   WKS-NUMCSI-HOST = 32                                     145900      
002701         MOVE 32                TO WKS-HDR-CCRDEST.               146000      
002702                                                                  146100      
002703    MOVE 0                      TO WKS-HDR-LSNORGN.               146200      
002704    MOVE "Y"                    TO WKS-HDR-STA-TIPO.              146300      
002705    MOVE WKS-VAL-SUC(1)  TO WKS-HDR-STA-SUC.                      146400      
002706    MOVE "A"                    TO WKS-HDR-STA-PRIV.              146500      
002707    MOVE WKS-VAL-CAJA(1) TO WKS-HDR-STA-CAJA.                     146600      
002708    MOVE WKS-NUMCSI-HOST        TO WKS-HDR-CCRORGN.               146700      
002709    MOVE WKS-NUMCSI-HOST        TO WKS-HDR-COPORGN.               146800      
002710    MOVE "0"                    TO WKS-HDR-FACULTAD.              146900      
002711    MOVE "0"                    TO WKS-HDR-APLORIG.               147000      
002712    MOVE WKS-VAL-RDO(1)  TO WKS-HDR-RSLTDO.                       147100      
002713    MOVE SPACES                 TO WKS-HDR-MASCARA.               147200      
002714    MOVE SPACES                 TO WKS-HDR-PASSWORD.              147300      
002715    MOVE WKS-VAL-ACA-DES(1)                                       147400      
002716                                TO WKS-ACA-DESTINO.               147500      
002717    MOVE 015113                 TO WKS-ACA-ORIGEN.                147600      
002718    MOVE WKS-VAL-CVE-TRAN-DES-SIS(1)                              147700      
002719                                TO WKS-SA0-TRN-DSIS.              147800      
002720    MOVE WKS-VAL-CVE-TRAN-DES-COD(1)                              147900      
002721                                TO WKS-SA0-TRN-DCOD.              148000      
002722    MOVE WKS-VAL-CVE-TRAN-DES-SUB(1)                              148100      
002723                                TO WKS-SA0-TRN-DSCOD.             148200      
002724    MOVE WKS-VAL-CVE-TRAN-OR-SIS(1)                               148300      
002725                                TO WKS-SA0-TRN-OSIS.              148400      
002726    MOVE WKS-VAL-CVE-TRAN-OR-COD(1)                               148500      
002727                                TO WKS-SA0-TRN-OCOD.              148600      
002728    MOVE WKS-VAL-CVE-TRAN-OR-SUB(1)                               148700      
002729                                TO WKS-SA0-TRN-OSCOD.             148800      
002730    MOVE B10-STATUS             TO WKS-SA0-DIRECCION.             148900      
002731    MOVE WKS-LONG-MSG(1)                                          149000      
002732                                TO WKS-SA0-LONG.                  149100      
002733    MOVE WKS-VAL-TESP(1) TO WKS-SA0-TIEMPO-ESPERA.                149200      
002734    MOVE 0                      TO WKS-SA0-RESPUESTA.             149300      
002735    MOVE 0                      TO WKS-SA2-IDENT-FMT.             149400      
002736    MOVE 0                      TO WKS-SA2-RECONOC.               149500      
002737    MOVE "B"                    TO WKS-SA2-VERSION.               149600      
002738    MOVE 0                      TO WKS-SA2-CLASE.                 149700      
002739    MOVE 0                      TO WKS-SA2-RESULTADO.             149800      
002740    MOVE WKS-VAL-MODO(1)        TO WKS-SA2-MODO.                  149900      
002741    MOVE WKS-VAL-SUC(1)         TO WKS-SA2-SUCURSAL.              150000      
002742    MOVE WKS-VAL-CAJA(1)        TO WKS-SA2-IDEN-CAJA.             150100      
002743    MOVE WKS-NUM-TRANS          TO WKS-SA2-TRN-NUM.               150200      
002744    MOVE WKS-FECHA-MAQ-6D       TO WKS-SA2-FECHA.                 150300      
002745    MOVE WKS-HRS-ACT            TO WKS-SA2-HORA.                  150400      
002746    MOVE 0                      TO WKS-SA2-MODALIDAD.             150500      
002747    MOVE "0"                    TO WKS-SA2-IEFE-NOPE.             150600      
002748    MOVE "1"                    TO WKS-SA2-VER-OPC.               150700      
002749    PERFORM 021237-ENVIA-DIALOGO.                                 150800      
002750                                                                  150900      
002751 021237-ENVIA-DIALOGO.                                            151000      
002752*=========================================                        151100      
002753    MOVE 1                            TO CS-COMS-OUT-COUNT.       151200      
002754    MOVE WKS-LONG-MSG(1)              TO CS-COMS-OUT-TEXT-LENGTH. 151300      
002755    MOVE 0                            TO CS-COMS-OUT-STATUS-KEY.  151400      
002756    MOVE W77-COMS-AG-SALIDA-DESG      TO CS-COMS-OUT-AGENDA.      151500      
002757    MOVE W77-COMS-DEFSTATION-DESG     TO CS-COMS-OUT-DESTINATION. 151600      
002758    MOVE "ENVIO MENSAJE  S151-S702"   TO WKS-SENTIDO-MSG.         151700      
002759    PERFORM 021238-ESCRIBE-MONITOR.                               151800      
002760    PERFORM 021239-ENVIA-COMS.                                    151900      
002761                                                                  152000      
002762 021238-ESCRIBE-MONITOR.                                          152100      
002763*=========================================                        152200      
002764    IF WKS-STATUS-MONITOR = 1                                     152300      
002765       MOVE WKS-FECHA-MAQ-6D  TO WKS-FEC-MON                      152400      
002766       ACCEPT WKS-HRS-MON FROM TIME                               152500      
002767       MOVE SPACES        TO WKS-ESPACIO1 WKS-ESPACIO2            152600      
002768       MOVE WKS-REG-MSG   TO WKS-DATOS-MSJ                        152700      
002769       IF (WKS-SA0-DIRECCION = 1 OR 3) AND                        152800      
002770           WKS-SA0-TRN-DCOD = 10                                  152900      
002771         STRING  MSG-R01-AUT-S151 DELIMITED BY SIZE,              153000      
002772                 MSG-R01-OCCUR    DELIMITED BY SIZE,              153100      
002773         INTO    WKS-LLAVE-MSG                                    153200      
002774       ELSE                                                       153300      
002775         STRING  WKS-SA0-TRN-DEST DELIMITED BY SIZE,              153400      
002776         INTO    WKS-LLAVE-MSG.                                   153500      
002777    IF WKS-STATUS-MONITOR = 1                                     153600      
002778       WRITE REG-MONITOR.                                         153700      
002779                                                                  153800      
002780 021239-ENVIA-COMS.                                               153900      
002781*=========================================                        154000      
002782    SEND COMS-OUT FROM WKS-REG-MSG.                               154100      
002783    IF CS-COMS-OUT-STATUS-KEY = 0 OR 96                           154200      
002784        ADD 1 TO WKS-CONT-MSG-ENV                                 154300      
002785        IF (WKS-SA0-DIRECCION = 1 OR 3) AND                       154400      
002786            WKS-SA0-TRN-DCOD = 10                                 154500      
002787          ADD 1  TO WKS-NUM-ENVIOS                                154600      
002788        ELSE                                                      154700      
002789          NEXT SENTENCE                                           154800      
002790    ELSE                                                          154900      
002791       MOVE CS-COMS-OUT-STATUS-KEY    TO W77-STATUS-KEY           155000      
002792       STRING MY-ID " ERROR EN SEND MSG ST-KEY "                  155100      
002793              W77-STATUS-KEY                                      155200      
002794       DELIMITED BY SIZE INTO MENSAJE-LJ                          155300      
002795       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        155400      
002796       IF (WKS-SA0-DIRECCION = 1 OR 3) AND                        155500      
002797           WKS-SA0-TRN-DCOD = 10                                  155600      
002798          STRING MY-ID " ERROR EN SEND MSG ST-KEY "               155700      
002799              W77-STATUS-KEY            DELIMITED BY SIZE ,       155800      
002800              MSG-R01-CONTRATO          DELIMITED BY SIZE ,       155900      
002801              MSG-R01-REFNUM            DELIMITED BY SIZE ,       156000      
002802              MSG-R01-AUT-S151          DELIMITED BY SIZE ,       156100      
002803              MSG-R01-OCCUR             DELIMITED BY SIZE ,       156200      
002804              WKS-SA0-DIRECCION         DELIMITED BY SIZE ,       156300      
002805                                        INTO WKS-DIS-TEXTO        156400      
002806              PERFORM 010630-DISPLAY                              156500      
002807       ELSE                                                       156600      
002808          STRING MY-ID " ERROR EN SEND MSG ST-KEY "               156700      
002809              W77-STATUS-KEY            DELIMITED BY SIZE ,       156800      
002810              WKS-ACA-DESTINO           DELIMITED BY SIZE ,       156900      
002811              WKS-ACA-ORIGEN            DELIMITED BY SIZE ,       157000      
002812              WKS-SA0-TRN-DEST          DELIMITED BY SIZE ,       157100      
002813              WKS-SA0-DIRECCION         DELIMITED BY SIZE ,       157200      
002814                                        INTO WKS-DIS-TEXTO        157300      
002815              PERFORM 010630-DISPLAY.                             157400      
002816                                                                  157500      
002817 021240-FINDNEXT-PENDIENTE.                                       157600      
002818*=========================================                        157700      
002819    MOVE ZERO        TO WKS-EOF-B10.                              157800      
002820    LOCK NEXT B10SXFECSTA                                         157900      
002821         ON EXCEPTION                                             158000      
002822            MOVE  1    TO WKS-EOF-B10                             158100      
002823         IF DMSTATUS(NOTFOUND)                                    158200      
002824            MOVE  1    TO WKS-EOF-B10                             158300      
002825            PERFORM 021221-VALIDA-FINPEND                         158350      
002826         ELSE                                                     158400      
002827            MOVE "ERROR LOCK NEXT B10SXFECSTA" TO WKS-DMS-DSCERR  158500      
002828            PERFORM 010800-DMTERMINATE.                           158600      
002829    IF WKS-EOF-B10   =  0                                         158700      
002830       IF B10-NUM-ID    =  3 AND                                  158800      
002831          B10-FEC-CARGO =  WKS-FECPRO-6D AND                      158900      
002832          B10-STATUS    =  WKS-STATUS                             159000      
002833          MOVE ZERO        TO WKS-EOF-B10                         159100      
002834          ADD 1            TO WKS-ENV-PEN                         159200      
002835       ELSE                                                       159300      
002836          MOVE  1    TO WKS-EOF-B10.                              159400      
002837                                                                  159500      
002838 021240-FINDNEXT-REINTENTO.                                       159600      
002839*=========================================                        159700      
002840    MOVE ZERO        TO WKS-EOF-B10                               159800      
002841    LOCK NEXT B10SXFECSTA                                         159900      
002842         ON EXCEPTION                                             160000      
002843            MOVE  1    TO WKS-EOF-B10                             160100      
002844         IF DMSTATUS(NOTFOUND)                                    160200      
002845            MOVE  1    TO WKS-EOF-B10                             160300      
002846         ELSE                                                     160400      
002847            MOVE "ERROR LOCK NEXT B10SXFECSTA" TO WKS-DMS-DSCERR  160500      
002848            PERFORM 010800-DMTERMINATE.                           160600      
002849    IF WKS-EOF-B10   =  0                                         160700      
002850       IF B10-NUM-ID    =  3 AND                                  160800      
002851          B10-FEC-CARGO =  WKS-FEC-REINT AND                      160900      
002852          B10-STATUS    =  WKS-STATUS AND                         161000      
002853          B10-HR-ENVIO  <  WKS-SEG-MAQUINA                        161100      
002854          MOVE ZERO        TO WKS-EOF-B10                         161200      
002855*          ADD 1            TO WKS-ENV-REINT                      161300      
002856       ELSE                                                       161400      
002857          MOVE  1    TO WKS-EOF-B10.                              161500      
002858                                                                  161600      
002859 021300-ENV-REINTENTOS.                                           161700      
002860*=========================================                        161800      
002861    MOVE 1                 TO WKS-ENV-REINT.                      161900      
002862    MOVE 1                 TO WKS-STATUS.                         162000      
002863    MOVE WKS-FECPRO-6D     TO WKS-FEC-REINT.                      162100      
002864    PERFORM 021310-BUSCA-REINTENTOS.                              162200      
002865    MOVE 3                 TO WKS-STATUS.                         162300      
002866    PERFORM 021310-BUSCA-REINTENTOS.                              162400      
002867* BUSCA MOVIMIENTOS CON FECHA HABIL ANTERIOR                      162500      
002868    MOVE 1                 TO WKS-STATUS.                         162600      
002869    MOVE WKS-FECPRO-ANT-6D TO WKS-FEC-REINT.                      162700      
002870    PERFORM 021310-BUSCA-REINTENTOS.                              162800      
002871    MOVE 3                 TO WKS-STATUS.                         162900      
002872    PERFORM 021310-BUSCA-REINTENTOS.                              163000      
002873                                                                  163100      
002874 021310-BUSCA-REINTENTOS.                                         163200      
002875*=========================================                        163300      
002876    IF WKS-ENV-REINT < W77-LIMITE-REINTENTOS                      163400      
002877       PERFORM 021310-FIND-FIRST-REINT                            163500      
002878       IF WKS-EOF-B10 = 0                                         163600      
002879          PERFORM 021320-ENV-REINT UNTIL WKS-EOF-B10 = 1          163700      
002880       ELSE                                                       163800      
002881          NEXT SENTENCE.                                          163900      
002882                                                                  164000      
002883 021310-FIND-FIRST-REINT.                                         164100      
002884*=========================================                        164200      
002885    MOVE ZERO        TO WKS-EOF-B10.                              164300      
002886    MOVE 1           TO WKS-LOCK-OK.                              164400      
002887    LOCK FIRST B10SXFECSTA AT                                     164500      
002888        B10-NUM-ID    =  3             AND                        164600      
002889        B10-FEC-CARGO =  WKS-FEC-REINT AND                        164700      
002890        B10-STATUS    =  WKS-STATUS    AND                        164800      
002891        B10-HR-ENVIO  <  WKS-SEG-MAQUINA                          164900      
002892    ON EXCEPTION                                                  165000      
002893       IF DMSTATUS(DEADLOCK)                                      165100      
002894            MOVE 0 TO WKS-LOCK-OK                                 165200      
002895            MOVE "DEADLOCK              " TO WKS-DIS-TEXTO        165300      
002896            PERFORM 010630-DISPLAY                                165400      
002897       ELSE                                                       165500      
002898            MOVE  1    TO WKS-EOF-B10                             165600      
002899            IF DMSTATUS(NOTFOUND)                                 165700      
002900                   MOVE  1    TO WKS-EOF-B10                      165800      
002901            ELSE                                                  165900      
002902                   MOVE "ERROR LOCK FIRST B10SXFECSTA"            166000      
002903                               TO WKS-DMS-DSCERR                  166100      
002904                   PERFORM 010800-DMTERMINATE.                    166200      
002905                                                                  166300      
002906 021320-ENV-REINT.                                                166400      
002907*=========================================                        166500      
002908   ADD 1                  TO WKS-ENV-REINT.                       166600      
002909   MOVE SPACES            TO WKS-DATGEN.                          166700      
002910   MOVE B10-DAT-GEN       TO WKS-DATGEN.                          166800      
002911   PERFORM 021231-ARMA-DATOS-OBL.                                 166900      
002912   PERFORM 021232-ACT-HRS-ENV.                                    167000      
002913   ADD     1              TO B10-NUM-ENV.                         167100      
002914   PERFORM 021233-BEGIN-TRANS.                                    167200      
002915   PERFORM 021234-STORE-B10.                                      167300      
002916   PERFORM 021235-END-TRANS.                                      167400      
002917   MOVE    B10-NUM-OCURR  TO WKS-NUM-TRANS-OCCURS.                167500      
002918   MOVE    B10-AUT-S151   TO WKS-NUM-TRANS-AUTS151.               167600      
002919   PERFORM 021236-ARMAREST-ENV-DIALOGO.                           167700      
002920   PERFORM 021240-FINDNEXT-REINTENTO.                             167800      
002921   IF WKS-ENV-REINT > W77-LIMITE-REINTENTOS                       167900      
002922      MOVE 1 TO WKS-EOF-B10.                                      168000      
002923                                                                  168100      
002924 011200-PROYECTA-HABIL-ANT.                                       168200      
002925*=========================================                        168300      
002926   MOVE 15                TO WKS-FUNCION.                         168400      
002927   MOVE 13                TO WKS-FORMATO.                         168500      
002928   MOVE WKS-FECHA-PROCESO TO WKS-FECHA1.                          168600      
002929   MOVE 1                 TO WKS-FECHA2.                          168700      
002930   CALL "THECALENDAR OF LOCSUP" USING WKS-FUNCION                 168800      
002931                                      WKS-FECHA1                  168900      
002932                                      WKS-FECHA2                  169000      
002933                                      WKS-FORMATO.                169100      
002934   MOVE WKS-FECHA1 TO WKS-FEC-PROC-ANT.                           169200      
002935   IF WKS-RESET-HORA = 0                                          169205      
002936      PERFORM 011290-RESET-PEND-ANT.                              169300      
002937                                                                  169400      
002938 021600-MOVS500.                                                  169500      
002939*=========================================                        169600      
002940    MOVE ZERO                    TO W77-FIN-ARCH.                 169700      
002941    MOVE W77-AUT-ENVIO500        TO W77-NUMREG-MOV500.            169800      
002942    ADD  1                       TO W77-NUMREG-MOV500.            169900      
002943    OPEN  INPUT A01-MOVS500.                                      170000      
002944    SEEK A01-MOVS500 RECORD.                                      170100      
002945    MOVE 1 TO WKS-NUM-ENVIOS.                                     170200      
002946    PERFORM 021610-READ-ARCHS500.                                 170300      
002947    PERFORM 021620-VALIDA-MOVS500 UNTIL W77-FIN-ARCH = 1.         170400      
002948    CLOSE A01-MOVS500 WITH RELEASE.                               170500      
002949                                                                  170600      
002950 021610-READ-ARCHS500.                                            170700      
002951*=========================================                        170800      
002952   READ A01-MOVS500 INTO A00-R01-REGMOV                           170900      
002953        AT END MOVE 1           TO W77-FIN-ARCH.                  171000      
002954   IF A00-R01-FUNCION = 99 OR WKS-NUM-ENVIOS > W77-LIMITE-ENVIOS  171100      
002955       MOVE 1                   TO W77-FIN-ARCH.                  171200      
002956                                                                  171300      
002957 021620-VALIDA-MOVS500.                                           171400      
002958*=========================================                        171500      
002959   ADD  1                        TO W77-AUT-ENVIO500.             171600      
002960   IF A00-R01-TIPO-PROC > 39  AND A00-R01-TIPO-PROC < 44          171700      
002961      NEXT SENTENCE                                               171800      
002962   ELSE                                                           171900      
002963      IF A00-R01-FUNCION = 21 OR 22                               172000      
002964         ADD 1 TO WKS-CONT-MSG-CANC                               172100      
002965         PERFORM 021621-CANCEL-MAS-MOV                            172200      
002966      ELSE                                                        172300      
002967         IF A00-R01-FUNCION = 2                                   172400      
002968            ADD 1 TO WKS-CONT-MSG-CANC                            172500      
002969            PERFORM 021630-CANCEL-MOVS                            172600      
002970         ELSE                                                     172700      
002971            IF A00-R01-FUNCION = 1                                172800      
002972               PERFORM 021640-ALTA-MOVS.                          172900      
002973    PERFORM 021610-READ-ARCHS500.                                 173000      
002974                                                                  173100      
002975 021621-CANCEL-MAS-MOV.                                           173200      
002976*=========================================                        173300      
002977    MOVE A00-R01-TIPO-PROC         TO   WKS-PROC-CANCEL.          173400      
002978    MOVE ZERO                      TO   WKS-LOCK-OK.              173500      
002979    IF A00-R01-FUNCION = 21                                       173600      
002980       MOVE 0                      TO   WKS-AUT-AELIM-S151        173700      
002981       PERFORM 021622-FINDFIRS-B10XPROC UNTIL WKS-LOCK-OK = 1     173800      
002982       PERFORM 021623-CANCEL-FUN21-22   UNTIL WKS-EOF-B10 = 1     173900      
002983    ELSE                                                          174000      
002984       MOVE A00-R01-AUT-AELIM-S151 TO WKS-AUT-AELIM-S151          174100      
002985       PERFORM 021622-FINDFIRS-B10XPROC UNTIL WKS-LOCK-OK = 1     174200      
002986       PERFORM 021623-CANCEL-FUN21-22   UNTIL WKS-EOF-B10 = 1.    174300      
002987                                                                  174400      
002988 021622-FINDFIRS-B10XPROC.                                        174500      
002989*=========================================                        174600      
002990    MOVE ZERO             TO WKS-EOF-B10.                         174700      
002991    MOVE 1                TO WKS-LOCK-OK.                         174800      
002992    LOCK FIRST B10SXPROC AT                                       174900      
002993        B10-FEC-CARGO =  WKS-FECPRO-6D   AND                      175000      
002994        B10-NUM-PROC  =  WKS-PROC-CANCEL AND                      175100      
002995        B10-AUT-S151  >  WKS-AUT-AELIM-S151                       175200      
002996    ON EXCEPTION                                                  175300      
002997        IF DMSTATUS(DEADLOCK)                                     175400      
002998             MOVE 0 TO WKS-LOCK-OK                                175500      
002999             MOVE "DEADLOCK              " TO WKS-DIS-TEXTO       175600      
003000             PERFORM 010630-DISPLAY                               175700      
003001        ELSE                                                      175800      
003002            IF DMSTATUS(NOTFOUND)                                 175900      
003003               MOVE  1    TO WKS-EOF-B10                          176000      
003004            ELSE                                                  176100      
003005               MOVE "ERROR LOCK FIRST B10SXPROC"                  176200      
003006                                           TO WKS-DMS-DSCERR      176300      
003007               PERFORM 010800-DMTERMINATE.                        176400      
003008                                                                  176500      
003009   IF WKS-EOF-B10 = 0 AND WKS-LOCK-OK = 1                         176600      
003010      PERFORM 021650-ACTUALIZA-CONTROL.                           176700      
003011                                                                  176800      
003012 021623-CANCEL-FUN21-22.                                          176900      
003013*=========================================                        177000      
003014    MOVE 2                TO  B10-TIPO-MOV.                       177100      
003015    MOVE ZERO             TO  WKS-LOCK-OK.                        177200      
003016    IF W88-SER-ACT                                                177300      
003017       IF B10-STATUS = 1 OR 2                                     177400      
003018          MOVE    3          TO B10-STATUS                        177500      
003019          PERFORM 021233-BEGIN-TRANS                              177600      
003020          MOVE SPACE TO WKS-DATGEN                                177700      
003021          MOVE B10-DAT-GEN TO WKS-DATGEN                          177800      
003022          PERFORM 021232-ACT-HRS-ENV                              177900      
003023          PERFORM 021234-STORE-B10                                178000      
003024          PERFORM 021235-END-TRANS                                178100      
003025          MOVE    B10-NUM-OCURR  TO WKS-NUM-TRANS-OCCURS          178200      
003026          MOVE    B10-AUT-S151   TO WKS-NUM-TRANS-AUTS151         178300      
003027          PERFORM 021231-ARMA-DATOS-OBL                           178400      
003028          PERFORM 021236-ARMAREST-ENV-DIALOGO                     178500      
003029       ELSE                                                       178600      
003030          NEXT SENTENCE                                           178700      
003031    ELSE                                                          178800      
003032       PERFORM 021624-ALMACENA-PENDIENTE.                         178900      
003033    PERFORM 021625-FINDNEXT-B10XPROC UNTIL WKS-LOCK-OK = 1.       179000      
003034                                                                  179100      
003035 021624-ALMACENA-PENDIENTE.                                       179200      
003036*=========================================                        179300      
003037    IF B10-STATUS = ZERO                                          179400      
003038       MOVE 6 TO B10-STATUS                                       179500      
003039       PERFORM 021233-BEGIN-TRANS                                 179600      
003040       PERFORM 021234-STORE-B10                                   179700      
003041       PERFORM 021235-END-TRANS                                   179800      
003042    ELSE                                                          179900      
003043    IF B10-STATUS = 1 OR 2                                        180000      
003044       MOVE 5 TO B10-STATUS                                       180100      
003045       PERFORM 021233-BEGIN-TRANS                                 180200      
003046       PERFORM 021234-STORE-B10                                   180300      
003047       PERFORM 021235-END-TRANS.                                  180400      
003048                                                                  180500      
003049 021625-FINDNEXT-B10XPROC.                                        180600      
003050*=========================================                        180700      
003051    MOVE ZERO        TO WKS-EOF-B10.                              180800      
003052    MOVE 1           TO WKS-LOCK-OK.                              180900      
003053    LOCK NEXT B10SXPROC                                           181000      
003054    ON EXCEPTION                                                  181100      
003055       IF DMSTATUS(DEADLOCK)                                      181200      
003056          MOVE 0 TO WKS-LOCK-OK                                   181300      
003057          MOVE "DEADLOCK              " TO WKS-DIS-TEXTO          181400      
003058          PERFORM 010630-DISPLAY                                  181500      
003059       ELSE                                                       181600      
003060          IF DMSTATUS(NOTFOUND)                                   181700      
003061             MOVE  1    TO WKS-EOF-B10                            181800      
003062          ELSE                                                    181900      
003063             MOVE "ERROR LOCK NEXT B10SXPROC" TO WKS-DMS-DSCERR   182000      
003064             PERFORM 010800-DMTERMINATE.                          182100      
003065                                                                  182200      
003066    IF WKS-EOF-B10 = 0                                            182300      
003067       IF B10-FEC-CARGO =  WKS-FECPRO-6D AND                      182400      
003068          B10-NUM-PROC  =  WKS-PROC-CANCEL AND                    182500      
003069          B10-AUT-S151  >  WKS-AUT-AELIM-S151                     182600      
003070          MOVE ZERO        TO WKS-EOF-B10                         182700      
003071       ELSE                                                       182800      
003072          MOVE 1           TO WKS-EOF-B10.                        182900      
003073                                                                  183000      
003074 021630-CANCEL-MOVS.                                              183100      
003075*=========================================                        183200      
003076    MOVE A00-R01-AUT-AELIM-S151  TO WKS-AUT-ANT-S151.             183300      
003077    PERFORM 021631-ACTUALIZA-REG UNTIL WKS-AUT-ANT-S151 = 0.      183400      
003078                                                                  183500      
003079 021631-ACTUALIZA-REG.                                            183600      
003080*=========================================                        183700      
003081    MOVE WKS-AUT-ANT-S151     TO WKS-R01-AUT-S151                 183800      
003082    MOVE ZERO                 TO WKS-AUT-ANT-S151.                183900      
003083    PERFORM 021632-CICLO-OCUR VARYING WKS-NUM-OCCURS FROM 1 BY 1  184000      
003084    UNTIL   WKS-NUM-OCCURS > 5.                                   184100      
003085                                                                  184200      
003086 021632-CICLO-OCUR.                                               184300      
003087*=========================================                        184400      
003088    MOVE 0                     TO WKS-LOCK-OK.                    184500      
003089    PERFORM 021633-FND-FST-B10SXFECAUT151 UNTIL WKS-LOCK-OK = 1.  184600      
003090    IF WKS-EOF-B10 = ZERO                                         184700      
003091       PERFORM 021634-ACTB10-FUN-2                                184800      
003092       MOVE B10-AUT-ANT-S151    TO WKS-AUT-ANT-S151.              184900      
003093                                                                  185000      
003094 021633-FND-FST-B10SXFECAUT151.                                   185100      
003095*=========================================                        185200      
003096    MOVE ZERO             TO WKS-EOF-B10.                         185300      
003097    MOVE 1                TO WKS-LOCK-OK.                         185400      
003098    LOCK FIRST B10SXFECAUT151  AT                                 185500      
003099        B10-NUM-ID    =  3        AND                             185600      
003100        B10-FEC-CARGO =  WKS-FECPRO-6D    AND                     185700      
003101        B10-AUT-S151  =  WKS-R01-AUT-S151  AND                    185800      
003102        B10-NUM-OCURR =  WKS-NUM-OCCURS                           185900      
003103    ON EXCEPTION                                                  186000      
003104       IF DMSTATUS(DEADLOCK)                                      186100      
003105          MOVE 0 TO WKS-LOCK-OK                                   186200      
003106          MOVE "DEADLOCK              " TO WKS-DIS-TEXTO          186300      
003107          PERFORM 010630-DISPLAY                                  186400      
003108       ELSE                                                       186500      
003109          IF DMSTATUS(NOTFOUND)                                   186600      
003110             MOVE  1    TO WKS-EOF-B10                            186700      
003111          ELSE                                                    186800      
003112             MOVE "ERROR LOCK FIRST B10SXFECAUT151"               186900      
003113                                          TO WKS-DMS-DSCERR       187000      
003114             PERFORM 010800-DMTERMINATE.                          187100      
003115                                                                  187200      
003116 021634-ACTB10-FUN-2.                                             187300      
003117*=========================================                        187400      
003118    MOVE A00-R01-FUNCION          TO B10-TIPO-MOV.                187500      
003119    IF W88-SER-ACT                                                187600      
003120       MOVE    3                  TO B10-STATUS                   187700      
003121       PERFORM 021233-BEGIN-TRANS                                 187800      
003122       MOVE    SPACE              TO WKS-DATGEN                   187900      
003123       MOVE    B10-DAT-GEN        TO WKS-DATGEN                   188000      
003124       PERFORM 021232-ACT-HRS-ENV                                 188100      
003125       PERFORM 700200-ALMACENA-REG                                188200      
003126       PERFORM 021234-STORE-B10                                   188300      
003127       PERFORM 021235-END-TRANS                                   188400      
003128       MOVE    B10-NUM-OCURR      TO WKS-NUM-TRANS-OCCURS         188500      
003129       MOVE    B10-AUT-S151       TO WKS-NUM-TRANS-AUTS151        188600      
003130       PERFORM 021231-ARMA-DATOS-OBL                              188700      
003131       PERFORM 021236-ARMAREST-ENV-DIALOGO                        188800      
003132    ELSE                                                          188900      
003133       PERFORM 021624-ALMACENA-PENDIENTE.                         189000      
003134                                                                  189100      
003135 021640-ALTA-MOVS.                                                189200      
003136*=========================================                        189300      
003137    PERFORM 021641-CICLO-OCUR-2 VARYING WKS-NUM-OCCURS FROM 1 BY 1189400      
003138           UNTIL WKS-NUM-OCCURS > 5.                              189500      
003139                                                                  189600      
003140 021641-CICLO-OCUR-2.                                             189700      
003141*=========================================                        189800      
003142  MOVE A00-R01-CVETRAN(WKS-NUM-OCCURS) TO WKS-NUM-CVETRANS.       189900      
003143  IF WKS-NUM-CVETRANS > 0                                         190000      
003144     IF WKS-CAT6-CVETRAN(WKS-NUM-CVETRANS) NOT = 0  AND           190100      
003145        WKS-CAT6-SERV3(WKS-NUM-CVETRANS) = 1                      190200      
003146        PERFORM 021641-ALTA-DOMI                                  190300      
003147     ELSE                                                         190400      
003148        NEXT SENTENCE                                             190500      
003149  ELSE                                                            190600      
003150     MOVE 6 TO WKS-NUM-OCCURS.                                    190700      
003151                                                                  190800      
003152 021641-ALTA-DOMI.                                                190900      
003153*=========================================                        191000      
003154    IF W88-SER-ACT                                                191100      
003155       PERFORM 021233-BEGIN-TRANS                                 191200      
003156       PERFORM 021642-CREATE-B10                                  191300      
003157       PERFORM 021643-MUVE-DATOS-DOMI                             191400      
003158       PERFORM 021232-ACT-HRS-ENV                                 191500      
003159       PERFORM 021234-STORE-B10                                   191600      
003160       PERFORM 021235-END-TRANS                                   191700      
003161       IF WKS-DUPLICADO = 0                                       191800      
003162          PERFORM 021231-ARMA-DATOS-OBL                           191900      
003163          MOVE    B10-NUM-OCURR  TO WKS-NUM-TRANS-OCCURS          192000      
003164          MOVE    B10-AUT-S151   TO WKS-NUM-TRANS-AUTS151         192100      
003165          PERFORM 021236-ARMAREST-ENV-DIALOGO                     192200      
003166       ELSE                                                       192300      
003167          NEXT SENTENCE                                           192400      
003168    ELSE                                                          192500      
003169       PERFORM 021643-ALTA-DOMI-PEN.                              192600      
003170                                                                  192700      
003171 021642-CREATE-B10.                                               192800      
003172*=========================================                        192900      
003173    CREATE S151B10DOMI                                            193000      
003174    ON EXCEPTION                                                  193100      
003175       MOVE "ERROR AL CREAR B10" TO WKS-DMS-DSCERR                193200      
003176       PERFORM 010800-DMTERMINATE.                                193300      
003177                                                                  193400      
003178 021643-MUVE-DATOS-DOMI.                                          193500      
003179*=========================================                        193600      
003180    MOVE SPACES                        TO WKS-DATGEN.             193700      
003181    MOVE 3                             TO B10-NUM-ID.             193800      
003182    MOVE A00-R01-CONTRATO              TO B10-CONTRATO.           193900      
003183    MOVE A00-R01-CVEMDA                TO B10-MED-ACCESO.         194000      
003184    MOVE A00-R01-MDA-SUC               TO B10-MDA-PREF.           194100      
003185    MOVE A00-R01-MDA-CTA               TO B10-MDA-CUENTA.         194200      
003186    MOVE A00-R01-AUTORIZA              TO B10-AUT-APLIC.          194300      
003187    MOVE A00-R01-FECCONT               TO WRK-R01-FECMOV.         194400      
003188    MOVE WKS-FECMOV-6D-AUX             TO B10-FEC-CARGO.          194500      
003189    MOVE A00-R01-HORMOV                TO B10-HR-CARGO.           194600      
003190    MOVE A00-R01-REFNUM                TO WKS-R01-REFNUM.         194700      
003191    MOVE WKS-R01-REF-FECJUL            TO B10-AUTD-FECJUL.        194800      
003192    MOVE WKS-R01-NUM-AUT702            TO B10-AUTD-AUT702.        194900      
003193    MOVE A00-R01-IMPORTE(WKS-NUM-OCCURS)                          195000      
003194                                       TO B10-IMPORTE.            195100      
003195    MOVE A00-R01-AUT-S151              TO B10-AUT-S151.           195200      
003196    MOVE A00-R01-AUT-ANT-S151          TO B10-AUT-ANT-S151.       195300      
003197    MOVE A00-R01-CVETRAN(WKS-NUM-OCCURS)                          195400      
003198                                       TO B10-CVE-TRANS.          195500      
003199    MOVE WKS-NUM-OCCURS                TO B10-NUM-OCURR.          195600      
003200    MOVE 1                             TO B10-STATUS.             195700      
003201    MOVE 1                             TO B10-NUM-ENV.            195800      
003202    MOVE A00-R01-FUNCION               TO B10-TIPO-MOV.           195900      
003203    MOVE 0                             TO B10-NUM-ERROR.          196000      
003204    MOVE A00-R01-CLIENTE               TO B10-NUM-CTE             196100      
003205    MOVE A00-R01-TIPO-PROC             TO B10-NUM-PROC.           196200      
003206    MOVE SPACES                        TO B10-DAT-GEN.            196300      
003207    MOVE A00-R01-FECMOV                TO WKS-FECMOV.             196400      
003208    MOVE A00-R01-HORMOV                TO WKS-HORADG.             196500      
003209    MOVE A00-R01-SUCPROM               TO B10-SUC-PROM.           196550      
003210                                                                  196600      
003211 021643-ALTA-DOMI-PEN.                                            196700      
003212*=========================================                        196800      
003213    PERFORM 021233-BEGIN-TRANS.                                   196900      
003214    PERFORM 021642-CREATE-B10.                                    197000      
003215    PERFORM 021643-MUVE-DATOS-DOMI.                               197100      
003216    MOVE 0                        TO B10-STATUS.                  197200      
003217    MOVE 0                        TO B10-NUM-ENV.                 197300      
003218    MOVE WKS-DATGEN               TO B10-DAT-GEN.                 197400      
003219    PERFORM 021234-STORE-B10.                                     197500      
003220    PERFORM 021235-END-TRANS.                                     197600      
003221                                                                  197700      
003222 022000-ACEPTA-MENSAJE.                                           197800      
003223*=========================================                        197900      
003224    MOVE ZERO                TO W77-ACEPTA-MSG                    198000      
003225                                WKS-HDR-RSLTDO                    198100      
003226                                W77-ESPERACOMS-TIPO-EVENTO        198200      
003227                                W77-CONTROL.                      198300      
003228    CALL "ESPERACOMS OF SOPORTECOMS"                              198400      
003229         USING  W77-ESPERACOMS-TIEMPO                             198500      
003230         GIVING W77-ESPERACOMS-TIPO-EVENTO.                       198600      
003231                                                                  198700      
003232    IF W88-POR-MSG  OR W88-POR-EVENTO                             198800      
003233           NEXT SENTENCE                                          198900      
003234    ELSE                                                          199000      
003235    IF W88-POR-TIMEOUT                                            199100      
003236            MOVE 1     TO W77-CONTROL                             199200      
003237            MOVE 1     TO WKS-FIN-RECEIVE                         199300      
003238    ELSE                                                          199400      
003239    IF W88-POR-ACCEPT                                             199500      
003240            MOVE 1     TO W77-CONTROL                             199600      
003241            ACCEPT WKS-BASURA                                     199700      
003242            MOVE 1     TO WKS-FIN-RECEIVE                         199800      
003243    ELSE                                                          199900      
003244    IF W88-POR-HI                                                 200000      
003245       MOVE 1     TO WKS-FIN-RECEIVE                              200100      
003246       IF W88-HI-4 OR W88-HI-6                                    200200      
003247             MOVE    1                TO W77-CONTROL              200300      
003248             PERFORM 999999-FIN                                   200400      
003249             MOVE 22         TO WKS-B05-FUNCION                   200500      
003250             MOVE 151        TO WKS-B05-SISTEMA                   200600      
003251             MOVE 13         TO WKS-B05-FCHPRO                    200700      
003252             MOVE 13         TO WKS-B05-NUMPRO                    200800      
003253             PERFORM 011100-CALLB05                               200900      
003254       ELSE                                                       201000      
003255          IF W88-HI-80                                            201100      
003256             MOVE LOW-VALUES TO CVETRAN-DOMI                      201200      
003257             PERFORM 010600-CATALOGO                              201300      
003258          ELSE                                                    201400      
003259             IF W88-HI-25                                         201500      
003260                MOVE LOW-VALUES TO CVETRAN-DOMI                   201600      
003261                MOVE SPACE TO WKS-RESP-OPE                        201620      
003262                PERFORM 022100-CAMBIO-DIA                         201700      
003263             ELSE                                                 201800      
003264                MOVE ZERO  TO W77-HI                              201900      
003265                MOVE 1     TO W77-CONTROL                         202000      
003266    ELSE                                                          202100      
003267       MOVE W77-ESPERACOMS-TIPO-EVENTO TO                         202200      
003268            WKS-ESPERACOMS-TIPO-EVENTO                            202300      
003269       STRING "EVENTO DESCONOCIDO "WKS-ESPERACOMS-TIPO-EVENTO     202400      
003270       DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                      202500      
003271       PERFORM 010630-DISPLAY                                     202600      
003272       MOVE 1        TO W77-CONTROL.                              202700      
003273                                                                  202800      
003274* COMIENZA EL RECEIVE                                             202900      
003275     IF  W77-CONTROL = ZEROS                                      203000      
003276         MOVE  SPACES                 TO  WKS-AREA-MSG-OBL        203100      
003277         RECEIVE  COMS-IN  MESSAGE    INTO  WKS-REG-MSG           203200      
003278         NO DATA NEXT SENTENCE.                                   203300      
003279     IF  W77-CONTROL = ZEROS                                      203400      
003280          IF W88-POR-MSG                                          203500      
003281             PERFORM 022200-VALIDA-DIALOGO.                       203600      
003282                                                                  203700      
003283     MOVE CS-COMS-IN-STATUS-KEY TO WKS-COMS-IN-STATUS-KEY         203800      
003284     IF W77-CONTROL = ZERO                                        203900      
003285        IF  CS-COMS-IN-STATUS-KEY  =  99                          204000      
003286            MOVE ZERO            TO CS-COMS-IN-STATUS-KEY         204100      
003287            STRING "FIN DE PROGRAMA X ESTATUS  "                  204200      
003288                    WKS-COMS-IN-STATUS-KEY                        204300      
003289            DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                 204400      
003290            PERFORM 010630-DISPLAY                                204500      
003291            MOVE  1       TO W77-FIN, WKS-FIN-RECEIVE             204600      
003292        ELSE                                                      204700      
003293        IF  CS-COMS-IN-STATUS-KEY  =  0 OR 89 OR 91 OR 92 OR 93   204800      
003294            PERFORM 010630-DISPLAY                                204900      
003295        ELSE                                                      205000      
003296           MOVE " >> ERROR RECEIVE MSG >>> " TO WKS-DIS-TEXTO     205100      
003297           PERFORM 010630-DISPLAY                                 205200      
003298           STRING "CS-COMS-IN-STATUS-KEY = "                      205300      
003299                  WKS-COMS-IN-STATUS-KEY                          205400      
003300           DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                  205500      
003301           PERFORM 010630-DISPLAY                                 205600      
003302           STRING "HEADER " WKS-HDR-MSG " ACA " WKS-ACA           205700      
003303                  " SA0 " WKS-SA0 " SA2 " WKS-SA2                 205800      
003304           DELIMITED BY SIZE INTO WKS-DIS-TEXTO                   205900      
003305           PERFORM 010630-DISPLAY.                                206000      
003306                                                                  206100      
003307 022100-CAMBIO-DIA.                                               206200      
003308*=========================================                        206300      
003309   PERFORM 010200-OBTEN-FEC-CONT.                                 206400      
003310   MOVE SPACES TO WKS-DIS-TEXTO.                                  206500      
003311   STRING "FECHA CONTABLE: "                                      206600      
003312           WKS-FECHA-PROCESO       DELIMITED BY SIZE              206700      
003313   INTO WKS-DIS-TEXTO.                                            206800      
003314   PERFORM 010630-DISPLAY.                                        206900      
003315   CLOSE  L01-DISPLAY  WITH RELEASE.                              207000      
003316   CLOSE  A02-CTL-DM   WITH SAVE.                                 207100      
003317   MOVE ZERO TO W77-STATUS-SERV WKS-BAN-HR WKS-RESET-HORA.        207200      
003318   PERFORM 010400-ARCHIVOS.                                       207300      
003319   PERFORM 010900-LLENAR-DAT-SERVS.                               207400      
003320   PERFORM 022110-INIC-CONT-EST.                                  207500      
003321   MOVE SPACES TO WKS-DIS-TEXTO.                                  207600      
003322   MOVE "CAMBIO DE DIA EXITOSO " TO WKS-DIS-TEXTO,  TEXTO-LJ.     207700      
003323   CALL "LJ IN LIB-DISP"      USING CONTADOR-LJ,    MENSAJE-LJ.   207800      
003324   PERFORM 021650-ACTUALIZA-CTRL-SERV.                            207900      
003325   PERFORM 010630-DISPLAY.                                        208000      
003326   PERFORM 010600-CATALOGO.                                       208100      
003327   PERFORM 022120-APAGA-MONITOR.                                  208200      
003328   PERFORM 011200-PROYECTA-HABIL-ANT.                             208300      
003329                                                                  208400      
003330 022119-ENCIENDE-MONITOR.                                         208500      
003331*=========================================                        208600      
003332   ACCEPT WKS-HORMAQ-HMSD        FROM  TIME                       208700      
003333   MOVE   WKS-HORMAQ-HMSD        TO WKS-RUT-MON-HORA              208800      
003334   IF WKS-STATUS-MONITOR = 1                                      208900      
003335      CLOSE  L02-MONITOR WITH SAVE.                               209000      
003336   CHANGE ATTRIBUTE TITLE        OF L02-MONITOR                   209100      
003337                                 TO WKS-TITLE-MONITOR.            209200      
003338   OPEN OUTPUT L02-MONITOR.                                       209300      
003339   MOVE  1                       TO  WKS-STATUS-MONITOR.          209400      
003340                                                                  209500      
003341 022120-APAGA-MONITOR.                                            209600      
003342*=========================================                        209700      
003343  IF  WKS-STATUS-MONITOR = 1                                      209800      
003344      CLOSE L02-MONITOR WITH SAVE.                                209900      
003345  MOVE 0                        TO WKS-STATUS-MONITOR.            210000      
003346                                                                  210100      
003347 022110-INIC-CONT-EST.                                            210200      
003348*=========================================                        210300      
003349*INICIALIZAR CONTADORES DE LOS ESTADISTICOS                       210400      
003350 MOVE ZEROES TO WKS-CONT-MSG-ENV WKS-CONT-MSG-CANC                210500      
003351                WKS-MAS-PENDIENTES.                               210525      
003352 MOVE 0         TO WKS-STATUS-CERO WKS-STATUS-CINCO.              210550      
003353                                                                  210600      
003354 020810-OBTEN-HORA.                                               210700      
003355*=========================================                        210800      
003356    MOVE 0                          TO W77-RESULT-LIBCON.         210900      
003357    MOVE 1                          TO WKS-B05-FUNCION.           211000      
003358    MOVE 151                        TO WKS-B05-SISTEMA.           211100      
003359    MOVE 14                         TO WKS-B05-NUMPRO.            211200      
003360    CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS        211300      
003361                                    GIVING W77-RESULT-LIBCON.     211400      
003362 022200-VALIDA-DIALOGO.                                           211500      
003363*=========================================                        211600      
003364    MOVE LOW-VALUES TO WKS-SENTIDO-MSG.                           211700      
003365    IF WKS-ACA-DESTINO = 015113 AND W88-SA0-TRN-DSIS-S151         211800      
003366       AND WKS-SA0-DIRECCION = 1                                  211900      
003367       IF (WKS-SA0-TRN-DCOD = 1 OR WKS-SA0-TRN-DCOD = 2)          212000      
003368           AND WKS-SA0-TRN-DSCOD = 3                              212100      
003369               IF WKS-SA2-FECHA = WKS-FECPRO-6D                   212150      
003370                  PERFORM 022210-ACT-DEACT-SERV                   212200      
003371               ELSE                                               212300      
003372        MOVE "RECEPCION MENSAJE  S702-S151"   TO WKS-SENTIDO-MSG  212320      
003373               PERFORM 021238-ESCRIBE-MONITOR                     212340      
003374        ELSE                                                      212360      
003375          PERFORM 022220-GUARDA-ECO                               212400      
003376    ELSE                                                          212500      
003377       PERFORM 022220-GUARDA-ECO.                                 212600      
003378                                                                  212700      
003379  022210-ACT-DEACT-SERV.                                          212800      
003380*=========================================                        212900      
003381    IF WKS-SA0-TRN-DCOD = 1                                       213000      
003382       MOVE 1 TO W77-STATUS-SERV                                  213100      
003383    ELSE                                                          213200      
003384       MOVE 0 TO W77-STATUS-SERV.                                 213300      
003385    MOVE 1                       TO W77-NUMREG-CTL.               213400      
003386    PERFORM 021650-ACTUALIZA-CTRL-SERV.                           213500      
003387    MOVE "RECEPCION MENSAJE  S702-S151"   TO WKS-SENTIDO-MSG.     213600      
003388    PERFORM 021238-ESCRIBE-MONITOR.                               213700      
003389    PERFORM 022220-ENVIA-RES.                                     213800      
003390                                                                  213900      
003391 022220-ENVIA-RES.                                                214000      
003392*=========================================                        214100      
003393   MOVE WKS-ACA-ORIGEN            TO WKS-ACA-DESTINO-AUX.         214200      
003394   MOVE WKS-ACA-DESTINO           TO WKS-ACA-ORIGEN.              214300      
003395   MOVE WKS-ACA-DESTINO-AUX       TO WKS-ACA-DESTINO.             214400      
003396   MOVE WKS-HDR-CCRDEST           TO WKS-HDR-DEST-AUX.            214500      
003397   MOVE WKS-HDR-COPORGN           TO WKS-HDR-ORI-AUX.             214520      
003398   MOVE WKS-HDR-DEST-AUX          TO WKS-HDR-COPORGN              214540      
003399                                     WKS-HDR-CCRORGN.             214550      
003400   MOVE WKS-HDR-ORI-AUX           TO WKS-HDR-CCRDEST.             214560      
003401                                                                  214580      
003402   IF WKS-SA0-TRN-DCOD = 1                                        214600      
003403      MOVE 1 TO WKS-SA0-TRN-DSCOD WKS-SA0-TRN-OCOD                214700      
003404   ELSE                                                           214800      
003405      MOVE 2 TO WKS-SA0-TRN-DSCOD WKS-SA0-TRN-OCOD.               214900      
003406   MOVE 702 TO WKS-SA0-TRN-DSIS.                                  215000      
003407   MOVE 20 TO WKS-SA0-TRN-DCOD.                                   215100      
003408   MOVE 2 TO WKS-SA0-DIRECCION.                                   215200      
003409   MOVE 151 TO WKS-SA0-TRN-OSIS.                                  215300      
003410   MOVE 3 TO WKS-SA0-TRN-OSCOD.                                   215400      
003411   PERFORM 021237-ENVIA-DIALOGO.                                  215500      
003412                                                                  215600      
003413 022220-GUARDA-ECO.                                               215700      
003414*=========================================                        215800      
003415   IF W88-MSGRES-ERR                                              215900      
003416      MOVE "RECEPCCION DE ECOS " TO WKS-SENTIDO-MSG               216000      
003417   ELSE                                                           216100      
003418      MOVE "MENSAJE DESCONOCIDO"   TO WKS-SENTIDO-MSG.            216200      
003419   PERFORM 021238-ESCRIBE-MONITOR.                                216300      
003420                                                                  216400      
003421 021650-ACTUALIZA-CONTROL.                                        216500      
003422*=========================================                        216600      
003423   MOVE 1                       TO W77-NUMREG-CTL.                216700      
003424   SEEK A02-CTL-DM RECORD.                                        216800      
003425   READ A02-CTL-DM.                                               216900      
003426   MOVE  W77-AUT-ENVIO500        TO R01-REG-AUTS500.              217000      
003427   REWRITE R01-REG-ENVIO INVALID KEY NEXT SENTENCE.               217100      
003428                                                                  217200      
003429 021650-ACTUALIZA-CTRL-SERV.                                      217300      
003430*=========================================                        217400      
003431    SEEK A02-CTL-DM RECORD.                                       217500      
003432    READ A02-CTL-DM.                                              217600      
003433    MOVE  W77-STATUS-SERV        TO R01-REG-SER.                  217700      
003434    REWRITE R01-REG-ENVIO INVALID KEY NEXT SENTENCE.              217800      
003435                                                                  217805      
003436 021650-ACTUALIZA-CTRL-BAN-HR.                                    217810      
003437*=========================================                        217815      
003438    SEEK A02-CTL-DM RECORD.                                       217820      
003439    READ A02-CTL-DM.                                              217825      
003440    MOVE WKS-RESET-HORA             TO R01-REG-BAN-HR.            217830      
003441    REWRITE R01-REG-ENVIO INVALID KEY NEXT SENTENCE.              217835      
003442                                                                  217900      
003443 800100-HI-SALIDA.                                                218000      
003444*=========================================                        218100      
003445    MOVE  020201                      TO CODIGO-LJ.               218200      
003446    MOVE  "I"                         TO TIPO-LJ.                 218300      
003447                                                                  218400      
003448    IF W88-HI-4                                                   218500      
003449       MOVE "TERMINACION NORMAL"      TO TEXTO-LJ                 218600      
003450    ELSE                                                          218700      
003451    IF W88-HI-6                                                   218800      
003452       MOVE "TERMINACION DE EMERGENCIA" TO TEXTO-LJ.              218900      
003453    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                      219000      
003454                                MENSAJE-LJ.                       219100      
003455                                                                  219200      
003456 000100-MUESTRA-ESTADISTICO.                                      219300      
003457*=========================================                        219400      
003458   MOVE ZEROES                     TO   W77-ESPERACOMS-NUM.       219500      
003459   MOVE W77-ESPERACOMS-TIEMPO      TO   W77-ESPERACOMS-NUM.       219600      
003460   IF W77-STATUS-SERV = 1                                         219700      
003461      MOVE " ENVIO A S702 ACTIVO     " TO   TEXTO-LJ              219800      
003462      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ         219900      
003463   ELSE                                                           220000      
003464      MOVE " ENVIO A S702 INACTIVO   " TO TEXTO-LJ                220100      
003465      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.        220200      
003466                                                                  220300      
003467      STRING                                                      220400      
003468       "NUMERO DE LIMITE DE ENVIOS ACTUAL ES      : "             220500      
003469               W77-LIMITE-ENVIOS                                  220600      
003470       DELIMITED BY SIZE INTO TEXTO-LJ                            220700      
003471       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       220800      
003472                                                                  220900      
003473      STRING                                                      221000      
003474       "NUMERO DE LIMITE DE PENDIENTES ACTUAL ES  : "             221100      
003475               W77-LIMITE-PENDIENTES                              221200      
003476       DELIMITED BY SIZE INTO TEXTO-LJ                            221300      
003477       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       221400      
003478                                                                  221500      
003479      STRING                                                      221600      
003480       "NUMERO DE LIMITE DE REINTENTOS ACTUAL ES  : "             221700      
003481               W77-LIMITE-REINTENTOS                              221800      
003482       DELIMITED BY SIZE INTO TEXTO-LJ                            221900      
003483       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       222000      
003484                                                                  222100      
003485      STRING                                                      222200      
003486      "NUMERO DE REGISTROS LEIDOS DEL ARCHIVO MOVS500 : "         222300      
003487              W77-AUT-ENVIO500                                    222400      
003488      DELIMITED BY SIZE INTO TEXTO-LJ                             222500      
003489      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.        222600      
003490                                                                  222700      
003491      STRING                                                      222800      
003492      "NUMERO DE MENSAJES ENVIADOS A S702         : "             222900      
003493              WKS-CONT-MSG-ENV                                    223000      
003494      DELIMITED BY SIZE INTO TEXTO-LJ                             223100      
003495      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.        223200      
003496                                                                  223300      
003497      STRING                                                      223400      
003498      "NUMERO DE MENSAJES CANCELADOS DE S702      : "             223500      
003499              WKS-CONT-MSG-CANC                                   223600      
003500      DELIMITED BY SIZE INTO TEXTO-LJ                             223700      
003501      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.        223800      
003502                                                                  223900      
003503      STRING                                                      224000      
003504      "TIEMPO DE ESPERACOMS ACTUAL                : "             224100      
003505              W77-ESPERACOMS-NUM                                  224200      
003506      DELIMITED BY SIZE INTO TEXTO-LJ                             224300      
003507      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.        224400      
003508                                                                  224410      
003509      STRING                                                      224420      
003510      "FECHA CONTABLE CON LA QUE ESTA TRABAJANDO EL P013  : "     224430      
003511             WKS-FECHA-PROCESO                                    224440      
003512      DELIMITED BY SIZE INTO TEXTO-LJ                             224450      
003513      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.        224460      
003514                                                                  224500      
003515 000100-HI14.                                                     224600      
003516*=========================================                        224700      
003517   IF WKS-HI-TRANS = 1                                            224800      
003518      ADD 5                   TO      W77-LIMITE-PENDIENTES       224900      
003519      MOVE "PENDIENTES"       TO W77-TEXTO-AUX-DISPLAY            225000      
003520   ELSE                                                           225100      
003521   IF WKS-HI-TRANS = 2                                            225200      
003522      ADD 5                   TO      W77-LIMITE-REINTENTOS       225300      
003523      MOVE "REINTENTOS"       TO W77-TEXTO-AUX-DISPLAY            225400      
003524   ELSE                                                           225500      
003525   IF WKS-HI-TRANS = 3                                            225600      
003526      ADD 5                   TO      W77-LIMITE-ENVIOS           225700      
003527      MOVE "ENVIOS"           TO W77-TEXTO-AUX-DISPLAY.           225800      
003528                                                                  225900      
003529   STRING "SE INCREMENTA EN 5 EL LIMITE DE "                      226000      
003530           W77-TEXTO-AUX-DISPLAY DELIMITED BY SIZE INTO TEXTO-LJ  226100      
003531   MOVE TEXTO-LJ TO WKS-DIS-TEXTO.                                226200      
003532   PERFORM 000110-GUARDA-LIMITES.                                 226300      
003533                                                                  226400      
003534 000100-HI15.                                                     226500      
003535*=========================================                        226600      
003536   IF WKS-HI-TRANS = 1                                            226700      
003537      SUBTRACT 5      FROM  W77-LIMITE-PENDIENTES                 226800      
003538      MOVE "PENDIENTES"       TO W77-TEXTO-AUX-DISPLAY            226900      
003539   ELSE                                                           227000      
003540   IF WKS-HI-TRANS = 2                                            227100      
003541      SUBTRACT 5      FROM  W77-LIMITE-REINTENTOS                 227200      
003542      MOVE "REINTENTOS"       TO W77-TEXTO-AUX-DISPLAY            227300      
003543   ELSE                                                           227400      
003544   IF WKS-HI-TRANS = 3                                            227500      
003545      SUBTRACT 5      FROM  W77-LIMITE-ENVIOS                     227600      
003546      MOVE "ENVIOS"   TO      W77-TEXTO-AUX-DISPLAY.              227700      
003547   STRING "SE DECREMENTA EN 5 EL LIMITE DE "                      227800      
003548          W77-TEXTO-AUX-DISPLAY DELIMITED BY SIZE INTO TEXTO-LJ   227900      
003549   MOVE TEXTO-LJ TO WKS-DIS-TEXTO.                                228000      
003550   PERFORM 000110-GUARDA-LIMITES.                                 228100      
003551                                                                  228200      
003552 000100-HI16.                                                     228300      
003553*=========================================                        228400      
003554   IF WKS-HI-TRANS = 1                                            228500      
003555      MOVE 150                TO W77-LIMITE-PENDIENTES            228600      
003556      MOVE "PENDIENTES"       TO W77-TEXTO-AUX-DISPLAY            228700      
003557   ELSE                                                           228800      
003558   IF WKS-HI-TRANS = 2                                            228900      
003559      MOVE 50                 TO W77-LIMITE-REINTENTOS            229000      
003560      MOVE "REINTENTOS"       TO W77-TEXTO-AUX-DISPLAY            229100      
003561   ELSE                                                           229200      
003562   IF WKS-HI-TRANS = 3                                            229300      
003563      MOVE 300                TO W77-LIMITE-ENVIOS                229400      
003564      MOVE "ENVIOS"           TO W77-TEXTO-AUX-DISPLAY.           229500      
003565   STRING "SE RESTABLECE EL LIMITE DE "                           229600      
003566          W77-TEXTO-AUX-DISPLAY DELIMITED BY SIZE INTO TEXTO-LJ   229700      
003567   MOVE TEXTO-LJ TO WKS-DIS-TEXTO.                                229800      
003568   PERFORM 000110-GUARDA-LIMITES.                                 229900      
003569                                                                  230000      
003570 000110-GUARDA-LIMITES.                                           230100      
003571*=========================================                        230200      
003572   MOVE 37                      TO WKS-B05-FUNCION.               230300      
003573   MOVE W77-LIMITE-PENDIENTES   TO WKS-B05-HORAINI.               230400      
003574   MOVE W77-LIMITE-REINTENTOS   TO WKS-B05-HORAFIN.               230500      
003575   MOVE W77-LIMITE-ENVIOS       TO WKS-B05-NUMREGFIN.             230600      
003576   IF W77-LIMITE-ENVIOS < 80                                      230700      
003577      MOVE 80 TO W77-LIMITE-ENVIOS.                               230800      
003578   IF W77-LIMITE-PENDIENTES < 40                                  230900      
003579      MOVE 40 TO W77-LIMITE-PENDIENTES.                           231000      
003580   IF W77-LIMITE-REINTENTOS < 40                                  231100      
003581      MOVE 40 TO W77-LIMITE-REINTENTOS.                           231200      
003582   PERFORM 011100-CALLB05.                                        231300      
003583                                                                  231400      
003584 011290-RESET-PEND-ANT.                                           231500      
003585*======================                                           231600      
003586    MOVE 1                       TO WKS-STATUS.                   231700      
003587    MOVE WKS-FECPRO-ANT-6D       TO WKS-FEC-REINT.                231800      
003588    MOVE 86399                   TO WKS-SEG-MAQUINA.              231900      
003589    PERFORM 021310-FIND-FIRST-REINT.                              232000      
003590    IF WKS-EOF-B10 = 0                                            232100      
003591       PERFORM 011295-RESET-HRS-ENV UNTIL WKS-EOF-B10 = 1.        232200      
003592    MOVE 3                       TO WKS-STATUS.                   232300      
003593    PERFORM 021310-FIND-FIRST-REINT.                              232400      
003594    IF WKS-EOF-B10 = 0                                            232500      
003595       PERFORM 011295-RESET-HRS-ENV UNTIL WKS-EOF-B10 = 1.        232600      
003596    MOVE 1                       TO WKS-RESET-HORA.               232605      
003597    PERFORM 021650-ACTUALIZA-CTRL-BAN-HR.                         232610      
003598                                                                  232700      
003599 011295-RESET-HRS-ENV.                                            232800      
003600*=====================                                            232900      
003601    PERFORM 021233-BEGIN-TRANS.                                   233000      
003602    MOVE 0                TO B10-HR-ENVIO.                        233100      
003603    PERFORM 021234-STORE-B10.                                     233200      
003604    PERFORM 021235-END-TRANS.                                     233300      
003605    PERFORM 021240-FINDNEXT-REINTENTO.                            233400      
003606                                                                  235000      
003607 021221-VALIDA-FINPEND.                                           235100      
003608*=====================                                            235200      
003609   IF WKS-EOF-B10 = 1 AND WKS-STATUS = 0                          235300      
003610      MOVE 1 TO WKS-STATUS-CERO.                                  235400      
003611   IF WKS-EOF-B10 = 1 AND WKS-STATUS = 5                          235500      
003612      MOVE 1 TO WKS-STATUS-CINCO.                                 235600      
003613                                                                  235700      
003614 021222-VALIDA-SERV.                                              235800      
003615*=====================                                            235900      
003616                                                                  235950      
003617    ACCEPT  WKS-HRS-ACT             FROM TIME.                    236000      
003618    IF WKS-HR-ACT-HH = 06 AND W77-STATUS-SERV = 0                 236100      
003619       MOVE 1 TO WKS-BAN-HR                                       236150      
003620    STRING " SERVICIO DE ENVIO DE INFORMACION AL S702 NO ACTIVO " 236200      
003621           " DESEA ACTIVAR EL SERVICIO: S/N "                     236300      
003622       DELIMITED BY SIZE INTO TEXTO-LJ                            236400      
003623       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        236450      
003624       ACCEPT WKS-RESP-OPE                                        236500      
003625       IF WKS-RESP-OPE = "S"                                      236600      
003626          MOVE 1 TO W77-STATUS-SERV.                              236700      
