000001$SET LIST MAP XREF LINEINFO ERRORLIMIT=100                        000100      
000002*$SET OPTIMIZE                                                    000200      
000003*$SET TADS                                                        000300      
000004******************************************************************000400      
000005*  PROGRAMA QUE OBTIENE REPORTE DE TOTALES POR CLAVE DE TRAN-    *000500      
000006*  SACCION PARA LOS SISTEMAS QUE NO HAN IMPLEMENTADO PUNTEO.     *000600      
000007*                                                                *000610      
000008*  RECOMPILACION POR ELNUPGRADE DEL  MCP A 55                    *000620      
000009*  20141208 15MTP001 MJGRG                                       *000630      
000010******************************************************************000700      
000011 IDENTIFICATION DIVISION.                                         000800      
000012 PROGRAM-ID.      P112.                                           000900      
000013 AUTHOR.          LINO HECTOR TORRES CORONADO.                    001000      
000014 INSTALLATION.    BANAMEX.                                        001100      
000015 DATE-WRITTEN.    JULIO DE 1998.                                  001200      
000016 ENVIRONMENT DIVISION.                                            001300      
000017 INPUT-OUTPUT SECTION.                                            001400      
000018 FILE-CONTROL.                                                    001500      
000019      SELECT L01-DATOS             ASSIGN TO DISK                 001600      
000020                                   ACCESS MODE IS SEQUENTIAL.     001700      
000021                                                                  001800      
000022      SELECT A01-SDO-MOVS          ASSIGN TO SORT DISK.           001900      
000023                                                                  002000      
000024      SELECT A02-ARCH-SORT         ASSIGN TO DISK.                002100      
000025                                                                  002200      
000026      SELECT V00-REPORTE2          ASSIGN TO PRINTER.             002300      
000027                                                                  002400      
000028      SELECT V00-REP-CVES          ASSIGN TO PRINTER.             002500      
000029                                                                  002600      
000030      SELECT ARCH-CAT              ASSIGN TO DISK                 003300      
000031                                   ORGANIZATION IS INDEXED        003400      
000032                                   ACCESS MODE IS RANDOM          003500      
000033                                   RECORD KEY IS KEY-CAT.         003600      
000034                                                                  003700      
000035/                                                                 003800      
000036 DATA DIVISION.                                                   003900      
000037 FILE SECTION.                                                    004000      
000038                                                                  004100      
000039 FD L01-DATOS                                                     004200      
000040    VALUE OF BUFFERS IS 1                                         004300      
000041    VALUE OF TITLE   IS WKS-TIT-LOG151                            004500      
000042    BLOCK CONTAINS   144 RECORDS.                                 004600      
000043 01  L01-R00-DAT                   PIC X(450).                    004700      
000044*                                                                 004800      
000045 SD A01-SDO-MOVS.                                                 005700      
000046 01  A01-R00-REG.                                                 005800      
000047     03 A01-R00-KEY                PIC X(16).                     005900      
000048     03 A01-R00-IMPORTE            PIC 9(14)V99.                  006000      
000049     03 FILLER                     PIC X(04).                     006100      
000050*                                                                 006200      
000051 FD A02-ARCH-SORT                                                 006300      
000052     BLOCK CONTAINS 900 RECORDS,                                  006400      
000053     RECORD CONTAINS 60 CHARACTERS,                               006500      
000054     VALUE OF AREAS IS 1000, AREASIZE IS 6000.                    006600      
000055 01 A02-R00-REG-DISK               PIC X(36).                     006700      
000056*                                                                 006800      
000057 FD V00-REP-CVES.                                                 006900      
000058                                                                  007000      
000059 01 V00-R00-CVES                   PIC X(132).                    007100      
000060*                                                                 007200      
000061 FD V00-REPORTE2                                                  007300      
000062    VALUE OF TITLE IS WKS-TIT-REPORTE2.                           007400      
000063 01 V00-R00-REPORTE2               PIC X(132).                    007500      
000064                                                                  007600      
000065 FD ARCH-CAT                                                      007700      
000066    VALUE OF BUFFERS IS 40                                        007800      
000067    VALUE OF SECURITYTYPE IS PUBLIC                               007900      
000068    VALUE OF DEPENDENTSPECS IS TRUE                               008000      
000069    VALUE OF TITLE IS WKS-TIT-CVETR1.                             008100      
000070 01 REG-CAT.                                                      008200      
000071    03 KEY-CAT.                                                   008300      
000072       05 CAT-SIST                            PIC 9(04) COMP.     008400      
000073       05 CAT-CVETRA                          PIC 9(04) COMP.     008500      
000074       05 CAT-ESQCON                          PIC 9(08) COMP.     008600      
000075       05 CAT-ESQCON-R REDEFINES CAT-ESQCON.                      008700      
000076          07 CAT-ESQ                          PIC 9(04) COMP.     008800      
000077          07 CAT-MON                          PIC 9(04) COMP.     008900      
000078       05 CAT-LIBRO                           PIC 9(06) COMP.     009000      
000079       05 CAT-CIA                             PIC 9(02) COMP.     009100      
000080    03 CAT-GUIAC                              PIC 9(06) COMP.     009200      
000081                                                                  009300      
000082*                                                                 009400      
000083                                                                  009500      
000084 WORKING-STORAGE SECTION.                                         009600      
000085                                                                  009700      
000086*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000087* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP002 ON CMEMP."         009720      
000088*                                    FROM 000100 TO 099999      . 009740      
000089                                                                  000100      
000090*----------------------------------------------------------------*000200      
000091*     VARIABLES PARA EL CALCULO DINAMICO DE ESPACIO PARA SORT    *000300      
000092*----------------------------------------------------------------*000400      
000093 77  W77-FRAMESIZE                PIC  9(002) COMP.               000500      
000094 77  W77-LASTRECORD               PIC  9(012) COMP.               000600      
000095 77  W77-MAXRECSIZE               PIC  9(012) COMP.               000700      
000096 77  W77-DISK-SIZE                PIC  9(018) COMP.               000800      
000097 77  W77-MEMORY-SIZE              PIC  9(018) COMP.               000900      
000098 77  W77-MEMORY-65K               PIC  9(018) COMP.               001000      
000099 01  WS-CALC-WORD                 PIC  9(012)V99.                 001100      
000100 01  WS-CALC-WORD-RED   REDEFINES WS-CALC-WORD.                   001200      
000101     02 WS-WORD-ENT               PIC  9(012).                    001300      
000102     02 WS-WORD-RES               PIC  9(002).                    001400      
000103                                                                  001500      
000104*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000105*=============    VARIABLES LIBRERIA DE CONTROL    ============== 009800      
000106                                                                  009900      
000107*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000108* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL.".                  010000      
000109*================================================================ 000100      
000110*         ENTRY-POINT CONSISDIA :                               = 000200      
000111*                                                                 000300      
000112* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000113* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000114* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000115* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000116* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000117* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000118* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000119* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000120* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000121* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000122*                                                               = 001400      
000123*================================================================ 001500      
000124                                                                  001600      
000125                                                                  001700      
000126*================================================================ 001800      
000127* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000128*                                                               = 002000      
000129* ENTRADA REQUERIDA :                                           = 002100      
000130*                                                               = 002200      
000131*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000132*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000133*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000134*================================================================ 002600      
000135 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000136    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000137    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000138    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000139    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000140    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000141    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000142    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000143    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000144    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000145    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000146    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000147    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000148    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000149    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000150    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000151    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000152    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000153    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000154    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000155    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000156       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000157       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000158       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000159       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000160*==============================================================   005200      
000161*                                                             =   005300      
000162* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000163*                                                             =   005500      
000164* CAMPOS REQUERIDOS :                                         =   005600      
000165*                                                             =   005700      
000166* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000167* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000168* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000169* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000170*==============================================================   006200      
000171 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000172    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000173    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000174    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000175    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000176                                                                  006800      
000177*==============================================================   006900      
000178*                                                             =   007000      
000179* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000180*                                                             =   007200      
000181* CAMPOS REQUERIDOS :                                         =   007300      
000182*                                                             =   007400      
000183* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000184* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000185* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000186* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000187*==============================================================   007900      
000188 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000189    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000190    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000191    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000192    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000193                                                                  008500      
000194*==============================================================   008600      
000195*                                                             =   008700      
000196* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000197*                                                             =   008900      
000198* CAMPOS REQUERIDOS :                                         =   009000      
000199*                                                             =   009100      
000200* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000201* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000202* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000203* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000204*==============================================================   009600      
000205 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000206    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000207    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000208    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000209    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000210                                                                  010200      
000211*============================================================     010300      
000212* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000213*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000214*                                                           =     010600      
000215*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000216*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000217*                                                           =     010900      
000218*  ENTRADA REQUERIDA.                                       =     011000      
000219*                                                           =     011100      
000220*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000221*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000222*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000223*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000224*============================================================     011600      
000225                                                                  011700      
000226 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000227     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000228     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000229     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000230     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000231                                                                  012300      
000232*=============================================================    012400      
000233*                                                            =    012500      
000234* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000235*             B01-SIS-FECARMOV.                              =    012700      
000236*                                                            =    012800      
000237* ENTRADA REQUERIDAD :                                       =    012900      
000238*                                                            =    013000      
000239*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000240*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000241*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000242*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000243*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000244*=============================================================    013600      
000245                                                                  013700      
000246 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000247     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000248     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000249     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000250     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000251     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000252*================================================================ 014400      
000253*                                                               = 014500      
000254* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000255*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000256*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000257*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000258*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000259*                                                               = 015100      
000260* ENTRADA REQUERIDA :                                           = 015200      
000261*                                                               = 015300      
000262* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000263* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000264* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000265* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000266* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000267*================================================================ 015900      
000268 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000269    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000270    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000271    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000272    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000273    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000274                                                                  016600      
000275*============================================================     016700      
000276*                                                           =     016800      
000277* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000278*                                                           =     017000      
000279* DATOS REQUERIDOS :                                        =     017100      
000280*                                                           =     017200      
000281* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000282* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000283* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000284* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000285* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000286*============================================================     017800      
000287                                                                  017900      
000288 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000289     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000290     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000291     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000292     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000293     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000294                                                                  018600      
000295*============================================================     018700      
000296*                                                           =     018800      
000297* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000298*                                                           =     019000      
000299* DATOS REQUERIDOS :                                        =     019100      
000300*                                                           =     019200      
000301* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000302* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000303* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000304* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000305* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000306*============================================================     019800      
000307                                                                  019900      
000308 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000309     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000310     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000311     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000312     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000313     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000314                                                                  020600      
000315*===============================================================  020700      
000316*                                                              =  020800      
000317* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000318*              MOVIMIENTOS.                                    =  021000      
000319* DATOS REQUERIDOS :                                           =  021100      
000320*                                                              =  021200      
000321* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000322* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000323* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000324* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000325* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000326* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000327*==============================================================   021900      
000328                                                                  022000      
000329 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000330     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000331     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000332     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000333     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000334     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000335     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000336*==============================================================   022800      
000337*                                                             =   022900      
000338* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000339*                                                             =   023100      
000340* CAMPOS REQUERIDOS :                                         =   023200      
000341*                                                             =   023300      
000342* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000343* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000344* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000345* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000346*==============================================================   023800      
000347 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000348    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000349    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000350    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000351    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000352                                                                  024304      
000353*=================================================================024306      
000354*                ENTRY POINT CONSISB01                           =024308      
000355*                                                                =024310      
000356*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000357*                                                                =024314      
000358*  FUNCIONES DISPONIBLES :                                       =024316      
000359*                                                                =024318      
000360*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000361*                                                                =024322      
000362*  PARAMETROS REQUERIDOS                                         =024324      
000363*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000364*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000365*=================================================================024330      
000366                                                                  024332      
000367 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000368     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000369     03 WKS-CON-CSI                PIC 9(02).                     024336      
000370     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000371     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000372        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000373        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000374        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000375        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000376        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000377                                                                  024400      
000378*=================================================================024500      
000379*                ENTRY POINT B02ARCINTER                         =024600      
000380*                                                                =024700      
000381*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000382*                                                                =024900      
000383*  FUNCIONES DISPONIBLES :                                       =025000      
000384*                                                                =025100      
000385*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000386* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000387* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000388* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000389*                                                                =025600      
000390*  PARAMETROS REQUERIDOS                                         =025700      
000391*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000392*                                                                =025900      
000393*=================================================================026000      
000394 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000395     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000396     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000397     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000398     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000399     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000400     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000401     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000402     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000403     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000404     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000405     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000406     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000407     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000408     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000409     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000410     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000411     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000412     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000413     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000414     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000415     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000416     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000417     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000418     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000419     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000420     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000421     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000422     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000423                                                                  029000      
000424*=================================================================029100      
000425*                ENTRY POINT B04SISTEMA                          =029200      
000426*                                                                =029300      
000427*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000428*                                                                =029500      
000429*  FUNCIONES DISPONIBLES :                                       =029600      
000430*                                                                =029700      
000431*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000432*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000433*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000434*                                                                =030100      
000435*  PARAMETROS REQUERIDOS                                         =030200      
000436*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000437*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000438*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000439*                                                                =030600      
000440*=================================================================030700      
000441 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000442     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000443     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000444     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000445     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000446     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000447     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000448     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000449                                                                  031600      
000450*================================================================ 031700      
000451*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000452*                                                               = 031900      
000453*  FUNCION                                                      = 032000      
000454*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000455*   19       ALTAS.                                             = 032200      
000456*   22       BAJAS                                              = 032300      
000457*   37       CAMBIOS.                                           = 032400      
000458*                                                               = 032500      
000459*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000460*                      FECHA DE PROCESO                         = 032700      
000461*                      NUMERO DE PROCESO                        = 032800      
000462*                      FECHA INICIO                             = 032900      
000463*                      REGISTRO INICIAL                         = 033000      
000464*================================================================ 033100      
000465                                                                  033200      
000466 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000467     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000468     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000469     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000470     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000471     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000472     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000473     03 WKS-B05-MIX                PIC 9(08).                     034000      
000474     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000475     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000476     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000477     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000478     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000479     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000480                                                                  034700      
000481                                                                  034800      
000482*================================================================ 034900      
000483*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000484*                                                               = 035100      
000485*  FUNCION                                                      = 035200      
000486*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000487*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000488*                                                               = 035500      
000489*================================================================ 035600      
000490                                                                  035700      
000491 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000492     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000493     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000494     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000495     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000496     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000497     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000498                                                                  036500      
000499*===============================================================  036600      
000500*                                                              =  036700      
000501*         ENTRY-POINT CONSISMEN                                =  036800      
000502*                                                              =  036900      
000503*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000504*                      SISTEMA                                 =  037100      
000505*                                                              =  037200      
000506*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000507*                                                              =  037400      
000508*===============================================================  037500      
000509 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000510     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000511     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000512     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000513     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000514     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000515     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000516     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000517     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000518     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000519     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000520     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000521     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000522     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000523     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000524     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000525        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000526        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000527        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000528        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000529        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000530        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000531        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000532                                                                  039900      
000533*=====================================================            040000      
000534*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000535*=====================================================            040200      
000536 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000537     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000538     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000539     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000540                                                                  040700      
000541*=====================================================            040800      
000542*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000543*=====================================================            041000      
000544 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000545     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000546     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000547     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000548                                                                  041500      
000549*=====================================================            041600      
000550*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000551*=====================================================            041800      
000552 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000553     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000554     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000555     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000556*=====================================================            042300      
000557*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000558*=====================================================            042500      
000559 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000560     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000561     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000562     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000563                                                                  043000      
000564*=====================================================            043100      
000565*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000566*=====================================================            043300      
000567 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000568     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000569     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000570     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000571                                                                  043800      
000572*=====================================================            043900      
000573*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000574*=====================================================            044100      
000575 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000576     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000577     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000578     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000579                                                                  044600      
000580*=====================================================            044700      
000581*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000582*=====================================================            044900      
000583 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000584     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000585     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000586     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000587                                                                  045400      
000588*=====================================================            045500      
000589*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000590*=====================================================            045700      
000591 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000592     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000593     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000594     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000595                                                                  046200      
000596*=====================================================            046300      
000597*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000598*=====================================================            046500      
000599 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000600     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000601     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000602     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000603                                                                  047000      
000604*=====================================================            047100      
000605*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000606*=====================================================            047300      
000607 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000608     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000609     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000610     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000611                                                                  047800      
000612*=====================================================            047900      
000613*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000614*=====================================================            048100      
000615 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000616     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000617     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000618     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000619                                                                  048600      
000620*=====================================================            048700      
000621*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000622*=====================================================            048900      
000623 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000624     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000625     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000626     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000627                                                                  049400      
000628*=====================================================            049500      
000629*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000630*=====================================================            049700      
000631 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000632     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000633     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000634     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000635     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000636     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000637     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000638     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000639     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000640     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000641     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000642                                                                  050900      
000643*=====================================================            051000      
000644*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000645*=====================================================            051200      
000646 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000647     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000648     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000649     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000650     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000651                                                                  051800      
000652*=====================================================            051900      
000653*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000654*=====================================================            052100      
000655 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000656     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000657     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000658     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000659     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000660                                                                  052700      
000661*=====================================================            052800      
000662*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000663*=====================================================            053000      
000664 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000665     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000666     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000667     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000668     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
000669                                                                  053600      
000670*=====================================================            053700      
000671*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
000672*=====================================================            053900      
000673 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
000674     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
000675     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
000676     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
000677     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
000678                                                                  054500      
000679*=====================================================            054600      
000680*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
000681*=====================================================            054800      
000682 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
000683     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
000684     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
000685     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
000686     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
000687                                                                  055400      
000688*=====================================================            055500      
000689*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
000690*=====================================================            055700      
000691 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
000692     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
000693     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
000694     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
000695     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
000696                                                                  056300      
000697*=====================================================            056400      
000698*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
000699*=====================================================            056600      
000700 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
000701     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
000702     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
000703     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
000704     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
000705                                                                  057200      
000706 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
000707*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000708                                                                  010100      
000709*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000710* COPY "(S151)CITIDIRECT/S151/FORMATO/DISPLAY.".                  010200      
000711                                                                  000100      
000712*===============================================================* 000200      
000713*         FORMATO PARA DISPLAYS                                 * 000300      
000714*===============================================================* 000400      
000715                                                                  000500      
000716 01 WKS-TIT-REPORTE2.                                             000600      
000717    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000718    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000719    02 FILLER                       PIC X(06) VALUE               000900      
000720                                              "/LIST/".           001000      
000721    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000722    02 FILLER                       PIC X(01) VALUE "/".          001071      
000723    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000724    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000725    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000726    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000727    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000728    02 FILLER                       PIC X(11) VALUE               001600      
000729                                              "/001MSGIMP.".      001700      
000730                                                                  002100      
000731 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000732                                                                  002300      
000733***********************************************************       002400      
000734*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000735***********************************************************       002600      
000736 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000737*8D                                                               002800      
000738 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000739 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000740    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000741    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000742    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000743*8D                                                               003400      
000744 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000745 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000746    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000747    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000748    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000749                                                                  004100      
000750 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000751                                                                  004300      
000752 01 WKS-FECHA-HORA2.                                              004400      
000753    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000754    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000755       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000756       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000757    02 WKS-TIME-MAQ2.                                             004600      
000758       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
000759       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
000760          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
000761          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
000762          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
000763       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
000764    02 FILLER                             PIC X(01).              004900      
000765    02 WKS-RESTO2                         PIC X(04).              005000      
000766                                                                  005100      
000767*8D                                                               005200      
000768****************** REPORTE DE MENSAJES *********************      005300      
000769 01 WLI-ENCAB-12.                                                 005400      
000770    03 FILLER                             PIC X(05) VALUE         005500      
000771       "S151-".                                                   005600      
000772    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000773    03 FILLER                             PIC X(15) VALUE         005671      
000774       "-001IMPMENSAJES".                                         005691      
000775    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000776    03 FILLER                             PIC X(34) VALUE         005800      
000777       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000778    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000779    03 FILLER                             PIC X(26) VALUE         006100      
000780       "FECHA DE LA INFORMACION : ".                              006200      
000781    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000782    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000783       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000784       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000785       05  WKS-SLASH1                         PIC X(01).          006356      
000786       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000787       05  WKS-SLASH2                         PIC X(01).          006358      
000788       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000789 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000790 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000791    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000792    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000793    03 FILLER                          PIC X(01).                 006371      
000794    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000795    03 FILLER                          PIC X(01).                 006381      
000796    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000797*8D                                                               006400      
000798 01 WLI-ENCAB-22.                                                 006500      
000799     03 FILLER                          PIC X(11) VALUE           006600      
000800        "F.PROCESO: ".                                            006700      
000801     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000802     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000803     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
000804     03 FILLER                          PIC X(01) VALUE ":".      007020      
000805     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
000806     03 FILLER                          PIC X(01) VALUE ":".      007060      
000807     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
000808     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000809     03 FILLER                          PIC X(24) VALUE           007200      
000810              "IMPRESION MENSAJES DEL S".                         007300      
000811     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000812     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000813     03 FILLER                          PIC X(14) VALUE           007600      
000814        "TIPO PROCESO: ".                                         007700      
000815     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000816*8D                                                               007900      
000817 01 WLI-ENCAB-32.                                                 008000      
000818     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000819*       "VERSION  : ".                                            008200      
000820*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000821     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000822     03 FILLER                     PIC X(07) VALUE                008500      
000823        "HOJA : ".                                                008600      
000824     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000825                                                                  008800      
000826 01 WLI-ENCAB-42.                                                 008900      
000827     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000828     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000829     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000830                                                                  009300      
000831 01 WLI-ENCAB-52.                                                 009400      
000832    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000833    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000834    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000835    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000836                                                                  009900      
000837****************************************************************  010000      
000838*                 CONTADORES DE HOJAS                          *  010100      
000839****************************************************************  010200      
000840                                                                  010300      
000841  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000842*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000843                                                                  010300      
000844                                                                  010400      
000845*=============    VARIABLES LIB. CTL DE VERSIONES  ============== 010500      
000846                                                                  010600      
000847 01  WKS-LIBID                     PIC X(12).                     010700      
000848 01  WKS-NOMBLIB                   PIC X(72).                     010800      
000849 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             010900      
000850                                                                  011000      
000851  01 WKS-TIT-CVETR1.                                              011100      
000852     03 FILLER                PIC X(17) VALUE "S151/FILE/CVEGUIA".011200      
000853     03 WKS-SIST-CAT          PIC 9(03).                          011300      
000854     03 FILLER                PIC X(01) VALUE "/".                011400      
000855     03 WKS-FEC-CAT           PIC 9(06).                          011500      
000856     03 FILLER                PIC X     VALUE ".".                011600      
000857                                                                  011700      
000858*****************************************                         011800      
000859*          NOMBRES  DE  BACKUPS         *                         011900      
000860*****************************************                         012000      
000861 01 WKS-TIT-REPORTE.                                              012100      
000862    02 FILLER                     PIC X(01) VALUE "S".            012200      
000863    02 WKS-SIS-REP                PIC 9(03).                      012300      
000864    02 FILLER                     PIC X(11) VALUE "/LIST/P112/".  012400      
000865    02 WKS-TIT-CSI                PIC 9(02) VALUE 0.              012500      
000866    02 FILLER                     PIC X(08) VALUE "00/R000/".     012600      
000867    02 WKS-FEC-REP                PIC 9(06).                      012700      
000868    02 FILLER                     PIC X(1)  VALUE "/".            012800      
000869    02 WKS-MIX-REP                PIC 9(07) VALUE 0.              012900      
000870    02 FILLER                     PIC X(14) VALUE                 013000      
000871                                      "/001TOTCVE151.".           013100      
000872******************************************************************013200      
000873*                VARIABLES DE DIVERSO USO                        *013300      
000874******************************************************************013400      
000875 77  W77-FIN                       PIC 9     VALUE 0.             013500      
000876 77  W77-IND                       PIC 9(05) VALUE 0.             013600      
000877 77  W77-NUM-LINEAS                PIC 9(02) VALUE 0.             013700      
000878 77  W77-IND-FON                   PIC 9(02).                     013800      
000879 77  W77-IND-INS                   PIC 9(02).                     013900      
000880 77  W77-NUMERO-MIX                PIC 9(07).                     014000      
000881 77  W77-IMPMOV                    PIC 9(16)V99.                  014100      
000882 77  W77-NUMMOV                    PIC 9(08).                     014200      
000883 77  W77-CAMPO-DISPLAY             PIC 9(12).                     014400      
000884 77  W77-SW-CAT502                 PIC 9(01) VALUE 0.             014500      
000885 77  W77-SW-CAT500                 PIC 9(01) VALUE 0.             014600      
000886************************************************************      014700      
000887*         TITULOS DEL REPORTE DE CLAVES DE TRAN.           *      014800      
000888************************************************************      014900      
000889 01  WLI-TIT1-RESUM.                                              015000      
000890     03 FILLER                     PIC X(22) VALUE                015100      
000891        "S151-P112-TOTCVE      ".                                 015200      
000892     03 FILLER                     PIC X(23) VALUE SPACES.        015300      
000893     03 FILLER                     PIC X(42) VALUE                015400      
000894              "ADMINISTRACION  DE  SALDOS  Y  MOVIMIENTOS".       015500      
000895     03 FILLER                     PIC X(09) VALUE SPACES.        015600      
000896     03 FILLER                     PIC X(26) VALUE                015700      
000897                              "FECHA DE LA INFORMACION : ".       015800      
000898     03 WLI-RP-E1-FECHA-INF        PIC 9999/99/99.                015900      
000899                                                                  016000      
000900 01  WLI-TIT2-RESUM.                                              016100      
000901     03 FILLER                     PIC X(11) VALUE                016200      
000902        "F.PROCESO: ".                                            016300      
000903     03 WLI-RP-E2-FECHA-PROC       PIC 9999/99/99.                016400      
000904     03 FILLER                     PIC X      VALUE SPACE.        016500      
000905     03 WLI-RP-E2-HORA-TIT         PIC 9(02).                     016600      
000906     03 FILLER                     PIC X(01) VALUE ":".           016620      
000907     03 WLI-RP-E2-MINU-TIT         PIC 9(02).                     016640      
000908     03 FILLER                     PIC X(01) VALUE ":".           016660      
000909     03 WLI-RP-E2-SEGU-TIT         PIC 9(02).                     016680      
000910     03 FILLER                     PIC X(22) VALUE SPACES.        016700      
000911     03 FILLER                     PIC X(27) VALUE                016800      
000912              "TOTAL POR CLAVE DEL SIST. S".                      016900      
000913     03 WLI-RP-E3-SISTEMA          PIC 9(03).                     017000      
000914     03 FILLER                     PIC X(30) VALUE SPACES.        017100      
000915     03 FILLER                     PIC X(16) VALUE                017200      
000916        "         HOJA : ".                                       017300      
000917     03 WLI-RP-E3-HOJA             PIC 9999.                      017400      
000918                                                                  017500      
000919 01 WLI-TIT3-RESUM.                                               017600      
000920     03 FILLER                     PIC X(21) VALUE  SPACES.       017700      
000921*lpb    "VERSION  : ".                                            017800      
000922*lpb 03 WLI-RP-E3-VERSION          PIC 9999/99/99.                017900      
000923     03 FILLER                     PIC X(85) VALUE SPACES.        018000      
000924     03  WLI-NUM-LIBRO             PIC    ZZ.                     018100      
000925     03  FILLER                    PIC X(02) VALUE SPACES.        018200      
000926     03  WLI-NOMBRE-LIBRO          PIC X(22) VALUE SPACES.        018300      
000927                                                                  018400      
000928 01  WLI-TIT5-RESUM.                                              018500      
000929     03  WLI-TIT-PROD              PIC X(12) VALUE SPACES.        018600      
000930     03  WLI-NUM-PRO               PIC  9999.                     018700      
000931     03  FILLER                    PIC X(02) VALUE SPACES.        018800      
000932     03  WLI-NOMBRE-PRO            PIC X(25) VALUE SPACES.        018900      
000933     03  FILLER                    PIC X(02) VALUE SPACES.        019000      
000934     03  WLI-NUM-MON               PIC    Z9.                     019100      
000935     03  FILLER                    PIC X(02) VALUE SPACES.        019200      
000936     03  WLI-NOMBRE-MON            PIC X(20) VALUE SPACES.        019300      
000937                                                                  019400      
000938 01  WLI-TIT5-CVES.                                               019500      
000939     03 FILLER                     PIC X(39) VALUE                019600      
000940        "CVE.TRAN. ESQ.        NOMBRE          ".                 019700      
000941     03 FILLER                     PIC X(41) VALUE                019800      
000942        " NUM.              IMPORTE     S028  S115".              019900      
000943                                                                  020000      
000944 01 WLI-DET.                                                      020100      
000945    03 FILLER                     PIC XX    VALUE SPACES.         020200      
000946    03 WLI-CVET                   PIC ZZZ9.                       020300      
000947    03 FILLER                     PIC X(04) VALUE SPACES.         020400      
000948    03 WLI-ESQC                   PIC ZZZ9.                       020500      
000949    03 FILLER                     PIC X(02) VALUE SPACES.         020600      
000950    03 WLI-NOMBRE                 PIC X(20) VALUE SPACES.         020700      
000951    03 FILLER                     PIC X(02) VALUE SPACES.         020800      
000952    03 WLI-NUMC                   PIC ZZ,ZZ9.                     020900      
000953    03 FILLER                     PIC X(04) VALUE SPACES.         021000      
000954    03 WLI-IMPC                   PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.      021100      
000955    03 FILLER                     PIC X(02) VALUE SPACES.         021200      
000956    03 WLI-AFECS028               PIC XXX   VALUE SPACES.         021300      
000957    03 FILLER                     PIC X(03) VALUE SPACES.         021400      
000958    03 WLI-AFECS115               PIC XX    VALUE SPACES.         021500      
000959    03 FILLER                     PIC X(04) VALUE SPACES.         021600      
000960    03 WLI-TIPOERROR              PIC X(35) VALUE SPACES.         021700      
000961                                                                  021800      
000962                                                                  021900      
000963 01 WS-TITULO-NO-INFORMACION.                                     022000      
000964    02 FILLER                      PIC X(29) VALUE SPACES.        022100      
000965    02 FILLER                      PIC X(46) VALUE                022200      
000966       "                           NO HUBO INFORMACION".          022300      
000967                                                                  022400      
000968******************************************************************022500      
000969*           CATALOGOS DESCRIPTIVOS  S080                         *022600      
000970******************************************************************022700      
000971 77 S080-CD-SISTEMA                       PIC S9(11) BINARY.      022800      
000972 77 S080-CD-PROGRAMA                      PIC S9(11) BINARY.      022900      
000973 77 S080-CD-RESULT                        PIC S9(11) BINARY.      023000      
000974 01 S080-CD-PARAMETRO-ENT.                                        023100      
000975    02 S080-CDPE-CATALOGO                 PIC 9(06) COMP.         023200      
000976    02 S080-CDPE-CLAVE                    PIC 9(02) COMP.         023300      
000977    02 S080-CDPE-ORDEN-BUSQ               PIC 9(02) COMP.         023400      
000978    02 S080-CDPE-REGISTROS                PIC 9(02) COMP.         023500      
000979    02 S080-CDPE-CVE-REGIST               PIC 9(12).              023600      
000980    02 S080-CDPE-CVE-REGIST-ASOC          PIC 9(12).              023700      
000981    02 S080-CDPE-NIVEL-INI                PIC 9(02) COMP.         023800      
000982    02 S080-CDPE-FECHA-CONS               PIC 9(06) COMP.         023900      
000983    02 FILLER                             PIC X(14).              024000      
000984                                                                  024100      
000985 01 S080-CD-PARAMETRO-SAL.                                        024200      
000986    02 S080-CDPS-NUM-REGISTRO             PIC 9(02) COMP.         024300      
000987    02 S080-CDPS-NUM-CATALOGO             PIC 9(06) COMP.         024400      
000988    02 S080-CDPS-FECHA-CONS               PIC 9(06) COMP.         024500      
000989    02 S080-CDPS-NIVEL-INI                PIC 9(02) COMP.         024600      
000990    02 S080-CDPS-DATOS.                                           024700      
000991       04 S080-CDPS-CVE-REGIST            PIC 9(12).              024800      
000992       04 S080-CDPS-CVE-REGIST-ASOC       PIC 9(12).              024900      
000993       04 S080-CDPS-TEXTO-LARGO           PIC X(40).              025000      
000994       04 S080-CDPS-TEXTO-CORTO           PIC X(20).              025100      
000995       04 S080-CDPS-TEXTO-PANTALLA        PIC X(12).              025200      
000996       04 S080-CDPS-TEXTO-ABREV           PIC X(05).              025300      
000997       04 S080-CDPS-FECHA-ALTA            PIC 9(06) COMP.         025400      
000998       04 S080-CDPS-FECHA-BAJA            PIC 9(06) COMP.         025500      
000999       04 S080-CDPS-FECHA-ULTMOD          PIC 9(06) COMP.         025600      
001000       04 FILLER                          PIC X(10).              025700      
001001                                                                  025800      
001002******************************************************************025900      
001003*           CATALOGOS PARAMETRICOS  S080                         *026000      
001004******************************************************************026100      
001005 77 S080-CP-SISTEMA                       PIC S9(11) BINARY.      026200      
001006 77 S080-CP-PROGRAMA                      PIC S9(11) BINARY.      026300      
001007 77 S080-CP-RESULT                        PIC S9(11) BINARY.      026400      
001008 01 S080-CP-PARAMETRO-ENT.                                        026500      
001009    02 S080-CPPE-CATALOGO                 PIC 9(06) COMP.         026600      
001010    02 S080-CPPE-CLAVE                    PIC 9(02) COMP.         026700      
001011    02 S080-CPPE-ORDEN-BUSQ               PIC 9(02) COMP.         026800      
001012    02 S080-CPPE-REGISTROS                PIC 9(02) COMP.         026900      
001013    02 S080-CPPE-LLAVE1                   PIC 9(12).              027000      
001014    02 S080-CPPE-LLAVE2                   PIC 9(12).              027100      
001015    02 S080-CPPE-LLAVE3                   PIC X(12).              027200      
001016    02 S080-CPPE-LLAVE4                   PIC X(12).              027300      
001017    02 S080-CPPE-LLAVE5                   PIC X(12).              027400      
001018    02 S080-CPPE-LLAVE6                   PIC X(12).              027500      
001019    02 S080-CPPE-FECHA-VIG                PIC 9(06) COMP.         027600      
001020    02 S080-CPPE-FECHA-CONS               PIC 9(06) COMP.         027700      
001021    02 S080-CPPE-NIVEL-INI                PIC 9(02) COMP.         027800      
001022    02 FILLER                             PIC X(11).              027900      
001023                                                                  028000      
001024 01 S080-CP-PARAMETRO-SAL.                                        028100      
001025    02 S080-CPPS-NUM-REGISTRO             PIC 9(02) COMP.         028200      
001026    02 S080-CPPS-NUM-CATALOGO             PIC 9(06) COMP.         028300      
001027    02 S080-CPPS-FECHA-CONS               PIC 9(06) COMP.         028400      
001028    02 S080-CPPS-NIVEL-INI                PIC 9(02) COMP.         028500      
001029    02 FILLER                             PIC X(22).              028600      
001030    02 S080-CPPS-REGISTROS.                                       028700      
001031       04 S080-CPPS-DATOS OCCURS 28 TIMES PIC 9(12).              028800      
001032       04 S080-CPPS-FECHA-ALTA            PIC 9(06) COMP.         028900      
001033       04 S080-CPPS-FECHA-BAJA            PIC 9(06) COMP.         029000      
001034       04 S080-CPPS-FECHA-ULTMOD          PIC 9(06) COMP.         029100      
001035       04 S080-CPPS-FECHA-VIG             PIC 9(06) COMP.         029200      
001036       04 FILLER                          PIC X(41).              029300      
001037******************************************************************029400      
001038*                    LEYENDAS DE MONEDAS                         *029500      
001039******************************************************************029600      
001040 01 WKS-TABLA-MONEDAS.                                            029700      
001041    02 WKS-T-MONEDAS         OCCURS 99   TIMES.                   029800      
001042       04 WKS-LEYENDA-MON                 PIC X(20).              029900      
001043                                                                  030000      
001044******************************************************************030100      
001045*            LEYENDAS DE LAS TRANSACCIONES                       *030200      
001046******************************************************************030300      
001047 01 WKS-TABLA-LEYENDAS-TRANS1.                                    030400      
001048    02 WKS-T-LEYENDAS-TRANS1 OCCURS 3000 TIMES.                   030500      
001049       04 WKS-LEYENDA-TRANS1              PIC X(20).              030600      
001050                                                                  030700      
001051 01 WKS-TABLA-LEYENDAS-TRANS2.                                    030800      
001052    02 WKS-T-LEYENDAS-TRANS2 OCCURS 3000 TIMES.                   030900      
001053       04 WKS-LEYENDA-TRANS2              PIC X(20).              031000      
001054                                                                  031100      
001055 01 WKS-TABLA-LEYENDAS-TRANS3.                                    031200      
001056    02 WKS-T-LEYENDAS-TRANS3 OCCURS 3000 TIMES.                   031300      
001057       04 WKS-LEYENDA-TRANS3              PIC X(20).              031400      
001058                                                                  031500      
001059 01 WKS-TABLA-LEYENDAS-TRANS4.                                    031600      
001060    02 WKS-T-LEYENDAS-TRANS4 OCCURS 3000 TIMES.                   031700      
001061       04 WKS-LEYENDA-TRANS4              PIC X(20).              031800      
001062                                                                  031900      
001063 01 WKS-TABLA-CTATALOGO-CAT.                                      032000      
001064    02 WKS-T-CATALOGO-CAT      OCCURS 10   TIMES.                 032100      
001065       04 WKS-CAT-USO                     PIC 9(02).              032200      
001066       04 WKS-CAT-TIPO                    PIC 9(02).              032300      
001067       04 WKS-CAT-NUM                     PIC 9(06).              032400      
001068       04 WKS-CAT-FORM                    PIC 9(02).              032500      
001069                                                                  032600      
001070 01 WKS-TABLA-PARAMETROS-TRANS2.                                  032700      
001071    02 WKS-T-PARAMETROS-TRANS2 OCCURS 9999 TIMES.                 032800      
001072       04 WKS-PT-NUM-LEYEN                PIC 9(04) COMP.         032900      
001073       04 WKS-PT-INDS151                  PIC 9(02) COMP.         033000      
001074       04 WKS-PT-CGENTRA                  PIC 9(02) COMP.         033100      
001075       04 WKS-PT-NATS028                  PIC 9(02) COMP.         033200      
001076       04 WKS-PT-INDBITA                  PIC 9(02) COMP.         033300      
001077                                                                  033400      
001078******************************************************************033500      
001079*    HORA DE PROCESO                                             *033600      
001080******************************************************************033700      
001081 01  WKS-HORA-PROCESO              PIC 9(08).                     033800      
001082                                                                  033900      
001083 01  WKS-HORA-R REDEFINES WKS-HORA-PROCESO.                       034000      
001084     03 WKS-HORA-HMS               PIC 9(02).                     034100      
001085     03 WKS-MINU-HMS               PIC 9(02).                     034120      
001086     03 WKS-SEGU-HMS               PIC 9(02).                     034140      
001087     03 FILLER                     PIC X(02).                     034200      
001088                                                                  034300      
001089*=================================================================034400      
001090*         VARIABLES PARA CALCULO DE MEMORIA Y DISCO DEL SORT     =034500      
001091*=================================================================034600      
001092                                                                  034700      
001093 77  W77-MEMORIA                   PIC 9(06).                     034800      
001094 77  W77-DISCO                     PIC 9(10).                     034900      
001095                                                                  035000      
001096******************************************************************035100      
001097*                   VARIABLES NIVEL 88                           *035200      
001098******************************************************************035300      
001099  77  W77-LEE-FIN                  PIC 9(01) VALUE 0.             035400      
001100  88  W88-LEE-FIN                            VALUE 1.             035500      
001101*LP                                                               035600      
001102  77  W77-NO-ERROR                 PIC 9(01) VALUE 0.             035700      
001103  88  W88-NO-ERROR                           VALUE 0.             035800      
001104  77  W77-ES-INICIO                PIC 9(01) VALUE 0.             035900      
001105  88  W88-ES-INICIO                          VALUE 0.             036000      
001106                                                                  036100      
001107******************************************************************036200      
001108*     VARIABLE PARA PASAR FECHA Y ENTRYPOINT COMO PARAMETRO      *036300      
001109******************************************************************036400      
001110                                                                  036500      
001111 01  WKS-PARAM-SIS                 PIC 9(03).                     036600      
001112 01  WKS-PARAM-FCH                 PIC 9(08).                     036700      
001113                                                                  036800      
001114                                                                  036900      
001115**************************************************************    037000      
001116*    VARIABLES PARA OBTENER DATOS DEL HOST DONDE SE CORRE    *    037100      
001117**************************************************************    037200      
001118 01  WKS-DATOS-HOST.                                              037300      
001119     03 WKS-NUMCSI                 PIC 9(02).                     037400      
001120     03 WKS-NOMEQUIPO              PIC X(10).                     037500      
001121     03 WKS-NOMCSI                 PIC X(26).                     037600      
001122     03 WKS-LINEABATCH             PIC X(05).                     037700      
001123                                                                  037800      
001124******************************************************************037900      
001125*           COPY DEL FORMATO DE MOVIMIENTOS DEL S151             *038000      
001126******************************************************************038100      
001127                                                                  038200      
001128*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001129* COPY "S151/FORMATO/ARCHIVO/MOVTOS ON CMEMP.".                   038300      
001130                                                                  000100      
001131******************************************************************000200      
001132**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
001133**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
001134**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
001135******************************************************************000600      
001136                                                                  000700      
001137 01 A00-R00-HDR-MOV .                                             000800      
001138    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
001139    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
001140    02 FILLER                          PIC  X(08).                001100      
001141    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
001142    02 FILLER                          PIC  X(430).               001300      
001143                                                                  001400      
001144 01 A00-R01-REGMOV .                                              001500      
001145    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
001146    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
001147    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
001148                                                                  001900      
001149    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
001150    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
001151                                       PIC  9(04)      COMP.      002200      
001152    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
001153                                       PIC  9(04)      COMP.      002400      
001154                                                                  002500      
001155    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
001156    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
001157                                       PIC  9(02)      COMP.      002800      
001158    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
001159                                       PIC  9(02)      COMP.      003000      
001160    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
001161    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
001162                                       A00-R01-SERVICIO-ALERTA.   003060      
001163       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
001164       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
001165    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
001166    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
001167    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
001168                                       PIC  9(04)      COMP.      003420      
001169    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
001170    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
001171                                       PIC  9(04)      COMP.      003520      
001172    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
001173    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
001174    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
001175                                       PIC  9(02)      COMP.      003900      
001176                                                                  004000      
001177    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
001178    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
001179       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
001180          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
001181          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
001182          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
001183          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
001184          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
001185          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
001186          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
001187                                                                  005100      
001188    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
001189       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
001190       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
001191       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
001192       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
001193       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
001194       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
001195       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
001196                                                                  006000      
001197       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
001198       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
001199       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
001200       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
001201       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
001202       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
001203       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
001204                                                                  006800      
001205       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
001206       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
001207       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
001208       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
001209       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
001210       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
001211       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
001212                                                                  007600      
001213       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
001214       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
001215       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
001216       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
001217       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
001218       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
001219       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
001220                                                                  008400      
001221       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
001222       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
001223       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
001224       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
001225       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
001226       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
001227       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
001228                                                                  009200      
001229    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
001230    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
001231    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
001232    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
001233    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
001234    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
001235       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
001236    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
001237    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
001238    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
001239    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
001240    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
001241    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
001242    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
001243    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
001244       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
001245       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
001246    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
001247    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
001248    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
001249    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
001250    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
001251    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
001252    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
001253    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
001254    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
001255    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
001256    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
001257    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
001258    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
001259    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
001260                                       PIC X(10).                 012600      
001261    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
001262       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
001263       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
001264    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
001265    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
001266    03 A00-R01-FILIAL                  PIC  X(05).                013200      
001267    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
001268       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
001269       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
001270                                                                  013300      
001271    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
001272    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
001273                                       PIC  X(09).                013600      
001274    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
001275                                       PIC  9(18)      COMP.      013800      
001276    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
001277    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
001278                                       PIC  X(9).                 014100      
001279    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
001280    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
001281                                       PIC  X(05).                014400      
001282    03 A00-R01-NIO                     PIC  X(16).                014500      
001283    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
001284    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
001285    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
001286       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
001287    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
001288    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
001289       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
001290    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
001291    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
001292    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
001293    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
001294    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
001295    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
001296                                       PIC  X(04).                015900      
001297    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
001298    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
001299    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
001300                                       PIC  9(04)      COMP.      016300      
001301    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
001302    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
001303    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
001304    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
001305    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
001306                                                                  016900      
001307    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
001308    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
001309       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
001310    03 A00-R01-FILXAPL                 PIC X(165).                017300      
001311                                                                  017400      
001312    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
001313       05 FILLER                       PIC X(96).                 017510      
001314       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
001315       05 FILLER                       PIC X(67).                 017700      
001316                                                                  017702      
001317    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
001318       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
001319       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
001320       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
001321       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
001322       06 WKS-MOV-FILS084              PIC X(154).                017714      
001323                                                                  017800      
001324    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
001325       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
001326       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
001327       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
001328       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
001329       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
001330       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
001331       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
001332       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
001333       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018155      
001334*      CAMPOS NUEVOS                                              018160      
001335       05 A00-R01-SUCFOND              PIC 9(04)      COMP.       018161      
001336       05 A00-R01-CTAFOND              PIC 9(16)      COMP.       018162      
001337       05 A00-R01-OPBANEL              PIC 9(04)      COMP.       018163      
001338       05 A00-R01-GATN                 PIC S9(03)V99   COMP.      018164      
001339       05 A00-R01-GATR                 PIC S9(03)V99   COMP.      018165      
001340       05 A00-R01-FECGAT               PIC 9(08)      COMP.       018166      
001341       05 FILLER                       PIC X(40).                 018167      
001342*       05 FILLER                       PIC X(62).                018170      
001343       05 A00-R01-CTE-087              PIC X(07).                 018210      
001344       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
001345          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
001346          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
001347          07 FILLER                    PIC X(01).                 018281      
001348       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
001349       05 FILLER                       PIC X(61).                 018400      
001350                                                                  018500      
001351    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
001352       05 FILLER                       PIC  X(96).                018610      
001353       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
001354       05 FILLER                       PIC  X(65).                018630      
001355                                                                  018640      
001356    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
001357       05 A00-R01-FORMATO0             PIC  9(02).                018700      
001358       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
001359       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
001360       05 FILLER                       PIC  X(141).               018910      
001361                                                                  019100      
001362    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
001363       05 A00-R01-FORMATO1             PIC  9(02).                019300      
001364       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
001365       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
001366       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
001367       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
001368       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
001369       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
001370       05 A00-R01-ENTSAL               PIC  X(01).                020000      
001371       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
001372       05 FILLER                       PIC  X(69).                020200      
001373                                                                  020300      
001374    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
001375       05 A00-R01-FORMATO2             PIC  9(02).                020500      
001376       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
001377       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
001378       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
001379       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
001380       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
001381       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
001382       05 FILLER                       PIC  X(77).                021200      
001383                                                                  021300      
001384    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
001385       05 A00-R01-FORMATO3             PIC  9(02).                021500      
001386       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
001387       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
001388       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
001389       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
001390       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
001391       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
001392       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
001393       05 FILLER                       PIC  X(69).                022300      
001394                                                                  022400      
001395    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
001396       05 A00-R01-FORMATO4             PIC  9(02).                022600      
001397       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
001398       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
001399       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
001400       05 A00-R01-RFCFT04              PIC  X(13).                023000      
001401       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
001402       05 A00-R01-DIRECCION            PIC  X(40).                023200      
001403       05 FILLER                       PIC  X(85).                023300      
001404                                                                  023400      
001405    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
001406       05 A00-R01-COBERTURA            PIC  X(01).                023408      
001407       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
001408       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
001409       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
001410       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
001411       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
001412       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
001413       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
001414       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
001415       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
001416       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
001417       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
001418       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
001419       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
001420       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
001421       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
001422       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
001423       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
001424       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
001425       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
001426       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
001427       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
001428       05 FILLER                       PIC  X(05).                023492      
001429                                                                  023497      
001430    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
001431       05 A00-R01-4CEROS               PIC  9(04).                023600      
001432       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
001433       05 FILLER                       PIC  X(157).               023800      
001434                                                                  023900      
001435    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
001436       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
001437        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
001438       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
001439       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
001440       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
001441       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
001442       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
001443       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
001444       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
001445       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
001446       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
001447       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
001448       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
001449       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
001450       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
001451       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
001452       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
001453       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
001454       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
001455       05 A00-R01-FILLER               PIC  X(41).                025850      
001456       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
001457       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
001458       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
001459       05 A00-R01-INDPAGO              PIC  9(01).                026200      
001460       05 FILLER                       PIC  X(01).                026210      
001461       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
001462       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
001463       05 FILLER                       PIC  X(52).                026300      
001464                                                                  026400      
001465    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
001466       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
001467       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
001468       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
001469       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
001470       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
001471       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
001472       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
001473       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
001474       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
001475       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
001476       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
001477       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
001478       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
001479          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
001480          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
001481       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
001482       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
001483          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
001484       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
001485          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
001486       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
001487          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
001488       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
001489          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
001490       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
001491          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
001492       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
001493          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
001494       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
001495          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
001496       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
001497          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
001498       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
001499          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
001500       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
001501          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
001502          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
001503       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
001504       05 FILLER                       PIC X(01).                 030101      
001505       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
001506       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
001507       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
001508       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
001509       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
001510       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
001511       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
001512       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
001513          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
001514       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
001515       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
001516       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
001517       05 FILLER                       PIC X(14).                 030700      
001518                                                                  030800      
001519    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
001520       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
001521       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
001522       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
001523       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
001524       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
001525       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
001526       05 A00-R01-151-CITI             PIC  9(02)     COMP.       031520      
001527       05 A00-R01-151-IND-BNE          PIC  9(02)     COMP.       031540      
001528       05 FILLER                       PIC  X(140).               031600      
001529                                                                  031700      
001530    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
001531       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
001532       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
001533       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
001534       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
001535       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
001536       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
001537       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
001538       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
001539       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
001540       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
001541          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
001542          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
001543          07 FILLER                    PIC  X(08).                032740      
001544       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
001545       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
001546       05 A00-R01-NOMORD               PIC  X(30).                033000      
001547       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
001548       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
001549       05 A00-R01-REF-CECO             PIC  X(07).                033500      
001550       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
001551       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
001552          A00-R01-NUM-ORD-PAGO.                                   033800      
001553          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
001554          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
001555                                                                  034100      
001556    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
001557       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
001558       05 A00-R01-RFC-S501             PIC  X(13).                034160      
001559       05 FILLER                       PIC  X(151).               034180      
001560                                                                  034190      
001561    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
001562       05 A00-R01-DATOS-S701           PIC X(116).                034300      
001563       05 A00-R01-PAG-SERV             REDEFINES                  034400      
001564                                       A00-R01-DATOS-S701.        034500      
001565          07 A00-R01-ID                PIC X(30).                 034600      
001566          07 A00-R01-FECREC            PIC 9(06).                 034700      
001567          07 A00-R01-REF1              PIC X(20).                 034800      
001568          07 A00-R01-REF2              PIC X(20).                 034900      
001569          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
001570          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
001571                                       A00-R01-TIPOPAGO.          035200      
001572             09 A00-R01-ESTAB          PIC 9(04).                 035300      
001573             09 A00-R01-SEQ            PIC 9(02).                 035400      
001574          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
001575          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
001576          07 A00-R01-EBPP              PIC 9(03).                 035700      
001577          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
001578          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
001579          07 FILLER                    PIC X(01).                 035728      
001580          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
001581          07 FILLER                    PIC X(18).                 035760      
001582       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
001583                                       A00-R01-DATOS-S701.        035900      
001584          07 A00-R01-RFC               PIC X(13).                 036000      
001585          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
001586          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
001587          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
001588          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
001589          07 FILLER                    PIC X(85).                 036200      
001590       05 FILLER                       PIC X(49).                 036300      
001591                                                                  036400      
001592    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
001593       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
001594       05 A00-R01-CTA-S702             PIC X(40).                 036700      
001595       05 FILLER                       PIC X(113).                036710      
001596                                                                  036720      
001597    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
001598       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
001599       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
001600       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
001601       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
001602       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
001603       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
001604       05 FILLER                       PIC X(72).                 036800      
001605                                                                  036810      
001606                                                                  036820      
001607    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
001608       05 A00-R01-TRUI-S711.                                      036915      
001609          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
001610          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
001611          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
001612           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
001613          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
001614       05 A00-R01-MICR-S711.                                      036945      
001615          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
001616          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
001617          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
001618          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
001619          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
001620          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
001621          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
001622          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
001623       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
001624       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
001625       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
001626       05 A00-R01-FIL-S711             PIC X(05).                 036965      
001627       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
001628       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
001629       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
001630                                                                  036990      
001631    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
001632       05 A00-R01-RFC-502              PIC  X(13).                037100      
001633       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
001634          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
001635          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
001636          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
001637          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
001638          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
001639          07 FILLER                    PIC  9(01) COMP.           037650      
001640       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
001641       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
001642       05 FILLER                       PIC  X(06).                038680      
001643                                                                  038682      
001644    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
001645       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
001646       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
001647       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
001648       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
001649       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
001650       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
001651       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
001652       05 FILLER                       PIC  X(81).                038750      
001653                                                                  038755      
001654    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
001655       05 A00-R01-COP                  PIC  9(13)        .        038900      
001656       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
001657       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
001658       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
001659       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
001660       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
001661       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
001662       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
001663       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
001664       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
001665       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
001666       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
001667       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
001668       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
001669       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
001670       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
001671       05 FILLER                       PIC  X(81)        .        040800      
001672                                                                  040810      
001673    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
001674       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
001675       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
001676       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
001677       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
001678       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
001679       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
001680       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
001681       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
001682       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
001683       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
001684       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
001685       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
001686       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
001687       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
001688       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
001689       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
001690       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
001691       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
001692       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
001693       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
001694       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
001695       05 FILLER                       PIC  X(18).                041040      
001696                                                                  041400      
001697    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
001698    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
001699*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001700*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001701* COPY "S151/CRONOS2K/CPY/WS".                                    038500      
001702******************************************************************000100      
001703** This copyBook defines all the additional variables that      **000200      
001704** Unisys has defined for the CRONOS2K project                  **000300      
001705** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
001706******************************************************************000500      
001707                                                                  000600      
001708******************************************************************000700      
001709** These Variables are used to Accept the system date in long   **000800      
001710** format and get the century information                       **000900      
001711** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
001712 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
001713 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
001714    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
001715    05 FILLER      PIC X(1).                                      001400      
001716    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
001717    05 FILLER      PIC X(1).                                      001600      
001718    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
001719    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
001720      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
001721      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
001722******************************************************************002100      
001723                                                                  002200      
001724******************************************************************002300      
001725** This variable defines a date in the format MMDDCCAA          **002400      
001726**                                                              **002500      
001727 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
001728 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
001729    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
001730    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
001731    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
001732    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
001733      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
001734      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
001735******************************************************************003400      
001736                                                                  003500      
001737******************************************************************003600      
001738** This variable defines a date in the format CCAAMMDD          **003700      
001739**                                                              **003800      
001740 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
001741 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
001742    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
001743    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
001744      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
001745      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
001746    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
001747    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
001748******************************************************************004700      
001749                                                                  004800      
001750******************************************************************004900      
001751** This variable defines a date in the format DDMMCCAA          **005000      
001752**                                                              **005100      
001753 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
001754 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
001755    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
001756    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
001757    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
001758    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
001759      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
001760      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
001761******************************************************************006000      
001762                                                                  006100      
001763******************************************************************006200      
001764** This variable defines a date in the Julian Format CCAADDD    **006300      
001765**                                                              **006400      
001766 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
001767 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
001768    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
001769    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
001770                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
001771      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
001772      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
001773    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
001774******************************************************************007300      
001775                                                                  007400      
001776******************************************************************007500      
001777** This variable defines a date in the format AAMMDD            **007600      
001778**                                                              **007700      
001779 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
001780 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
001781    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
001782    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
001783    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
001784******************************************************************008300      
001785                                                                  008400      
001786******************************************************************008500      
001787** This variable defines a date in the format MMDDAA            **008600      
001788**                                                              **008700      
001789 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
001790 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
001791    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
001792    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
001793    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
001794******************************************************************009300      
001795                                                                  009400      
001796******************************************************************009500      
001797** This variable defines a date in the format DDMMAA            **009600      
001798**                                                              **009700      
001799 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
001800 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
001801    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
001802    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
001803    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
001804******************************************************************010300      
001805                                                                  010400      
001806******************************************************************010500      
001807** These variables are defined to be used for CALL bridge logic **010600      
001808**                                                              **010700      
001809 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
001810 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
001811 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
001812 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
001813 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
001814 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
001815******************************************************************011400      
001816                                                                  011500      
001817******************************************************************011600      
001818** This variable is used for converting only a year field AA to **011700      
001819** CCAA and a CCAA to AA                                        **011800      
001820 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
001821 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
001822    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
001823    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
001824 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
001825 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
001826******************************************************************012300      
001827                                                                  012400      
001828******************************************************************012500      
001829** These variables are Bridge Variables for Intercambio files   **012600      
001830** para EDOCTA                                                  **012700      
001831 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
001832 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
001833 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
001834 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
001835 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
001836 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
001837 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
001838******************************************************************013500      
001839* Para MODULO                                                     013600      
001840 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
001841******************************************************************013800      
001842******************************************************************013900      
001843** Para FMOVSCHABO                                                014000      
001844 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
001845******************************************************************014200      
001846                                                                  014300      
001847******************************************************************014400      
001848***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
001849******************************************************************014600      
001850                                                                  014700      
001851 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
001852 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
001853     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
001854     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
001855     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
001856******************************************************************015300      
001857                                                                  015400      
001858******************************************************************015500      
001859***  These Variables Are Defined For Date In AAMM Format       ***015600      
001860******************************************************************015700      
001861                                                                  015800      
001862 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
001863 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
001864     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
001865     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
001866******************************************************************016300      
001867                                                                  016400      
001868                                                                  016500      
001869*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001870                                                                  038600      
001871*================================================================ 038700      
001872*         REGISTRO DE WORKING PARA SORT                         = 038800      
001873*================================================================ 038900      
001874                                                                  039000      
001875 01  WKS-REG-SORT.                                                039100      
001876     02 WKS-RS-LLAVE               PIC X(16).                     039200      
001877     02 WKS-RS-LLAVE-R REDEFINES WKS-RS-LLAVE.                    039300      
001878        03 WKS-RS-LIBRO            PIC 9(02).                     039400      
001879        03 WKS-RS-NUM-PRODUCTO     PIC 9(04).                     039500      
001880        03 WKS-RS-MONEDA           PIC 9(02).                     039600      
001881        03 WKS-RS-CVETRAN          PIC 9(04).                     039700      
001882        03 WKS-RS-ESQCON           PIC 9(04).                     039800      
001883     02 WKS-RS-IMPORTE             PIC 9(14)V99.                  039900      
001884     02 FILLER                     PIC X(04).                     040000      
001885 01  WKS-LLAVE-ANT.                                               040100      
001886     03 WKS-LIBRO-ANT              PIC 9(02).                     040200      
001887     03 WKS-NUM-PRODUCTO-ANT       PIC 9(04).                     040300      
001888     03 WKS-MONEDA-ANT             PIC 9(02).                     040400      
001889     03 WKS-CVETRAN-ANT            PIC 9(04).                     040500      
001890     03 WKS-ESQCON-ANT             PIC 9(04).                     040600      
001891**********************************************************        040700      
001892*      NOMBRES DE LOS FONDOS E INSTRUMENTOS DEL S403     *        040800      
001893**********************************************************        040900      
001894 01 WS-FONDOS.                                                    041000      
001895    03 FILLER     PIC X(09) VALUE "REC. PROP".                    041100      
001896    03 FILLER     PIC X(09) VALUE "FIRA     ".                    041200      
001897    03 FILLER     PIC X(09) VALUE "PROMYP   ".                    041300      
001898    03 FILLER     PIC X(09) VALUE "FONATUR  ".                    041400      
001899    03 FILLER     PIC X(09) VALUE "FNMNM    ".                    041500      
001900    03 FILLER     PIC X(09) VALUE "FIDEC    ".                    041600      
001901    03 FILLER     PIC X(09) VALUE "BANCOMEXT".                    041700      
001902    03 FILLER     PIC X(09) VALUE "NAFIN    ".                    041800      
001903    03 FILLER     PIC X(09) VALUE "FB MN    ".                    041900      
001904    03 FILLER     PIC X(09) VALUE "FB UDIS  ".                    042000      
001905    03 FILLER     PIC X(09) VALUE "R.P. FIRA".                    042100      
001906    03 FILLER     PIC X(09) VALUE "FOGAIN   ".                    042200      
001907    03 FILLER     PIC X(09) VALUE "CCC      ".                    042300      
001908    03 FILLER     PIC X(09) VALUE "CCOMP    ".                    042400      
001909    03 FILLER     PIC X(09) VALUE "EDCAG    ".                    042500      
001910    03 FILLER     PIC X(09) VALUE "EDCST    ".                    042600      
001911    03 FILLER     PIC X(09) VALUE "EXSEG    ".                    042700      
001912    03 FILLER     PIC X(09) VALUE "ICOREY   ".                    042800      
001913    03 FILLER     PIC X(09) VALUE "LREY     ".                    042900      
001914    03 FILLER     PIC X(09) VALUE "REYBCX   ".                    043000      
001915    03 FILLER     PIC X(09) VALUE "REFLC    ".                    043100      
001916    03 FILLER     PIC X(09) VALUE "RCCC     ".                    043200      
001917    03 FILLER     PIC X(09) VALUE "TADV     ".                    043300      
001918    03 FILLER     PIC X(09) VALUE "FOBA     ".                    043400      
001919    03 FILLER     PIC X(09) VALUE "IFC      ".                    043500      
001920    03 FILLER     PIC X(09) VALUE "DESCONO. ".                    043600      
001921                                                                  043700      
001922 01 WS-FONDOS-R REDEFINES WS-FONDOS.                              043800      
001923    03 WS-FONDO PIC X(09) OCCURS 26 TIMES.                        043900      
001924                                                                  044000      
001925 01 WS-INSTRUMENTOS.                                              044100      
001926    03 FILLER     PIC X(06) VALUE "DM    ".                       044200      
001927    03 FILLER     PIC X(06) VALUE "PQ    ".                       044300      
001928    03 FILLER     PIC X(06) VALUE "PDC   ".                       044400      
001929    03 FILLER     PIC X(06) VALUE "PP    ".                       044500      
001930    03 FILLER     PIC X(06) VALUE "ACS   ".                       044600      
001931    03 FILLER     PIC X(06) VALUE "ACGP  ".                       044700      
001932    03 FILLER     PIC X(06) VALUE "ACGH  ".                       044800      
001933    03 FILLER     PIC X(06) VALUE "ACCV  ".                       044900      
001934    03 FILLER     PIC X(06) VALUE "CSCCC ".                       045000      
001935    03 FILLER     PIC X(06) VALUE "PHI   ".                       045100      
001936    03 FILLER     PIC X(06) VALUE "PHA   ".                       045200      
001937    03 FILLER     PIC X(06) VALUE "PR    ".                       045300      
001938    03 FILLER     PIC X(06) VALUE "CP    ".                       045400      
001939    03 FILLER     PIC X(06) VALUE "PI    ".                       045500      
001940    03 FILLER     PIC X(06) VALUE "PV    ".                       045600      
001941    03 FILLER     PIC X(06) VALUE "CVM   ".                       045700      
001942    03 FILLER     PIC X(06) VALUE "PIE   ".                       045800      
001943    03 FILLER     PIC X(06) VALUE "OCGI  ".                       045900      
001944    03 FILLER     PIC X(06) VALUE "PPC   ".                       046000      
001945    03 FILLER     PIC X(06) VALUE "OAV   ".                       046100      
001946    03 FILLER     PIC X(06) VALUE "DESC. ".                       046200      
001947                                                                  046300      
001948 01 WS-INSTRUMENTOS-R REDEFINES WS-INSTRUMENTOS.                  046400      
001949    03 WS-INSTRUM PIC X(06) OCCURS 21 TIMES.                      046500      
001950                                                                  046600      
001951 01 WS-INST-S403                          PIC 9(04).              046700      
001952                                                                  046800      
001953 01 WS-INST-S403-R REDEFINES WS-INST-S403.                        046900      
001954    03 WS-NUM-FON                         PIC 9(02).              047000      
001955    03 WS-NUM-INS                         PIC 9(02).              047100      
001956                                                                  047200      
001957 01 WS-LEY-INST-S403.                                             047300      
001958    03 WS-LEY-FONDO                       PIC X(09).              047400      
001959    03 WS-LEY-INST                        PIC X(06).              047500      
001960                                                                  047600      
001961 01 WS-LIBROS.                                                    047700      
001962    03 FILLER     PIC X(22) VALUE "CONTABILIDAD BANCO    ".       047800      
001963    03 FILLER     PIC X(22) VALUE "CONTABILIDAD UDIS     ".       047900      
001964    03 FILLER     PIC X(22) VALUE "CONTABILIDAD FOBA-UDIS".       048000      
001965    03 FILLER     PIC X(22) VALUE "CONTABILIDAD FOBAPROA ".       048100      
001966    03 FILLER     PIC X(22) VALUE "LIBRO MEXICO          ".       048200      
001967    03 FILLER     PIC X(22) VALUE "LIBRO NASSAU          ".       048300      
001968    03 FILLER     PIC X(22) VALUE "LIBRO HOUSTON         ".       048400      
001969    03 FILLER     PIC X(22) VALUE "LIBRO NUEVA YORK      ".       048500      
001970    03 FILLER     PIC X(22) VALUE "LIBRO LONDRES         ".       048600      
001971    03 FILLER     PIC X(22) VALUE "LIBRO FOBAPROA MEXICO ".       048700      
001972    03 FILLER     PIC X(22) VALUE "CARTERA BURSATILIZADA ".       048800      
001973    03 FILLER     PIC X(22) VALUE "DESCONOCIDA           ".       048900      
001974                                                                  049000      
001975 01 WS-LIBROS-R REDEFINES WS-LIBROS.                              049100      
001976    03 WS-LIBRO   PIC X(22) OCCURS 12 TIMES.                      049200      
001977                                                                  049300      
001978******************************************************************049400      
001979*                     NOMBRE DE LA LOG DEL S151                  *049500      
001980******************************************************************049600      
001981 01 WKS-TIT-LOG151.                                               049700      
001982     02  FILLER                    PIC X(10) VALUE "(S151)S151".  049800      
001983     02  FILLER                    PIC X(10) VALUE "/FILE/MOVS".  049900      
001984     02  WKS-LOG-SISTEMA           PIC 9(03).                     050000      
001985     02  FILLER                    PIC X(01) VALUE "/".           050100      
001986     02  WKS-FEC-LOG               PIC 9(06) VALUE 0.             050200      
001987     02  FILLER                    PIC X(04) VALUE " ON ".        050300      
001988     02  WKS-PACK-LOG              PIC X(17).                     050400      
001989     02  FILLER                    PIC X(01) VALUE ".".           050500      
001990                                                                  050600      
001991 01 WKS-FECHA-PROCESO                     PIC 9(08).              051700      
001992 01 WKS-FECHA-PROCESO-R REDEFINES WKS-FECHA-PROCESO.              051800      
001993    03 WKS-FP-AMO                         PIC 9(4).               051900      
001994    03 WKS-FP-MES                         PIC 9(2).               052000      
001995    03 WKS-FP-DIA                         PIC 9(2).               052100      
001996 01 WKS-FEC-PROCA6D REDEFINES WKS-FECHA-PROCESO.                  052200      
001997    03 WKS-FPRO-AA1                       PIC 9(02).              052300      
001998    03 WKS-FPROCESO-A6                    PIC 9(06).              052400      
001999                                                                  052500      
002000 01 WS-FECHA-TEMP                         PIC 9(08).              052600      
002001 01 WS-FECHA-TEMP-R REDEFINES WS-FECHA-TEMP.                      052700      
002002     03 WS-MES-TEMP                        PIC 9(2).              052800      
002003     03 WS-DIA-TEMP                        PIC 9(2).              052900      
002004     03 WS-AMO-TEMP                        PIC 9(4).              053000      
002005                                                                  053100      
002006 01  WKS-FECHA-COMPILACION        PIC 9(08).                      053200      
002007 01  WKS-HORA-COMPILACION.                                        053300      
002008     02  WKS-HORA-COMP            PIC 9(13).                      053400      
002009     02  FILLER                   PIC X(187).                     053500      
002010                                                                  053600      
002011 01  A2K-BASE-YEAR                PIC 9(02) VALUE 50.             053700      
002012 01  WS-COMPILA                   PIC 9(11) BINARY.               053800      
002013***************************************************************   053900      
002014*          LIBRERIA CTLVERS       ( S006)                     *   054000      
002015***************************************************************   054100      
002016 01  WKS-CTLVERS-LIBRERIA            PIC X(12).                   054200      
002017 01  WKS-CTLVERS-TITULO              PIC X(72).                   054300      
002018 01  WKS-CTLVERS-STATUS              PIC S9(11) BINARY.           054400      
002019                                                                  054500      
002020 01  WKS-CTLVERS-NUMREG              PIC 9(02).                   054600      
002021 01  WKS-CTLVERS-LIBID               PIC X(12).                   054700      
002022 01  WKS-CTLVERS-LIBID-R REDEFINES WKS-CTLVERS-LIBID.             054800      
002023     03 WKS-LIBID-NOMB               PIC X(09).                   054900      
002024     03 WKS-LIBID-SIST               PIC X(03).                   055000      
002025                                                                  055100      
002026*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002027*  COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".          055200      
002028**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
002029  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
002030  01 MENSAJE-LJ.                                                  100300      
002031     02 SISTEMA-LJ     PIC X(04).                                 100400      
002032     02 FILLER         PIC X VALUE "/".                           100500      
002033     02 PASO-LJ        PIC X(04).                                 100600      
002034     02 FILLER         PIC X VALUE "/".                           100700      
002035     02 MTP-LJ         PIC 9(03).                                 100800      
002036     02 FILLER         PIC X VALUE ":".                           100900      
002037     02 TIPO-LJ        PIC X.                                     101000      
002038     02 FILLER         PIC X VALUE ">".                           101100      
002039     02 CODIGO-LJ      PIC 9(06).                                 101200      
002040     02 FILLER         PIC X VALUE "<".                           101300      
002041     02 TEXTO-LJ       PIC X(250).                                101400      
002042*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002043                                                                  055300      
002044/**************************************************************** 055400      
002045*             P R O C E D U R E     D I V I S I O N             * 055500      
002046***************************************************************** 055600      
002047 PROCEDURE DIVISION USING WKS-PARAM-SIS.                          055700      
002048 INICIO-PROGRAMA SECTION.                                         055800      
002049                                                                  055900      
002050 000000-INICIO-PROCESO.                                           056000      
002051*======================                                           056100      
002052                                                                  056200      
002053     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   056300      
002054            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".      056400      
002055     CHANGE ATTRIBUTE LIBACCESS OF "SOPORTECOMS" TO BYFUNCTION.   056500      
002056     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            056600      
002057                                      "SOPORTECOMS".              056700      
002058     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     056800      
002059     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      056900      
002060                                                                  057000      
002061     CHANGE ATTRIBUTE NORECOVERY OF ARCH-CAT TO  1.               057100      
002062     CHANGE ATTRIBUTE FILEORGANIZATION OF ARCH-CAT TO             057200      
002063            VALUE(KEYEDIOII).                                     057300      
002064                                                                  057400      
002065     CHANGE ATTRIBUTE LIBACCESS    OF "LOCALSUPPORT"              057500      
002066                                   TO BYFUNCTION.                 057600      
002067     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCALSUPPORT"              057700      
002068                                   TO "S006LOCSUP"                057800      
002069     MOVE "S151L001CTL"            TO WKS-LIBID.                  057900      
002070     CALL "DAME_TIT IN CTLVER"     USING WKS-LIBID, WKS-NOMBLIB   058000      
002071                                   GIVING W77-ERR-CTLVER.         058100      
002072     IF W77-ERR-CTLVER = 0                                        058200      
002073        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO WKS-NOMBLIB    058300      
002074     ELSE                                                         058400      
002075        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                058500      
002076           "(S151)S151/OBJECT/L001/CONTROL/01MTP001 ON CMEMP.".   058600      
002077                                                                  058700      
002078     MOVE "S151"                   TO SISTEMA-LJ.                 058800      
002079     MOVE "P112"                   TO PASO-LJ                     058900      
002080                                      WKS-PASO-BACK2              059000      
002081                                      WLI-RB-E1-PASO.             059100      
002082     MOVE "001"                    TO MTP-LJ.                     059200      
002083     MOVE "I"                      TO WLI-TIPO-LJ.                059300      
002084     CALL "CSIID IN SOPORTECOMS"   USING WKS-DATOS-HOST.          059400      
002085     CANCEL "SOPORTECOMS".                                        059500      
002086     CANCEL "CTLVER".                                             059600      
002087                                                                  059700      
002088     MOVE WKS-PARAM-SIS            TO WKS-B01-SISTEMA             059800      
002089                                      WKS-LOG-SISTEMA             059900      
002090                                      WKS-SIS-BACK2               060100      
002091                                      WLI-RB-E3-SISTEMA2          060200      
002092                                      WKS-SIST-CAT.               060300      
002093     MOVE WKS-NUMCSI               TO WKS-B01-CSI                 060400      
002094                                      WKS-TR-CSI2.                060500      
002095     MOVE 1                        TO WKS-B01-FUNCION.            060600      
002096     CALL "CONSISDIA IN LIB-CONTROL" USING  WKS-S151B01SISDIA     060700      
002097                                     GIVING W77-RESULT-LIBCON.    060800      
002098     IF W77-RESULT-LIBCON = 0                                     060900      
002099        MOVE WKS-B01-NOMPACMOV     TO WKS-PACK-LOG                061000      
002100        MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-PARAM-FCH       061200      
002101        IF WKS-PARAM-FCH > ZEROS                                  061300      
002102           MOVE WKS-PARAM-FCH      TO WKS-FECHA-PROCESO           061400      
002103           MOVE WKS-FPROCESO-A6    TO WKS-FEC-LOG                 061500      
002104                                      WKS-FEC-CAT                 061700      
002105        ELSE                                                      061800      
002106           MOVE WKS-B01-FECPRO     TO WKS-FECHA-PROCESO           061900      
002107           MOVE WKS-FPROCESO-A6    TO WKS-FEC-LOG                 062000      
002108                                      WKS-FEC-CAT                 062200      
002109     ELSE                                                         062300      
002110        IF W77-RESULT-LIBCON = 1                                  062400      
002111           MOVE "I"                TO TIPO-LJ                     062500      
002112           MOVE 010401             TO CODIGO-LJ                   062600      
002113           MOVE "SISTEMA NO DADO DE ALTA"                         062700      
002114                                   TO TEXTO-LJ                    062800      
002115           CALL "LJ IN LIB-DISP"   USING CONTADOR-LJ,             062900      
002116                                         MENSAJE-LJ               063000      
002117           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                063100      
002118        ELSE                                                      063200      
002119           MOVE "I"                TO TIPO-LJ                     063300      
002120           MOVE 010401             TO CODIGO-LJ                   063400      
002121           MOVE "ERROR EN BASE DE CONTROL"                        063500      
002122                                   TO TEXTO-LJ                    063600      
002123           CALL "LJ IN LIB-DISP"   USING CONTADOR-LJ,             063700      
002124                                         MENSAJE-LJ               063800      
002125           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.               063900      
002126                                                                  064000      
002127      MOVE WKS-FECHA-PROCESO        TO WLI-RB-E1-FECHA-INF2.      064100      
002128      MOVE "DIARIO"                 TO WLI-RB-E2-TIPO-PROC2.      064200      
002129     OPEN OUTPUT ARCH-CAT.                                        064300      
002130     CLOSE ARCH-CAT WITH SAVE.                                    064400      
002131     OPEN I-O ARCH-CAT.                                           064500      
002132     PERFORM 001000-FORMATO-DISPLAY.                              064600      
002133     PERFORM 000500-CARGA-CATALOGOS.                              064700      
002134     MOVE SPACES                   TO WLI-ENCAB-52.               064800      
002135     MOVE "I"                      TO WLI-TIPO-LJ.                064900      
002136     STRING "INICIO PROCESO FECHA :  "                            065000      
002137            WKS-FECHA-PROCESO                                     065100      
002138            " SIST. S"                                            065200      
002139            WKS-PARAM-SIS                                         065300      
002140     DELIMITED BY SIZE                                            065400      
002141     INTO WLI-TEXTO-LJ.                                           065500      
002142     PERFORM      000-030-IMPRIME-MENSAJE.                        065600      
002143     CHANGE ATTRIBUTE TITLE OF L01-DATOS                          065700      
002144                                   TO WKS-TIT-LOG151.             065800      
002145     OPEN INPUT L01-DATOS.                                        065900      
002146     READ L01-DATOS INTO A00-R00-HDR-MOV                          066000      
002147       AT END                                                     066100      
002148          MOVE SPACES                TO WLI-ENCAB-52              066200      
002149          MOVE "E"                 TO WLI-TIPO-LJ, TIPO-LJ        066300      
002150          MOVE 010105              TO CODIGO-LJ                   066400      
002151          MOVE " ERROR AL ABRIR ARCH. MOVTOS.  "                  066500      
002152                                   TO WLI-TEXTO-LJ,TEXTO-LJ       066600      
002153          PERFORM         000-030-IMPRIME-MENSAJE                 066700      
002154          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                066800      
002155                                      MENSAJE-LJ.                 066900      
002156                                                                  067200      
002157     OPEN OUTPUT A02-ARCH-SORT.                                   067300      
002158                                                                  067400      
002159     MOVE WKS-FECHA-PROCESO       TO      WLI-RP-E1-FECHA-INF     067500      
002160     ACCEPT WKS-HORA-PROCESO      FROM TIME.                      067600      
002161     MOVE WKS-HORA-HMS            TO      WLI-RP-E2-HORA-TIT      067700      
002162     MOVE WKS-MINU-HMS            TO      WLI-RP-E2-MINU-TIT      067720      
002163     MOVE WKS-SEGU-HMS            TO      WLI-RP-E2-SEGU-TIT      067740      
002164     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          067800      
002165             A2K-ACCEPT-TODAYS-DATE-EXIT.                         067900      
002166     PERFORM A2K-CONV-MDCA-TO-CAMD THRU                           068000      
002167             A2K-CONV-MDCA-TO-CAMD-EXIT.                          068100      
002168     MOVE A2K-FEC-CAMD-001        TO      WS-FECHA-TEMP           068200      
002169     MOVE WS-FECHA-TEMP           TO      WLI-RP-E2-FECHA-PROC    068300      
002170*lpb CALL "COMPILETIME-15 IN COBOL74"                             068400      
002171*lpb                         GIVING WS-COMPILA                    068500      
002172*lpb MOVE WS-COMPILA               TO     A2K-FEC-MDA-001         068600      
002173*lpb PERFORM A2K-CONV-MDA-TO-MDCA THRU                            068700      
002174*lpb         A2K-CONV-MDA-TO-MDCA-EXIT.                           068800      
002175*lpb PERFORM A2K-CONV-MDCA-TO-CAMD THRU                           068900      
002176*lpb         A2K-CONV-MDCA-TO-CAMD-EXIT                           069000      
002177*lpb MOVE A2K-FEC-CAMD-001        TO      WKS-FECHA-COMPILACION   069100      
002178*lpb MOVE WKS-FECHA-COMPILACION   TO      WLI-RP-E3-VERSION       069200      
002179                                                                  069300      
002180     MOVE ATTRIBUTE STACKNO OF MYSELF TO W77-NUMERO-MIX.          069400      
002181     MOVE ZEROS                    TO W77-FIN,                    069500      
002182                                      W77-LEE-FIN.                069600      
002183      READ L01-DATOS INTO A00-R01-REGMOV                          069700      
002184        AT END MOVE 1               TO W77-LEE-FIN.               069800      
002185                                                                  069900      
002186      IF A00-R01-FUNCION = 99                                     070000      
002187         MOVE 1                     TO W77-LEE-FIN.               070100      
002188                                                                  070200      
002189     IF WKS-PARAM-SIS = 403 AND A00-R01-IND-CONTA = 2             070300      
002190        MOVE ZEROS        TO      A00-R01-IND-CONTA.              070400      
002191                                                                  070500      
002192     MOVE ZEROS   TO      A00-R01-FIDEICO, A00-R01-PROGRAMA.      070600      
002193                                                                  070700      
002194     PERFORM 001000-ARMA-ARCHIVO                                  071600      
002195             UNTIL W88-LEE-FIN.                                   071700      
002196     CLOSE A02-ARCH-SORT WITH SAVE.                               071800      
002197     PERFORM 002000-SORT-ARCHIVO.                                 071900      
002198     MOVE 0                        TO W77-LEE-FIN.                072000      
002199     OPEN INPUT A02-ARCH-SORT.                                    072100      
002200     READ A02-ARCH-SORT INTO WKS-REG-SORT                         072200      
002201       AT END MOVE 1 TO W77-LEE-FIN.                              072300      
002202                                                                  072400      
002203     MOVE WKS-PARAM-SIS   TO      WKS-SIS-REP, WLI-RP-E3-SISTEMA  072500      
002204     MOVE WKS-NUMCSI      TO      WKS-TIT-CSI                     072600      
002205     MOVE WKS-FPROCESO-A6 TO      WKS-FEC-REP                     072700      
002206     MOVE  ATTRIBUTE STACKNO OF MYSELF                            072800      
002207                          TO      WKS-MIX-REP.                    072900      
002208     SET V00-REP-CVES(USERBACKUPNAME)                             073000      
002209                          TO      VALUE TRUE                      073100      
002210     CHANGE ATTRIBUTE TITLE OF V00-REP-CVES TO                    073200      
002211                                  WKS-TIT-REPORTE.                073300      
002212     OPEN OUTPUT V00-REP-CVES.                                    073400      
002213                                                                  073500      
002214     IF W77-LEE-FIN = 0                                           073600      
002215        MOVE WKS-RS-LLAVE          TO WKS-LLAVE-ANT               073700      
002216        MOVE ZERO                  TO W77-IMPMOV                  073800      
002217                                      W77-NUMMOV                  073900      
002218        PERFORM 2600-CORTE-LIBRO                                  074000      
002219        PERFORM 2500-CORTE-PROD                                   074100      
002220        PERFORM 2400-CORTE-MON                                    074200      
002221        MOVE 56                    TO W77-NUM-LINEAS              074300      
002222        PERFORM 002100-ARMA-TOTXCVE   UNTIL W88-LEE-FIN           074400      
002223        PERFORM 002200-IMP-DET                                    074500      
002224     ELSE                                                         074600      
002225        PERFORM 2300-IMP-ENCABEZADO                               074700      
002226        MOVE WS-TITULO-NO-INFORMACION TO V00-R00-CVES             074800      
002227        WRITE V00-R00-CVES.                                       074900      
002228                                                                  075000      
002229     CLOSE A02-ARCH-SORT WITH PURGE.                              075100      
002230     CLOSE ARCH-CAT  WITH PURGE.                                  075200      
002231     CLOSE L01-DATOS WITH SAVE.                                   075300      
002232     CLOSE V00-REP-CVES WITH SAVE.                                075600      
002233     STOP RUN.                                                    075700      
002234                                                                  075800      
002235 000500-CARGA-CATALOGOS.                                          075900      
002236*======================                                           076000      
002237     MOVE "S080BD01CON"   TO WKS-CTLVERS-LIBRERIA                 076100      
002238     CALL "DAME_TIT IN CTLVER"                                    076200      
002239          USING  WKS-CTLVERS-LIBRERIA                             076300      
002240                 WKS-CTLVERS-TITULO                               076400      
002241          GIVING WKS-CTLVERS-STATUS.                              076500      
002242                                                                  076600      
002243     IF WKS-CTLVERS-STATUS < 0                                    076700      
002244        MOVE "ERROR AL OBTENER NOMBRE S08BD01CON"                 076800      
002245                                           TO TEXTO-LJ            076900      
002246        MOVE "O"                           TO TIPO-LJ             077000      
002247        MOVE 020901                        TO CODIGO-LJ           077100      
002248        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       077200      
002249        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                   077300      
002250     ELSE                                                         077400      
002251        CHANGE ATTRIBUTE TITLE OF "S080BD01CON" TO                077500      
002252               WKS-CTLVERS-TITULO.                                077600      
002253                                                                  077700      
002254     MOVE 011                             TO S080-CDPE-CATALOGO   077800      
002255     MOVE 20                              TO S080-CDPE-CLAVE      077900      
002256     MOVE 1                               TO S080-CDPE-ORDEN-BUSQ 078000      
002257     MOVE 1                               TO S080-CDPE-REGISTROS  078100      
002258     MOVE 0                               TO S080-CDPE-CVE-REGIST 078200      
002259     MOVE 0                         TO  S080-CDPE-CVE-REGIST-ASOC 078300      
002260     MOVE 0                               TO S080-CDPE-NIVEL-INI  078400      
002261     MOVE WKS-FPROCESO-A6                 TO S080-CDPE-FECHA-CONS 078500      
002262     MOVE 0                               TO S080-CDPE-FECHA-CONS 078600      
002263     MOVE 0                               TO W77-LEE-FIN.         078700      
002264     PERFORM 000600-CARGA-MONEDAS  UNTIL W77-LEE-FIN > 0.         078800      
002265                                                                  078900      
002266     MOVE 523                             TO S080-CPPE-CATALOGO   079000      
002267     MOVE 20                              TO S080-CPPE-CLAVE      079100      
002268     MOVE 1                               TO S080-CPPE-ORDEN-BUSQ 079200      
002269     MOVE 1                               TO S080-CPPE-REGISTROS  079300      
002270     MOVE WKS-PARAM-SIS                   TO S080-CPPE-LLAVE1     079400      
002271     MOVE 0                               TO S080-CPPE-LLAVE2     079500      
002272                                             S080-CPPE-LLAVE3     079600      
002273                                             S080-CPPE-LLAVE4     079700      
002274                                             S080-CPPE-LLAVE5     079800      
002275                                             S080-CPPE-LLAVE6     079900      
002276     MOVE 0                               TO S080-CPPE-FECHA-VIG  080000      
002277     MOVE 0                               TO S080-CPPE-FECHA-CONS 080100      
002278                                             S080-CPPE-NIVEL-INI  080200      
002279     MOVE 0                               TO W77-LEE-FIN.         080300      
002280     PERFORM 000800-CARGA-CATALOGO-CAT  UNTIL W77-LEE-FIN > 0.    080400      
002281                                                                  080500      
002282     MOVE WKS-CAT-NUM(5)                  TO S080-CDPE-CATALOGO   080600      
002283     MOVE 20                              TO S080-CDPE-CLAVE      080700      
002284     MOVE 1                               TO S080-CDPE-ORDEN-BUSQ 080800      
002285     MOVE 1                               TO S080-CDPE-REGISTROS  080900      
002286     MOVE 0                               TO S080-CDPE-CVE-REGIST 081000      
002287     MOVE 0                         TO  S080-CDPE-CVE-REGIST-ASOC 081100      
002288     MOVE 0                               TO S080-CDPE-NIVEL-INI  081200      
002289     MOVE WKS-FPROCESO-A6                 TO S080-CDPE-FECHA-CONS 081300      
002290     MOVE 0                               TO S080-CDPE-FECHA-CONS 081400      
002291     MOVE 0                               TO W77-LEE-FIN.         081500      
002292     PERFORM 000700-CARGA-LEYENDAS UNTIL W77-LEE-FIN > 0.         081600      
002293                                                                  081700      
002294     MOVE WKS-CAT-NUM(1)                  TO S080-CPPE-CATALOGO   081800      
002295     MOVE 20                              TO S080-CPPE-CLAVE      081900      
002296     MOVE 1                               TO S080-CPPE-ORDEN-BUSQ 082000      
002297     MOVE 1                               TO S080-CPPE-REGISTROS  082100      
002298     MOVE WKS-PARAM-SIS                TO S080-CPPE-LLAVE1        082200      
002299     MOVE 0                               TO S080-CPPE-LLAVE2     082300      
002300                                             S080-CPPE-LLAVE3     082400      
002301                                             S080-CPPE-LLAVE4     082500      
002302                                             S080-CPPE-LLAVE5     082600      
002303                                             S080-CPPE-LLAVE6     082700      
002304     MOVE 0                               TO S080-CPPE-FECHA-VIG  082800      
002305     MOVE 0                               TO S080-CPPE-FECHA-CONS 082900      
002306                                             S080-CPPE-NIVEL-INI  083000      
002307     MOVE 0                               TO W77-LEE-FIN.         083100      
002308     PERFORM 12200-CARGA-TRANSACCIONES UNTIL W77-LEE-FIN > 0.     083200      
002309                                                                  083300      
002310     MOVE WKS-CAT-NUM(2)                  TO S080-CPPE-CATALOGO   083400      
002311     MOVE 0               TO S080-CPPE-LLAVE1  S080-CPPE-LLAVE2   083500      
002312                             S080-CPPE-LLAVE3  S080-CPPE-LLAVE4   083600      
002313                             S080-CPPE-LLAVE5  S080-CPPE-LLAVE6   083700      
002314     MOVE 0                               TO S080-CPPE-FECHA-VIG  083800      
002315                                             S080-CPPE-FECHA-CONS 083900      
002316                                             S080-CPPE-NIVEL-INI  084000      
002317     MOVE 0                               TO W77-LEE-FIN.         084100      
002318     PERFORM 12300-CARGA-RELTRANGUIA UNTIL W77-LEE-FIN > 0.       084200      
002319                                                                  084300      
002320 000600-CARGA-MONEDAS.                                            084400      
002321*=====================                                            084500      
002322     CALL "L700_CONSUL_DESC IN S080BD01CON"                       084600      
002323           USING S080-CD-SISTEMA                                  084700      
002324                 S080-CD-PROGRAMA                                 084800      
002325                 S080-CD-PARAMETRO-ENT                            084900      
002326                 S080-CD-PARAMETRO-SAL                            085000      
002327           GIVING S080-CD-RESULT                                  085100      
002328                                                                  085200      
002329     IF S080-CD-RESULT = 0 OR = 1                                 085300      
002330        MOVE S080-CDPS-CVE-REGIST         TO W77-IND              085400      
002331                                             S080-CDPE-CVE-REGIST 085500      
002332        MOVE S080-CDPS-NIVEL-INI          TO S080-CDPE-NIVEL-INI  085600      
002333        IF W77-IND > 0 AND W77-IND < 100                          085700      
002334           MOVE S080-CDPS-TEXTO-CORTO     TO                      085800      
002335                                    WKS-LEYENDA-MON(W77-IND)      085900      
002336        ELSE                                                      086000      
002337           NEXT SENTENCE                                          086100      
002338     ELSE                                                         086200      
002339        MOVE 1                            TO W77-LEE-FIN          086300      
002340        MOVE S080-CD-RESULT               TO W77-CAMPO-DISPLAY    086400      
002341        MOVE "O"                          TO TIPO-LJ              086500      
002342        MOVE 020901                       TO CODIGO-LJ            086600      
002343        STRING "ERROR EN CALL S080BD01CON,RESULT = ",             086700      
002344                W77-CAMPO-DISPLAY                                 086800      
002345                DELIMITED BY SIZE                                 086900      
002346                INTO TEXTO-LJ                                     087000      
002347        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      087100      
002348                                                                  087200      
002349     IF S080-CD-RESULT = 0                                        087300      
002350        MOVE 1                            TO W77-LEE-FIN.         087400      
002351                                                                  087500      
002352 000700-CARGA-LEYENDAS.                                           087600      
002353*=====================                                            087700      
002354     CALL "L700_CONSUL_DESC IN S080BD01CON"                       087800      
002355           USING S080-CD-SISTEMA                                  087900      
002356                 S080-CD-PROGRAMA                                 088000      
002357                 S080-CD-PARAMETRO-ENT                            088100      
002358                 S080-CD-PARAMETRO-SAL                            088200      
002359           GIVING S080-CD-RESULT                                  088300      
002360                                                                  088400      
002361     IF S080-CD-RESULT = 0 OR = 1                                 088500      
002362        MOVE S080-CDPS-CVE-REGIST         TO W77-IND              088600      
002363                                             S080-CDPE-CVE-REGIST 088700      
002364        MOVE S080-CDPS-NIVEL-INI          TO S080-CDPE-NIVEL-INI  088800      
002365        IF W77-IND < 12000                                        088900      
002366           IF W77-IND > 9000                                      089000      
002367              COMPUTE W77-IND = W77-IND - 9000                    089100      
002368              MOVE S080-CDPS-TEXTO-CORTO     TO                   089200      
002369                                    WKS-LEYENDA-TRANS4(W77-IND)   089300      
002370           ELSE                                                   089400      
002371              IF W77-IND > 6000                                   089500      
002372                 COMPUTE W77-IND = W77-IND - 6000                 089600      
002373                 MOVE S080-CDPS-TEXTO-CORTO     TO                089700      
002374                              WKS-LEYENDA-TRANS3(W77-IND)         089800      
002375              ELSE                                                089900      
002376                 IF W77-IND > 3000                                090000      
002377                    COMPUTE W77-IND = W77-IND - 3000              090100      
002378                    MOVE S080-CDPS-TEXTO-CORTO     TO             090200      
002379                               WKS-LEYENDA-TRANS2(W77-IND)        090300      
002380                 ELSE                                             090400      
002381                    MOVE S080-CDPS-TEXTO-CORTO     TO             090500      
002382                                    WKS-LEYENDA-TRANS1(W77-IND)   090600      
002383        ELSE                                                      090700      
002384           IF W77-SW-CAT500 = 0                                   090800      
002385              MOVE 1                      TO W77-SW-CAT500        090900      
002386              MOVE S080-CDPS-CVE-REGIST   TO W77-IND              091000      
002387              MOVE "O"                    TO TIPO-LJ              091100      
002388              MOVE 020601                 TO CODIGO-LJ            091200      
002389              STRING "ERROR CAT. 500 ( LEY. TRAN. ) "             091300      
002390                     " S" WKS-PARAM-SIS                           091400      
002391                     " LIMITE 12000 "                             091500      
002392                     " # LEY " W77-IND                            091600      
002393                     " AVISAR A SISTEMAS "                        091700      
002394              DELIMITED BY SIZE                                   091800      
002395              INTO TEXTO-LJ                                       091900      
002396              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 092000      
002397           ELSE                                                   092100      
002398              NEXT SENTENCE                                       092200      
002399     ELSE                                                         092300      
002400        MOVE 1                            TO W77-LEE-FIN          092400      
002401        MOVE S080-CD-RESULT               TO W77-CAMPO-DISPLAY    092500      
002402        MOVE "O"                          TO TIPO-LJ              092600      
002403        MOVE 020901                       TO CODIGO-LJ            092700      
002404        STRING "ERROR EN CALL S080BD01CON,RESULT = ",             092800      
002405                W77-CAMPO-DISPLAY                                 092900      
002406                DELIMITED BY SIZE                                 093000      
002407                INTO TEXTO-LJ                                     093100      
002408        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      093200      
002409                                                                  093300      
002410     IF S080-CD-RESULT = 0                                        093400      
002411        MOVE 1                            TO W77-LEE-FIN.         093500      
002412                                                                  093600      
002413 000800-CARGA-CATALOGO-CAT.                                       093700      
002414*=========================                                        093800      
002415     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    093900      
002416           USING  S080-CP-SISTEMA          S080-CP-PROGRAMA       094000      
002417                  S080-CP-PARAMETRO-ENT    S080-CP-PARAMETRO-SAL  094100      
002418           GIVING S080-CP-RESULT                                  094200      
002419                                                                  094300      
002420     IF S080-CP-RESULT = 0 OR = 1                                 094400      
002421        MOVE S080-CPPS-DATOS(1)        TO S080-CPPE-LLAVE1        094500      
002422        MOVE S080-CPPS-DATOS(2)        TO S080-CPPE-LLAVE2        094600      
002423                                          W77-IND                 094700      
002424        MOVE S080-CPPS-DATOS(3)        TO S080-CPPE-LLAVE3        094800      
002425        MOVE S080-CPPS-DATOS(4)        TO S080-CPPE-LLAVE4        094900      
002426        MOVE S080-CPPS-DATOS(5)        TO S080-CPPE-LLAVE5        095000      
002427        MOVE S080-CPPS-DATOS(6)        TO S080-CPPE-LLAVE6        095100      
002428        MOVE S080-CPPS-NIVEL-INI       TO S080-CPPE-NIVEL-INI     095200      
002429        MOVE S080-CPPS-FECHA-CONS      TO S080-CPPE-FECHA-CONS    095300      
002430        IF W77-IND < 10                                           095400      
002431           MOVE S080-CPPS-DATOS(2)  TO  WKS-CAT-USO  (W77-IND)    095500      
002432           MOVE S080-CPPS-DATOS(3)  TO  WKS-CAT-TIPO (W77-IND)    095600      
002433           MOVE S080-CPPS-DATOS(4)  TO  WKS-CAT-NUM  (W77-IND)    095700      
002434           MOVE S080-CPPS-DATOS(5)  TO  WKS-CAT-FORM (W77-IND)    095800      
002435        ELSE                                                      095900      
002436           NEXT SENTENCE                                          096000      
002437     ELSE                                                         096100      
002438        MOVE 1                            TO W77-LEE-FIN          096200      
002439        MOVE S080-CP-RESULT               TO W77-CAMPO-DISPLAY    096300      
002440        MOVE "I"                          TO TIPO-LJ              096400      
002441        MOVE 020901                       TO CODIGO-LJ            096500      
002442        STRING "ERROR EN CALL PARAMETROS S080BD01CON,RESULT = ",  096600      
002443                W77-CAMPO-DISPLAY         DELIMITED BY SIZE       096700      
002444                INTO TEXTO-LJ                                     096800      
002445        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      096900      
002446     IF S080-CP-RESULT = 0   MOVE 1       TO W77-LEE-FIN.         097000      
002447                                                                  097100      
002448 12200-CARGA-TRANSACCIONES.                                       097200      
002449*==========================                                       097300      
002450     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    097400      
002451           USING  S080-CP-SISTEMA          S080-CP-PROGRAMA       097500      
002452                  S080-CP-PARAMETRO-ENT    S080-CP-PARAMETRO-SAL  097600      
002453           GIVING S080-CP-RESULT                                  097700      
002454                                                                  097800      
002455     IF S080-CP-RESULT = 0 OR = 1                                 097900      
002456        MOVE S080-CPPS-DATOS(1)        TO S080-CPPE-LLAVE1        098000      
002457        MOVE S080-CPPS-DATOS(2)        TO S080-CPPE-LLAVE2        098100      
002458                                          W77-IND                 098200      
002459        MOVE S080-CPPS-DATOS(3)        TO S080-CPPE-LLAVE3        098300      
002460        MOVE S080-CPPS-DATOS(4)        TO S080-CPPE-LLAVE4        098400      
002461        MOVE S080-CPPS-DATOS(5)        TO S080-CPPE-LLAVE5        098500      
002462        MOVE S080-CPPS-DATOS(6)        TO S080-CPPE-LLAVE6        098600      
002463        MOVE S080-CPPS-NIVEL-INI       TO S080-CPPE-NIVEL-INI     098700      
002464        MOVE S080-CPPS-FECHA-CONS      TO S080-CPPE-FECHA-CONS    098800      
002465        IF W77-IND < 9999                                         098900      
002466           MOVE S080-CPPS-DATOS(3)  TO  WKS-PT-NUM-LEYEN (W77-IND)099000      
002467           MOVE S080-CPPS-DATOS(4)  TO  WKS-PT-CGENTRA  (W77-IND) 099100      
002468           MOVE S080-CPPS-DATOS(11) TO  WKS-PT-NATS028  (W77-IND) 099200      
002469           MOVE S080-CPPS-DATOS(12) TO  WKS-PT-INDS151  (W77-IND) 099300      
002470           MOVE S080-CPPS-DATOS(13) TO  WKS-PT-INDBITA  (W77-IND) 099400      
002471        ELSE                                                      099500      
002472           IF W77-SW-CAT502 = 0                                   099600      
002473              MOVE 1                      TO W77-SW-CAT502        099700      
002474              MOVE S080-CPPS-DATOS(2)     TO W77-IND              099800      
002475              MOVE "O"                    TO TIPO-LJ              099900      
002476              MOVE 020601                 TO CODIGO-LJ            100000      
002477              STRING "ERROR CAT # 6 ( TRAN X SIS ) "              100100      
002478                     " S" WKS-PARAM-SIS                           100200      
002479                     " LIMITE 9999 "    " CVETRAN " W77-IND       100300      
002480              DELIMITED BY SIZE         INTO TEXTO-LJ             100400      
002481              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 100500      
002482           ELSE  NEXT SENTENCE                                    100600      
002483     ELSE                                                         100700      
002484        MOVE 1                            TO W77-LEE-FIN          100800      
002485        MOVE S080-CP-RESULT               TO W77-CAMPO-DISPLAY    100900      
002486        MOVE "I"                          TO TIPO-LJ              101000      
002487        MOVE 020901                       TO CODIGO-LJ            101100      
002488        STRING "ERROR EN CALL PARAMETROS S080BD01CON,RESULT = ",  101200      
002489                W77-CAMPO-DISPLAY         DELIMITED BY SIZE       101300      
002490                INTO TEXTO-LJ                                     101400      
002491        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      101500      
002492     IF S080-CP-RESULT = 0   MOVE 1       TO W77-LEE-FIN.         101600      
002493                                                                  101700      
002494 12300-CARGA-RELTRANGUIA.                                         101800      
002495*============================                                     101900      
002496     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    102000      
002497           USING  S080-CP-SISTEMA           S080-CP-PROGRAMA      102100      
002498                  S080-CP-PARAMETRO-ENT     S080-CP-PARAMETRO-SAL 102200      
002499           GIVING S080-CP-RESULT.                                 102300      
002500     IF S080-CP-RESULT = 0 OR = 1                                 102400      
002501        MOVE S080-CPPS-DATOS(1)          TO S080-CPPE-LLAVE1      102500      
002502                                            CAT-SIST              102600      
002503        MOVE S080-CPPS-DATOS(2)          TO S080-CPPE-LLAVE2      102700      
002504                                            CAT-CVETRA            102800      
002505        MOVE S080-CPPS-DATOS(3)          TO S080-CPPE-LLAVE3      102900      
002506                                            CAT-ESQCON            103000      
002507        MOVE S080-CPPS-DATOS(4)          TO S080-CPPE-LLAVE4      103100      
002508                                            CAT-LIBRO             103200      
002509        MOVE S080-CPPS-DATOS(5)          TO S080-CPPE-LLAVE5      103300      
002510                                            CAT-CIA               103400      
002511        MOVE S080-CPPS-DATOS(6)          TO S080-CPPE-LLAVE6      103500      
002512                                            CAT-GUIAC             103600      
002513        MOVE S080-CPPS-NIVEL-INI         TO S080-CPPE-NIVEL-INI   103700      
002514        MOVE S080-CPPS-FECHA-CONS        TO S080-CPPE-FECHA-CONS  103800      
002515        PERFORM 12425-GRABA-CAT.                                  103900      
002516     IF S080-CP-RESULT = 0   MOVE 1      TO W77-LEE-FIN.          104000      
002517                                                                  104100      
002518 12425-GRABA-CAT.                                                 104200      
002519*================                                                 104300      
002520     READ ARCH-CAT KEY IS KEY-CAT  INVALID KEY                    104400      
002521                     WRITE REG-CAT INVALID KEY                    104500      
002522                     MOVE "E"             TO TIPO-LJ              104600      
002523                     MOVE 020202          TO CODIGO-LJ            104700      
002524                     MOVE "ERROR WRITE, ARCHIVO CATALOGO"         104800      
002525                                          TO TEXTO-LJ             104900      
002526                     CALL "LJ IN LIB-DISP"                        105000      
002527                                 USING CONTADOR-LJ, MENSAJE-LJ    105100      
002528                     SET MYSELF(STATUS)             TO -1.        105200      
002529                                                                  105300      
002530 001000-FORMATO-DISPLAY.                                          105400      
002531*=======================                                          105500      
002532                                                                  105600      
002533*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002534*      COPY "(S151)CITIDIRECT/S151/FORMATO/PROCEDURE/DISPLAY.".   105700      
002535                                                                  000100      
002536*===============================================================* 000200      
002537*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
002538*         PARA LLAMADO DE DISPLAY                               * 000400      
002539*===============================================================* 000500      
002540                                                                  000600      
002541     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
002542            TO BYFUNCTION.                                        000671      
002543                                                                  000691      
002544     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
002545          USING WKS-DATE-ARRAY2.                                  000800      
002546     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
002547     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
002548     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
002549     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
002550     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
002551     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
002552                                                                  001300      
002553     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
002554     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
002555     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
002556                               WKS-TIT-REPORTE2.                  001700      
002557*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
002558*                                  GIVING WKS-COMPILA2.           001900      
002559*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
002560*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
002561*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
002562*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
002563                                                                  002066      
002564*    IF WKS-AAA-VERSION2  < 50                                    002071      
002565*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
002566*    ELSE                                                         002081      
002567*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
002568                                                                  002091      
002569                                                                  002500      
002570*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
002571     OPEN OUTPUT V00-REPORTE2.                                    002700      
002572     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
002573     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
002574                                                                  003000      
002575 000-050-CHECA-SALTO-HOJA2.                                       003051      
002576*==========================                                       003071      
002577    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
002578     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
002579        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
002580     ELSE                                                         003079      
002581        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
002582     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
002583     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
002584     MOVE "/"                     TO WKS-SLASH1.                  003086      
002585     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
002586     MOVE "/"                     TO WKS-SLASH2.                  003088      
002587     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
002588     IF  WKS-NUM-LINEAS2 > 56                                     003091      
002589         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
002590         ADD 1                   TO    W77-CONT-HOJA2             003200      
002591         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
002592         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
002593         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
002594         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
002595         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
002596         MOVE SPACES             TO V00-R00-REPORTE2              003800      
002597         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
002598         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
002599                                                                  004100      
002600 000-030-IMPRIME-MENSAJE.                                         004200      
002601*========================                                         004300      
002602*LP                                                               004400      
002603     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
002604     ADD             2       TO WKS-NUM-LINEAS2                   004600      
002605     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
002606                                                                  004800      
002607*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002608                                                                  105800      
002609 001000-ARMA-ARCHIVO.                                             105900      
002610*====================                                             106000      
002611     IF WKS-PARAM-SIS = 403 AND A00-R01-IND-CONTA = 2             106100      
002612        MOVE ZEROS        TO      A00-R01-IND-CONTA.              106200      
002613                                                                  106300      
002614     IF WKS-PARAM-SIS = 87                                        106400      
002615        MOVE 87                    TO A00-R01-PRODUCTO.           106500      
002616                                                                  106600      
002617     IF A00-R01-FUNCION = 1 AND A00-R01-STATUS = 1                106700      
002618        MOVE A00-R01-IND-CONTA     TO WKS-RS-LIBRO                106800      
002619        MOVE A00-R01-MONEDA        TO WKS-RS-MONEDA               106900      
002620        IF A00-R01-IND-CONTA = 1 OR 2                             107000      
002621           MOVE A00-R01-FIDEICO   TO  WKS-RS-NUM-PRODUCTO         107100      
002622           PERFORM 001100-ARMA-REGISTRO                           107200      
002623                   VARYING W77-IND FROM 1 BY 1                    107300      
002624                   UNTIL   W77-IND > 5                            107400      
002625        ELSE                                                      107500      
002626           MOVE A00-R01-PRODUCTO  TO WKS-RS-NUM-PRODUCTO          107600      
002627           PERFORM 001100-ARMA-REGISTRO                           107700      
002628                   VARYING W77-IND FROM 1 BY 1                    107800      
002629                   UNTIL   W77-IND > 5.                           107900      
002630                                                                  108000      
002631                                                                  108100      
002632     READ L01-DATOS INTO A00-R01-REGMOV                           108200      
002633       AT END MOVE 1               TO W77-LEE-FIN.                108300      
002634                                                                  108400      
002635     IF A00-R01-FUNCION = 99                                      108500      
002636        MOVE 1                     TO W77-LEE-FIN.                108600      
002637     MOVE ZEROS   TO      A00-R01-FIDEICO, A00-R01-PROGRAMA.      108700      
002638                                                                  108800      
002639 001100-ARMA-REGISTRO.                                            109800      
002640*=====================                                            109900      
002641     IF A00-R01-CVETRAN(W77-IND) > 0                              110000      
002642        MOVE A00-R01-CVETRAN(W77-IND)                             110100      
002643                                   TO WKS-RS-CVETRAN              110200      
002644        MOVE A00-R01-ESQCON(W77-IND)                              110300      
002645                                   TO WKS-RS-ESQCON               110400      
002646        MOVE A00-R01-IMPORTE(W77-IND)                             110500      
002647                                   TO WKS-RS-IMPORTE              110600      
002648        WRITE A02-R00-REG-DISK FROM WKS-REG-SORT                  110700      
002649           INVALID KEY                                            110800      
002650           MOVE SPACES             TO WLI-ENCAB-52                110900      
002651           MOVE "I"                TO WLI-TIPO-LJ                 111000      
002652           MOVE "ERROR EN WRITE EN ARCHIVO PARA SORT"             111100      
002653                                   TO WLI-TEXTO-LJ                111200      
002654           PERFORM      000-030-IMPRIME-MENSAJE.                  111300      
002655                                                                  111400      
002656 002000-SORT-ARCHIVO.                                             111500      
002657*====================                                             111600      
002658     OPEN INPUT A02-ARCH-SORT                                     111605      
002659     COMPUTE W77-FRAMESIZE        =                               111610      
002660            (ATTRIBUTE FRAMESIZE  OF A02-ARCH-SORT)               111615      
002661     COMPUTE W77-MAXRECSIZE       =                               111620      
002662            (ATTRIBUTE MAXRECSIZE OF A02-ARCH-SORT)               111625      
002663     COMPUTE W77-LASTRECORD       =                               111630      
002664            (ATTRIBUTE LASTRECORD OF A02-ARCH-SORT                111635      
002665                                  +   1)                          111640      
002666     CLOSE A02-ARCH-SORT SAVE                                     111645      
002667     PERFORM                      70000-CALCULA-ESPACIO           111650      
002668     SORT A01-SDO-MOVS ASCENDING KEY A01-R00-KEY                  111700      
002669          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    111800      
002670          DISK   SIZE IS W77-DISK-SIZE   WORDS                    111900      
002671          USING A02-ARCH-SORT                                     112000      
002672          GIVING A02-ARCH-SORT.                                   112100      
002673                                                                  112200      
002674 002100-ARMA-TOTXCVE.                                             112300      
002675*====================                                             112400      
002676     IF WKS-RS-LIBRO = WKS-LIBRO-ANT                              112500      
002677        IF WKS-RS-NUM-PRODUCTO = WKS-NUM-PRODUCTO-ANT             112600      
002678           IF WKS-RS-MONEDA = WKS-MONEDA-ANT                      112700      
002679              IF WKS-RS-CVETRAN = WKS-CVETRAN-ANT                 112800      
002680                 IF WKS-RS-ESQCON = WKS-ESQCON-ANT                112900      
002681                    ADD WKS-RS-IMPORTE    TO W77-IMPMOV           113000      
002682                    ADD 1                 TO W77-NUMMOV           113100      
002683                 ELSE                                             113200      
002684                    PERFORM 002200-IMP-DET                        113300      
002685                    MOVE WKS-RS-IMPORTE    TO W77-IMPMOV          113400      
002686                    MOVE 1                 TO W77-NUMMOV          113500      
002687                    MOVE WKS-RS-ESQCON     TO WKS-ESQCON-ANT      113600      
002688              ELSE                                                113700      
002689                 PERFORM 002200-IMP-DET                           113800      
002690                 MOVE WKS-RS-IMPORTE    TO W77-IMPMOV             113900      
002691                 MOVE 1                 TO W77-NUMMOV             114000      
002692                 MOVE WKS-RS-ESQCON     TO WKS-ESQCON-ANT         114100      
002693                 MOVE WKS-RS-CVETRAN    TO WKS-CVETRAN-ANT        114200      
002694           ELSE                                                   114300      
002695              PERFORM 002200-IMP-DET                              114400      
002696              PERFORM 2400-CORTE-MON                              114500      
002697              PERFORM 2300-IMP-ENCABEZADO                         114600      
002698              MOVE WKS-RS-IMPORTE    TO W77-IMPMOV                114700      
002699              MOVE 1                 TO W77-NUMMOV                114800      
002700              MOVE WKS-RS-ESQCON     TO WKS-ESQCON-ANT            114900      
002701              MOVE WKS-RS-CVETRAN    TO WKS-CVETRAN-ANT           115000      
002702        ELSE                                                      115100      
002703           PERFORM 002200-IMP-DET                                 115200      
002704           PERFORM 2500-CORTE-PROD                                115300      
002705           PERFORM 2400-CORTE-MON                                 115400      
002706           PERFORM 2300-IMP-ENCABEZADO                            115500      
002707           MOVE WKS-RS-ESQCON     TO WKS-ESQCON-ANT               115600      
002708           MOVE WKS-RS-CVETRAN    TO WKS-CVETRAN-ANT              115700      
002709           MOVE WKS-RS-IMPORTE        TO W77-IMPMOV               115800      
002710           MOVE 1                     TO W77-NUMMOV               115900      
002711     ELSE                                                         116000      
002712        PERFORM 002200-IMP-DET                                    116100      
002713        PERFORM 2600-CORTE-LIBRO                                  116200      
002714        PERFORM 2500-CORTE-PROD                                   116300      
002715        PERFORM 2400-CORTE-MON                                    116400      
002716        PERFORM 2300-IMP-ENCABEZADO                               116500      
002717        MOVE WKS-RS-ESQCON     TO WKS-ESQCON-ANT                  116600      
002718        MOVE WKS-RS-CVETRAN    TO WKS-CVETRAN-ANT                 116700      
002719        MOVE WKS-RS-IMPORTE        TO W77-IMPMOV                  116800      
002720        MOVE 1                     TO W77-NUMMOV.                 116900      
002721                                                                  117000      
002722     READ A02-ARCH-SORT INTO WKS-REG-SORT                         117100      
002723        AT END MOVE 1              TO W77-LEE-FIN.                117200      
002724                                                                  117300      
002725  002200-IMP-DET.                                                 117400      
002726*===============                                                  117500      
002727     IF W77-NUM-LINEAS > 50                                       117600      
002728        PERFORM 2300-IMP-ENCABEZADO.                              117700      
002729                                                                  117800      
002730     MOVE WKS-CVETRAN-ANT TO      WLI-CVET                        117900      
002731     MOVE WKS-ESQCON-ANT  TO      WLI-ESQC                        118000      
002732     MOVE W77-IMPMOV      TO      WLI-IMPC                        118100      
002733     MOVE W77-NUMMOV      TO      WLI-NUMC                        118200      
002734     MOVE WKS-PT-NUM-LEYEN(WKS-CVETRAN-ANT)                       118300      
002735                          TO      W77-IND                         118400      
002736                                                                  118500      
002737     IF W77-IND = 0 OR W77-IND > 12000                            118600      
002738        MOVE SPACES                       TO WLI-NOMBRE           118700      
002739     ELSE                                                         118800      
002740        IF W77-IND > 9000                                         118900      
002741           COMPUTE W77-IND = W77-IND - 9000                       119000      
002742           MOVE WKS-LEYENDA-TRANS4(W77-IND)                       119100      
002743                                          TO WLI-NOMBRE           119200      
002744        ELSE                                                      119300      
002745           IF W77-IND > 6000                                      119400      
002746              COMPUTE W77-IND = W77-IND - 6000                    119500      
002747              MOVE WKS-LEYENDA-TRANS3(W77-IND)                    119600      
002748                                    TO WLI-NOMBRE                 119700      
002749           ELSE                                                   119800      
002750              IF W77-IND > 3000                                   119900      
002751                 COMPUTE W77-IND = W77-IND - 3000                 120000      
002752                 MOVE WKS-LEYENDA-TRANS2(W77-IND)                 120100      
002753                                   TO WLI-NOMBRE                  120200      
002754              ELSE                                                120300      
002755                 MOVE WKS-LEYENDA-TRANS1(W77-IND)                 120400      
002756                                          TO WLI-NOMBRE.          120500      
002757                                                                  120600      
002758     IF WKS-PT-NATS028(WKS-CVETRAN-ANT) = 1                       120700      
002759        MOVE "CAR"        TO      WLI-AFECS028                    120800      
002760     ELSE                                                         120900      
002761     IF WKS-PT-NATS028(WKS-CVETRAN-ANT) = 2                       121000      
002762        MOVE "ABO"        TO      WLI-AFECS028                    121100      
002763     ELSE                                                         121200      
002764        MOVE "N/C"        TO      WLI-AFECS028.                   121300      
002765                                                                  121400      
002766     IF WKS-PT-INDS151 (WKS-CVETRAN-ANT) = 2                      121500      
002767        MOVE "SI"         TO      WLI-AFECS115                    121600      
002768        PERFORM 2900-LEE-ESQCON                                   121700      
002769     ELSE                                                         121800      
002770        MOVE "NO"         TO      WLI-AFECS115                    121900      
002771        MOVE SPACES       TO      WLI-TIPOERROR.                  122000      
002772                                                                  122100      
002773     WRITE V00-R00-CVES FROM WLI-DET                              122200      
002774                                                                  122300      
002775     ADD 1        TO      W77-NUM-LINEAS.                         122400      
002776                                                                  122500      
002777 2300-IMP-ENCABEZADO.                                             122600      
002778*====================                                             122700      
002779     ADD 1        TO      WLI-RP-E3-HOJA                          122800      
002780                                                                  122900      
002781     WRITE V00-R00-CVES FROM WLI-TIT1-RESUM       AFTER PAGE.     123000      
002782     WRITE V00-R00-CVES FROM WLI-TIT2-RESUM                       123100      
002783     WRITE V00-R00-CVES FROM WLI-TIT3-RESUM                       123200      
002784     MOVE SPACES  TO      V00-R00-CVES                            123300      
002785     WRITE V00-R00-CVES                                           123400      
002786     WRITE V00-R00-CVES FROM WLI-TIT5-RESUM                       123500      
002787     MOVE SPACES  TO      V00-R00-CVES                            123600      
002788     WRITE V00-R00-CVES                                           123700      
002789     WRITE V00-R00-CVES FROM WLI-TIT5-CVES                        123800      
002790     MOVE SPACES  TO      V00-R00-CVES                            123900      
002791     WRITE V00-R00-CVES                                           124000      
002792     MOVE 8       TO      W77-NUM-LINEAS.                         124100      
002793                                                                  124200      
002794 2400-CORTE-MON.                                                  124300      
002795*===============                                                  124400      
002796     MOVE WKS-RS-MONEDA   TO      WKS-MONEDA-ANT                  124500      
002797     MOVE WKS-MONEDA-ANT  TO      WLI-NUM-MON                     124600      
002798                                                                  124700      
002799     IF WKS-RS-MONEDA > 0 AND < 100                               124800      
002800        MOVE WKS-LEYENDA-MON(WKS-MONEDA-ANT) TO WLI-NOMBRE-MON    124900      
002801     ELSE                                                         125000      
002802        MOVE "DESCONOCIDA"                TO WLI-NOMBRE-MON.      125100      
002803                                                                  125200      
002804 2500-CORTE-PROD.                                                 125300      
002805*================                                                 125400      
002806     MOVE WKS-RS-NUM-PRODUCTO     TO      WKS-NUM-PRODUCTO-ANT    125500      
002807     MOVE WKS-NUM-PRODUCTO-ANT    TO      WLI-NUM-PRO.            125600      
002808                                                                  125700      
002809     IF WKS-PARAM-SIS = 403 OR 404                                125800      
002810        IF WKS-LIBRO-ANT = 1 OR 2                                 125900      
002811            MOVE "FIDEICOMISO:"    TO      WLI-TIT-PROD           126000      
002812            MOVE SPACES            TO      WLI-NOMBRE-PRO         126100      
002813        ELSE                                                      126200      
002814           MOVE "PRODUCTO    :"    TO      WLI-TIT-PROD           126300      
002815           IF WKS-PARAM-SIS = 403                                 126400      
002816               PERFORM 2700-LEY-S403                              126500      
002817           ELSE                                                   126600      
002818               PERFORM 2750-LEY-S404                              126700      
002819     ELSE                                                         126800      
002820        MOVE "PRODUCTO    :"       TO      WLI-TIT-PROD           126900      
002821        MOVE SPACES                TO      WLI-NOMBRE-PRO.        127000      
002822                                                                  127100      
002823 2600-CORTE-LIBRO.                                                127200      
002824*=================                                                127300      
002825     MOVE WKS-RS-LIBRO    TO      WKS-LIBRO-ANT                   127400      
002826     MOVE WKS-LIBRO-ANT   TO      WLI-NUM-LIBRO.                  127500      
002827                                                                  127600      
002828     IF WKS-PARAM-SIS = 403 OR 404                                127700      
002829        PERFORM 2800-LEY-LIBRO                                    127800      
002830     ELSE                                                         127900      
002831        MOVE SPACES TO    WLI-NOMBRE-LIBRO.                       128000      
002832                                                                  128100      
002833 2700-LEY-S403.                                                   128200      
002834*================                                                 128300      
002835    MOVE WKS-NUM-PRODUCTO-ANT TO WS-INST-S403                     128400      
002836                                                                  128500      
002837    IF WS-NUM-FON = 10                                            128600      
002838       MOVE 1 TO W77-IND-FON                                      128700      
002839    ELSE                                                          128800      
002840    IF WS-NUM-FON = 25                                            128900      
002841       MOVE 2 TO W77-IND-FON                                      129000      
002842    ELSE                                                          129100      
002843    IF WS-NUM-FON = 26                                            129200      
002844       MOVE 3 TO W77-IND-FON                                      129300      
002845    ELSE                                                          129400      
002846    IF WS-NUM-FON = 28                                            129500      
002847       MOVE 4 TO W77-IND-FON                                      129600      
002848    ELSE                                                          129700      
002849    IF WS-NUM-FON = 32                                            129800      
002850       MOVE 5 TO W77-IND-FON                                      129900      
002851    ELSE                                                          130000      
002852    IF WS-NUM-FON = 35                                            130100      
002853       MOVE 6 TO W77-IND-FON                                      130200      
002854    ELSE                                                          130300      
002855    IF WS-NUM-FON = 36                                            130400      
002856       MOVE 7 TO W77-IND-FON                                      130500      
002857    ELSE                                                          130600      
002858    IF WS-NUM-FON = 37                                            130700      
002859       MOVE 8 TO W77-IND-FON                                      130800      
002860    ELSE                                                          130900      
002861    IF WS-NUM-FON = 80                                            131000      
002862       MOVE 9 TO W77-IND-FON                                      131100      
002863    ELSE                                                          131200      
002864    IF WS-NUM-FON = 90                                            131300      
002865       MOVE 10 TO W77-IND-FON                                     131400      
002866    ELSE                                                          131500      
002867    IF WS-NUM-FON = 11                                            131600      
002868       MOVE 11 TO W77-IND-FON                                     131700      
002869    ELSE                                                          131800      
002870    IF WS-NUM-FON = 27                                            131900      
002871       MOVE 12 TO W77-IND-FON                                     132000      
002872    ELSE                                                          132100      
002873    IF WS-NUM-FON = 47                                            132200      
002874       MOVE 13 TO W77-IND-FON                                     132300      
002875    ELSE                                                          132400      
002876    IF WS-NUM-FON = 48                                            132500      
002877       MOVE 14 TO W77-IND-FON                                     132600      
002878    ELSE                                                          132700      
002879    IF WS-NUM-FON = 49                                            132800      
002880       MOVE 15 TO W77-IND-FON                                     132900      
002881    ELSE                                                          133000      
002882    IF WS-NUM-FON = 50                                            133100      
002883       MOVE 16 TO W77-IND-FON                                     133200      
002884    ELSE                                                          133300      
002885    IF WS-NUM-FON = 51                                            133400      
002886       MOVE 17 TO W77-IND-FON                                     133500      
002887    ELSE                                                          133600      
002888    IF WS-NUM-FON = 52                                            133700      
002889       MOVE 18 TO W77-IND-FON                                     133800      
002890    ELSE                                                          133900      
002891    IF WS-NUM-FON = 53                                            134000      
002892       MOVE 19 TO W77-IND-FON                                     134100      
002893    ELSE                                                          134200      
002894    IF WS-NUM-FON = 54                                            134300      
002895       MOVE 20 TO W77-IND-FON                                     134400      
002896    ELSE                                                          134500      
002897    IF WS-NUM-FON = 55                                            134600      
002898       MOVE 21 TO W77-IND-FON                                     134700      
002899    ELSE                                                          134800      
002900    IF WS-NUM-FON = 57                                            134900      
002901       MOVE 22 TO W77-IND-FON                                     135000      
002902    ELSE                                                          135100      
002903    IF WS-NUM-FON = 59                                            135200      
002904       MOVE 23 TO W77-IND-FON                                     135300      
002905    ELSE                                                          135400      
002906    IF WS-NUM-FON = 91                                            135500      
002907       MOVE 24 TO W77-IND-FON                                     135600      
002908    ELSE                                                          135700      
002909    IF WS-NUM-FON = 92                                            135800      
002910       MOVE 25 TO W77-IND-FON                                     135900      
002911    ELSE                                                          136000      
002912       MOVE 26 TO W77-IND-FON.                                    136100      
002913                                                                  136200      
002914     IF WS-NUM-INS NOT = 0                                        136300      
002915        IF WS-NUM-INS < 21                                        136400      
002916           MOVE WS-NUM-INS TO W77-IND-INS                         136500      
002917        ELSE                                                      136600      
002918           MOVE 21         TO W77-IND-INS                         136700      
002919     ELSE                                                         136800      
002920        MOVE 21 TO W77-IND-INS.                                   136900      
002921                                                                  137000      
002922     MOVE WS-FONDO(W77-IND-FON)   TO WS-LEY-FONDO                 137100      
002923     MOVE WS-INSTRUM(W77-IND-INS) TO WS-LEY-INST                  137200      
002924     MOVE WS-LEY-INST-S403        TO WLI-NOMBRE-PRO.              137300      
002925                                                                  137400      
002926 2750-LEY-S404.                                                   137500      
002927*---------------                                                  137600      
002928     IF WKS-NUM-PRODUCTO-ANT = 10                                 137700      
002929        MOVE "PRES. PERSONAL "  TO  WLI-NOMBRE-PRO                137800      
002930     ELSE                                                         137900      
002931     IF WKS-NUM-PRODUCTO-ANT = 20                                 138000      
002932        MOVE "AUTOMATICOS    "  TO  WLI-NOMBRE-PRO                138100      
002933     ELSE                                                         138200      
002934     IF WKS-NUM-PRODUCTO-ANT = 30                                 138300      
002935        MOVE "FORMULAS       "  TO  WLI-NOMBRE-PRO                138400      
002936     ELSE                                                         138500      
002937     IF WKS-NUM-PRODUCTO-ANT = 40                                 138600      
002938        MOVE "ESPACIOS       "  TO  WLI-NOMBRE-PRO                138700      
002939     ELSE                                                         138800      
002940     IF WKS-NUM-PRODUCTO-ANT = 50                                 138900      
002941        MOVE "REDESCUENTOS   "  TO  WLI-NOMBRE-PRO                139000      
002942     ELSE                                                         139100      
002943     IF WKS-NUM-PRODUCTO-ANT = 51                                 139200      
002944        MOVE "PROSAF/AVIO ADE" TO  WLI-NOMBRE-PRO                 139300      
002945     ELSE                                                         139400      
002946     IF WKS-NUM-PRODUCTO-ANT = 60                                 139500      
002947        MOVE "REFINANCIAMIENT" TO  WLI-NOMBRE-PRO                 139600      
002948     ELSE                                                         139700      
002949     IF WKS-NUM-PRODUCTO-ANT = 70                                 139800      
002950        MOVE "CREDIPERSONAL  " TO WLI-NOMBRE-PRO                  139900      
002951     ELSE                                                         140000      
002952     IF WKS-NUM-PRODUCTO-ANT = 99                                 140100      
002953        MOVE "CONTABLE       " TO WLI-NOMBRE-PRO                  140200      
002954     ELSE                                                         140300      
002955        MOVE "DESCONOCIDO    " TO WLI-NOMBRE-PRO.                 140400      
002956                                                                  140500      
002957 2800-LEY-LIBRO.                                                  140600      
002958*===================                                              140700      
002959   IF WKS-LIBRO-ANT = 0                                           140800      
002960      MOVE WS-LIBRO(1) TO WLI-NOMBRE-LIBRO                        140900      
002961   ELSE                                                           141000      
002962   IF WKS-LIBRO-ANT = 1                                           141100      
002963      MOVE WS-LIBRO(2) TO WLI-NOMBRE-LIBRO                        141200      
002964   ELSE                                                           141300      
002965   IF WKS-LIBRO-ANT = 2                                           141400      
002966      MOVE WS-LIBRO(3) TO WLI-NOMBRE-LIBRO                        141500      
002967   ELSE                                                           141600      
002968   IF WKS-LIBRO-ANT = 3                                           141700      
002969      MOVE WS-LIBRO(4) TO WLI-NOMBRE-LIBRO                        141800      
002970   ELSE                                                           141900      
002971   IF WKS-LIBRO-ANT = 11                                          142000      
002972      MOVE WS-LIBRO(5) TO WLI-NOMBRE-LIBRO                        142100      
002973   ELSE                                                           142200      
002974   IF WKS-LIBRO-ANT = 12                                          142300      
002975      MOVE WS-LIBRO(6) TO WLI-NOMBRE-LIBRO                        142400      
002976   ELSE                                                           142500      
002977   IF WKS-LIBRO-ANT = 13                                          142600      
002978      MOVE WS-LIBRO(7) TO WLI-NOMBRE-LIBRO                        142700      
002979   ELSE                                                           142800      
002980   IF WKS-LIBRO-ANT = 14                                          142900      
002981      MOVE WS-LIBRO(8) TO WLI-NOMBRE-LIBRO                        143000      
002982   ELSE                                                           143100      
002983   IF WKS-LIBRO-ANT = 15                                          143200      
002984      MOVE WS-LIBRO(9) TO WLI-NOMBRE-LIBRO                        143300      
002985   ELSE                                                           143400      
002986   IF WKS-LIBRO-ANT = 16                                          143500      
002987      MOVE WS-LIBRO(10) TO WLI-NOMBRE-LIBRO                       143600      
002988   ELSE                                                           143700      
002989   IF WKS-LIBRO-ANT = 17                                          143800      
002990      MOVE WS-LIBRO(11) TO WLI-NOMBRE-LIBRO                       143900      
002991   ELSE                                                           144000      
002992      MOVE WS-LIBRO(12) TO WLI-NOMBRE-LIBRO.                      144100      
002993                                                                  144200      
002994 2900-LEE-ESQCON.                                                 144300      
002995*================                                                 144400      
002996   MOVE SPACES            TO      WLI-TIPOERROR.                  144500      
002997   MOVE ZEROS TO W77-IND.                                         144600      
002998   MOVE WKS-PARAM-SIS     TO      CAT-SIST                        144700      
002999   MOVE WKS-CVETRAN-ANT   TO      CAT-CVETRA                      144800      
003000   MOVE WKS-ESQCON-ANT    TO      CAT-ESQ                         144900      
003001   MOVE WKS-MONEDA-ANT    TO      CAT-MON                         145000      
003002   MOVE WKS-LIBRO-ANT     TO      CAT-LIBRO                       145100      
003003   MOVE 0                 TO      CAT-CIA                         145200      
003004                                                                  145300      
003005   IF WKS-PARAM-SIS = 403 OR 404                                  145400      
003006      IF CAT-MON = 1  AND (CAT-LIBRO = 0 OR 3 OR 7 OR 8)          145500      
003007         MOVE 0   TO CAT-LIBRO                                    145600      
003008      ELSE                                                        145700      
003009      IF CAT-MON = 3  AND (CAT-LIBRO = 0 OR 3)                    145800      
003010         MOVE 0   TO CAT-LIBRO                                    145900      
003011      ELSE                                                        146000      
003012      IF CAT-MON = 3  AND (CAT-LIBRO = 1 OR 2)                    146100      
003013         NEXT SENTENCE                                            146200      
003014      ELSE                                                        146300      
003015      IF CAT-MON = 1  AND (CAT-LIBRO = 1 OR 2)                    146400      
003016         NEXT SENTENCE                                            146500      
003017      ELSE                                                        146600      
003018      IF CAT-MON = 3  AND (CAT-LIBRO = 7 OR 8)                    146700      
003019         MOVE 2   TO CAT-LIBRO                                    146800      
003020      ELSE                                                        146900      
003021         MOVE ZEROS TO CAT-MON,                                   147000      
003022                       CAT-LIBRO.                                 147100      
003023                                                                  147200      
003024   IF WKS-PARAM-SIS = 264 OR 703 OR 18 OR 17                      147300      
003025      IF CAT-MON > 1                                              147400      
003026         MOVE ZEROS TO  CAT-MON.                                  147500      
003027                                                                  147600      
003028   READ ARCH-CAT KEY IS KEY-CAT                                   147700      
003029        INVALID KEY                                               147800      
003030              MOVE "REL-TRAN-GUIA CONTABLE INEXISTENTE"           147900      
003031                                             TO WLI-TIPOERROR.    148000      
003032*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003033* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP002 ON CMEMP."         148100      
003034*                                      FROM 100000 TO 999999      148150      
003035                                                                  100000      
003036*----------------------------------------------------------------*100100      
003037*   PROCEDIMIENTO DE CALCULO DINAMICO DE ESPACIO PARA EL SORT    *100200      
003038*----------------------------------------------------------------*100300      
003039 70000-CALCULA-ESPACIO.                                           100400      
003040*======================                                           100500      
003041     IF W77-FRAMESIZE             =   8                           100600      
003042        COMPUTE WS-CALC-WORD      =   W77-MAXRECSIZE              100700      
003043                                  /   6                           100800      
003044        IF WS-WORD-RES            >   ZEROS                       100900      
003045           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                 101000      
003046                                  +   1                           101100      
003047        ELSE                                                      101200      
003048           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                .101300      
003049     COMPUTE W77-MEMORY-65K  =   66000 * W77-MAXRECSIZE     .     101400      
003050                                                                  101402      
003051     COMPUTE W77-MEMORY-SIZE ROUNDED                              101500      
003052                                  =   (W77-MAXRECSIZE + 3)        101600      
003053                                  *   (W77-LASTRECORD / 16)       101700      
003054                                  +   1500                       .101750      
003055                                                                  101770      
003056     IF W77-MEMORY-SIZE > 258435000                               101800      
003057        MOVE 258435000              TO W77-MEMORY-SIZE            101820      
003058     ELSE                                                         101850      
003059     IF W77-MEMORY-SIZE < 400000                                  101870      
003060        MOVE W77-MEMORY-65K         TO W77-MEMORY-SIZE.           101900      
003061                                                                  101990      
003062     COMPUTE W77-DISK-SIZE ROUNDED                                102000      
003063                                  =  (W77-MAXRECSIZE + 3)         102100      
003064                                  *   W77-LASTRECORD              102200      
003065                                  *   3.5                        .102300      
003066                                                                  102400      
003067*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003068*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003069* COPY "S151/CRONOS2K/CPY/PD".                                    148200      
003070** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
003071** Unisys has defined for CRONOS2K project                     ** 000200      
003072** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
003073***************************************************************** 000400      
003074***************************************************************** 000600      
003075** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
003076** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
003077** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
003078** date MMDDCCAA, which is returned into the variable          ** 001000      
003079** A2K-FEC-MDCA-001.                                           ** 001100      
003080***************************************************************** 001200      
003081                                                                  001300      
003082 A2K-ACCEPT-TODAYS-DATE.                                          001400      
003083        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
003084*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
003085        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
003086        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
003087        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
003088        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
003089        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
003090                                                                  002200      
003091 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
003092        EXIT.                                                     002240      
003093                                                                  002500      
003094****************************************************************  002600      
003095** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
003096**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
003097**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
003098**baseyear to add the century to the year part.               **  003000      
003099**INPUT is A2K-FEC-AMD-001                                    **  003100      
003100**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
003101****************************************************************  003300      
003102                                                                  003400      
003103 A2K-CONV-AMD-TO-CAMD.                                            003500      
003104         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
003105         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
003106         IF A2K-FEC-AMD-001 = 0                                   003720      
003107            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
003108         ELSE                                                     003741      
003109          IF A2K-FEC-AMD-001 = 999999                             003742      
003110             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
003111         ELSE                                                     003760      
003112         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
003113                 A2K-OBTAIN-CENTURY-EXIT                          003900      
003114         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
003115         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
003116         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
003117         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
003118                                                                  004400      
003119 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
003120         EXIT.                                                    004600      
003121                                                                  004700      
003122******************************************************************004800      
003123**A2K-CONV-MDA-TO-MDCA.                                         **004900      
003124**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
003125** an eight digit format as MMDDCCAA. It use a                  **005100      
003126** baseyear to add century to the yaer.                         **005200      
003127** INPUT is A2K-FEC-MDA-001                                     **005300      
003128** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
003129                                                                  005500      
003130 A2K-CONV-MDA-TO-MDCA.                                            005600      
003131     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
003132     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
003133     IF A2K-FEC-MDA-001 = 0                                       005820      
003134        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
003135     ELSE                                                         005845      
003136      IF A2K-FEC-MDA-001 = 999999                                 005850      
003137         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
003138     ELSE                                                         005860      
003139     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
003140             A2K-OBTAIN-CENTURY-EXIT                              006000      
003141     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
003142     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
003143     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
003144     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
003145                                                                  006500      
003146 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
003147     EXIT.                                                        006700      
003148                                                                  006800      
003149***************************************************************** 006900      
003150**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
003151**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
003152**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
003153**baseyear to add century to the year.                         ** 007300      
003154**INPUT is A2K-FEC-DMA-001                                     ** 007400      
003155**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
003156                                                                  007600      
003157 A2K-CONV-DMA-TO-DMCA.                                            007700      
003158       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
003159       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
003160       IF  A2K-FEC-DMA-001   = 0                                  007920      
003161          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
003162       ELSE                                                       007945      
003163        IF A2K-FEC-DMA-001 = 999999                               007950      
003164          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
003165       ELSE                                                       007960      
003166       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
003167               A2K-OBTAIN-CENTURY-EXIT                            008100      
003168       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
003169       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
003170       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
003171       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
003172                                                                  008600      
003173 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
003174       EXIT.                                                      008800      
003175                                                                  008900      
003176***************************************************************** 009000      
003177** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
003178** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
003179** a 6 digit format as AAMMDD.                                 ** 009300      
003180** It simply removes the century information in the output     ** 009400      
003181** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
003182** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
003183                                                                  009700      
003184 A2K-CONV-CAMD-TO-AMD.                                            009800      
003185     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
003186     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
003187     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
003188     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
003189                                                                  010300      
003190 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
003191      EXIT.                                                       010500      
003192                                                                  010600      
003193******************************************************************010700      
003194******************************************************************010800      
003195** A2K-CONV-MDCA-TO-MDA.                                        **010900      
003196** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
003197** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
003198** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
003199** INPUT is A2K-FEC-MDCA-001                                    **011300      
003200** OUTPUT is A2K-FEC-MDA-001                                    **011400      
003201                                                                  011500      
003202 A2K-CONV-MDCA-TO-MDA.                                            011600      
003203     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
003204     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
003205     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
003206     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
003207                                                                  012100      
003208 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
003209      EXIT.                                                       012300      
003210                                                                  012400      
003211******************************************************************012500      
003212***************************************************************** 012600      
003213** A2K-CONV-DMCA-TO-DMA.                                        **012700      
003214** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
003215** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
003216** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
003217** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
003218** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
003219                                                                  013300      
003220 A2K-CONV-DMCA-TO-DMA.                                            013400      
003221     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
003222     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
003223     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
003224     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
003225                                                                  013900      
003226 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
003227      EXIT.                                                       014100      
003228                                                                  014200      
003229***************************************************************** 014300      
003230 A2K-CONV-MDCA-TO-CAMD.                                           014400      
003231      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
003232      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
003233      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
003234      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
003235      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
003236 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
003237      EXIT.                                                       015100      
003238***************************************************************** 015200      
003239** This paragraph adds century to an year field which is 9(02) ** 015300      
003240** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
003241** Output is A2K-FEC-CCAA-001.                                 ** 015600      
003242***************************************************************** 015700      
003243 A2K-CONV-AA-TO-CCAA.                                             015800      
003244      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
003245      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
003246              A2K-OBTAIN-CENTURY-EXIT.                            016100      
003247      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
003248 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
003249      EXIT.                                                       016400      
003250***************************************************************** 016500      
003251** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
003252** format.                                                     ** 016700      
003253** Input is A2K-FEC-DMCA-001.                                  ** 016800      
003254** Output is A2K-FEC-CAMD-001.                                 ** 016900      
003255***************************************************************** 017000      
003256 A2K-CONV-DMCA-TO-CAMD.                                           017100      
003257      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
003258      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
003259      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
003260      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
003261      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
003262 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
003263      EXIT.                                                       017800      
003264***************************************************************** 017900      
003265** This paragraph desides the Century to be added depending    ** 018000      
003266** on the base year.                                           ** 018100      
003267** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
003268** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
003269***************************************************************** 018400      
003270 A2K-OBTAIN-CENTURY.                                              018500      
003271      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
003272          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
003273      ELSE                                                        018800      
003274          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
003275 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
003276      EXIT.                                                       019100      
003277                                                                  019200      
003278***************************************************************** 019300      
003279** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
003280**  Format                                                     ** 019500      
003281** Input Is A2K-FEC-CAMD-001                                   ** 019600      
003282** Output Is A2K-FEC-DMCA-001                                  ** 019700      
003283***************************************************************** 019800      
003284 A2K-CONV-CAMD-TO-DMCA.                                           019900      
003285      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
003286      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
003287      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
003288      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
003289      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
003290                                                                  020500      
003291 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
003292      EXIT.                                                       020700      
003293                                                                  020800      
003294******************************************************************020900      
003295******************************************************************021000      
003296 A2K-CONV-AM-TO-CAM.                                              021100      
003297      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
003298      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
003299      IF A2K-FEC-AM-001 = 0                                       021220      
003300         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
003301      ELSE                                                        021245      
003302      IF A2K-FEC-AM-001 = 9999                                    021250      
003303         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
003304      ELSE                                                        021260      
003305      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
003306      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
003307      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
003308              A2K-OBTAIN-CENTURY-EXIT                             021600      
003309      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
003310                                                                  021800      
003311 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
003312      EXIT.                                                       022000      
003313                                                                  022100      
003314******************************************************************022200      
003315******************************************************************022300      
003316 A2K-CONV-CAM-TO-AM.                                              022400      
003317      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
003318      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
003319      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
003320                                                                  022800      
003321 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
003322   EXIT.                                                          023000      
003323                                                                  023100      
003324                                                                  023200      
003325                                                                  023500      
003326*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
