000001$SET LINEINFO OPTIMIZE MAP LIST XREF                              000100      
000002*INICIA CODIGO DE RENOVACION CRONOS 2000                          000101      
000003$SET LIST                                                         000102      
000004$SET OLDCODE                                                      000103      
000005*TERMINA CODIGO DE RENOVACION CRONOS 2000                         000104      
000006$SET LIST MAPINFO XREF LINEINFO ERRORLIMIT =100                   000151      
000007*$SET TADS                                                        000200      
000008%************************************************************     000220      
000009% RECOMPILACIONPOR EL UPGRADE DEL MCP A 55                  *     000222      
000010% 20141205 15MTP001 MJGRG                                   *     000224      
000011%************************************************************     000226      
000012 IDENTIFICATION   DIVISION.                                       000300      
000013 PROGRAM-ID.              EXTRACTOR.                              000400      
000014 AUTHOR.                  ANSELMO SANCHEZ MARTINEZ.               000500      
000015 INSTALLATION.            BANAMEX                                 000600      
000016                          INGENIERIA DE SISTEMAS.                 000700      
000017*                                                                 000800      
000018 DATE-WRITTEN.            SEPTIEMBRE DE 1998.                     000900      
000019 DATE-COMPILED.                                                   001000      
000020                                                                  001100      
000021*SECURITY.                COPYRIGHT BY SANCHEZ  CO.               001200      
000022*                                                                 001300      
000023 ENVIRONMENT      DIVISION.                                       001400      
000024                                                                  001500      
000025 CONFIGURATION    SECTION.                                        001600      
000026                                                                  001700      
000027                                                                  001800      
000028 INPUT-OUTPUT     SECTION.                                        001900      
000029 FILE-CONTROL.                                                    002000      
000030                                                                  002100      
000031     SELECT OPTIONAL   SALDOS     ASSIGN TO DISK.                 002200      
000032     SELECT            SDOS-SAL   ASSIGN TO DISK.                 002250      
000033     SELECT            TESORERIA  ASSIGN TO DISK.                 002300      
000034     SELECT            REPORTE    ASSIGN TO PRINTER.              002400      
000035     SELECT            V00-REPORTE2  ASSIGN TO PRINTER.           002451      
000036                                                                  002500      
000037 DATA             DIVISION.                                       002600      
000038 FILE             SECTION.                                        002700      
000039                                                                  002800      
000040 FD  V00-REPORTE2                                                 002851      
000041     VALUE OF TITLE WKS-TIT-REPORTE2.                             002861      
000042                                                                  002871      
000043 01  V00-R00-REPORTE2             PIC X(132).                     002881      
000044                                                                  002891      
000045 FD  SALDOS                                                       002900      
000046*****BLOCK CONTAINS 50 RECORDS                                    003000      
000047     VALUE OF TITLE W-ETIQ-SALDOS                                 003100      
000048     VALUE OF DEPENDENTSPECS IS TRUE                              003200      
000049     DATA RECORD IS REG-SALDOS.                                   003300      
000050                                                                  003400      
000051 01  REG-SALDOS                   PIC X(90).                      003500      
000052                                                                  003600      
000053 FD  SDOS-SAL                                                     003610      
000054*****BLOCK CONTAINS 50 RECORDS                                    003620      
000055*    VALUE OF TITLE W-ETIQ-SDOS-SAL                               003630      
000056*SAMG                                                             003632      
000057     VALUE OF TITLE W-ETIQ-SDOS-INT                               003634      
000058     VALUE OF DEPENDENTSPECS IS TRUE                              003640      
000059     DATA RECORD IS REG-SDOS-SAL.                                 003650      
000060                                                                  003660      
000061 01  REG-SDOS-SAL                 PIC X(156).                     003670      
000062                                                                  003680      
000063 FD  TESORERIA                                                    003700      
000064     VALUE OF TITLE W-ETIQ-TESORERIA                              003800      
000065     VALUE OF DEPENDENTSPECS IS TRUE                              003900      
000066     VALUE OF EXTMODE        IS ASCII.                            004000      
000067                                                                  004100      
000068*01  REG-TESORERIA                PIC X(54).                      004200      
000069*INICIA CODIGO DE RENOVACION CRONOS 2000                          004201      
000070 01  REG-TESORERIA                PIC X(56).                      004202      
000071*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004203      
000072                                                                  004300      
000073 FD  REPORTE                                                      004400      
000074     DATA RECORD IS LINEA-CSI                                     004500      
000075     VALUE OF TITLE IS WKS-ETIQ-REPORTE.                          004600      
000076                                                                  004700      
000077 01  LINEA-CSI                    PIC X(132).                     004800      
000078                                                                  004900      
000079                                                                  005000      
000080 DATA-BASE        SECTION.                                        005100      
000081                                                                  005200      
000082 DB  S151BD02ADSALDO ALL.                                         005300      
000083                                                                  005400      
000084 WORKING-STORAGE  SECTION.                                        005500      
000085*INICIA CODIGO DE RENOVACION CRONOS 2000                          005501      
000086*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000087*  COPY "S151/CRONOS2K/CPY/WS".                                   005502      
000088******************************************************************000100      
000089** This copyBook defines all the additional variables that      **000200      
000090** Unisys has defined for the CRONOS2K project                  **000300      
000091** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000092******************************************************************000500      
000093                                                                  000600      
000094******************************************************************000700      
000095** These Variables are used to Accept the system date in long   **000800      
000096** format and get the century information                       **000900      
000097** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000098 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000099 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000100    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000101    05 FILLER      PIC X(1).                                      001400      
000102    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000103    05 FILLER      PIC X(1).                                      001600      
000104    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000105    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000106      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000107      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000108******************************************************************002100      
000109                                                                  002200      
000110******************************************************************002300      
000111** This variable defines a date in the format MMDDCCAA          **002400      
000112**                                                              **002500      
000113 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000114 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000115    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000116    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000117    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000118    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000119      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000120      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000121******************************************************************003400      
000122                                                                  003500      
000123******************************************************************003600      
000124** This variable defines a date in the format CCAAMMDD          **003700      
000125**                                                              **003800      
000126 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000127 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000128    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000129    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000130      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000131      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000132    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000133    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000134******************************************************************004700      
000135                                                                  004800      
000136******************************************************************004900      
000137** This variable defines a date in the format DDMMCCAA          **005000      
000138**                                                              **005100      
000139 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000140 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000141    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000142    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000143    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000144    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000145      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000146      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000147******************************************************************006000      
000148                                                                  006100      
000149******************************************************************006200      
000150** This variable defines a date in the Julian Format CCAADDD    **006300      
000151**                                                              **006400      
000152 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000153 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000154    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000155    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000156                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000157      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000158      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000159    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000160******************************************************************007300      
000161                                                                  007400      
000162******************************************************************007500      
000163** This variable defines a date in the format AAMMDD            **007600      
000164**                                                              **007700      
000165 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000166 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000167    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000168    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000169    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000170******************************************************************008300      
000171                                                                  008400      
000172******************************************************************008500      
000173** This variable defines a date in the format MMDDAA            **008600      
000174**                                                              **008700      
000175 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000176 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000177    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000178    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000179    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000180******************************************************************009300      
000181                                                                  009400      
000182******************************************************************009500      
000183** This variable defines a date in the format DDMMAA            **009600      
000184**                                                              **009700      
000185 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000186 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000187    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000188    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000189    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000190******************************************************************010300      
000191                                                                  010400      
000192******************************************************************010500      
000193** These variables are defined to be used for CALL bridge logic **010600      
000194**                                                              **010700      
000195 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000196 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000197 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000198 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000199 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000200 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000201******************************************************************011400      
000202                                                                  011500      
000203******************************************************************011600      
000204** This variable is used for converting only a year field AA to **011700      
000205** CCAA and a CCAA to AA                                        **011800      
000206 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000207 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000208    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000209    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000210 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000211 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000212******************************************************************012300      
000213                                                                  012400      
000214******************************************************************012500      
000215** These variables are Bridge Variables for Intercambio files   **012600      
000216** para EDOCTA                                                  **012700      
000217 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000218 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000219 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000220 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000221 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000222 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000223 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000224******************************************************************013500      
000225* Para MODULO                                                     013600      
000226 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000227******************************************************************013800      
000228******************************************************************013900      
000229** Para FMOVSCHABO                                                014000      
000230 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000231******************************************************************014200      
000232                                                                  014300      
000233******************************************************************014400      
000234***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000235******************************************************************014600      
000236                                                                  014700      
000237 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000238 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000239     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000240     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000241     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000242******************************************************************015300      
000243                                                                  015400      
000244******************************************************************015500      
000245***  These Variables Are Defined For Date In AAMM Format       ***015600      
000246******************************************************************015700      
000247                                                                  015800      
000248 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000249 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000250     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000251     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000252******************************************************************016300      
000253                                                                  016400      
000254                                                                  016500      
000255*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000256  01  A2K-BASE-YEAR     PIC 9(02) VALUE 50.                       005503      
000257*TERMINA CODIGO DE RENOVACION CRONOS 2000                         005504      
000258                                                                  005600      
000259*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000260* COPY "(S151)S151/FORMATO/DISPLAY.".                             005651      
000261                                                                  000100      
000262*===============================================================* 000200      
000263*         FORMATO PARA DISPLAYS                                 * 000300      
000264*===============================================================* 000400      
000265                                                                  000500      
000266 01 WKS-TIT-REPORTE2.                                             000600      
000267    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000268    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000269    02 FILLER                       PIC X(06) VALUE               000900      
000270                                              "/LIST/".           001000      
000271    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000272    02 FILLER                       PIC X(01) VALUE "/".          001071      
000273    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000274    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000275    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000276    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000277    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000278    02 FILLER                       PIC X(11) VALUE               001600      
000279                                              "/001MSGIMP.".      001700      
000280                                                                  002100      
000281 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000282                                                                  002300      
000283***********************************************************       002400      
000284*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000285***********************************************************       002600      
000286 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000287*8D                                                               002800      
000288 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000289 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000290    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000291    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000292    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000293*8D                                                               003400      
000294 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000295 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000296    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000297    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000298    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000299                                                                  004100      
000300 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000301                                                                  004300      
000302 01 WKS-FECHA-HORA2.                                              004400      
000303    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000304    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000305       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000306       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000307    02 WKS-TIME-MAQ2.                                             004600      
000308       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
000309       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
000310          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
000311          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
000312          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
000313       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
000314    02 FILLER                             PIC X(01).              004900      
000315    02 WKS-RESTO2                         PIC X(04).              005000      
000316                                                                  005100      
000317*8D                                                               005200      
000318****************** REPORTE DE MENSAJES *********************      005300      
000319 01 WLI-ENCAB-12.                                                 005400      
000320    03 FILLER                             PIC X(05) VALUE         005500      
000321       "S151-".                                                   005600      
000322    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000323    03 FILLER                             PIC X(15) VALUE         005671      
000324       "-001IMPMENSAJES".                                         005691      
000325    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000326    03 FILLER                             PIC X(34) VALUE         005800      
000327       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000328    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000329    03 FILLER                             PIC X(26) VALUE         006100      
000330       "FECHA DE LA INFORMACION : ".                              006200      
000331    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000332    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000333       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000334       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000335       05  WKS-SLASH1                         PIC X(01).          006356      
000336       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000337       05  WKS-SLASH2                         PIC X(01).          006358      
000338       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000339 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000340 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000341    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000342    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000343    03 FILLER                          PIC X(01).                 006371      
000344    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000345    03 FILLER                          PIC X(01).                 006381      
000346    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000347*8D                                                               006400      
000348 01 WLI-ENCAB-22.                                                 006500      
000349     03 FILLER                          PIC X(11) VALUE           006600      
000350        "F.PROCESO: ".                                            006700      
000351     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000352     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000353     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
000354     03 FILLER                          PIC X(01) VALUE ":".      007020      
000355     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
000356     03 FILLER                          PIC X(01) VALUE ":".      007060      
000357     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
000358     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000359     03 FILLER                          PIC X(24) VALUE           007200      
000360              "IMPRESION MENSAJES DEL S".                         007300      
000361     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000362     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000363     03 FILLER                          PIC X(14) VALUE           007600      
000364        "TIPO PROCESO: ".                                         007700      
000365     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000366*8D                                                               007900      
000367 01 WLI-ENCAB-32.                                                 008000      
000368     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000369*       "VERSION  : ".                                            008200      
000370*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000371     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000372     03 FILLER                     PIC X(07) VALUE                008500      
000373        "HOJA : ".                                                008600      
000374     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000375                                                                  008800      
000376 01 WLI-ENCAB-42.                                                 008900      
000377     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000378     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000379     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000380                                                                  009300      
000381 01 WLI-ENCAB-52.                                                 009400      
000382    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000383    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000384    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000385    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000386                                                                  009900      
000387*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
000388 01 WLI-ENCAB-62.                                                 009910      
000389    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
000390    03 WLI-RESULT                 PIC X(04).                      009920      
000391    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
000392    03 WLI-TEXTO                  PIC X(110).                     009930      
000393                                                                  009935      
000394 01 WLI-TOT-ENVIO.                                                009940      
000395    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
000396    03 FILLER                     PIC X(37) VALUE                 009950      
000397       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
000398    03 WLI-ENV-CTD                PIC X(04).                      009960      
000399*FIN - INFOWARE                                                   009970      
000400****************************************************************  010000      
000401*                 CONTADORES DE HOJAS                          *  010100      
000402****************************************************************  010200      
000403                                                                  010300      
000404  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000405*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000406                                                                  005671      
000407 77  77-AUX               PIC  9(02) COMP   VALUE ZEROES.         005700      
000408 77  77-CSI               PIC  9(02) COMP   VALUE ZEROES.         005800      
000409 77  77-DIA-SEM           PIC  9(02) BINARY VALUE ZEROES.         005900      
000410 77  77-DIAS-PTE          PIC  9(02) BINARY VALUE ZEROES.         006000      
000411 77  77-EOF               PIC  9(02) COMP   VALUE ZEROES.         006100      
000412 77  77-EOF-SDOS          PIC  9(02) COMP   VALUE ZEROES.         006200      
000413 77  77-ERROR             PIC  9(02) COMP   VALUE ZEROES.         006300      
000414*77  77-FVAL-FECH1        PIC  9(06) COMP   VALUE ZEROES.         006400      
000415*INICIA CODIGO DE RENOVACION CRONOS 2000                          006401      
000416 77  77-FVAL-FECH1        PIC  9(08) COMP   VALUE ZEROES.         006402      
000417*TERMINA CODIGO DE RENOVACION CRONOS 2000                         006403      
000418*77  77-FVAL-FECH2        PIC  9(06) COMP   VALUE ZEROES.         006500      
000419*INICIA CODIGO DE RENOVACION CRONOS 2000                          006501      
000420 77  77-FVAL-FECH2        PIC  9(08) COMP   VALUE ZEROES.         006502      
000421*TERMINA CODIGO DE RENOVACION CRONOS 2000                         006503      
000422*77  77-FVAL-FECH3        PIC  9(06) COMP   VALUE ZEROES.         006600      
000423*INICIA CODIGO DE RENOVACION CRONOS 2000                          006601      
000424 77  77-FVAL-FECH3        PIC  9(08) COMP   VALUE ZEROES.         006602      
000425*TERMINA CODIGO DE RENOVACION CRONOS 2000                         006603      
000426 77  77-FVAL-IMPO1        PIC  9(18)V99  COMP   VALUE ZEROES.     006700      
000427 77  77-FVAL-IMPO2        PIC  9(18)V99  COMP   VALUE ZEROES.     006800      
000428 77  77-FVAL-IMPO3        PIC  9(18)V99  COMP   VALUE ZEROES.     006900      
000429*77  77-FEC-PROCESO       PIC  9(06) COMP.                        007000      
000430*INICIA CODIGO DE RENOVACION CRONOS 2000                          007001      
000431 77  77-FEC-PROCESO       PIC  9(08) COMP.                        007002      
000432*TERMINA CODIGO DE RENOVACION CRONOS 2000                         007003      
000433*77  77-FEC-PROXPRO       PIC  9(06) COMP.                        007100      
000434*INICIA CODIGO DE RENOVACION CRONOS 2000                          007101      
000435 77  77-FEC-PROXPRO       PIC  9(08) COMP.                        007102      
000436*TERMINA CODIGO DE RENOVACION CRONOS 2000                         007103      
000437 77  77-LEI-AUXKEY        PIC  9(02) COMP   VALUE ZEROES.         007200      
000438 77  77-SI                PIC  X(02)        VALUE "NO".           007300      
000439 77  77-FORMATO           PIC  9(01) COMP   VALUE ZEROES.         007400      
000440 77  W77-FORMATO          PIC  9.                                 007500      
000441 77  WS-FUNCION           PIC S9(11) BINARY VALUE ZEROES.         007600      
000442 77  WS-FORMATO           PIC S9(11) BINARY VALUE ZEROES.         007700      
000443 77  WS-FACTOR-NVOPSO     PIC  9(04) COMP.                        007800      
000444 77  W77-SDO-TRA-REG      PIC  9(06).                             007900      
000445 77  W77-RLEI-TAB         PIC  9(06).                             008000      
000446                                                                  008100      
000447******************************************************************008200      
000448*             PARAMETROS LIBRERIA LOCAL SUPPORT                  *008300      
000449******************************************************************008400      
000450*01  WS-FECHA1                    PIC  X(06).                     008500      
000451*INICIA CODIGO DE RENOVACION CRONOS 2000                          008501      
000452 01  WS-FECHA1                    PIC  X(08).                     008502      
000453*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008503      
000454 01  WS-FECHA1-R                  REDEFINES WS-FECHA1.            008600      
000455*    05  WS-ANO1-RED              PIC  9(02).                     008700      
000456*INICIA CODIGO DE RENOVACION CRONOS 2000                          008701      
000457     05  WS-ANO1-RED              PIC  9(04).                     008702      
000458*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008703      
000459     05  WS-MES1-RED              PIC  9(02).                     008800      
000460     05  WS-DIA1-RED              PIC  9(02).                     008900      
000461*01  WS-FECHA1-NUM REDEFINES WS-FECHA1 PIC 9(06).                 009000      
000462*INICIA CODIGO DE RENOVATION CRONOS 2000                          009001      
000463 01  WS-FECHA1-NUM REDEFINES WS-FECHA1 PIC 9(08).                 009002      
000464*TERMINA CODIGO DE RENOVACION CRONOS 2000                         009003      
000465                                                                  009100      
000466*01  WS-FECHA2                   PIC  X(06).                      009200      
000467*INICIA CODIGO DE RENOVACION CRONOS 2000                          009201      
000468 01  WS-FECHA2                   PIC  X(08).                      009202      
000469*TERMINA CODIGO DE RENOVACION CRONOS 2000                         009203      
000470 01  WS-FECHA2-R REDEFINES WS-FECHA2.                             009300      
000471*    05 WS-ANO2-RED              PIC  9(02).                      009400      
000472*INICIA CODIGO DE RENOVACION CRONOS 2000                          009401      
000473     05 WS-ANO2-RED              PIC  9(04).                      009402      
000474*TERMINA CODIGO DE RENOVACION CRONOS 2000                         009403      
000475     05 WS-MES2-RED              PIC  9(02).                      009500      
000476     05 WS-DIA2-RED              PIC  9(02).                      009600      
000477                                                                  009700      
000478                                                                  009800      
000479 01  PROXIMO-PROCESO.                                             009900      
000480*    02  ANO-PROX                PIC 9(02).                       010000      
000481*INICIA CODIGO DE RENOVACION CRONOS 2000                          010001      
000482     02  ANO-PROX                PIC 9(04).                       010002      
000483*TERMINA CODIGO DE RENOVACION CRONOS 2000                         010003      
000484     02  MES-PROX                PIC 9(02).                       010100      
000485     02  DIA-PROX                PIC 9(02).                       010200      
000486                                                                  010300      
000487 01  PROCESO-ANTERIOR.                                            010400      
000488*    02  ANO-PANT                PIC 9(02) COMP.                  010500      
000489*INICIA CODIGO DE RENOVACION CRONOS 2000                          010501      
000490     02  ANO-PANT                PIC 9(04) COMP.                  010502      
000491*TERMINA CODIGO DE RENOVACION CRONOS 2000                         010503      
000492     02  MES-PANT                PIC 9(02) COMP.                  010600      
000493     02  DIA-PANT                PIC 9(02) COMP.                  010700      
000494*01  RPROCESO-ANTERIOR REDEFINES PROCESO-ANTERIOR PIC 9(06) COMP. 010800      
000495*INICIA CODIGO DE RENOVACION CRONOS 2000                          010801      
000496 01  RPROCESO-ANTERIOR REDEFINES PROCESO-ANTERIOR PIC 9(08) COMP. 010802      
000497*TERMINA CODIGO DE RENOVACION CRONOS 2000                         010803      
000498                                                                  010900      
000499 01  BASE-FECHA2.                                                 011000      
000500*    02  AA-BASE2                PIC 9(02) COMP.                  011100      
000501*INICIA CODIGO DE RENOVACION CRONOS 2000                          011101      
000502     02  AA-BASE2                PIC 9(04) COMP.                  011102      
000503*TERMINA CODIGO DE RENOVACION CRONOS 2000                         011103      
000504     02  MM-BASE2                PIC 9(02) COMP.                  011200      
000505     02  DD-BASE2                PIC 9(02) COMP.                  011300      
000506*01  FECHA-BASE2 REDEFINES BASE-FECHA2 PIC 9(06) COMP.            011400      
000507*INICIA CODIGO DE RENOVATION CRONOS 2000                          011401      
000508 01  FECHA-BASE2 REDEFINES BASE-FECHA2 PIC 9(08) COMP.            011402      
000509*TERMINA CODIGO DE RENOVACION CRONOS 2000                         011403      
000510                                                                  011500      
000511*01  FECHA-MAQUINA               PIC 9(06).                       011600      
000512*INICIA CODIGO DE RENOVACION CRONOS 2000                          011601      
000513 01  FECHA-MAQUINA               PIC 9(08).                       011602      
000514*TERMINA CODIGO DE RENOVACION CRONOS 2000                         011603      
000515 01  FECHA-AMERICANA REDEFINES FECHA-MAQUINA.                     011700      
000516*    05  ANO                     PIC 9(02).                       011800      
000517*INICIA CODIGO DE RENOVACION CRONOS 2000                          011801      
000518     05  ANO                     PIC 9(04).                       011802      
000519*TERMINA CODIGO DE RENOVACION CRONOS 2000                         011803      
000520     05  MES                     PIC 9(02).                       011900      
000521     05  DIA                     PIC 9(02).                       012000      
000522                                                                  012100      
000523 01  DIA-CREACION.                                                012200      
000524     02  DIA                     PIC 9(02).                       012300      
000525     02  MES                     PIC 9(02).                       012400      
000526*    02  ANO                     PIC 9(02).                       012500      
000527*INICIA CODIGO DE RENOVACION CRONOS 2000                          012501      
000528     02  ANO                     PIC 9(04).                       012502      
000529*TERMINA CODIGO DE RENOVACION CRONOS 2000                         012503      
000530                                                                  012600      
000531 01  HOY-FECHA.                                                   012700      
000532     02  DIA-HOY                 PIC 9(02).                       012800      
000533     02  MES-HOY                 PIC 9(02).                       012900      
000534*    02  ANO-HOY            PIC 9(02).                            013000      
000535*INICIA CODIGO DE RENOVACION CRONOS 2000                          013001      
000536     02  ANO-HOY            PIC 9(04).                            013002      
000537*TERMINA CODIGO DE RENOVACION CRONOS 2000                         013003      
000538*01  FECHA-HOY REDEFINES HOY-FECHA PIC 9(06).                     013100      
000539*INICIA CODIGO DE RENOVATION CRONOS 2000                          013101      
000540 01  FECHA-HOY REDEFINES HOY-FECHA PIC 9(08).                     013102      
000541*TERMINA CODIGO DE RENOVACION CRONOS 2000                         013103      
000542                                                                  013200      
000543*01 WS-FECHA-NVOPSO              PIC 9(06).                       013300      
000544*INICIA CODIGO DE RENOVACION CRONOS 2000                          013301      
000545 01 WS-FECHA-NVOPSO              PIC 9(08).                       013302      
000546*TERMINA CODIGO DE RENOVACION CRONOS 2000                         013303      
000547    88 WS-DIAPBAS-NVOPSO         VALUE 311292,010193,020193,      013400      
000548                                 030193,040193.                   013500      
000549*                                                                 013600      
000550******************************************************************013700      
000551*                   CAMPOS AUXILIARES                            *013800      
000552******************************************************************013900      
000553*                                                                 014000      
000554 01  WS-WORK.                                                     014100      
000555*    03  WS-FECHA-PROCESO         PIC 9(06).                      014200      
000556*INICIA CODIGO DE RENOVACION CRONOS 2000                          014201      
000557     03  WS-FECHA-PROCESO         PIC 9(08).                      014202      
000558*TERMINA CODIGO DE RENOVACION CRONOS 2000                         014204      
000559*    03  WS-FECHA-MAQUINA         PIC 9(06).                      014300      
000560*INICIA CODIGO DE RENOVACION CRONOS 2000                          014301      
000561     03  WS-FECHA-MAQUINA         PIC 9(08).                      014302      
000562*TERMINA CODIGO DE RENOVACION CRONOS 2000                         014304      
000563*    03  WS-FECHA-AMD             PIC 9(06).                      014400      
000564*INICIA CODIGO DE RENOVACION CRONOS 2000                          014401      
000565     03  WS-FECHA-AMD             PIC 9(08).                      014402      
000566*TERMINA CODIGO DE RENOVACION CRONOS 2000                         014403      
000567     03  WS-FECHA-AMD-R   REDEFINES WS-FECHA-AMD.                 014500      
000568*        05 WS-FECHA-AMD-AA       PIC 9(02).                      014600      
000569*INICIA CODIGO DE RENOVACION CRONOS 2000                          014601      
000570         05 WS-FECHA-AMD-AA       PIC 9(04).                      014602      
000571*TERMINA CODIGO DE RENOVACION CRONOS 2000                         014604      
000572         05 WS-FECHA-AMD-MM       PIC 9(02).                      014700      
000573         05 WS-FECHA-AMD-DD       PIC 9(02).                      014800      
000574*    03  WS-FECHA-DMA             PIC 9(06).                      014900      
000575*INICIA CODIGO DE RENOVACION CRONOS 2000                          014901      
000576     03  WS-FECHA-DMA             PIC 9(08).                      014902      
000577*TERMINA CODIGO DE RENOVACION CRONOS 2000                         014903      
000578     03  WS-FECHA-DMA-R   REDEFINES WS-FECHA-DMA.                 015000      
000579         05 WS-FECHA-DMA-DD       PIC 9(02).                      015100      
000580         05 WS-FECHA-DMA-MM       PIC 9(02).                      015200      
000581*        05 WS-FECHA-DMA-AA       PIC 9(02).                      015300      
000582*INICIA CODIGO DE RENOVACION CRONOS 2000                          015301      
000583         05 WS-FECHA-DMA-AA       PIC 9(04).                      015302      
000584*TERMINA CODIGO DE RENOVACION CRONOS 2000                         015304      
000585*    03  WS-FECHA-MDA             PIC 9(06).                      015400      
000586*INICIA CODIGO DE RENOVACION CRONOS 2000                          015401      
000587     03  WS-FECHA-MDA             PIC 9(08).                      015402      
000588*TERMINA CODIGO DE RENOVACION CRONOS 2000                         015403      
000589     03  WS-FECHA-MDA-R   REDEFINES WS-FECHA-MDA.                 015500      
000590         05 WS-FECHA-MDA-MM       PIC 9(02).                      015600      
000591         05 WS-FECHA-MDA-DD       PIC 9(02).                      015700      
000592*        05 WS-FECHA-MDA-AA       PIC 9(02).                      015800      
000593*INICIA CODIGO DE RENOVACION CRONOS 2000                          015801      
000594         05 WS-FECHA-MDA-AA       PIC 9(04).                      015802      
000595*TERMINA CODIGO DE RENOVACION CRONOS 2000                         015804      
000596*                                                                 015900      
000597 01  CAMPOS-AUX.                                                  016000      
000598     02  I                PIC 9(02) COMP.                         016100      
000599     02  J                PIC 9(02) COMP.                         016200      
000600     02  K                PIC 9(02) COMP.                         016300      
000601     02  L                PIC 9(02) COMP.                         016350      
000602                                                                  016400      
000603 01  BASE-FECHA.                                                  016500      
000604*    02  AA-BASE          PIC 9(02) COMP.                         016600      
000605*INICIA CODIGO DE RENOVACION CRONOS 2000                          016601      
000606     02  AA-BASE          PIC 9(04) COMP.                         016602      
000607*TERMINA CODIGO DE RENOVACION CRONOS 2000                         016604      
000608     02  MM-BASE          PIC 9(02) COMP.                         016700      
000609     02  DD-BASE          PIC 9(02) COMP.                         016800      
000610*01  FECHA-BASE REDEFINES BASE-FECHA PIC 9(06) COMP.              016900      
000611*INICIA CODIGO DE RENOVATION CRONOS 2000                          016901      
000612 01  FECHA-BASE REDEFINES BASE-FECHA PIC 9(08) COMP.              016902      
000613*TERMINA CODIGO DE RENOVACION CRONOS 2000                         016903      
000614                                                                  017000      
000615 01  TABLA-SISTEMA.                                               017100      
000616     02  SIST-TABLA OCCURS 20.                                    017200      
000617         03  TAB-SIST     PIC 9(04) COMP.                         017300      
000618                                                                  017400      
000619 01  TABLA-ARRIBO.                                                017500      
000620     02  ARRIBO-TAB OCCURS 20.                                    017600      
000621         03  TAB-ARRIBO   PIC 9(04) COMP.                         017700      
000622                                                                  017800      
000623 01  TABLA-CONTROL.                                               017900      
000624     02  CONTROL-ARCHS OCCURS 20.                                 018000      
000625         03  NOMB-TAB     PIC X(35).                              018100      
000626*        03  FPRO-TAB     PIC 9(06) COMP.                         018200      
000627*INICIA CODIGO DE RENOVACION CRONOS 2000                          018201      
000628         03  FPRO-TAB     PIC 9(08) COMP.                         018202      
000629*TERMINA CODIGO DE RENOVACION CRONOS 2000                         018203      
000630*        03  DCRE-TAB     PIC 9(06) COMP.                         018300      
000631*INICIA CODIGO DE RENOVACION CRONOS 2000                          018301      
000632         03  DCRE-TAB     PIC 9(08) COMP.                         018302      
000633*TERMINA CODIGO DE RENOVACION CRONOS 2000                         018303      
000634         03  HCRE-TAB     PIC 9(06) COMP.                         018400      
000635         03  HCRE-TAB-R REDEFINES HCRE-TAB.                       018420      
000636             05 HCRE-T-AA PIC 9(02) COMP.                         018440      
000637             05 HCRE-T-MM PIC 9(02) COMP.                         018460      
000638             05 HCRE-T-DD PIC 9(02) COMP.                         018480      
000639         03  RLEY-TAB     PIC X(30).                              018500      
000640         03  RLEI-TAB     PIC 9(06) COMP.                         018600      
000641         03  RGRA-TAB     PIC 9(06) COMP.                         018700      
000642                                                                  018800      
000643 01  BLANCOS              PIC X(132) VALUE SPACES.                018900      
000644                                                                  019000      
000645 01  LLAVE-CTER.                                                  019100      
000646     02  LLAVE-CTE1       PIC 9(10).                              019200      
000647     02  LLAVE-CTE2       PIC 9(10).                              019300      
000648 01  LLAVE-CTE REDEFINES LLAVE-CTER PIC 9(20).                    019400      
000649*                                                                 019500      
000650******************************************************************019600      
000651*                 ETIQUETA DEL ARCHIVO                           *019700      
000652******************************************************************019800      
000653*                                                                 019900      
000654 01  W-ETIQ-SALDOS.                                               020000      
000655     03  FILLER           PIC X(01) VALUE "S".                    020100      
000656     03  PSIS             PIC 9(03).                              020200      
000657     03  FILLER           PIC X(18) VALUE "/FILE/S151/SALDOS/".   020300      
000658     03  PCSI             PIC X(03).                              020400      
000659     03  FILLER           PIC X(01) VALUE "/".                    020500      
000660     03  PANO             PIC 9(02).                              020600      
000661     03  PMES             PIC 9(02).                              020700      
000662     03  PDIA             PIC 9(02).                              020800      
000663     03  FILLER           PIC X(01) VALUE ".".                    020900      
000664 01  W-ETIQ-SDOS-SAL.                                             020910      
000665*    03  FILLER           PIC X(01) VALUE "S".                    020915      
000666*    03  SSIS             PIC 9(03).                              020920      
000667*    03  FILLER           PIC X(20) VALUE "/FILE/S151/SDOS/SAL/". 020925      
000668     03  FILLER           PIC X(11) VALUE "S151/FILE/S".          020926      
000669     03  SSIS             PIC 9(03).                              020927      
000670     03  FILLER           PIC X(10) VALUE "/SDOS/SAL/".           020928      
000671     03  SCSI             PIC X(03).                              020930      
000672     03  FILLER           PIC X(01) VALUE "/".                    020935      
000673     03  SANO             PIC 9(02).                              020940      
000674     03  SMES             PIC 9(02).                              020945      
000675     03  SDIA             PIC 9(02).                              020950      
000676     03  FILLER           PIC X(01) VALUE ".".                    020955      
000677                                                                  020960      
000678*                                                                 021000      
000679 01  WKS-ETIQ-REPORTE.                                            021100      
000680     03  FILLER           PIC X(15) VALUE "S151/LIST/P005/".      021200      
000681     03  WKS-CENTRO-IMP   PIC 9(02) VALUE 00.                     021300      
000682     03  WKS-SUBNODO-IMP  PIC 9(02) VALUE 00.                     021400      
000683     03  FILLER           PIC X(06) VALUE "/C000/".               021500      
000684     03  WKS-FECHA-BACKUP PIC 9(06) VALUE 0.                      021600      
000685     03  FILLER           PIC X(01) VALUE "/".                    021700      
000686     03  WKS-MIX-NUM      PIC 9(07) VALUE 0.                      021800      
000687     03  FILLER           PIC X(01) VALUE "/".                    021900      
000688     03  WKS-NUM-BACKUP   PIC 9(03) VALUE 0.                      022000      
000689     03  WKS-NOM-BACKUP   PIC X(07) .                             022100      
000690     03  FILLER           PIC X(01) VALUE".".                     022200      
000691                                                                  022300      
000692 01  W-ETIQ-TESORERIA.                                            022400      
000693     03  FILLER           PIC X(20) VALUE "S151/FILE/TESORERIA/". 022500      
000694     03  FILLER           PIC X(01) VALUE "S".                    022600      
000695     03  WKS-ET-SIST      PIC 9(03).                              022700      
000696     03  FILLER           PIC X(01) VALUE "/".                    022800      
000697     03  WKS-ET-FECHA     PIC 9(06).                              022900      
000698     03  FILLER           PIC X(01) VALUE ".".                    023000      
000699*SAMG                                                             023005      
000700 01  W-ETIQ-SDOS-INT.                                             023010      
000701     03  FILLER           PIC X(15) VALUE "S151/FILE/INTS/".      023015      
000702     03  FILLER           PIC X(07) VALUE "15104S0".              023020      
000703     03  WKS-INT-ID-SERV  PIC 9(01).                              023022      
000704     03  FILLER           PIC X(01) VALUE "/".                    023024      
000705     03  WKS-INT-CSI      PIC 9(02).                              023025      
000706     03  FILLER           PIC X(02) VALUE "/S".                   023030      
000707     03  WKS-INT-FECHA    PIC 9(06).                              023035      
000708     03  WKS-INT-NOM      PIC X(01).                              023045      
000709     03  FILLER           PIC X(01) VALUE "/".                    023055      
000710     03  WKS-INT-SIS      PIC 9(03).                              023060      
000711     03  FILLER           PIC X(10) VALUE " ON CMEMP.".           023065      
000712*                                                                 023100      
000713******************************************************************023200      
000714*                 TABLA DE C.S.I.S                               *023300      
000715******************************************************************023400      
000716*                                                                 023500      
000717 01  CSI-SIGLAS.                                                  023600      
000718     02  FILLER           PIC XXX VALUE "HER".                    023700      
000719     02  FILLER           PIC XXX VALUE "   ".                    023800      
000720     02  FILLER           PIC XXX VALUE "   ".                    023900      
000721     02  FILLER           PIC XXX VALUE "MON".                    024000      
000722     02  FILLER           PIC XXX VALUE "   ".                    024100      
000723     02  FILLER           PIC XXX VALUE "LEO".                    024200      
000724     02  FILLER           PIC XXX VALUE "VER".                    024300      
000725     02  FILLER           PIC XXX VALUE "   ".                    024400      
000726     02  FILLER           PIC XXX VALUE "CEN".                    024500      
000727     02  FILLER           PIC XXX VALUE "VDM".                    024600      
000728 01  SIGLAS-CSI REDEFINES CSI-SIGLAS.                             024700      
000729     02  CSIS-CSIS        OCCURS 10 TIMES.                        024800      
000730         03  CUAL-CSI     PIC X(03).                              024900      
000731                                                                  025000      
000732 01  NOMB-CSIS.                                                   025100      
000733     02  FILLER           PIC X(21) VALUE "C.S.I. HERMOSILLO    ".025200      
000734     02  FILLER           PIC X(21) VALUE "                     ".025300      
000735     02  FILLER           PIC X(21) VALUE "                     ".025400      
000736     02  FILLER           PIC X(21) VALUE "C.S.I. MONTERREY     ".025500      
000737     02  FILLER           PIC X(21) VALUE "                     ".025600      
000738     02  FILLER           PIC X(21) VALUE "C.S.I. CENTRO BAJIO  ".025700      
000739     02  FILLER           PIC X(21) VALUE "C.S.I. VERACRUZ      ".025800      
000740     02  FILLER           PIC X(21) VALUE "                     ".025900      
000741     02  FILLER           PIC X(21) VALUE "C.S.I. MORELOS       ".026000      
000742     02  FILLER           PIC X(21) VALUE "C.S.I. VALLE DE MEX. ".026100      
000743 01  NOMBRE-CSIS REDEFINES NOMB-CSIS.                             026200      
000744     02  N-NOMBRE-CSIS    OCCURS 10 TIMES.                        026300      
000745         03  NOMBRE-CSI   PIC X(21).                              026400      
000746***********************************************************       026500      
000747*      VARIABLES PARA OBTENER FECHA DE COMPILACION        *       026600      
000748***********************************************************       026700      
000749 01  COMPILA                         PIC 9(11)    BINARY.         026800      
000750                                                                  026900      
000751*01  WS-VERSION                      PIC 9(06)    COMP.           027000      
000752 01  WS-VERSION                      PIC 9(08)    COMP.           027055      
000753 01  WS-VERSION-R         REDEFINES       WS-VERSION.             027100      
000754     03 WS-MES-VERSION               PIC 9(02)    COMP.           027200      
000755     03 WS-DIA-VERSION               PIC 9(02)    COMP.           027300      
000756*    03 WS-AAA-VERSION               PIC 9(02)    COMP.           027400      
000757*INICIA CODIGO DE RENOVACION CRONOS 2000                          027401      
000758     03 WS-AAA-VERSION               PIC 9(04)    COMP.           027402      
000759*TERMINA CODIGO DE RENOVACION CRONOS 2000                         027403      
000760*                                                                 027500      
000761******************************************************************027600      
000762*                    TABLA DE ERRORES                            *027700      
000763******************************************************************027800      
000764*                                                                 027900      
000765 01  TABLA-ERROR.                                                 028000      
000766     02  FILL01   PIC X(30) VALUE "2350-GRABA-ARRIBO   BEGIN CTR".028100      
000767     02  FILL02   PIC X(30) VALUE "2350-GRABA-ARRIBO   STORE CTR".028200      
000768     02  FILL03   PIC X(30) VALUE "2350-GRABA-ARRIBO   END   CTR".028300      
000769     02  FILL04   PIC X(30) VALUE "2400-ACTUALIZO-CTES BEGIN CTE".028400      
000770     02  FILL05   PIC X(30) VALUE "2400-ACTUALIZO-CTES STORE CTE".028500      
000771     02  FILL06   PIC X(30) VALUE "2400-ACTUALIZO-CTES END   CTE".028600      
000772     02  FILL07   PIC X(30) VALUE "2500-ACTUALIZO-SUC  BEGIN SUC".028700      
000773     02  FILL08   PIC X(30) VALUE "2500-ACTUALIZO-SUC  STORE SUC".028800      
000774     02  FILL09   PIC X(30) VALUE "2500-ACTUALIZO-SUC  END   SUC".028900      
000775     02  FILL10   PIC X(30) VALUE "2600-ACTUALIZO-GLO  BEGIN GLO".029000      
000776     02  FILL11   PIC X(30) VALUE "2600-ACTUALIZO-GLO  STORE GLO".029100      
000777     02  FILL12   PIC X(30) VALUE "2600-ACTUALIZO-GLO  END   GLO".029200      
000778     02  FILL13   PIC X(30) VALUE "2400-ACTUALIZO-CTES LOCK  CTE".029300      
000779     02  FILL14   PIC X(30) VALUE "2500-ACTUALIZO-SUC  LOCK  SUC".029400      
000780     02  FILL15   PIC X(30) VALUE "2500-ACTUALIZO-GLO  LOCK  GLO".029500      
000781     02  FILL16   PIC X(30) VALUE "     ACTUALIZO SAR  LOCK  SAR".029600      
000782     02  FILL17   PIC X(30) VALUE "     ACTUALIZO SAR  BEGIN SAR".029700      
000783     02  FILL18   PIC X(30) VALUE "     ACTUALIZO SAR  STORE SAR".029800      
000784     02  FILL19   PIC X(30) VALUE "     ACTUALIZO SAR  END   SAR".029900      
000785 01  ERROR-TABLA REDEFINES TABLA-ERROR.                           030000      
000786     02  ERRORES  OCCURS 19.                                      030100      
000787         03  TAB-ERROR PIC X(30).                                 030200      
000788                                                                  030205      
000789* 01 WKS-WFL-COPY.                                                030210      
000790*    02 FILLER           PIC X(22) VALUE "BEGIN JOB; COPY (S151)".030220      
000791*    02 WKS-FILE-ORI     PIC X(50).                               030230      
000792*    02 FILLER           PIC X(10) VALUE " AS (S151)".            030240      
000793*    02 WKS-FILE-DEST    PIC X(50).                               030250      
000794*    02 FILLER           PIC X(18) VALUE " FROM CMEMP(PACK) ".    030252      
000795*    02 FILLER           PIC X(15) VALUE " TO CMEMP(PACK)".       030254      
000796*    02 FILLER           PIC X(10) VALUE "; END JOB.".            030260      
000797*                                                                 030300      
000798******************************************************************030400      
000799*       WFL PARA TRANSFERENCIA DE ARCHIVO POR TCP                *030500      
000800******************************************************************030600      
000801 01 W-WFL-TRANSF-TCPIP.                                           030700      
000802    02  FILLER                    PIC X(19) VALUE                 030800      
000803        "S151/WFL/COPYXTCP(""".                                   030900      
000804    02  W-WFL-TCP-FILEUNISYS      PIC X(07).                      031000      
000805    02  FILLER                    PIC X(03) VALUE """,""".        031100      
000806    02  W-WFL-TCP-FILESERVER      PIC X(04).                      031200      
000807    02  W-WFL-TCP-FILESERVER-DIA  PIC 9(02).                      031300      
000808    02  W-WFL-TCP-FILESERVER-MES  PIC 9(02).                      031400      
000809    02  FILLER                    PIC X(02) VALUE """)".          031500      
000810                                                                  031505      
000811 01 WKS-TIT-WFL.                                                  031510      
000812    02 FILLER                  PIC X(15) VALUE "BEGIN JOB; RUN ". 031515      
000813    02 WKS-START-PROG             PIC X(47).                      031520      
000814    02 FILLER                     PIC X(02) VALUE " (".           031525      
000815    02 FILLER                     PIC X(01) VALUE QUOTES.         031530      
000816    02 WKS-START-CSI              PIC X(09).                      031535      
000817    02 WKS-START-FEC              PIC X(08).                      031540      
000818    02 FILLER                     PIC X(01) VALUE "/".            031545      
000819    02 WKS-START-ARC              PIC 9(02).                      031550      
000820    02 FILLER                     PIC X(01) VALUE QUOTES.         031555      
000821    02 FILLER                     PIC X(12) VALUE ") ; END JOB.". 031560      
000822                                                                  031565      
000823***************************************************************   031567      
000824*          LIBRERIA CTLVERS       ( S151)                     *   031569      
000825***************************************************************   031571      
000826 01  WKS-CTLVERS-LIBRERIA            PIC X(12).                   031573      
000827 01  WKS-CTLVERS-TITULO              PIC X(72).                   031575      
000828 01  WKS-CTLVERS-STATUS              PIC S9(11) BINARY.           031577      
000829 01  WKS-CTLVERS-NUMREG              PIC 9(02).                   031579      
000830 01  WKS-CTLVERS-LIBID               PIC X(12).                   031581      
000831 01  WKS-CTLVERS-LIBID-R REDEFINES WKS-CTLVERS-LIBID.             031583      
000832     03 WKS-LIBID-NOMB               PIC X(09).                   031585      
000833     03 WKS-LIBID-SIST               PIC X(03).                   031587      
000834******************************************************************031600      
000835*           REGISTRO DE TRANSFERENCIA DE ARCHIVOS               * 031700      
000836******************************************************************031800      
000837*                                              NUEVO FORMATO SAR  031900      
000838 01  W-REG-SALDOS-NVO.                                            032000      
000839     02  W-HEADER-SDOS-NVO.                                       032100      
000840         03  NVO-CTL-CVES         PIC 9(02)       COMP.           032200      
000841         03  NVO-CTL-CSIO         PIC 9(04)       COMP.           032300      
000842         03  FILLER               PIC X(01).                      032400      
000843         03  NVO-CTL-SIST         PIC 9(04)       COMP.           032500      
000844         03  NVO-CTL-FPRO         PIC 9(06).                      032600      
000845         03  NVO-CTL-DCRE         PIC 9(06).                      032700      
000846         03  NVO-CTL-HCRE         PIC 9(06).                      032800      
000847         03  NVO-CTL-FORMATO      PIC 9(01).                      032900      
000848         03  FILLER               PIC X(65).                      033000      
000849     02  W-REG-CLIENTE-NVO REDEFINES W-HEADER-SDOS-NVO.           033100      
000850         03  NVO-CTE-CVES         PIC 9(02)       COMP.           033200      
000851         03  NVO-CTE-SIST         PIC 9(04)       COMP.           033300      
000852         03  NVO-CTE-SUC          PIC 9(04)       COMP.           033400      
000853         03  NVO-CTE-MON          PIC 9(02)       COMP.           033500      
000854         03  NVO-CTE-CTAS         PIC 9(20)       COMP.           033600      
000855         03  NVO-CTE-INST         PIC 9(04)       COMP.           033700      
000856         03  NVO-CTE-SEXP         PIC 9(04)       COMP.           033800      
000857         03  NVO-CTE-NOMB         PIC X(30).                      033900      
000858         03  NVO-CTE-SANT         PIC 9(18)V99    COMP.           034000      
000859         03  NVO-CTE-SACT         PIC 9(18)V99    COMP.           034100      
000860         03  NVO-CTE-FECH         PIC 9(06)       COMP.           034200      
000861         03  FILLER               PIC X(17).                      034300      
000862     02  W-REG-SUCURSAL-NVO REDEFINES W-HEADER-SDOS-NVO.          034400      
000863         03  NVO-SUC-CVES         PIC 9(02)       COMP.           034500      
000864         03  NVO-SUC-SIST         PIC 9(04)       COMP.           034600      
000865         03  NVO-SUC-SUCU         PIC 9(04)       COMP.           034700      
000866         03  NVO-SUC-MON          PIC 9(02)       COMP.           034800      
000867         03  NVO-SUC-SANT         PIC 9(18)V99    COMP.           034900      
000868         03  NVO-SUC-SACT         PIC 9(18)V99    COMP.           035000      
000869         03  NVO-SUC-FECH         PIC 9(06)       COMP.           035100      
000870         03  FILLER               PIC X(61).                      035200      
000871     02  W-REG-GLOBALES-NVO REDEFINES W-HEADER-SDOS-NVO.          035300      
000872         03  NVO-GLO-CVES         PIC 9(02)       COMP.           035400      
000873         03  NVO-GLO-SIST         PIC 9(04)       COMP.           035500      
000874         03  NVO-GLO-MON          PIC 9(02)       COMP.           035600      
000875         03  NVO-GLO-SANT         PIC 9(18)V99    COMP.           035700      
000876         03  NVO-GLO-SACT         PIC 9(18)V99    COMP.           035800      
000877         03  NVO-GLO-FECH         PIC 9(06)       COMP.           035900      
000878         03  FILLER               PIC X(63).                      036000      
000879     02  W-REG-FECHVAL-NVO REDEFINES W-HEADER-SDOS-NVO.           036100      
000880         03  NVO-SAR-CVES         PIC 9(02)       COMP.           036200      
000881         03  NVO-SAR-SIST         PIC 9(04)       COMP.           036300      
000882         03  NVO-TAB-FECHVAL-NVO OCCURS 5 TIMES.                  036400      
000883             04  NVO-SAR-FEC      PIC 9(06)       COMP.           036500      
000884             04  NVO-SAR-IMP      PIC 9(18)V99    COMP.           036600      
000885             04  NVO-SAR-NUM      PIC 9(04)       COMP.           036700      
000886         03  FILLER               PIC X(12).                      036800      
000887     02  W-REG-SDOANT-NVO REDEFINES W-HEADER-SDOS-NVO.            036900      
000888         03  NVO-ANT-CVES         PIC 9(02)       COMP.           037000      
000889         03  NVO-ANT-SIST         PIC 9(04)       COMP.           037100      
000890         03  NVO-ANT-NAPO         PIC 9(04)       COMP.           037200      
000891         03  NVO-ANT-APOR         PIC 9(18)V99    COMP.           037300      
000892         03  NVO-ANT-NINS         PIC 9(04)       COMP.           037400      
000893         03  NVO-ANT-INST         PIC 9(18)V99    COMP.           037500      
000894         03  FILLER               PIC X(63).                      037600      
000895     02  W-REG-CANFECHVAL-NVO REDEFINES W-HEADER-SDOS-NVO.        037700      
000896         03  NVO-CAN-CVES         PIC 9(02)       COMP.           037800      
000897         03  NVO-CAN-SIST         PIC 9(04)       COMP.           037900      
000898         03  NVO-TAB-CANFECHVAL-NVO OCCURS 5 TIMES.               038000      
000899             04  NVO-CAN-FEC      PIC 9(06)       COMP.           038100      
000900             04  NVO-CAN-IMP      PIC 9(18)V99    COMP.           038200      
000901             04  NVO-CAN-NUM      PIC 9(04)       COMP.           038300      
000902         03  FILLER               PIC X(12).                      038400      
000903     02  W-TRAILER-SDOS-NVO REDEFINES W-HEADER-SDOS-NVO.          038500      
000904         03  NVO-TRA-CVES         PIC 9(02)       COMP.           038600      
000905         03  NVO-TRA-SIST         PIC 9(04)       COMP.           038700      
000906         03  FILLER               PIC X(02).                      038800      
000907         03  NVO-TRA-REG          PIC 9(06)       COMP.           038900      
000908         03  FILLER               PIC X(82).                      039000      
000909*ASM ESTE FORMATO UNICO SE UTILIZA PARA TODOS LOS ARCHIVOS DE SAL.039001      
000910 01  W-REG-SDOS-NVOSAL.                                           039002      
000911     02  W-HEADER-SDOS-NVOSAL.                                    039003      
000912         03  UNI-CTL-CVES         PIC 9(02).                      039004      
000913         03  UNI-CTL-CSIO         PIC 9(04).                      039005      
000914         03  FILLER               PIC X(01).                      039006      
000915         03  UNI-CTL-SIST         PIC 9(04).                      039007      
000916         03  UNI-CTL-FPRO         PIC 9(06).                      039008      
000917         03  UNI-CTL-DCRE         PIC 9(06).                      039009      
000918         03  UNI-CTL-HCRE         PIC 9(06).                      039010      
000919         03  UNI-CTL-FORMATO      PIC 9(01).                      039011      
000920         03  FILLER               PIC X(126).                     039012      
000921     02  W-REG-CLIENTE-NVOSAL REDEFINES W-HEADER-SDOS-NVOSAL.     039013      
000922         03  UNI-CTE-CVES         PIC 9(02).                      039014      
000923         03  UNI-CTE-SIST         PIC 9(04).                      039015      
000924         03  UNI-CTE-SUC          PIC 9(04).                      039016      
000925         03  UNI-CTE-MON          PIC 9(02).                      039017      
000926         03  UNI-CTE-CTAS         PIC 9(20).                      039018      
000927         03  UNI-CTE-INST         PIC 9(04).                      039019      
000928         03  UNI-CTE-SEXP         PIC 9(04).                      039020      
000929         03  UNI-CTE-NOMB         PIC X(30).                      039021      
000930         03  UNI-CTE-SANT         PIC 9(18)V99.                   039022      
000931         03  UNI-CTE-SACT         PIC 9(18)V99.                   039023      
000932         03  UNI-CTE-FECH         PIC 9(06).                      039024      
000933         03  FILLER               PIC X(40).                      039025      
000934     02  W-REG-SUCURSAL-NVOSAL REDEFINES W-HEADER-SDOS-NVOSAL.    039026      
000935         03  UNI-SUC-CVES         PIC 9(02).                      039027      
000936         03  UNI-SUC-SIST         PIC 9(04).                      039028      
000937         03  UNI-SUC-SUCU         PIC 9(04).                      039029      
000938         03  UNI-SUC-MON          PIC 9(02).                      039030      
000939         03  UNI-SUC-SANT         PIC 9(18)V99.                   039031      
000940         03  UNI-SUC-SACT         PIC 9(18)V99.                   039032      
000941         03  UNI-SUC-FECH         PIC 9(06).                      039033      
000942         03  FILLER               PIC X(98).                      039034      
000943     02  W-REG-GLOBALES-NVOSAL REDEFINES W-HEADER-SDOS-NVOSAL.    039035      
000944         03  UNI-GLO-CVES         PIC 9(02).                      039036      
000945         03  UNI-GLO-SIST         PIC 9(04).                      039037      
000946         03  UNI-GLO-MON          PIC 9(02).                      039038      
000947         03  UNI-GLO-SANT         PIC 9(18)V99.                   039039      
000948         03  UNI-GLO-SACT         PIC 9(18)V99.                   039040      
000949         03  UNI-GLO-FECH         PIC 9(06).                      039041      
000950         03  FILLER               PIC X(102).                     039042      
000951     02  W-REG-FECHVAL-NVOSAL REDEFINES W-HEADER-SDOS-NVOSAL.     039043      
000952         03  UNI-SAR-CVES         PIC 9(02).                      039044      
000953         03  UNI-SAR-SIST         PIC 9(04).                      039045      
000954         03  UNI-TAB-FECHVAL-NVO OCCURS 5 TIMES.                  039046      
000955             04  UNI-SAR-FEC      PIC 9(06).                      039047      
000956             04  UNI-SAR-IMP      PIC 9(18)V99.                   039048      
000957             04  UNI-SAR-NUM      PIC 9(04).                      039049      
000958*        03  FILLER               PIC X(24).                      039050      
000959     02  W-REG-SDOANT-NVOSAL REDEFINES W-HEADER-SDOS-NVOSAL.      039051      
000960         03  UNI-ANT-CVES         PIC 9(02).                      039052      
000961         03  UNI-ANT-SIST         PIC 9(04).                      039053      
000962         03  UNI-ANT-NAPO         PIC 9(04).                      039054      
000963         03  UNI-ANT-APOR         PIC 9(18)V99.                   039055      
000964         03  UNI-ANT-NINS         PIC 9(04).                      039056      
000965         03  UNI-ANT-INST         PIC 9(18)V99.                   039057      
000966         03  FILLER               PIC X(102).                     039058      
000967     02  W-REG-CANFECHVAL-NVOSAL REDEFINES W-HEADER-SDOS-NVOSAL.  039059      
000968         03  UNI-CAN-CVES         PIC 9(02).                      039060      
000969         03  UNI-CAN-SIST         PIC 9(04).                      039061      
000970         03  UNI-TAB-CANFECHVAL-NVO OCCURS 5 TIMES.               039062      
000971             04  UNI-CAN-FEC      PIC 9(06).                      039063      
000972             04  UNI-CAN-IMP      PIC 9(18)V99.                   039064      
000973             04  UNI-CAN-NUM      PIC 9(04).                      039065      
000974*        03  FILLER               PIC X(24).                      039066      
000975     02  W-TRAILER-SDOS-NVOSAL REDEFINES W-HEADER-SDOS-NVOSAL.    039067      
000976         03  UNI-TRA-CVES         PIC 9(02).                      039068      
000977         03  UNI-TRA-SIST         PIC 9(04).                      039069      
000978         03  FILLER               PIC X(02).                      039070      
000979         03  UNI-TRA-REG          PIC 9(06).                      039071      
000980         03  FILLER               PIC X(142).                     039072      
000981******************************************************************039100      
000982*           REGISTRO DE TRANSFERENCIA DE ARCHIVOS               * 039200      
000983******************************************************************039300      
000984*                                              NUEVO FORMATO      039400      
000985 01  W-REG-SALDOS.                                                039500      
000986     02  W-HEADER-SDOS.                                           039600      
000987         03  SDO-CTL-CVES         PIC 9(02)       COMP.           039700      
000988         03  SDO-CTL-CSIO         PIC 9(04)       COMP.           039800      
000989         03  FILLER               PIC X(01).                      039900      
000990         03  SDO-CTL-SIST         PIC 9(04)       COMP.           040000      
000991         03  SDO-CTL-FPRO         PIC 9(06).                      040100      
000992         03  SDO-CTL-DCRE         PIC 9(06).                      040200      
000993         03  SDO-CTL-HCRE         PIC 9(06).                      040300      
000994         03  SDO-CTL-FORMATO      PIC 9(01).                      040400      
000995         03  FILLER               PIC X(65).                      040500      
000996     02  W-REG-CLIENTE REDEFINES W-HEADER-SDOS.                   040600      
000997         03  SDO-CTE-CVES         PIC 9(02)       COMP.           040700      
000998         03  SDO-CTE-SIST         PIC 9(04)       COMP.           040800      
000999         03  SDO-CTE-SUC          PIC 9(04)       COMP.           040900      
001000         03  SDO-CTE-MON          PIC 9(02)       COMP.           041000      
001001         03  SDO-CTE-CTAS         PIC 9(20)       COMP.           041100      
001002         03  SDO-CTE-INST         PIC 9(04)       COMP.           041200      
001003         03  SDO-CTE-SEXP         PIC 9(04)       COMP.           041300      
001004         03  SDO-CTE-NOMB         PIC X(30).                      041400      
001005         03  SDO-CTE-SANT         PIC 9(18)V99    COMP.           041500      
001006         03  SDO-CTE-SACT         PIC 9(18)V99    COMP.           041600      
001007         03  SDO-CTE-FECH         PIC 9(06)       COMP.           041700      
001008         03  FILLER               PIC X(17).                      041800      
001009     02  W-REG-SUCURSAL REDEFINES W-HEADER-SDOS.                  041900      
001010         03  SDO-SUC-CVES         PIC 9(02)       COMP.           042000      
001011         03  SDO-SUC-SIST         PIC 9(04)       COMP.           042100      
001012         03  SDO-SUC-SUCU         PIC 9(04)       COMP.           042200      
001013         03  SDO-SUC-MON          PIC 9(02)       COMP.           042300      
001014         03  SDO-SUC-SANT         PIC 9(18)V99    COMP.           042400      
001015         03  SDO-SUC-SACT         PIC 9(18)V99    COMP.           042500      
001016         03  SDO-SUC-FECH         PIC 9(06)       COMP.           042600      
001017         03  FILLER               PIC X(61).                      042700      
001018     02  W-REG-GLOBALES REDEFINES W-HEADER-SDOS.                  042800      
001019         03  SDO-GLO-CVES         PIC 9(02)       COMP.           042900      
001020         03  SDO-GLO-SIST         PIC 9(04)       COMP.           043000      
001021         03  SDO-GLO-MON          PIC 9(02)       COMP.           043100      
001022         03  SDO-GLO-SANT         PIC 9(18)V99    COMP.           043200      
001023         03  SDO-GLO-SACT         PIC 9(18)V99    COMP.           043300      
001024         03  SDO-GLO-FECH         PIC 9(06)       COMP.           043400      
001025         03  FILLER               PIC X(63).                      043500      
001026     02  W-TRAILER-SDOS REDEFINES W-HEADER-SDOS.                  043600      
001027         03  SDO-TRA-CVES         PIC 9(02)       COMP.           043700      
001028         03  SDO-TRA-SIST         PIC 9(04)       COMP.           043800      
001029         03  FILLER               PIC X(02).                      043900      
001030         03  SDO-TRA-REG          PIC 9(06)       COMP.           044000      
001031         03  FILLER               PIC X(82).                      044100      
001032                                                                  044102      
001033* 01  W-REG-SDOS-SAL.                                             044103      
001034*    02  W-HEADER-SDOSSAL.                                        044104      
001035*        03  SD2-CTL-CVES         PIC 9(02).                      044106      
001036*        03  SD2-CTL-CSIO         PIC 9(04).                      044108      
001037*        03  FILLER               PIC X(01).                      044110      
001038*        03  SD2-CTL-SIST         PIC 9(04).                      044112      
001039*        03  SD2-CTL-FPRO         PIC 9(06).                      044114      
001040*        03  SD2-CTL-DCRE         PIC 9(06).                      044116      
001041*        03  SD2-CTL-HCRE         PIC 9(06).                      044118      
001042*        03  SD2-CTL-FORMATO      PIC 9(01).                      044120      
001043*        03  FILLER               PIC X(150).                     044122      
001044*    02  W-REG-CLIENTE-SAL REDEFINES W-HEADER-SDOSSAL.            044124      
001045*        03  SD2-CTE-CVES         PIC 9(02).                      044126      
001046*        03  SD2-CTE-SIST         PIC 9(04).                      044128      
001047*        03  SD2-CTE-SUC          PIC 9(04).                      044130      
001048*        03  SD2-CTE-MON          PIC 9(02).                      044132      
001049*        03  SD2-CTE-CTAS         PIC 9(20).                      044134      
001050*        03  SD2-CTE-INST         PIC 9(04).                      044136      
001051*        03  SD2-CTE-SEXP         PIC 9(04).                      044138      
001052*        03  SD2-CTE-NOMB         PIC X(30).                      044140      
001053*        03  SD2-CTE-SANT         PIC 9(18)V99.                   044142      
001054*        03  SD2-CTE-SACT         PIC 9(18)V99.                   044144      
001055*        03  SD2-CTE-FECH         PIC 9(06).                      044146      
001056*        03  FILLER               PIC X(64).                      044148      
001057*    02  W-REG-SUCURSAL-SAL REDEFINES W-HEADER-SDOSSAL.           044150      
001058*        03  SD2-SUC-CVES         PIC 9(02).                      044152      
001059*        03  SD2-SUC-SIST         PIC 9(04).                      044154      
001060*        03  SD2-SUC-SUCU         PIC 9(04).                      044156      
001061*        03  SD2-SUC-MON          PIC 9(02).                      044158      
001062*        03  SD2-SUC-SANT         PIC 9(18)V99.                   044160      
001063*        03  SD2-SUC-SACT         PIC 9(18)V99.                   044162      
001064*        03  SD2-SUC-FECH         PIC 9(06).                      044164      
001065*        03  FILLER               PIC X(122).                     044166      
001066*    02  W-REG-GLOBALES-SAL REDEFINES W-HEADER-SDOSSAL.           044168      
001067*        03  SD2-GLO-CVES         PIC 9(02).                      044170      
001068*        03  SD2-GLO-SIST         PIC 9(04).                      044172      
001069*        03  SD2-GLO-MON          PIC 9(02).                      044174      
001070*        03  SD2-GLO-SANT         PIC 9(18)V99.                   044176      
001071*        03  SD2-GLO-SACT         PIC 9(18)V99.                   044178      
001072*        03  SD2-GLO-FECH         PIC 9(06).                      044180      
001073*        03  FILLER               PIC X(126).                     044182      
001074*    02  W-TRAILER-SDOS-SAL REDEFINES W-HEADER-SDOSSAL.           044184      
001075*        03  SD2-TRA-CVES         PIC 9(02).                      044186      
001076*        03  SD2-TRA-SIST         PIC 9(04).                      044188      
001077*        03  FILLER               PIC X(02).                      044190      
001078*        03  SD2-TRA-REG          PIC 9(06).                      044192      
001079*        03  FILLER               PIC X(166).                     044194      
001080                                                                  044196      
001081******************************************************************044200      
001082*           REGISTRO DE TRANSFERENCIA DE ARCHIVOS               * 044300      
001083******************************************************************044400      
001084*                                                 FORMATO ANTERIOR044500      
001085 01  W-REG-SALDOS-ANT.                                            044600      
001086     02  W-HEADER-SDOS-ANT.                                       044700      
001087         03  ANT-CTL-CVES         PIC 9(02)       COMP.           044800      
001088         03  ANT-CTL-CSIO         PIC 9(04)       COMP.           044900      
001089         03  FILLER               PIC X(01).                      045000      
001090         03  ANT-CTL-SIST         PIC 9(04)       COMP.           045100      
001091         03  ANT-CTL-FPRO         PIC 9(06).                      045200      
001092         03  ANT-CTL-DCRE         PIC 9(06).                      045300      
001093         03  ANT-CTL-HCRE         PIC 9(06).                      045400      
001094         03  ANT-CTL-FORMATO      PIC 9(01).                      045500      
001095         03  FILLER               PIC X(65).                      045600      
001096     02  W-REG-CLIENTE-ANT REDEFINES W-HEADER-SDOS-ANT.           045700      
001097         03  ANT-CTE-CVES         PIC 9(02)       COMP.           045800      
001098         03  ANT-CTE-SIST         PIC 9(04)       COMP.           045900      
001099         03  ANT-CTE-SUC          PIC 9(04)       COMP.           046000      
001100         03  ANT-CTE-MON          PIC 9(02)       COMP.           046100      
001101         03  ANT-CTE-CTAS         PIC 9(20)       COMP.           046200      
001102         03  ANT-CTE-INST         PIC 9(04)       COMP.           046300      
001103         03  ANT-CTE-NOMB         PIC X(30).                      046400      
001104         03  ANT-CTE-SANT         PIC 9(18)V99    COMP.           046500      
001105         03  ANT-CTE-SACT         PIC 9(18)V99    COMP.           046600      
001106         03  ANT-CTE-FECH         PIC 9(06)       COMP.           046700      
001107         03  FILLER               PIC X(19).                      046800      
001108     02  W-REG-SUCURSAL-ANT REDEFINES W-HEADER-SDOS-ANT.          046900      
001109         03  ANT-SUC-CVES         PIC 9(02)       COMP.           047000      
001110         03  ANT-SUC-SIST         PIC 9(04)       COMP.           047100      
001111         03  ANT-SUC-SUCU         PIC 9(04)       COMP.           047200      
001112         03  ANT-SUC-MON          PIC 9(02)       COMP.           047300      
001113         03  ANT-SUC-SANT         PIC 9(18)V99    COMP.           047400      
001114         03  ANT-SUC-SACT         PIC 9(18)V99    COMP.           047500      
001115         03  ANT-SUC-FECH         PIC 9(06)       COMP.           047600      
001116         03  FILLER               PIC X(61).                      047700      
001117     02  W-REG-GLOBALES-ANT REDEFINES W-HEADER-SDOS-ANT.          047800      
001118         03  ANT-GLO-CVES         PIC 9(02)       COMP.           047900      
001119         03  ANT-GLO-SIST         PIC 9(04)       COMP.           048000      
001120         03  ANT-GLO-MON          PIC 9(02)       COMP.           048100      
001121         03  ANT-GLO-SANT         PIC 9(18)V99    COMP.           048200      
001122         03  ANT-GLO-SACT         PIC 9(18)V99    COMP.           048300      
001123         03  ANT-GLO-FECH         PIC 9(06)       COMP.           048400      
001124         03  FILLER               PIC X(63).                      048500      
001125     02  W-TRAILER-SDOS-ANT REDEFINES W-HEADER-SDOS-ANT.          048600      
001126         03  ANT-TRA-CVES         PIC 9(02)       COMP.           048700      
001127         03  ANT-TRA-SIST         PIC 9(04)       COMP.           048800      
001128         03  FILLER               PIC X(02).                      048900      
001129         03  ANT-TRA-REG          PIC 9(06)       COMP.           049000      
001130         03  FILLER               PIC X(82).                      049100      
001131                                                                  049101      
001132* 01  W-REG-SDOS-ANTSAL.                                          049102      
001133*    02  W-HEADER-SDOS-ANTSAL.                                    049104      
001134*        03  AN2-CTL-CVES         PIC 9(02).                      049106      
001135*        03  AN2-CTL-CSIO         PIC 9(04).                      049108      
001136*        03  FILLER               PIC X(01).                      049110      
001137*        03  AN2-CTL-SIST         PIC 9(04).                      049112      
001138*        03  AN2-CTL-FPRO         PIC 9(06).                      049114      
001139*        03  AN2-CTL-DCRE         PIC 9(06).                      049116      
001140*        03  AN2-CTL-HCRE         PIC 9(06).                      049118      
001141*        03  AN2-CTL-FORMATO      PIC 9(01).                      049120      
001142*        03  FILLER               PIC X(150).                     049122      
001143*    02  W-REG-CLIENTE-ANTSAL REDEFINES W-HEADER-SDOS-ANTSAL.     049124      
001144*        03  AN2-CTE-CVES         PIC 9(02).                      049126      
001145*        03  AN2-CTE-SIST         PIC 9(04).                      049128      
001146*        03  AN2-CTE-SUC          PIC 9(04).                      049130      
001147*        03  AN2-CTE-MON          PIC 9(02).                      049132      
001148*        03  AN2-CTE-CTAS         PIC 9(20).                      049134      
001149*        03  AN2-CTE-INST         PIC 9(04).                      049136      
001150*        03  AN2-CTE-NOMB         PIC X(30).                      049138      
001151*        03  AN2-CTE-SANT         PIC 9(18)V99.                   049140      
001152*        03  AN2-CTE-SACT         PIC 9(18)V99.                   049142      
001153*        03  AN2-CTE-FECH         PIC 9(06).                      049144      
001154*        03  FILLER               PIC X(68).                      049146      
001155*    02  W-REG-SUCURSAL-ANTSAL REDEFINES W-HEADER-SDOS-ANTSAL.    049148      
001156*        03  AN2-SUC-CVES         PIC 9(02).                      049150      
001157*        03  AN2-SUC-SIST         PIC 9(04).                      049152      
001158*        03  AN2-SUC-SUCU         PIC 9(04).                      049154      
001159*        03  AN2-SUC-MON          PIC 9(02).                      049156      
001160*        03  AN2-SUC-SANT         PIC 9(18)V99.                   049158      
001161*        03  AN2-SUC-SACT         PIC 9(18)V99.                   049160      
001162*        03  AN2-SUC-FECH         PIC 9(06).                      049162      
001163*        03  FILLER               PIC X(122).                     049164      
001164*    02  W-REG-GLOBALES-ANTSAL REDEFINES W-HEADER-SDOS-ANTSAL.    049166      
001165*        03  AN2-GLO-CVES         PIC 9(02).                      049168      
001166*        03  AN2-GLO-SIST         PIC 9(04).                      049170      
001167*        03  AN2-GLO-MON          PIC 9(02).                      049172      
001168*        03  AN2-GLO-SANT         PIC 9(18)V99.                   049174      
001169*        03  AN2-GLO-SACT         PIC 9(18)V99.                   049176      
001170*        03  AN2-GLO-FECH         PIC 9(06).                      049178      
001171*        03  FILLER               PIC X(126).                     049180      
001172*    02  W-TRAILER-SDOS-ANTSAL REDEFINES W-HEADER-SDOS-ANTSAL.    049182      
001173*        03  AN2-TRA-CVES         PIC 9(02).                      049184      
001174*        03  AN2-TRA-SIST         PIC 9(04).                      049186      
001175*        03  FILLER               PIC X(02).                      049188      
001176*        03  AN2-TRA-REG          PIC 9(06).                      049190      
001177*        03  FILLER               PIC X(166).                     049192      
001178******************************************************************049200      
001179*                REGISTRO DEL ARCHIVO A TESORERIA                *049300      
001180******************************************************************049400      
001181 01  W-REG-GLOBALES-TESORERIA.                                    049500      
001182     03  TES-GLO-CSI              PIC 9(02).                      049600      
001183     03  TES-GLO-SIST             PIC 9(04).                      049700      
001184     03  TES-GLO-MON              PIC 9(02).                      049800      
001185     03  TES-GLO-SANT             PIC 9(18)V99.                   049900      
001186     03  TES-GLO-SACT             PIC 9(18)V99.                   050000      
001187*    03  TES-GLO-FECHA            PIC 9(06).                      050100      
001188*INICIA CODIGO DE RENOVACION CRONOS 2000                          050101      
001189     03  TES-GLO-FECHA            PIC 9(08).                      050102      
001190*TERMINA CODIGO DE RENOVACION CRONOS 2000                         050103      
001191                                                                  050200      
001192******************************************************************050300      
001193*                 DESCRIPCION DE REPORTE                         *050400      
001194******************************************************************050500      
001195*                                                                 050600      
001196 01  COMUN-TITULO-1.                                              050700      
001197     02 FILLER       PIC X(5)  VALUE SPACES.                      050800      
001198     02 TIRE-COM1    PIC X.                                       050900      
001199     02 FILLER       PIC X(6)  VALUE "/S151-".                    051000      
001200     02 SUBS-COM1    PIC 9(3).                                    051100      
001201     02 FILLER       PIC X     VALUE "/".                         051200      
001202     02 PASO-COM1    PIC 9(3).                                    051300      
001203     02 FILLER       PIC X     VALUE "-".                         051400      
001204     02 NURE-COM1    PIC 9(3).                                    051500      
001205     02 FILLER       PIC X(23) VALUE SPACES.                      051600      
001206     02 BNCO-COM1    PIC X(40) VALUE "            B A N A M E X". 051700      
001207     02 FILLER       PIC X(23) VALUE SPACES.                      051800      
001208     02 FILLER       PIC X(10) VALUE "FECHA   : ".                051900      
001209*    02 FECH-COM1    PIC 99/99/99.                                052000      
001210*INICIA CODIGO DE RENOVACION CRONOS 2000                          052001      
001211     02 FECH-COM1    PIC 9999/99/99.                              052002      
001212*TERMINA CODIGO DE RENOVACION CRONOS 2000                         052003      
001213*    02 FILLER       PIC X(5) VALUE SPACES.                       052100      
001214*INICIA CODIGO DE RENOVACION CRONOS 2000                          052101      
001215     02 FILLER       PIC X(3) VALUE SPACES.                       052102      
001216*TERMINA CODIGO DE RENOVACION CRONOS 2000                         052103      
001217 01  COMUN-TITULO-2.                                              052200      
001218     02 FILLER       PIC X(5)  VALUE SPACES.                      052300      
001219     02 FILLER       PIC X(7)  VALUE "PASO : ".                   052400      
001220     02 PASO-COM2    PIC X(15).                                   052500      
001221     02 FILLER       PIC X(17) VALUE SPACES.                      052600      
001222     02 FILLER       PIC X(42) VALUE                              052700      
001223        "          ADMINISTRADOR DE SALDOS         ".             052800      
001224     02 FILLER       PIC X(23) VALUE SPACES.                      052900      
001225     02 FILLER       PIC X(10) VALUE "PROCESO : ".                053000      
001226     02 TIPO-COM2    PIC X(8).                                    053100      
001227     02 FILLER       PIC X(5)  VALUE SPACES.                      053200      
001228 01  COMUN-TITULO-3.                                              053300      
001229     02 FILLER       PIC X(25)  VALUE SPACES.                     053400      
001230*    02 FILLER       PIC X(10) VALUE "VERSION : ".                053500      
001231*    02 VERS-AA      PIC 99.                                      053600      
001232*INICIA CODIGO DE RENOVACION CRONOS 2000                          053601      
001233*    02 VERS-AA      PIC 9(04).                                   053602      
001234*TERMINA CODIGO DE RENOVACION CRONOS 2000                         053603      
001235*    02 FILLER       PIC X VALUE "/".                             053700      
001236*    02 VERS-MM      PIC 99.                                      053800      
001237*    02 FILLER       PIC X VALUE "/".                             053900      
001238*    02 VERS-DD      PIC 99.                                      054000      
001239*    02 FILLER       PIC X(10) VALUE SPACES.                      054100      
001240*INICIA CODIGO DE RENOVACION CRONOS 2000                          054101      
001241     02 FILLER       PIC X(08) VALUE SPACES.                      054102      
001242*TERMINA CODIGO DE RENOVACION CRONOS 2000                         054103      
001243     02 TITU-COM3    PIC X(65).                                   054200      
001244     02 FILLER       PIC X(11) VALUE SPACES.                      054300      
001245     02 FILLER       PIC X(13) VALUE "HOJA    :    ".             054400      
001246     02 HOJA-COM3    PIC Z,ZZ9.                                   054500      
001247     02 FILLER       PIC X(5)  VALUE SPACES.                      054600      
001248 01  COMUN-TITULO-41.                                             054700      
001249     02 FILLER       PIC X(5)  VALUE SPACES.                      054800      
001250     02 SGR-COM41    PIC X(5)B VALUE SPACES.                      054900      
001251     02 NUSU-COM41   PIC 9(4).                                    055000      
001252     02 FILLER       PIC X     VALUE SPACES.                      055100      
001253     02 NOSU-COM41   PIC X(40).                                   055200      
001254     02 FILLER       PIC X(86) VALUE SPACES.                      055300      
001255 01  COMUN-TITULO-4.                                              055400      
001256     02 FILLER       PIC X(5)  VALUE SPACES.                      055500      
001257*    02 SGR-COM4     PIC X(5)  VALUE "CSI. ".                     055600      
001258*    02 NUSU-COM4    PIC Z9999.                                   055700      
001259*    02 FILLER       PIC X     VALUE SPACES.                      055800      
001260     02 NOSU-COM4    PIC X(40).                                   055900      
001261     02 FILLER       PIC X(76) VALUE SPACES.                      056000      
001262 01  NOMBRE-RPTE1        PIC X(49) VALUE                          056100      
001263     "              C O N T R O L  D E  A R C H I V O S".         056200      
001264 01  CONT-ARCH-TITULO-1.                                          056300      
001265     02 FILLER       PIC X(45) VALUE SPACES.                      056400      
001266     02 FILLER       PIC X(24) VALUE "FECHA           FECHA DE".  056500      
001267     02 FILLER       PIC X(12) VALUE SPACES.                      056600      
001268     02 FILLER       PIC X(17) VALUE "R E G I S T R O S".         056700      
001269 01  CONT-ARCH-TITULO-2.                                          056800      
001270     02 FILLER       PIC X(47) VALUE SPACES.                      056900      
001271     02 FILLER       PIC X(22) VALUE "DE            CREACION".    057000      
001272     02 FILLER       PIC X(38) VALUE SPACES.                      057100      
001273 01  CONT-ARCH-TITULO-3.                                          057200      
001274     02 FILLER PIC X(28) VALUE "      A R C H I V O S       ".    057300      
001275     02 FILLER PIC X(16) VALUE SPACES.                            057400      
001276     02 FILLER PIC X(36) VALUE "PROCESO       DIA         HORA".  057500      
001277     02 FILLER PIC X(23) VALUE "LEIDOS   GRABADOS".               057600      
001278     02 FILLER PIC X(27) VALUE "   L E Y E N D A".                057700      
001279 01  CONT-ARCH-DETALLE.                                           057800      
001280     02  FILLER           PIC X(05) VALUE SPACES.                 057900      
001281     02  NOMB-DET         PIC X(35).                              058000      
001282     02  FILLER           PIC X(04) VALUE SPACES.                 058100      
001283*    02  FPRO-DET         PIC 99/99/99B(04).                      058200      
001284*INICIA CODIGO DE RENOVACION CRONOS 2000                          058201      
001285     02  FPRO-DET         PIC 9999/99/99.                         058202      
001286*TERMINA CODIGO DE RENOVACION CRONOS 2000                         058203      
001287     02  FILLER           PIC X(02) VALUE SPACES.                 058253      
001288*    02  DCRE-DET         PIC 99/99/99B(04).                      058300      
001289*INICIA CODIGO DE RENOVACION CRONOS 2000                          058301      
001290     02  DCRE-DET         PIC 9999/99/99.                         058302      
001291*TERMINA CODIGO DE RENOVACION CRONOS 2000                         058303      
001292     02  FILLER           PIC X(02) VALUE SPACES.                 058353      
001293     02  HCRE-AA          PIC 99.                                 058400      
001294     02  FILLER           PIC X VALUE ":".                        058410      
001295     02  HCRE-MM          PIC 99.                                 058420      
001296     02  FILLER           PIC X VALUE ":".                        058430      
001297     02  HCRE-DD          PIC 99.                                 058440      
001298     02  FILLER           PIC X(04) VALUE SPACES.                 058450      
001299     02  RLEI-DET         PIC 9(06).                              058500      
001300     02  FILLER           PIC X(04) VALUE SPACES.                 058550      
001301     02  RGRA-DET         PIC 9(06).                              058600      
001302     02  FILLER           PIC X(04) VALUE SPACES.                 058650      
001303     02  RLEY-DET         PIC X(30).                              058700      
001304                                                                  058800      
001305*SAMG                                                             058810      
001306*========================================================         058820      
001307* VARIABLES PARA ENVIO POR INTELAR                                058830      
001308*========================================================         058840      
001309 01 WKS-INTE-ARCHIVO              PIC X(120).                     058850      
001310 77 W77-INTE-SNT                  PIC S9(11) BINARY.              058860      
001311 01 WKS-ERR-INTELAR.                                              058870      
001312    03 WKS-ERRNUM-INTELAR         PIC 9(04).                      058872      
001313    03 WKS-ERRALFA-INTELAR REDEFINES WKS-ERRNUM-INTELAR PIC X(04).058874      
001314 77 W77-CLOSE                     PIC 9(01) VALUE ZEROES.         058880      
001315                                                                  058900      
001316*                                                                 059000      
001317******************************************************************059100      
001318*               DESCRIPCION DE CLAVES DEL ARCHIVO                *059200      
001319******************************************************************059300      
001320*                                                                *059400      
001321*                                                                *059500      
001322*                                                                *059600      
001323*         CVES = 01  HEADER                                      *059700      
001324*                10  SDOS POR CLIENTES                           *059800      
001325*                20  SDOS POR SUCURSAL                           *059900      
001326*                30  SDOS GLOBALES                               *060000      
001327*                90  TRAILER                                     *060100      
001328*                                                                *060200      
001329*                                                                *060300      
001330******************************************************************060400      
001331*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001332*  COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".          060500      
001333**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
001334  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
001335  01 MENSAJE-LJ.                                                  100300      
001336     02 SISTEMA-LJ     PIC X(04).                                 100400      
001337     02 FILLER         PIC X VALUE "/".                           100500      
001338     02 PASO-LJ        PIC X(04).                                 100600      
001339     02 FILLER         PIC X VALUE "/".                           100700      
001340     02 MTP-LJ         PIC 9(03).                                 100800      
001341     02 FILLER         PIC X VALUE ":".                           100900      
001342     02 TIPO-LJ        PIC X.                                     101000      
001343     02 FILLER         PIC X VALUE ">".                           101100      
001344     02 CODIGO-LJ      PIC 9(06).                                 101200      
001345     02 FILLER         PIC X VALUE "<".                           101300      
001346     02 TEXTO-LJ       PIC X(250).                                101400      
001347*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001348                                                                  060600      
001349/                                                                 060700      
001350 PROCEDURE        DIVISION.                                       060800      
001351 000-RAIZ.                                                        060900      
001352*---------                                                        061000      
001353     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   061100      
001354      "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".            061200      
001355                                                                  061220      
001356     CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION.     061240      
001357     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP".       061260      
001358                                                                  061280      
001359     CHANGE ATTRIBUTE LIBACCESS         OF "ADMONXFERS"           061285      
001360                                        TO BYFUNCTION.            061287      
001361     CHANGE ATTRIBUTE FUNCTIONNAME      OF "ADMONXFERS"           061290      
001362                                        TO "ADMONXFERS".          061295      
001363     MOVE "S151"  TO      SISTEMA-LJ                              061300      
001364     MOVE "P005"  TO      PASO-LJ                                 061400      
001365                          WKS-PASO-BACK2                          061420      
001366                          WLI-RB-E1-PASO                          061440      
001367     MOVE "002"   TO      MTP-LJ                                  061500      
001368     MOVE "I"     TO      TIPO-LJ                                 061600      
001369     MOVE 020101  TO      CODIGO-LJ                               061700      
001370     MOVE "INICIO DE PROCESO . "                                  061800      
001371                  TO      TEXTO-LJ                                061900      
001372**   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         062000      
001373                                                                  062100      
001374     PERFORM 1000-ABRE THRU 1000-EXIT.                            062200      
001375     IF  (77-DIA-SEM = 6 OR 7) AND NOT WS-DIAPBAS-NVOPSO          062300      
001376         NEXT SENTENCE                                            062400      
001377     ELSE                                                         062500      
001378         PERFORM 2000-PROCESO UNTIL 77-EOF = 1.                   062600      
001379                                                                  062700      
001380     PERFORM 3000-CIERRA.                                         062800      
001381     IF  (77-DIA-SEM = 6 OR 7) AND NOT WS-DIAPBAS-NVOPSO          062900      
001382         NEXT SENTENCE                                            063000      
001383     ELSE                                                         063100      
001384         PERFORM 4000-REPORTE.                                    063200      
001385     CLOSE  V00-REPORTE2.                                         063251      
001386*    CHANGE ATTRIBUTE LIBACCESS OF "CTRLVERS" TO BYFUNCTION.      063253      
001387*    CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".    063255      
001388*    PERFORM 200-OBTEN-TIT940.                                    063257      
001389*    PERFORM 205-ENVIA-ARCHIVO.                                   063259      
001390                                                                  063271      
001391     STOP RUN.                                                    063300      
001392                                                                  063302      
001393 200-OBTEN-TIT940.                                                063305      
001394*-----------------                                                063310      
001395     MOVE "S006P940"         TO WKS-CTLVERS-LIBRERIA.             063315      
001396     CALL "DAME_TIT IN CTRLVERS"                                  063320      
001397          USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO          063325      
001398          GIVING WKS-CTLVERS-STATUS.                              063330      
001399                                                                  063335      
001400     IF WKS-CTLVERS-STATUS < 0                                    063340      
001401        MOVE SPACES       TO      WLI-ENCAB-52                    063345      
001402        MOVE "O"    TO WLI-TIPO-LJ                                063350      
001403        MOVE 020901 TO CODIGO-LJ                                  063355      
001404        STRING "ERROR EN CTLVERS, NO ENCUENTRO S006P940 "         063360      
001405                DELIMITED BY SIZE INTO WLI-TEXTO-LJ               063365      
001406        PERFORM  000-030-IMPRIME-MENSAJE                          063370      
001407        MOVE "(S006)S006/OBJECT/P940/CTRLFTP/25MTP001 ON XFER"    063375      
001408              TO WKS-START-PROG                                   063380      
001409     ELSE                                                         063385      
001410        STRING WKS-CTLVERS-TITULO DELIMITED BY SIZE               063390      
001411              INTO WKS-START-PROG.                                063395      
001412                                                                  063400      
001413*205-ENVIA-ARCHIVO.                                               063405      
001414*-------------------                                              063410      
001415*    MOVE "S151TES2/"     TO      WKS-START-CSI                   063415      
001416*    MOVE 01              TO      WKS-START-ARC                   063420      
001417*    CALL SYSTEM WFL USING WKS-TIT-WFL.                           063425      
001418*                                                                 063430      
001419*    MOVE "S151TES3/"     TO      WKS-START-CSI                   063435      
001420*    MOVE 01              TO      WKS-START-ARC                   063440      
001421*    CALL SYSTEM WFL USING WKS-TIT-WFL.                           063445      
001422*                                                                 063450      
001423                                                                  063500      
001424 1000-FORMATO-DISPLAY.                                            063551      
001425*---------------------                                            063561      
001426                                                                  063571      
001427*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001428* COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY.".                   063581      
001429                                                                  000100      
001430*===============================================================* 000200      
001431*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
001432*         PARA LLAMADO DE DISPLAY                               * 000400      
001433*===============================================================* 000500      
001434                                                                  000600      
001435     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
001436            TO BYFUNCTION.                                        000671      
001437                                                                  000691      
001438     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
001439          USING WKS-DATE-ARRAY2.                                  000800      
001440     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
001441     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
001442     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
001443     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
001444     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
001445     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
001446                                                                  001300      
001447     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
001448     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
001449     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
001450                               WKS-TIT-REPORTE2.                  001700      
001451*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
001452*                                  GIVING WKS-COMPILA2.           001900      
001453*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
001454*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
001455*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
001456*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
001457                                                                  002066      
001458*    IF WKS-AAA-VERSION2  < 50                                    002071      
001459*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
001460*    ELSE                                                         002081      
001461*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
001462                                                                  002091      
001463                                                                  002500      
001464*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
001465     OPEN OUTPUT V00-REPORTE2.                                    002700      
001466     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
001467     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
001468                                                                  003000      
001469 000-050-CHECA-SALTO-HOJA2.                                       003051      
001470*==========================                                       003071      
001471    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
001472     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
001473        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
001474     ELSE                                                         003079      
001475        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
001476     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
001477     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
001478     MOVE "/"                     TO WKS-SLASH1.                  003086      
001479     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
001480     MOVE "/"                     TO WKS-SLASH2.                  003088      
001481     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
001482     IF  WKS-NUM-LINEAS2 > 56                                     003091      
001483         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
001484         ADD 1                   TO    W77-CONT-HOJA2             003200      
001485         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
001486         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
001487         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
001488         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
001489         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
001490         MOVE SPACES             TO V00-R00-REPORTE2              003800      
001491         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
001492         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
001493                                                                  004100      
001494 000-030-IMPRIME-MENSAJE.                                         004200      
001495*========================                                         004300      
001496*LP                                                               004400      
001497     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
001498     ADD             2       TO WKS-NUM-LINEAS2                   004600      
001499     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
001500                                                                  004800      
001501*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001502                                                                  063600      
001503/                                                                 063700      
001504 1000-ABRE.                                                       063800      
001505*----------                                                       063900      
001506                                                                  063980      
001507     OPEN UPDATE S151BD02ADSALDO                                  064000      
001508          ON EXCEPTION                                            064100      
001509             MOVE "E"         TO  TIPO-LJ                         064200      
001510             MOVE 010105      TO  CODIGO-LJ                       064300      
001511             MOVE "ERROR AL ACCESAR LA BASE " TO TEXTO-LJ         064400      
001512             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  064500      
001513                    SET MYSELF(STATUS) TO -1.                     064600      
001514                                                                  064700      
001515     FIND S151BD02ADSALDO                                         064800      
001516          ON EXCEPTION                                            064900      
001517           IF  DMSTATUS(NOTFOUND)                                 065000      
001518               MOVE "E"         TO  TIPO-LJ                       065100      
001519               MOVE 010105      TO  CODIGO-LJ                     065200      
001520               MOVE "NO EXISTE REG. DE FECHAS " TO TEXTO-LJ       065300      
001521               CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ065400      
001522               SET MYSELF(STATUS) TO -1.                          065500      
001523                                                                  065600      
001524                                                                  065700      
001525     MOVE B92-CTR-CSI             TO 77-CSI, WKS-CENTRO-IMP,      065800      
001526                                     WKS-TR-CSI2, WKS-INT-CSI.    065851      
001527     MOVE B92-CTR-FECHA           TO WS-FECHA1, B92-CTR-FECHA-CAR 065900      
001528                                     WLI-RB-E1-FECHA-INF2.        065951      
001529                                                                  065956      
001530     MOVE "151"                   TO WKS-SIS-BACK2                065958      
001531                                     WLI-RB-E3-SISTEMA2.          065960      
001532                                                                  065962      
001533     MOVE "DIARIO"                TO WLI-RB-E2-TIPO-PROC2.        065971      
001534                                                                  065976      
001535     PERFORM      1000-FORMATO-DISPLAY.                           065986      
001536                                                                  065996      
001537     PERFORM 1010-CARGA-LOCSUP THRU 1010-EXIT.                    066000      
001538     IF (77-DIA-SEM = 6 OR 7) AND NOT WS-DIAPBAS-NVOPSO           066100      
001539         GO TO 1000-EXIT                                          066200      
001540     ELSE                                                         066300      
001541        PERFORM 1000-LEE-ADSALDO.                                 066400      
001542                                                                  066500      
001543      SET REPORTE(USERBACKUPNAME) TO VALUE TRUE.                  066600      
001544      MOVE 001                    TO WKS-NUM-BACKUP               066700      
001545      MOVE "CONTROL"              TO WKS-NOM-BACKUP               066800      
001546      MOVE ATTRIBUTE STACKNO OF MYSELF TO WKS-MIX-NUM             066900      
001547      OPEN OUTPUT REPORTE.                                        067000      
001548                                                                  067100      
001549 1000-LEE-ADSALDO.                                                067200      
001550                                                                  067300      
001551                                                                  067400      
001552*    CALL "COMPILETIME-15         IN      COBOL74"                067500      
001553*                                 GIVING  COMPILA                 067600      
001554*    MOVE COMPILA                 TO      WS-VERSION              067700      
001555*INICIA CODIGO DE RENOVACION CRONOS 2000                          067701      
001556$SET OMIT = OLDCODE                                               067702      
001557*    MOVE COMPILA                 TO      WS-VERSION              067703      
001558$POP OMIT                                                         067704      
001559$SET OMIT = NOT OLDCODE                                           067705      
001560*    MOVE ZEROS TO A2K-FEC-MDA-001                                067706      
001561*    MOVE COMPILA TO A2K-FEC-MDA-001                              067707      
001562*    PERFORM A2K-CONV-MDA-TO-MDCA THRU                            067708      
001563*            A2K-CONV-MDA-TO-MDCA-EXIT                            067709      
001564*    MOVE A2K-FEC-MDCA-001 TO WS-VERSION                          067710      
001565$POP OMIT                                                         067711      
001566*TERMINA CODIGO DE RENOVACION CRONOS 2000                         067712      
001567*    MOVE WS-DIA-VERSION          TO      VERS-DD                 067800      
001568*    MOVE WS-MES-VERSION          TO      VERS-MM                 067900      
001569*    MOVE WS-AAA-VERSION          TO      VERS-AA.                068000      
001570                                                                  068100      
001571*    DISPLAY "FECHA DE ARRIBO DE ARCHIVOS : " B92-CTR-FECHA-FIL.  068200      
001572                                                                  068300      
001573*    MOVE FECHA-BASE2             TO B92-CTR-FECHA-CAR.           068400      
001574*    DISPLAY "FECHA DE PROCESO            : " B92-CTR-FECHA-CAR.  068500      
001575     PERFORM 1050-INICIALIZA-CSI                                  068600      
001576             VARYING I FROM 1 BY 1 UNTIL I > 10.                  068700      
001577                                                                  068800      
001578                                                                  068900      
001579     PERFORM 1100-CARGA-TABLA                                     069000      
001580             VARYING I FROM 1 BY 1 UNTIL I > 20.                  069100      
001581     PERFORM 1200-LIMPIA-TAB                                      069200      
001582             VARYING J FROM 1 BY 1 UNTIL J > 20.                  069300      
001583     PERFORM 1300-TABLA-ARRIBO                                    069400      
001584             VARYING K FROM 1 BY 1 UNTIL K > 20.                  069500      
001585                                                                  069600      
001586     MOVE ZEROES                  TO I                            069700      
001587                                     J                            069800      
001588                                     K.                           069900      
001589 1000-EXIT.                                                       070000      
001590     EXIT.                                                        070100      
001591*                                                                 070200      
001592                                                                  070300      
001593 1010-CARGA-LOCSUP.                                               070400      
001594*------------------                                               070500      
001595     MOVE ZEROES                  TO 77-DIA-SEM 77-DIAS-PTE.      070600      
001596     MOVE 15                      TO WS-FUNCION.                  070700      
001597*    MOVE 3                       TO WS-FORMATO                   070800      
001598*INICIA CODIGO DE RENOVACION CRONOS 2000                          070801      
001599     MOVE 13                      TO WS-FORMATO                   070802      
001600*TERMINA CODIGO DE RENOVACION CRONOS 2000                         070803      
001601     MOVE "00000001"              TO WS-FECHA2.                   070900      
001602     PERFORM 1020-LOCSUP.                                         071000      
001603*    MOVE WS-FECHA1-NUM           TO 77-FEC-PROCESO, FECHA-BASE,  071100      
001604*                                    WKS-FECHA-BACKUP.            071200      
001605*INICIA CODIGO DE RENOVACION CRONOS 2000                          071201      
001606$SET OMIT = OLDCODE                                               071202      
001607     MOVE WS-FECHA1-NUM           TO 77-FEC-PROCESO, FECHA-BASE,  071203      
001608                                  WKS-START-FEC, WKS-FECHA-BACKUP.071204      
001609$POP OMIT                                                         071205      
001610$SET OMIT = NOT OLDCODE                                           071206      
001611     MOVE ZEROS TO A2K-FEC-CAMD-001                               071207      
001612     MOVE WS-FECHA1-NUM  TO  A2K-FEC-CAMD-001,77-FEC-PROCESO,     071208      
001613                             WKS-START-FEC, FECHA-BASE.           071209      
001614     PERFORM A2K-CONV-CAMD-TO-AMD THRU                            071210      
001615             A2K-CONV-CAMD-TO-AMD-EXIT                            071211      
001616     MOVE A2K-FEC-AMD-001  TO  WKS-FECHA-BACKUP.                  071212      
001617$POP OMIT                                                         071213      
001618*TERMINA CODIGO DE RENOVACION CRONOS 2000                         071214      
001619*    ACCEPT FECHA-MAQUINA FROM TODAYS-DATE.                       071300      
001620     MOVE 77-FEC-PROCESO  TO   FECHA-MAQUINA.                     071400      
001621     MOVE CORRESPONDING FECHA-AMERICANA                           071500      
001622                                  TO DIA-CREACION.                071600      
001623*    MOVE 240292                  TO DIA-CREACION.                071700      
001624*    DISPLAY "***** FECHA HOY : " DIA-CREACION.                   071800      
001625     MOVE DIA-CREACION            TO FECHA-HOY                    071900      
001626                                     WS-FECHA-NVOPSO.             072000      
001627     MOVE DIA-HOY                 TO WS-DIA1-RED.                 072100      
001628     MOVE MES-HOY                 TO WS-MES1-RED.                 072200      
001629     MOVE ANO-HOY                 TO WS-ANO1-RED.                 072300      
001630*    MOVE 2                       TO WS-FORMATO.                  072400      
001631*INICIA CODIGO DE RENOVACION CRONOS 2000                          072401      
001632     MOVE 12                      TO WS-FORMATO.                  072402      
001633*TERMINA CODIGO DE RENOVACION CRONOS 2000                         072403      
001634     MOVE 6                       TO WS-FUNCION.                  072500      
001635     IF WS-DIAPBAS-NVOPSO                                         072600      
001636        MOVE 1000                 TO WS-FACTOR-NVOPSO             072700      
001637     ELSE                                                         072800      
001638        MOVE    1                 TO WS-FACTOR-NVOPSO.            072900      
001639*    DISPLAY "***FECHA NVOPSO: " WS-FECHA-NVOPSO                  073000      
001640*    DISPLAY "***FACTOR: " WS-FACTOR-NVOPSO                       073100      
001641     PERFORM 1020-LOCSUP.                                         073200      
001642     MOVE WS-FECHA1-NUM           TO 77-DIA-SEM.                  073300      
001643     IF  77-DIA-SEM = 0                                           073400      
001644         MOVE 7                   TO 77-DIA-SEM.                  073500      
001645     IF (77-DIA-SEM = 6 OR 7) AND NOT WS-DIAPBAS-NVOPSO           073600      
001646*        DISPLAY "*** HOY NO TRABAJO ***" 77-DIA-SEM              073700      
001647         GO                       TO 1010-EXIT.                   073800      
001648     MOVE DIA-HOY                 TO DD-BASE2     WS-DIA1-RED.    073900      
001649     MOVE MES-HOY                 TO MM-BASE2     WS-MES1-RED.    074000      
001650     MOVE ANO-HOY                 TO AA-BASE2     WS-ANO1-RED.    074100      
001651     MOVE "00000001"              TO WS-FECHA2.                   074200      
001652*    MOVE 3                       TO WS-FORMATO.                  074300      
001653*INICIA CODIGO DE RENOVACION CRONOS 2000                          074301      
001654     MOVE 13                      TO WS-FORMATO.                  074302      
001655*TERMINA CODIGO DE RENOVACION CRONOS 2000                         074303      
001656     MOVE 13                      TO WS-FUNCION.                  074400      
001657     PERFORM 1020-LOCSUP.                                         074500      
001658     MOVE WS-FECHA2               TO 77-DIAS-PTE.                 074600      
001659     MOVE WS-FECHA1-NUM           TO 77-FEC-PROXPRO.              074700      
001660     MOVE WS-DIA1-RED             TO DIA-PROX.                    074800      
001661     MOVE WS-MES1-RED             TO MES-PROX.                    074900      
001662     MOVE WS-ANO1-RED             TO ANO-PROX.                    075000      
001663*    DISPLAY "PROXIMA CORRIDA : " PROXIMO-PROCESO.                075100      
001664                                                                  075200      
001665 1010-EXIT.                                                       075300      
001666     EXIT.                                                        075400      
001667                                                                  075500      
001668 1020-LOCSUP.                                                     075600      
001669     CALL "THECALENDAR IN LOCSUP"                                 075700      
001670          USING WS-FUNCION, WS-FECHA1, WS-FECHA2, WS-FORMATO.     075800      
001671*                                                                 075900      
001672 1050-INICIALIZA-CSI.                                             076000      
001673*--------------------                                             076100      
001674                                                                  076200      
001675     MOVE ZEROES                  TO B92-CTR-CSIOK (I).           076300      
001676                                                                  076400      
001677*                                                                 076500      
001678 1100-CARGA-TABLA.                                                076600      
001679*-----------------                                                076700      
001680                                                                  076800      
001681     MOVE B92-CTR-SISTEMA (I)     TO TAB-SIST (I).                076900      
001682                                                                  077000      
001683*                                                                 077100      
001684 1200-LIMPIA-TAB.                                                 077200      
001685*----------------                                                 077300      
001686                                                                  077400      
001687     MOVE ZEROES                  TO FPRO-TAB (J)                 077500      
001688                                     DCRE-TAB (J)                 077600      
001689                                     HCRE-TAB (J)                 077700      
001690                                     RLEI-TAB (J)                 077800      
001691                                     RGRA-TAB (J).                077900      
001692     MOVE SPACES                  TO NOMB-TAB (J)                 078000      
001693                                     RLEY-TAB (J).                078100      
001694                                                                  078200      
001695*                                                                 078300      
001696 1300-TABLA-ARRIBO.                                               078400      
001697*------------------                                               078500      
001698                                                                  078600      
001699     MOVE B92-CTR-ARRIBO (K)      TO TAB-ARRIBO (K).              078700      
001700                                                                  078800      
001701/                                                                 078900      
001702*                                                                 079000      
001703 2000-PROCESO.                                                    079100      
001704*-------------                                                    079200      
001705                                                                  079300      
001706     PERFORM 2100-CHECA-ETIQUETAS                                 079400      
001707             VARYING I FROM 1 BY 1 UNTIL I > 20.                  079500      
001708                                                                  079600      
001709     MOVE 1                       TO 77-EOF.                      079700      
001710                                                                  079800      
001711 2100-CHECA-ETIQUETAS.                                            080000      
001712*---------------------                                            080100      
001713                                                                  080200      
001714     IF  TAB-SIST(I) > 0                                          080300      
001715         PERFORM 2200-ARMA-ETIQUETAS THRU 2200-EXIT               080400      
001716         IF  77-LEI-AUXKEY = 1                                    080500      
001717             MOVE ZEROES          TO 77-LEI-AUXKEY                080600      
001718                                     77-FORMATO.                  080700      
001719*        ELSE                                                     080800      
001720*            IF  77-FORMATO = 3                                   080900      
001721*                PERFORM 6000-BARRE-SALDOS-NVO                    081000      
001722*                                            UNTIL 77-EOF-SDOS = 1081100      
001723*                MOVE ZEROES      TO 77-EOF-SDOS                  081200      
001724*                                    77-FORMATO                   081300      
001725*                CLOSE SALDOS WITH SAVE                           081400      
001726*ASM                                                              081420      
001727*                 CLOSE SDOS-SAL WITH SAVE                        081440      
001728*SAMG                                                             081460      
001729*                 PERFORM 300-DATOS-ENVI-INTELAR                  081480      
001730*            ELSE                                                 081500      
001731*            IF  77-FORMATO = 2                                   081600      
001732*                PERFORM 2300-BARRE-SALDOS UNTIL 77-EOF-SDOS = 1  081700      
001733*                MOVE ZEROES      TO 77-EOF-SDOS                  081800      
001734*                                    77-FORMATO                   081900      
001735*                CLOSE SALDOS WITH SAVE                           082000      
001736*ASM                                                              082020      
001737*                 CLOSE SDOS-SAL WITH SAVE                        082040      
001738*SAMG                                                             082060      
001739*                 PERFORM 300-DATOS-ENVI-INTELAR                  082080      
001740*            ELSE                                                 082100      
001741*                OPEN OUTPUT TESORERIA                            082200      
001742*                PERFORM 5000-BARRE-SALDOS-ANT                    082300      
001743*                                            UNTIL 77-EOF-SDOS = 1082400      
001744*                MOVE ZEROES      TO 77-EOF-SDOS                  082500      
001745*                                    77-FORMATO                   082600      
001746*                CLOSE TESORERIA WITH SAVE                        082700      
001747*                CLOSE SALDOS    WITH SAVE                        082800      
001748*ASM                                                              082820      
001749*                 CLOSE SDOS-SAL WITH SAVE                        082840      
001750*SAMG                                                             082860      
001751*                 PERFORM 300-DATOS-ENVI-INTELAR                  082880      
001752*                IF TAB-SIST(I) = 500                             082900      
001753*                   MOVE "SALCTAM" TO W-WFL-TCP-FILEUNISYS        083000      
001754*                   MOVE "S500"    TO W-WFL-TCP-FILESERVER        083100      
001755*                   MOVE DD-BASE   TO W-WFL-TCP-FILESERVER-DIA    083200      
001756*                   MOVE MM-BASE   TO W-WFL-TCP-FILESERVER-MES.   083300      
001757*                   DISPLAY W-WFL-TRANSF-TCPIP.                   083400      
001758*                  *CALL SYSTEM WFL USING W-WFL-TRANSF-TCPIP      083500      
001759*                                                                 083600      
001760 2200-ARMA-ETIQUETAS.                                             083700      
001761*--------------------                                             083800      
001762*=======   ARCHIVO DEL SAR SOLO PARA VALLE DE MEXICO              083900      
001763     IF TAB-SIST(I) = 151 AND ( 77-CSI = 4 OR 6 )                 084000      
001764        MOVE 1                    TO 77-LEI-AUXKEY                084100      
001765        GO                        TO 2200-EXIT.                   084200      
001766                                                                  084300      
001767     MOVE TAB-SIST(I)             TO PSIS                         084400      
001768                                     WKS-ET-SIST                  084500      
001769                                     WKS-INT-SIS                  084520      
001770                                     SSIS                         084550      
001771     MOVE CUAL-CSI(77-CSI)        TO PCSI                         084600      
001772                                     SCSI.                        084650      
001773*SAMG                                                             084655      
001774     MOVE ZERO                    TO WKS-INT-ID-SERV.             084657      
001775     IF WKS-INT-CSI = 10                                          084660      
001776        MOVE "V" TO WKS-INT-NOM                                   084661      
001777        IF WKS-INT-SIS = 500                                      084662      
001778           MOVE 2                 TO WKS-INT-ID-SERV              084663      
001779        ELSE                                                      084664      
001780        IF WKS-INT-SIS = 264                                      084665      
001781           MOVE 4                 TO WKS-INT-ID-SERV              084666      
001782        ELSE                                                      084667      
001783           NEXT SENTENCE                                          084668      
001784     ELSE                                                         084670      
001785        MOVE "M" TO WKS-INT-NOM                                   084675      
001786        IF WKS-INT-SIS = 500                                      084677      
001787           MOVE 3                 TO WKS-INT-ID-SERV              084679      
001788        ELSE                                                      084681      
001789        IF WKS-INT-SIS = 264                                      084683      
001790           MOVE 5                 TO WKS-INT-ID-SERV              084685      
001791        ELSE                                                      084687      
001792           NEXT SENTENCE.                                         084689      
001793*    MOVE AA-BASE                 TO PANO.                        084700      
001794*INICIA CODIGO DE RENOVACION CRONOS 2000                          084701      
001795$SET OMIT = OLDCODE                                               084702      
001796     MOVE AA-BASE                 TO PANO SANO.                   084703      
001797$POP OMIT                                                         084704      
001798$SET OMIT = NOT OLDCODE                                           084705      
001799     MOVE ZEROS TO A2K-FEC-CCAA-001                               084706      
001800     MOVE AA-BASE  TO  A2K-FEC-CCAA-001                           084707      
001801     MOVE A2K-FEC-CCAA-AA-001  TO  PANO SANO.                     084708      
001802$POP OMIT                                                         084709      
001803*TERMINA CODIGO DE RENOVACION CRONOS 2000                         084710      
001804     MOVE MM-BASE                 TO PMES SMES.                   084800      
001805     MOVE DD-BASE                 TO PDIA SDIA.                   084900      
001806*    MOVE FECHA-BASE              TO WKS-ET-FECHA                 085000      
001807*INICIA CODIGO DE RENOVACION CRONOS 2000                          085001      
001808$SET OMIT = OLDCODE                                               085002      
001809     MOVE FECHA-BASE              TO WKS-ET-FECHA                 085003      
001810$POP OMIT                                                         085004      
001811$SET OMIT = NOT OLDCODE                                           085005      
001812     MOVE ZEROS TO A2K-FEC-CAMD-001                               085006      
001813     MOVE FECHA-BASE  TO  A2K-FEC-CAMD-001                        085007      
001814     PERFORM A2K-CONV-CAMD-TO-AMD THRU                            085008      
001815             A2K-CONV-CAMD-TO-AMD-EXIT                            085009      
001816     MOVE A2K-FEC-AMD-001  TO  WKS-ET-FECHA WKS-INT-FECHA         085010      
001817$POP OMIT                                                         085011      
001818*TERMINA CODIGO DE RENOVACION CRONOS 2000                         085012      
001819     OPEN INPUT SALDOS.                                           085100      
001820                                                                  085200      
001821*    DISPLAY "ARCHIVO DE ARRIBO : " W-ETIQ-SALDOS.                085300      
001822                                                                  085400      
001823     MOVE "NO"                    TO 77-SI.                       085500      
001824*****PERFORM 2250-CHECA-ARRIBO                                    085600      
001825*****        VARYING K FROM 1 BY 1 UNTIL K > 20.                  085700      
001826                                                                  085800      
001827     IF  77-SI = "SI"                                             085900      
001828         MOVE W-ETIQ-SALDOS       TO NOMB-TAB(I)                  086000      
001829         MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ         086051      
001830         MOVE "I"     TO      TIPO-LJ                             086100      
001831         MOVE 020101  TO      CODIGO-LJ                           086200      
001832         STRING  "ARCH. PROCESADO ANTERIORMENTE : " ,             086300      
001833                 W-ETIQ-SALDOS                                    086400      
001834         DELIMITED BY SIZE INTO TEXTO-LJ                          086500      
001835         MOVE TIPO-LJ        TO      WLI-TIPO-LJ                  086551      
001836         MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                 086571      
001837         PERFORM  000-030-IMPRIME-MENSAJE                         086591      
001838**       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ      086600      
001839         MOVE "ARCH. PROCESADO ANTERIORMENTE"                     086700      
001840                                  TO RLEY-TAB(I)                  086800      
001841         MOVE ZEROES              TO RLEI-TAB(I)                  086900      
001842                                     RGRA-TAB(I)                  087000      
001843         MOVE 1                   TO 77-LEI-AUXKEY                087100      
001844         CLOSE SALDOS WITH SAVE                                   087200      
001845         GO                       TO 2200-EXIT.                   087300      
001846                                                                  087400      
001847     READ SALDOS INTO W-REG-SALDOS                                087500      
001848                      AT END                                      087600      
001849                           MOVE 1 TO 77-LEI-AUXKEY.               087700      
001850                                                                  087800      
001851     IF  77-LEI-AUXKEY = 1                                        087900      
001852         MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ         087951      
001853         MOVE "I"     TO      TIPO-LJ                             088000      
001854         MOVE 020101  TO      CODIGO-LJ                           088100      
001855         STRING "ARCHIVO SIN INFORMACION ", W-ETIQ-SALDOS         088200      
001856         DELIMITED BY SIZE INTO TEXTO-LJ                          088300      
001857         MOVE TIPO-LJ        TO      WLI-TIPO-LJ                  088351      
001858         MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                 088371      
001859         PERFORM  000-030-IMPRIME-MENSAJE                         088391      
001860**       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ      088400      
001861         MOVE "ARCHIVO SIN INFORMACION "                          088500      
001862                                  TO RLEY-TAB(I)                  088600      
001863         MOVE ZEROES              TO RLEI-TAB(I)                  088700      
001864                                     RGRA-TAB(I)                  088800      
001865         CLOSE SALDOS WITH SAVE                                   088900      
001866     ELSE                                                         089000      
001867*ASM                                                              089010      
001868         OPEN OUTPUT SDOS-SAL                                     089020      
001869         MOVE SDO-CTL-CVES        TO UNI-CTL-CVES                 089022      
001870         MOVE SDO-CTL-CSIO        TO UNI-CTL-CSIO                 089024      
001871         MOVE SDO-CTL-SIST        TO UNI-CTL-SIST                 089026      
001872         MOVE SDO-CTL-FPRO        TO UNI-CTL-FPRO                 089028      
001873         MOVE SDO-CTL-DCRE        TO UNI-CTL-DCRE                 089030      
001874         MOVE SDO-CTL-HCRE        TO UNI-CTL-HCRE                 089032      
001875         MOVE SDO-CTL-FORMATO     TO UNI-CTL-FORMATO              089040      
001876         WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL                089080      
001877*ASM                                                              089090      
001878                                                                  089095      
001879         ADD  1                   TO RLEI-TAB(I)                  089100      
001880         MOVE SDO-CTL-FORMATO TO 77-FORMATO                       089120      
001881         PERFORM 400-GRABA-REG-SDOS.                              089140      
001882                                                                  089160      
001883     MOVE ATTRIBUTE OPEN OF SALDOS TO W77-CLOSE.                  089180      
001884     MOVE W-ETIQ-SALDOS           TO NOMB-TAB(I).                 089200      
001885*    MOVE SDO-CTL-FPRO            TO FPRO-TAB(I)                  089300      
001886*INICIA CODIGO PARA PUENTE CRONOS 2000                            089301      
001887$SET OMIT = OLDCODE                                               089302      
001888     MOVE SDO-CTL-FPRO            TO FPRO-TAB(I)                  089303      
001889$POP OMIT                                                         089304      
001890$SET OMIT = NOT OLDCODE                                           089305      
001891     MOVE ZEROS TO A2K-FEC-AMD-001                                089306      
001892     MOVE SDO-CTL-FPRO   TO  A2K-FEC-AMD-001                      089307      
001893     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            089308      
001894             A2K-CONV-AMD-TO-CAMD-EXIT                            089309      
001895     MOVE A2K-FEC-CAMD-001         TO FPRO-TAB(I)                 089310      
001896$POP OMIT                                                         089311      
001897*TERMINA CODIGO PARA PUENTE CRONOS 2000                           089312      
001898*    MOVE SDO-CTL-DCRE            TO DCRE-TAB(I)                  089400      
001899*INICIA CODIGO PARA PUENTE CRONOS 2000                            089401      
001900$SET OMIT = OLDCODE                                               089402      
001901     MOVE SDO-CTL-DCRE            TO DCRE-TAB(I)                  089403      
001902$POP OMIT                                                         089404      
001903$SET OMIT = NOT OLDCODE                                           089405      
001904     MOVE ZEROS TO A2K-FEC-AMD-001                                089406      
001905     MOVE SDO-CTL-DCRE   TO  A2K-FEC-AMD-001                      089407      
001906     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            089408      
001907             A2K-CONV-AMD-TO-CAMD-EXIT                            089409      
001908     MOVE A2K-FEC-CAMD-001        TO DCRE-TAB(I)                  089410      
001909$POP OMIT                                                         089411      
001910*TERMINA CODIGO PARA PUENTE CRONOS 2000                           089412      
001911     MOVE SDO-CTL-HCRE            TO HCRE-TAB(I)                  089500      
001912*INICIA CODIGO DE RENOVACION CRONOS 2000                          089501      
001913$SET OMIT = NOT OLDCODE                                           089502      
001914     MOVE ZEROS TO A2K-FEC-AMD-001                                089503      
001915     MOVE SDO-CTL-FPRO   TO  A2K-FEC-AMD-001                      089504      
001916     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            089505      
001917             A2K-CONV-AMD-TO-CAMD-EXIT                            089506      
001918$POP OMIT                                                         089507      
001919*TERMINA CODIGO DE RENOVACION CRONOS 2000                         089508      
001920     IF  77-LEI-AUXKEY = 0                                        089600      
001921*        IF  SDO-CTL-FPRO = FECHA-BASE                            089700      
001922*INICIA CODIGO PARA PUENTE CRONOS 2000                            089701      
001923$SET OMIT = OLDCODE                                               089702      
001924         IF  SDO-CTL-FPRO = FECHA-BASE                            089703      
001925$POP OMIT                                                         089704      
001926$SET OMIT = NOT OLDCODE                                           089705      
001927     IF A2K-FEC-CAMD-001   = FECHA-BASE                           089710      
001928$POP OMIT                                                         089711      
001929*TERMINA CODIGO PARA PUENTE CRONOS 2000                           089712      
001930             NEXT SENTENCE                                        089800      
001931         ELSE                                                     089900      
001932            MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ      089951      
001933            MOVE "I"     TO      TIPO-LJ                          090000      
001934            MOVE 020101  TO      CODIGO-LJ                        090100      
001935            STRING "NO CHECAN LAS FECHAS DEL PROCESO ",           090200      
001936                   "ARCHIVO :      ", W-ETIQ-SALDOS               090300      
001937            DELIMITED BY SIZE INTO TEXTO-LJ                       090400      
001938            MOVE TIPO-LJ        TO      WLI-TIPO-LJ               090451      
001939            MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ              090471      
001940            PERFORM  000-030-IMPRIME-MENSAJE                      090491      
001941*           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ   090500      
001942             MOVE 1               TO 77-LEI-AUXKEY                090600      
001943             MOVE "FECHAS FUERA DE PROCESO "                      090700      
001944                                  TO RLEY-TAB(I)                  090800      
001945             IF W77-CLOSE = 0                                     090850      
001946*            CLOSE SALDOS WITH SAVE.                              090900      
001947                NEXT SENTENCE                                     090920      
001948             ELSE                                                 090940      
001949                CLOSE SALDOS WITH SAVE.                           090960      
001950     MOVE ZEROES                  TO 77-FORMATO.                  091000      
001951     IF  77-LEI-AUXKEY = 0                                        091100      
001952         IF  SDO-CTL-CSIO = 1 OR 4 OR 6 OR 7 OR 9 OR 10           091200      
001953             MOVE SDO-CTL-FORMATO TO 77-FORMATO                   091300      
001954         ELSE                                                     091400      
001955            MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ      091451      
001956            MOVE "I"     TO      TIPO-LJ                          091500      
001957            MOVE 020101  TO      CODIGO-LJ                        091600      
001958            STRING "NUMERO DE CSI FUERA DE RANGO ",               091700      
001959                   " ARCHIVO : " W-ETIQ-SALDOS                    091800      
001960            DELIMITED BY SIZE INTO TEXTO-LJ                       091900      
001961            MOVE TIPO-LJ        TO      WLI-TIPO-LJ               091951      
001962            MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ              091971      
001963            PERFORM  000-030-IMPRIME-MENSAJE                      091991      
001964*           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ   092000      
001965             MOVE 1               TO 77-LEI-AUXKEY                092100      
001966             MOVE "C.S.I. FUERA DE RANGO "                        092200      
001967                                  TO RLEY-TAB(I)                  092300      
001968             IF W77-CLOSE = 0                                     092350      
001969*            CLOSE SALDOS WITH SAVE.                              092400      
001970                NEXT SENTENCE                                     092420      
001971             ELSE                                                 092440      
001972                CLOSE SALDOS WITH SAVE.                           092460      
001973*    DISPLAY "77 F O R M A T O    : " 77-FORMATO.                 092500      
001974     IF  77-FORMATO = 1 OR 2 OR 3                                 092600      
001975         NEXT SENTENCE                                            092700      
001976     ELSE                                                         092800      
001977         IF  77-LEI-AUXKEY = 0                                    092900      
001978             MOVE 1                   TO 77-LEI-AUXKEY            093000      
001979             MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ     093051      
001980             MOVE "I"     TO      TIPO-LJ                         093100      
001981             MOVE 020101  TO      CODIGO-LJ                       093200      
001982             MOVE 77-FORMATO  TO W77-FORMATO                      093300      
001983             STRING "FORMATO        : ",  W77-FORMATO ,           093400      
001984                    " NO SE PROCESA : ",  W-ETIQ-SALDOS ,         093500      
001985                    "NOTIFICAR A INGENIERIA DE SISTEMAS "         093600      
001986             DELIMITED BY SIZE INTO TEXTO-LJ                      093700      
001987             MOVE TIPO-LJ        TO      WLI-TIPO-LJ              093751      
001988             MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ             093771      
001989             PERFORM  000-030-IMPRIME-MENSAJE                     093791      
001990             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ. 093800      
001991                                                                  093900      
001992                                                                  094000      
001993 2200-EXIT.                                                       094100      
001994     EXIT.                                                        094200      
001995*                                                                 094300      
001996 2250-CHECA-ARRIBO.                                               094400      
001997*------------------                                               094500      
001998                                                                  094600      
001999     IF  77-SI = "SI"                                             094700      
002000         NEXT SENTENCE                                            094800      
002001     ELSE                                                         094900      
002002         IF  TAB-ARRIBO (K) = TAB-SIST (I)                        095000      
002003             MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ     095051      
002004             MOVE "I"     TO      TIPO-LJ                         095100      
002005             MOVE 020101  TO      CODIGO-LJ                       095200      
002006             STRING "ARCHIVO YA PROCESADO  ", W-ETIQ-SALDOS       095300      
002007             DELIMITED BY SIZE INTO TEXTO-LJ                      095400      
002008             MOVE TIPO-LJ        TO      WLI-TIPO-LJ              095451      
002009             MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ             095471      
002010             PERFORM  000-030-IMPRIME-MENSAJE                     095491      
002011*            CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  095500      
002012             MOVE "SI"            TO 77-SI.                       095600      
002013                                                                  095700      
002014*                                                                 095800      
002015 2300-BARRE-SALDOS.                                               095900      
002016*------------------                                               096000      
002017                                                                  096100      
002018     PERFORM 2900-LEE-SALDOS.                                     096200      
002019                                                                  096300      
002020     IF  77-EOF-SDOS = 1                                          096400      
002021         MOVE "ARCHIVO PROCESADO OK "                             096500      
002022                                  TO RLEY-TAB(I)                  096600      
002023         PERFORM 2350-GRABA-ARRIBO                                096700      
002024     ELSE                                                         096800      
002025         IF  SDO-CTE-CVES = 10                                    096900      
002026             PERFORM 2400-ACTUALIZO-CTES                          097000      
002027         ELSE                                                     097100      
002028             IF  SDO-SUC-CVES = 20                                097200      
002029                 PERFORM 2500-ACTUALIZO-SUC                       097300      
002030             ELSE                                                 097400      
002031                 IF  SDO-GLO-CVES = 30                            097500      
002032                     PERFORM 2600-ACTUALIZO-GLO                   097600      
002033                 ELSE                                             097700      
002034                     IF  SDO-TRA-CVES = 90                        097800      
002035                         PERFORM 2700-CHECO-REGISTROS.            097900      
002036                                                                  098000      
002037*                                                                 098100      
002038 2350-GRABA-ARRIBO.                                               098200      
002039*------------------                                               098300      
002040                                                                  098400      
002041     LOCK S151BD02ADSALDO                                         098500      
002042          ON EXCEPTION                                            098600      
002043            IF  DMSTATUS(NOTFOUND)                                098700      
002044              MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ    098751      
002045              MOVE "E"         TO  TIPO-LJ                        098800      
002046              MOVE 010105      TO  CODIGO-LJ                      098900      
002047              STRING "NO PUDE REGRESAR AL REG/FECHA " ,           099000      
002048              DELIMITED BY SIZE INTO TEXTO-LJ                     099100      
002049              MOVE TIPO-LJ        TO      WLI-TIPO-LJ             099151      
002050              MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ            099171      
002051              PERFORM  000-030-IMPRIME-MENSAJE                    099191      
002052              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 099200      
002053              SET MYSELF(STATUS) TO -1.                           099300      
002054                                                                  099400      
002055     PERFORM 2355-CARGA-ARRIBO                                    099500      
002056             VARYING K FROM 1 BY 1 UNTIL K > 20.                  099600      
002057                                                                  099700      
002058     MOVE ZEROES                  TO 77-AUX.                      099800      
002059     MOVE 1                       TO 77-AUX.                      099900      
002060     PERFORM 9000-BEGIN-TRANSACTION                               100000      
002061     MOVE 2                       TO 77-AUX.                      100100      
002062     PERFORM 9100-STORE-CTR                                       100200      
002063     MOVE 3                       TO 77-AUX.                      100300      
002064     PERFORM 9500-END-TRANSACTION.                                100400      
002065                                                                  100500      
002066*                                                                 100600      
002067 2355-CARGA-ARRIBO.                                               100700      
002068*------------------                                               100800      
002069                                                                  100900      
002070     IF  K > 20                                                   101000      
002071         NEXT SENTENCE                                            101100      
002072     ELSE                                                         101200      
002073         IF  B92-CTR-ARRIBO(K) = 0                                101300      
002074             MOVE TAB-SIST (I)    TO B92-CTR-ARRIBO(K)            101400      
002075             MOVE 21              TO K.                           101500      
002076*                                                                 101600      
002077 2400-ACTUALIZO-CTES.                                             101700      
002078*--------------------                                             101800      
002079                                                                  101900      
002080*ASM                                                              101950      
002081     PERFORM 2405-GRABA-SALDOS-CTE.                               101960      
002082                                                                  101970      
002083     MOVE ZEROES                  TO LLAVE-CTE.                   102000      
002084     MOVE SDO-CTE-CTAS            TO LLAVE-CTE.                   102100      
002085     LOCK B03SXCTE      AT B03-CTE-MONEDA    = SDO-CTE-MON  AND   102200      
002086                           B03-CTE-SUCURSAL  = SDO-CTE-SUC  AND   102300      
002087                           B03-CTE-SISTEMA   = SDO-CTE-SIST AND   102400      
002088                           B03-CTE-NUMERO1   = LLAVE-CTE1   AND   102500      
002089                           B03-CTE-NUMERO2   = LLAVE-CTE2         102600      
002090          ON EXCEPTION                                            102700      
002091             IF  DMSTATUS(NOTFOUND)                               102800      
002092                 CREATE S151B03SDOCTE                             102900      
002093             ELSE                                                 103000      
002094                 MOVE 13          TO 77-AUX                       103100      
002095                 PERFORM 8000-BD-ERROR.                           103200      
002096                                                                  103300      
002097     PERFORM 2410-CLIENTES.                                       103400      
002098                                                                  103500      
002099     MOVE ZEROES                  TO 77-AUX.                      103600      
002100     MOVE 4                       TO 77-AUX.                      103700      
002101     PERFORM 9000-BEGIN-TRANSACTION                               103800      
002102     MOVE 5                       TO 77-AUX.                      103900      
002103     PERFORM 9200-STORE-CTE                                       104000      
002104     MOVE 6                       TO 77-AUX.                      104100      
002105     PERFORM 9500-END-TRANSACTION.                                104200      
002106                                                                  104300      
002107*                                                                 104305      
002108 2405-GRABA-SALDOS-CTE.                                           104310      
002109*----------------------                                           104315      
002110                                                                  104320      
002111     MOVE SDO-CTE-CVES            TO UNI-CTE-CVES.                104325      
002112     MOVE SDO-CTE-SIST            TO UNI-CTE-SIST.                104330      
002113     MOVE SDO-CTE-SUC             TO UNI-CTE-SUC.                 104335      
002114     MOVE SDO-CTE-MON             TO UNI-CTE-MON.                 104340      
002115     MOVE SDO-CTE-CTAS            TO UNI-CTE-CTAS.                104345      
002116     MOVE SDO-CTE-INST            TO UNI-CTE-INST.                104350      
002117     MOVE SDO-CTE-SEXP            TO UNI-CTE-SEXP.                104355      
002118     MOVE SDO-CTE-NOMB            TO UNI-CTE-NOMB.                104360      
002119     MOVE SDO-CTE-SANT            TO UNI-CTE-SANT.                104365      
002120     MOVE SDO-CTE-SACT            TO UNI-CTE-SACT.                104370      
002121     MOVE SDO-CTE-FECH            TO UNI-CTE-FECH.                104375      
002122     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   104380      
002123                                                                  104385      
002124*                                                                 104400      
002125 2410-CLIENTES.                                                   104500      
002126*--------------                                                   104600      
002127                                                                  104700      
002128     MOVE SDO-CTE-SIST            TO B03-CTE-SISTEMA.             104800      
002129     MOVE SDO-CTE-MON             TO B03-CTE-MONEDA.              104900      
002130     MOVE SDO-CTE-SUC             TO B03-CTE-SUCURSAL.            105000      
002131     MOVE LLAVE-CTE1              TO B03-CTE-NUMERO1.             105100      
002132     MOVE LLAVE-CTE2              TO B03-CTE-NUMERO2.             105200      
002133     MOVE SDO-CTE-INST            TO B03-CTE-INST.                105300      
002134     IF  SDO-CTE-SIST = 264                                       105400      
002135         MOVE SDO-CTE-SEXP        TO B03-CTE-SUCEXP               105500      
002136*        MOVE SDO-CTE-FECH        TO B03-CTE-FECHA                105600      
002137*INICIA CODIGO PARA PUENTE CRONOS 2000                            105601      
002138$SET OMIT = OLDCODE                                               105602      
002139         MOVE SDO-CTE-FECH        TO B03-CTE-FECHA                105603      
002140$POP OMIT                                                         105604      
002141$SET OMIT = NOT OLDCODE                                           105605      
002142     MOVE ZEROS TO A2K-FEC-AMD-001                                105606      
002143     MOVE SDO-CTE-FECH   TO  A2K-FEC-AMD-001                      105607      
002144     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            105608      
002145             A2K-CONV-AMD-TO-CAMD-EXIT                            105609      
002146     MOVE A2K-FEC-CAMD-001         TO B03-CTE-FECHA               105610      
002147$POP OMIT                                                         105611      
002148*TERMINA CODIGO PARA PUENTE CRONOS 2000                           105612      
002149     ELSE                                                         105700      
002150         MOVE ZEROES              TO B03-CTE-SUCEXP               105800      
002151                                     B03-CTE-FECHA.               105900      
002152     MOVE SDO-CTE-NOMB            TO B03-CTE-NOMBRE.              106000      
002153     COMPUTE B03-CTE-ANTES = SDO-CTE-SANT / WS-FACTOR-NVOPSO      106100      
002154     COMPUTE B03-CTE-ACTUAL = SDO-CTE-SACT / WS-FACTOR-NVOPSO.    106200      
002155                                                                  106300      
002156*                                                                 106400      
002157 2500-ACTUALIZO-SUC.                                              106500      
002158*-------------------                                              106600      
002159                                                                  106700      
002160*ASM                                                              106710      
002161     PERFORM 2505-GRABA-SALDOS-SUC.                               106720      
002162                                                                  106760      
002163     LOCK B02SXSUC      AT B02-SUC-MONEDA = SDO-SUC-MON  AND      106800      
002164                           B02-SUC-NUMERO = SDO-SUC-SUCU          106900      
002165          ON EXCEPTION                                            107000      
002166             IF  DMSTATUS(NOTFOUND)                               107100      
002167                 CREATE S151B02SDOSUC                             107200      
002168             ELSE                                                 107300      
002169                 MOVE 14          TO 77-AUX                       107400      
002170                 PERFORM 8000-BD-ERROR.                           107500      
002171                                                                  107600      
002172     PERFORM 2510-SUCURSALES.                                     107700      
002173                                                                  107800      
002174     MOVE ZEROES                  TO 77-AUX.                      107900      
002175     MOVE 7                       TO 77-AUX.                      108000      
002176     PERFORM 9000-BEGIN-TRANSACTION                               108100      
002177     MOVE 8                       TO 77-AUX.                      108200      
002178     PERFORM 9300-STORE-SUC                                       108300      
002179     MOVE 9                       TO 77-AUX.                      108400      
002180     PERFORM 9500-END-TRANSACTION.                                108500      
002181                                                                  108600      
002182*                                                                 108605      
002183 2505-GRABA-SALDOS-SUC.                                           108610      
002184*----------------------                                           108615      
002185                                                                  108620      
002186     MOVE SDO-SUC-CVES            TO UNI-SUC-CVES.                108625      
002187     MOVE SDO-SUC-SIST            TO UNI-SUC-SIST.                108630      
002188     MOVE SDO-SUC-SUCU            TO UNI-SUC-SUCU.                108635      
002189     MOVE SDO-SUC-MON             TO UNI-SUC-MON.                 108640      
002190     MOVE SDO-SUC-SANT            TO UNI-SUC-SANT.                108645      
002191     MOVE SDO-SUC-SACT            TO UNI-SUC-SACT.                108650      
002192     MOVE SDO-SUC-FECH            TO UNI-SUC-FECH.                108655      
002193     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   108660      
002194                                                                  108665      
002195*                                                                 108700      
002196 2510-SUCURSALES.                                                 108800      
002197*----------------                                                 108900      
002198                                                                  109000      
002199     MOVE SDO-SUC-MON            TO B02-SUC-MONEDA.               109100      
002200     MOVE SDO-SUC-SUCU           TO B02-SUC-NUMERO.               109200      
002201     MOVE SDO-SUC-SIST           TO B02-SUC-SISTEMA(I)            109300      
002202     COMPUTE B02-SUC-ACTUAL (I) = SDO-SUC-SACT / WS-FACTOR-NVOPSO.109400      
002203     COMPUTE B02-SUC-ANTES (I) = SDO-SUC-SANT / WS-FACTOR-NVOPSO. 109500      
002204                                                                  109600      
002205*                                                                 109700      
002206 2600-ACTUALIZO-GLO.                                              109800      
002207*-------------------                                              109900      
002208                                                                  110000      
002209*ASM                                                              110010      
002210     PERFORM 2605-GRABA-SALDOS-GLO.                               110020      
002211                                                                  110060      
002212     LOCK B01SXCSI       AT B01-GLO-MONEDA = SDO-GLO-MON AND      110100      
002213                            B01-GLO-CSI    = 77-CSI               110200      
002214          ON EXCEPTION                                            110300      
002215             IF  DMSTATUS(NOTFOUND)                               110400      
002216                 CREATE S151B01SDOGLOB                            110500      
002217             ELSE                                                 110600      
002218                 MOVE 15          TO 77-AUX                       110700      
002219                 PERFORM 8000-BD-ERROR.                           110800      
002220                                                                  110900      
002221     PERFORM 2610-GLOBALES.                                       111000      
002222                                                                  111100      
002223     MOVE ZEROES                  TO 77-AUX.                      111200      
002224     MOVE 10                      TO 77-AUX.                      111300      
002225     PERFORM 9000-BEGIN-TRANSACTION                               111400      
002226     MOVE 11                      TO 77-AUX.                      111500      
002227     PERFORM 9400-STORE-GLO                                       111600      
002228     MOVE 12                      TO 77-AUX.                      111700      
002229     PERFORM 9500-END-TRANSACTION.                                111800      
002230                                                                  111900      
002231*                                                                 111905      
002232 2605-GRABA-SALDOS-GLO.                                           111910      
002233*----------------------                                           111915      
002234                                                                  111920      
002235     MOVE SDO-GLO-CVES            TO UNI-GLO-CVES.                111925      
002236     MOVE SDO-GLO-SIST            TO UNI-GLO-SIST.                111930      
002237     MOVE SDO-GLO-MON             TO UNI-GLO-MON.                 111935      
002238     MOVE SDO-GLO-SANT            TO UNI-GLO-SANT.                111940      
002239     MOVE SDO-GLO-SACT            TO UNI-GLO-SACT.                111945      
002240     MOVE SDO-GLO-FECH            TO UNI-GLO-FECH.                111950      
002241     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   111955      
002242                                                                  111960      
002243*                                                                 112000      
002244 2610-GLOBALES.                                                   112100      
002245*--------------                                                   112200      
002246                                                                  112300      
002247     MOVE 77-CSI                 TO B01-GLO-CSI.                  112400      
002248     MOVE SDO-GLO-MON            TO B01-GLO-MONEDA.               112500      
002249     MOVE SDO-GLO-SIST           TO B01-GLO-SISTEMA(I)            112600      
002250     COMPUTE B01-GLO-ACTUAL (I) = SDO-GLO-SACT / WS-FACTOR-NVOPSO.112700      
002251     COMPUTE B01-GLO-ANTES (I) = SDO-GLO-SANT / WS-FACTOR-NVOPSO. 112800      
002252                                                                  112900      
002253*                                                                 113000      
002254                                                                  113100      
002255                                                                  113200      
002256*                                                                 113300      
002257 2700-CHECO-REGISTROS.                                            113400      
002258*---------------------                                            113500      
002259                                                                  113600      
002260*ASM                                                              113620      
002261     PERFORM 2710-GRABA-TR-SALDOS.                                113640      
002262                                                                  113660      
002263     IF  RLEI-TAB(I) = SDO-TRA-REG                                113700      
002264         NEXT SENTENCE                                            113800      
002265     ELSE                                                         113900      
002266        MOVE "I"                TO TIPO-LJ                        114000      
002267        MOVE 020601             TO CODIGO-LJ                      114100      
002268        MOVE SDO-TRA-REG        TO W77-SDO-TRA-REG                114200      
002269        MOVE RLEI-TAB(I)        TO W77-RLEI-TAB                   114300      
002270        STRING " NO CHECAN LOS REGISTROS DEL  SISTEMA  ",         114400      
002271               " REGISTROS ARCHIVO ", W77-SDO-TRA-REG  " " ,      114500      
002272                "  REGISTROS TABLA   ", W77-RLEI-TAB " ",         114600      
002273                 W-ETIQ-SALDOS " " ,                              114700      
002274               " *** REINICIAR EL PROCESO ** "                    114800      
002275               DELIMITED BY SIZE INTO TEXTO-LJ                    114900      
002276         SET MYSELF(STATUS) TO -1.                                115000      
002277*                                                                 115100      
002278 2710-GRABA-TR-SALDOS.                                            115110      
002279*---------------------                                            115120      
002280                                                                  115130      
002281     MOVE SDO-TRA-CVES            TO UNI-TRA-CVES.                115140      
002282     MOVE SDO-TRA-SIST            TO UNI-TRA-SIST.                115150      
002283     MOVE SDO-TRA-REG             TO UNI-TRA-REG.                 115160      
002284     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   115170      
002285                                                                  115180      
002286 2900-LEE-SALDOS.                                                 115200      
002287*-----------------                                                115300      
002288                                                                  115400      
002289                                                                  115500      
002290                                                                  115600      
002291     READ SALDOS INTO W-REG-SALDOS                                115700      
002292                      AT END                                      115800      
002293                           MOVE 1 TO 77-EOF-SDOS.                 115900      
002294                                                                  116000      
002295     IF  77-EOF-SDOS = 1                                          116100      
002296         NEXT SENTENCE                                            116200      
002297     ELSE                                                         116300      
002298         IF  SDO-CTE-CVES > 0                                     116400      
002299             ADD 1                TO RLEI-TAB(I).                 116500      
002300*                                                                 116600      
002301 3000-CIERRA.                                                     116700      
002302*------------                                                     116800      
002303                                                                  116900      
002304     CLOSE S151BD02ADSALDO.                                       117000      
002305                                                                  117100      
002306*                                                                 117200      
002307 4000-REPORTE.                                                    117300      
002308*-------------                                                    117400      
002309                                                                  117500      
002310                                                                  117600      
002311     PERFORM 4100-TITULOS.                                        117700      
002312     PERFORM 4200-SUBTITULOS.                                     117800      
002313     PERFORM 4300-DETALLE                                         117900      
002314             VARYING J FROM 1 BY 1 UNTIL J > 20.                  118000      
002315*                                                                 118100      
002316 4100-TITULOS.                                                    118200      
002317     WRITE LINEA-CSI FROM BLANCOS BEFORE CHANNEL 1.               118300      
002318     MOVE "C"                     TO TIRE-COM1.                   118400      
002319     MOVE  0                      TO SUBS-COM1.                   118500      
002320     MOVE 005                     TO PASO-COM1.                   118600      
002321     MOVE 1                       TO NURE-COM1.                   118700      
002322     MOVE FECHA-BASE              TO FECH-COM1.                   118800      
002323     WRITE LINEA-CSI FROM COMUN-TITULO-1 BEFORE 2.                118900      
002324     MOVE "INTEGRACION    "       TO PASO-COM2.                   119000      
002325     MOVE "DIARIO "               TO TIPO-COM2.                   119100      
002326     WRITE LINEA-CSI FROM COMUN-TITULO-2 BEFORE 2.                119200      
002327     MOVE NOMBRE-RPTE1            TO TITU-COM3.                   119300      
002328     MOVE 1                       TO HOJA-COM3.                   119400      
002329     WRITE LINEA-CSI FROM COMUN-TITULO-3 BEFORE 3.                119500      
002330*                                                                 119600      
002331*                                                                 119700      
002332 4200-SUBTITULOS.                                                 119800      
002333*    MOVE 00                      TO NUSU-COM4.                   119900      
002334     MOVE NOMBRE-CSI(77-CSI)      TO NOSU-COM4.                   120000      
002335     WRITE LINEA-CSI FROM COMUN-TITULO-4 BEFORE 1.                120100      
002336     WRITE LINEA-CSI FROM CONT-ARCH-TITULO-1 BEFORE 1.            120200      
002337     WRITE LINEA-CSI FROM CONT-ARCH-TITULO-2 BEFORE 1.            120300      
002338     WRITE LINEA-CSI FROM CONT-ARCH-TITULO-3 BEFORE 3.            120400      
002339*                                                                 120500      
002340 4300-DETALLE.                                                    120600      
002341     IF  (FPRO-TAB (J) = 0) AND (DCRE-TAB (J) = 0) AND            120700      
002342         (HCRE-TAB (J) = 0) AND (RLEI-TAB (J) = 0) AND            120800      
002343         (RGRA-TAB (J) = 0) AND (NOMB-TAB (J) = SPACES)           120900      
002344         NEXT SENTENCE                                            121000      
002345     ELSE                                                         121100      
002346         MOVE NOMB-TAB (J)        TO NOMB-DET                     121200      
002347         MOVE FPRO-TAB (J)        TO FPRO-DET                     121300      
002348         MOVE DCRE-TAB (J)        TO DCRE-DET                     121400      
002349         MOVE HCRE-T-AA(J)        TO HCRE-AA                      121500      
002350         MOVE HCRE-T-MM(J)        TO HCRE-MM                      121510      
002351         MOVE HCRE-T-DD(J)        TO HCRE-DD                      121520      
002352         MOVE RLEI-TAB (J)        TO RLEI-DET                     121600      
002353         MOVE RGRA-TAB (J)        TO RGRA-DET                     121700      
002354         MOVE RLEY-TAB (J)        TO RLEY-DET                     121800      
002355         WRITE LINEA-CSI FROM CONT-ARCH-DETALLE BEFORE 2.         121900      
002356*                                                                 122000      
002357 8000-BD-ERROR.                                                   122100      
002358*-----------                                                      122200      
002359                                                                  122300      
002360     MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ             122351      
002361     MOVE "E"         TO  TIPO-LJ                                 122400      
002362     MOVE 010105      TO  CODIGO-LJ                               122500      
002363     STRING  "ERROR EN BASE DE DATOS :   S151BD02ADSALDO ",       122600      
002364             "ERROR RUTINA           : " , TAB-ERROR(77-AUX)      122700      
002365*             "ERROR                  : " , DMSTATUS(DMCATEGORY) ,122800      
002366*             " "                                                 122900      
002367             DELIMITED BY SIZE INTO TEXTO-LJ                      123000      
002368     MOVE TIPO-LJ        TO      WLI-TIPO-LJ                      123051      
002369     MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                     123071      
002370     PERFORM  000-030-IMPRIME-MENSAJE                             123091      
002371     CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ          123100      
002372     CALL SYSTEM DMTERMINATE.                                     123200      
002373                                                                  123300      
002374*                                                                 123400      
002375******************************************************************123500      
002376*                 ACCESOS A LA BASE DE DATOS                     *123600      
002377******************************************************************123700      
002378                                                                  123800      
002379 9000-BEGIN-TRANSACTION.                                          123900      
002380*-----------------------                                          124000      
002381                                                                  124100      
002382     BEGIN-TRANSACTION NO-AUDIT S151B91REINICIO                   124200      
002383     ON EXCEPTION                                                 124300      
002384        PERFORM 8000-BD-ERROR.                                    124400      
002385                                                                  124500      
002386*                                                                 124600      
002387 9100-STORE-CTR.                                                  124700      
002388*----------------                                                 124800      
002389                                                                  124900      
002390     STORE S151BD02ADSALDO                                        125000      
002391     ON EXCEPTION                                                 125100      
002392        PERFORM 8000-BD-ERROR.                                    125200      
002393                                                                  125300      
002394*                                                                 125400      
002395 9200-STORE-CTE.                                                  125500      
002396*----------------                                                 125600      
002397                                                                  125700      
002398     STORE S151B03SDOCTE                                          125800      
002399     ON EXCEPTION                                                 125900      
002400        PERFORM 8000-BD-ERROR.                                    126000      
002401                                                                  126100      
002402*                                                                 126200      
002403 9300-STORE-SUC.                                                  126300      
002404*----------------                                                 126400      
002405                                                                  126500      
002406     STORE S151B02SDOSUC                                          126600      
002407     ON EXCEPTION                                                 126700      
002408        PERFORM 8000-BD-ERROR.                                    126800      
002409                                                                  126900      
002410*                                                                 127000      
002411 9400-STORE-GLO.                                                  127100      
002412*----------------                                                 127200      
002413                                                                  127300      
002414     STORE S151B01SDOGLOB                                         127400      
002415     ON EXCEPTION                                                 127500      
002416        PERFORM 8000-BD-ERROR.                                    127600      
002417                                                                  127700      
002418*                                                                 127800      
002419 9410-STORE-FECHVAL.                                              127900      
002420*-------------------                                              128000      
002421                                                                  128100      
002422     STORE S151B10FECHVAL                                         128200      
002423     ON EXCEPTION                                                 128300      
002424        PERFORM 8000-BD-ERROR.                                    128400      
002425                                                                  128500      
002426*                                                                 128600      
002427 9420-STORE-CANFECHVAL.                                           128700      
002428*----------------------                                           128800      
002429                                                                  128900      
002430     STORE S151B11CANFVAL                                         129000      
002431     ON EXCEPTION                                                 129100      
002432        PERFORM 8000-BD-ERROR.                                    129200      
002433                                                                  129300      
002434*                                                                 129400      
002435 9500-END-TRANSACTION.                                            129500      
002436*---------------------                                            129600      
002437                                                                  129700      
002438     END-TRANSACTION AUDIT S151B91REINICIO                        129800      
002439     ON EXCEPTION                                                 129900      
002440        PERFORM 8000-BD-ERROR.                                    130000      
002441                                                                  130100      
002442     ADD 1                        TO RGRA-TAB(I).                 130200      
002443*                                                                 130300      
002444 5000-BARRE-SALDOS-ANT.                                           130400      
002445*----------------------                                           130500      
002446                                                                  130600      
002447     PERFORM 5900-LEE-SALDOS-ANT.                                 130700      
002448                                                                  130800      
002449     IF  77-EOF-SDOS = 1                                          130900      
002450         MOVE "ARCHIVO PROCESADO OK "                             131000      
002451                                  TO RLEY-TAB(I)                  131100      
002452         PERFORM 5350-GRABA-ARRIBO-ANT                            131200      
002453     ELSE                                                         131300      
002454         IF  ANT-CTE-CVES = 10                                    131400      
002455             PERFORM 5400-ACTUALIZO-CTES-ANT                      131500      
002456         ELSE                                                     131600      
002457             IF  ANT-SUC-CVES = 20                                131700      
002458                 PERFORM 5500-ACTUALIZO-SUC-ANT                   131800      
002459             ELSE                                                 131900      
002460                 IF  ANT-GLO-CVES = 30                            132000      
002461                     PERFORM 5600-ACTUALIZO-GLO-ANT               132100      
002462                 ELSE                                             132200      
002463                     IF  ANT-TRA-CVES = 90                        132300      
002464                         PERFORM 5700-CHECO-REGISTROS-ANT.        132400      
002465                                                                  132500      
002466*                                                                 132600      
002467 5350-GRABA-ARRIBO-ANT.                                           132700      
002468*----------------------                                           132800      
002469                                                                  132900      
002470     LOCK S151BD02ADSALDO                                         133000      
002471          ON EXCEPTION                                            133100      
002472            IF  DMSTATUS(NOTFOUND)                                133200      
002473                MOVE SPACES      TO  WLI-ENCAB-52, TEXTO-LJ       133251      
002474                MOVE "E"         TO  TIPO-LJ                      133300      
002475                MOVE 010105      TO  CODIGO-LJ                    133400      
002476                STRING "NO PUDE REGRESAR AL REG/FECHA "           133500      
002477                       DELIMITED BY SIZE INTO TEXTO-LJ            133600      
002478                MOVE TIPO-LJ        TO      WLI-TIPO-LJ           133651      
002479                MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ          133671      
002480                PERFORM  000-030-IMPRIME-MENSAJE                  133691      
002481            CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ   133700      
002482            SET MYSELF(STATUS) TO -1.                             133800      
002483                                                                  133900      
002484     PERFORM 5355-CARGA-ARRIBO-ANT                                134000      
002485             VARYING K FROM 1 BY 1 UNTIL K > 20.                  134100      
002486                                                                  134200      
002487     MOVE ZEROES                  TO 77-AUX.                      134300      
002488     MOVE 1                       TO 77-AUX.                      134400      
002489     PERFORM 9000-BEGIN-TRANSACTION                               134500      
002490     MOVE 2                       TO 77-AUX.                      134600      
002491     PERFORM 9100-STORE-CTR                                       134700      
002492     MOVE 3                       TO 77-AUX.                      134800      
002493     PERFORM 9500-END-TRANSACTION.                                134900      
002494                                                                  135000      
002495*                                                                 135100      
002496 5355-CARGA-ARRIBO-ANT.                                           135200      
002497*----------------------                                           135300      
002498                                                                  135400      
002499     IF  K > 20                                                   135500      
002500         NEXT SENTENCE                                            135600      
002501     ELSE                                                         135700      
002502         IF  B92-CTR-ARRIBO(K) = 0                                135800      
002503             MOVE TAB-SIST (I)    TO B92-CTR-ARRIBO(K)            135900      
002504             MOVE 21              TO K.                           136000      
002505*                                                                 136100      
002506 5400-ACTUALIZO-CTES-ANT.                                         136200      
002507*------------------------                                         136300      
002508                                                                  136400      
002509*ASM                                                              136450      
002510     PERFORM 5405-GRABA-SALDOS-CTES-ANT.                          136455      
002511                                                                  136460      
002512     MOVE ZEROES                  TO LLAVE-CTE.                   136500      
002513     MOVE ANT-CTE-CTAS            TO LLAVE-CTE.                   136600      
002514     LOCK B03SXCTE      AT B03-CTE-MONEDA    = ANT-CTE-MON  AND   136700      
002515                           B03-CTE-SUCURSAL  = ANT-CTE-SUC  AND   136800      
002516                           B03-CTE-SISTEMA   = ANT-CTE-SIST AND   136900      
002517                           B03-CTE-NUMERO1   = LLAVE-CTE1   AND   137000      
002518                           B03-CTE-NUMERO2   = LLAVE-CTE2         137100      
002519          ON EXCEPTION                                            137200      
002520             IF  DMSTATUS(NOTFOUND)                               137300      
002521                 CREATE S151B03SDOCTE                             137400      
002522             ELSE                                                 137500      
002523                 MOVE 13          TO 77-AUX                       137600      
002524                 PERFORM 8000-BD-ERROR.                           137700      
002525                                                                  137800      
002526     PERFORM 5410-CLIENTES-ANT                                    137900      
002527                                                                  138000      
002528     MOVE ZEROES                  TO 77-AUX.                      138100      
002529     MOVE 4                       TO 77-AUX.                      138200      
002530     PERFORM 9000-BEGIN-TRANSACTION                               138300      
002531     MOVE 5                       TO 77-AUX.                      138400      
002532     PERFORM 9200-STORE-CTE                                       138500      
002533     MOVE 6                       TO 77-AUX.                      138600      
002534     PERFORM 9500-END-TRANSACTION.                                138700      
002535                                                                  138800      
002536*                                                                 138805      
002537 5405-GRABA-SALDOS-CTES-ANT.                                      138810      
002538*---------------------------                                      138815      
002539                                                                  138820      
002540     MOVE ANT-CTE-CVES            TO UNI-CTE-CVES.                138825      
002541     MOVE ANT-CTE-SIST            TO UNI-CTE-SIST.                138830      
002542     MOVE ANT-CTE-SUC             TO UNI-CTE-SUC.                 138835      
002543     MOVE ANT-CTE-MON             TO UNI-CTE-MON.                 138840      
002544     MOVE ANT-CTE-CTAS            TO UNI-CTE-CTAS.                138845      
002545     MOVE ANT-CTE-INST            TO UNI-CTE-INST.                138850      
002546     MOVE ZEROS                   TO UNI-CTE-SEXP.                138852      
002547     MOVE ANT-CTE-NOMB            TO UNI-CTE-NOMB.                138855      
002548     MOVE ANT-CTE-SANT            TO UNI-CTE-SANT.                138860      
002549     MOVE ANT-CTE-SACT            TO UNI-CTE-SACT.                138865      
002550     MOVE ANT-CTE-FECH            TO UNI-CTE-FECH.                138870      
002551     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   138875      
002552                                                                  138880      
002553*                                                                 138900      
002554 5410-CLIENTES-ANT.                                               139000      
002555*------------------                                               139100      
002556                                                                  139200      
002557     MOVE ANT-CTE-SIST            TO B03-CTE-SISTEMA.             139300      
002558     MOVE ANT-CTE-MON             TO B03-CTE-MONEDA.              139400      
002559     MOVE ANT-CTE-SUC             TO B03-CTE-SUCURSAL.            139500      
002560     MOVE LLAVE-CTE1              TO B03-CTE-NUMERO1.             139600      
002561     MOVE LLAVE-CTE2              TO B03-CTE-NUMERO2.             139700      
002562     MOVE ANT-CTE-INST            TO B03-CTE-INST.                139800      
002563     MOVE ANT-CTE-NOMB            TO B03-CTE-NOMBRE.              139900      
002564     COMPUTE B03-CTE-ANTES = ANT-CTE-SANT / WS-FACTOR-NVOPSO.     140000      
002565     COMPUTE B03-CTE-ACTUAL = ANT-CTE-SACT / WS-FACTOR-NVOPSO.    140100      
002566     MOVE ZEROES                  TO B03-CTE-SUCEXP               140200      
002567                                     B03-CTE-FECHA.               140300      
002568*                                                                 140400      
002569 5500-ACTUALIZO-SUC-ANT.                                          140500      
002570*-----------------------                                          140600      
002571                                                                  140700      
002572*ASM                                                              140710      
002573     PERFORM 5505-GRABA-SALDOS-SUC-ANT.                           140720      
002574                                                                  140760      
002575     LOCK B02SXSUC      AT B02-SUC-MONEDA = ANT-SUC-MON  AND      140800      
002576                           B02-SUC-NUMERO = ANT-SUC-SUCU          140900      
002577          ON EXCEPTION                                            141000      
002578             IF  DMSTATUS(NOTFOUND)                               141100      
002579                 CREATE S151B02SDOSUC                             141200      
002580             ELSE                                                 141300      
002581                 MOVE 14          TO 77-AUX                       141400      
002582                 PERFORM 8000-BD-ERROR.                           141500      
002583                                                                  141600      
002584     PERFORM 5510-SUCURSALES-ANT.                                 141700      
002585                                                                  141800      
002586     MOVE ZEROES                  TO 77-AUX.                      141900      
002587     MOVE 7                       TO 77-AUX.                      142000      
002588     PERFORM 9000-BEGIN-TRANSACTION                               142100      
002589     MOVE 8                       TO 77-AUX.                      142200      
002590     PERFORM 9300-STORE-SUC                                       142300      
002591     MOVE 9                       TO 77-AUX.                      142400      
002592     PERFORM 9500-END-TRANSACTION.                                142500      
002593                                                                  142600      
002594*                                                                 142605      
002595 5505-GRABA-SALDOS-SUC-ANT.                                       142610      
002596*--------------------------                                       142615      
002597                                                                  142620      
002598     MOVE ANT-SUC-CVES            TO UNI-SUC-CVES.                142625      
002599     MOVE ANT-SUC-SIST            TO UNI-SUC-SIST.                142630      
002600     MOVE ANT-SUC-SUCU            TO UNI-SUC-SUCU.                142635      
002601     MOVE ANT-SUC-MON             TO UNI-SUC-MON.                 142640      
002602     MOVE ANT-SUC-SANT            TO UNI-SUC-SANT.                142645      
002603     MOVE ANT-SUC-SACT            TO UNI-SUC-SACT.                142650      
002604     MOVE ANT-SUC-FECH            TO UNI-SUC-FECH.                142655      
002605     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   142660      
002606                                                                  142665      
002607*                                                                 142700      
002608 5510-SUCURSALES-ANT.                                             142800      
002609*--------------------                                             142900      
002610                                                                  143000      
002611     MOVE ANT-SUC-MON            TO B02-SUC-MONEDA.               143100      
002612     MOVE ANT-SUC-SUCU           TO B02-SUC-NUMERO.               143200      
002613     IF ANT-SUC-SIST = 66                                         143300      
002614        MOVE ANT-SUC-SIST        TO B02-SUC-SISTEMA(10)           143400      
002615        COMPUTE B02-SUC-ACTUAL (10) =                             143500      
002616                ANT-SUC-SACT / WS-FACTOR-NVOPSO                   143600      
002617        COMPUTE B02-SUC-ANTES (10) =                              143700      
002618                ANT-SUC-SANT / WS-FACTOR-NVOPSO                   143800      
002619     ELSE                                                         143900      
002620     IF ANT-SUC-SIST = 500                                        144000      
002621        MOVE ANT-SUC-SIST        TO B02-SUC-SISTEMA(11)           144100      
002622        COMPUTE B02-SUC-ACTUAL (11) =                             144200      
002623                ANT-SUC-SACT / WS-FACTOR-NVOPSO                   144300      
002624        COMPUTE B02-SUC-ANTES (11) =                              144400      
002625                ANT-SUC-SANT / WS-FACTOR-NVOPSO                   144500      
002626                                                                  144600      
002627     ELSE                                                         144700      
002628      MOVE ANT-SUC-SIST        TO B02-SUC-SISTEMA(I)              144800      
002629      COMPUTE B02-SUC-ACTUAL (I) = ANT-SUC-SACT / WS-FACTOR-NVOPSO144900      
002630      COMPUTE B02-SUC-ANTES (I) = ANT-SUC-SANT / WS-FACTOR-NVOPSO.145000      
002631                                                                  145100      
002632*                                                                 145200      
002633 5600-ACTUALIZO-GLO-ANT.                                          145300      
002634*-----------------------                                          145400      
002635                                                                  145500      
002636*ASM                                                              145510      
002637     PERFORM 5605-GRABA-SALDOS-GLO-ANT.                           145520      
002638                                                                  145560      
002639     LOCK B01SXCSI       AT B01-GLO-MONEDA = ANT-GLO-MON AND      145600      
002640                            B01-GLO-CSI    = 77-CSI               145700      
002641          ON EXCEPTION                                            145800      
002642             IF  DMSTATUS(NOTFOUND)                               145900      
002643                 CREATE S151B01SDOGLOB                            146000      
002644             ELSE                                                 146100      
002645                 MOVE 15          TO 77-AUX                       146200      
002646                 PERFORM 8000-BD-ERROR.                           146300      
002647                                                                  146400      
002648     PERFORM 5610-GLOBALES-ANT.                                   146500      
002649                                                                  146600      
002650     MOVE ZEROES                  TO 77-AUX.                      146700      
002651     MOVE 10                      TO 77-AUX.                      146800      
002652     PERFORM 9000-BEGIN-TRANSACTION                               146900      
002653     MOVE 11                      TO 77-AUX.                      147000      
002654     PERFORM 9400-STORE-GLO                                       147100      
002655     MOVE 12                      TO 77-AUX.                      147200      
002656     PERFORM 9500-END-TRANSACTION.                                147300      
002657                                                                  147400      
002658*                                                                 147405      
002659 5605-GRABA-SALDOS-GLO-ANT.                                       147410      
002660*--------------------------                                       147415      
002661                                                                  147420      
002662     MOVE ANT-GLO-CVES            TO UNI-GLO-CVES.                147425      
002663     MOVE ANT-GLO-SIST            TO UNI-GLO-SIST.                147430      
002664     MOVE ANT-GLO-MON             TO UNI-GLO-MON.                 147435      
002665     MOVE ANT-GLO-SANT            TO UNI-GLO-SANT.                147440      
002666     MOVE ANT-GLO-SACT            TO UNI-GLO-SACT.                147445      
002667     MOVE ANT-GLO-FECH            TO UNI-GLO-FECH.                147450      
002668     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   147455      
002669                                                                  147460      
002670*                                                                 147500      
002671 5610-GLOBALES-ANT.                                               147600      
002672*------------------                                               147700      
002673                                                                  147800      
002674     MOVE 77-CSI                 TO B01-GLO-CSI                   147900      
002675                                    TES-GLO-CSI.                  148000      
002676     MOVE ANT-GLO-MON            TO B01-GLO-MONEDA                148100      
002677                                    TES-GLO-MON                   148200      
002678     IF ANT-GLO-SIST = 66                                         148300      
002679        MOVE ANT-GLO-SIST        TO B01-GLO-SISTEMA(10)           148400      
002680                                    TES-GLO-SIST                  148500      
002681        COMPUTE B01-GLO-ACTUAL (10) =                             148600      
002682                ANT-GLO-SACT / WS-FACTOR-NVOPSO                   148700      
002683        COMPUTE B01-GLO-ANTES (10) =                              148800      
002684                ANT-GLO-SANT / WS-FACTOR-NVOPSO                   148900      
002685     ELSE                                                         149000      
002686     IF ANT-GLO-SIST = 500                                        149100      
002687        MOVE ANT-GLO-SIST        TO B01-GLO-SISTEMA(11)           149200      
002688                                    TES-GLO-SIST                  149300      
002689        COMPUTE B01-GLO-ACTUAL (11) =                             149400      
002690                ANT-GLO-SACT / WS-FACTOR-NVOPSO                   149500      
002691        COMPUTE B01-GLO-ANTES (11) =                              149600      
002692                ANT-GLO-SANT / WS-FACTOR-NVOPSO                   149700      
002693     ELSE                                                         149800      
002694        MOVE ANT-GLO-SIST        TO B01-GLO-SISTEMA(I)            149900      
002695                                    TES-GLO-SIST                  150000      
002696        COMPUTE B01-GLO-ACTUAL (I) =                              150100      
002697                ANT-GLO-SACT / WS-FACTOR-NVOPSO                   150200      
002698        COMPUTE B01-GLO-ANTES (I) =                               150300      
002699                ANT-GLO-SANT / WS-FACTOR-NVOPSO.                  150400      
002700                                                                  150500      
002701     MOVE ANT-GLO-SACT            TO TES-GLO-SACT                 150600      
002702     MOVE ANT-GLO-SANT            TO TES-GLO-SANT                 150700      
002703*    MOVE ANT-GLO-FECH            TO TES-GLO-FECHA.               150800      
002704*INICIA CODIGO PARA PUENTE CRONOS 2000                            150801      
002705$SET OMIT = OLDCODE                                               150802      
002706     MOVE ANT-GLO-FECH            TO TES-GLO-FECHA.               150803      
002707$POP OMIT                                                         150804      
002708$SET OMIT = NOT OLDCODE                                           150805      
002709     MOVE ZEROS TO A2K-FEC-AMD-001                                150806      
002710     MOVE ANT-GLO-FECH   TO  A2K-FEC-AMD-001                      150807      
002711     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            150808      
002712             A2K-CONV-AMD-TO-CAMD-EXIT                            150809      
002713     MOVE A2K-FEC-CAMD-001         TO TES-GLO-FECHA.              150810      
002714$POP OMIT                                                         150811      
002715*TERMINA CODIGO PARA PUENTE CRONOS 2000                           150812      
002716     WRITE REG-TESORERIA FROM W-REG-GLOBALES-TESORERIA.           150900      
002717                                                                  151000      
002718                                                                  151100      
002719                                                                  151200      
002720*                                                                 151300      
002721 5700-CHECO-REGISTROS-ANT.                                        151400      
002722*-------------------------                                        151500      
002723                                                                  151600      
002724*ASM                                                              151620      
002725     PERFORM 5710-GRABA-TR-SALDOS-ANT.                            151640      
002726                                                                  151660      
002727     IF  RLEI-TAB(I) = ANT-TRA-REG                                151700      
002728         NEXT SENTENCE                                            151800      
002729     ELSE                                                         151900      
002730       MOVE SPACES      TO  WLI-ENCAB-52, TEXTO-LJ                151951      
002731       MOVE "E"         TO  TIPO-LJ                               152000      
002732       MOVE 010105      TO  CODIGO-LJ                             152100      
002733       MOVE ANT-TRA-REG TO  W77-SDO-TRA-REG                       152200      
002734       MOVE RLEI-TAB(I) TO  W77-RLEI-TAB                          152300      
002735       STRING  "  NO CHECAN LOS REGISTROS DEL  SISTEMA  ",        152400      
002736               "  REGISTROS ARCHIVO ", W77-SDO-TRA-REG, " ",      152500      
002737               "  REGISTROS TABLA   ", W77-RLEI-TAB , " ",        152600      
002738               " " , W-ETIQ-SALDOS , " " ,                        152700      
002739               "  ** REINICIAR EL PROCESO  **"                    152800      
002740               DELIMITED BY SIZE INTO TEXTO-LJ                    152900      
002741       MOVE TIPO-LJ        TO      WLI-TIPO-LJ                    152951      
002742       MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                   152971      
002743       PERFORM  000-030-IMPRIME-MENSAJE                           152991      
002744       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        153000      
002745       SET MYSELF(STATUS) TO -1.                                  153100      
002746*                                                                 153200      
002747 5710-GRABA-TR-SALDOS-ANT.                                        153210      
002748*-------------------------                                        153220      
002749                                                                  153230      
002750     MOVE ANT-TRA-CVES            TO UNI-TRA-CVES.                153240      
002751     MOVE ANT-TRA-SIST            TO UNI-TRA-SIST.                153250      
002752     MOVE ANT-TRA-REG             TO UNI-TRA-REG.                 153260      
002753     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   153270      
002754                                                                  153280      
002755 5900-LEE-SALDOS-ANT.                                             153300      
002756*-----------------                                                153400      
002757                                                                  153500      
002758                                                                  153600      
002759                                                                  153700      
002760     READ SALDOS INTO W-REG-SALDOS-ANT                            153800      
002761                      AT END                                      153900      
002762                           MOVE 1 TO 77-EOF-SDOS.                 154000      
002763                                                                  154100      
002764     IF  77-EOF-SDOS = 1                                          154200      
002765         NEXT SENTENCE                                            154300      
002766     ELSE                                                         154400      
002767         IF  ANT-CTE-CVES > 0                                     154500      
002768             ADD 1                TO RLEI-TAB(I).                 154600      
002769*                                                                 154700      
002770 6000-BARRE-SALDOS-NVO.                                           154800      
002771*----------------------                                           154900      
002772                                                                  155000      
002773     PERFORM 6900-LEE-SALDOS-NVO.                                 155100      
002774                                                                  155200      
002775     IF  77-EOF-SDOS = 1                                          155300      
002776         MOVE "ARCHIVO PROCESADO OK "                             155400      
002777                                  TO RLEY-TAB(I)                  155500      
002778         PERFORM 6350-GRABA-ARRIBO-NVO                            155600      
002779     ELSE                                                         155700      
002780     IF  NVO-CTE-CVES = 10                                        155800      
002781         PERFORM 6400-ACTUALIZO-CTES-NVO                          155900      
002782     ELSE                                                         156000      
002783     IF  NVO-SUC-CVES = 20                                        156100      
002784         PERFORM 6500-ACTUALIZO-SUC-NVO                           156200      
002785     ELSE                                                         156300      
002786     IF  NVO-GLO-CVES = 30                                        156400      
002787         PERFORM 6600-ACTUALIZO-GLO-NVO                           156500      
002788     ELSE                                                         156600      
002789     IF  NVO-SAR-CVES = 40                                        156700      
002790         PERFORM 6650-ACTUALIZO-SAR-NVO                           156800      
002791     ELSE                                                         156900      
002792     IF  NVO-ANT-CVES = 50                                        157000      
002793         PERFORM 6670-ACTUALIZO-SDOANT-NVO                        157100      
002794     ELSE                                                         157200      
002795     IF  NVO-ANT-CVES = 60                                        157300      
002796         PERFORM 6700-ACTUALIZO-CANFECHVAL                        157400      
002797     ELSE                                                         157500      
002798     IF  NVO-TRA-CVES = 90                                        157600      
002799         PERFORM 6800-CHECO-REGISTROS-NVO.                        157700      
002800                                                                  157800      
002801*                                                                 157900      
002802 6350-GRABA-ARRIBO-NVO.                                           158000      
002803*----------------------                                           158100      
002804                                                                  158200      
002805     LOCK S151BD02ADSALDO                                         158300      
002806          ON EXCEPTION                                            158400      
002807            IF  DMSTATUS(NOTFOUND)                                158500      
002808               MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ   158551      
002809               MOVE "E"         TO  TIPO-LJ                       158600      
002810               MOVE 010105      TO  CODIGO-LJ                     158700      
002811               MOVE "NO PUDE REGRESAR AL REG/FECHA "              158800      
002812                                TO TEXTO-LJ                       158900      
002813               MOVE TIPO-LJ        TO      WLI-TIPO-LJ            158951      
002814               MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ           158971      
002815               PERFORM  000-030-IMPRIME-MENSAJE                   158991      
002816             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  159000      
002817             SET MYSELF(STATUS) TO -1.                            159100      
002818                                                                  159200      
002819     PERFORM 6355-CARGA-ARRIBO-NVO                                159300      
002820             VARYING K FROM 1 BY 1 UNTIL K > 20.                  159400      
002821                                                                  159500      
002822     MOVE ZEROES                  TO 77-AUX.                      159600      
002823     MOVE 1                       TO 77-AUX.                      159700      
002824     PERFORM 9000-BEGIN-TRANSACTION                               159800      
002825     MOVE 2                       TO 77-AUX.                      159900      
002826     PERFORM 9100-STORE-CTR                                       160000      
002827     MOVE 3                       TO 77-AUX.                      160100      
002828     PERFORM 9500-END-TRANSACTION.                                160200      
002829                                                                  160300      
002830*                                                                 160400      
002831 6355-CARGA-ARRIBO-NVO.                                           160500      
002832*----------------------                                           160600      
002833                                                                  160700      
002834     IF  K > 20                                                   160800      
002835         NEXT SENTENCE                                            160900      
002836     ELSE                                                         161000      
002837         IF  B92-CTR-ARRIBO(K) = 0                                161100      
002838             MOVE TAB-SIST (I)    TO B92-CTR-ARRIBO(K)            161200      
002839             MOVE 21              TO K.                           161300      
002840*                                                                 161400      
002841 6400-ACTUALIZO-CTES-NVO.                                         161500      
002842*------------------------                                         161600      
002843                                                                  161700      
002844*ASM                                                              161710      
002845     PERFORM 6405-GRABA-SALDOS-CTES-NVO.                          161720      
002846                                                                  161760      
002847     MOVE ZEROES                  TO LLAVE-CTE.                   161800      
002848     MOVE NVO-CTE-CTAS            TO LLAVE-CTE.                   161900      
002849     LOCK B03SXCTE      AT B03-CTE-MONEDA    = NVO-CTE-MON  AND   162000      
002850                           B03-CTE-SUCURSAL  = NVO-CTE-SUC  AND   162100      
002851                           B03-CTE-SISTEMA   = NVO-CTE-SIST AND   162200      
002852                           B03-CTE-NUMERO1   = LLAVE-CTE1   AND   162300      
002853                           B03-CTE-NUMERO2   = LLAVE-CTE2         162400      
002854          ON EXCEPTION                                            162500      
002855             IF  DMSTATUS(NOTFOUND)                               162600      
002856                 CREATE S151B03SDOCTE                             162700      
002857             ELSE                                                 162800      
002858                 MOVE 13          TO 77-AUX                       162900      
002859                 PERFORM 8000-BD-ERROR.                           163000      
002860                                                                  163100      
002861     PERFORM 6410-CLIENTES-NVO.                                   163200      
002862                                                                  163300      
002863     MOVE ZEROES                  TO 77-AUX.                      163400      
002864     MOVE 4                       TO 77-AUX.                      163500      
002865     PERFORM 9000-BEGIN-TRANSACTION                               163600      
002866     MOVE 5                       TO 77-AUX.                      163700      
002867     PERFORM 9200-STORE-CTE                                       163800      
002868     MOVE 6                       TO 77-AUX.                      163900      
002869     PERFORM 9500-END-TRANSACTION.                                164000      
002870                                                                  164100      
002871*                                                                 164105      
002872 6405-GRABA-SALDOS-CTES-NVO.                                      164110      
002873*---------------------------                                      164115      
002874                                                                  164120      
002875     MOVE NVO-CTE-CVES            TO UNI-CTE-CVES.                164125      
002876     MOVE NVO-CTE-SIST            TO UNI-CTE-SIST.                164130      
002877     MOVE NVO-CTE-SUC             TO UNI-CTE-SUC.                 164135      
002878     MOVE NVO-CTE-MON             TO UNI-CTE-MON.                 164140      
002879     MOVE NVO-CTE-CTAS            TO UNI-CTE-CTAS.                164145      
002880     MOVE NVO-CTE-INST            TO UNI-CTE-INST.                164150      
002881     MOVE NVO-CTE-SEXP            TO UNI-CTE-SEXP.                164155      
002882     MOVE NVO-CTE-NOMB            TO UNI-CTE-NOMB.                164160      
002883     MOVE NVO-CTE-SANT            TO UNI-CTE-SANT.                164165      
002884     MOVE NVO-CTE-SACT            TO UNI-CTE-SACT.                164170      
002885     MOVE NVO-CTE-FECH            TO UNI-CTE-FECH.                164175      
002886     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   164180      
002887                                                                  164185      
002888*                                                                 164200      
002889 6410-CLIENTES-NVO.                                               164300      
002890*------------------                                               164400      
002891                                                                  164500      
002892     MOVE NVO-CTE-SIST            TO B03-CTE-SISTEMA.             164600      
002893     MOVE NVO-CTE-MON             TO B03-CTE-MONEDA.              164700      
002894     MOVE NVO-CTE-SUC             TO B03-CTE-SUCURSAL.            164800      
002895     MOVE LLAVE-CTE1              TO B03-CTE-NUMERO1.             164900      
002896     MOVE LLAVE-CTE2              TO B03-CTE-NUMERO2.             165000      
002897     MOVE NVO-CTE-INST            TO B03-CTE-INST.                165100      
002898     IF  NVO-CTE-SIST = 264                                       165200      
002899         MOVE NVO-CTE-SEXP        TO B03-CTE-SUCEXP               165300      
002900*        MOVE NVO-CTE-FECH        TO B03-CTE-FECHA                165400      
002901*INICIA CODIGO PARA PUENTE CRONOS 2000                            165401      
002902$SET OMIT = OLDCODE                                               165402      
002903     MOVE NVO-CTE-FECH        TO B03-CTE-FECHA                    165403      
002904$POP OMIT                                                         165404      
002905$SET OMIT = NOT OLDCODE                                           165405      
002906     MOVE ZEROS TO A2K-FEC-AMD-001                                165406      
002907     MOVE NVO-CTE-FECH  TO  A2K-FEC-AMD-001                       165407      
002908     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            165408      
002909             A2K-CONV-AMD-TO-CAMD-EXIT                            165409      
002910     MOVE A2K-FEC-CAMD-001  TO B03-CTE-FECHA                      165410      
002911$POP OMIT                                                         165411      
002912*TERMINA CODIGO PARA PUENTE CRONOS 2000                           165412      
002913     ELSE                                                         165500      
002914         MOVE ZEROES              TO B03-CTE-SUCEXP               165600      
002915                                     B03-CTE-FECHA.               165700      
002916     MOVE NVO-CTE-NOMB            TO B03-CTE-NOMBRE.              165800      
002917     COMPUTE B03-CTE-ANTES = NVO-CTE-SANT / WS-FACTOR-NVOPSO.     165900      
002918     COMPUTE B03-CTE-ACTUAL = NVO-CTE-SACT / WS-FACTOR-NVOPSO.    166000      
002919                                                                  166100      
002920*                                                                 166200      
002921 6500-ACTUALIZO-SUC-NVO.                                          166300      
002922*-----------------------                                          166400      
002923                                                                  166500      
002924*ASM                                                              166501      
002925     PERFORM 6505-GRABA-SALDOS-SUC-NVO.                           166502      
002926                                                                  166560      
002927     LOCK B02SXSUC      AT B02-SUC-MONEDA = NVO-SUC-MON  AND      166600      
002928                           B02-SUC-NUMERO = NVO-SUC-SUCU          166700      
002929          ON EXCEPTION                                            166800      
002930             IF  DMSTATUS(NOTFOUND)                               166900      
002931                 CREATE S151B02SDOSUC                             167000      
002932             ELSE                                                 167100      
002933                 MOVE 14          TO 77-AUX                       167200      
002934                 PERFORM 8000-BD-ERROR.                           167300      
002935                                                                  167400      
002936     PERFORM 6510-SUCURSALES-NVO.                                 167500      
002937                                                                  167600      
002938     MOVE ZEROES                  TO 77-AUX.                      167700      
002939     MOVE 7                       TO 77-AUX.                      167800      
002940     PERFORM 9000-BEGIN-TRANSACTION                               167900      
002941     MOVE 8                       TO 77-AUX.                      168000      
002942     PERFORM 9300-STORE-SUC                                       168100      
002943     MOVE 9                       TO 77-AUX.                      168200      
002944     PERFORM 9500-END-TRANSACTION.                                168300      
002945                                                                  168400      
002946*                                                                 168405      
002947 6505-GRABA-SALDOS-SUC-NVO.                                       168410      
002948*--------------------------                                       168415      
002949                                                                  168420      
002950     MOVE NVO-SUC-CVES            TO UNI-SUC-CVES.                168425      
002951     MOVE NVO-SUC-SIST            TO UNI-SUC-SIST.                168430      
002952     MOVE NVO-SUC-SUCU            TO UNI-SUC-SUCU.                168435      
002953     MOVE NVO-SUC-MON             TO UNI-SUC-MON.                 168440      
002954     MOVE NVO-SUC-SANT            TO UNI-SUC-SANT.                168445      
002955     MOVE NVO-SUC-SACT            TO UNI-SUC-SACT.                168450      
002956     MOVE NVO-SUC-FECH            TO UNI-SUC-FECH.                168455      
002957     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   168460      
002958                                                                  168465      
002959*                                                                 168500      
002960 6510-SUCURSALES-NVO.                                             168600      
002961*--------------------                                             168700      
002962                                                                  168800      
002963     MOVE NVO-SUC-MON            TO B02-SUC-MONEDA.               168900      
002964     MOVE NVO-SUC-SUCU           TO B02-SUC-NUMERO.               169000      
002965     MOVE NVO-SUC-SIST           TO B02-SUC-SISTEMA(I)            169100      
002966     COMPUTE B02-SUC-ACTUAL (I) = NVO-SUC-SACT / WS-FACTOR-NVOPSO.169200      
002967     COMPUTE B02-SUC-ANTES (I) = NVO-SUC-SANT / WS-FACTOR-NVOPSO. 169300      
002968                                                                  169400      
002969*                                                                 169500      
002970 6600-ACTUALIZO-GLO-NVO.                                          169600      
002971*-----------------------                                          169700      
002972                                                                  169800      
002973*ASM                                                              169810      
002974     PERFORM 6605-GRABA-SALDOS-GLO-NVO.                           169820      
002975                                                                  169860      
002976     LOCK B01SXCSI       AT B01-GLO-MONEDA = NVO-GLO-MON AND      169900      
002977                            B01-GLO-CSI    = 77-CSI               170000      
002978          ON EXCEPTION                                            170100      
002979             IF  DMSTATUS(NOTFOUND)                               170200      
002980                 CREATE S151B01SDOGLOB                            170300      
002981             ELSE                                                 170400      
002982                 MOVE 15          TO 77-AUX                       170500      
002983                 PERFORM 8000-BD-ERROR.                           170600      
002984                                                                  170700      
002985     PERFORM 6610-GLOBALES-NVO.                                   170800      
002986                                                                  170900      
002987     MOVE ZEROES                  TO 77-AUX.                      171000      
002988     MOVE 10                      TO 77-AUX.                      171100      
002989     PERFORM 9000-BEGIN-TRANSACTION                               171200      
002990     MOVE 11                      TO 77-AUX.                      171300      
002991     PERFORM 9400-STORE-GLO                                       171400      
002992     MOVE 12                      TO 77-AUX.                      171500      
002993     PERFORM 9500-END-TRANSACTION.                                171600      
002994                                                                  171700      
002995*                                                                 171705      
002996 6605-GRABA-SALDOS-GLO-NVO.                                       171710      
002997*--------------------------                                       171715      
002998                                                                  171720      
002999     MOVE NVO-GLO-CVES            TO UNI-GLO-CVES.                171725      
003000     MOVE NVO-GLO-SIST            TO UNI-GLO-SIST.                171730      
003001     MOVE NVO-GLO-MON             TO UNI-GLO-MON.                 171735      
003002     MOVE NVO-GLO-SANT            TO UNI-GLO-SANT.                171740      
003003     MOVE NVO-GLO-SACT            TO UNI-GLO-SACT.                171745      
003004     MOVE NVO-GLO-FECH            TO UNI-GLO-FECH.                171750      
003005     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   171755      
003006                                                                  171760      
003007*                                                                 171800      
003008 6610-GLOBALES-NVO.                                               171900      
003009*------------------                                               172000      
003010                                                                  172100      
003011     MOVE 77-CSI                 TO B01-GLO-CSI.                  172200      
003012     MOVE NVO-GLO-MON            TO B01-GLO-MONEDA.               172300      
003013     MOVE NVO-GLO-SIST           TO B01-GLO-SISTEMA(I)            172400      
003014     COMPUTE B01-GLO-ACTUAL (I) = NVO-GLO-SACT / WS-FACTOR-NVOPSO.172500      
003015     COMPUTE B01-GLO-ANTES (I) = NVO-GLO-SANT / WS-FACTOR-NVOPSO. 172600      
003016                                                                  172700      
003017*                                                                 172800      
003018 6650-ACTUALIZO-SAR-NVO.                                          172900      
003019*-----------------------                                          173000      
003020                                                                  173100      
003021*ASM                                                              173110      
003022     PERFORM 6653-GRABA-SALDOS-SAR-NVO.                           173120      
003023                                                                  173160      
003024*    LOCK B10SXFECHVAL   AT B10-FVAL-CSI = 77-CSI                 173200      
003025*         ON EXCEPTION                                            173300      
003026*            IF  DMSTATUS(NOTFOUND)                               173400      
003027*                CREATE S151B10FECHVAL                            173500      
003028*            ELSE                                                 173600      
003029*                MOVE 16          TO 77-AUX                       173700      
003030*                PERFORM 8000-BD-ERROR.                           173800      
003031*                                                                 173900      
003032     PERFORM 6655-SAR-NVO.                                        174000      
003033                                                                  174100      
003034*    MOVE ZEROES                  TO 77-AUX.                      174200      
003035*    MOVE 17                      TO 77-AUX.                      174300      
003036*    PERFORM 9000-BEGIN-TRANSACTION                               174400      
003037*    MOVE 18                      TO 77-AUX.                      174500      
003038*    PERFORM 9400-STORE-GLO                                       174600      
003039*    MOVE 19                      TO 77-AUX.                      174700      
003040*    PERFORM 9500-END-TRANSACTION.                                174800      
003041*                                                                 174900      
003042*                                                                 175000      
003043  6653-GRABA-SALDOS-SAR-NVO.                                      175005      
003044*--------------------------                                       175010      
003045                                                                  175015      
003046     MOVE NVO-SAR-CVES            TO UNI-SAR-CVES.                175020      
003047     MOVE NVO-SAR-SIST            TO UNI-SAR-SIST.                175025      
003048     PERFORM 6654-CARGA-TAB-SAR                                   175030      
003049             VARYING L FROM 1 BY 1 UNTIL L > 5.                   175035      
003050     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   175037      
003051                                                                  175040      
003052*                                                                 175045      
003053 6654-CARGA-TAB-SAR.                                              175050      
003054*-------------------                                              175055      
003055                                                                  175060      
003056     MOVE NVO-SAR-FEC(I)          TO UNI-SAR-FEC(I).              175065      
003057     MOVE NVO-SAR-IMP(I)          TO UNI-SAR-IMP(I).              175070      
003058     MOVE NVO-SAR-NUM(I)          TO UNI-SAR-NUM(I).              175075      
003059                                                                  175085      
003060*                                                                 175095      
003061 6655-SAR-NVO.                                                    175100      
003062*-------------                                                    175200      
003063                                                                  175300      
003064*    MOVE 77-CSI                 TO B10-FVAL-CSI.                 175400      
003065*    MOVE NVO-SAR-FEC (2)        TO 77-FVAL-FECH1.                175500      
003066*INICIA CODIGO PARA PUENTE CRONOS 2000                            175501      
003067$SET OMIT = OLDCODE                                               175502      
003068     MOVE NVO-SAR-FEC (2)        TO 77-FVAL-FECH1.                175503      
003069$POP OMIT                                                         175504      
003070$SET OMIT = NOT OLDCODE                                           175505      
003071     MOVE ZEROS TO A2K-FEC-AMD-001                                175506      
003072     MOVE NVO-SAR-FEC (2)  TO  A2K-FEC-AMD-001                    175507      
003073     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            175508      
003074             A2K-CONV-AMD-TO-CAMD-EXIT                            175509      
003075     MOVE A2K-FEC-CAMD-001  TO 77-FVAL-FECH1.                     175510      
003076$POP OMIT                                                         175511      
003077*TERMINA CODIGO PARA PUENTE CRONOS 2000                           175512      
003078     MOVE NVO-SAR-IMP (2)        TO 77-FVAL-IMPO1.                175600      
003079*    MOVE NVO-SAR-FEC (3)        TO 77-FVAL-FECH2.                175700      
003080*INICIA CODIGO PARA PUENTE CRONOS 2000                            175701      
003081$SET OMIT = OLDCODE                                               175702      
003082     MOVE NVO-SAR-FEC (3)        TO 77-FVAL-FECH2.                175703      
003083$POP OMIT                                                         175704      
003084$SET OMIT = NOT OLDCODE                                           175705      
003085     MOVE ZEROS TO A2K-FEC-AMD-001                                175706      
003086     MOVE NVO-SAR-FEC (3) TO  A2K-FEC-AMD-001                     175707      
003087     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            175708      
003088             A2K-CONV-AMD-TO-CAMD-EXIT                            175709      
003089     MOVE A2K-FEC-CAMD-001  TO 77-FVAL-FECH2.                     175710      
003090$POP OMIT                                                         175711      
003091*TERMINA CODIGO PARA PUENTE CRONOS 2000                           175712      
003092     MOVE NVO-SAR-IMP (3)        TO 77-FVAL-IMPO2.                175800      
003093*    MOVE NVO-SAR-FEC (4)        TO 77-FVAL-FECH3.                175900      
003094*INICIA CODIGO PARA PUENTE CRONOS 2000                            175901      
003095$SET OMIT = OLDCODE                                               175902      
003096     MOVE NVO-SAR-FEC (4)        TO 77-FVAL-FECH3.                175903      
003097$POP OMIT                                                         175904      
003098$SET OMIT = NOT OLDCODE                                           175905      
003099     MOVE ZEROS TO A2K-FEC-AMD-001                                175906      
003100     MOVE NVO-SAR-FEC (4) TO  A2K-FEC-AMD-001                     175907      
003101     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            175908      
003102             A2K-CONV-AMD-TO-CAMD-EXIT                            175909      
003103     MOVE A2K-FEC-CAMD-001  TO 77-FVAL-FECH3.                     175910      
003104$POP OMIT                                                         175911      
003105*TERMINA CODIGO PARA PUENTE CRONOS 2000                           175912      
003106     MOVE NVO-SAR-IMP (4)        TO 77-FVAL-IMPO3.                176000      
003107*                                                                 176100      
003108*                                                                 176200      
003109 6670-ACTUALIZO-SDOANT-NVO.                                       176300      
003110*--------------------------                                       176400      
003111                                                                  176500      
003112*ASM                                                              176510      
003113     PERFORM 6673-GRABA-SALDOS-SDOANT-NVO.                        176520      
003114                                                                  176560      
003115     LOCK B10SXFECHVAL   AT B10-FVAL-CSI = 77-CSI                 176600      
003116          ON EXCEPTION                                            176700      
003117             IF  DMSTATUS(NOTFOUND)                               176800      
003118                 CREATE S151B10FECHVAL                            176900      
003119             ELSE                                                 177000      
003120                 MOVE 16          TO 77-AUX                       177100      
003121                 PERFORM 8000-BD-ERROR.                           177200      
003122                                                                  177300      
003123     PERFORM 6675-SDOANT-NVO.                                     177400      
003124                                                                  177500      
003125     MOVE ZEROES                  TO 77-AUX.                      177600      
003126     MOVE 17                      TO 77-AUX.                      177700      
003127     PERFORM 9000-BEGIN-TRANSACTION                               177800      
003128     MOVE 18                      TO 77-AUX.                      177900      
003129     PERFORM 9410-STORE-FECHVAL                                   178000      
003130     MOVE 19                      TO 77-AUX.                      178100      
003131     PERFORM 9500-END-TRANSACTION.                                178200      
003132                                                                  178300      
003133*                                                                 178305      
003134 6673-GRABA-SALDOS-SDOANT-NVO.                                    178310      
003135*-----------------------------                                    178315      
003136                                                                  178320      
003137     MOVE NVO-ANT-CVES            TO UNI-ANT-CVES.                178325      
003138     MOVE NVO-ANT-SIST            TO UNI-ANT-SIST.                178330      
003139     MOVE NVO-ANT-NAPO            TO UNI-ANT-NAPO.                178335      
003140     MOVE NVO-ANT-APOR            TO UNI-ANT-APOR.                178340      
003141     MOVE NVO-ANT-NINS            TO UNI-ANT-NINS.                178345      
003142     MOVE NVO-ANT-INST            TO UNI-ANT-INST.                178350      
003143     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   178355      
003144                                                                  178360      
003145*                                                                 178400      
003146 6675-SDOANT-NVO.                                                 178500      
003147*----------------                                                 178600      
003148                                                                  178700      
003149     MOVE 77-CSI                  TO B10-FVAL-CSI.                178800      
003150     MOVE 77-FVAL-FECH1           TO B10-FVAL-FECH1.              178900      
003151     COMPUTE B10-FVAL-IMPO1 = 77-FVAL-IMPO1 / WS-FACTOR-NVOPSO.   179000      
003152     MOVE 77-FVAL-FECH2           TO B10-FVAL-FECH2.              179100      
003153     COMPUTE B10-FVAL-IMPO2 = 77-FVAL-IMPO2 / WS-FACTOR-NVOPSO.   179200      
003154     MOVE 77-FVAL-FECH3           TO B10-FVAL-FECH3.              179300      
003155     COMPUTE B10-FVAL-IMPO3 = 77-FVAL-IMPO3 / WS-FACTOR-NVOPSO.   179400      
003156     COMPUTE B10-CAPT-APORT = NVO-ANT-APOR / WS-FACTOR-NVOPSO.    179500      
003157     COMPUTE B10-CAPT-INST = NVO-ANT-INST / WS-FACTOR-NVOPSO.     179600      
003158                                                                  179700      
003159     MOVE ZEROES                  TO 77-FVAL-FECH1  77-FVAL-IMPO1 179800      
003160                                     77-FVAL-FECH2  77-FVAL-IMPO2 179900      
003161                                     77-FVAL-FECH3  77-FVAL-IMPO3.180000      
003162*                                                                 180100      
003163 6700-ACTUALIZO-CANFECHVAL.                                       180200      
003164*--------------------------                                       180300      
003165                                                                  180400      
003166*ASM                                                              180410      
003167     PERFORM 6703-GRABA-SALDOS-CANFECHVAL.                        180420      
003168                                                                  180460      
003169     LOCK B11SXCANFVAL   AT B11-CFVA-CSI = 77-CSI                 180500      
003170          ON EXCEPTION                                            180600      
003171             IF  DMSTATUS(NOTFOUND)                               180700      
003172                 CREATE S151B11CANFVAL                            180800      
003173             ELSE                                                 180900      
003174                 MOVE 16          TO 77-AUX                       181000      
003175                 PERFORM 8000-BD-ERROR.                           181100      
003176                                                                  181200      
003177     PERFORM 6710-CANFVAL.                                        181300      
003178                                                                  181400      
003179     MOVE ZEROES                  TO 77-AUX.                      181500      
003180     MOVE 17                      TO 77-AUX.                      181600      
003181     PERFORM 9000-BEGIN-TRANSACTION                               181700      
003182     MOVE 18                      TO 77-AUX.                      181800      
003183     PERFORM 9420-STORE-CANFECHVAL                                181900      
003184     MOVE 19                      TO 77-AUX.                      182000      
003185     PERFORM 9500-END-TRANSACTION.                                182100      
003186                                                                  182200      
003187 6703-GRABA-SALDOS-CANFECHVAL.                                    182205      
003188*-----------------------------                                    182210      
003189                                                                  182215      
003190     MOVE NVO-CAN-CVES            TO UNI-CAN-CVES.                182220      
003191     MOVE NVO-CAN-SIST            TO UNI-CAN-SIST.                182225      
003192     PERFORM 6704-CARGA-TAB-CANFECHVAL                            182230      
003193             VARYING L FROM 1 BY 1 UNTIL L > 5.                   182235      
003194     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   182240      
003195                                                                  182245      
003196*                                                                 182250      
003197 6704-CARGA-TAB-CANFECHVAL.                                       182255      
003198*--------------------------                                       182260      
003199                                                                  182265      
003200     MOVE NVO-CAN-FEC(I)          TO UNI-CAN-FEC(I).              182270      
003201     MOVE NVO-CAN-IMP(I)          TO UNI-CAN-IMP(I).              182275      
003202     MOVE NVO-CAN-NUM(I)          TO UNI-CAN-NUM(I).              182280      
003203*                                                                 182300      
003204 6710-CANFVAL.                                                    182400      
003205*-------------                                                    182500      
003206                                                                  182600      
003207     MOVE 77-CSI                 TO B11-CFVA-CSI.                 182700      
003208*    MOVE NVO-CAN-FEC (2)        TO B11-CFVA-FECH1.               182800      
003209*INICIA CODIGO PARA PUENTE CRONOS 2000                            182801      
003210$SET OMIT = OLDCODE                                               182802      
003211     MOVE NVO-CAN-FEC (2)        TO B11-CFVA-FECH1.               182803      
003212$POP OMIT                                                         182804      
003213$SET OMIT = NOT OLDCODE                                           182805      
003214     MOVE ZEROS TO A2K-FEC-AMD-001                                182806      
003215     MOVE NVO-CAN-FEC (2) TO  A2K-FEC-AMD-001                     182807      
003216     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            182808      
003217             A2K-CONV-AMD-TO-CAMD-EXIT                            182809      
003218     MOVE A2K-FEC-CAMD-001        TO B11-CFVA-FECH1.              182810      
003219$POP OMIT                                                         182811      
003220*TERMINA CODIGO PARA PUENTE CRONOS 2000                           182812      
003221     COMPUTE B11-CFVA-IMPO1 = NVO-CAN-IMP (2) / WS-FACTOR-NVOPSO. 182900      
003222*    MOVE NVO-CAN-FEC (3)        TO B11-CFVA-FECH2.               183000      
003223*INICIA CODIGO PARA PUENTE CRONOS 2000                            183001      
003224$SET OMIT = OLDCODE                                               183002      
003225     MOVE NVO-CAN-FEC (3)        TO B11-CFVA-FECH2.               183003      
003226$POP OMIT                                                         183004      
003227$SET OMIT = NOT OLDCODE                                           183005      
003228     MOVE ZEROS TO A2K-FEC-AMD-001                                183006      
003229     MOVE NVO-CAN-FEC (3) TO  A2K-FEC-AMD-001                     183007      
003230     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            183008      
003231             A2K-CONV-AMD-TO-CAMD-EXIT                            183009      
003232     MOVE A2K-FEC-CAMD-001        TO B11-CFVA-FECH2.              183010      
003233$POP OMIT                                                         183011      
003234*TERMINA CODIGO PARA PUENTE CRONOS 2000                           183012      
003235     COMPUTE B11-CFVA-IMPO2 = NVO-CAN-IMP (3) / WS-FACTOR-NVOPSO. 183100      
003236*    MOVE NVO-CAN-FEC (4)        TO B11-CFVA-FECH3.               183200      
003237*INICIA CODIGO PARA PUENTE CRONOS 2000                            183201      
003238$SET OMIT = OLDCODE                                               183202      
003239     MOVE NVO-CAN-FEC (4)        TO B11-CFVA-FECH3.               183203      
003240$POP OMIT                                                         183204      
003241$SET OMIT = NOT OLDCODE                                           183205      
003242     MOVE ZEROS TO A2K-FEC-AMD-001                                183206      
003243     MOVE NVO-CAN-FEC (4) TO  A2K-FEC-AMD-001                     183207      
003244     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            183208      
003245             A2K-CONV-AMD-TO-CAMD-EXIT                            183209      
003246     MOVE A2K-FEC-CAMD-001        TO B11-CFVA-FECH3.              183210      
003247$POP OMIT                                                         183211      
003248*TERMINA CODIGO PARA PUENTE CRONOS 2000                           183212      
003249     COMPUTE B11-CFVA-IMPO3 = NVO-CAN-IMP (4) / WS-FACTOR-NVOPSO. 183300      
003250                                                                  183400      
003251*                                                                 183500      
003252 6800-CHECO-REGISTROS-NVO.                                        183600      
003253*-------------------------                                        183700      
003254                                                                  183800      
003255*ASM                                                              183820      
003256     PERFORM 6810-GRABA-TR-SALDOS-NVO.                            183840      
003257                                                                  183860      
003258     IF  RLEI-TAB(I) = NVO-TRA-REG                                183900      
003259         NEXT SENTENCE                                            184000      
003260     ELSE                                                         184100      
003261        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          184151      
003262        MOVE "E"         TO  TIPO-LJ                              184200      
003263        MOVE 010105      TO  CODIGO-LJ                            184300      
003264        MOVE NVO-TRA-REG TO  W77-SDO-TRA-REG                      184400      
003265        MOVE RLEI-TAB(I) TO  W77-RLEI-TAB                         184500      
003266         STRING  "  NO CHECAN LOS REGISTROS DEL  SISTEMA "  ,     184600      
003267                 "  REGISTROS ARCHIVO " , W77-SDO-TRA-REG , " " , 184700      
003268                 "  REGISTROS TABLA   " , W77-RLEI-TAB , " " ,    184800      
003269                 "  ", W-ETIQ-SALDOS , " " ,                      184900      
003270                 " **  REINICIAR EL PROCESO  **"                  185000      
003271         DELIMITED BY SIZE INTO TEXTO-LJ                          185100      
003272         MOVE TIPO-LJ        TO      WLI-TIPO-LJ                  185151      
003273         MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                 185171      
003274         PERFORM  000-030-IMPRIME-MENSAJE                         185191      
003275         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ      185200      
003276         SET MYSELF(STATUS) TO -1.                                185300      
003277*                                                                 185400      
003278 6810-GRABA-TR-SALDOS-NVO.                                        185410      
003279*-------------------------                                        185420      
003280                                                                  185430      
003281     MOVE NVO-TRA-CVES            TO UNI-TRA-CVES.                185440      
003282     MOVE NVO-TRA-SIST            TO UNI-TRA-SIST.                185450      
003283     MOVE NVO-TRA-REG             TO UNI-TRA-REG.                 185460      
003284     WRITE REG-SDOS-SAL FROM W-REG-SDOS-NVOSAL.                   185470      
003285                                                                  185480      
003286 6900-LEE-SALDOS-NVO.                                             185500      
003287*--------------------                                             185600      
003288                                                                  185700      
003289                                                                  185800      
003290                                                                  185900      
003291     READ SALDOS INTO W-REG-SALDOS-NVO                            186000      
003292                      AT END                                      186100      
003293                           MOVE 1 TO 77-EOF-SDOS.                 186200      
003294                                                                  186300      
003295     IF  77-EOF-SDOS = 1                                          186400      
003296         NEXT SENTENCE                                            186500      
003297     ELSE                                                         186600      
003298         IF  NVO-CTE-CVES > 0                                     186700      
003299             ADD 1                TO RLEI-TAB(I).                 186800      
003300*                                                                 186900      
003301*INICIA CODIGO DE RENOVACION CRONOS 2000                          186901      
003302*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003303*   COPY "S151/CRONOS2K/CPY/PD".                                  186903      
003304** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
003305** Unisys has defined for CRONOS2K project                     ** 000200      
003306** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
003307***************************************************************** 000400      
003308***************************************************************** 000600      
003309** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
003310** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
003311** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
003312** date MMDDCCAA, which is returned into the variable          ** 001000      
003313** A2K-FEC-MDCA-001.                                           ** 001100      
003314***************************************************************** 001200      
003315                                                                  001300      
003316 A2K-ACCEPT-TODAYS-DATE.                                          001400      
003317        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
003318*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
003319        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
003320        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
003321        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
003322        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
003323        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
003324                                                                  002200      
003325 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
003326        EXIT.                                                     002240      
003327                                                                  002500      
003328****************************************************************  002600      
003329** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
003330**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
003331**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
003332**baseyear to add the century to the year part.               **  003000      
003333**INPUT is A2K-FEC-AMD-001                                    **  003100      
003334**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
003335****************************************************************  003300      
003336                                                                  003400      
003337 A2K-CONV-AMD-TO-CAMD.                                            003500      
003338         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
003339         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
003340         IF A2K-FEC-AMD-001 = 0                                   003720      
003341            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
003342         ELSE                                                     003741      
003343          IF A2K-FEC-AMD-001 = 999999                             003742      
003344             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
003345         ELSE                                                     003760      
003346         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
003347                 A2K-OBTAIN-CENTURY-EXIT                          003900      
003348         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
003349         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
003350         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
003351         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
003352                                                                  004400      
003353 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
003354         EXIT.                                                    004600      
003355                                                                  004700      
003356******************************************************************004800      
003357**A2K-CONV-MDA-TO-MDCA.                                         **004900      
003358**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
003359** an eight digit format as MMDDCCAA. It use a                  **005100      
003360** baseyear to add century to the yaer.                         **005200      
003361** INPUT is A2K-FEC-MDA-001                                     **005300      
003362** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
003363                                                                  005500      
003364 A2K-CONV-MDA-TO-MDCA.                                            005600      
003365     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
003366     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
003367     IF A2K-FEC-MDA-001 = 0                                       005820      
003368        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
003369     ELSE                                                         005845      
003370      IF A2K-FEC-MDA-001 = 999999                                 005850      
003371         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
003372     ELSE                                                         005860      
003373     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
003374             A2K-OBTAIN-CENTURY-EXIT                              006000      
003375     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
003376     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
003377     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
003378     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
003379                                                                  006500      
003380 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
003381     EXIT.                                                        006700      
003382                                                                  006800      
003383***************************************************************** 006900      
003384**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
003385**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
003386**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
003387**baseyear to add century to the year.                         ** 007300      
003388**INPUT is A2K-FEC-DMA-001                                     ** 007400      
003389**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
003390                                                                  007600      
003391 A2K-CONV-DMA-TO-DMCA.                                            007700      
003392       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
003393       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
003394       IF  A2K-FEC-DMA-001   = 0                                  007920      
003395          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
003396       ELSE                                                       007945      
003397        IF A2K-FEC-DMA-001 = 999999                               007950      
003398          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
003399       ELSE                                                       007960      
003400       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
003401               A2K-OBTAIN-CENTURY-EXIT                            008100      
003402       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
003403       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
003404       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
003405       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
003406                                                                  008600      
003407 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
003408       EXIT.                                                      008800      
003409                                                                  008900      
003410***************************************************************** 009000      
003411** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
003412** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
003413** a 6 digit format as AAMMDD.                                 ** 009300      
003414** It simply removes the century information in the output     ** 009400      
003415** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
003416** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
003417                                                                  009700      
003418 A2K-CONV-CAMD-TO-AMD.                                            009800      
003419     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
003420     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
003421     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
003422     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
003423                                                                  010300      
003424 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
003425      EXIT.                                                       010500      
003426                                                                  010600      
003427******************************************************************010700      
003428******************************************************************010800      
003429** A2K-CONV-MDCA-TO-MDA.                                        **010900      
003430** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
003431** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
003432** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
003433** INPUT is A2K-FEC-MDCA-001                                    **011300      
003434** OUTPUT is A2K-FEC-MDA-001                                    **011400      
003435                                                                  011500      
003436 A2K-CONV-MDCA-TO-MDA.                                            011600      
003437     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
003438     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
003439     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
003440     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
003441                                                                  012100      
003442 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
003443      EXIT.                                                       012300      
003444                                                                  012400      
003445******************************************************************012500      
003446***************************************************************** 012600      
003447** A2K-CONV-DMCA-TO-DMA.                                        **012700      
003448** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
003449** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
003450** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
003451** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
003452** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
003453                                                                  013300      
003454 A2K-CONV-DMCA-TO-DMA.                                            013400      
003455     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
003456     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
003457     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
003458     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
003459                                                                  013900      
003460 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
003461      EXIT.                                                       014100      
003462                                                                  014200      
003463***************************************************************** 014300      
003464 A2K-CONV-MDCA-TO-CAMD.                                           014400      
003465      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
003466      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
003467      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
003468      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
003469      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
003470 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
003471      EXIT.                                                       015100      
003472***************************************************************** 015200      
003473** This paragraph adds century to an year field which is 9(02) ** 015300      
003474** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
003475** Output is A2K-FEC-CCAA-001.                                 ** 015600      
003476***************************************************************** 015700      
003477 A2K-CONV-AA-TO-CCAA.                                             015800      
003478      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
003479      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
003480              A2K-OBTAIN-CENTURY-EXIT.                            016100      
003481      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
003482 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
003483      EXIT.                                                       016400      
003484***************************************************************** 016500      
003485** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
003486** format.                                                     ** 016700      
003487** Input is A2K-FEC-DMCA-001.                                  ** 016800      
003488** Output is A2K-FEC-CAMD-001.                                 ** 016900      
003489***************************************************************** 017000      
003490 A2K-CONV-DMCA-TO-CAMD.                                           017100      
003491      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
003492      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
003493      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
003494      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
003495      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
003496 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
003497      EXIT.                                                       017800      
003498***************************************************************** 017900      
003499** This paragraph desides the Century to be added depending    ** 018000      
003500** on the base year.                                           ** 018100      
003501** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
003502** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
003503***************************************************************** 018400      
003504 A2K-OBTAIN-CENTURY.                                              018500      
003505      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
003506          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
003507      ELSE                                                        018800      
003508          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
003509 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
003510      EXIT.                                                       019100      
003511                                                                  019200      
003512***************************************************************** 019300      
003513** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
003514**  Format                                                     ** 019500      
003515** Input Is A2K-FEC-CAMD-001                                   ** 019600      
003516** Output Is A2K-FEC-DMCA-001                                  ** 019700      
003517***************************************************************** 019800      
003518 A2K-CONV-CAMD-TO-DMCA.                                           019900      
003519      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
003520      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
003521      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
003522      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
003523      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
003524                                                                  020500      
003525 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
003526      EXIT.                                                       020700      
003527                                                                  020800      
003528******************************************************************020900      
003529******************************************************************021000      
003530 A2K-CONV-AM-TO-CAM.                                              021100      
003531      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
003532      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
003533      IF A2K-FEC-AM-001 = 0                                       021220      
003534         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
003535      ELSE                                                        021245      
003536      IF A2K-FEC-AM-001 = 9999                                    021250      
003537         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
003538      ELSE                                                        021260      
003539      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
003540      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
003541      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
003542              A2K-OBTAIN-CENTURY-EXIT                             021600      
003543      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
003544                                                                  021800      
003545 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
003546      EXIT.                                                       022000      
003547                                                                  022100      
003548******************************************************************022200      
003549******************************************************************022300      
003550 A2K-CONV-CAM-TO-AM.                                              022400      
003551      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
003552      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
003553      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
003554                                                                  022800      
003555 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
003556   EXIT.                                                          023000      
003557                                                                  023100      
003558                                                                  023200      
003559                                                                  023500      
003560*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003561 A2K-CPY-EXIT-PARA.                                               186904      
003562     EXIT.                                                        186905      
003563*TERMINA CODIGO DE RENOVACION CRONOS 2000                         186906      
003564*SAMG                                                             187000      
003565* INICIO ENVIO POR INTELAR                                        187010      
003566 300-DATOS-ENVI-INTELAR.                                          187020      
003567*======================                                           187030      
003568     UNSTRING W-ETIQ-SDOS-INT DELIMITED BY " "                    187040      
003569                          INTO WKS-INTE-ARCHIVO.                  187050      
003570     MOVE ZERO            TO W77-INTE-SNT.                        187060      
003571     PERFORM 350-ENVIO-POR-INTELAR.                               187070      
003572                                                                  187080      
003573 350-ENVIO-POR-INTELAR.                                           187090      
003574*======================                                           187100      
003575     CALL "INTELARSND IN ADMONXFERS" USING  WKS-INTE-ARCHIVO      187110      
003576                                     GIVING W77-INTE-SNT.         187120      
003577     IF W77-INTE-SNT NOT = 0                                      187130      
003578        MOVE "E"                       TO TIPO-LJ                 187140      
003579        MOVE 020901                    TO CODIGO-LJ               187150      
003580        MOVE W77-INTE-SNT              TO WKS-ERRNUM-INTELAR      187155      
003581        STRING "ERROR # " WKS-ERRALFA-INTELAR                     187160      
003582               " EN EL ENVIO POR INTELAR DEL ARCHIVO "            187165      
003583               WKS-INTE-ARCHIVO                                   187170      
003584        DELIMITED BY SIZE                                         187180      
003585        INTO TEXTO-LJ                                             187190      
003586        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      187200      
003587* FIN ENVIO POR INTELAR                                           187210      
003588 400-GRABA-REG-SDOS.                                              187300      
003589*====================                                             187400      
003590     IF  77-FORMATO = 3                                           187500      
003591         PERFORM 6000-BARRE-SALDOS-NVO                            187600      
003592                                     UNTIL 77-EOF-SDOS = 1        187700      
003593         MOVE ZEROES      TO 77-EOF-SDOS                          187800      
003594                             77-FORMATO                           187900      
003595         CLOSE SALDOS WITH SAVE                                   188000      
003596                                                                  188100      
003597          CLOSE SDOS-SAL WITH SAVE                                188200      
003598                                                                  188300      
003599          PERFORM 300-DATOS-ENVI-INTELAR                          188400      
003600*         UNSTRING W-ETIQ-SDOS-SAL DELIMITED BY "."               188405      
003601*                              INTO WKS-FILE-DEST                 188410      
003602*         UNSTRING W-ETIQ-SDOS-INT DELIMITED BY " "               188412      
003603*                              INTO WKS-FILE-ORI                  188414      
003604*         CALL SYSTEM WFL USING WKS-WFL-COPY                      188490      
003605     ELSE                                                         188500      
003606     IF  77-FORMATO = 2                                           188600      
003607         PERFORM 2300-BARRE-SALDOS UNTIL 77-EOF-SDOS = 1          188700      
003608         MOVE ZEROES      TO 77-EOF-SDOS                          188800      
003609                             77-FORMATO                           188900      
003610         CLOSE SALDOS WITH SAVE                                   189000      
003611                                                                  189100      
003612          CLOSE SDOS-SAL WITH SAVE                                189200      
003613                                                                  189300      
003614          PERFORM 300-DATOS-ENVI-INTELAR                          189400      
003615*         UNSTRING W-ETIQ-SDOS-SAL DELIMITED BY "."               189420      
003616*                              INTO WKS-FILE-DEST                 189440      
003617*         UNSTRING W-ETIQ-SDOS-INT DELIMITED BY " "               189450      
003618*                              INTO WKS-FILE-ORI                  189460      
003619*         CALL SYSTEM WFL USING WKS-WFL-COPY                      189490      
003620     ELSE                                                         189500      
003621         OPEN OUTPUT TESORERIA                                    189600      
003622         PERFORM 5000-BARRE-SALDOS-ANT                            189700      
003623                                     UNTIL 77-EOF-SDOS = 1        189800      
003624         MOVE ZEROES      TO 77-EOF-SDOS                          189900      
003625                             77-FORMATO                           190000      
003626         CLOSE TESORERIA WITH SAVE                                190100      
003627         CLOSE SALDOS    WITH SAVE                                190200      
003628                                                                  190300      
003629         CLOSE SDOS-SAL WITH SAVE                                 190400      
003630                                                                  190500      
003631         PERFORM 300-DATOS-ENVI-INTELAR                           190600      
003632*        UNSTRING W-ETIQ-SDOS-SAL DELIMITED BY "."                190620      
003633*                             INTO WKS-FILE-DEST                  190640      
003634*        UNSTRING W-ETIQ-SDOS-INT DELIMITED BY " "                190650      
003635*                             INTO WKS-FILE-ORI                   190660      
003636*        CALL SYSTEM WFL USING WKS-WFL-COPY                       190690      
003637         IF TAB-SIST(I) = 500                                     190700      
003638            MOVE "SALCTAM" TO W-WFL-TCP-FILEUNISYS                190800      
003639            MOVE "S500"    TO W-WFL-TCP-FILESERVER                190900      
003640            MOVE DD-BASE   TO W-WFL-TCP-FILESERVER-DIA            191000      
003641            MOVE MM-BASE   TO W-WFL-TCP-FILESERVER-MES.           191100      
