000001$SET LINEINFO OPTIMIZE LIST                                       000100      
000002*$SET TADS                                                        000200      
000003 IDENTIFICATION DIVISION.                                         000300      
000004***************************************************************** 000400      
000005*   FUNCION : DEPURA LAS B05 DE CONTROL CREADAS EN EL LOTE        000500      
000006*             PARA ALTA DISPONIBILIDAD                            000600      
000007*   ENTRADA : SISTEMA(3), FECHA(8), NUMERO PROCESO(3), REGINI(2)  000700      
000008***************************************************************** 000800      
000009 PROGRAM-ID.             DEPURACTL.                               000900      
000010 AUTHOR. HUGO ENRIQUE SANCHEZ CARDONA.                            001000      
000011 ENVIRONMENT DIVISION.                                            001100      
000012                                                                  001200      
000013 DATA        DIVISION.                                            001300      
000014                                                                  001400      
000015 DATA-BASE SECTION.                                               001500      
000016   DB S151BD99CONTROL.                                            001600      
000017                                                                  001700      
000018 WORKING-STORAGE SECTION.                                         001800      
000019                                                                  001900      
000020*================================================================ 002000      
000021*         COPY A LOS FORMATOS DE LLAMADO PARA LIB. DE CONTROL   = 002100      
000022*================================================================ 002200      
000023                                                                  002300      
000024*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000025* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL.".                  002400      
000026*================================================================ 000100      
000027*         ENTRY-POINT CONSISDIA :                               = 000200      
000028*                                                                 000300      
000029* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000030* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000031* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000032* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000033* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000034* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000035* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000036* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000037* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000038* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000039*                                                               = 001400      
000040*================================================================ 001500      
000041                                                                  001600      
000042                                                                  001700      
000043*================================================================ 001800      
000044* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000045*                                                               = 002000      
000046* ENTRADA REQUERIDA :                                           = 002100      
000047*                                                               = 002200      
000048*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000049*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000050*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000051*================================================================ 002600      
000052 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000053    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000054    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000055    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000056    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000057    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000058    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000059    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000060    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000061    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000062    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000063    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000064    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000065    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000066    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000067    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000068    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000069    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000070    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000071    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000072    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000073       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000074       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000075       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000076       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000077*==============================================================   005200      
000078*                                                             =   005300      
000079* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000080*                                                             =   005500      
000081* CAMPOS REQUERIDOS :                                         =   005600      
000082*                                                             =   005700      
000083* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000084* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000085* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000086* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000087*==============================================================   006200      
000088 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000089    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000090    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000091    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000092    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000093                                                                  006800      
000094*==============================================================   006900      
000095*                                                             =   007000      
000096* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000097*                                                             =   007200      
000098* CAMPOS REQUERIDOS :                                         =   007300      
000099*                                                             =   007400      
000100* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000101* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000102* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000103* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000104*==============================================================   007900      
000105 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000106    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000107    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000108    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000109    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000110                                                                  008500      
000111*==============================================================   008600      
000112*                                                             =   008700      
000113* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000114*                                                             =   008900      
000115* CAMPOS REQUERIDOS :                                         =   009000      
000116*                                                             =   009100      
000117* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000118* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000119* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000120* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000121*==============================================================   009600      
000122 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000123    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000124    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000125    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000126    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000127                                                                  010200      
000128*============================================================     010300      
000129* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000130*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000131*                                                           =     010600      
000132*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000133*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000134*                                                           =     010900      
000135*  ENTRADA REQUERIDA.                                       =     011000      
000136*                                                           =     011100      
000137*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000138*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000139*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000140*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000141*============================================================     011600      
000142                                                                  011700      
000143 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000144     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000145     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000146     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000147     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000148                                                                  012300      
000149*=============================================================    012400      
000150*                                                            =    012500      
000151* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000152*             B01-SIS-FECARMOV.                              =    012700      
000153*                                                            =    012800      
000154* ENTRADA REQUERIDAD :                                       =    012900      
000155*                                                            =    013000      
000156*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000157*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000158*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000159*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000160*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000161*=============================================================    013600      
000162                                                                  013700      
000163 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000164     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000165     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000166     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000167     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000168     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000169*================================================================ 014400      
000170*                                                               = 014500      
000171* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000172*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000173*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000174*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000175*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000176*                                                               = 015100      
000177* ENTRADA REQUERIDA :                                           = 015200      
000178*                                                               = 015300      
000179* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000180* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000181* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000182* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000183* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000184*================================================================ 015900      
000185 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000186    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000187    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000188    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000189    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000190    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000191                                                                  016600      
000192*============================================================     016700      
000193*                                                           =     016800      
000194* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000195*                                                           =     017000      
000196* DATOS REQUERIDOS :                                        =     017100      
000197*                                                           =     017200      
000198* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000199* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000200* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000201* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000202* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000203*============================================================     017800      
000204                                                                  017900      
000205 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000206     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000207     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000208     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000209     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000210     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000211                                                                  018600      
000212*============================================================     018700      
000213*                                                           =     018800      
000214* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000215*                                                           =     019000      
000216* DATOS REQUERIDOS :                                        =     019100      
000217*                                                           =     019200      
000218* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000219* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000220* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000221* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000222* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000223*============================================================     019800      
000224                                                                  019900      
000225 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000226     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000227     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000228     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000229     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000230     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000231                                                                  020600      
000232*===============================================================  020700      
000233*                                                              =  020800      
000234* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000235*              MOVIMIENTOS.                                    =  021000      
000236* DATOS REQUERIDOS :                                           =  021100      
000237*                                                              =  021200      
000238* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000239* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000240* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000241* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000242* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000243* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000244*==============================================================   021900      
000245                                                                  022000      
000246 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000247     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000248     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000249     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000250     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000251     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000252     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000253*==============================================================   022800      
000254*                                                             =   022900      
000255* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000256*                                                             =   023100      
000257* CAMPOS REQUERIDOS :                                         =   023200      
000258*                                                             =   023300      
000259* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000260* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000261* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000262* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000263*==============================================================   023800      
000264 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000265    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000266    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000267    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000268    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000269                                                                  024304      
000270*=================================================================024306      
000271*                ENTRY POINT CONSISB01                           =024308      
000272*                                                                =024310      
000273*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000274*                                                                =024314      
000275*  FUNCIONES DISPONIBLES :                                       =024316      
000276*                                                                =024318      
000277*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000278*                                                                =024322      
000279*  PARAMETROS REQUERIDOS                                         =024324      
000280*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000281*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000282*=================================================================024330      
000283                                                                  024332      
000284 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000285     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000286     03 WKS-CON-CSI                PIC 9(02).                     024336      
000287     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000288     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000289        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000290        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000291        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000292        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000293        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000294                                                                  024400      
000295*=================================================================024500      
000296*                ENTRY POINT B02ARCINTER                         =024600      
000297*                                                                =024700      
000298*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000299*                                                                =024900      
000300*  FUNCIONES DISPONIBLES :                                       =025000      
000301*                                                                =025100      
000302*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000303* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000304* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000305* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000306*                                                                =025600      
000307*  PARAMETROS REQUERIDOS                                         =025700      
000308*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000309*                                                                =025900      
000310*=================================================================026000      
000311 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000312     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000313     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000314     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000315     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000316     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000317     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000318     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000319     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000320     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000321     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000322     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000323     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000324     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000325     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000326     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000327     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000328     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000329     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000330     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000331     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000332     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000333     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000334     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000335     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000336     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000337     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000338     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000339     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000340                                                                  029000      
000341*=================================================================029100      
000342*                ENTRY POINT B04SISTEMA                          =029200      
000343*                                                                =029300      
000344*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000345*                                                                =029500      
000346*  FUNCIONES DISPONIBLES :                                       =029600      
000347*                                                                =029700      
000348*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000349*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000350*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000351*                                                                =030100      
000352*  PARAMETROS REQUERIDOS                                         =030200      
000353*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000354*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000355*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000356*                                                                =030600      
000357*=================================================================030700      
000358 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000359     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000360     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000361     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000362     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000363     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000364     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000365     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000366                                                                  031600      
000367*================================================================ 031700      
000368*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000369*                                                               = 031900      
000370*  FUNCION                                                      = 032000      
000371*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000372*   19       ALTAS.                                             = 032200      
000373*   22       BAJAS                                              = 032300      
000374*   37       CAMBIOS.                                           = 032400      
000375*                                                               = 032500      
000376*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000377*                      FECHA DE PROCESO                         = 032700      
000378*                      NUMERO DE PROCESO                        = 032800      
000379*                      FECHA INICIO                             = 032900      
000380*                      REGISTRO INICIAL                         = 033000      
000381*================================================================ 033100      
000382                                                                  033200      
000383 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000384     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000385     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000386     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000387     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000388     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000389     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000390     03 WKS-B05-MIX                PIC 9(08).                     034000      
000391     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000392     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000393     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000394     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000395     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000396     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000397                                                                  034700      
000398                                                                  034800      
000399*================================================================ 034900      
000400*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000401*                                                               = 035100      
000402*  FUNCION                                                      = 035200      
000403*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000404*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000405*                                                               = 035500      
000406*================================================================ 035600      
000407                                                                  035700      
000408 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000409     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000410     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000411     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000412     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000413     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000414     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000415                                                                  036500      
000416*===============================================================  036600      
000417*                                                              =  036700      
000418*         ENTRY-POINT CONSISMEN                                =  036800      
000419*                                                              =  036900      
000420*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000421*                      SISTEMA                                 =  037100      
000422*                                                              =  037200      
000423*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000424*                                                              =  037400      
000425*===============================================================  037500      
000426 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000427     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000428     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000429     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000430     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000431     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000432     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000433     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000434     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000435     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000436     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000437     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000438     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000439     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000440     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000441     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000442        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000443        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000444        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000445        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000446        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000447        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000448        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000449                                                                  039900      
000450*=====================================================            040000      
000451*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000452*=====================================================            040200      
000453 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000454     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000455     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000456     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000457                                                                  040700      
000458*=====================================================            040800      
000459*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000460*=====================================================            041000      
000461 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000462     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000463     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000464     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000465                                                                  041500      
000466*=====================================================            041600      
000467*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000468*=====================================================            041800      
000469 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000470     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000471     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000472     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000473*=====================================================            042300      
000474*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000475*=====================================================            042500      
000476 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000477     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000478     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000479     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000480                                                                  043000      
000481*=====================================================            043100      
000482*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000483*=====================================================            043300      
000484 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000485     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000486     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000487     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000488                                                                  043800      
000489*=====================================================            043900      
000490*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000491*=====================================================            044100      
000492 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000493     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000494     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000495     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000496                                                                  044600      
000497*=====================================================            044700      
000498*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000499*=====================================================            044900      
000500 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000501     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000502     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000503     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000504                                                                  045400      
000505*=====================================================            045500      
000506*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000507*=====================================================            045700      
000508 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000509     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000510     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000511     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000512                                                                  046200      
000513*=====================================================            046300      
000514*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000515*=====================================================            046500      
000516 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000517     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000518     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000519     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000520                                                                  047000      
000521*=====================================================            047100      
000522*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000523*=====================================================            047300      
000524 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000525     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000526     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000527     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000528                                                                  047800      
000529*=====================================================            047900      
000530*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000531*=====================================================            048100      
000532 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000533     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000534     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000535     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000536                                                                  048600      
000537*=====================================================            048700      
000538*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000539*=====================================================            048900      
000540 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000541     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000542     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000543     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000544                                                                  049400      
000545*=====================================================            049500      
000546*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000547*=====================================================            049700      
000548 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000549     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000550     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000551     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000552     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000553     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000554     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000555     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000556     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000557     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000558     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000559                                                                  050900      
000560*=====================================================            051000      
000561*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000562*=====================================================            051200      
000563 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000564     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000565     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000566     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000567     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000568                                                                  051800      
000569*=====================================================            051900      
000570*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000571*=====================================================            052100      
000572 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000573     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000574     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000575     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000576     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000577                                                                  052700      
000578*=====================================================            052800      
000579*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000580*=====================================================            053000      
000581 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000582     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000583     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000584     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000585     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
000586                                                                  053600      
000587*=====================================================            053700      
000588*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
000589*=====================================================            053900      
000590 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
000591     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
000592     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
000593     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
000594     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
000595                                                                  054500      
000596*=====================================================            054600      
000597*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
000598*=====================================================            054800      
000599 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
000600     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
000601     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
000602     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
000603     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
000604                                                                  055400      
000605*=====================================================            055500      
000606*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
000607*=====================================================            055700      
000608 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
000609     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
000610     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
000611     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
000612     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
000613                                                                  056300      
000614*=====================================================            056400      
000615*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
000616*=====================================================            056600      
000617 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
000618     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
000619     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
000620     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
000621     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
000622                                                                  057200      
000623 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
000624*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000625                                                                  002500      
000626*==========================================================       002600      
000627*         VARIABLES LIBRERIA DE DESPLIEGE                 =       002700      
000628*==========================================================       002800      
000629                                                                  002900      
000630                                                                  003000      
000631*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000632* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           003100      
000633**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000634  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000635  01 MENSAJE-LJ.                                                  100300      
000636     02 SISTEMA-LJ     PIC X(04).                                 100400      
000637     02 FILLER         PIC X VALUE "/".                           100500      
000638     02 PASO-LJ        PIC X(04).                                 100600      
000639     02 FILLER         PIC X VALUE "/".                           100700      
000640     02 MTP-LJ         PIC 9(03).                                 100800      
000641     02 FILLER         PIC X VALUE ":".                           100900      
000642     02 TIPO-LJ        PIC X.                                     101000      
000643     02 FILLER         PIC X VALUE ">".                           101100      
000644     02 CODIGO-LJ      PIC 9(06).                                 101200      
000645     02 FILLER         PIC X VALUE "<".                           101300      
000646     02 TEXTO-LJ       PIC X(250).                                101400      
000647*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000648                                                                  003200      
000649*==========================================================       003300      
000650*         VARIABLES LIBRERIA CALENDAR                     =       003400      
000651*==========================================================       003500      
000652                                                                  003600      
000653 01  WKS-FECHA1                    PIC X(08).                     003700      
000654 01  WKS-FECHA1-RED                REDEFINES WKS-FECHA1.          003800      
000655     03 WKS-AA-FECHA1              PIC 9(04).                     003900      
000656     03 WKS-MM-FECHA1              PIC 9(02).                     004000      
000657     03 WKS-DD-FECHA1              PIC 9(02).                     004100      
000658                                                                  004200      
000659 01  WKS-FECHA2                    PIC X(08).                     004300      
000660 01  WKS-FECHA2-RED                REDEFINES WKS-FECHA2.          004400      
000661     03 WKS-AA-FECHA2              PIC 9(04).                     004500      
000662     03 WKS-MM-FECHA2              PIC 9(02).                     004600      
000663     03 WKS-DD-FECHA2              PIC 9(02).                     004700      
000664                                                                  004800      
000665 01  WKS-FECHA1-6                  PIC X(06).                     004900      
000666 01  WKS-FECHA1-RED-6              REDEFINES WKS-FECHA1-6.        005000      
000667     03 WKS-AA-FECHA1-6            PIC 9(02).                     005100      
000668     03 WKS-MM-FECHA1-6            PIC 9(02).                     005200      
000669     03 WKS-DD-FECHA1-6            PIC 9(02).                     005300      
000670                                                                  005400      
000671 01  WKS-FECHA2-6                  PIC X(08).                     005500      
000672 01  WKS-FECHA2-RED-6              REDEFINES WKS-FECHA2-6.        005600      
000673     03 WKS-AA-FECHA2-6            PIC 9(04).                     005700      
000674     03 WKS-MM-FECHA2-6            PIC 9(02).                     005800      
000675     03 WKS-DD-FECHA2-6            PIC 9(02).                     005900      
000676                                                                  006000      
000677                                                                  006100      
000678 77  W77-FUNCION                   PIC S9(11) BINARY.             006200      
000679 77  W77-FORMATO                   PIC S9(11) BINARY.             006300      
000680 77  W77-FIN                       PIC 9(02) COMP.                006400      
000681 77  WKS-FEC-ANT                   PIC 9(08).                     006500      
000682 77  WKS-FECCON-S500               PIC 9(08).                     006520      
000683 77  WKS-FECPRO-S500               PIC 9(08).                     006540      
000684 77  WKS-FECPRO151-S500            PIC 9(08).                     006560      
000685                                                                  006600      
000686*================================================================ 006700      
000687*         VARIABLE PARA LIBRERIA SOPORTECOMS                    = 006800      
000688*================================================================ 006900      
000689 01  WKS-PACK-NAME                PIC X(17).                      007000      
000690 01  WKS-HOST.                                                    007100      
000691     03 WKS-NUMCSI                 PIC 9(02).                     007200      
000692     03 WKS-NOM-HOST               PIC X(10).                     007300      
000693     03 WKS-NOM-CSI                PIC X(26).                     007400      
000694     03 WKS-LINEA-BATCH            PIC X(05).                     007500      
000695 01  WKS-LIBID                     PIC X(12).                     007600      
000696 01  WKS-NOMLIB                    PIC X(72).                     007700      
000697 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             007800      
000698*================================================================ 007900      
000699*                     VARIABLE GENERALES                        = 008000      
000700*================================================================ 008100      
000701 77  W77-FUN-CALE                  PIC 9(04).                     008200      
000702 77  W77-IND                       PIC 9(08).                     008300      
000703 77  WS-EOF                        PIC 9(01).                     008400      
000704 77  WKS-FECPRO151                 PIC 9(08).                     008500      
000705 77  W77-ERROR                     PIC 9(02).                     008600      
000706 77  W77-REGINI                    PIC 9(08).                     008700      
000707 77  WKS-MODO                      PIC 9(08).                     008800      
000708 01  WKS-PARAMETROS.                                              008900      
000709     03  WKS-PARAM-SISTEMA         PIC 9(03).                     009000      
000710     03  WKS-PARAM-FECHA           PIC 9(08).                     009100      
000711     03  WKS-PARAM-NUMPRO          PIC 9(03).                     009200      
000712     03  WKS-PARAM-NUMREGINI       PIC 9(02).                     009300      
000713     03  WKS-PARAM-REGFIN          PIC 9(03).                     009350      
000714                                                                  009400      
000715 01 WKS-PROCESOSNNN.                                              009500      
000716     03 FILLER                     PIC X(03) VALUE "001".         009600      
000717     03 FILLER                     PIC X(03) VALUE "152".         009700      
000718     03 FILLER                     PIC X(03) VALUE "172".         009800      
000719     03 FILLER                     PIC X(03) VALUE "178".         009900      
000720     03 FILLER                     PIC X(03) VALUE "197".         010000      
000721     03 FILLER                     PIC X(03) VALUE "104".         010010      
000722     03 FILLER                     PIC X(03) VALUE "122".         010020      
000723     03 FILLER                     PIC X(03) VALUE "130".         010030      
000724     03 FILLER                     PIC X(03) VALUE "131".         010040      
000725                                                                  010100      
000726 01 WKS-PROCESOSLIN.                                              010200      
000727     03 FILLER                     PIC X(03) VALUE "000".         010300      
000728     03 FILLER                     PIC X(03) VALUE "052".         010400      
000729     03 FILLER                     PIC X(03) VALUE "195".         010500      
000730     03 FILLER                     PIC X(03) VALUE "196".         010550      
000731                                                                  010600      
000732 01 WKS-TABLA-PROCESOS.                                           010700      
000733     03 WKS-PROCESO    OCCURS 10 TIMES PIC 9(03).                 010800      
000734                                                                  010900      
000735                                                                  011000      
000736*************************************************************     011100      
000737******      INICIA PROCEDURE DIVISION.                 ******     011200      
000738*************************************************************     011300      
000739 PROCEDURE DIVISION USING WKS-PARAMETROS.                         011400      
000740 000100-INICIO.                                                   011500      
000741     PERFORM 000100-INICIALIZACION.                               011600      
000742     IF WKS-MODO = 1                                              011700      
000743       PERFORM 000150-REGRESO-FECHA                               011750      
000744     ELSE IF WKS-MODO = 2                                         011760      
000745       PERFORM 000140-MANTEN-FECHA-S500                           011800      
000746     ELSE                                                         011900      
000747       PERFORM 000200-PROCESO.                                    012000      
000748     PERFORM 000300-FINALIZAR.                                    012100      
000749     STOP RUN.                                                    012200      
000750                                                                  012300      
000751 000100-INICIALIZACION.                                           012400      
000752*=================                                                012500      
000753     MOVE "S151"                   TO SISTEMA-LJ.                 012600      
000754     MOVE "P196"                   TO PASO-LJ.                    012700      
000755*     MOVE "008"                    TO MTP-LJ.                    012800      
000756     MOVE "001"                    TO MTP-LJ.                     012810      
000757                                                                  012900      
000758     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     013000      
000759     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      013100      
000760                                                                  013200      
000761     CHANGE ATTRIBUTE LIBACCESS OF "SOPORTECOMS" TO BYFUNCTION.   013300      
000762     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS"               013400      
000763                                   TO "SOPORTECOMS".              013500      
000764                                                                  013600      
000765     CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION.     013700      
000766     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP".       013800      
000767                                                                  013900      
000768     CHANGE ATTRIBUTE TITLE OF "LIB-DISP" TO                      014000      
000769            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK".       014100      
000770     CALL "CSIID OF SOPORTECOMS" USING WKS-HOST.                  014200      
000771     CANCEL "SOPORTECOMS".                                        014300      
000772                                                                  014400      
000773     MOVE "S151L001CTL"           TO WKS-LIBID.                   014500      
000774     CALL "DAME_TIT IN CTLVER" USING WKS-LIBID, WKS-NOMLIB        014600      
000775                               GIVING W77-ERR-CTLVER.             014700      
000776     IF W77-ERR-CTLVER = 0                                        014800      
000777        CHANGE ATTRIBUTE TITLE OF "LIBCTL" TO WKS-NOMLIB          014900      
000778     ELSE                                                         015000      
000779        CHANGE ATTRIBUTE TITLE OF "LIBCTL" TO                     015100      
000780              "(S151)S151/OBJECT/L001/CONTROL/15MTP002 ON CMEMP". 015200      
000781                                                                  015300      
000782                                                                  015400      
000783     MOVE ZERO                     TO W77-RESULT-LIBCON.          015500      
000784     MOVE 1                        TO WKS-B01-FUNCION             015600      
000785     IF WKS-PARAM-SISTEMA = 151                                   015700      
000786       MOVE 151                  TO WKS-B01-SISTEMA               015800      
000787     ELSE                                                         015900      
000788       MOVE WKS-PARAM-SISTEMA     TO WKS-B01-SISTEMA.             016000      
000789     MOVE WKS-NUMCSI               TO WKS-B01-CSI.                016100      
000790                                                                  016200      
000791     CALL "CONSISDIA IN LIBCTL" USING  WKS-S151B01SISDIA          016300      
000792                                GIVING W77-RESULT-LIBCON.         016400      
000793     IF W77-RESULT-LIBCON > 0                                     016500      
000794        IF WKS-PARAM-SISTEMA = 151 AND W77-RESULT-LIBCON = 1      016510      
000795           MOVE LOW-VALUES         TO WKS-S151B01SISDIA           016520      
000796           MOVE 19                 TO WKS-B01-FUNCION             016530      
000797           MOVE WKS-PARAM-SISTEMA  TO WKS-B01-SISTEMA             016540      
000798           MOVE WKS-NUMCSI         TO WKS-B01-CSI                 016550      
000799           MOVE 20150525           TO WKS-B01-FECPRO              016552      
000800                                      WKS-B01-FECPRO151           016554      
000801                                      WKS-B01-FECCON              016556      
000802           CALL "MANTSISDIA IN LIBCTL"                            016560      
000803              USING  WKS-S151B01SISDIA                            016570      
000804              GIVING W77-RESULT-LIBCON                            016580      
000805        ELSE                                                      016590      
000806           MOVE "O"                       TO TIPO-LJ              016600      
000807           MOVE 020103                    TO CODIGO-LJ            016700      
000808           MOVE "ERROR EN LLAMADO EN L001"TO TEXTO-LJ             016800      
000809           CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ        016900      
000810                                            MENSAJE-LJ            017000      
000811           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                017100      
000812     ELSE                                                         017200      
000813        MOVE  WKS-B01-FECPRO151       TO WKS-FECPRO151.           017300      
000814                                                                  017400      
000815     OPEN UPDATE S151BD99CONTROL                                  017500      
000816             ON EXCEPTION                                         017600      
000817                MOVE "O"                      TO TIPO-LJ          017700      
000818                MOVE 020103                   TO CODIGO-LJ        017800      
000819                MOVE "TERMINACION ANORMAL DE PROCESO"TO TEXTO-LJ  017900      
000820                CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ   018000      
000821                                                    MENSAJE-LJ    018100      
000822                CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.          018200      
000823                                                                  018300      
000824      MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-MODO.             018400      
000825                                                                  018500      
000826     CANCEL "SOPORTECOMS".                                        018600      
000827     CANCEL "CTLVER".                                             018700      
000828                                                                  018800      
000829 000200-PROCESO.                                                  018900      
000830*====================                                             019000      
000831    MOVE ZERO                        TO W77-RESULT-LIBCON.        019100      
000832    IF WKS-PARAM-FECHA > 0                                        019200      
000833         PERFORM 000230-ELIMINA-ACTUALIZA                         019300      
000834         MOVE WKS-PARAM-SISTEMA   TO WKS-B05-SISTEMA              019400      
000835         MOVE WKS-PARAM-FECHA     TO WKS-B05-FCHPRO               019500      
000836         MOVE WKS-PARAM-NUMPRO    TO WKS-B05-NUMPRO               019600      
000837         MOVE WKS-PARAM-NUMREGINI TO WKS-B05-NUMREGINI            019700      
000838         CALL "B05PROCESOS IN LIBCTL" USING  WKS-B05PROCESOS      019800      
000839                                      GIVING W77-RESULT-LIBCON    019900      
000840         IF W77-RESULT-LIBCON > 0                                 020000      
000841            MOVE "I"              TO TIPO-LJ                      020100      
000842            MOVE 040101           TO CODIGO-LJ                    020200      
000843            STRING "NO SE ELIMINO/ACT B05 CON FECHA: "            020300      
000844                   WKS-PARAM-FECHA " SISTEMA: "                   020400      
000845                   WKS-PARAM-SISTEMA " NUM. PROC : "              020500      
000846                   WKS-PARAM-NUMPRO                               020600      
000847                   DELIMITED BY SIZE INTO TEXTO-LJ                020700      
000848            CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ   020800      
000849         ELSE                                                     020900      
000850            MOVE "I"              TO TIPO-LJ                      021000      
000851            MOVE 040101           TO CODIGO-LJ                    021100      
000852            STRING "SE ELIMINO/ACT CORRECTAMENTE B05 CON FECHA: " 021200      
000853                   WKS-PARAM-FECHA " SISTEMA: "                   021300      
000854                   WKS-PARAM-SISTEMA " Y NUM. PROC : "            021400      
000855                   WKS-PARAM-NUMPRO                               021500      
000856                   DELIMITED BY SIZE INTO TEXTO-LJ                021600      
000857            CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ   021700      
000858                                                                  021800      
000859    ELSE                                                          021900      
000860        IF WKS-PARAM-SISTEMA = 151                                022000      
000861           PERFORM 000210-PROYFEC-ANTHAB                          022100      
000862           MOVE WKS-PROCESOSLIN TO WKS-TABLA-PROCESOS             022200      
000863           PERFORM 000220-ELIMINA-B05 VARYING W77-IND             022300      
000864                             FROM 1 BY 1 UNTIL W77-IND > 4        022400      
000865           PERFORM 000220-ELI-B05-PRELIN500                       022500      
000866           PERFORM 000230-ACT-B05-P196-PRELINEA                   022550      
000867        ELSE                                                      022600      
000868           PERFORM 000210-PROYFEC-ANTHAB                          022700      
000869           MOVE WKS-PROCESOSNNN TO WKS-TABLA-PROCESOS             022800      
000870           PERFORM 000220-ELIMINA-B05 VARYING W77-IND             022900      
000871                             FROM 1 BY 1 UNTIL W77-IND > 9.       023000      
000872                                                                  023100      
000873 000220-ELIMINA-B05.                                              023200      
000874*===========================                                      023300      
000875   MOVE ZERO                        TO WS-EOF                     023400      
000876                                       W77-REGINI                 023500      
000877   IF WKS-PROCESO(W77-IND) = 196                                  023520      
000878      MOVE 1                        TO W77-REGINI.                023540      
000879   PERFORM 000400-LOCK-B05SXPROCESO                               023600      
000880   BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL                     023700      
000881   PERFORM 000221-PROCESO-ELI UNTIL WS-EOF = 1.                   023800      
000882                                                                  023900      
000883   IF WKS-PROCESO(W77-IND) = 197                                  024000      
000884      MOVE ZERO TO WS-EOF                                         024100      
000885         LOCK FIRST B05SXPROCESO                                  024200      
000886                        AT B05-SIS-SISTEMA = WKS-PARAM-SISTEMA    024300      
000887                       AND B05-SIS-FCHPRO = WKS-FEC-ANT           024400      
000888                       AND B05-SIS-NUMPRO = WKS-PROCESO(W77-IND)  024500      
000889                       ON EXCEPTION                               024600      
000890                          MOVE     1       TO WS-EOF.             024700      
000891   IF WS-EOF = 0                                                  024800      
000892      MOVE 1 TO B05-SIS-FCHINI                                    024900      
000893      STORE S151B05PROCESOS                                       024950      
000894            ON EXCEPTION                                          025000      
000895            MOVE "I"                        TO TIPO-LJ            025050      
000896            MOVE 040101                     TO CODIGO-LJ          025100      
000897            STRING "ERROR AL ACTUALIZA B05: "                     025150      
000898            WKS-FEC-ANT " SISTEMA: "                              025200      
000899            WKS-PARAM-SISTEMA " Y NUM. PROC : "                   025250      
000900            WKS-PROCESO(W77-IND)                                  025300      
000901            DELIMITED BY SIZE INTO TEXTO-LJ                       025350      
000902            CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.  025400      
000903 END-TRANSACTION NO-AUDIT S151B99REINICTL.                        025500      
000904                                                                  025800      
000905 000221-PROCESO-ELI.                                              025900      
000906*==========================                                       026000      
000907 PERFORM 000500-DELETE-B05PROCESOS                                026100      
000908 PERFORM 000600-NEXT-B05PROCESOS.                                 026200      
000909                                                                  026300      
000910 000400-LOCK-B05SXPROCESO.                                        026400      
000911*==========================                                       026500      
000912  LOCK FIRST B05SXPROCESO AT B05-SIS-SISTEMA = WKS-PARAM-SISTEMA  026600      
000913                AND B05-SIS-FCHPRO < WKS-FEC-ANT                  026700      
000914                AND B05-SIS-FCHPRO > 3                            026750      
000915                AND B05-SIS-NUMPRO = WKS-PROCESO(W77-IND)         026800      
000916                AND B05-SIS-NUMREGINI = W77-REGINI                026900      
000917                ON EXCEPTION                                      027000      
000918                   MOVE     1       TO WS-EOF.                    027100      
000919                                                                  027200      
000920 000500-DELETE-B05PROCESOS.                                       027300      
000921*===========================                                      027400      
000922  DELETE S151B05PROCESOS                                          027500      
000923        ON EXCEPTION                                              027600      
000924           MOVE "I"              TO TIPO-LJ                       027700      
000925           MOVE 040101           TO CODIGO-LJ                     027800      
000926           STRING "ERROR EN ELIMINACION B05 EN PROCESO: "         027900      
000927                WKS-PROCESO(W77-IND)                              028000      
000928                DELIMITED BY SIZE INTO TEXTO-LJ                   028100      
000929          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.    028200      
000930                                                                  028300      
000931 000600-NEXT-B05PROCESOS.                                         028400      
000932*==========================                                       028500      
000933  LOCK NEXT B05SXPROCESO AT B05-SIS-SISTEMA = WKS-PARAM-SISTEMA   028600      
000934                AND B05-SIS-FCHPRO < WKS-FEC-ANT                  028700      
000935                AND B05-SIS-FCHPRO > 3                            028750      
000936                AND B05-SIS-NUMPRO = WKS-PROCESO(W77-IND)         028800      
000937                AND B05-SIS-NUMREGINI = W77-REGINI                028900      
000938                ON EXCEPTION                                      029000      
000939                   MOVE     1       TO WS-EOF.                    029100      
000940                                                                  029200      
000941 000210-PROYFEC-ANTHAB.                                           029300      
000942*======================                                           029400      
000943   MOVE WKS-FECPRO151            TO WKS-FECHA1.                   029500      
000944   MOVE 15                       TO W77-FUNCION                   029600      
000945                                    W77-FUN-CALE.                 029700      
000946   MOVE "00000001"               TO WKS-FECHA2.                   029800      
000947   MOVE 3                        TO W77-FORMATO.                  029900      
000948   MOVE 13                       TO W77-FORMATO.                  030000      
000949   CALL "THECALENDAR IN LOCSUP"    USING W77-FUNCION,             030100      
000950                                       WKS-FECHA1,                030200      
000951                                       WKS-FECHA2,                030300      
000952                                       W77-FORMATO.               030400      
000953   IF W77-FUNCION > 0                                             030500      
000954      MOVE "I"                      TO TIPO-LJ                    030600      
000955      MOVE 051010                   TO CODIGO-LJ                  030700      
000956      MOVE W77-FUNCION              TO W77-ERROR                  030800      
000957      STRING "FUNCION "                                           030900      
000958             W77-FUN-CALE                                         031000      
000959             " ERROR # "                                          031100      
000960             W77-ERROR                                            031200      
000961             " EN LLAMADO DE CALENDAR "                           031300      
000962             WKS-FECHA1 " " WKS-FECHA2                            031400      
000963      DELIMITED BY SIZE                                           031500      
000964      INTO TEXTO-LJ                                               031600      
000965      CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                     031700      
000966   ELSE                                                           031800      
000967      MOVE WKS-FECHA1               TO WKS-FEC-ANT.               031900      
000968                                                                  032000      
000969 000220-ELI-B05-PRELIN500.                                        032100      
000970*=========================                                        032200      
000971   MOVE WKS-FEC-ANT TO WKS-FECPRO151.                             032300      
000972   PERFORM 000210-PROYFEC-ANTHAB                                  032400      
000973   MOVE 22                  TO WKS-B05-FUNCION                    032500      
000974   MOVE 500                 TO WKS-B05-SISTEMA                    032600      
000975   MOVE WKS-FEC-ANT         TO WKS-B05-FCHPRO                     032700      
000976   MOVE 001                 TO WKS-B05-NUMPRO                     032800      
000977   MOVE 3                   TO WKS-B05-NUMREGINI                  032900      
000978   CALL "B05PROCESOS IN LIBCTL" USING  WKS-B05PROCESOS            033000      
000979                              GIVING W77-RESULT-LIBCON.           033100      
000980                                                                  033800      
000981                                                                  033900      
000982 000150-REGRESO-FECHA.                                            034000      
000983*=====================                                            034100      
000984   MOVE    ZERO             TO   WS-EOF.                          034200      
000985   FIND FIRST B05SXPROCESO AT B05-SIS-SISTEMA = WKS-PARAM-SISTEMA 034300      
000986                 AND B05-SIS-NUMPRO = 197                         034400      
000987                 AND B05-SIS-FCHINI = 0                           034500      
000988                 ON EXCEPTION                                     034600      
000989                    MOVE     1       TO WS-EOF.                   034700      
000990                                                                  034800      
000991   IF WS-EOF = 0 AND B05-SIS-STAPGM = 1                           034900      
000992      PERFORM 000210-PROYFEC-ANTHAB                               035000      
000993      MOVE WKS-PARAM-SISTEMA     TO WKS-B01-SISTEMA               035100      
000994      MOVE WKS-NUMCSI            TO WKS-B01-CSI                   035200      
000995      MOVE 37                    TO WKS-B01-FUNCION               035300      
000996      MOVE WKS-FEC-ANT           TO WKS-B01-FECPRO151             035400      
000997       CALL "MANTSISDIA IN LIBCTL"                                035500      
000998           USING  WKS-S151B01SISDIA                               035600      
000999           GIVING W77-RESULT-LIBCON                               035700      
001000                                                                  035800      
001001      IF W77-RESULT-LIBCON > 0                                    035900      
001002         MOVE "O"                       TO TIPO-LJ                036000      
001003         MOVE 020103                    TO CODIGO-LJ              036100      
001004         MOVE "ERROR EN LLAMADO EN L001"TO TEXTO-LJ               036200      
001005         CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ          036300      
001006                                             MENSAJE-LJ           036400      
001007         CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                  036500      
001008      ELSE                                                        036600      
001009         NEXT SENTENCE                                            036700      
001010   ELSE                                                           038500      
001011     NEXT SENTENCE.                                               038600      
001012                                                                  038700      
001013                                                                  038800      
001014 000300-FINALIZAR.                                                038900      
001015*=================                                                039000      
001016   CLOSE S151BD99CONTROL                                          039100      
001017         ON EXCEPTION                                             039200      
001018            NEXT SENTENCE.                                        039300      
001019   CANCEL "LIBCTL"            .                                   039400      
001020                                                                  039500      
001021 000140-MANTEN-FECHA-S500.                                        039600      
001022          MOVE    ZERO             TO   WS-EOF.                   039700      
001023          FIND FIRST B05SXPROCESO AT B05-SIS-SISTEMA = 151        039800      
001024                        AND B05-SIS-NUMPRO = 196                  039900      
001025                        AND B05-SIS-NUMREGINI = 0                 040000      
001026                        ON EXCEPTION                              040100      
001027                           MOVE     1       TO WS-EOF.            040200      
001028                                                                  040300      
001029    IF WS-EOF = 1                                                 040400      
001030       MOVE 500                   TO WKS-B01-SISTEMA              040500      
001031       MOVE WKS-NUMCSI            TO WKS-B01-CSI                  040600      
001032       MOVE 01                    TO WKS-B01-FUNCION              040700      
001033        CALL "CONSISDIA IN LIBCTL"                                040800      
001034            USING  WKS-S151B01SISDIA                              040900      
001035            GIVING W77-RESULT-LIBCON                              041000      
001036                                                                  041100      
001037        IF W77-RESULT-LIBCON > 0                                  041200      
001038           MOVE "O"                       TO TIPO-LJ              041300      
001039           MOVE 020103                    TO CODIGO-LJ            041400      
001040           MOVE "ERROR CONSULTA FECHA 500"TO TEXTO-LJ             041500      
001041           CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ        041600      
001042                                              MENSAJE-LJ          041700      
001043           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                041800      
001044        ELSE                                                      041900      
001045           MOVE WKS-B01-FECCON            TO WKS-FECCON-S500      042000      
001046                                             WKS-FECPRO-S500      042100      
001047                                             WKS-FECPRO151-S500   042200      
001048           MOVE 151                       TO WKS-B01-SISTEMA      042300      
001049           MOVE WKS-NUMCSI                TO WKS-B01-CSI          042400      
001050           MOVE 01                        TO WKS-B01-FUNCION      042500      
001051            CALL "CONSISDIA IN LIBCTL"                            042600      
001052                USING  WKS-S151B01SISDIA                          042700      
001053                GIVING W77-RESULT-LIBCON                          042800      
001054                                                                  042900      
001055           IF W77-RESULT-LIBCON > 0                               043000      
001056              MOVE "O"                        TO TIPO-LJ          043100      
001057              MOVE 020103                     TO CODIGO-LJ        043200      
001058              MOVE "ERROR EN CONSULTA 151"    TO TEXTO-LJ         043300      
001059              CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ     043400      
001060                                                 MENSAJE-LJ       043500      
001061              CHANGE ATTRIBUTE STATUS OF MYSELF TO -1             043600      
001062           ELSE                                                   043700      
001063            MOVE 151                   TO WKS-B01-SISTEMA         043800      
001064            MOVE WKS-NUMCSI            TO WKS-B01-CSI             043900      
001065            MOVE 37                    TO WKS-B01-FUNCION         044000      
001066            MOVE WKS-FECCON-S500       TO WKS-B01-FECPRO          044100      
001067            MOVE WKS-FECPRO-S500       TO WKS-B01-FECCON          044200      
001068            MOVE WKS-FECPRO151-S500    TO WKS-B01-FECPRO151       044300      
001069            CALL "MANTSISDIA IN LIBCTL"                           044400      
001070                             USING  WKS-S151B01SISDIA             044500      
001071                             GIVING W77-RESULT-LIBCON             044600      
001072                                                                  044700      
001073              IF W77-RESULT-LIBCON > 0                            044800      
001074                MOVE "O"                        TO TIPO-LJ        044900      
001075                MOVE 020103                     TO CODIGO-LJ      045000      
001076                MOVE "ERROR AL GRABAR FECHA 151"TO TEXTO-LJ       045100      
001077                CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ   045200      
001078                                                   MENSAJE-LJ     045300      
001079                CHANGE ATTRIBUTE STATUS OF MYSELF TO -1           045400      
001080              ELSE                                                045500      
001081                MOVE 19              TO WKS-B05-FUNCION           045600      
001082                MOVE WKS-FECCON-S500 TO WKS-B05-FCHPRO            045700      
001083                MOVE 196             TO WKS-B05-NUMPRO            045800      
001084                MOVE 151             TO WKS-B05-SISTEMA           045900      
001085                MOVE 0               TO WKS-B05-NUMREGINI         046000      
001086               CALL "B05PROCESOS IN LIBCTL"                       046100      
001087               USING WKS-B05PROCESOS                              046200      
001088               GIVING W77-RESULT-LIBCON                           046300      
001089               IF W77-RESULT-LIBCON > 0                           046400      
001090                  MOVE "O"                          TO TIPO-LJ    046500      
001091                  MOVE 020103                       TO CODIGO-LJ  046600      
001092                  MOVE "ERROR AL CREAR REG B05 196" TO TEXTO-LJ   046700      
001093                  CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ 046800      
001094                                                     MENSAJE-LJ   046900      
001095                  CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.        047000      
001096 000230-ACT-B05-P196-PRELINEA.                                    047100      
001097*============================                                     047200      
001098    MOVE 151                   TO WKS-B01-SISTEMA                 047300      
001099    MOVE WKS-NUMCSI            TO WKS-B01-CSI                     047400      
001100    MOVE 01                    TO WKS-B01-FUNCION                 047500      
001101     CALL "CONSISDIA IN LIBCTL"                                   047600      
001102         USING  WKS-S151B01SISDIA                                 047700      
001103         GIVING W77-RESULT-LIBCON                                 047800      
001104                                                                  047900      
001105     IF W77-RESULT-LIBCON > 0                                     048000      
001106        MOVE "O"                         TO TIPO-LJ               048100      
001107        MOVE 020103                      TO CODIGO-LJ             048200      
001108        MOVE "ERROR CONSULTA BORRADO 196"TO TEXTO-LJ              048300      
001109        CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ           048400      
001110                                           MENSAJE-LJ             048500      
001111        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  048600      
001112      MOVE ZERO TO WS-EOF.                                        048700      
001113      BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL                  048750      
001114      LOCK FIRST B05SXPROCESO                                     048800      
001115              AT B05-SIS-SISTEMA = 151                            048900      
001116             AND B05-SIS-NUMPRO  = 196                            049000      
001117             AND B05-SIS-FCHPRO = WKS-B01-FECCON                  049100      
001118                ON EXCEPTION                                      049200      
001119                    MOVE     1       TO WS-EOF.                   049300      
001120      IF WS-EOF = 0                                               049400      
001121         MOVE 1 TO B05-SIS-NUMREGINI                              049600      
001122         STORE S151B05PROCESOS                                    049700      
001123          ON EXCEPTION                                            049800      
001124           MOVE "O"                         TO TIPO-LJ            049900      
001125           MOVE 020103                      TO CODIGO-LJ          050000      
001126           MOVE "ERROR ACT B05 P196"        TO TEXTO-LJ           050100      
001127           CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ        050200      
001128                                              MENSAJE-LJ          050300      
001129           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.               050400      
001130         END-TRANSACTION NO-AUDIT S151B99REINICTL.                050500      
001131 000230-ELIMINA-ACTUALIZA.                                        050550      
001132    IF WKS-PARAM-NUMPRO = 197 OR 196                              050600      
001133       MOVE 22                  TO WKS-B05-FUNCION                050700      
001134    ELSE                                                          050800      
001135       MOVE 37                  TO WKS-B05-FUNCION                050900      
001136       MOVE WKS-PARAM-REGFIN    TO WKS-B05-NUMREGFIN.             051000      
