000001$SET LINEINFO LIST                                                000100      
000002*INICIA CODIGO DE RENOVACION CRONOS 2000                          000200      
000003$SET LISTOMITTED                                                  000300      
000004$SET OLDCODE                                                      000400      
000005*TERMINA CODIGO DE RENOVACION CRONOS 2000                         000500      
000006$SET OPTIMIZE                                                     000600      
000007*$SET TADS                                                        000700      
000008 IDENTIFICATION DIVISION.                                         000800      
000009******************************************************************000900      
000010*   FUNCION : PROYECTAR FECHAS SOBRE LA BASE S151BD99CONTROL     *001000      
000011*                                                                *001100      
000012*   ENTRADA : PARAMETRO CUYO VALOR SEA EL NUMERO DE SISTEMA.     *001200      
000013*                                                                *001300      
000014* MODIFICACIONES :                                               *001400      
000015*                                                                *001500      
000016*   01MTP008 : SE REDUCE EL NUMERO DE REGISTROS EN EL ARCHIVO A  *001600      
000017*              GENERAR EN  PROCESO MENSUAL.                      *001700      
000018*                                                                *001800      
000019*                                                                *001900      
000020*                                                                *002000      
000021*   01MTP010 : VALIDA EXISTENCIA DE ARCHIVOS ANTES DE GENERARLOS *002100      
000022*              SE IMPLEMENTA USO DE MANTSISDIA                   *002200      
000023*              SE AGREGA PARAMETRO PARA BD12                     *002300      
000024*                                                                *002400      
000025*   01MTP027 : ELIMINACION DE TADS, DISPLAY INNECESARIOS AL      *002500      
000026*              OPERADOR, GENERACION DE REPORTE DE DISPLAY        *002600      
000027*                                                                *002700      
000028*   01MTP035 : SE INCREMENTA EL NUMERO DE REGISTROS DE CONTROL   *002702      
000029*                                                                *002704      
000030*   15MTP001 : SE AµADEN REGISTROS DE CONTROL B05 PARA ALTA DISP.*002706      
000031******************************************************************002800      
000032 ENVIRONMENT DIVISION.                                            002900      
000033 INPUT-OUTPUT SECTION.                                            003000      
000034 FILE-CONTROL.                                                    003100      
000035     SELECT L01-MOVTOS  ASSIGN TO DISK                            003200      
000036            ACCESS MODE IS SEQUENTIAL.                            003300      
000037                                                                  003400      
000038     SELECT L02-DESCRIP ASSIGN TO DISK                            003500      
000039            ACCESS MODE IS SEQUENTIAL.                            003600      
000040                                                                  003700      
000041     SELECT L03-CBII    ASSIGN TO DISK                            003800      
000042            ACCESS MODE IS SEQUENTIAL.                            003900      
000043                                                                  004000      
000044     SELECT L04-CTDR    ASSIGN TO DISK                            004020      
000045            ACCESS MODE IS SEQUENTIAL.                            004040      
000046                                                                  004060      
000047     SELECT V00-REPORTE2    ASSIGN TO PRINTER.                    004100      
000048                                                                  004200      
000049 DATA DIVISION.                                                   004300      
000050 FILE SECTION.                                                    004400      
000051 FD  L01-MOVTOS                                                   004500      
000052     BLOCK  CONTAINS 144 RECORDS                                  004600      
000053     VALUE OF FRAMESIZE   IS 48                                   004700      
000054              MAXRECSIZE  IS 75                                   004800      
000055              AREAS       IS 1000                                 004900      
000056              AREASIZE    IS 6000                                 005000      
000057              SECURITYUSE IS 3                                    005100      
000058              SAVEFACTOR  IS 99                                   005200      
000059     VALUE OF TITLE  IS  WKS-L01-MOVTOS.                          005300      
000060 01  L01-R00-MOVTOS                PIC X(75).                     005400      
000061                                                                  005500      
000062 FD  L02-DESCRIP                                                  005600      
000063     VALUE OF FRAMESIZE   IS 48                                   005700      
000064              MAXRECSIZE  IS 90                                   005800      
000065              AREAS       IS 1000                                 005900      
000066              AREASIZE    IS 9000                                 006000      
000067              SECURITYUSE IS 3                                    006100      
000068              SAVEFACTOR  IS 99                                   006200      
000069     BLOCK  CONTAINS 120 RECORDS                                  006300      
000070     VALUE OF TITLE  IS  WKS-L02-DESCRIP.                         006400      
000071 01  L02-R00-DESCRIP               PIC X(90).                     006500      
000072                                                                  006600      
000073 FD  L03-CBII                                                     006700      
000074     VALUE OF FRAMESIZE   IS 48                                   006800      
000075              MAXRECSIZE  IS 210                                  006900      
000076              AREAS       IS 900                                  007000      
000077              AREASIZE    IS 6000                                 007100      
000078              SECURITYUSE IS 3                                    007200      
000079              SAVEFACTOR  IS 99                                   007300      
000080     BLOCK CONTAINS 50 RECORDS                                    007400      
000081     VALUE OF TITLE IS WKS-L03-CBII.                              007500      
000082 01  L03-R00-CBII                  PIC X(210).                    007600      
000083                                                                  007700      
000084 FD  L04-CTDR                                                     007705      
000085     VALUE OF FRAMESIZE   IS 48                                   007710      
000086              MAXRECSIZE  IS 210                                  007715      
000087              AREAS       IS 900                                  007720      
000088              AREASIZE    IS 6000                                 007725      
000089              SECURITYUSE IS 3                                    007730      
000090              SAVEFACTOR  IS 99                                   007735      
000091     BLOCK CONTAINS 50 RECORDS                                    007740      
000092     VALUE OF TITLE IS WKS-L04-CTDR.                              007745      
000093 01  L04-R00-CTDR                  PIC X(210).                    007750      
000094                                                                  007770      
000095 FD  V00-REPORTE2                                                 007800      
000096     VALUE OF TITLE  IS  WKS-TIT-REPORTE2.                        007900      
000097                                                                  008000      
000098 01  V00-R00-REPORTE2                  PIC X(132).                008100      
000099                                                                  008200      
000100 DATA-BASE SECTION.                                               008300      
000101 DB  BASESEM = S151BD10MOVDIA151.                                 008400      
000102 WORKING-STORAGE SECTION.                                         008500      
000103*INICIA CODIGO DE RENOVACION CRONOS 2000                          008600      
000104*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000105* COPY "S151/CRONOS2K/CPY/WS".                                    008700      
000106******************************************************************000100      
000107** This copyBook defines all the additional variables that      **000200      
000108** Unisys has defined for the CRONOS2K project                  **000300      
000109** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000110******************************************************************000500      
000111                                                                  000600      
000112******************************************************************000700      
000113** These Variables are used to Accept the system date in long   **000800      
000114** format and get the century information                       **000900      
000115** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000116 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000117 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000118    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000119    05 FILLER      PIC X(1).                                      001400      
000120    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000121    05 FILLER      PIC X(1).                                      001600      
000122    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000123    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000124      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000125      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000126******************************************************************002100      
000127                                                                  002200      
000128******************************************************************002300      
000129** This variable defines a date in the format MMDDCCAA          **002400      
000130**                                                              **002500      
000131 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000132 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000133    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000134    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000135    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000136    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000137      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000138      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000139******************************************************************003400      
000140                                                                  003500      
000141******************************************************************003600      
000142** This variable defines a date in the format CCAAMMDD          **003700      
000143**                                                              **003800      
000144 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000145 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000146    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000147    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000148      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000149      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000150    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000151    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000152******************************************************************004700      
000153                                                                  004800      
000154******************************************************************004900      
000155** This variable defines a date in the format DDMMCCAA          **005000      
000156**                                                              **005100      
000157 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000158 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000159    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000160    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000161    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000162    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000163      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000164      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000165******************************************************************006000      
000166                                                                  006100      
000167******************************************************************006200      
000168** This variable defines a date in the Julian Format CCAADDD    **006300      
000169**                                                              **006400      
000170 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000171 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000172    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000173    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000174                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000175      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000176      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000177    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000178******************************************************************007300      
000179                                                                  007400      
000180******************************************************************007500      
000181** This variable defines a date in the format AAMMDD            **007600      
000182**                                                              **007700      
000183 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000184 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000185    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000186    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000187    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000188******************************************************************008300      
000189                                                                  008400      
000190******************************************************************008500      
000191** This variable defines a date in the format MMDDAA            **008600      
000192**                                                              **008700      
000193 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000194 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000195    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000196    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000197    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000198******************************************************************009300      
000199                                                                  009400      
000200******************************************************************009500      
000201** This variable defines a date in the format DDMMAA            **009600      
000202**                                                              **009700      
000203 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000204 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000205    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000206    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000207    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000208******************************************************************010300      
000209                                                                  010400      
000210******************************************************************010500      
000211** These variables are defined to be used for CALL bridge logic **010600      
000212**                                                              **010700      
000213 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000214 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000215 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000216 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000217 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000218 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000219******************************************************************011400      
000220                                                                  011500      
000221******************************************************************011600      
000222** This variable is used for converting only a year field AA to **011700      
000223** CCAA and a CCAA to AA                                        **011800      
000224 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000225 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000226    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000227    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000228 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000229 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000230******************************************************************012300      
000231                                                                  012400      
000232******************************************************************012500      
000233** These variables are Bridge Variables for Intercambio files   **012600      
000234** para EDOCTA                                                  **012700      
000235 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000236 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000237 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000238 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000239 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000240 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000241 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000242******************************************************************013500      
000243* Para MODULO                                                     013600      
000244 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000245******************************************************************013800      
000246******************************************************************013900      
000247** Para FMOVSCHABO                                                014000      
000248 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000249******************************************************************014200      
000250                                                                  014300      
000251******************************************************************014400      
000252***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000253******************************************************************014600      
000254                                                                  014700      
000255 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000256 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000257     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000258     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000259     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000260******************************************************************015300      
000261                                                                  015400      
000262******************************************************************015500      
000263***  These Variables Are Defined For Date In AAMM Format       ***015600      
000264******************************************************************015700      
000265                                                                  015800      
000266 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000267 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000268     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000269     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000270******************************************************************016300      
000271                                                                  016400      
000272                                                                  016500      
000273*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000274  01  A2K-BASE-YEAR     PIC 9(02) VALUE  50.                      008800      
000275*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008900      
000276                                                                  009000      
000277 01 WKS-BASEMOV.                                                  009100      
000278    03 WKS-NOM-BASESEM             PIC X(17).                     009200      
000279    03 FILLER                      PIC X(10) VALUE                009300      
000280       " ON CMEMP.".                                              009400      
000281                                                                  009410      
000282 01 WKS-CATEGORIAS.                                               009450      
000283    03 FILLER            PIC X(13) VALUE "NOTFOUND     ".         009452      
000284    03 FILLER            PIC X(13) VALUE "DUPLICATES   ".         009454      
000285    03 FILLER            PIC X(13) VALUE "DEADLOCK     ".         009456      
000286    03 FILLER            PIC X(13) VALUE "DATAERROR    ".         009458      
000287    03 FILLER            PIC X(13) VALUE "NOTLOCKED    ".         009460      
000288    03 FILLER            PIC X(13) VALUE "KEYCHANGE    ".         009462      
000289    03 FILLER            PIC X(13) VALUE "SYSTEM ERROR ".         009464      
000290    03 FILLER            PIC X(13) VALUE "READONLY     ".         009466      
000291    03 FILLER            PIC X(13) VALUE "IOERROR      ".         009468      
000292    03 FILLER            PIC X(13) VALUE "LIMITERROR   ".         009470      
000293    03 FILLER            PIC X(13) VALUE "OPENERROR    ".         009472      
000294    03 FILLER            PIC X(13) VALUE "CLOSEERROR   ".         009474      
000295    03 FILLER            PIC X(13) VALUE "NORECORD     ".         009476      
000296    03 FILLER            PIC X(13) VALUE "INUSE        ".         009478      
000297    03 FILLER            PIC X(13) VALUE "AUDITERROR   ".         009480      
000298    03 FILLER            PIC X(13) VALUE "ABORT        ".         009482      
000299    03 FILLER            PIC X(13) VALUE "SECURITYERROR".         009484      
000300    03 FILLER            PIC X(13) VALUE "VERSIONERROR ".         009486      
000301    03 FILLER            PIC X(13) VALUE "FATALERROR   ".         009488      
000302    03 FILLER            PIC X(13) VALUE "INTEGRITY ERR".         009490      
000303    03 FILLER            PIC X(13) VALUE "INTLIBERROR  ".         009492      
000304                                                                  009494      
000305 01 WKS-DB-CATEGORIAS     REDEFINES WKS-CATEGORIAS.               009496      
000306    03 WKS-DB-CAT         OCCURS 21 TIMES PIC X(13).              009498      
000307                                                                  009500      
000308 77 W77-NUM-CAT                    PIC 9(03).                     009502      
000309 77 W77-NUM-SUBCAT                 PIC 9(06).                     009504      
000310                                                                  009506      
000311 77 W77-BASE                       PIC 9(02).                     009508      
000312 88 W88-BASE-CLOSE                 VALUE ZERO.                    009510      
000313 88 W88-BASE-OPEN                  VALUE 1.                       009512      
000314                                                                  009514      
000315 77 W77-INTENTOS                   PIC 9(02) COMP VALUE ZERO.     009516      
000316                                                                  009518      
000317*==========================================================       009600      
000318*         VARIABLES LIBRERIA CALENDAR                     =       009700      
000319*==========================================================       009800      
000320                                                                  009900      
000321 01  WKS-FECHA1                    PIC X(08).                     010000      
000322 01  WKS-FECHA1-RED                REDEFINES WKS-FECHA1.          010100      
000323     03 WKS-AA-FECHA1              PIC 9(04).                     010200      
000324     03 WKS-MM-FECHA1              PIC 9(02).                     010300      
000325     03 WKS-DD-FECHA1              PIC 9(02).                     010400      
000326                                                                  010500      
000327 01  WKS-FECHA2                    PIC X(08).                     010600      
000328 01  WKS-FECHA2-RED                REDEFINES WKS-FECHA2.          010700      
000329     03 WKS-AA-FECHA2              PIC 9(04).                     010800      
000330     03 WKS-MM-FECHA2              PIC 9(02).                     010900      
000331     03 WKS-DD-FECHA2              PIC 9(02).                     011000      
000332                                                                  011100      
000333 01  WKS-FECHA1-6                  PIC X(06).                     011200      
000334 01  WKS-FECHA1-RED-6              REDEFINES WKS-FECHA1-6.        011300      
000335     03 WKS-AA-FECHA1-6            PIC 9(02).                     011400      
000336     03 WKS-MM-FECHA1-6            PIC 9(02).                     011500      
000337     03 WKS-DD-FECHA1-6            PIC 9(02).                     011600      
000338                                                                  011700      
000339 01  WKS-FECHA2-6                  PIC X(08).                     011800      
000340 01  WKS-FECHA2-RED-6              REDEFINES WKS-FECHA2-6.        011900      
000341     03 WKS-AA-FECHA2-6            PIC 9(04).                     012000      
000342     03 WKS-MM-FECHA2-6            PIC 9(02).                     012100      
000343     03 WKS-DD-FECHA2-6            PIC 9(02).                     012200      
000344                                                                  012300      
000345                                                                  012400      
000346 77  W77-FUNCION                   PIC S9(11) BINARY.             012500      
000347 77  W77-FORMATO                   PIC S9(11) BINARY.             012600      
000348 77  W77-FIN                       PIC 9(02) COMP.                012700      
000349*01  WKS-FECHA-MOVS                PIC 9(06).                     012800      
000350*INICIA CODIGO DE RENOVACION CRONOS 2000                          012900      
000351 01  WKS-FECHA-MOVS                PIC 9(08).                     013000      
000352*TERMINA CODIGO DE RENOVACION CRONOS 2000                         013100      
000353*01  WKS-FECHA-DESS                PIC 9(06).                     013200      
000354*INICIA CODIGO DE RENOVACION CRONOS 2000                          013300      
000355 01  WKS-FECHA-DESS                PIC 9(08).                     013400      
000356*TERMINA CODIGO DE RENOVACION CRONOS 2000                         013500      
000357 01  WKS-FECHA-MANANA.                                            013600      
000358*    03 WKS-AA-MANANA              PIC 9(02).                     013700      
000359*INICIA CODIGO DE RENOVACION CRONOS 2000                          013800      
000360     03 WKS-AA-MANANA              PIC 9(04).                     013900      
000361*TERMINA CODIGO DE RENOVACION CRONOS 2000                         014000      
000362     03 WKS-MM-MANANA              PIC 9(02).                     014100      
000363     03 WKS-DD-MANANA              PIC 9(02).                     014200      
000364                                                                  014300      
000365 01  WKS-FECHA-PASMAN.                                            014400      
000366*    03 WKS-AA-PASMAN              PIC 9(02).                     014500      
000367*INICIA CODIGO DE RENOVACION CRONOS 2000                          014600      
000368     03 WKS-AA-PASMAN              PIC 9(04).                     014700      
000369*TERMINA CODIGO DE RENOVACION CRONOS 2000                         014800      
000370     03 WKS-MM-PASMAN              PIC 9(02).                     014900      
000371     03 WKS-DD-PASMAN              PIC 9(02).                     015000      
000372                                                                  015100      
000373 01  WKS-FECHA-ARCHIVOS.                                          015110      
000374     03 WKS-AA-ARCHIVOS            PIC 9(02).                     015120      
000375     03 WKS-MM-ARCHIVOS            PIC 9(02).                     015130      
000376     03 WKS-DD-ARCHIVOS            PIC 9(02).                     015140      
000377                                                                  015150      
000378 01  WKS-FECHA-3ERHABIL.                                          015200      
000379     03 WKS-AA-3ERDIA              PIC 9(04).                     015300      
000380     03 WKS-MM-3ERDIA              PIC 9(02).                     015400      
000381     03 WKS-DD-3ERDIA              PIC 9(02).                     015500      
000382                                                                  015600      
000383*01  WKS-FECHA-HOY                 PIC 9(06).                     015700      
000384*INICIA CODIGO DE RENOVACION CRONOS 2000                          015800      
000385 01  WKS-FECHA-HOY                 PIC 9(08).                     015900      
000386*TERMINA CODIGO DE RENOVACION CRONOS 2000                         016000      
000387 01  WKS-FECHA-HOY-R REDEFINES WKS-FECHA-HOY.                     016100      
000388     03 WKS-AAMM-HOY.                                             016200      
000389*       05 WKS-AA-HOY              PIC 9(02).                     016300      
000390*INICIA CODIGO DE RENOVACION CRONOS 2000                          016400      
000391        05 WKS-AA-HOY              PIC 9(04).                     016500      
000392*TERMINA CODIGO DE RENOVACION CRONOS 2000                         016600      
000393        05 WKS-MM-HOY              PIC 9(02).                     016700      
000394     03 WKS-DD-HOY                 PIC 9(02).                     016800      
000395*01  WKS-FECHA-NAT                 PIC 9(06).                     016900      
000396                                                                  017000      
000397*INICIA CODIGO DE RENOVACION CRONOS 2000                          017100      
000398 01  WKS-FECHA-NAT                 PIC 9(08).                     017200      
000399*TERMINA CODIGO DE RENOVACION CRONOS 2000                         017300      
000400                                                                  017400      
000401 77  W77-DIA-SEM                   PIC 9(06).                     017500      
000402 77  W77-INHABIL                   PIC 9(02) VALUE ZERO.          017600      
000403*==========================================================       017700      
000404*         VARAIBLES LIBRERIA SOPORTECOMS                  =       017800      
000405*==========================================================       017900      
000406                                                                  018000      
000407 01  WKS-SOPCOMS.                                                 018100      
000408     03 WKS-NUMCSI                 PIC 9(02).                     018200      
000409     03 WKS-NOMEQUIPO              PIC X(10).                     018300      
000410     03 WKS-NOMCSI                 PIC X(26).                     018400      
000411     03 WKS-LINEA-BATCH            PIC X(05).                     018500      
000412                                                                  018600      
000413*==========================================================       018700      
000414*         VARIABLES LIBRERIA DE DESPLIEGE                 =       018800      
000415*==========================================================       018900      
000416                                                                  019000      
000417*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000418* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           019100      
000419**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000420  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000421  01 MENSAJE-LJ.                                                  100300      
000422     02 SISTEMA-LJ     PIC X(04).                                 100400      
000423     02 FILLER         PIC X VALUE "/".                           100500      
000424     02 PASO-LJ        PIC X(04).                                 100600      
000425     02 FILLER         PIC X VALUE "/".                           100700      
000426     02 MTP-LJ         PIC 9(03).                                 100800      
000427     02 FILLER         PIC X VALUE ":".                           100900      
000428     02 TIPO-LJ        PIC X.                                     101000      
000429     02 FILLER         PIC X VALUE ">".                           101100      
000430     02 CODIGO-LJ      PIC 9(06).                                 101200      
000431     02 FILLER         PIC X VALUE "<".                           101300      
000432     02 TEXTO-LJ       PIC X(250).                                101400      
000433*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000434                                                                  019200      
000435*==========================================================       019300      
000436*         VARIABLES LIBRERIA DE CONTROL                   =       019400      
000437*==========================================================       019500      
000438*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000439* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL.".                  019600      
000440*================================================================ 000100      
000441*         ENTRY-POINT CONSISDIA :                               = 000200      
000442*                                                                 000300      
000443* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000444* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000445* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000446* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000447* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000448* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000449* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000450* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000451* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000452* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000453*                                                               = 001400      
000454*================================================================ 001500      
000455                                                                  001600      
000456                                                                  001700      
000457*================================================================ 001800      
000458* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000459*                                                               = 002000      
000460* ENTRADA REQUERIDA :                                           = 002100      
000461*                                                               = 002200      
000462*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000463*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000464*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000465*================================================================ 002600      
000466 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000467    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000468    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000469    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000470    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000471    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000472    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000473    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000474    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000475    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000476    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000477    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000478    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000479    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000480    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000481    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000482    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000483    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000484    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000485    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000486    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000487       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000488       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000489       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000490       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000491*==============================================================   005200      
000492*                                                             =   005300      
000493* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000494*                                                             =   005500      
000495* CAMPOS REQUERIDOS :                                         =   005600      
000496*                                                             =   005700      
000497* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000498* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000499* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000500* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000501*==============================================================   006200      
000502 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000503    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000504    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000505    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000506    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000507                                                                  006800      
000508*==============================================================   006900      
000509*                                                             =   007000      
000510* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000511*                                                             =   007200      
000512* CAMPOS REQUERIDOS :                                         =   007300      
000513*                                                             =   007400      
000514* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000515* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000516* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000517* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000518*==============================================================   007900      
000519 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000520    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000521    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000522    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000523    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000524                                                                  008500      
000525*==============================================================   008600      
000526*                                                             =   008700      
000527* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000528*                                                             =   008900      
000529* CAMPOS REQUERIDOS :                                         =   009000      
000530*                                                             =   009100      
000531* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000532* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000533* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000534* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000535*==============================================================   009600      
000536 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000537    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000538    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000539    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000540    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000541                                                                  010200      
000542*============================================================     010300      
000543* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000544*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000545*                                                           =     010600      
000546*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000547*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000548*                                                           =     010900      
000549*  ENTRADA REQUERIDA.                                       =     011000      
000550*                                                           =     011100      
000551*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000552*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000553*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000554*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000555*============================================================     011600      
000556                                                                  011700      
000557 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000558     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000559     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000560     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000561     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000562                                                                  012300      
000563*=============================================================    012400      
000564*                                                            =    012500      
000565* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000566*             B01-SIS-FECARMOV.                              =    012700      
000567*                                                            =    012800      
000568* ENTRADA REQUERIDAD :                                       =    012900      
000569*                                                            =    013000      
000570*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000571*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000572*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000573*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000574*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000575*=============================================================    013600      
000576                                                                  013700      
000577 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000578     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000579     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000580     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000581     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000582     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000583*================================================================ 014400      
000584*                                                               = 014500      
000585* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000586*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000587*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000588*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000589*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000590*                                                               = 015100      
000591* ENTRADA REQUERIDA :                                           = 015200      
000592*                                                               = 015300      
000593* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000594* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000595* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000596* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000597* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000598*================================================================ 015900      
000599 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000600    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000601    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000602    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000603    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000604    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000605                                                                  016600      
000606*============================================================     016700      
000607*                                                           =     016800      
000608* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000609*                                                           =     017000      
000610* DATOS REQUERIDOS :                                        =     017100      
000611*                                                           =     017200      
000612* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000613* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000614* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000615* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000616* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000617*============================================================     017800      
000618                                                                  017900      
000619 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000620     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000621     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000622     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000623     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000624     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000625                                                                  018600      
000626*============================================================     018700      
000627*                                                           =     018800      
000628* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000629*                                                           =     019000      
000630* DATOS REQUERIDOS :                                        =     019100      
000631*                                                           =     019200      
000632* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000633* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000634* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000635* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000636* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000637*============================================================     019800      
000638                                                                  019900      
000639 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000640     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000641     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000642     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000643     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000644     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000645                                                                  020600      
000646*===============================================================  020700      
000647*                                                              =  020800      
000648* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000649*              MOVIMIENTOS.                                    =  021000      
000650* DATOS REQUERIDOS :                                           =  021100      
000651*                                                              =  021200      
000652* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000653* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000654* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000655* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000656* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000657* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000658*==============================================================   021900      
000659                                                                  022000      
000660 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000661     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000662     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000663     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000664     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000665     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000666     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000667*==============================================================   022800      
000668*                                                             =   022900      
000669* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000670*                                                             =   023100      
000671* CAMPOS REQUERIDOS :                                         =   023200      
000672*                                                             =   023300      
000673* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000674* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000675* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000676* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000677*==============================================================   023800      
000678 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000679    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000680    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000681    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000682    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000683                                                                  024304      
000684*=================================================================024306      
000685*                ENTRY POINT CONSISB01                           =024308      
000686*                                                                =024310      
000687*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000688*                                                                =024314      
000689*  FUNCIONES DISPONIBLES :                                       =024316      
000690*                                                                =024318      
000691*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000692*                                                                =024322      
000693*  PARAMETROS REQUERIDOS                                         =024324      
000694*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000695*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000696*=================================================================024330      
000697                                                                  024332      
000698 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000699     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000700     03 WKS-CON-CSI                PIC 9(02).                     024336      
000701     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000702     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000703        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000704        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000705        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000706        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000707        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000708                                                                  024400      
000709*=================================================================024500      
000710*                ENTRY POINT B02ARCINTER                         =024600      
000711*                                                                =024700      
000712*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000713*                                                                =024900      
000714*  FUNCIONES DISPONIBLES :                                       =025000      
000715*                                                                =025100      
000716*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000717* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000718* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000719* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000720*                                                                =025600      
000721*  PARAMETROS REQUERIDOS                                         =025700      
000722*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000723*                                                                =025900      
000724*=================================================================026000      
000725 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000726     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000727     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000728     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000729     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000730     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000731     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000732     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000733     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000734     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000735     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000736     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000737     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000738     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000739     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000740     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000741     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000742     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000743     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000744     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000745     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000746     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000747     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000748     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000749     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000750     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000751     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000752     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000753     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000754                                                                  029000      
000755*=================================================================029100      
000756*                ENTRY POINT B04SISTEMA                          =029200      
000757*                                                                =029300      
000758*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000759*                                                                =029500      
000760*  FUNCIONES DISPONIBLES :                                       =029600      
000761*                                                                =029700      
000762*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000763*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000764*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000765*                                                                =030100      
000766*  PARAMETROS REQUERIDOS                                         =030200      
000767*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000768*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000769*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000770*                                                                =030600      
000771*=================================================================030700      
000772 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000773     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000774     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000775     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000776     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000777     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000778     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000779     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000780                                                                  031600      
000781*================================================================ 031700      
000782*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000783*                                                               = 031900      
000784*  FUNCION                                                      = 032000      
000785*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000786*   19       ALTAS.                                             = 032200      
000787*   22       BAJAS                                              = 032300      
000788*   37       CAMBIOS.                                           = 032400      
000789*                                                               = 032500      
000790*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000791*                      FECHA DE PROCESO                         = 032700      
000792*                      NUMERO DE PROCESO                        = 032800      
000793*                      FECHA INICIO                             = 032900      
000794*                      REGISTRO INICIAL                         = 033000      
000795*================================================================ 033100      
000796                                                                  033200      
000797 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000798     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000799     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000800     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000801     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000802     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000803     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000804     03 WKS-B05-MIX                PIC 9(08).                     034000      
000805     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000806     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000807     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000808     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000809     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000810     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000811                                                                  034700      
000812                                                                  034800      
000813*================================================================ 034900      
000814*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000815*                                                               = 035100      
000816*  FUNCION                                                      = 035200      
000817*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000818*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000819*                                                               = 035500      
000820*================================================================ 035600      
000821                                                                  035700      
000822 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000823     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000824     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000825     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000826     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000827     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000828     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000829                                                                  036500      
000830*===============================================================  036600      
000831*                                                              =  036700      
000832*         ENTRY-POINT CONSISMEN                                =  036800      
000833*                                                              =  036900      
000834*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000835*                      SISTEMA                                 =  037100      
000836*                                                              =  037200      
000837*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000838*                                                              =  037400      
000839*===============================================================  037500      
000840 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000841     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000842     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000843     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000844     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000845     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000846     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000847     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000848     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000849     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000850     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000851     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000852     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000853     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000854     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000855     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000856        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000857        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000858        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000859        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000860        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000861        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000862        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000863                                                                  039900      
000864*=====================================================            040000      
000865*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000866*=====================================================            040200      
000867 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000868     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000869     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000870     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000871                                                                  040700      
000872*=====================================================            040800      
000873*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000874*=====================================================            041000      
000875 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000876     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000877     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000878     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000879                                                                  041500      
000880*=====================================================            041600      
000881*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000882*=====================================================            041800      
000883 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000884     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000885     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000886     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000887*=====================================================            042300      
000888*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000889*=====================================================            042500      
000890 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000891     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000892     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000893     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000894                                                                  043000      
000895*=====================================================            043100      
000896*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000897*=====================================================            043300      
000898 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000899     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000900     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000901     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000902                                                                  043800      
000903*=====================================================            043900      
000904*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000905*=====================================================            044100      
000906 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000907     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000908     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000909     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000910                                                                  044600      
000911*=====================================================            044700      
000912*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000913*=====================================================            044900      
000914 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000915     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000916     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000917     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000918                                                                  045400      
000919*=====================================================            045500      
000920*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000921*=====================================================            045700      
000922 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000923     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000924     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000925     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000926                                                                  046200      
000927*=====================================================            046300      
000928*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000929*=====================================================            046500      
000930 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000931     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000932     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000933     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000934                                                                  047000      
000935*=====================================================            047100      
000936*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000937*=====================================================            047300      
000938 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000939     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000940     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000941     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000942                                                                  047800      
000943*=====================================================            047900      
000944*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000945*=====================================================            048100      
000946 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000947     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000948     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000949     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000950                                                                  048600      
000951*=====================================================            048700      
000952*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000953*=====================================================            048900      
000954 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000955     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000956     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000957     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000958                                                                  049400      
000959*=====================================================            049500      
000960*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000961*=====================================================            049700      
000962 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000963     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000964     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000965     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000966     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000967     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000968     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000969     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000970     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000971     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000972     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000973                                                                  050900      
000974*=====================================================            051000      
000975*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000976*=====================================================            051200      
000977 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000978     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000979     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000980     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000981     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000982                                                                  051800      
000983*=====================================================            051900      
000984*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000985*=====================================================            052100      
000986 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000987     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000988     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000989     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000990     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000991                                                                  052700      
000992*=====================================================            052800      
000993*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000994*=====================================================            053000      
000995 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000996     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000997     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000998     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000999     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001000                                                                  053600      
001001*=====================================================            053700      
001002*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001003*=====================================================            053900      
001004 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001005     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001006     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001007     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001008     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001009                                                                  054500      
001010*=====================================================            054600      
001011*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001012*=====================================================            054800      
001013 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001014     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001015     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001016     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001017     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001018                                                                  055400      
001019*=====================================================            055500      
001020*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001021*=====================================================            055700      
001022 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001023     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001024     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001025     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001026     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001027                                                                  056300      
001028*=====================================================            056400      
001029*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001030*=====================================================            056600      
001031 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001032     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001033     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001034     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001035     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001036                                                                  057200      
001037 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001038*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001039                                                                  019700      
001040*==========================================================       019800      
001041*         VARIABLES LIBRERIA CONTROL DE VERSIONES         =       019900      
001042*==========================================================       020000      
001043 01  WKS-LIBID                     PIC X(12).                     020100      
001044 01  WKS-NOMLIB                    PIC X(72).                     020200      
001045 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             020300      
001046                                                                  020400      
001047                                                                  020500      
001048 01  WKS-LIBID-L002.                                              020600      
001049     03 FILLER                     PIC X(09) VALUE "S151L002R".   020700      
001050     03 WKS-SIS-L002               PIC 9(03).                     020800      
001051                                                                  020900      
001052 01  WKS-S151-DATOS WITH LOWER-BOUNDS.                            021000      
001053     03 WKS-DEL-FUNCION            PIC 9(04).                     021100      
001054*    03 WKS-DEL-FECHA              PIC 9(06).                     021200      
001055*INICIA CODIGO DE RENOVACION CRONOS 2000                          021300      
001056     03 WKS-DEL-FECHA              PIC 9(08).                     021400      
001057*TERMINA CODIGO DE RENOVACION CRONOS 2000                         021500      
001058     03 WKS-DEL-NUMLOG             PIC 9(02).                     021600      
001059     03 WKS-DEL-PRODUCTO           PIC 9(04).                     021700      
001060     03 WKS-DEL-PROCESO            PIC 9(02).                     021800      
001061                                                                  021900      
001062 01  WKS-LLAMA-L007 WITH LOWER-BOUNDS.                            022000      
001063     03 WKS-L007-FUNCION           PIC 9(02).                     022100      
001064     03 FILLER                     PIC X(04).                     022200      
001065 01  WKS-ERRORES.                                                 022300      
001066     03 FILLER PIC X(31) VALUE "SISTEMA NO HABILITADO EN S151  ". 022400      
001067     03 FILLER PIC X(31) VALUE "FUNCION NO VALIDA              ". 022500      
001068     03 FILLER PIC X(31) VALUE "TRANSACION NO CATALOGADA       ". 022600      
001069     03 FILLER PIC X(31) VALUE "FECHA CONTABLE NO VALIDA       ". 022700      
001070     03 FILLER PIC X(31) VALUE "FALTA LA SUCURSAL PROMOTORA    ". 022800      
001071     03 FILLER PIC X(31) VALUE "FALTA LA SUCURSAL OPERADORA    ". 022900      
001072     03 FILLER PIC X(31) VALUE "EL IMPORTE ES 0                ". 023000      
001073     03 FILLER PIC X(31) VALUE "FALTA REF S151 PARA ELIMINAR   ". 023100      
001074     03 FILLER PIC X(31) VALUE "MOVIMIENTO A ELIMINAR NO EXISTE". 023200      
001075     03 FILLER PIC X(31) VALUE "ORIGEN ERRONEO                 ". 023300      
001076     03 FILLER PIC X(31) VALUE "ELIMINANDO A REG DE ELIMINACION". 023400      
001077 01  WKS-ERRORES-R REDEFINES WKS-ERRORES.                         023500      
001078     03 WKS-ERROR PIC X(31) OCCURS 11 TIMES.                      023600      
001079                                                                  023700      
001080 77  WKS-S151-RESULT               PIC S9(11) BINARY.             023800      
001081*===================================================              023802      
001082*       TABLA PARA TAMAµOS DE ARCHIVOS EN PRUEBAS  *              023804      
001083*===================================================              023806      
001084*PRUEBAS                                                          023808      
001085                                                                  023810      
001086 01 WKS-TAB-PBAS.                                                 023812      
001087    03 FILLER             PIC X(10) VALUE "0500 20000".           023814      
001088    03 FILLER             PIC X(10) VALUE "0264 18000".           023816      
001089    03 FILLER             PIC X(10) VALUE "0501 10000".           023818      
001090    03 FILLER             PIC X(10) VALUE "9999 05000".           023820      
001091    03 FILLER             PIC X(10) VALUE "0000 00000".           023822      
001092    03 FILLER             PIC X(10) VALUE "0000 00000".           023824      
001093    03 FILLER             PIC X(10) VALUE "0000 00000".           023826      
001094    03 FILLER             PIC X(10) VALUE "0000 00000".           023828      
001095    03 FILLER             PIC X(10) VALUE "0000 00000".           023830      
001096    03 FILLER             PIC X(10) VALUE "0000 00000".           023832      
001097    03 FILLER             PIC X(10) VALUE "0000 00000".           023834      
001098    03 FILLER             PIC X(10) VALUE "0000 00000".           023836      
001099    03 FILLER             PIC X(10) VALUE "0000 00000".           023838      
001100    03 FILLER             PIC X(10) VALUE "0000 00000".           023840      
001101    03 FILLER             PIC X(10) VALUE "0000 00000".           023842      
001102    03 FILLER             PIC X(10) VALUE "0000 00000".           023844      
001103    03 FILLER             PIC X(10) VALUE "0000 00000".           023846      
001104    03 FILLER             PIC X(10) VALUE "0000 00000".           023848      
001105    03 FILLER             PIC X(10) VALUE "0000 00000".           023850      
001106    03 FILLER             PIC X(10) VALUE "0000 00000".           023852      
001107                                                                  023857      
001108 01 WKS-TAB-PRUEBAS REDEFINES WKS-TAB-PBAS.                       023860      
001109    03 WKS-PBA-DATOS OCCURS 20 TIMES.                             023864      
001110       05 WKS-PBA-SISTEMA    PIC 9(04).                           023866      
001111       05 FILLER             PIC X(01).                           023868      
001112       05 WKS-PBA-REGISTROS  PIC 9(05).                           023870      
001113                                                                  023872      
001114*=======================================================          023900      
001115*       TABLA PARA TAMAµOS DE ARCHIVOS EN PRODUCCION   *          023902      
001116*=======================================================          023904      
001117*PRODUCCION                                                       023906      
001118                                                                  023908      
001119 01 WKS-TAB-PROD.                                                 023910      
001120    03 FILLER             PIC X(20) VALUE "0500 4000000 4000000". 023912      
001121    03 FILLER             PIC X(20) VALUE "0087 0380000 0380000". 023914      
001122    03 FILLER             PIC X(20) VALUE "0701 0400000 0400000". 023916      
001123    03 FILLER             PIC X(20) VALUE "0501 0800000 0800000". 023918      
001124    03 FILLER             PIC X(20) VALUE "0404 0600000 0600000". 023920      
001125    03 FILLER             PIC X(20) VALUE "0264 0460000 0460000". 023922      
001126    03 FILLER             PIC X(20) VALUE "0084 0460000 0460000". 023924      
001127    03 FILLER             PIC X(20) VALUE "0711 0400000 0400000". 023926      
001128    03 FILLER             PIC X(20) VALUE "0018 0180000 0100000". 023928      
001129    03 FILLER             PIC X(20) VALUE "0702 0180000 0100000". 023930      
001130    03 FILLER             PIC X(20) VALUE "9999 0075000 0075000". 023932      
001131    03 FILLER             PIC X(20) VALUE "0000 0000000 0000000". 023934      
001132    03 FILLER             PIC X(20) VALUE "0000 0000000 0000000". 023936      
001133    03 FILLER             PIC X(20) VALUE "0000 0000000 0000000". 023938      
001134    03 FILLER             PIC X(20) VALUE "0000 0000000 0000000". 023940      
001135    03 FILLER             PIC X(20) VALUE "0000 0000000 0000000". 023942      
001136    03 FILLER             PIC X(20) VALUE "0000 0000000 0000000". 023944      
001137    03 FILLER             PIC X(20) VALUE "0000 0000000 0000000". 023946      
001138    03 FILLER             PIC X(20) VALUE "0000 0000000 0000000". 023948      
001139    03 FILLER             PIC X(20) VALUE "0000 0000000 0000000". 023950      
001140 01 WKS-TAB-PRODUCCION REDEFINES WKS-TAB-PROD.                    023970      
001141    03 WKS-PROD-DATOS OCCURS 50 TIMES.                            023972      
001142       05 WKS-PROD-SISTEMA    PIC 9(04).                          023974      
001143       05 FILLER              PIC X(01).                          023976      
001144       05 WKS-PROD-REGMOV     PIC 9(07).                          023978      
001145       05 FILLER              PIC X(01).                          023979      
001146       05 WKS-PROD-REGDES     PIC 9(07).                          023980      
001147*==========================================================       024200      
001148*         ERRORES DE DMSII                                =       024210      
001149*==========================================================       024220      
001150                                                                  024300      
001151*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001152* COPY "S151/FORMATO/ERROR/DMSII." FROM 1000                      024400      
001153*                                                 TO 60000.       024500      
001154                                                                  001000      
001155                                                                  002000      
001156                                                                  003000      
001157*=================================================================004000      
001158*==            FORMATO PARA MANEJO DE ERRORES DE DMSII         ===005000      
001159*=================================================================006000      
001160                                                                  007000      
001161                                                                  008000      
001162                                                                  009000      
001163 01 WKS-NOM-BDERR-DMSII            PIC  X(20).                    010000      
001164 77 WKS-ERR-DMSII                  PIC  9(02)    VALUE ZEROS.     011000      
001165 01 WKS-TAB-ERRDMSII.                                             012000      
001166    02 FILLER                      PIC X(20)     VALUE            013000      
001167    "NOTFOUND          01".                                       014000      
001168    02 FILLER                      PIC X(20)     VALUE            015000      
001169    "DUPLICATES        02".                                       016000      
001170    02 FILLER                      PIC X(20)     VALUE            017000      
001171    "DEADLOCK          03".                                       018000      
001172    02 FILLER                      PIC X(20)     VALUE            019000      
001173    "DATAERROR         04".                                       020000      
001174    02 FILLER                      PIC X(20)     VALUE            021000      
001175    "NOTLOCKED         05".                                       022000      
001176    02 FILLER                      PIC X(20)     VALUE            023000      
001177    "KEYCHANGE         06".                                       024000      
001178    02 FILLER                      PIC X(20)     VALUE            025000      
001179    "SYSTEMERROR       07".                                       026000      
001180    02 FILLER                      PIC X(20)     VALUE            027000      
001181    "READONLY          08".                                       028000      
001182    02 FILLER                      PIC X(20)     VALUE            029000      
001183    "IOERROR           09".                                       030000      
001184    02 FILLER                      PIC X(20)     VALUE            031000      
001185    "LIMITERROR        10".                                       032000      
001186    02 FILLER                      PIC X(20)     VALUE            033000      
001187    "OPENERROR         11".                                       034000      
001188    02 FILLER                      PIC X(20)     VALUE            035000      
001189    "CLOSEERROR        12".                                       036000      
001190    02 FILLER                      PIC X(20)     VALUE            037000      
001191    "NORECORD          13".                                       038000      
001192    02 FILLER                      PIC X(20)     VALUE            039000      
001193    "INUSE             14".                                       040000      
001194    02 FILLER                      PIC X(20)     VALUE            041000      
001195    "AUDITERROR        15".                                       042000      
001196    02 FILLER                      PIC X(20)     VALUE            043000      
001197    "ABORT             16".                                       044000      
001198    02 FILLER                      PIC X(20)     VALUE            045000      
001199    "SECURITYERROR     17".                                       046000      
001200    02 FILLER                      PIC X(20)     VALUE            047000      
001201    "VERSIONERROR      18".                                       048000      
001202    02 FILLER                      PIC X(20)     VALUE            049000      
001203    "FATALERROR        19".                                       050000      
001204    02 FILLER                      PIC X(20)     VALUE            051000      
001205    "INTEGRITY ERROR   20".                                       052000      
001206    02 FILLER                      PIC X(20)     VALUE            053000      
001207    "INTLIBERROR       21".                                       054000      
001208 01 WKS-TAB-ERRDMSII-R REDEFINES WKS-TAB-ERRDMSII.                055000      
001209    02 WKS-ELETAB-ERRDMSII         OCCURS 21 TIMES.               056000      
001210       03 WKS-LEY-ERR-DMSII        PIC X(18).                     057000      
001211       03 WKS-NUM-ERR-DMSII        PIC 99.                        058000      
001212                                                                  059000      
001213 01 WKS-ERR-BD                     PIC 9(04).                     059100      
001214 01 WKS-ESTRUCT-BD                 PIC X(17).                     059200      
001215                                                                  060000      
001216*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001217*==========================================================       024600      
001218*         NOMBRES DE ARCHIVOS A GENERAR                   =       024700      
001219*==========================================================       024800      
001220                                                                  024900      
001221 01  WKS-L01-MOVTOS.                                              025000      
001222     03 FILLER                     PIC X(20) VALUE                025100      
001223        "(S151)S151/FILE/MOVS".                                   025200      
001224     03 WKS-L01-SISTEMA            PIC 9(03).                     025300      
001225     03 FILLER                     PIC X(01) VALUE "/".           025400      
001226     03 WKS-FECHA-ARCMOV           PIC 9(06).                     025500      
001227     03 FILLER                     PIC X(04) VALUE " ON ".        025600      
001228     03 WKS-PACK-MOVTOS            PIC X(17).                     025700      
001229     03 FILLER                     PIC X(01) VALUE ".".           025800      
001230 01  WKS-REG-LOGS.                                                025900      
001231     03 WKS-FUNCION                PIC 9(02) COMP VALUE 99.       026000      
001232     03 WKS-CEROS.                                                026100      
001233        05 WKS-CERO1               PIC 9(20) COMP VALUE ZERO.     026200      
001234        05 WKS-CERO2               PIC 9(20) COMP VALUE ZERO.     026300      
001235        05 WKS-CERO3               PIC 9(20) COMP VALUE ZERO.     026400      
001236        05 WKS-CERO4               PIC 9(20) COMP VALUE ZERO.     026500      
001237        05 WKS-CERO5               PIC 9(20) COMP VALUE ZERO.     026600      
001238        05 WKS-CERO6               PIC 9(20) COMP VALUE ZERO.     026700      
001239        05 WKS-CERO7               PIC 9(20) COMP VALUE ZERO.     026800      
001240        05 WKS-CERO8               PIC 9(20) COMP VALUE ZERO.     026900      
001241        05 WKS-CERO9               PIC 9(20) COMP VALUE ZERO.     027000      
001242        05 WKS-CER10               PIC 9(20) COMP VALUE ZERO.     027100      
001243        05 WKS-CER11               PIC 9(20) COMP VALUE ZERO.     027200      
001244        05 WKS-CER12               PIC 9(20) COMP VALUE ZERO.     027300      
001245        05 WKS-CER13               PIC 9(20) COMP VALUE ZERO.     027400      
001246        05 WKS-CER14               PIC 9(20) COMP VALUE ZERO.     027500      
001247        05 WKS-CER15               PIC 9(20) COMP VALUE ZERO.     027600      
001248        05 WKS-CER16               PIC 9(20) COMP VALUE ZERO.     027700      
001249        05 WKS-CER17               PIC 9(20) COMP VALUE ZERO.     027800      
001250        05 WKS-CER18               PIC 9(18) COMP VALUE ZERO.     027900      
001251                                                                  028000      
001252 01  WKS-L02-DESCRIP.                                             028100      
001253     03 FILLER                     PIC X(20) VALUE                028200      
001254        "(S151)S151/FILE/DESS".                                   028300      
001255     03 WKS-L02-SISTEMA            PIC 9(03).                     028400      
001256     03 FILLER                     PIC X(01) VALUE "/".           028500      
001257     03 WKS-FECHA-ARCDES           PIC 9(06).                     028600      
001258     03 FILLER                     PIC X(04) VALUE " ON ".        028700      
001259     03 WKS-PACK-DESCRIP           PIC X(17).                     028800      
001260     03 FILLER                     PIC X(01) VALUE ".".           028900      
001261                                                                  029000      
001262 01  WKS-L03-CBII.                                                029100      
001263     03 FILLER                     PIC X(20) VALUE                029200      
001264        "(S151)S151/FILE/CB2S".                                   029300      
001265     03 WKS-L03-SISTEMA            PIC 9(03).                     029400      
001266     03 FILLER                     PIC X(01) VALUE "/".           029500      
001267     03 WKS-FECHA-ARCBII           PIC 9(06).                     029600      
001268     03 FILLER                     PIC X(04) VALUE " ON ".        029700      
001269     03 WKS-PACK-CBII              PIC X(17).                     029800      
001270     03 FILLER                     PIC X(01) VALUE ".".           029900      
001271                                                                  030000      
001272 01  WKS-REG-CBII.                                                030100      
001273     03 WKS-CB-FUNCION             PIC 9(02) COMP VALUE 99.       030200      
001274     03 WKS-CB-CEROS.                                             030300      
001275        05 WKS-CB-CERO1            PIC 9(20) COMP VALUE ZERO.     030400      
001276        05 WKS-CB-CERO2            PIC 9(20) COMP VALUE ZERO.     030500      
001277        05 WKS-CB-CERO3            PIC 9(20) COMP VALUE ZERO.     030600      
001278        05 WKS-CB-CERO4            PIC 9(20) COMP VALUE ZERO.     030700      
001279        05 WKS-CB-CERO5            PIC 9(20) COMP VALUE ZERO.     030800      
001280        05 WKS-CB-CERO6            PIC 9(20) COMP VALUE ZERO.     030900      
001281        05 WKS-CB-CERO7            PIC 9(20) COMP VALUE ZERO.     031000      
001282        05 WKS-CB-CERO8            PIC 9(20) COMP VALUE ZERO.     031100      
001283        05 WKS-CB-CERO9            PIC 9(20) COMP VALUE ZERO.     031200      
001284        05 WKS-CB-CER10            PIC 9(20) COMP VALUE ZERO.     031300      
001285        05 WKS-CB-CER11            PIC 9(20) COMP VALUE ZERO.     031400      
001286        05 WKS-CB-CER12            PIC 9(20) COMP VALUE ZERO.     031500      
001287        05 WKS-CB-CER13            PIC 9(20) COMP VALUE ZERO.     031600      
001288        05 WKS-CB-CER14            PIC 9(20) COMP VALUE ZERO.     031700      
001289        05 WKS-CB-CER15            PIC 9(20) COMP VALUE ZERO.     031800      
001290        05 WKS-CB-CER16            PIC 9(20) COMP VALUE ZERO.     031900      
001291        05 WKS-CB-CER17            PIC 9(20) COMP VALUE ZERO.     032000      
001292        05 WKS-CB-CER18            PIC 9(20) COMP VALUE ZERO.     032100      
001293        05 WKS-CB-CER19            PIC 9(20) COMP VALUE ZERO.     032200      
001294        05 WKS-CB-CER20            PIC 9(20) COMP VALUE ZERO.     032300      
001295        05 WKS-CB-CER21            PIC 9(20) COMP VALUE ZERO.     032400      
001296        05 WKS-CB-CER22            PIC 9(20) COMP VALUE ZERO.     032500      
001297        05 WKS-CB-CER23            PIC 9(20) COMP VALUE ZERO.     032600      
001298        05 WKS-CB-CER24            PIC 9(20) COMP VALUE ZERO.     032700      
001299        05 WKS-CB-CER25            PIC 9(20) COMP VALUE ZERO.     032800      
001300        05 WKS-CB-CER26            PIC 9(20) COMP VALUE ZERO.     032900      
001301        05 WKS-CB-CER28            PIC 9(20) COMP VALUE ZERO.     033000      
001302        05 WKS-CB-CER29            PIC 9(20) COMP VALUE ZERO.     033100      
001303        05 WKS-CB-CER30            PIC 9(20) COMP VALUE ZERO.     033200      
001304        05 WKS-CB-CER31            PIC 9(20) COMP VALUE ZERO.     033300      
001305        05 WKS-CB-CER32            PIC 9(20) COMP VALUE ZERO.     033400      
001306        05 WKS-CB-CER33            PIC 9(20) COMP VALUE ZERO.     033500      
001307        05 WKS-CB-CER34            PIC 9(20) COMP VALUE ZERO.     033600      
001308        05 WKS-CB-CER35            PIC 9(20) COMP VALUE ZERO.     033700      
001309        05 WKS-CB-CER36            PIC 9(20) COMP VALUE ZERO.     033800      
001310        05 WKS-CB-CER38            PIC 9(20) COMP VALUE ZERO.     033900      
001311        05 WKS-CB-CER39            PIC 9(20) COMP VALUE ZERO.     034000      
001312        05 WKS-CB-CER40            PIC 9(20) COMP VALUE ZERO.     034100      
001313        05 WKS-CB-CER41            PIC 9(20) COMP VALUE ZERO.     034200      
001314        05 WKS-CB-CER42            PIC 9(20) COMP VALUE ZERO.     034300      
001315                                                                  034305      
001316 01  WKS-L04-CTDR.                                                034310      
001317     03 FILLER                     PIC X(20) VALUE                034315      
001318        "(S151)S151/FILE/CTDS".                                   034320      
001319     03 WKS-L04-SISTEMA            PIC 9(03).                     034325      
001320     03 FILLER                     PIC X(01) VALUE "/".           034330      
001321     03 WKS-FECHA-ARCTDR           PIC 9(06).                     034335      
001322     03 FILLER                     PIC X(04) VALUE " ON ".        034340      
001323     03 WKS-PACK-CTDR              PIC X(17).                     034345      
001324     03 FILLER                     PIC X(01) VALUE ".".           034350      
001325                                                                  034355      
001326 77  W77-NUMREG                    PIC 9(12) COMP.                034400      
001327 77  W77-NUMREG-DEF                PIC 9(12) VALUE 80000.         034450      
001328 77  W77-REG                       PIC 9(12) COMP.                034500      
001329 77  W77-NREG-DESC                 PIC 9(12) COMP.                034550      
001330 77  W77-NREG-CBII                 PIC 9(12) COMP.                034600      
001331 77  W77-NREG-CTDR                 PIC 9(12) COMP.                034650      
001332 77  W77-ABRE-MOVS                 PIC 9(01) COMP.                034700      
001333 77  W77-ABRE-DES                  PIC 9(01) COMP.                034800      
001334 77  W77-ABRE-CBII                 PIC 9(01) COMP.                034900      
001335 77  W77-ABRE-CTDR                 PIC 9(01) COMP.                034950      
001336 77  W77-BUSQUEDA                  PIC 9(02) COMP.                034970      
001337 01  WKS-ESPACIOS                  PIC X(17) VALUE SPACES.        035000      
001338 01  WKS-NULOS                     PIC X(17).                     035100      
001339 01  WKS-FECHAS-BORRAR.                                           035200      
001340*    03 WKS-FECHA-BOR OCCURS 10 TIMES PIC 9(06).                  035300      
001341*INICIA CODIGO DE RENOVACION CRONOS 2000                          035400      
001342     03 WKS-FECHA-BOR OCCURS 10 TIMES PIC 9(08).                  035500      
001343*TERMINA CODIGO DE RENOVACION CRONOS 2000                         035600      
001344                                                                  035700      
001345 01  WKS-DATASET-BORRAR.                                          035800      
001346     03 WKS-SET-BORRAR OCCURS 50 TIMES PIC 9(02).                 035900      
001347 77  W77-IND-SET                   PIC 9(02).                     036000      
001348                                                                  036100      
001349 01  WKS-CONTINUA                  PIC X(02).                     036200      
001350                                                                  036300      
001351 01  WKS-FECHA-PROCESO.                                           036400      
001352*    03 WKS-AA-PROCESO             PIC 9(02).                     036500      
001353*INICIA CODIGO DE RENOVACION CRONOS 2000                          036600      
001354     03 WKS-AA-PROCESO             PIC 9(04).                     036700      
001355*TERMINA CODIGO DE RENOVACION CRONOS 2000                         036800      
001356     03 WKS-MM-PROCESO             PIC 9(02).                     036900      
001357     03 WKS-DD-PROCESO             PIC 9(02).                     037000      
001358                                                                  037100      
001359 01  WKS-NOMB-BASE12               PIC X(17).                     037200      
001360                                                                  037300      
001361 77  W77-IND-FECBOR                PIC 9(02).                     037400      
001362 77  W77-IND-FECOK                 PIC 9(02).                     037500      
001363 77  W77-NUMSIS                    PIC 9(04).                     037600      
001364                                                                  037700      
001365                                                                  037800      
001366*==========================================================       037900      
001367*         PARAMETRO NUMERO DE SISTEMA                     =       038000      
001368*==========================================================       038100      
001369 77  WKS-SISTEMA                   PIC 9(03).                     038200      
001370 77  W77-EOF                       PIC 9(02).                     038300      
001371*77  W77-FECHA-ANTIER              PIC 9(06).                     038400      
001372*INICIA CODIGO DE RENOVACION CRONOS 2000                          038500      
001373 77  W77-FECHA-ANTIER              PIC 9(08).                     038600      
001374*TERMINA CODIGO DE RENOVACION CRONOS 2000                         038700      
001375*77  W77-FECHA-PROCESO             PIC 9(06).                     038800      
001376*INICIA CODIGO DE RENOVACION CRONOS 2000                          038900      
001377 77  W77-FECHA-PROCESO             PIC 9(08).                     039000      
001378*TERMINA CODIGO DE RENOVACION CRONOS 2000                         039100      
001379*77  W77-FECHA-AYER                PIC 9(06).                     039200      
001380*INICIA CODIGO DE RENOVACION CRONOS 2000                          039300      
001381 77  W77-FECHA-AYER                PIC 9(08).                     039400      
001382*TERMINA CODIGO DE RENOVACION CRONOS 2000                         039500      
001383*77  W77-FECHA-HOY                 PIC 9(06).                     039600      
001384*INICIA CODIGO DE RENOVACION CRONOS 2000                          039700      
001385 77  W77-FECHA-HOY                 PIC 9(08).                     039800      
001386*TERMINA CODIGO DE RENOVACION CRONOS 2000                         039900      
001387*77  W77-FECHA-MANANA              PIC 9(06).                     040000      
001388*INICIA CODIGO DE RENOVACION CRONOS 2000                          040100      
001389 77  W77-FECHA-MANANA              PIC 9(08).                     040200      
001390*TERMINA CODIGO DE RENOVACION CRONOS 2000                         040300      
001391*77  W77-FECHA-PASMAN              PIC 9(06).                     040400      
001392*INICIA CODIGO DE RENOVACION CRONOS 2000                          040500      
001393 77  W77-FECHA-PASMAN              PIC 9(08).                     040600      
001394*TERMINA CODIGO DE RENOVACION CRONOS 2000                         040700      
001395*77  W77-FECHA-BORRAR1             PIC 9(06).                     040800      
001396*INICIA CODIGO DE RENOVACION CRONOS 2000                          040900      
001397 77  W77-FECHA-BORRAR1             PIC 9(08).                     041000      
001398*TERMINA CODIGO DE RENOVACION CRONOS 2000                         041100      
001399*77  W77-FECHA-BORRAR2             PIC 9(06).                     041200      
001400*INICIA CODIGO DE RENOVACION CRONOS 2000                          041300      
001401 77  W77-FECHA-BORRAR2             PIC 9(08).                     041400      
001402*TERMINA CODIGO DE RENOVACION CRONOS 2000                         041500      
001403*77  W77-FECHA-BORRAR3             PIC 9(06).                     041600      
001404*INICIA CODIGO DE RENOVACION CRONOS 2000                          041700      
001405 77  W77-FECHA-BORRAR3             PIC 9(08).                     041800      
001406*TERMINA CODIGO DE RENOVACION CRONOS 2000                         041900      
001407*77  W77-FECHA-BORRAR4             PIC 9(06).                     042000      
001408*INICIA CODIGO DE RENOVACION CRONOS 2000                          042100      
001409 77  W77-FECHA-BORRAR4             PIC 9(08).                     042200      
001410*TERMINA CODIGO DE RENOVACION CRONOS 2000                         042300      
001411*77  W77-FECHA-BORRAR5             PIC 9(06).                     042400      
001412*INICIA CODIGO DE RENOVACION CRONOS 2000                          042500      
001413 77  W77-FECHA-BORRAR5             PIC 9(08).                     042600      
001414*TERMINA CODIGO DE RENOVACION CRONOS 2000                         042700      
001415*77  W77-FECHA-BORRAR-TOTXCVE      PIC 9(06).                     042800      
001416*INICIA CODIGO DE RENOVACION CRONOS 2000                          042900      
001417 77  W77-FECHA-BORRAR-TOTXCVE      PIC 9(08).                     043000      
001418*TERMINA CODIGO DE RENOVACION CRONOS 2000                         043100      
001419 77  W77-EOF-TOTXCVE               PIC 9(02).                     043200      
001420 77  W77-IND-ACTUAL                PIC 9(02).                     043300      
001421*77  W77-FECHA-ACTUAL              PIC 9(06).                     043400      
001422*INICIA CODIGO DE RENOVACION CRONOS 2000                          043500      
001423 77  W77-FECHA-ACTUAL              PIC 9(08).                     043600      
001424*TERMINA CODIGO DE RENOVACION CRONOS 2000                         043700      
001425 77  W77-IND-NUEVO                 PIC 9(02).                     043800      
001426*77  W77-FECHA-ARCH                PIC 9(06).                     043900      
001427*INICIA CODIGO DE RENOVACION CRONOS 2000                          044000      
001428 77  W77-FECHA-ARCH                PIC 9(08).                     044100      
001429*TERMINA CODIGO DE RENOVACION CRONOS 2000                         044200      
001430*77  W77-FECHA-NUEVA               PIC 9(06).                     044300      
001431*INICIA CODIGO DE RENOVACION CRONOS 2000                          044400      
001432 77  W77-FECHA-NUEVA               PIC 9(08).                     044500      
001433*TERMINA CODIGO DE RENOVACION CRONOS 2000                         044600      
001434*77  W77-FECHA-LOG                 PIC 9(06).                     044700      
001435*INICIA CODIGO DE RENOVACION CRONOS 2000                          044800      
001436 77  W77-FECHA-LOG                 PIC 9(08).                     044900      
001437*TERMINA CODIGO DE RENOVACION CRONOS 2000                         045000      
001438*77  W77-FECHA-NAT                 PIC 9(06).                     045100      
001439*INICIA CODIGO DE RENOVACION CRONOS 2000                          045200      
001440 77  W77-FECHA-NAT                 PIC 9(08).                     045300      
001441*TERMINA CODIGO DE RENOVACION CRONOS 2000                         045400      
001442*77  W77-FECHA-BUSCA               PIC 9(06).                     045500      
001443*INICIA CODIGO DE RENOVACION CRONOS 2000                          045600      
001444 77  W77-FECHA-BUSCA               PIC 9(08).                     045700      
001445*TERMINA CODIGO DE RENOVACION CRONOS 2000                         045800      
001446 77  W77-NUMDIA-SEM                PIC 9(02).                     045900      
001447 77  W77-DIAS                      PIC 9(02).                     046000      
001448 77  W77-ERROR                     PIC 9(02).                     046100      
001449 77  W77-ENCONTRADO                PIC 9(02).                     046200      
001450 77  W77-IND                       PIC 9(02).                     046300      
001451 77  W77-IND2                      PIC 9(02).                     046400      
001452*77  W77-FECPRO-NVA                PIC 9(06).                     046500      
001453*INICIA CODIGO DE RENOVACION CRONOS 2000                          046600      
001454 77  W77-FECPRO-NVA                PIC 9(08).                     046700      
001455*TERMINA CODIGO DE RENOVACION CRONOS 2000                         046800      
001456 77  W77-FUN-CALE                  PIC 9(02).                     046900      
001457 77  W77-FUN-CTL                   PIC 9(02).                     047000      
001458 77  W77-ERROR-SISTEMA             PIC 9(02).                     047100      
001459 77  W77-IND-MOVTO                 PIC 9(02).                     047200      
001460 77  W77-SET-HOY                   PIC 9(02).                     047300      
001461 77  W77-SET-MANANA                PIC 9(02).                     047350      
001462 77  W77-SET-BORRAR1               PIC 9(02).                     047400      
001463 77  W77-SET-BORRAR2               PIC 9(02).                     047500      
001464 77  W77-SET-BORRAR3               PIC 9(02).                     047600      
001465 77  W77-FUN-PROY                  PIC 9(02).                     047700      
001466 77  W77-ARCHIVO                   PIC 9(01) VALUE ZERO.          047800      
001467** HSC INI ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  047830      
001468 77  W77-FECPRO-B05                PIC 9(08).                     047850      
001469 77  W77-FECPRO-B05-AUX            PIC 9(08).                     047851      
001470 77  WKS-PROCESADO                 PIC 9(01).                     047852      
001471** HSC FIN ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  047860      
001472*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001473* COPY "(S151)CITIDIRECT/S151/FORMATO/DISPLAY.".                  047900      
001474                                                                  000100      
001475*===============================================================* 000200      
001476*         FORMATO PARA DISPLAYS                                 * 000300      
001477*===============================================================* 000400      
001478                                                                  000500      
001479 01 WKS-TIT-REPORTE2.                                             000600      
001480    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
001481    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
001482    02 FILLER                       PIC X(06) VALUE               000900      
001483                                              "/LIST/".           001000      
001484    02 WKS-PASO-BACK2               PIC X(04).                    001051      
001485    02 FILLER                       PIC X(01) VALUE "/".          001071      
001486    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
001487    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
001488    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
001489    02 FILLER                       PIC X(1)  VALUE "/".          001400      
001490    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
001491    02 FILLER                       PIC X(11) VALUE               001600      
001492                                              "/001MSGIMP.".      001700      
001493                                                                  002100      
001494 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
001495                                                                  002300      
001496***********************************************************       002400      
001497*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
001498***********************************************************       002600      
001499 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
001500*8D                                                               002800      
001501 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
001502 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
001503    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
001504    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
001505    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
001506*8D                                                               003400      
001507 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
001508 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
001509    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
001510    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
001511    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
001512                                                                  004100      
001513 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
001514                                                                  004300      
001515 01 WKS-FECHA-HORA2.                                              004400      
001516    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
001517    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
001518       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
001519       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
001520    02 WKS-TIME-MAQ2.                                             004600      
001521       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
001522       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
001523          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
001524          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
001525          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
001526       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
001527    02 FILLER                             PIC X(01).              004900      
001528    02 WKS-RESTO2                         PIC X(04).              005000      
001529                                                                  005100      
001530*8D                                                               005200      
001531****************** REPORTE DE MENSAJES *********************      005300      
001532 01 WLI-ENCAB-12.                                                 005400      
001533    03 FILLER                             PIC X(05) VALUE         005500      
001534       "S151-".                                                   005600      
001535    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
001536    03 FILLER                             PIC X(15) VALUE         005671      
001537       "-001IMPMENSAJES".                                         005691      
001538    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
001539    03 FILLER                             PIC X(34) VALUE         005800      
001540       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
001541    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
001542    03 FILLER                             PIC X(26) VALUE         006100      
001543       "FECHA DE LA INFORMACION : ".                              006200      
001544    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
001545    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
001546       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
001547       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
001548       05  WKS-SLASH1                         PIC X(01).          006356      
001549       05  WLI-RB-E1-MES                  PIC 99.                 006357      
001550       05  WKS-SLASH2                         PIC X(01).          006358      
001551       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
001552 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
001553 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
001554    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
001555    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
001556    03 FILLER                          PIC X(01).                 006371      
001557    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
001558    03 FILLER                          PIC X(01).                 006381      
001559    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
001560*8D                                                               006400      
001561 01 WLI-ENCAB-22.                                                 006500      
001562     03 FILLER                          PIC X(11) VALUE           006600      
001563        "F.PROCESO: ".                                            006700      
001564     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
001565     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
001566     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
001567     03 FILLER                          PIC X(01) VALUE ":".      007020      
001568     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
001569     03 FILLER                          PIC X(01) VALUE ":".      007060      
001570     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
001571     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
001572     03 FILLER                          PIC X(24) VALUE           007200      
001573              "IMPRESION MENSAJES DEL S".                         007300      
001574     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
001575     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
001576     03 FILLER                          PIC X(14) VALUE           007600      
001577        "TIPO PROCESO: ".                                         007700      
001578     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
001579*8D                                                               007900      
001580 01 WLI-ENCAB-32.                                                 008000      
001581     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
001582*       "VERSION  : ".                                            008200      
001583*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
001584     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
001585     03 FILLER                     PIC X(07) VALUE                008500      
001586        "HOJA : ".                                                008600      
001587     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
001588                                                                  008800      
001589 01 WLI-ENCAB-42.                                                 008900      
001590     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
001591     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
001592     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
001593                                                                  009300      
001594 01 WLI-ENCAB-52.                                                 009400      
001595    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
001596    03 WLI-TIPO-LJ                PIC X(02).                      009600      
001597    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
001598    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
001599                                                                  009900      
001600****************************************************************  010000      
001601*                 CONTADORES DE HOJAS                          *  010100      
001602****************************************************************  010200      
001603                                                                  010300      
001604  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
001605*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001606                                                                  048000      
001607  PROCEDURE DIVISION USING W77-FUN-PROY     ,                     048100      
001608                           WKS-SISTEMA      ,                     048200      
001609                           W77-FECHA-ANTIER ,                     048300      
001610                           W77-FECHA-AYER   ,                     048400      
001611                           W77-FECHA-HOY    ,                     048500      
001612                           W77-FECHA-MANANA ,                     048600      
001613                           W77-FECHA-PASMAN ,                     048700      
001614                           W77-FECHA-BORRAR1,                     048800      
001615                           W77-FECHA-BORRAR2,                     048900      
001616                           W77-FECHA-BORRAR3,                     049000      
001617                           W77-FECHA-BORRAR4,                     049100      
001618                           W77-FECHA-BORRAR5,                     049200      
001619                           W77-SET-HOY      ,                     049300      
001620                           W77-SET-BORRAR1  ,                     049400      
001621                           W77-SET-BORRAR2  ,                     049500      
001622                           W77-SET-BORRAR3  ,                     049600      
001623                           WKS-NOMB-BASE12  .                     049700      
001624*===================                                              049800      
001625                                                                  049900      
001626 01-0010-INICIO.                                                  050000      
001627*===============                                                  050100      
001628     MOVE SPACES                   TO WKS-NOMB-BASE12.            050200      
001629     MOVE ZERO                     TO W77-SET-BORRAR1             050300      
001630                                      W77-SET-BORRAR2             050400      
001631                                      W77-SET-BORRAR3.            050500      
001632     MOVE WKS-SISTEMA              TO W77-NUMSIS                  050600      
001633                                      WKS-SIS-BACK2               050700      
001634                                      WLI-RB-E3-SISTEMA2.         050800      
001635     MOVE "S151"                   TO SISTEMA-LJ.                 050900      
001636     MOVE "P001"                   TO PASO-LJ                     051000      
001637                                      WKS-PASO-BACK2              051100      
001638                                      WLI-RB-E1-PASO.             051200      
001639     MOVE "008"                    TO MTP-LJ.                     051300      
001640     PERFORM 01-0110-ESTABLECE-LIBRERIAS.                         051400      
001641     MOVE  WKS-B01-FECPRO          TO WLI-RB-E1-FECHA-INF2.       051500      
001642     MOVE  WKS-B01-FECPRO151       TO W77-FECPRO-B05              051510      
001643*    MOVE  WKS-B01-CSI             TO WKS-TR-CSI2.                051600      
001644     MOVE SPACES                   TO WLI-TEXTO-LJ.               051700      
001645     PERFORM      01-0110-PROCEDURE-DISPLAY.                      051800      
001646     MOVE 1                        TO W77-ARCHIVO.                051900      
001647     MOVE "I"                      TO WLI-TIPO-LJ.                052000      
001648*    MOVE 051001                   TO CODIGO-LJ.                  052100      
001649     STRING "INICIO PROCESO S"                                    052200      
001650            WKS-SISTEMA                                           052300      
001651            " FECHA "                                             052400      
001652            WKS-B01-FECPRO                                        052500      
001653            " FN " W77-FUN-PROY                                   052600      
001654      DELIMITED BY SIZE                                           052700      
001655      INTO WLI-TEXTO-LJ                                           052800      
001656      PERFORM     000-030-IMPRIME-MENSAJE.                        052900      
001657                                                                  053000      
001658     IF W77-NUMSIS > 0                                            053100      
001659        IF W77-NUMSIS = 999                                       053200      
001660           NEXT SENTENCE                                          053300      
001661        ELSE                                                      053400      
001662        PERFORM 01-0112-DAME-ESQUEMA                              053500      
001663        IF WKS-B04-ESTATUS = 3                                    053600      
001664           NEXT SENTENCE                                          053700      
001665        ELSE                                                      053800      
001666           MOVE "051001"           TO CODIGO-LJ                   053900      
001667           MOVE "O"                TO WLI-TIPO-LJ  TIPO-LJ        054000      
001668           MOVE "ESQUEMA INVALIDO PARA EL SISTEMA" TO WLI-TEXTO-LJ054100      
001669                                                      TEXTO-LJ    054200      
001670           PERFORM        000-030-IMPRIME-MENSAJE                 054300      
001671           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                054400      
001672                                       MENSAJE-LJ                 054500      
001673           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.               054600      
001674     MOVE WKS-B01-FECPRO        TO WKS-FECHA-HOY.                 054700      
001675     IF W77-NUMSIS = 999                                          054800      
001676        IF W77-FUN-PROY = 2                                       054900      
001677           MOVE WKS-B01-FECPRO             TO W77-FECHA-ACTUAL    055000      
001678                                              W77-FECHA-BUSCA     055100      
001679                                              W77-FECHA-HOY       055200      
001680                                              WKS-FECHA-HOY       055300      
001681                                              WKS-FECHA1          055400      
001682           PERFORM 01-0130-PROYECTA-FECHA                         055500      
001683        ELSE                                                      055600      
001684           MOVE SPACE              TO WLI-TEXTO-LJ                055700      
001685           MOVE "051001"           TO CODIGO-LJ                   055800      
001686           MOVE "I"                TO WLI-TIPO-LJ  TIPO-LJ        055900      
001687           STRING "FUNCION INVALIDA PARA EL SISTEMA " W77-NUMSIS  056000      
001688             DELIMITED BY SIZE INTO WLI-TEXTO-LJ                  056100      
001689           PERFORM        000-030-IMPRIME-MENSAJE                 056200      
001690     ELSE                                                         056300      
001691     IF W77-FUN-PROY = 0 OR 2                                     056400      
001692** HSC INI ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  056430      
001693        PERFORM 01-0040-VERIFICA-B05                              056460      
001694        IF WKS-PROCESADO = 0                                      056490      
001695           PERFORM 01-0050-PROY-FECHA                             056500      
001696        ELSE                                                      056530      
001697           NEXT SENTENCE                                          056560      
001698** HSC FIN ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  056590      
001699     ELSE                                                         056600      
001700     IF W77-FUN-PROY = 1                                          056700      
001701        MOVE W77-FECHA-ANTIER        TO WKS-FECHA1                056800      
001702                                        W77-FECHA-ARCH            056900      
001703        MOVE  18                     TO W77-FUNCION               057000      
001704        MOVE  13                     TO W77-FORMATO               057100      
001705        CALL "THECALENDAR IN LOCSUP"   USING W77-FUNCION,         057200      
001706                                           WKS-FECHA1,            057300      
001707                                           WKS-FECHA2,            057400      
001708                                           W77-FORMATO            057500      
001709        IF WKS-FECHA1 = "00000001"                                057600      
001710           MOVE W77-FECHA-ANTIER   TO W77-FECHA-PASMAN            057700      
001711                                      WKS-FECHA-HOY               057800      
001712           PERFORM 01-0030-GENERA-ARCH                            057900      
001713        ELSE                                                      058000      
001714           DISPLAY " ERROR.... FECHA INHABIL " W77-FECHA-ANTIER   058100      
001715           STOP RUN                                               058200      
001716     ELSE                                                         058300      
001717     IF W77-FUN-PROY = 3                                          058400      
001718** HSC INI ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  058430      
001719        MOVE W77-FECPRO-B05-AUX TO W77-FECPRO-B05                 058440      
001720        PERFORM 01-0040-VERIFICA-B05                              058460      
001721        IF WKS-PROCESADO = 0                                      058490      
001722          PERFORM 01-0060-PROY-FECCON                             058500      
001723          IF WKS-SISTEMA = 500                                    058600      
001724             PERFORM 01-0156-LIGA-L007                            058700      
001725*             MOVE 25           TO WKS-L007-FUNCION               058800      
001726             PERFORM 01-0157-LLAMA-L007                           058900      
001727             PERFORM 01-0157-LIGA-L012                            058910      
001728             MOVE 25           TO WKS-L007-FUNCION                058920      
001729             PERFORM 01-0157-LLAMA-L012                           058930      
001730          ELSE                                                    059000      
001731             NEXT SENTENCE                                        059100      
001732        ELSE                                                      059105      
001733          NEXT SENTENCE                                           059150      
001734** HSC FIN ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  059155      
001735     ELSE                                                         059200      
001736     IF W77-FUN-PROY = 4                                          059300      
001737        PERFORM 01-0153-LIGA-L002                                 059400      
001738        MOVE 0022            TO WKS-DEL-FUNCION                   059500      
001739        PERFORM 01-0155-LLAMA-L002                                059600      
001740     ELSE                                                         059700      
001741     IF W77-FUN-PROY = 5                                          059800      
001742        PERFORM 01-0153-LIGA-L002                                 059900      
001743        MOVE 0023            TO WKS-DEL-FUNCION                   060000      
001744        PERFORM 01-0155-LLAMA-L002                                060100      
001745     ELSE                                                         060120      
001746     IF W77-FUN-PROY = 6                                          060140      
001747        PERFORM 01-0113-CONSULTA-SISTEMA                          060160      
001748        MOVE WKS-B01-FECPRO           TO W77-FECHA-ANTIER         060180      
001749                                         W77-FECHA-AYER           060185      
001750                                         W77-FECHA-HOY            060190      
001751     ELSE                                                         060200      
001752        MOVE "I"             TO WLI-TIPO-LJ TIPO-LJ               060300      
001753        MOVE 05100           TO CODIGO-LJ                         060400      
001754        MOVE "NUMERO DE FUNCION INVALIDA" TO WLI-TEXTO-LJ         060500      
001755                                             TEXTO-LJ             060600      
001756        PERFORM        000-030-IMPRIME-MENSAJE                    060700      
001757        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                   060800      
001758                                    MENSAJE-LJ                    060900      
001759        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  061000      
001760     CANCEL "CTLVER".                                             061100      
001761     CLOSE        V00-REPORTE2.                                   061200      
001762     STOP RUN.                                                    061300      
001763                                                                  061400      
001764 01-0110-PROCEDURE-DISPLAY.                                       061500      
001765*==========================                                       061600      
001766*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001767*     COPY "(S151)CITIDIRECT/S151/FORMATO/PROCEDURE/DISPLAY.".    061700      
001768                                                                  000100      
001769*===============================================================* 000200      
001770*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
001771*         PARA LLAMADO DE DISPLAY                               * 000400      
001772*===============================================================* 000500      
001773                                                                  000600      
001774     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
001775            TO BYFUNCTION.                                        000671      
001776                                                                  000691      
001777     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
001778          USING WKS-DATE-ARRAY2.                                  000800      
001779     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
001780     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
001781     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
001782     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
001783     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
001784     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
001785                                                                  001300      
001786     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
001787     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
001788     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
001789                               WKS-TIT-REPORTE2.                  001700      
001790*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
001791*                                  GIVING WKS-COMPILA2.           001900      
001792*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
001793*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
001794*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
001795*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
001796                                                                  002066      
001797*    IF WKS-AAA-VERSION2  < 50                                    002071      
001798*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
001799*    ELSE                                                         002081      
001800*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
001801                                                                  002091      
001802                                                                  002500      
001803*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
001804     OPEN OUTPUT V00-REPORTE2.                                    002700      
001805     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
001806     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
001807                                                                  003000      
001808 000-050-CHECA-SALTO-HOJA2.                                       003051      
001809*==========================                                       003071      
001810    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
001811     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
001812        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
001813     ELSE                                                         003079      
001814        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
001815     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
001816     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
001817     MOVE "/"                     TO WKS-SLASH1.                  003086      
001818     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
001819     MOVE "/"                     TO WKS-SLASH2.                  003088      
001820     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
001821     IF  WKS-NUM-LINEAS2 > 56                                     003091      
001822         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
001823         ADD 1                   TO    W77-CONT-HOJA2             003200      
001824         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
001825         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
001826         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
001827         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
001828         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
001829         MOVE SPACES             TO V00-R00-REPORTE2              003800      
001830         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
001831         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
001832                                                                  004100      
001833 000-030-IMPRIME-MENSAJE.                                         004200      
001834*========================                                         004300      
001835*LP                                                               004400      
001836     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
001837     ADD             2       TO WKS-NUM-LINEAS2                   004600      
001838     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
001839                                                                  004800      
001840*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001841                                                                  061800      
001842 01-0110-ESTABLECE-LIBRERIAS.                                     061900      
001843*============================                                     062000      
001844                                                                  062100      
001845     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     062200      
001846     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      062300      
001847                                                                  062400      
001848     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.062500      
001849     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            062600      
001850                                      "SOPORTECOMS".              062700      
001851                                                                  062800      
001852     CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION.     062900      
001853     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP".       063000      
001854                                                                  063050      
001855     CHANGE ATTRIBUTE TITLE OF "LIB-DISP" TO                      063100      
001856            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK".       063200      
001857                                                                  063300      
001858     CALL "CSIID IN SOPORTECOMS" USING WKS-SOPCOMS.               063400      
001859     CANCEL "SOPORTECOMS".                                        063500      
001860                                                                  063600      
001861     MOVE "S151L001CTL"            TO WKS-LIBID.                  063700      
001862     CALL "DAME_TIT IN CTLVER"     USING  WKS-LIBID,              063800      
001863                                          WKS-NOMLIB              063900      
001864                                   GIVING W77-ERR-CTLVER.         064000      
001865     IF W77-ERR-CTLVER = 0                                        064100      
001866        CHANGE ATTRIBUTE TITLE  OF "LIB-CONTROL" TO WKS-NOMLIB    064200      
001867     ELSE                                                         064300      
001868        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                064400      
001869         "(S151)S151/OBJECT/L001/CONTROL ON CMEMP".               064500      
001870     MOVE WKS-NUMCSI               TO WKS-TR-CSI2.                064600      
001871** HSC INI ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  064610      
001872     IF W77-FUN-PROY = 3                                          064620      
001873        PERFORM 01-01131-OBTENER-FEC-SIST                         064630      
001874        MOVE  WKS-B01-FECPRO151       TO W77-FECPRO-B05-AUX.      064640      
001875** HSC FIN ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  064650      
001876     IF WKS-SISTEMA > 0                                           064700      
001877        PERFORM 01-0113-CONSULTA-SISTEMA.                         064800      
001878                                                                  064900      
001879     IF W77-RESULT-LIBCON > 0                                     065000      
001880        PERFORM 01-0950-ERROR-LIBCTL.                             065100      
001881                                                                  065200      
001882 01-0030-GENERA-ARCH.                                             065300      
001883*====================                                             065400      
001884*     MOVE W77-FECHA-ARCH           TO WKS-FECHA1.                065500      
001885     MOVE W77-FECHA-ARCH           TO A2K-FEC-CAMD-001            065600      
001886     PERFORM A2K-CONV-CAMD-TO-AMD  THROUGH                        065700      
001887             A2K-CONV-CAMD-TO-AMD-EXIT.                           065800      
001888     MOVE A2K-FEC-AMD-001          TO WKS-FECHA1-RED.             065900      
001889     MOVE 20                       TO W77-FUNCION                 066000      
001890                                      W77-FUN-CALE.               066100      
001891     MOVE 3                        TO W77-FORMATO.                066200      
001892*INICIA CODIGO DE RENOVACION CRONOS 2000                          066300      
001893*    MOVE 13                       TO W77-FORMATO.                066400      
001894*TERMINA CODIGO DE RENOVACION CRONOS 2000                         066500      
001895*    MOVE "000000"                 TO WKS-FECHA2.                 066600      
001896*INICIA CODIGO DE RENOVACION CRONOS 2000                          066700      
001897     MOVE "00000000"               TO WKS-FECHA2.                 066800      
001898*TERMINA CODIGO DE RENOVACION CRONOS 2000                         066900      
001899     CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,              067000      
001900                                      WKS-FECHA1,                 067100      
001901                                      WKS-FECHA2,                 067200      
001902                                      W77-FORMATO.                067300      
001903     IF W77-FUNCION > 0                                           067400      
001904        PERFORM 01-0900-ERROR-CALE.                               067500      
001905     MOVE WKS-FECHA-HOY            TO WKS-FECHA1.                 067600      
001906     MOVE 13                       TO W77-FUNCION                 067700      
001907                                      W77-FUN-CALE.               067800      
001908*    MOVE 3                        TO W77-FORMATO.                067900      
001909*INICIA CODIGO DE RENOVACION CRONOS 2000                          068000      
001910     MOVE 13                       TO W77-FORMATO.                068100      
001911*TERMINA CODIGO DE RENOVACION CRONOS 2000                         068200      
001912*    MOVE "000001"                 TO WKS-FECHA2.                 068300      
001913*INICIA CODIGO DE RENOVACION CRONOS 2000                          068400      
001914     MOVE "00000001"               TO WKS-FECHA2.                 068500      
001915*TERMINA CODIGO DE RENOVACION CRONOS 2000                         068600      
001916     CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,              068700      
001917                                      WKS-FECHA1,                 068800      
001918                                      WKS-FECHA2,                 068900      
001919                                      W77-FORMATO.                069000      
001920     IF W77-FUNCION > 0                                           069100      
001921        PERFORM 01-0900-ERROR-CALE.                               069200      
001922     MOVE WKS-FECHA1               TO WKS-FECHA-MANANA.           069300      
001923     CANCEL "LIB-CONTROL".                                        069400      
001924     IF W77-RESULT-LIBCON = 0                                     069500      
001925        MOVE WKS-B01-NOMPACMOV     TO WKS-PACK-MOVTOS             069600      
001926        MOVE WKS-B01-NOMPACDES     TO WKS-PACK-DESCRIP            069700      
001927                                      WKS-PACK-CBII               069800      
001928                                      WKS-PACK-CTDR               069850      
001929        MOVE WKS-FECHA-MANANA      TO WKS-FECHA1                  069900      
001930        MOVE 13                    TO W77-FUNCION                 070000      
001931                                      W77-FUN-CALE                070100      
001932        MOVE "00000001"            TO WKS-FECHA2                  070200      
001933        MOVE 13                    TO W77-FORMATO                 070300      
001934        CALL "THECALENDAR IN LOCSUP"    USING W77-FUNCION,        070400      
001935                                            WKS-FECHA1,           070500      
001936                                            WKS-FECHA2,           070600      
001937                                            W77-FORMATO           070700      
001938        IF W77-FUNCION > 0                                        070800      
001939           PERFORM 01-0900-ERROR-CALE                             070900      
001940        ELSE                                                      071000      
001941           MOVE WKS-FECHA1            TO WKS-FECHA-PASMAN         071100      
001942           MOVE 13                    TO W77-FUNCION              071200      
001943                                         W77-FUN-CALE             071300      
001944           MOVE "00000001"            TO WKS-FECHA2               071400      
001945           MOVE 13                    TO W77-FORMATO              071500      
001946           CALL "THECALENDAR IN LOCSUP"    USING W77-FUNCION,     071600      
001947                                               WKS-FECHA1,        071700      
001948                                               WKS-FECHA2,        071800      
001949                                               W77-FORMATO        071900      
001950           IF W77-FUNCION > 0                                     072000      
001951              PERFORM 01-0900-ERROR-CALE                          072100      
001952           ELSE                                                   072200      
001953              MOVE WKS-FECHA1         TO WKS-FECHA-3ERHABIL       072300      
001954              MOVE WKS-SISTEMA        TO WKS-L01-SISTEMA          072400      
001955                                         WKS-L02-SISTEMA          072500      
001956                                         WKS-L03-SISTEMA          072600      
001957                                         WKS-L04-SISTEMA          072650      
001958              PERFORM 01-0040-BUSCA-INHABILES                     072700      
001959              PERFORM 01-0160-GENERA-ARCHIVOS                     072800      
001960     ELSE                                                         072900      
001961        PERFORM 01-0950-ERROR-LIBCTL.                             073000      
001962 01-0040-BUSCA-INHABILES.                                         073100      
001963*========================                                         073200      
001964     MOVE WKS-FECHA-HOY            TO WKS-FECHA1.                 073300      
001965     MOVE 8                        TO W77-FUNCION                 073400      
001966                                      W77-FUN-CALE.               073500      
001967     MOVE "00000001"               TO WKS-FECHA2.                 073600      
001968     MOVE 13                       TO W77-FORMATO.                073700      
001969     CALL "THECALENDAR IN LOCSUP"    USING W77-FUNCION,           073800      
001970                                         WKS-FECHA1,              073900      
001971                                         WKS-FECHA2,              074000      
001972                                         W77-FORMATO.             074100      
001973     IF W77-FUNCION > 0                                           074200      
001974        PERFORM 01-0900-ERROR-CALE                                074300      
001975     ELSE                                                         074400      
001976        MOVE 8                  TO W77-FUNCION                    074500      
001977                                   W77-FUN-CALE                   074600      
001978        MOVE "00000001"         TO WKS-FECHA2                     074700      
001979        MOVE 13                 TO W77-FORMATO                    074800      
001980        CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,           074900      
001981                                         WKS-FECHA1,              075000      
001982                                         WKS-FECHA2,              075100      
001983                                         W77-FORMATO              075200      
001984        IF W77-FUNCION > 0                                        075300      
001985           PERFORM 01-0900-ERROR-CALE                             075400      
001986        ELSE                                                      075500      
001987           MOVE WKS-FECHA1      TO WKS-FECHA-NAT                  075600      
001988           IF WKS-FECHA-NAT = WKS-FECHA-PASMAN                    075700      
001989              NEXT SENTENCE                                       075800      
001990           ELSE                                                   075900      
001991              MOVE 1         TO W77-INHABIL.                      076000      
001992                                                                  076100      
001993 01-0050-PROY-FECHA.                                              076200      
001994*===================                                              076300      
001995                                                                  076400      
001996     IF WKS-SISTEMA > 0                                           076500      
001997        MOVE WKS-SISTEMA           TO W77-NUMSIS                  076600      
001998        MOVE WKS-B01-NOMBDSEM   TO WKS-NOM-BASESEM                076700      
001999        CHANGE ATTRIBUTE TITLE OF BASESEM TO WKS-BASEMOV          076800      
002000        MOVE WKS-B01-FECPRO        TO WKS-FECHA-HOY               076900      
002001        PERFORM 01-0114-DAME-BASE12.                              077000      
002002                                                                  077100      
002003     PERFORM 01-0105-LIMPIA-ARREGLOS                              077200      
002004             VARYING W77-IND-SET FROM 1 BY 1                      077300      
002005             UNTIL   W77-IND-SET > 10.                            077400      
002006                                                                  077500      
002007     MOVE ZERO                     TO W77-IND-SET.                077600      
002008     IF WKS-SISTEMA = 0                                           077700      
002009        MOVE ZERO                  TO W77-EOF                     077800      
002010        MOVE WKS-SISTEMA           TO WKS-B04-SISTEMA             077900      
002011                                                                  078000      
002012        PERFORM 01-0117-FN-B04NOMSIS                              078100      
002013        PERFORM 01-0118-PROYECTA-SISTEMAS                         078200      
002014                UNTIL W77-EOF = 1                                 078300      
002015     ELSE                                                         078400      
002016        PERFORM 01-0116-ABRE-BASE UNTIL W88-BASE-OPEN             078500      
002017        PERFORM 01-0120-VALIDA-SISTEMA                            078600      
002018        PERFORM 01-0055-MUEVE-FECHA                               078700      
002019        PERFORM 01-0130-PROYECTA-FECHA                            078800      
002020        PERFORM 01-0131-PROYFECHA                                 078900      
002021        PERFORM 01-0140-GRABA-FECHAS                              079000      
002022        PERFORM 01-0150-CIERRA-BASE                               079100      
002023        IF W77-FUN-PROY = 0 OR 2                                  079200      
002024           IF W77-FUN-PROY = 2                                    079300      
002025              PERFORM 01-0153-LIGA-L002                           079400      
002026              MOVE 0022            TO WKS-DEL-FUNCION             079500      
002027              PERFORM 01-0155-LLAMA-L002                          079600      
002028           ELSE                                                   079700      
002029              PERFORM 01-0153-LIGA-L002                           079800      
002030              MOVE 0025            TO WKS-DEL-FUNCION             079900      
002031              PERFORM 01-0155-LLAMA-L002.                         080000      
002032                                                                  080100      
002033     IF W77-FUN-PROY = 2                                          080105      
002034        IF WKS-SET-BORRAR(1) = W77-SET-MANANA                     080110      
002035           MOVE ZERO               TO WKS-SET-BORRAR(1).          080115      
002036     IF W77-FUN-PROY = 2                                          080120      
002037        IF WKS-SET-BORRAR(2) = W77-SET-MANANA                     080125      
002038           MOVE ZERO               TO WKS-SET-BORRAR(2).          080130      
002039     IF W77-FUN-PROY = 2                                          080135      
002040        IF WKS-SET-BORRAR(3) = W77-SET-MANANA                     080140      
002041           MOVE ZERO               TO WKS-SET-BORRAR(3).          080145      
002042                                                                  080150      
002043     MOVE WKS-SET-BORRAR(1)        TO W77-SET-BORRAR1.            080200      
002044     MOVE WKS-SET-BORRAR(2)        TO W77-SET-BORRAR2.            080300      
002045     MOVE WKS-SET-BORRAR(3)        TO W77-SET-BORRAR3.            080400      
002046                                                                  080500      
002047 01-0055-MUEVE-FECHA.                                             080600      
002048*====================                                             080700      
002049     IF W77-FUN-PROY = 2                                          080800      
002050        MOVE WKS-B01-FECCON        TO W77-FECHA-ACTUAL            080900      
002051                                      W77-FECHA-BUSCA             081000      
002052                                      W77-FECHA-HOY               081100      
002053                                      WKS-FECHA-HOY               081200      
002054                                      WKS-FECHA1                  081300      
002055     ELSE                                                         081400      
002056        MOVE WKS-B01-FECPRO        TO W77-FECHA-ACTUAL            081500      
002057                                      W77-FECHA-BUSCA             081600      
002058                                      W77-FECHA-HOY               081700      
002059                                      WKS-FECHA-HOY               081800      
002060                                      WKS-FECHA1.                 081900      
002061                                                                  082000      
002062 01-0060-PROY-FECCON.                                             082100      
002063*====================                                             082200      
002064     MOVE WKS-B01-FECCON           TO WKS-FECHA1.                 082300      
002065     MOVE "00000001"               TO WKS-FECHA2.                 082400      
002066*    MOVE 3                        TO W77-FORMATO.                082500      
002067*INICIA CODIGO DE RENOVACION CRONOS 2000                          082600      
002068     MOVE 13                       TO W77-FORMATO.                082700      
002069*TERMINA CODIGO DE RENOVACION CRONOS 2000                         082800      
002070     MOVE 13                       TO W77-FUNCION                 082900      
002071                                      W77-FUN-CALE.               083000      
002072     CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,              083100      
002073                                      WKS-FECHA1,                 083200      
002074                                      WKS-FECHA2,                 083300      
002075                                      W77-FORMATO.                083400      
002076     IF W77-FUNCION > 0                                           083500      
002077        PERFORM 01-0900-ERROR-CALE.                               083600      
002078     MOVE WKS-FECHA1               TO W77-FECPRO-NVA.             083700      
002079*    IF WKS-B01-FECCON = WKS-B01-FECPRO OR                        083800      
002080*       WKS-B01-FECPRO = W77-FECPRO-NVA                           083900      
002081        MOVE WKS-B01-FECCON        TO W77-FECHA-ACTUAL            084000      
002082                                      W77-FECHA-BUSCA             084100      
002083                                      W77-FECHA-HOY               084200      
002084                                      WKS-FECHA-HOY               084300      
002085                                      WKS-FECHA1      .           084400      
002086        PERFORM 01-0130-PROYECTA-FECHA                            084500      
002087        MOVE W77-FECHA-AYER        TO W77-FECHA-BUSCA .           084510      
002088        MOVE ZERO                  TO W77-ENCONTRADO  .           084515      
002089        PERFORM 01-0134-BUSCA-INDICE                              084520      
002090                VARYING W77-IND FROM 1 BY 1                       084530      
002091                UNTIL   W77-IND > 10 OR                           084540      
002092                        W77-ENCONTRADO = 1            .           084550      
002093        IF W77-ENCONTRADO = 1      AND                            084555      
002094           WKS-B01-FECARCMOV(W77-IND-ACTUAL) < WKS-B01-FECCON     084557      
002095           MOVE ZERO         TO WKS-B01-STAARCLOG(W77-IND-ACTUAL) 084560      
002096                                WKS-B01-NIVARCMOV(W77-IND-ACTUAL) 084570      
002097                                WKS-B01-NIVBDMOV (W77-IND-ACTUAL).084580      
002098                                                                  084590      
002099        MOVE ZERO                  TO W77-IND-FECBOR  .           084600      
002100        PERFORM 01-0138-DAME-FECHAS VARYING W77-IND FROM 1 BY 1   084700      
002101                                    UNTIL   W77-IND > 10.         084800      
002102                                                                  084900      
002103        MOVE W77-NUMSIS            TO WKS-B01-SISTEMA             085000      
002104        MOVE WKS-NUMCSI            TO WKS-B01-CSI                 085100      
002105        MOVE 37                    TO WKS-B01-FUNCION             085200      
002106        MOVE W77-FECPRO-NVA        TO WKS-B01-FECCON              085300      
002107        MOVE ZERO                  TO WKS-B01-STAREG              085400      
002108        CALL "MANTSISDIA IN LIB-CONTROL"                          085410      
002109             USING  WKS-S151B01SISDIA                             085420      
002110             GIVING W77-RESULT-LIBCON.                            085430      
002111                                                                  085440      
002112        PERFORM 01-0153-LIGA-L002                                 085500      
002113        MOVE 0025                  TO WKS-DEL-FUNCION             085600      
002114        PERFORM 01-0155-LLAMA-L002                                085700      
002115        MOVE 0023                  TO WKS-DEL-FUNCION             085800      
002116        PERFORM 01-0155-LLAMA-L002                                085900      
002117        MOVE W77-FECHA-PASMAN      TO W77-FECHA-ARCH              086000      
002118        PERFORM 01-0030-GENERA-ARCH.                              086100      
002119** HSC INI ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  086130      
002120        PERFORM 01-0060-ACTUALIZA-B05.                            086160      
002121** HSC INI ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  086190      
002122*    ELSE                                                         086200      
002123*       PERFORM 01-0153-LIGA-L002                                 086300      
002124*       MOVE 0023                  TO WKS-DEL-FUNCION             086400      
002125*       PERFORM 01-0155-LLAMA-L002                                086500      
002126*       MOVE "O"                   TO WLI-TIPO-LJ TIPO-LJ         086600      
002127*       MOVE 051010                TO CODIGO-LJ                   086700      
002128*       MOVE                                                      086800      
002129*       "PROYECCION YA EFECTUADA O PROCESO FUERA DE SECUENCIA"    086900      
002130*                                  TO WLI-TEXTO-LJ TEXTO-LJ       087000      
002131*       PERFORM        000-030-IMPRIME-MENSAJE                    087100      
002132*       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                   087200      
002133*                                   MENSAJE-LJ.                   087300      
002134                                                                  087400      
002135 01-0105-LIMPIA-ARREGLOS.                                         087500      
002136*========================                                         087600      
002137     MOVE ZERO                     TO WKS-SET-BORRAR(W77-IND-SET) 087700      
002138                                      WKS-FECHA-BOR(W77-IND-SET). 087800      
002139                                                                  087900      
002140 01-0112-DAME-ESQUEMA.                                            088000      
002141*====================                                             088100      
002142     MOVE 01                       TO WKS-B04-FUNCION             088200      
002143                                      W77-FUN-CTL.                088300      
002144     MOVE W77-NUMSIS               TO WKS-B04-SISTEMA             088400      
002145     MOVE ZERO                     TO WKS-B04-PRODUCTO            088500      
002146                                      WKS-B04-INSTRUM.            088600      
002147     CALL "B04SISTEM IN LIB-CONTROL" USING  WKS-B04SISTEMA        088700      
002148                                     GIVING W77-RESULT-LIBCON.    088800      
002149     IF W77-RESULT-LIBCON = 0                                     088900      
002150        NEXT SENTENCE                                             089000      
002151     ELSE                                                         089100      
002152        PERFORM 01-0950-ERROR-LIBCTL.                             089200      
002153     MOVE WKS-B04-SISTEMA          TO W77-NUMSIS.                 089300      
002154                                                                  089400      
002155 01-0113-CONSULTA-SISTEMA.                                        089500      
002156*=========================                                        089600      
002157     MOVE ZERO                     TO W77-RESULT-LIBCON.          089700      
002158     MOVE 1                        TO WKS-B01-FUNCION             089800      
002159                                      W77-FUN-CTL.                089900      
002160     MOVE W77-NUMSIS               TO WKS-B01-SISTEMA.            090000      
002161     MOVE WKS-NUMCSI               TO WKS-B01-CSI.                090100      
002162                                                                  090200      
002163     CALL "CONSISDIA IN LIB-CONTROL" USING  WKS-S151B01SISDIA     090300      
002164                                     GIVING W77-RESULT-LIBCON.    090400      
002165                                                                  090500      
002166 01-0114-DAME-BASE12.                                             090600      
002167*====================                                             090700      
002168     MOVE ZERO                     TO W77-RESULT-LIBCON.          090800      
002169     MOVE 1                        TO WKS-B03-FUNCION.            090900      
002170     MOVE WKS-SISTEMA              TO WKS-B03-SISTEMA.            091000      
002171                                                                  091100      
002172     CALL "CONSISMEN IN LIB-CONTROL" USING  WKS-S151B03SISMEN     091200      
002173                                     GIVING W77-RESULT-LIBCON.    091300      
002174     MOVE ZERO                     TO W77-ENCONTRADO.             091400      
002175     IF W77-RESULT-LIBCON = 0                                     091500      
002176        PERFORM 01-0115-BUSCA-BD12 VARYING W77-IND FROM 1 BY 1    091600      
002177                UNTIL W77-ENCONTRADO = 1 OR                       091700      
002178                      W77-IND > WKS-B03-NUMCICDIA.                091800      
002179                                                                  091900      
002180 01-0115-BUSCA-BD12.                                              092000      
002181*===================                                              092100      
002182     IF WKS-B03-AAMM(W77-IND) = WKS-AAMM-HOY                      092200      
002183        MOVE 1                     TO W77-ENCONTRADO              092300      
002184        MOVE WKS-B03-NOMBDMOV(W77-IND) TO WKS-NOMB-BASE12.        092400      
002185                                                                  092500      
002186 01-0116-ABRE-BASE.                                               092600      
002187*==================                                               092700      
002188                                                                  092730      
002189     MOVE 1                       TO W77-BASE.                    092750      
002190     ADD  1                       TO W77-INTENTOS.                092770      
002191                                                                  092790      
002192     OPEN UPDATE BASESEM                                          092800      
002193       ON EXCEPTION                                               092900      
002194          IF DMSTATUS(OPENERROR)     AND                          092920      
002195             DMSTATUS(DMERRORTYPE) = 39                           092940      
002196             WAIT(20)                                             092960      
002197             MOVE ZERO            TO W77-BASE                     092970      
002198          ELSE                                                    092980      
002199             MOVE WKS-B01-NOMBDSEM TO WKS-NOM-BDERR-DMSII         093000      
002200             PERFORM 900000-CHE-STA                               093100      
002201             CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.             093200      
002202                                                                  093300      
002203     IF W77-INTENTOS > 5                                          093310      
002204        MOVE "O"                TO WLI-TIPO-LJ TIPO-LJ            093320      
002205        MOVE ZERO               TO W77-INTENTOS                   093324      
002206        MOVE 060315             TO CODIGO-LJ                      093330      
002207        MOVE DMSTATUS(DMCATEGORY)    TO W77-NUM-CAT               093332      
002208        MOVE DMSTATUS(DMERRORTYPE)   TO W77-NUM-SUBCAT            093334      
002209        STRING "ERROR EN BASE BD10 : ARCHIVO DE CONTROL EN USO "  093340      
002210               "EN FORMA EXCLUSIVA"                               093345      
002211               " ERROR DMSII CAT. " WKS-DB-CAT(W77-NUM-CAT)       093350      
002212               " SUBCATEGORIA " W77-NUM-SUBCAT                    093355      
002213        DELIMITED BY SIZE                                         093360      
002214        INTO TEXTO-LJ                                             093370      
002215        MOVE TEXTO-LJ           TO WLI-TEXTO-LJ                   093380      
002216        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      093385      
002217                                                                  093390      
002218                                                                  093400      
002219 01-0117-FN-B04NOMSIS.                                            093500      
002220*=====================                                            093600      
002221     MOVE 02                       TO WKS-B04-FUNCION             093700      
002222                                      W77-FUN-CTL.                093800      
002223     MOVE ZERO                     TO WKS-B04-PRODUCTO            093900      
002224                                      WKS-B04-INSTRUM.            094000      
002225     CALL "B04SISTEM IN LIB-CONTROL" USING  WKS-B04SISTEMA        094100      
002226                                     GIVING W77-RESULT-LIBCON.    094200      
002227     IF W77-RESULT-LIBCON = 0                                     094300      
002228        MOVE WKS-B04-SISTEMA       TO W77-NUMSIS                  094400      
002229     ELSE                                                         094500      
002230        IF W77-RESULT-LIBCON = 1                                  094600      
002231           MOVE 1                  TO W77-EOF                     094700      
002232        ELSE                                                      094800      
002233           PERFORM 01-0950-ERROR-LIBCTL.                          094900      
002234     MOVE WKS-B04-SISTEMA          TO W77-NUMSIS.                 095000      
002235                                                                  095100      
002236 01-0118-PROYECTA-SISTEMAS.                                       095200      
002237*==========================                                       095300      
002238     IF WKS-B04-ESTATUS = 1 OR                                    095400      
002239        WKS-B04-ESTATUS = 2                                       095500      
002240        MOVE ZERO                  TO W77-ERROR-SISTEMA           095600      
002241        PERFORM 01-0120-VALIDA-SISTEMA                            095700      
002242        IF W77-ERROR-SISTEMA = 0                                  095800      
002243           MOVE WKS-B01-FECCON     TO WKS-B01-FECPRO              095900      
002244           MOVE WKS-B01-FECPRO     TO W77-FECHA-ACTUAL            096000      
002245                                      W77-FECHA-BUSCA             096100      
002246                                      W77-FECHA-HOY               096200      
002247                                      WKS-FECHA-HOY               096300      
002248                                      WKS-FECHA1                  096400      
002249           PERFORM 01-0130-PROYECTA-FECHA                         096500      
002250           MOVE WKS-NUMCSI         TO WKS-B01-CSI                 096600      
002251           MOVE 37                 TO WKS-B01-FUNCION             096700      
002252           MOVE W77-FECPRO-NVA     TO WKS-B01-FECPRO              096800      
002253                                      WKS-B01-FECCON              096900      
002254           MOVE ZERO               TO WKS-B01-STAREG              097000      
002255           CALL "MANTSISDIA IN LIB-CONTROL"                       097100      
002256                USING  WKS-S151B01SISDIA                          097200      
002257                GIVING W77-RESULT-LIBCON.                         097300      
002258                                                                  097400      
002259                                                                  097500      
002260     MOVE 02                       TO WKS-B04-FUNCION             097600      
002261                                      W77-FUN-CTL.                097700      
002262     MOVE ZERO                     TO WKS-B04-PRODUCTO            097800      
002263                                      WKS-B04-INSTRUM             097900      
002264                                      W77-RESULT-LIBCON.          098000      
002265     CALL "B04SISTEM IN LIB-CONTROL" USING  WKS-B04SISTEMA        098100      
002266                                 GIVING W77-RESULT-LIBCON.        098200      
002267     IF W77-RESULT-LIBCON = 0                                     098300      
002268        MOVE WKS-B04-SISTEMA       TO W77-NUMSIS                  098400      
002269     ELSE                                                         098500      
002270        IF W77-RESULT-LIBCON = 1                                  098600      
002271           MOVE 1                  TO W77-EOF                     098700      
002272        ELSE                                                      098800      
002273           PERFORM 01-0950-ERROR-LIBCTL.                          098900      
002274     MOVE WKS-B04-SISTEMA          TO W77-NUMSIS.                 099000      
002275                                                                  099100      
002276 01-0120-VALIDA-SISTEMA.                                          099200      
002277*====================                                             099300      
002278     MOVE ZERO                     TO W77-ERROR-SISTEMA.          099400      
002279     PERFORM 01-0113-CONSULTA-SISTEMA.                            099500      
002280     IF W77-RESULT-LIBCON > 0                                     099600      
002281        MOVE 1                     TO W77-ERROR-SISTEMA           099700      
002282        IF W77-RESULT-LIBCON = 1                                  099800      
002283           MOVE "I"              TO TIPO-LJ WLI-TIPO-LJ           099900      
002284           MOVE 040101           TO CODIGO-LJ                     100000      
002285           STRING "NO EXISTE EL SISTEMA "                         100100      
002286                  W77-NUMSIS                                      100200      
002287                  " EN LA BASE DE CONTROL"                        100300      
002288           DELIMITED BY SIZE                                      100400      
002289           INTO TEXTO-LJ                                          100500      
002290           MOVE TEXTO-LJ           TO WLI-TEXTO-LJ                100600      
002291           PERFORM        000-030-IMPRIME-MENSAJE                 100700      
002292*          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ    100800      
002293        ELSE                                                      100900      
002294           PERFORM 01-0950-ERROR-LIBCTL                           101000      
002295     ELSE                                                         101100      
002296        IF WKS-SISTEMA    > 0     AND                             101200      
002297           WKS-B01-STAREG = 1     AND                             101300      
002298           W77-FUN-PROY   = 0                                     101400      
002299           MOVE "I"                TO WLI-TIPO-LJ TIPO-LJ         101500      
002300           MOVE 051010             TO CODIGO-LJ                   101600      
002301           STRING "ESTATUS INVALIDO PARA PROYECCION DE FECHA S"   101700      
002302                  WKS-SISTEMA                                     101800      
002303           DELIMITED BY SIZE                                      101900      
002304           INTO TEXTO-LJ                                          102000      
002305           MOVE TEXTO-LJ           TO WLI-TEXTO-LJ                102100      
002306           PERFORM        000-030-IMPRIME-MENSAJE                 102200      
002307           CALL "LJ IN LIB-DISP"   USING CONTADOR-LJ, MENSAJE-LJ  102300      
002308           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                102400      
002309        ELSE                                                      102500      
002310           IF WKS-SISTEMA > 0                                     102600      
002311              MOVE W77-NUMSIS      TO WKS-L01-SISTEMA             102700      
002312                                      WKS-L02-SISTEMA             102800      
002313              MOVE LOW-VALUES      TO WKS-NULOS                   102900      
002314              PERFORM 01-0125-NOMBRE-PACK.                        103000      
002315                                                                  103100      
002316 01-0125-NOMBRE-PACK.                                             103200      
002317*====================                                             103300      
002318     IF WKS-B01-NOMPACMOV = WKS-ESPACIOS  OR                      103400      
002319        WKS-B01-NOMPACMOV = WKS-NULOS                             103500      
002320        MOVE "CMEMP"               TO WKS-PACK-MOVTOS             103600      
002321     ELSE                                                         103700      
002322        MOVE WKS-B01-NOMPACMOV     TO WKS-PACK-MOVTOS.            103800      
002323     IF WKS-B01-NOMPACDES = WKS-ESPACIOS  OR                      103900      
002324        WKS-B01-NOMPACDES = WKS-ESPACIOS                          104000      
002325        MOVE "CMEMP"               TO WKS-PACK-DESCRIP            104100      
002326                                      WKS-PACK-CBII               104200      
002327                                      WKS-PACK-CTDR               104250      
002328     ELSE                                                         104300      
002329        MOVE WKS-B01-NOMPACDES     TO WKS-PACK-DESCRIP            104400      
002330                                      WKS-PACK-CBII               104500      
002331                                      WKS-PACK-CTDR.              104550      
002332                                                                  104600      
002333 01-0130-PROYECTA-FECHA.                                          104700      
002334*======================                                           104800      
002335*                                                                 104900      
002336*=========  FECHAS DE PROCESO                                     105000      
002337*                                                                 105100      
002338                                                                  105200      
002339*    MOVE WKS-B01-FECPRO           TO W77-FECHA-ACTUAL            105300      
002340*                                     W77-FECHA-BUSCA             105400      
002341*                                     W77-FECHA-HOY               105500      
002342*                                     WKS-FECHA-HOY               105600      
002343*                                     WKS-FECHA1.                 105700      
002344     IF (WKS-SISTEMA > 0 AND WKS-B04-ESTATUS = 3)                 105800      
002345        MOVE ZERO                  TO W77-ENCONTRADO              105900      
002346        PERFORM 01-0134-BUSCA-INDICE                              106000      
002347                VARYING W77-IND FROM 1 BY 1                       106100      
002348                UNTIL   W77-IND > 10 OR                           106200      
002349                        W77-ENCONTRADO = 1                        106300      
002350        IF W77-ENCONTRADO = 1                                     106400      
002351           IF W77-IND-ACTUAL > 5                                  106500      
002352              COMPUTE W77-SET-HOY = W77-IND-ACTUAL - 5            106600      
002353              COMPUTE W77-IND-MOVTO = W77-IND-ACTUAL - 5          106700      
002354           ELSE                                                   106800      
002355              MOVE W77-IND-ACTUAL  TO W77-SET-HOY                 106900      
002356                                      W77-IND-MOVTO               107000      
002357        ELSE                                                      107100      
002358           MOVE ZERO               TO W77-SET-HOY.                107200      
002359                                                                  107300      
002360*=========  LA FECHA DE PROCESO SE PROYECTA UN DIA HABIL.         107400      
002361                                                                  107500      
002362     MOVE "00000001"               TO WKS-FECHA2.                 107600      
002363*    MOVE 3                        TO W77-FORMATO.                107700      
002364*INICIA CODIGO DE RENOVACION CRONOS 2000                          107800      
002365     MOVE 13                       TO W77-FORMATO.                107900      
002366*TERMINA CODIGO DE RENOVACION CRONOS 2000                         108000      
002367     MOVE 13                       TO W77-FUNCION                 108100      
002368                                      W77-FUN-CALE.               108200      
002369     CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,              108300      
002370                                      WKS-FECHA1,                 108400      
002371                                      WKS-FECHA2,                 108500      
002372                                      W77-FORMATO.                108600      
002373     IF W77-FUNCION > 0                                           108700      
002374        PERFORM 01-0900-ERROR-CALE.                               108800      
002375                                                                  108900      
002376     MOVE WKS-FECHA1               TO W77-FECPRO-NVA              109000      
002377                                      W77-FECHA-BUSCA             109050      
002378                                      W77-FECHA-MANANA.           109100      
002379     MOVE W77-FECHA-MANANA         TO WKS-FECHA-MANANA.           109200      
002380                                                                  109205      
002381     IF (WKS-SISTEMA > 0 AND WKS-B04-ESTATUS = 3)                 109210      
002382        MOVE ZERO                  TO W77-ENCONTRADO              109215      
002383        PERFORM 01-0134-BUSCA-INDICE                              109220      
002384                VARYING W77-IND FROM 1 BY 1                       109225      
002385                UNTIL   W77-IND > 10 OR                           109230      
002386                        W77-ENCONTRADO = 1                        109235      
002387                                                                  109240      
002388    IF W77-ENCONTRADO = 1                                         109245      
002389       IF W77-IND-ACTUAL > 5                                      109250      
002390          COMPUTE W77-SET-MANANA  = W77-IND-ACTUAL - 5            109255      
002391       ELSE                                                       109260      
002392          MOVE W77-IND-ACTUAL  TO W77-SET-MANANA.                 109265      
002393                                                                  109270      
002394*============= LA FECHA DE PROCESO DE PROYECTA 2 DIAS HABILES.    109300      
002395     MOVE 13                       TO W77-FUNCION                 109400      
002396                                      W77-FUN-CALE.               109500      
002397     MOVE W77-FECHA-MANANA         TO WKS-FECHA1.                 109600      
002398     MOVE "00000001"               TO WKS-FECHA2.                 109700      
002399*    MOVE 3                        TO W77-FORMATO.                109800      
002400*INICIA CODIGO DE RENOVACION CRONOS 2000                          109900      
002401     MOVE 13                       TO W77-FORMATO.                110000      
002402*TERMINA CODIGO DE RENOVACION CRONOS 2000                         110100      
002403     CALL "THECALENDAR IN LOCSUP"    USING W77-FUNCION,           110200      
002404                                         WKS-FECHA1,              110300      
002405                                         WKS-FECHA2,              110400      
002406                                         W77-FORMATO.             110500      
002407     IF W77-FUNCION > 0                                           110600      
002408        PERFORM 01-0900-ERROR-CALE.                               110700      
002409     MOVE WKS-FECHA1               TO W77-FECHA-PASMAN            110800      
002410                                      WKS-FECHA-PASMAN.           110900      
002411                                                                  111000      
002412*========== SE PROYECTA LA FECHA UN DIA HABIL                     111100      
002413                                                                  111200      
002414     MOVE 13                       TO W77-FUNCION                 111300      
002415                                      W77-FUN-CALE.               111400      
002416     MOVE W77-FECHA-PASMAN         TO WKS-FECHA1.                 111500      
002417     MOVE "00000001"               TO WKS-FECHA2.                 111600      
002418*    MOVE 3                        TO W77-FORMATO.                111700      
002419*INICIA CODIGO DE RENOVACION CRONOS 2000                          111800      
002420     MOVE 13                       TO W77-FORMATO.                111900      
002421*TERMINA CODIGO DE RENOVACION CRONOS 2000                         112000      
002422     CALL "THECALENDAR IN LOCSUP"    USING W77-FUNCION,           112100      
002423                                         WKS-FECHA1,              112200      
002424                                         WKS-FECHA2,              112300      
002425                                         W77-FORMATO.             112400      
002426     IF W77-FUNCION > 0                                           112500      
002427        PERFORM 01-0900-ERROR-CALE.                               112600      
002428     MOVE WKS-FECHA1               TO WKS-FECHA-3ERHABIL.         112700      
002429                                                                  112800      
002430*=========== SE PROYECTA LA FECHA DE PROCESO UN DIA NATURAL       112900      
002431*                                                                 113000      
002432     MOVE W77-FECHA-ACTUAL         TO WKS-FECHA1.                 113100      
002433     MOVE "00000001"               TO WKS-FECHA2.                 113200      
002434*    MOVE 3                        TO W77-FORMATO.                113300      
002435*INICIA CODIGO DE RENOVACION CRONOS 2000                          113400      
002436     MOVE 13                       TO W77-FORMATO.                113500      
002437*TERMINA CODIGO DE RENOVACION CRONOS 2000                         113600      
002438     MOVE 8                        TO W77-FUNCION                 113700      
002439                                      W77-FUN-CALE.               113800      
002440                                                                  113900      
002441     CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,              114000      
002442                                      WKS-FECHA1,                 114100      
002443                                      WKS-FECHA2,                 114200      
002444                                      W77-FORMATO.                114300      
002445                                                                  114400      
002446     IF W77-FUNCION > 0                                           114500      
002447        PERFORM 01-0900-ERROR-CALE.                               114600      
002448                                                                  114700      
002449     MOVE WKS-FECHA1               TO W77-FECHA-NAT.              114800      
002450                                                                  114900      
002451*=========   LA FECHA DE PROCESO DE PROYECTA UN DIA ATRAS.        115000      
002452                                                                  115100      
002453     MOVE W77-FECHA-ACTUAL         TO WKS-FECHA1.                 115200      
002454     MOVE 15                       TO W77-FUNCION                 115300      
002455                                      W77-FUN-CALE.               115400      
002456     MOVE "00000001"               TO WKS-FECHA2.                 115500      
002457*    MOVE 3                        TO W77-FORMATO.                115600      
002458*INICIA CODIGO DE RENOVACION CRONOS 2000                          115700      
002459     MOVE 13                       TO W77-FORMATO.                115800      
002460*TERMINA CODIGO DE RENOVACION CRONOS 2000                         115900      
002461     CALL "THECALENDAR IN LOCSUP"    USING W77-FUNCION,           116000      
002462                                         WKS-FECHA1,              116100      
002463                                         WKS-FECHA2,              116200      
002464                                         W77-FORMATO.             116300      
002465     IF W77-FUNCION > 0                                           116400      
002466        PERFORM 01-0900-ERROR-CALE.                               116500      
002467                                                                  116600      
002468     MOVE WKS-FECHA1               TO W77-FECHA-AYER              116700      
002469                                      W77-FECHA-ACTUAL.           116800      
002470                                                                  116900      
002471*=========   LA FECHA DE PROCESO DE PROYECTA DOS DIAS ATRAS.      117000      
002472     MOVE 15                       TO W77-FUNCION                 117100      
002473                                      W77-FUN-CALE.               117200      
002474     MOVE W77-FECHA-ACTUAL         TO WKS-FECHA1.                 117300      
002475     MOVE "00000002"               TO WKS-FECHA2.                 117400      
002476*    MOVE 3                        TO W77-FORMATO.                117500      
002477*INICIA CODIGO DE RENOVACION CRONOS 2000                          117600      
002478     MOVE 13                       TO W77-FORMATO.                117700      
002479*TERMINA CODIGO DE RENOVACION CRONOS 2000                         117800      
002480     CALL "THECALENDAR IN LOCSUP"    USING W77-FUNCION,           117900      
002481                                         WKS-FECHA1,              118000      
002482                                         WKS-FECHA2,              118100      
002483                                         W77-FORMATO.             118200      
002484     IF W77-FUNCION > 0                                           118300      
002485        PERFORM 01-0900-ERROR-CALE.                               118400      
002486     MOVE WKS-FECHA1               TO W77-FECHA-ANTIER.           118500      
002487                                                                  118600      
002488     MOVE ZERO                     TO W77-IND-FECBOR.             118700      
002489     PERFORM 01-0138-DAME-FECHAS                                  118800      
002490             VARYING W77-IND FROM 1 BY 1                          118900      
002491             UNTIL   W77-IND > 10.                                119000      
002492                                                                  119100      
002493     MOVE WKS-FECHA-BOR(1)         TO W77-FECHA-BORRAR1.          119200      
002494     MOVE WKS-FECHA-BOR(2)         TO W77-FECHA-BORRAR2.          119300      
002495     MOVE WKS-FECHA-BOR(3)         TO W77-FECHA-BORRAR3.          119400      
002496     MOVE WKS-FECHA-BOR(4)         TO W77-FECHA-BORRAR4.          119500      
002497     MOVE WKS-FECHA-BOR(5)         TO W77-FECHA-BORRAR5.          119600      
002498                                                                  119700      
002499 01-0131-PROYFECHA.                                               119800      
002500*==================                                               119900      
002501                                                                  120000      
002502*==========================================================       120100      
002503*         PROYECCION DE FECHAS                            =       120200      
002504*==========================================================       120300      
002505                                                                  120400      
002506     MOVE W77-FECHA-HOY            TO W77-FECHA-BUSCA.            120500      
002507     IF W77-FECPRO-NVA = W77-FECHA-NAT                            120600      
002508        PERFORM 01-0132-PROYECTA-DIAS                             120700      
002509     ELSE                                                         120800      
002510        PERFORM 01-0132-PROYECTA-DIAS                             120900      
002511                UNTIL W77-FECHA-NAT = W77-FECPRO-NVA.             121000      
002512                                                                  121100      
002513     MOVE ZERO                     TO W77-IND                     121200      
002514                                      W77-IND2                    121300      
002515                                      W77-IND-FECBOR              121400      
002516                                      W77-IND-FECOK.              121500      
002517                                                                  121600      
002518                                                                  121700      
002519 01-0132-PROYECTA-DIAS.                                           121800      
002520*======================                                           121900      
002521     MOVE ZERO                     TO W77-ENCONTRADO.             122000      
002522     PERFORM 01-0134-BUSCA-INDICE                                 122100      
002523             VARYING W77-IND FROM 1 BY 1                          122200      
002524             UNTIL   W77-IND > 10 OR                              122300      
002525                     W77-ENCONTRADO = 1.                          122400      
002526     IF W77-ENCONTRADO = 1                                        122500      
002527        PERFORM 01-0133-INDICE-NUEVO                              122600      
002528        IF W77-FUN-PROY  = 0                                      122700      
002529           MOVE 8                  TO W77-FUNCION                 122800      
002530           MOVE W77-FECHA-BUSCA    TO WKS-FECHA1                  122900      
002531           MOVE "00000001"         TO WKS-FECHA2                  123000      
002532*          MOVE 3                  TO W77-FORMATO                 123100      
002533*INICIA CODIGO DE RENOVACION CRONOS 2000                          123200      
002534           MOVE 13                 TO W77-FORMATO                 123300      
002535*TERMINA CODIGO DE RENOVACION CRONOS 2000                         123400      
002536           MOVE ZERO               TO W77-DIAS                    123500      
002537           PERFORM 01-0136-CALCULA-FECHA UNTIL W77-DIAS = 8       123600      
002538           MOVE ZERO         TO WKS-B01-STAARCLOG(W77-IND-NUEVO)  123700      
002539                                WKS-B01-NIVARCMOV(W77-IND-NUEVO)  123800      
002540                                WKS-B01-NIVBDMOV(W77-IND-NUEVO)   123900      
002541           MOVE W77-FECHA-NUEVA    TO                             124000      
002542                                WKS-B01-FECARCMOV(W77-IND-NUEVO). 124100      
002543     MOVE 8                     TO W77-FUNCION                    124200      
002544                                   W77-FUN-CALE.                  124300      
002545     MOVE W77-FECHA-BUSCA          TO WKS-FECHA1.                 124400      
002546     MOVE "00000001"               TO WKS-FECHA2.                 124500      
002547*    MOVE 3                        TO W77-FORMATO.                124600      
002548*INICIA CODIGO DE RENOVACION CRONOS 2000                          124700      
002549     MOVE 13                       TO W77-FORMATO.                124800      
002550*TERMINA CODIGO DE RENOVACION CRONOS 2000                         124900      
002551     CALL "THECALENDAR IN LOCSUP"    USING W77-FUNCION,           125000      
002552                                         WKS-FECHA1,              125100      
002553                                         WKS-FECHA2,              125200      
002554                                         W77-FORMATO.             125300      
002555     IF W77-FUNCION > 0                                           125400      
002556        PERFORM 01-0900-ERROR-CALE.                               125500      
002557     MOVE WKS-FECHA1               TO W77-FECHA-BUSCA             125600      
002558                                      W77-FECHA-NAT.              125700      
002559 01-0133-INDICE-NUEVO.                                            125800      
002560*=====================                                            125900      
002561                                                                  126000      
002562     IF W77-IND-ACTUAL > 2                                        126100      
002563        COMPUTE W77-IND-NUEVO = (8 + W77-IND-ACTUAL) - 10         126200      
002564     ELSE                                                         126300      
002565        COMPUTE W77-IND-NUEVO = 8 + W77-IND-ACTUAL.               126400      
002566                                                                  126500      
002567     IF WKS-SISTEMA > 0                                           126600      
002568         COMPUTE W77-IND-SET = W77-IND-SET + 1                    126700      
002569         IF W77-IND-NUEVO < 6                                     126800      
002570            MOVE W77-IND-NUEVO     TO WKS-SET-BORRAR(W77-IND-SET) 126900      
002571         ELSE                                                     127000      
002572            COMPUTE WKS-SET-BORRAR(W77-IND-SET)=W77-IND-NUEVO - 5.127100      
002573                                                                  127200      
002574     MOVE WKS-B01-FECARCMOV(W77-IND-NUEVO)                        127300      
002575                                   TO W77-FECHA-BORRAR-TOTXCVE.   127400      
002576 01-0134-BUSCA-INDICE.                                            127500      
002577*=====================                                            127600      
002578     IF WKS-B01-FECARCMOV(W77-IND) =  W77-FECHA-BUSCA             127700      
002579        MOVE W77-IND               TO W77-IND-ACTUAL              127800      
002580        MOVE 1                     TO W77-ENCONTRADO.             127900      
002581                                                                  128000      
002582 01-0136-CALCULA-FECHA.                                           128100      
002583*===================                                              128200      
002584     CALL "THECALENDAR  IN LOCSUP " USING W77-FUNCION             128300      
002585                                        WKS-FECHA1                128400      
002586                                        WKS-FECHA2                128500      
002587                                        W77-FORMATO.              128600      
002588     IF W77-FUNCION > 0                                           128700      
002589        PERFORM 01-0900-ERROR-CALE.                               128800      
002590                                                                  128900      
002591     MOVE WKS-FECHA1               TO W77-FECHA-NUEVA.            129000      
002592                                                                  129100      
002593     MOVE 6                        TO W77-FUNCION                 129200      
002594                                      W77-FUN-CALE.               129300      
002595     MOVE "00000001"               TO WKS-FECHA2.                 129400      
002596*    MOVE 3                        TO W77-FORMATO.                129500      
002597*INICIA CODIGO DE RENOVACION CRONOS 2000                          129600      
002598     MOVE 13                       TO W77-FORMATO.                129700      
002599*TERMINA CODIGO DE RENOVACION CRONOS 2000                         129800      
002600     CALL "THECALENDAR  IN LOCSUP "  USING W77-FUNCION,           129900      
002601                                         WKS-FECHA1,              130000      
002602                                         WKS-FECHA2,              130100      
002603                                         W77-FORMATO.             130200      
002604     IF W77-FUNCION > 0                                           130300      
002605        PERFORM 01-0900-ERROR-CALE.                               130400      
002606                                                                  130500      
002607*    IF WKS-FECHA1 = "000000" OR WKS-FECHA1 = "000006"            130600      
002608*INICIA CODIGO DE RENOVACION CRONOS 2000                          130700      
002609     IF WKS-FECHA1 = "00000000" OR WKS-FECHA1 = "00000006"        130800      
002610*TERMINA CODIGO DE RENOVACION CRONOS 2000                         130900      
002611        NEXT SENTENCE                                             131000      
002612     ELSE                                                         131100      
002613        COMPUTE W77-DIAS = W77-DIAS + 1.                          131200      
002614                                                                  131300      
002615                                                                  131400      
002616     IF W77-DIAS < 8                                              131500      
002617        MOVE 8                     TO W77-FUNCION                 131600      
002618        MOVE W77-FECHA-NUEVA       TO WKS-FECHA1                  131700      
002619        MOVE "00000001"            TO WKS-FECHA2                  131800      
002620*       MOVE 3                     TO W77-FORMATO.                131900      
002621*INICIA CODIGO DE RENOVACION CRONOS 2000                          132000      
002622        MOVE 13                    TO W77-FORMATO.                132100      
002623*TERMINA CODIGO DE RENOVACION CRONOS 2000                         132200      
002624                                                                  132300      
002625 01-0138-DAME-FECHAS.                                             132400      
002626*====================                                             132500      
002627                                                                  132600      
002628     IF WKS-B01-FECARCMOV(W77-IND) = W77-FECHA-HOY      OR        132700      
002629        WKS-B01-FECARCMOV(W77-IND) = W77-FECHA-AYER     OR        132800      
002630        WKS-B01-FECARCMOV(W77-IND) = W77-FECHA-ANTIER   OR        132900      
002631        WKS-B01-FECARCMOV(W77-IND) = W77-FECHA-MANANA   OR        133000      
002632        WKS-B01-FECARCMOV(W77-IND) = W77-FECHA-PASMAN             133100      
002633        NEXT SENTENCE                                             133200      
002634     ELSE                                                         133300      
002635        COMPUTE W77-IND-FECBOR = W77-IND-FECBOR + 1               133400      
002636        MOVE WKS-B01-FECARCMOV(W77-IND)                           133500      
002637                                 TO WKS-FECHA-BOR(W77-IND-FECBOR).133600      
002638                                                                  133700      
002639 01-0140-GRABA-FECHAS.                                            133800      
002640*=====================                                            133900      
002641     MOVE ZERO                     TO W77-ENCONTRADO.             134000      
002642     PERFORM 01-0141-NUMARCH-NUEVO                                134100      
002643             VARYING W77-IND FROM 1 BY 1                          134200      
002644             UNTIL W77-IND > 10 OR                                134300      
002645             W77-ENCONTRADO = 1.                                  134400      
002646                                                                  134500      
002647     IF W77-ENCONTRADO = 0                                        134600      
002648        MOVE "I"                   TO TIPO-LJ WLI-TIPO-LJ         134700      
002649        MOVE 051001                TO CODIGO-LJ                   134800      
002650        STRING "FECHA INEXISTENTE EN ARREGLO PROCESO CANCELADO S" 134900      
002651               WKS-B01-SISTEMA                                    135000      
002652        DELIMITED BY SIZE                                         135100      
002653        INTO TEXTO-LJ                                             135200      
002654        MOVE TEXTO-LJ              TO WLI-TEXTO-LJ                135300      
002655        PERFORM        000-030-IMPRIME-MENSAJE                    135400      
002656        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                  135500      
002657                                    MENSAJE-LJ                    135600      
002658        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  135700      
002659     IF W77-FUN-PROY = 0                                          135800      
002660        COMPUTE W77-IND = W77-IND - 1                             135900      
002661        MOVE W77-NUMSIS            TO WKS-B01-SISTEMA             136000      
002662        MOVE WKS-NUMCSI            TO WKS-B01-CSI                 136100      
002663        MOVE 37                    TO WKS-B01-FUNCION             136200      
002664        MOVE W77-FECPRO-NVA        TO WKS-B01-FECPRO              136300      
002665        MOVE W77-IND               TO WKS-B01-NUMARC              136400      
002666        MOVE W77-FECHA-NUEVA       TO                             136500      
002667             WKS-B01-FECARCMOV(W77-IND-NUEVO)                     136600      
002668        PERFORM 01-0144-LIMPIA-NIVELES                            136700      
002669        MOVE 01              TO WKS-B01-STAREG                    136800      
002670        CALL "MANTSISDIA IN LIB-CONTROL"                          136900      
002671              USING  WKS-S151B01SISDIA                            137000      
002672              GIVING W77-RESULT-LIBCON                            137100      
002673        PERFORM 01-0142-BORRA-NIVELES                             137200      
002674        PERFORM 01-0143-BORRA-TOTXCVES                            137300      
002675        IF W77-RESULT-LIBCON > 0                                  137400      
002676              PERFORM 01-0950-ERROR-LIBCTL                        137500      
002677** HSC INI ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  137510      
002678        ELSE                                                      137520      
002679              PERFORM 01-0060-ACTUALIZA-B05.                      137530      
002680** HSC INI ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  137540      
002681                                                                  137600      
002682 01-0141-NUMARCH-NUEVO.                                           137700      
002683*======================                                           137800      
002684     IF WKS-B01-FECARCMOV(W77-IND) =  W77-FECPRO-NVA              137900      
002685        MOVE 1                     TO W77-ENCONTRADO.             138000      
002686                                                                  138100      
002687 01-0142-BORRA-NIVELES.                                           138200      
002688*======================                                           138300      
002689                                                                  138400      
002690     LOCK BASESEM                                                 138500      
002691       ON EXCEPTION                                               138600      
002692          MOVE WKS-B01-NOMBDSEM    TO WKS-NOM-BDERR-DMSII         138700      
002693          PERFORM 900000-CHE-STA.                                 138800      
002694                                                                  138900      
002695     MOVE ZERO                     TO                             139000      
002696                                 B00-GLOB-NIV-BASE(W77-IND-MOVTO) 139100      
002697                                 B00-GLOB-NIV-LOG(W77-IND-MOVTO)  139200      
002698                                 B00-GLOB-NIV-BORA(W77-IND-MOVTO) 139300      
002699                                 B00-GLOB-NIV-BOR(W77-IND-MOVTO). 139400      
002700     BEGIN-TRANSACTION NO-AUDIT S151B99REINICIO.                  139500      
002701        STORE BASESEM                                             139600      
002702           ON EXCEPTION                                           139700      
002703              MOVE WKS-B01-NOMBDSEM TO WKS-NOM-BDERR-DMSII        139800      
002704              PERFORM 900000-CHE-STA.                             139900      
002705*             CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.            140000      
002706     END-TRANSACTION AUDIT S151B99REINICIO.                       140100      
002707                                                                  140200      
002708 01-0143-BORRA-TOTXCVES.                                          140300      
002709*======================                                           140400      
002710     MOVE ZERO                     TO W77-EOF-TOTXCVE.            140500      
002711     LOCK FIRST B50SXTOTXCVE                                      140600      
002712       AT B50-MOV-FEC NOT > W77-FECHA-BORRAR-TOTXCVE              140700      
002713       ON EXCEPTION                                               140800      
002714          IF DMSTATUS(NOTFOUND)                                   140900      
002715             MOVE 1             TO W77-EOF-TOTXCVE                141000      
002716          ELSE                                                    141100      
002717             MOVE 1             TO W77-EOF-TOTXCVE                141200      
002718             MOVE "O"           TO WLI-TIPO-LJ                    141300      
002719             MOVE "ERROR EN LOCK SOBRE TOTALES POR CLAVE FF"      141400      
002720                                TO WLI-TEXTO-LJ                   141500      
002721             PERFORM        000-030-IMPRIME-MENSAJE.              141600      
002722                                                                  141700      
002723     PERFORM 01-0145-BORRA-TOTXCVE UNTIL W77-EOF-TOTXCVE = 1.     141800      
002724                                                                  141900      
002725 01-0144-LIMPIA-NIVELES.                                          142000      
002726*=======================                                          142100      
002727     MOVE ZERO                     TO WKS-B01-STAARCLOG(W77-IND)  142200      
002728                                      WKS-B01-NIVARCMOV(W77-IND)  142300      
002729                                      WKS-B01-NIVBDMOV(W77-IND).  142400      
002730     IF W77-IND = 1                                               142500      
002731        MOVE 10                    TO W77-IND                     142600      
002732     ELSE                                                         142700      
002733        COMPUTE W77-IND = W77-IND - 1.                            142800      
002734                                                                  142900      
002735     MOVE ZERO                     TO WKS-B01-STAARCLOG(W77-IND)  143000      
002736                                      WKS-B01-NIVARCMOV(W77-IND)  143100      
002737                                      WKS-B01-NIVBDMOV(W77-IND).  143200      
002738                                                                  143300      
002739     IF W77-IND = 1                                               143400      
002740        MOVE 10                    TO W77-IND                     143500      
002741     ELSE                                                         143600      
002742        COMPUTE W77-IND = W77-IND - 1.                            143700      
002743                                                                  143800      
002744     MOVE ZERO                     TO WKS-B01-STAARCLOG(W77-IND)  143900      
002745                                      WKS-B01-NIVARCMOV(W77-IND)  144000      
002746                                      WKS-B01-NIVBDMOV(W77-IND).  144100      
002747                                                                  144200      
002748 01-0145-BORRA-TOTXCVE.                                           144300      
002749*======================                                           144400      
002750                                                                  144500      
002751     BEGIN-TRANSACTION NO-AUDIT S151B99REINICIO.                  144600      
002752                                                                  144700      
002753     DELETE S151B50TOTXCVE                                        144800      
002754         ON EXCEPTION                                             144900      
002755            MOVE 1                 TO W77-EOF-TOTXCVE             145000      
002756            MOVE "O"               TO WLI-TIPO-LJ                 145100      
002757            MOVE "ERROR EN DELETE SOBRE TOTALES POR CLAVE"        145200      
002758                                   TO WLI-TEXTO-LJ                145300      
002759            PERFORM        000-030-IMPRIME-MENSAJE.               145400      
002760     END-TRANSACTION NO-AUDIT S151B99REINICIO.                    145500      
002761     LOCK NEXT B50SXTOTXCVE                                       145600      
002762       AT B50-MOV-FEC NOT > W77-FECHA-BORRAR-TOTXCVE              145700      
002763       ON EXCEPTION                                               145800      
002764          IF DMSTATUS(NOTFOUND)                                   145900      
002765             MOVE 1                TO W77-EOF-TOTXCVE             146000      
002766          ELSE                                                    146100      
002767             MOVE 1                TO W77-EOF-TOTXCVE             146200      
002768             MOVE "O"              TO WLI-TIPO-LJ                 146300      
002769             MOVE "ERROR EN LOCK SOBRE TOTALES POR CLAVE FN"      146400      
002770                                   TO WLI-TEXTO-LJ                146500      
002771             PERFORM        000-030-IMPRIME-MENSAJE.              146600      
002772                                                                  146700      
002773 01-0150-CIERRA-BASE.                                             146800      
002774*====================                                             146900      
002775     CLOSE BASESEM                                                147000      
002776     ON EXCEPTION                                                 147100      
002777        NEXT SENTENCE.                                            147200      
002778                                                                  147300      
002779                                                                  147400      
002780 01-0153-LIGA-L002.                                               147500      
002781*==================                                               147600      
002782     MOVE WKS-SISTEMA              TO WKS-SIS-L002.               147700      
002783     MOVE WKS-LIBID-L002           TO WKS-LIBID.                  147800      
002784     CALL "DAME_TIT IN CTLVER"     USING  WKS-LIBID,              147900      
002785                                          WKS-NOMLIB              148000      
002786                                   GIVING W77-ERR-CTLVER.         148100      
002787     IF W77-ERR-CTLVER = 0                                        148200      
002788        CHANGE ATTRIBUTE TITLE  OF "LIB-L002" TO WKS-NOMLIB       148300      
002789     ELSE                                                         148400      
002790        CHANGE ATTRIBUTE TITLE  OF "LIB-L002" TO                  148500      
002791         "(S151)S151/OBJECT/L002/REGISTRA ON CMEMP".              148600      
002792                                                                  148700      
002793 01-0155-LLAMA-L002.                                              148800      
002794*===================                                              148900      
002795     CALL "CONTROLES IN LIB-L002" USING  WKS-S151-DATOS           149000      
002796                                  GIVING WKS-S151-RESULT.         149100      
002797     IF WKS-S151-RESULT > 0                                       149200      
002798        MOVE "I"                   TO WLI-TIPO-LJ                 149300      
002799        STRING WKS-ERROR(WKS-S151-RESULT)                         149400      
002800               "EN LLAMADO A L002"                                149500      
002801        DELIMITED BY SIZE                                         149600      
002802        INTO WLI-TEXTO-LJ                                         149700      
002803        PERFORM        000-030-IMPRIME-MENSAJE.                   149800      
002804                                                                  149900      
002805 01-0156-LIGA-L007.                                               150000      
002806*==================                                               150100      
002807*     MOVE "S151L007"               TO WKS-LIBID.                 150200      
002808*     CALL "DAME_TIT IN CTLVER"     USING  WKS-LIBID,             150300      
002809*                                          WKS-NOMLIB             150400      
002810*                                   GIVING W77-ERR-CTLVER.        150500      
002811*     IF W77-ERR-CTLVER = 0                                       150600      
002812*        CHANGE ATTRIBUTE TITLE  OF "LIB-L007" TO WKS-NOMLIB      150700      
002813*     ELSE                                                        150800      
002814*        CHANGE ATTRIBUTE TITLE  OF "LIB-L007" TO                 150900      
002815*         "(S151)S151/OBJECT/L007/MOVCB2   ON CMEMP".             151000      
002816                                                                  151100      
002817     MOVE "S151L009"               TO WKS-LIBID.                  151105      
002818     CALL "DAME_TIT IN CTLVER"     USING  WKS-LIBID,              151110      
002819                                          WKS-NOMLIB              151115      
002820                                   GIVING W77-ERR-CTLVER.         151120      
002821     IF W77-ERR-CTLVER = 0                                        151125      
002822        CHANGE ATTRIBUTE TITLE  OF "LIB-L009" TO WKS-NOMLIB       151130      
002823     ELSE                                                         151135      
002824        CHANGE ATTRIBUTE TITLE  OF "LIB-L009" TO                  151140      
002825         "(S151)S151/OBJECT/L009/ENVCB2   ON CMEMP".              151145      
002826                                                                  151150      
002827 01-0157-LLAMA-L007.                                              151200      
002828*===================                                              151300      
002829*     CALL "FUNCIONES IN LIB-L007" USING  WKS-LLAMA-L007          151400      
002830*                                  GIVING WKS-S151-RESULT.        151500      
002831*     IF WKS-S151-RESULT > 0                                      151600      
002832*        MOVE "I"                   TO WLI-TIPO-LJ                151700      
002833*        STRING WKS-ERROR(WKS-S151-RESULT)                        151800      
002834*               "EN LLAMADO A L007"                               151900      
002835*        DELIMITED BY SIZE                                        152000      
002836*        INTO WLI-TEXTO-LJ                                        152100      
002837*        PERFORM        000-030-IMPRIME-MENSAJE.                  152120      
002838                                                                  152122      
002839     MOVE 98           TO WKS-L007-FUNCION.                       152125      
002840     CALL "FUNCIONES IN LIB-L009" USING  WKS-LLAMA-L007           152130      
002841                                  GIVING WKS-S151-RESULT.         152135      
002842     IF WKS-S151-RESULT > 0                                       152140      
002843        MOVE "I"                   TO WLI-TIPO-LJ                 152145      
002844        STRING WKS-ERROR(WKS-S151-RESULT)                         152150      
002845               "EN LLAMADO A L009"                                152155      
002846        DELIMITED BY SIZE                                         152160      
002847        INTO WLI-TEXTO-LJ                                         152165      
002848        PERFORM        000-030-IMPRIME-MENSAJE.                   152170      
002849                                                                  152175      
002850     MOVE 25           TO WKS-L007-FUNCION.                       152177      
002851     CALL "FUNCIONES IN LIB-L009" USING  WKS-LLAMA-L007           152179      
002852                                  GIVING WKS-S151-RESULT.         152181      
002853     IF WKS-S151-RESULT > 0                                       152183      
002854        MOVE "I"                   TO WLI-TIPO-LJ                 152185      
002855        STRING WKS-ERROR(WKS-S151-RESULT)                         152187      
002856               "EN LLAMADO A L009"                                152189      
002857        DELIMITED BY SIZE                                         152191      
002858        INTO WLI-TEXTO-LJ                                         152193      
002859        PERFORM        000-030-IMPRIME-MENSAJE.                   152195      
002860 01-0157-LIGA-L012.                                               152202      
002861*==================                                               152204      
002862     MOVE "S151L012"               TO WKS-LIBID.                  152206      
002863     CALL "DAME_TIT IN CTLVER"     USING  WKS-LIBID,              152208      
002864                                          WKS-NOMLIB              152210      
002865                                   GIVING W77-ERR-CTLVER.         152212      
002866     IF W77-ERR-CTLVER = 0                                        152214      
002867        CHANGE ATTRIBUTE TITLE  OF "LIB-L012" TO WKS-NOMLIB       152216      
002868     ELSE                                                         152218      
002869        CHANGE ATTRIBUTE TITLE  OF "LIB-L012" TO                  152220      
002870         "(S151)S151/OBJECT/L012/MOVCDT   ON CMEMP".              152222      
002871                                                                  152224      
002872 01-0157-LLAMA-L012.                                              152226      
002873*===================                                              152228      
002874     CALL "FUNCIONL12 IN LIB-L012" USING  WKS-LLAMA-L007          152230      
002875                                   GIVING WKS-S151-RESULT.        152232      
002876     IF WKS-S151-RESULT > 0                                       152234      
002877        MOVE "I"                   TO WLI-TIPO-LJ                 152236      
002878        STRING WKS-ERROR(WKS-S151-RESULT)                         152238      
002879               "EN LLAMADO A L012"                                152240      
002880        DELIMITED BY SIZE                                         152242      
002881        INTO WLI-TEXTO-LJ                                         152252      
002882        PERFORM        000-030-IMPRIME-MENSAJE.                   152262      
002883                                                                  152300      
002884 01-0160-GENERA-ARCHIVOS.                                         152400      
002885*=========================                                        152500      
002886*    MOVE W77-FECHA-PASMAN         TO WKS-FECHA-ARCMOV            152600      
002887*                                     WKS-FECHA-ARCDES.           152700      
002888*INICIA CODIGO DE RENOVACION CRONOS 2000                          152800      
002889$SET OMIT = OLDCODE                                               152900      
002890     MOVE W77-FECHA-PASMAN         TO WKS-FECHA-ARCMOV            153000      
002891                                      WKS-FECHA-ARCDES            153100      
002892                                      WKS-FECHA-ARCBII            153200      
002893                                      WKS-FECHA-ARCTDR.           153250      
002894$POP OMIT                                                         153300      
002895$SET OMIT = NOT OLDCODE                                           153400      
002896     MOVE ZEROS TO A2K-FEC-CAMD-001                               153500      
002897     MOVE W77-FECHA-PASMAN TO A2K-FEC-CAMD-001                    153600      
002898     PERFORM A2K-CONV-CAMD-TO-AMD THRU                            153700      
002899              A2K-CONV-CAMD-TO-AMD-EXIT                           153800      
002900     MOVE A2K-FEC-AMD-001         TO   WKS-FECHA-ARCMOV           153900      
002901                                       WKS-FECHA-ARCDES           154000      
002902                                       WKS-FECHA-ARCBII           154100      
002903                                       WKS-FECHA-ARCTDR.          154150      
002904$POP OMIT                                                         154200      
002905*TERMINA CODIGO DE RENOVACION CRONOS 2000                         154300      
002906     PERFORM 01-0162-ABRE-SALIDA.                                 154400      
002907     MOVE 1                        TO WKS-B03-FUNCION.            154410      
002908     MOVE WKS-SISTEMA              TO WKS-B03-SISTEMA.            154420      
002909     CALL "CONSISMEN IN LIB-CONTROL" USING  WKS-S151B03SISMEN     154430      
002910                                     GIVING W77-RESULT-LIBCON.    154440      
002911     IF WKS-B03-SECOKHI = 0                                       154455      
002912        IF WKS-NOMEQUIPO = "ACYPGAMA." OR "VDMBETA." OR           154460      
002913                           "MONALFA."  OR "ACYPBETA."             154600      
002914           PERFORM 01-0161-BUSCA-EN-PBAS                          154700      
002915        ELSE                                                      154720      
002916           PERFORM 01-0161-BUSCA-EN-PROD                          154735      
002917           IF W77-NUMREG < W77-NUMREG-DEF                         154740      
002918              MOVE W77-NUMREG-DEF      TO W77-NUMREG              154745      
002919                                          W77-NREG-DESC           154747      
002920           ELSE                                                   154749      
002921              IF W77-NREG-DESC = 0                                154750      
002922                 MOVE W77-NUMREG       TO W77-NREG-DESC           154752      
002923              ELSE                                                154753      
002924                 NEXT SENTENCE                                    154754      
002925     ELSE                                                         154755      
002926        MOVE WKS-B03-SECOKHI        TO W77-NUMREG                 154756      
002927                                       W77-NREG-DESC.             154758      
002928     IF ((WKS-MM-PASMAN NOT = WKS-MM-3ERDIA) OR W77-INHABIL=1) AND154784      
002929        (WKS-SISTEMA   = 500 OR 264 OR 404 OR 403 OR 711)         154787      
002930        COMPUTE W77-NUMREG = W77-NUMREG * 1.1                     154788      
002931        MOVE W77-NUMREG             TO W77-NREG-DESC.             154789      
002932                                                                  154791      
002933     IF WKS-NOMEQUIPO = "ACYPGAMA." OR "VDMBETA." OR              154794      
002934                        "MONALFA."  OR "ACYPBETA."                154796      
002935        IF WKS-SISTEMA = 500 OR 264                               154800      
002936           MOVE 10000             TO W77-NREG-CBII                155100      
002937                                     W77-NREG-CTDR                155150      
002938        ELSE                                                      155910      
002939           NEXT SENTENCE                                          155960      
002940     ELSE                                                         156000      
002941     IF WKS-SISTEMA = 500                                         157400      
002942        IF WKS-MM-PASMAN = WKS-MM-3ERDIA                          157500      
002943*NOR-ISI INICIO AUMENTA NO. DE REG A LOS ARCH CBII Y CTDR AL 50%  157510      
002944           MOVE 1070000         TO W77-NREG-CBII                  157600      
002945           MOVE 4000000         TO W77-NREG-CTDR                  157650      
002946        ELSE                                                      158100      
002947           MOVE 1010000          TO W77-NREG-CBII                 158200      
002948           MOVE 4000000         TO W77-NREG-CTDR                  158250      
002949*NOR-ISI FIN                                                      158260      
002950     ELSE                                                         158700      
002951     IF WKS-SISTEMA = 264                                         158800      
002952        IF WKS-MM-PASMAN = WKS-MM-3ERDIA                          158900      
002953           MOVE 10000           TO W77-NREG-CBII                  159000      
002954                                   W77-NREG-CTDR                  159100      
002955        ELSE                                                      159200      
002956           MOVE 10000           TO W77-NREG-CBII                  159300      
002957                                   W77-NREG-CTDR                  159400      
002958     ELSE                                                         159500      
002959     IF WKS-SISTEMA = 335     AND                                 159689      
002960        WKS-DD-ARCHIVOS > 14  AND                                 159690      
002961        WKS-DD-ARCHIVOS < 21                                      159691      
002962        MOVE  180000            TO W77-NUMREG                     159692      
002963        MOVE  90000             TO W77-NREG-DESC.                 159694      
002964                                                                  159794      
002965     MOVE WKS-REG-LOGS             TO L01-R00-MOVTOS              160200      
002966                                      L02-R00-DESCRIP.            160300      
002967                                                                  160400      
002968     IF W77-NUMREG = 0                                            160410      
002969        MOVE W77-NUMREG-DEF     TO W77-NUMREG.                    160420      
002970                                                                  160430      
002971     IF W77-NREG-DESC = 0                                         160440      
002972        MOVE W77-NUMREG-DEF     TO W77-NREG-DESC.                 160450      
002973     IF WKS-SISTEMA = 500                                         160460      
002974        COMPUTE W77-NREG-DESC = W77-NREG-DESC * 2.                160480      
002975     IF W77-ABRE-MOVS = 1 AND W77-ABRE-DES = 1                    160500      
002976        PERFORM 01-0164-GRABA-MOV                                 160600      
002977             VARYING W77-REG FROM 1 BY 1                          160700      
002978             UNTIL   W77-REG > W77-NUMREG                         160800      
002979                                                                  160900      
002980        PERFORM 01-0165-GRABA-DES                                 161000      
002981             VARYING W77-REG FROM 1 BY 1                          161100      
002982             UNTIL   W77-REG > W77-NREG-DESC.                     161200      
002983                                                                  161300      
002984     IF W77-ABRE-CBII = 1                                         161400      
002985*       MOVE LOW-VALUES            TO WKS-CB-CEROS                161500      
002986        MOVE WKS-REG-CBII          TO L03-R00-CBII                161600      
002987        PERFORM 01-0166-GRABA-CBII                                161700      
002988             VARYING W77-REG FROM 1 BY 1                          161800      
002989             UNTIL   W77-REG > W77-NREG-CBII.                     161900      
002990                                                                  162000      
002991     IF W77-ABRE-CTDR = 1                                         162010      
002992        MOVE WKS-REG-CBII          TO L04-R00-CTDR                162020      
002993        PERFORM 01-0167-GRABA-CTDR                                162030      
002994             VARYING W77-REG FROM 1 BY 1                          162040      
002995             UNTIL   W77-REG > W77-NREG-CTDR.                     162050      
002996                                                                  162060      
002997     PERFORM 01-0168-CIERRA-SALIDA.                               162100      
002998                                                                  162200      
002999 01-0161-BUSCA-EN-PBAS.                                           162205      
003000*======================                                           162210      
003001     MOVE ZERO                          TO W77-BUSQUEDA.          162212      
003002     PERFORM 01-0161-NUMREG-PBAS                                  162215      
003003             VARYING W77-IND FROM 1 BY 1                          162220      
003004             UNTIL   W77-IND > 20                           OR    162225      
003005                     W77-BUSQUEDA             = 1           OR    162227      
003006                     WKS-PBA-SISTEMA(W77-IND) = 9999.             162230      
003007                                                                  162235      
003008     IF WKS-PBA-SISTEMA(W77-IND) = 9999                           162240      
003009        MOVE WKS-PBA-REGISTROS(W77-IND) TO W77-NUMREG             162245      
003010                                           W77-NREG-DESC.         162246      
003011 01-0161-NUMREG-PBAS.                                             162247      
003012*====================                                             162248      
003013     IF WKS-PBA-SISTEMA(W77-IND) = WKS-SISTEMA                    162250      
003014        MOVE WKS-PBA-REGISTROS(W77-IND) TO W77-NUMREG             162252      
003015                                           W77-NREG-DESC          162254      
003016        MOVE 1                          TO W77-BUSQUEDA.          162259      
003017 01-0161-BUSCA-EN-PROD.                                           162260      
003018*======================                                           162262      
003019     MOVE ZERO                           TO W77-BUSQUEDA          162263      
003020     PERFORM 01-0161-NUMREG-PROD                                  162264      
003021             VARYING W77-IND FROM 1 BY 1                          162266      
003022             UNTIL   W77-IND > 20                            OR   162268      
003023                     W77-BUSQUEDA              = 1           OR   162270      
003024                     WKS-PROD-SISTEMA(W77-IND) = 9999.            162271      
003025                                                                  162272      
003026     IF WKS-PBA-SISTEMA(W77-IND) = 9999                           162274      
003027        MOVE WKS-PROD-REGMOV(W77-IND)    TO W77-NUMREG            162276      
003028        MOVE WKS-PROD-REGDES(W77-IND)    TO W77-NREG-DESC .       162278      
003029                                                                  162279      
003030 01-0161-NUMREG-PROD.                                             162280      
003031*====================                                             162282      
003032     IF WKS-PROD-SISTEMA(W77-IND) = WKS-SISTEMA                   162284      
003033        MOVE WKS-PROD-REGMOV(W77-IND)    TO W77-NUMREG            162286      
003034        MOVE WKS-PROD-REGDES(W77-IND)    TO W77-NREG-DESC         162298      
003035        MOVE 1                           TO W77-BUSQUEDA.         162348      
003036                                                                  162398      
003037 01-0162-ABRE-SALIDA.                                             162400      
003038*====================                                             162410      
003039     CHANGE ATTRIBUTE TITLE OF L01-MOVTOS TO WKS-L01-MOVTOS.      162600      
003040     IF ATTRIBUTE RESIDENT OF L01-MOVTOS = 1                      162800      
003041        MOVE "O"                   TO TIPO-LJ WLI-TIPO-LJ         162900      
003042        MOVE 030403                TO CODIGO-LJ                   163000      
003043        MOVE "ARCH DE MOVIMIENTOS YA EXISTE SOBREESCRIBO (SI/NO)" 163100      
003044                                   TO TEXTO-LJ                    163200      
003045        MOVE TEXTO-LJ              TO WLI-TEXTO-LJ                163300      
003046        PERFORM        000-030-IMPRIME-MENSAJE                    163400      
003047        CALL "LJ IN LIB-DISP"      USING CONTADOR-LJ              163500      
003048                                         MENSAJE-LJ               163600      
003049        ACCEPT WKS-CONTINUA                                       163700      
003050        IF WKS-CONTINUA = "SI" OR "si" OR "Si" OR "sI"            163800      
003051           IF WKS-SISTEMA = 403                                   163900      
003052              CHANGE ATTRIBUTE SECURITYTYPE OF L01-MOVTOS  TO 1   164000      
003053              CHANGE ATTRIBUTE SECURITYTYPE OF L02-DESCRIP TO 1   164100      
003054              OPEN OUTPUT L01-MOVTOS                              164200      
003055              OPEN OUTPUT L02-DESCRIP                             164300      
003056              MOVE 1               TO W77-ABRE-MOVS               164400      
003057                                      W77-ABRE-DES                164500      
003058           ELSE                                                   164600      
003059              OPEN OUTPUT L01-MOVTOS                              164700      
003060              OPEN OUTPUT L02-DESCRIP                             164800      
003061              MOVE 1               TO W77-ABRE-MOVS               164900      
003062                                      W77-ABRE-DES                165000      
003063              IF WKS-SISTEMA = 500                                165100      
003064                 MOVE 1            TO W77-ABRE-CBII               165200      
003065                                      W77-ABRE-CTDR               165250      
003066                 OPEN OUTPUT L03-CBII                             165300      
003067                 OPEN OUTPUT L04-CTDR                             165350      
003068              ELSE                                                165400      
003069              IF WKS-SISTEMA = 264                                165420      
003070                 MOVE 1            TO W77-ABRE-CTDR               165440      
003071                 OPEN OUTPUT L04-CTDR                             165460      
003072              ELSE                                                165480      
003073                 NEXT SENTENCE                                    165500      
003074        ELSE                                                      165600      
003075           MOVE ZERO               TO W77-ABRE-MOVS               165700      
003076                                      W77-ABRE-DES                165800      
003077                                      W77-ABRE-CBII               165900      
003078                                      W77-ABRE-CTDR               165950      
003079     ELSE                                                         166000      
003080        MOVE 1                     TO W77-ABRE-MOVS               166100      
003081                                      W77-ABRE-DES                166200      
003082        IF WKS-SISTEMA = 403                                      166300      
003083           CHANGE ATTRIBUTE SECURITYTYPE OF L01-MOVTOS  TO 1      166400      
003084           CHANGE ATTRIBUTE SECURITYTYPE OF L02-DESCRIP TO 1      166500      
003085           OPEN OUTPUT L01-MOVTOS                                 166600      
003086           OPEN OUTPUT L02-DESCRIP                                166700      
003087        ELSE                                                      166800      
003088           OPEN OUTPUT L01-MOVTOS                                 166900      
003089           OPEN OUTPUT L02-DESCRIP                                167000      
003090           IF WKS-SISTEMA = 500                                   167100      
003091              MOVE 1               TO W77-ABRE-CBII               167200      
003092                                      W77-ABRE-CTDR               167250      
003093              OPEN OUTPUT L03-CBII                                167300      
003094              OPEN OUTPUT L04-CTDR                                167350      
003095           ELSE                                                   167360      
003096           IF WKS-SISTEMA = 264                                   167370      
003097              MOVE 1               TO W77-ABRE-CTDR               167380      
003098              OPEN OUTPUT L04-CTDR.                               167390      
003099                                                                  167400      
003100 01-0164-GRABA-MOV.                                               167500      
003101*==================                                               167600      
003102     WRITE L01-R00-MOVTOS.                                        167700      
003103                                                                  167800      
003104 01-0165-GRABA-DES.                                               167900      
003105*==================                                               168000      
003106     WRITE L02-R00-DESCRIP.                                       168100      
003107                                                                  168200      
003108 01-0166-GRABA-CBII.                                              168300      
003109*===================                                              168400      
003110     WRITE L03-R00-CBII.                                          168500      
003111                                                                  168600      
003112 01-0167-GRABA-CTDR.                                              168620      
003113*===================                                              168640      
003114     WRITE L04-R00-CTDR.                                          168660      
003115                                                                  168680      
003116 01-0168-CIERRA-SALIDA.                                           168700      
003117*======================                                           168800      
003118     IF W77-ABRE-MOVS = 1                                         168900      
003119        CLOSE L01-MOVTOS      WITH SAVE.                          169000      
003120                                                                  169100      
003121     IF W77-ABRE-DES = 1                                          169200      
003122        CLOSE L02-DESCRIP     WITH SAVE.                          169300      
003123                                                                  169400      
003124     IF W77-ABRE-CBII = 1                                         169500      
003125        CLOSE L03-CBII        WITH SAVE.                          169600      
003126                                                                  169700      
003127     IF W77-ABRE-CTDR = 1                                         169720      
003128        CLOSE L04-CTDR        WITH SAVE.                          169740      
003129                                                                  169760      
003130 01-0900-ERROR-CALE.                                              169800      
003131*===================                                              169900      
003132     MOVE "I"                      TO TIPO-LJ WLI-TIPO-LJ.        170000      
003133     MOVE 051010                   TO CODIGO-LJ.                  170100      
003134     MOVE W77-FUNCION              TO W77-ERROR.                  170200      
003135     STRING "FUNCION "                                            170300      
003136            W77-FUN-CALE                                          170400      
003137            " ERROR # "                                           170500      
003138            W77-ERROR                                             170600      
003139            " EN LLAMADO DE CALENDAR "                            170700      
003140            WKS-FECHA1 " " WKS-FECHA2                             170800      
003141     DELIMITED BY SIZE                                            170900      
003142     INTO TEXTO-LJ.                                               171000      
003143     MOVE TEXTO-LJ                 TO WLI-TEXTO-LJ.               171100      
003144     IF W77-ARCHIVO = 1                                           171200      
003145        PERFORM 000-030-IMPRIME-MENSAJE                           171300      
003146        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                   171400      
003147     ELSE                                                         171500      
003148        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  171600      
003149 01-0950-ERROR-LIBCTL.                                            171700      
003150*=====================                                            171800      
003151     MOVE SPACES                    TO WLI-ENCAB-52               171900      
003152     MOVE "I"                       TO TIPO-LJ                    172000      
003153     MOVE 050101                    TO CODIGO-LJ                  172100      
003154     MOVE W77-RESULT-LIBCON         TO W77-ERROR                  172200      
003155     STRING "FUNCION "                                            172300      
003156            W77-FUN-CTL                                           172400      
003157            " ERROR "                                             172500      
003158            W77-ERROR                                             172600      
003159            " AL LLAMAR A LIBRERIA DE CONTROL "                   172700      
003160     DELIMITED BY SIZE                                            172800      
003161     INTO TEXTO-LJ                                                172900      
003162     MOVE TIPO-LJ   TO  WLI-TIPO-LJ                               173000      
003163     MOVE TEXTO-LJ  TO  WLI-TEXTO-LJ                              173100      
003164     CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ          173200      
003165     IF W77-ARCHIVO = 1                                           173300      
003166        PERFORM 000-030-IMPRIME-MENSAJE                           173400      
003167        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                   173500      
003168     ELSE                                                         173600      
003169        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  173700      
003170                                                                  173800      
003171*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003172* COPY "S151/FORMATO/ERROR/DMSII." FROM 68000                     173900      
003173*                                    TO 78000.                    174000      
003174 900000-CHE-STA.                                                  068000      
003175     MOVE DMSTATUS(DMCATEGORY)            TO WKS-ERR-DMSII        069000      
003176     MOVE DMSTATUS(DMERRORTYPE)           TO WKS-ERR-BD           069100      
003177     MOVE DMSTATUS(DMSTRUCTURE)           TO WKS-ESTRUCT-BD       069200      
003178                                                                  069300      
003179     IF WKS-ERR-DMSII > ZEROS                                     070000      
003180        STRING  "BASE DATOS  " WKS-NOM-BDERR-DMSII                071000      
003181                "ERROR EN BD " WKS-LEY-ERR-DMSII(WKS-ERR-DMSII)   072000      
003182                           " " WKS-ERR-DMSII                      073000      
003183                "TIPO        " WKS-ERR-BD                         074000      
003184                "ESTRUCTURA  " WKS-ESTRUCT-BD                     075000      
003185        DELIMITED BY SIZE INTO TEXTO-LJ                           076000      
003186        CALL "LJ IN LIB-DISP" USING  CONTADOR-LJ, MENSAJE-LJ.     077000      
003187                                                                  078000      
003188*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003189*INICIA CODIGO DE RENOVACION CRONOS 2000                          174100      
003190*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003191*      COPY "S151/CRONOS2K/CPY/PD".                               174200      
003192** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
003193** Unisys has defined for CRONOS2K project                     ** 000200      
003194** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
003195***************************************************************** 000400      
003196***************************************************************** 000600      
003197** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
003198** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
003199** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
003200** date MMDDCCAA, which is returned into the variable          ** 001000      
003201** A2K-FEC-MDCA-001.                                           ** 001100      
003202***************************************************************** 001200      
003203                                                                  001300      
003204 A2K-ACCEPT-TODAYS-DATE.                                          001400      
003205        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
003206*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
003207        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
003208        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
003209        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
003210        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
003211        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
003212                                                                  002200      
003213 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
003214        EXIT.                                                     002240      
003215                                                                  002500      
003216****************************************************************  002600      
003217** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
003218**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
003219**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
003220**baseyear to add the century to the year part.               **  003000      
003221**INPUT is A2K-FEC-AMD-001                                    **  003100      
003222**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
003223****************************************************************  003300      
003224                                                                  003400      
003225 A2K-CONV-AMD-TO-CAMD.                                            003500      
003226         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
003227         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
003228         IF A2K-FEC-AMD-001 = 0                                   003720      
003229            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
003230         ELSE                                                     003741      
003231          IF A2K-FEC-AMD-001 = 999999                             003742      
003232             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
003233         ELSE                                                     003760      
003234         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
003235                 A2K-OBTAIN-CENTURY-EXIT                          003900      
003236         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
003237         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
003238         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
003239         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
003240                                                                  004400      
003241 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
003242         EXIT.                                                    004600      
003243                                                                  004700      
003244******************************************************************004800      
003245**A2K-CONV-MDA-TO-MDCA.                                         **004900      
003246**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
003247** an eight digit format as MMDDCCAA. It use a                  **005100      
003248** baseyear to add century to the yaer.                         **005200      
003249** INPUT is A2K-FEC-MDA-001                                     **005300      
003250** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
003251                                                                  005500      
003252 A2K-CONV-MDA-TO-MDCA.                                            005600      
003253     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
003254     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
003255     IF A2K-FEC-MDA-001 = 0                                       005820      
003256        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
003257     ELSE                                                         005845      
003258      IF A2K-FEC-MDA-001 = 999999                                 005850      
003259         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
003260     ELSE                                                         005860      
003261     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
003262             A2K-OBTAIN-CENTURY-EXIT                              006000      
003263     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
003264     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
003265     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
003266     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
003267                                                                  006500      
003268 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
003269     EXIT.                                                        006700      
003270                                                                  006800      
003271***************************************************************** 006900      
003272**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
003273**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
003274**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
003275**baseyear to add century to the year.                         ** 007300      
003276**INPUT is A2K-FEC-DMA-001                                     ** 007400      
003277**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
003278                                                                  007600      
003279 A2K-CONV-DMA-TO-DMCA.                                            007700      
003280       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
003281       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
003282       IF  A2K-FEC-DMA-001   = 0                                  007920      
003283          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
003284       ELSE                                                       007945      
003285        IF A2K-FEC-DMA-001 = 999999                               007950      
003286          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
003287       ELSE                                                       007960      
003288       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
003289               A2K-OBTAIN-CENTURY-EXIT                            008100      
003290       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
003291       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
003292       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
003293       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
003294                                                                  008600      
003295 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
003296       EXIT.                                                      008800      
003297                                                                  008900      
003298***************************************************************** 009000      
003299** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
003300** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
003301** a 6 digit format as AAMMDD.                                 ** 009300      
003302** It simply removes the century information in the output     ** 009400      
003303** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
003304** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
003305                                                                  009700      
003306 A2K-CONV-CAMD-TO-AMD.                                            009800      
003307     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
003308     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
003309     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
003310     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
003311                                                                  010300      
003312 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
003313      EXIT.                                                       010500      
003314                                                                  010600      
003315******************************************************************010700      
003316******************************************************************010800      
003317** A2K-CONV-MDCA-TO-MDA.                                        **010900      
003318** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
003319** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
003320** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
003321** INPUT is A2K-FEC-MDCA-001                                    **011300      
003322** OUTPUT is A2K-FEC-MDA-001                                    **011400      
003323                                                                  011500      
003324 A2K-CONV-MDCA-TO-MDA.                                            011600      
003325     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
003326     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
003327     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
003328     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
003329                                                                  012100      
003330 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
003331      EXIT.                                                       012300      
003332                                                                  012400      
003333******************************************************************012500      
003334***************************************************************** 012600      
003335** A2K-CONV-DMCA-TO-DMA.                                        **012700      
003336** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
003337** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
003338** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
003339** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
003340** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
003341                                                                  013300      
003342 A2K-CONV-DMCA-TO-DMA.                                            013400      
003343     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
003344     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
003345     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
003346     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
003347                                                                  013900      
003348 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
003349      EXIT.                                                       014100      
003350                                                                  014200      
003351***************************************************************** 014300      
003352 A2K-CONV-MDCA-TO-CAMD.                                           014400      
003353      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
003354      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
003355      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
003356      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
003357      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
003358 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
003359      EXIT.                                                       015100      
003360***************************************************************** 015200      
003361** This paragraph adds century to an year field which is 9(02) ** 015300      
003362** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
003363** Output is A2K-FEC-CCAA-001.                                 ** 015600      
003364***************************************************************** 015700      
003365 A2K-CONV-AA-TO-CCAA.                                             015800      
003366      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
003367      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
003368              A2K-OBTAIN-CENTURY-EXIT.                            016100      
003369      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
003370 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
003371      EXIT.                                                       016400      
003372***************************************************************** 016500      
003373** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
003374** format.                                                     ** 016700      
003375** Input is A2K-FEC-DMCA-001.                                  ** 016800      
003376** Output is A2K-FEC-CAMD-001.                                 ** 016900      
003377***************************************************************** 017000      
003378 A2K-CONV-DMCA-TO-CAMD.                                           017100      
003379      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
003380      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
003381      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
003382      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
003383      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
003384 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
003385      EXIT.                                                       017800      
003386***************************************************************** 017900      
003387** This paragraph desides the Century to be added depending    ** 018000      
003388** on the base year.                                           ** 018100      
003389** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
003390** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
003391***************************************************************** 018400      
003392 A2K-OBTAIN-CENTURY.                                              018500      
003393      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
003394          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
003395      ELSE                                                        018800      
003396          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
003397 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
003398      EXIT.                                                       019100      
003399                                                                  019200      
003400***************************************************************** 019300      
003401** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
003402**  Format                                                     ** 019500      
003403** Input Is A2K-FEC-CAMD-001                                   ** 019600      
003404** Output Is A2K-FEC-DMCA-001                                  ** 019700      
003405***************************************************************** 019800      
003406 A2K-CONV-CAMD-TO-DMCA.                                           019900      
003407      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
003408      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
003409      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
003410      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
003411      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
003412                                                                  020500      
003413 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
003414      EXIT.                                                       020700      
003415                                                                  020800      
003416******************************************************************020900      
003417******************************************************************021000      
003418 A2K-CONV-AM-TO-CAM.                                              021100      
003419      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
003420      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
003421      IF A2K-FEC-AM-001 = 0                                       021220      
003422         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
003423      ELSE                                                        021245      
003424      IF A2K-FEC-AM-001 = 9999                                    021250      
003425         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
003426      ELSE                                                        021260      
003427      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
003428      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
003429      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
003430              A2K-OBTAIN-CENTURY-EXIT                             021600      
003431      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
003432                                                                  021800      
003433 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
003434      EXIT.                                                       022000      
003435                                                                  022100      
003436******************************************************************022200      
003437******************************************************************022300      
003438 A2K-CONV-CAM-TO-AM.                                              022400      
003439      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
003440      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
003441      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
003442                                                                  022800      
003443 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
003444   EXIT.                                                          023000      
003445                                                                  023100      
003446                                                                  023200      
003447                                                                  023500      
003448*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003449  A2K-CPY-EXIT-PARA.                                              174300      
003450      EXIT.                                                       174400      
003451*TERMINA CODIGO DE RENOVACION CRONOS 2000                         174500      
003452                                                                  174600      
003453** HSC INI ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  174700      
003454 01-0040-VERIFICA-B05.                                            174800      
003455*=====================                                            174900      
003456   MOVE 0 TO WKS-PROCESADO                                        175000      
003457   IF W77-FUN-PROY = 0 AND W77-NUMSIS > 0                         175100      
003458      MOVE 1                 TO WKS-B05-FUNCION                   175200      
003459      MOVE W77-FECPRO-B05    TO WKS-B05-FCHPRO                    175300      
003460      MOVE 1                 TO WKS-B05-NUMPRO                    175400      
003461      MOVE W77-NUMSIS        TO WKS-B05-SISTEMA                   175500      
003462      MOVE ZERO              TO WKS-B05-NUMREGINI                 175600      
003463                                WKS-B05-FCHINI                    175700      
003464      CALL "B05PROCESOS IN LIB-CONTROL" USING  WKS-B05PROCESOS    175800      
003465                                      GIVING W77-RESULT-LIBCON    175900      
003466                                                                  176000      
003467      IF W77-RESULT-LIBCON > 0                                    176100      
003468         MOVE 19             TO WKS-B05-FUNCION                   176200      
003469                                W77-FUN-CTL                       176300      
003470         MOVE W77-FECPRO-B05 TO WKS-B05-FCHPRO                    176400      
003471         MOVE 1              TO WKS-B05-NUMPRO                    176500      
003472         MOVE W77-NUMSIS     TO WKS-B05-SISTEMA                   176600      
003473         MOVE ZERO           TO WKS-B05-NUMREGINI                 176700      
003474                                WKS-B05-FCHINI                    176800      
003475                                WKS-B05-STAPGM                    176900      
003476         CALL "B05PROCESOS IN LIB-CONTROL" USING WKS-B05PROCESOS  177000      
003477                                        GIVING W77-RESULT-LIBCON  177100      
003478         IF W77-RESULT-LIBCON > 0                                 177200      
003479            PERFORM 01-0950-ERROR-LIBCTL                          177300      
003480         ELSE                                                     177400      
003481            NEXT SENTENCE                                         177500      
003482       ELSE                                                       177600      
003483          IF WKS-B05-STAPGM = 1                                   177700      
003484             MOVE 1         TO WKS-PROCESADO                      177800      
003485          ELSE                                                    177900      
003486             NEXT SENTENCE.                                       178000      
003487   IF W77-FUN-PROY = 3 AND W77-NUMSIS = 500                       178100      
003488      MOVE 1                 TO WKS-B05-FUNCION                   178200      
003489      MOVE W77-FECPRO-B05    TO WKS-B05-FCHPRO                    178300      
003490      MOVE 1                 TO WKS-B05-NUMPRO                    178400      
003491      MOVE W77-NUMSIS        TO WKS-B05-SISTEMA                   178500      
003492      MOVE 3                 TO WKS-B05-NUMREGINI                 178600      
003493      MOVE ZERO              TO  WKS-B05-FCHINI                   178700      
003494      CALL "B05PROCESOS IN LIB-CONTROL" USING WKS-B05PROCESOS     178800      
003495                                        GIVING W77-RESULT-LIBCON  178900      
003496                                                                  179000      
003497      IF W77-RESULT-LIBCON > 0                                    179100      
003498         MOVE 19             TO WKS-B05-FUNCION                   179200      
003499                                W77-FUN-CTL                       179300      
003500         MOVE W77-FECPRO-B05 TO WKS-B05-FCHPRO                    179400      
003501         MOVE 1              TO WKS-B05-NUMPRO                    179500      
003502         MOVE W77-NUMSIS     TO WKS-B05-SISTEMA                   179600      
003503         MOVE 3              TO WKS-B05-NUMREGINI                 179700      
003504         MOVE ZERO           TO WKS-B05-FCHINI                    179800      
003505                                WKS-B05-STAPGM                    179900      
003506         CALL "B05PROCESOS IN LIB-CONTROL" USING WKS-B05PROCESOS  180000      
003507                                        GIVING W77-RESULT-LIBCON  180100      
003508                                                                  180200      
003509         IF W77-RESULT-LIBCON > 0                                 180300      
003510            PERFORM 01-0950-ERROR-LIBCTL                          180400      
003511         ELSE                                                     180500      
003512            NEXT SENTENCE                                         180600      
003513      ELSE                                                        180700      
003514         IF WKS-B05-STAPGM = 1                                    180800      
003515            MOVE 1         TO WKS-PROCESADO                       180900      
003516         ELSE                                                     181000      
003517            NEXT SENTENCE.                                        181100      
003518                                                                  181200      
003519 01-0060-ACTUALIZA-B05.                                           181300      
003520*======================                                           181400      
003521   IF W77-FUN-PROY = 0                                            181500      
003522      MOVE 37             TO WKS-B05-FUNCION                      181600      
003523                             W77-FUN-CTL                          181700      
003524      MOVE W77-FECPRO-B05 TO WKS-B05-FCHPRO                       181800      
003525      MOVE 1              TO WKS-B05-NUMPRO                       181900      
003526      MOVE W77-NUMSIS     TO WKS-B05-SISTEMA                      182000      
003527      MOVE ZERO           TO WKS-B05-NUMREGINI                    182100      
003528                             WKS-B05-FCHINI                       182200      
003529      MOVE 1              TO WKS-B05-STAPGM                       182300      
003530      CALL "B05PROCESOS IN LIB-CONTROL" USING WKS-B05PROCESOS     182400      
003531                                     GIVING W77-RESULT-LIBCON.    182500      
003532      IF W77-RESULT-LIBCON > 0                                    182600      
003533         PERFORM 01-0950-ERROR-LIBCTL                             182700      
003534      ELSE                                                        182800      
003535         NEXT SENTENCE.                                           182900      
003536                                                                  183000      
003537   IF W77-FUN-PROY = 3                                            183100      
003538      IF W77-NUMSIS = 500                                         183200      
003539         MOVE 37             TO WKS-B05-FUNCION                   183300      
003540                                W77-FUN-CTL                       183400      
003541         MOVE W77-FECPRO-B05 TO WKS-B05-FCHPRO                    183500      
003542         MOVE 1              TO WKS-B05-NUMPRO                    183600      
003543         MOVE W77-NUMSIS     TO WKS-B05-SISTEMA                   183700      
003544         MOVE 3              TO WKS-B05-NUMREGINI                 183800      
003545         MOVE ZERO           TO WKS-B05-FCHINI                    183900      
003546         MOVE 1              TO WKS-B05-STAPGM                    184000      
003547         CALL "B05PROCESOS IN LIB-CONTROL" USING WKS-B05PROCESOS  184100      
003548                                        GIVING W77-RESULT-LIBCON  184200      
003549         IF W77-RESULT-LIBCON > 0                                 184300      
003550            PERFORM 01-0950-ERROR-LIBCTL                          184400      
003551         ELSE                                                     184500      
003552            NEXT SENTENCE                                         184600      
003553      ELSE                                                        184700      
003554         MOVE 37             TO WKS-B05-FUNCION                   184800      
003555                                W77-FUN-CTL                       184900      
003556         MOVE W77-FECPRO-B05 TO WKS-B05-FCHPRO                    185000      
003557         MOVE 0              TO WKS-B05-NUMPRO                    185100      
003558         MOVE 151            TO WKS-B05-SISTEMA                   185200      
003559         MOVE ZERO           TO WKS-B05-NUMREGINI                 185300      
003560                                WKS-B05-FCHINI                    185400      
003561         MOVE W77-NUMSIS     TO WKS-B05-NUMREGFIN                 185500      
003562         CALL "B05PROCESOS IN LIB-CONTROL" USING WKS-B05PROCESOS  185600      
003563                                        GIVING W77-RESULT-LIBCON  185700      
003564         IF W77-RESULT-LIBCON > 0                                 185800      
003565            PERFORM 01-0950-ERROR-LIBCTL                          185900      
003566         ELSE                                                     186000      
003567            NEXT SENTENCE.                                        186100      
003568                                                                  186200      
003569 01-01131-OBTENER-FEC-SIST.                                       186300      
003570*=========================                                        186400      
003571     MOVE ZERO                     TO W77-RESULT-LIBCON.          186500      
003572     MOVE 1                        TO WKS-B01-FUNCION             186600      
003573                                      W77-FUN-CTL.                186700      
003574     MOVE 151                      TO WKS-B01-SISTEMA.            186800      
003575     MOVE WKS-NUMCSI               TO WKS-B01-CSI.                186900      
003576                                                                  187000      
003577     CALL "CONSISDIA IN LIB-CONTROL" USING  WKS-S151B01SISDIA     187100      
003578                                     GIVING W77-RESULT-LIBCON.    187200      
003579                                                                  187210      
003580    IF W77-RESULT-LIBCON > 0                                      187220      
003581       PERFORM 01-0950-ERROR-LIBCTL                               187230      
003582    ELSE                                                          187240      
003583       NEXT SENTENCE.                                             187250      
003584                                                                  187300      
003585** HSC INI ALTA DISPONIBILIDAD * IBM 20-ENE-2015                  187400      
