000001$SET LIST LINEINFO MAP XREF ERRORLIMIT = 5                        000100      
000002$SET OPTIMIZE                                                     000200      
000003$SET LISTOMITTED                                                  000300      
000004************************************************************      000320      
000005* RECOMPILACION POR EL UPGRADE DEL MCP A 55                *      000322      
000006* 20141205 15MTP001 MJGRG                                  *      000324      
000007************************************************************      000326      
000008 IDENTIFICATION DIVISION.                                         000400      
000009 PROGRAM-ID. RECLIDE.                                             000500      
000010 AUTHOR. ING. JAVIER MERCADO FLORES/GUILLERMO MARTINEZ DURAN.     000600      
000011                                                                  000700      
000012 ENVIRONMENT DIVISION.                                            000800      
000013 INPUT-OUTPUT SECTION.                                            000900      
000014 FILE-CONTROL.                                                    001000      
000015                                                                  001100      
000016     SELECT ARCH-TOT-LIDE         ASSIGN TO DISK.                 001200      
000017                                                                  001300      
000018     SELECT A01-TOT-LIDE-VDM      ASSIGN TO DISK.                 001400      
000019                                                                  001500      
000020     SELECT A02-TOT-LIDE-MTY      ASSIGN TO DISK.                 001600      
000021                                                                  001700      
000022     SELECT A03-TOT-LIDE-UNI      ASSIGN TO DISK.                 001800      
000023                                                                  001900      
000024 DATA DIVISION.                                                   002000      
000025 FILE SECTION.                                                    002100      
000026                                                                  002200      
000027***************************************************************   002300      
000028*               ARCHIVOS PARA LIDE DEL SIST. S502             *   002400      
000029***************************************************************   002500      
000030                                                                  002600      
000031 FD ARCH-TOT-LIDE                                                 002700      
000032*================                                                 002800      
000033     VALUE OF TITLE IS WKS-S151-TOTLIDE                           002900      
000034              SECURITYTYPE IS PUBLIC.                             003000      
000035                                                                  003100      
000036 01  REG-TOTLIDE                   PIC X(60).                     003200      
000037                                                                  003300      
000038 FD A01-TOT-LIDE-VDM                                              003400      
000039*====================                                             003500      
000040     VALUE OF                                                     003600      
000041              SECURITYTYPE IS PUBLIC                              003700      
000042              TITLE WKS-S151-TOTLIDE-VDM                          003800      
000043              DEPENDENTSPECS IS TRUE.                             003900      
000044                                                                  004000      
000045 01  REG-TOTLIDE-VDM               PIC X(60).                     004100      
000046                                                                  004200      
000047 FD A02-TOT-LIDE-MTY                                              004300      
000048*====================                                             004400      
000049     VALUE OF                                                     004500      
000050              SECURITYTYPE IS PUBLIC                              004600      
000051              TITLE WKS-S151-TOTLIDE-MTY                          004700      
000052              DEPENDENTSPECS IS TRUE.                             004800      
000053                                                                  004900      
000054 01  REG-TOTLIDE-MTY               PIC X(60).                     005000      
000055                                                                  005100      
000056 FD A03-TOT-LIDE-UNI                                              005200      
000057*====================                                             005300      
000058     VALUE OF                                                     005400      
000059              SECURITYTYPE IS PUBLIC                              005500      
000060              TITLE WKS-S151-TOTLIDE-UNI                          005600      
000061              DEPENDENTSPECS IS TRUE.                             005700      
000062                                                                  005800      
000063 01  REG-TOTLIDE-UNI               PIC X(60).                     005900      
000064                                                                  006000      
000065                                                                  006100      
000066  WORKING-STORAGE SECTION.                                        006200      
000067*=========================                                        006300      
000068                                                                  006400      
000069 77  W77-TOT-REG                   PIC 9(08) COMP VALUE 0.        006500      
000070 77  W77-TOT-NUM-CAR               PIC 9(10) COMP VALUE 0.        006600      
000071 77  W77-TOT-IMP-CAR               PIC 9(18)V99 COMP.             006700      
000072 77  W77-TOT-NUM-ABO               PIC 9(10) COMP VALUE 0.        006800      
000073 77  W77-TOT-IMP-ABO               PIC 9(18)V99 COMP.             006900      
000074                                                                  007000      
000075 77  W77-UNE-LIDE                  PIC 9(01) VALUE ZERO.          007100      
000076 77  W77-FIN                       PIC 9(02) COMP VALUE ZEROS.    007200      
000077                                                                  007300      
000078 01  WKS-TOT-NUM                   PIC X(07).                     007400      
000079 01  WKS-TOT-NUM-RED               REDEFINES WKS-TOT-NUM.         007500      
000080     03 WKS-TOT-NUM-1              PIC X(03).                     007600      
000081     03 FILLER                     PIC X(01).                     007700      
000082     03 WKS-TOT-NUM-2              PIC X(03).                     007800      
000083                                                                  007900      
000084 01  WKS-TOT-IMP                   PIC X(22).                     008000      
000085 01  WKS-TOT-IMP-RED               REDEFINES WKS-TOT-IMP.         008100      
000086     03 W77-TOT-IMP-1              PIC X(03).                     008200      
000087     03 FILLER                     PIC X(01).                     008300      
000088     03 W77-TOT-IMP-2              PIC X(03).                     008400      
000089     03 FILLER                     PIC X(01).                     008500      
000090     03 W77-TOT-IMP-3              PIC X(03).                     008600      
000091     03 FILLER                     PIC X(01).                     008700      
000092     03 W77-TOT-IMP-4              PIC X(03).                     008800      
000093     03 FILLER                     PIC X(01).                     008900      
000094     03 W77-TOT-IMP-5              PIC X(03).                     009000      
000095     03 FILLER                     PIC X(01).                     009100      
000096     03 W77-TOT-IMP-6              PIC X(02).                     009200      
000097                                                                  009300      
000098 01  WKS-R01-S502-NUMCAR           PIC X(06).                     009400      
000099 01  WKS-R01-S502-NUMCAR-ALF       REDEFINES WKS-R01-S502-NUMCAR. 009500      
000100     03 WKS-R01-S502-NUMCAR-A1     PIC X(03).                     009600      
000101     03 WKS-R01-S502-NUMCAR-A2     PIC X(03).                     009700      
000102 01  WKS-R01-S502-NUMCAR-NUM       REDEFINES WKS-R01-S502-NUMCAR  009800      
000103                                   PIC 9(06).                     009900      
000104                                                                  010000      
000105 01  WKS-R01-S502-IMPCAR           PIC X(17).                     010100      
000106 01  WKS-R01-S502-IMPCAR-ALF       REDEFINES WKS-R01-S502-IMPCAR. 010200      
000107     03 WKS-R01-S502-IMPCAR-A1     PIC X(03).                     010300      
000108     03 WKS-R01-S502-IMPCAR-A2     PIC X(03).                     010400      
000109     03 WKS-R01-S502-IMPCAR-A3     PIC X(03).                     010500      
000110     03 WKS-R01-S502-IMPCAR-A4     PIC X(03).                     010600      
000111     03 WKS-R01-S502-IMPCAR-A5     PIC X(03).                     010700      
000112     03 WKS-R01-S502-IMPCAR-A6     PIC X(02).                     010800      
000113 01  WKS-R01-S502-IMPCAR-NUM       REDEFINES WKS-R01-S502-IMPCAR  010900      
000114                                   PIC 9(15)V99.                  011000      
000115                                                                  011100      
000116 01  WKS-R01-S502-NUMABO           PIC X(06).                     011200      
000117 01  WKS-R01-S502-NUMABO-ALF       REDEFINES WKS-R01-S502-NUMABO. 011300      
000118     03 WKS-R01-S502-NUMABO-A1     PIC X(03).                     011400      
000119     03 WKS-R01-S502-NUMABO-A2     PIC X(03).                     011500      
000120 01  WKS-R01-S502-NUMABO-NUM       REDEFINES WKS-R01-S502-NUMABO  011600      
000121                                   PIC 9(06).                     011700      
000122                                                                  011800      
000123 01  WKS-R01-S502-IMPABO           PIC X(17).                     011900      
000124 01  WKS-R01-S502-IMPABO-ALF       REDEFINES WKS-R01-S502-IMPABO. 012000      
000125     03 WKS-R01-S502-IMPABO-A1     PIC X(03).                     012100      
000126     03 WKS-R01-S502-IMPABO-A2     PIC X(03).                     012200      
000127     03 WKS-R01-S502-IMPABO-A3     PIC X(03).                     012300      
000128     03 WKS-R01-S502-IMPABO-A4     PIC X(03).                     012400      
000129     03 WKS-R01-S502-IMPABO-A5     PIC X(03).                     012500      
000130     03 WKS-R01-S502-IMPABO-A6     PIC X(02).                     012600      
000131 01   WKS-R01-S502-IMPABO-NUM      REDEFINES WKS-R01-S502-IMPABO  012700      
000132                                   PIC 9(15)V99.                  012800      
000133                                                                  012900      
000134*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000135* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           013000      
000136**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000137  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000138  01 MENSAJE-LJ.                                                  100300      
000139     02 SISTEMA-LJ     PIC X(04).                                 100400      
000140     02 FILLER         PIC X VALUE "/".                           100500      
000141     02 PASO-LJ        PIC X(04).                                 100600      
000142     02 FILLER         PIC X VALUE "/".                           100700      
000143     02 MTP-LJ         PIC 9(03).                                 100800      
000144     02 FILLER         PIC X VALUE ":".                           100900      
000145     02 TIPO-LJ        PIC X.                                     101000      
000146     02 FILLER         PIC X VALUE ">".                           101100      
000147     02 CODIGO-LJ      PIC 9(06).                                 101200      
000148     02 FILLER         PIC X VALUE "<".                           101300      
000149     02 TEXTO-LJ       PIC X(250).                                101400      
000150*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000151                                                                  013100      
000152*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000153* COPY "S151/FORMATO/ARCHIVO/S502/RECLIDE/TOTALCLINEA".           013200      
000154                                                                  000100      
000155****************************************************************  000200      
000156*  REGISTRO DEL ARCHIVO INTERFASE PARA EL S502 DE LOS TOTALES  *  000300      
000157*  DE LA CONSULTA EN LINEA : Q015116 POR CONCEPTO DE L.I.D.E.  *  000400      
000158****************************************************************  000500      
000159 01 A00-R00-S502-HDR.                                             000600      
000160    02 A00-R00-S502-TIPREG         PIC 9(02)    COMP.             000700      
000161    02 A00-R00-S502-FECPRO         PIC 9(06)    COMP.             000800      
000162    02 A00-R00-S502-FECPRO-R       REDEFINES A00-R00-S502-FECPRO. 000900      
000163       03 A00-R00-S502-FECPRO-AA   PIC 9(02)    COMP.             001000      
000164       03 A00-R00-S502-FECPRO-MM   PIC 9(02)    COMP.             001100      
000165       03 A00-R00-S502-FECPRO-DD   PIC 9(02)    COMP.             001200      
000166    02 A00-R00-S502-HORAPRO        PIC 9(06)    COMP.             001300      
000167    02 A00-R00-S502-HORAPRO-R      REDEFINES A00-R00-S502-HORAPRO.001400      
000168       03 A00-R00-S502-HORAPRO-HH  PIC 9(02)    COMP.             001500      
000169       03 A00-R00-S502-HORAPRO-MM  PIC 9(02)    COMP.             001600      
000170       03 A00-R00-S502-HORAPRO-SS  PIC 9(02)    COMP.             001700      
000171    02 FILLER                      PIC X(53).                     001800      
000172                                                                  001900      
000173 01 A00-R01-S502-REGDET REDEFINES  A00-R00-S502-HDR.              002000      
000174    02 A00-R01-S502-TIPREG         PIC 9(02)    COMP.             002100      
000175    02 A00-R01-S502-SIS            PIC 9(04)    COMP.             002200      
000176    02 A00-R01-S502-CCI            PIC 9(02)    COMP.             002300      
000177    02 A00-R01-S502-COB            PIC X(03).                     002400      
000178    02 A00-R01-S502-NOMRENG        PIC X(15).                     002500      
000179    02 A00-R01-S502-NUMCAR         PIC 9(10)    COMP.             002600      
000180    02 A00-R01-S502-IMPCAR         PIC 9(18)V99 COMP.             002700      
000181    02 A00-R01-S502-NUMABO         PIC 9(10)    COMP.             002800      
000182    02 A00-R01-S502-IMPABO         PIC 9(18)V99 COMP.             002900      
000183    02 FILLER                      PIC X(08).                     003000      
000184                                                                  003100      
000185 01 A00-R02-S502-TRAILER REDEFINES A00-R00-S502-HDR.              003200      
000186    02 A00-R02-S502-TIPREG         PIC 9(02)    COMP.             003300      
000187    02 A00-R02-S502-TOTREG         PIC 9(08)    COMP.             003400      
000188    02 A00-R02-S502-TOTNUMCAR      PIC 9(10)    COMP.             003500      
000189    02 A00-R02-S502-TOTIMPCAR      PIC 9(18)V99 COMP.             003600      
000190    02 A00-R02-S502-TOTNUMABO      PIC 9(10)    COMP.             003700      
000191    02 A00-R02-S502-TOTIMPABO      PIC 9(18)V99 COMP.             003800      
000192    02 FILLER                      PIC X(25).                     003900      
000193                                                                  004000      
000194*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000195                                                                  013300      
000196******************************************************************013400      
000197*         NOMBRE DEL ARCHIVO GENERADO PARA TOTALES LIDE          *013500      
000198******************************************************************013600      
000199                                                                  013700      
000200 01  WKS-S151-TOTLIDE.                                            013800      
000201     02 FILLER                     PIC X(29) VALUE                013900      
000202        "(S151)S151/FILE/S502/RECLIDE/".                          014000      
000203     02 WKS-TOTLIDE-CCI            PIC 9(02) VALUE 0.             014100      
000204     02 FILLER                     PIC X(04) VALUE "/10/".        014200      
000205     02 WKS-FEC-ARCH-AA            PIC 9(02).                     014300      
000206     02 WKS-FEC-ARCH-MM            PIC 9(02).                     014400      
000207     02 WKS-FEC-ARCH-DD            PIC 9(02).                     014500      
000208     02 FILLER                     PIC X(16) VALUE                014600      
000209        " ON CMEMP.      ".                                       014700      
000210                                                                  014800      
000211 01  WKS-S151-NOMBRE-TOTLIDE.                                     014900      
000212     02 FILLER                     PIC X(06).                     015000      
000213     02 WKS-S151-NOMB-TOTLIDE      PIC X(35).                     015100      
000214     02 FILLER                     PIC X(16).                     015200      
000215                                                                  015300      
000216*===============================================                  015400      
000217*      PARAMETROS PARA EL COPY DE LIBRERIAS    =                  015500      
000218*===============================================                  015600      
000219                                                                  015700      
000220 01  WKS-COPY-L030.                                               015800      
000221     03 FILLER                     PIC X(11) VALUE "BEGIN JOB; ". 015900      
000222     03 FILLER                     PIC X(07) VALUE "REMOVE ".     016000      
000223     03 WKS-REM-DEST               PIC X(46).                     016100      
000224     03 FILLER                     PIC X(09) VALUE " ON CMEMP".   016200      
000225     03 FILLER                     PIC X(07) VALUE "; COPY ".     016300      
000226     03 WKS-COPY-SOURCE            PIC X(46).                     016400      
000227     03 FILLER                     PIC X(04) VALUE " AS ".        016500      
000228     03 WKS-COPY-DEST              PIC X(46).                     016600      
000229     03 FILLER                     PIC X(32) VALUE                016700      
000230     " FROM CMEMP(PACK) TO CMEMP(PACK)".                          016800      
000231                                                                  016900      
000232 01  WKS-CTLVER-LIBID              PIC X(12).                     017000      
000233 01  WKS-CTLVER-NOMLIB             PIC X(72).                     017100      
000234 01  W77-CTLVER-RESULT             PIC S9(11) BINARY.             017200      
000235                                                                  017300      
000236 01  WKS-DATOS-HOST.                                              017400      
000237     03 WKS-NUMCSI-HOST            PIC 9(02).                     017500      
000238     03 WKS-NOMEQUIPO              PIC X(10).                     017600      
000239     03 WKS-NOMCSI                 PIC X(26).                     017700      
000240     03 WKS-LINEA-BATCH            PIC X(05).                     017800      
000241                                                                  017900      
000242****************************************************************  018000      
000243*   DESCRIPCION DE FORMATOS DE LLAMADO A LIBRERIA L030         *  018100      
000244****************************************************************  018200      
000245                                                                  018300      
000246*INICIO  COPY PARA CPBAS                                          018400      
000247*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000248*     COPY "(S151)S151/SOURCE/FORMATO/LIBL030/03MTP001 ON CMEMP.".018500      
000249*================================================================ 000500      
000250* FUNCION 16 .- CONSULTA  DE TOTALES DEL S408                   = 001000      
000251*                                                               = 001500      
000252*================================================================ 002000      
000253 01 WKS-PANTALLAS-ENT              PIC X(1872).                   002500      
000254 01 WKS-PAN-ENT                    REDEFINES WKS-PANTALLAS-ENT.   003000      
000255    02 WKS-PAN-ENTSIS              PIC 9(03).                     003500      
000256    02 WKS-PAN-ENTNUMPAN           PIC 9(02).                     004000      
000257    02 WKS-ENT-TEXTO               PIC X(1867).                   004500      
000258                                                                  005000      
000259***************************************************************** 005050      
000260** FUNCION 0                                                    * 005100      
000261***************************************************************** 005150      
000262                                                                  005200      
000263    02 WKS-ENT-P00             REDEFINES WKS-ENT-TEXTO.           005250      
000264       03 WKS-ENT-P00-SIS          PIC 9(03).                     005300      
000265       03 FILLER                   PIC X(1864).                   005350      
000266                                                                  005400      
000267***************************************************************** 005500      
000268** PANTALLA 16 (CONS. DE TOTALES POR SISTEMA DEL DIA)           * 006000      
000269***************************************************************** 006500      
000270                                                                  007000      
000271    02 WKS-ENT-P16             REDEFINES WKS-ENT-TEXTO.           007500      
000272     03 WKS-ENT-P16-DAT          PIC X(80).                       008000      
000273     03 WKS-ENT-P16-DAT-R        REDEFINES WKS-ENT-P16-DAT.       008500      
000274        04 WKS-ENT-P16CSI        PIC 9(02).                       009000      
000275        04 WKS-ENT-P16CSI-A      REDEFINES                        009500      
000276           WKS-ENT-P16CSI        PIC X(02).                       010000      
000277        04 WKS-ENT-P16SIS        PIC 9(04).                       010500      
000278        04 WKS-ENT-P16SIS-A      REDEFINES                        011000      
000279           WKS-ENT-P16SIS        PIC X(04).                       011500      
000280        04 WKS-ENT-P16FEC        PIC 9(08).                       012000      
000281        04 WKS-ENT-P16FEC-A      REDEFINES                        012500      
000282           WKS-ENT-P16FEC        PIC X(08).                       013000      
000283        04 WKS-ENT-P16SUC        PIC 9(04).                       013500      
000284        04 WKS-ENT-P16SUC-A      REDEFINES                        014000      
000285           WKS-ENT-P16SUC        PIC X(04).                       014500      
000286        04 WKS-ENT-P16CAJ        PIC 9(04).                       015000      
000287        04 WKS-ENT-P16CAJ-A      REDEFINES                        015500      
000288           WKS-ENT-P16CAJ        PIC X(04).                       016000      
000289        04 WKS-ENT-P16CAJ-D      REDEFINES                        016500      
000290           WKS-ENT-P16CAJ.                                        017000      
000291           05 WKS-ENT-P16CAJ-1D  PIC X(01).                       017500      
000292           05 WKS-ENT-P16CAJ-2D  PIC X(01).                       018000      
000293           05 WKS-ENT-P16CAJ-RD  PIC 9(02).                       018500      
000294        04 WKS-ENT-P16CAJ-DX     REDEFINES WKS-ENT-P16CAJ.        019000      
000295           05 WKS-ENT-P16CAJ-1X  PIC X(01).                       019500      
000296           05 WKS-ENT-P16CAJ-2X  PIC X(01).                       020000      
000297           05 WKS-ENT-P16CAJ-3X  PIC X(01).                       020500      
000298           05 WKS-ENT-P16CAJ-4X  PIC X(01).                       021000      
000299        04 WKS-ENT-P16BCOORI     PIC 9(03).                       021500      
000300        04 WKS-ENT-P16BCOORI-A   REDEFINES                        022000      
000301           WKS-ENT-P16BCOORI     PIC X(03).                       022500      
000302        04 WKS-ENT-P16BCODES     PIC 9(03).                       023000      
000303        04 WKS-ENT-P16BCODES-A   REDEFINES                        023500      
000304           WKS-ENT-P16BCODES     PIC X(03).                       024000      
000305        04 WKS-ENT-P16MON        PIC 9(04).                       024500      
000306        04 WKS-ENT-P16MON-A      REDEFINES                        025000      
000307           WKS-ENT-P16MON        PIC X(04).                       025500      
000308        04 WKS-ENT-P16MONCON     PIC 9(14).                       026000      
000309        04 WKS-ENT-P16MONCON-A   REDEFINES                        026500      
000310           WKS-ENT-P16MONCON     PIC X(14).                       027000      
000311        04 WKS-ENT-P16MONCON-R   REDEFINES                        027500      
000312           WKS-ENT-P16MONCON.                                     028000      
000313           05 WKS-ENT-P16BCOS    PIC 9(06).                       028500      
000314           05 WKS-ENT-P16MONANT  PIC 9(04).                       029000      
000315           05 WKS-ENT-P16CONANT  PIC 9(04).                       029500      
000316        04 FILLER                PIC X(34).                       030000      
000317        03 FILLER                   PIC X(1787).                  030500      
000318                                                                  031000      
000319 01 WKS-PANTALLAS-SAL              PIC X(1872).                   031500      
000320 01 WKS-PAN-SAL                    REDEFINES WKS-PANTALLAS-SAL.   032000      
000321    02 WKS-PAN-SALSIS              PIC 9(03).                     032500      
000322    02 WKS-PAN-SALNUMPAN           PIC 9(02).                     033000      
000323    02 WKS-SAL-TEXTO               PIC X(1867).                   033500      
000324                                                                  034000      
000325******************************************************************034500      
000326** PANTALLA 16 (CONS. DE TOTALES POR SISTEMA DEL DIA)           **035000      
000327******************************************************************035500      
000328                                                                  036000      
000329    02 WKS-SAL-P16                 REDEFINES WKS-SAL-TEXTO.       036500      
000330    03 WKS-SAL-P16POS-05-01     PIC X(04).                        037000      
000331    03 WKS-SAL-P16CSI           PIC Z(02).                        037500      
000332    03 WKS-SAL-P16SIS           PIC Z(04).                        038000      
000333    03 WKS-SAL-P16SUC           PIC Z(04).                        038500      
000334    03 WKS-SAL-P16CAJ           PIC Z(04).                        039000      
000335    03 WKS-SAL-P16CAJ-D         REDEFINES                         039500      
000336       WKS-SAL-P16CAJ.                                            040000      
000337       04 WKS-SAL-P16CAJ-2N     PIC 9(02).                        040500      
000338       04 WKS-SAL-P16CAJ-4N     PIC 9(02).                        041000      
000339    03 WKS-SAL-P16CAJ-A         REDEFINES                         041500      
000340       WKS-SAL-P16CAJ.                                            042000      
000341       04 WKS-SAL-P16CAJ-1A     PIC X(01).                        042500      
000342       04 WKS-SAL-P16CAJ-2D     PIC X(01).                        043000      
000343       04 WKS-SAL-P16CAJ-RD     PIC 9(02).                        043500      
000344     03 WKS-SAL-P16CAJ-AA        REDEFINES                        044000      
000345        WKS-SAL-P16CAJ           PIC X(04).                       044500      
000346     03 WKS-SAL-P16BCOORI        PIC Z(03).                       045000      
000347     03 WKS-SAL-P16BCODES        PIC 9(03).                       045500      
000348     03 WKS-SAL-P16MON           PIC Z(04).                       046000      
000349     03 WKS-SAL-P16DESDATOS      PIC X(04).                       046500      
000350     03 WKS-SAL-P16POS-05-61     PIC X(04).                       047000      
000351     03 WKS-SAL-P16MONCON        PIC 9(14).                       047500      
000352     03 WKS-SAL-P16MONCON-R      REDEFINES                        048000      
000353        WKS-SAL-P16MONCON.                                        048500      
000354        04 WKS-SAL-P16BCOS       PIC 9(06).                       049000      
000355        04 WKS-SAL-P16MONANT     PIC 9(04).                       049500      
000356        04 WKS-SAL-P16CONANT     PIC 9(04).                       050000      
000357     03 WKS-SAL-P16POS-06-01     PIC X(04).                       050500      
000358     03 WKS-SAL-P16NOMSIS        PIC X(30).                       051000      
000359     03 WKS-SAL-P16POS-07-25     PIC X(04).                       051500      
000360     03 WKS-SAL-P16LEY-CGO       PIC X(13).                       052000      
000361     03 WKS-SAL-P16POS-07-56     PIC X(04).                       052500      
000362     03 WKS-SAL-P16LEY-ABO       PIC X(13).                       053000      
000363*    03 WKS-SAL-P16PROTEGE       PIC X(04).                       053500      
000364     03 WKS-SAL-P16POS-09-01     PIC X(04).                       054000      
000365     03 WKS-SAL-P16DATOS         PIC X(1033).                     054500      
000366     03 WKS-SAL-P16DATOS-R       REDEFINES WKS-SAL-P16DATOS.      055000      
000367        04 WKS-SAL-P16DAT        OCCURS 12 TIMES.                 055500      
000368           05 WKS-SAL-P16CON     PIC X(17).                       056000      
000369           05 WKS-SAL-P16CONDAT  PIC X(63).                       056500      
000370           05 WKS-SAL-P16TOTIMP  REDEFINES WKS-SAL-P16CONDAT.     057000      
000371              06 WKS-SAL-P16NUCA PIC ZZZ,ZZZB(01).                057500      
000372              06 WKS-SAL-P16IMCA PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99B(2).  058000      
000373              06 WKS-SAL-P16NUAB PIC ZZZ,ZZZB(01).                058500      
000374              06 WKS-SAL-P16IMAB PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99B(1).  059000      
000375          05 WKS-SAL-P16LIN11 REDEFINES WKS-SAL-P16CONDAT.        059500      
000376              06 WKS-SAL-P16-RNCA PIC X(07)B(01).                 060000      
000377              06 WKS-SAL-P16-RICA PIC X(22)B(02).                 060500      
000378              06 WKS-SAL-P16-RNAB PIC X(07)B(01).                 061000      
000379              06 WKS-SAL-P16-RIAB PIC X(22)B(01).                 061500      
000380       04 WKS-SAL-P16POS-23-15  PIC X(04).                        062000      
000381       04 WKS-SAL-P16LEY        PIC X(65).                        062500      
000382       04 WKS-SAL-P16PRODATOS   PIC X(04).                        063000      
000383      03 FILLER                  PIC X(712).                      063500      
000384                                                                  064000      
000385*77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             064500      
000386*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000387                                                                  018600      
000388 77  W77-L030                      PIC 9(02).                     018700      
000389 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             018800      
000390                                                                  018900      
000391 01  WKS-FECHA-MAQUINA             PIC X(10) TYPE IS NUMERIC-DATE.019000      
000392 01  WKS-FECHA-MAQUINA-R           REDEFINES WKS-FECHA-MAQUINA.   019100      
000393     03 WKS-FECMAQ-MM              PIC 9(02).                     019200      
000394     03 WKS-DIAGONAL1              PIC X(01).                     019300      
000395     03 WKS-FECMAQ-DD              PIC 9(02).                     019400      
000396     03 WKS-DIAGONAL2              PIC X(01).                     019500      
000397     03 WKS-FECMAQ-AAAA            PIC 9(04).                     019600      
000398     03 WKS-FECMAQ-AAAA-R          REDEFINES WKS-FECMAQ-AAAA.     019700      
000399        05 WKS-FECMAQ-CC           PIC 9(02).                     019800      
000400        05 WKS-FECMAQ-AA           PIC 9(02).                     019900      
000401                                                                  020000      
000402 01  WKS-FECHA                     PIC 9(08).                     020100      
000403 01  WKS-FECHA-R                   REDEFINES WKS-FECHA.           020200      
000404     03 WKS-FEC-AAAA               PIC 9(04).                     020300      
000405     03 WKS-FEC-MM                 PIC 9(02).                     020400      
000406     03 WKS-FEC-DD                 PIC 9(02).                     020500      
000407                                                                  020600      
000408 01  WKS-HR-MAQUINA                PIC 9(08) TYPE IS NUMERIC-TIME.020700      
000409 01  WKS-HR-MAQUINA-R              REDEFINES WKS-HR-MAQUINA.      020800      
000410     03 WKS-HH-MAQUINA             PIC 9(02).                     020900      
000411     03 WKS-H-DIAGONAL1            PIC X(01).                     021000      
000412     03 WKS-MM-MAQUINA             PIC 9(02).                     021100      
000413     03 WKS-H-DIAGONAL2            PIC X(01).                     021200      
000414     03 WKS-SS-MAQUINA             PIC 9(02).                     021300      
000415                                                                  021400      
000416*************************************************************     021500      
000417****     DEFINICI¿N DE VARIABLES PARA LA COPIA POR       ****     021600      
000418****     PROGRAMA DE UNA COBERTURA A OTRA.               ****     021700      
000419****     "COPIA DE ARCHIVO RECLIDE DE UN EQUIPO A OTRO"  ****     021800      
000420*************************************************************     021900      
000421                                                                  022000      
000422 01  WKS-TITULO-ARCH-CAP.                                         022100      
000423     03 FILLER                     PIC X(04) VALUE "ADD ".        022200      
000424     03 WKS-ARCH-USER              PIC X(06).                     022300      
000425     03 WKS-NOMB-ARCH              PIC X(55).                     022400      
000426     03 FILLER                     PIC X(06) VALUE " FROM ".      022500      
000427     03 WKS-PACK-ORI               PIC X(17).                     022600      
000428     03 FILLER                     PIC X(01) VALUE ",".           022700      
000429     03 WKS-NODO-ORI               PIC X(08).                     022800      
000430     03 FILLER                     PIC X(04) VALUE " TO ".        022900      
000431     03 WKS-PACK-DES               PIC X(17).                     023000      
000432     03 FILLER                     PIC X(01) VALUE ",".           023100      
000433     03 WKS-NODO-DES               PIC X(08).                     023200      
000434                                                                  023300      
000435 77  WS-TRF-RESULT                 PIC 9(11) BINARY.              023400      
000436 77  WS-TRF-TAMACOM                PIC 9(11) BINARY.              023500      
000437 01  WS-TRF-COMANDO                PIC X(200).                    023600      
000438                                                                  023700      
000439******************************************************************023800      
000440*     NOMBRES DE LOS ARCHIVOS GENERADOS PARA EL SISTEMA S502     *023900      
000441******************************************************************024000      
000442                                                                  024100      
000443 01  WKS-S151-TOTLIDE-VDM.                                        024200      
000444     02 FILLER                     PIC X(35) VALUE                024300      
000445        "(S151)S151/FILE/S502/RECLIDE/10/10/".                    024400      
000446     02 WKS-FEC-ARCH1-AA           PIC 9(02).                     024500      
000447     02 WKS-FEC-ARCH1-MM           PIC 9(02).                     024600      
000448     02 WKS-FEC-ARCH1-DD           PIC 9(02).                     024700      
000449     02 FILLER                     PIC X(16) VALUE                024800      
000450        " ON CMEMP.      ".                                       024900      
000451                                                                  025000      
000452 01  WKS-S151-TOTLIDE-MTY.                                        025100      
000453     02 FILLER                     PIC X(35) VALUE                025200      
000454        "(S151)S151/FILE/S502/RECLIDE/04/10/".                    025300      
000455     02 WKS-FEC-ARCH2-AA           PIC 9(02).                     025400      
000456     02 WKS-FEC-ARCH2-MM           PIC 9(02).                     025500      
000457     02 WKS-FEC-ARCH2-DD           PIC 9(02).                     025600      
000458     02 FILLER                     PIC X(16) VALUE                025700      
000459        " ON CMEMP.      ".                                       025800      
000460                                                                  025900      
000461******************************************************************026000      
000462*      NOMBRE DEL ARCHIVO DE TOTALES LIDE UNIDO PARA EL S502     *026100      
000463******************************************************************026200      
000464                                                                  026300      
000465 01  WKS-S151-TOTLIDE-UNI.                                        026400      
000466     02  FILLER                    PIC X(36) VALUE                026500      
000467                           "(S502)S151/FILE/S502/RECLIDE/VDMVDM/".026600      
000468*                          "(S151)S151/FILE/S502/RECLIDE/VDMVDM/".026700      
000469     02  WKS-FEC-ARCHUNI-AA        PIC 9(02).                     026800      
000470     02  WKS-FEC-ARCHUNI-MM        PIC 9(02).                     026900      
000471     02  WKS-FEC-ARCHUNI-DD        PIC 9(02).                     027000      
000472     02  FILLER                    PIC X(16) VALUE                027100      
000473                                   " ON IMPUESTOS.  ".            027200      
000474*                                  " ON CMEMP.      ".            027300      
000475                                                                  027400      
000476 PROCEDURE DIVISION.                                              027500      
000477 010000-INICIO-PGMA SECTION.                                      027600      
000478 010100-INICIA-CONTROL.                                           027700      
000479                                                                  027800      
000480     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"  TO                     027900      
000481            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".      028000      
000482                                                                  028100      
000483     MOVE "S151"                   TO SISTEMA-LJ.                 028200      
000484     MOVE "P090"                   TO PASO-LJ.                    028300      
000485     MOVE  002                     TO MTP-LJ.                     028400      
000486     MOVE "I"                      TO TIPO-LJ.                    028500      
000487     MOVE 080610                   TO CODIGO-LJ.                  028600      
000488     MOVE "INICIO DE PROCESO"      TO TEXTO-LJ.                   028700      
000489     PERFORM 020000-INICIO.                                       028800      
000490     PERFORM 030100-PROCESO.                                      028900      
000491                                                                  029000      
000492     IF WKS-NUMCSI-HOST = 04                                      029100      
000493        MOVE "(S151)"              TO WKS-ARCH-USER               029200      
000494        MOVE WKS-S151-TOTLIDE      TO WKS-S151-NOMBRE-TOTLIDE     029300      
000495        MOVE WKS-S151-NOMB-TOTLIDE TO WKS-NOMB-ARCH               029400      
000496        MOVE "CMEMP            "   TO WKS-PACK-ORI                029500      
000497                                      WKS-PACK-DES                029600      
000498        PERFORM 070100-DETERMINA-NODOS                            029700      
000499        PERFORM 080100-ENVIA-ARCHIVO.                             029800      
000500                                                                  029900      
000501     IF WKS-NUMCSI-HOST = 10                                      030000      
000502        PERFORM 050100-ARMA-NOMBRES-ARCHS                         030100      
000503        PERFORM 060100-VALIDA-RESIDENCIA UNTIL W77-UNE-LIDE = 1.  030200      
000504                                                                  030300      
000505     CANCEL "LIB-DISP".                                           030400      
000506     CANCEL "SOPORTECOMS".                                        030500      
000507     CANCEL "DCILIBRARY".                                         030600      
000508     CANCEL "CTRLVERS".                                           030700      
000509                                                                  030800      
000510     IF WKS-NUMCSI-HOST = 04                                      030900      
000511        CANCEL "LIBL030-S087"                                     031000      
000512        CANCEL "XFER".                                            031100      
000513                                                                  031200      
000514     CANCEL "LIBL030-S264".                                       031300      
000515     CANCEL "LIBL030-S500".                                       031400      
000516                                                                  031500      
000517     STOP RUN.                                                    031600      
000518                                                                  031700      
000519 020000-INICIO.                                                   031800      
000520*==============                                                   031900      
000521                                                                  032000      
000522     CHANGE ATTRIBUTE LIBACCESS         OF "XFER" TO BYFUNCTION.  032100      
000523     CHANGE ATTRIBUTE FUNCTIONNAME      OF "XFER" TO "XFER".      032200      
000524                                                                  032300      
000525     CHANGE ATTRIBUTE LIBACCESS         OF "SOPORTECOMS"          032400      
000526                                        TO BYFUNCTION.            032500      
000527     CHANGE ATTRIBUTE FUNCTIONNAME      OF "SOPORTECOMS"          032600      
000528                                        TO "SOPORTECOMS".         032700      
000529                                                                  032800      
000530     CHANGE ATTRIBUTE LIBACCESS         OF "DCILIBRARY"           032900      
000531                                        TO  BYFUNCTION.           033000      
000532     CHANGE ATTRIBUTE FUNCTIONNAME      OF "DCILIBRARY"           033100      
000533                                        TO "COMSSUPPORT".         033200      
000534                                                                  033300      
000535     CHANGE ATTRIBUTE LIBACCESS         OF "CTRLVERS"             033400      
000536                                        TO BYFUNCTION.            033500      
000537     CHANGE ATTRIBUTE FUNCTIONNAME      OF "CTRLVERS"             033600      
000538                                        TO "CTLVERS".             033700      
000539                                                                  033800      
000540     CALL "CSIID OF SOPORTECOMS"        USING WKS-DATOS-HOST.     033900      
000541                                                                  034000      
000542     IF WKS-NUMCSI-HOST = 32                                      034100      
000543        MOVE 04                         TO WKS-NUMCSI-HOST.       034200      
000544                                                                  034300      
000545     MOVE "S151L030CON"                 TO     WKS-CTLVER-LIBID.  034400      
000546     CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID   034500      
000547                                               WKS-CTLVER-NOMLIB  034600      
000548                                        GIVING W77-CTLVER-RESULT. 034700      
000549                                                                  034800      
000550     IF W77-CTLVER-RESULT = 0                                     034900      
000551        IF WKS-NUMCSI-HOST = 04                                   035000      
000552           MOVE WKS-CTLVER-NOMLIB TO WKS-COPY-DEST WKS-COPY-SOURCE035100      
000553           INSPECT WKS-COPY-DEST REPLACING ALL "NNNN" BY "0087"   035200      
000554           CHANGE ATTRIBUTE TITLE OF "LIBL030-S087"               035300      
000555                                        TO WKS-COPY-DEST          035400      
000556           MOVE    WKS-COPY-DEST        TO WKS-REM-DEST           035500      
000557           CALL SYSTEM WFL USING WKS-COPY-L030                    035600      
000558           MOVE 087                     TO WKS-PAN-ENTSIS         035700      
000559                                           WKS-ENT-P00-SIS        035800      
000560           MOVE 0                       TO WKS-PAN-ENTNUMPAN      035900      
000561           PERFORM 030364-CALL-L030-S087.                         036000      
000562                                                                  036100      
000563     IF W77-CTLVER-RESULT = 0                                     036200      
000564        MOVE WKS-CTLVER-NOMLIB TO WKS-COPY-DEST WKS-COPY-SOURCE   036300      
000565        INSPECT WKS-COPY-DEST REPLACING ALL "NNNN" BY "0264"      036400      
000566        CHANGE ATTRIBUTE TITLE OF "LIBL030-S264"                  036500      
000567                                        TO WKS-COPY-DEST          036600      
000568        MOVE    WKS-COPY-DEST           TO WKS-REM-DEST           036700      
000569        CALL SYSTEM WFL USING WKS-COPY-L030                       036800      
000570        MOVE 264                        TO WKS-PAN-ENTSIS         036900      
000571                                           WKS-ENT-P00-SIS        037000      
000572        MOVE 0                          TO WKS-PAN-ENTNUMPAN      037100      
000573        PERFORM 030364-CALL-L030-S264.                            037200      
000574                                                                  037300      
000575     IF W77-CTLVER-RESULT = 0                                     037400      
000576        MOVE WKS-CTLVER-NOMLIB TO WKS-COPY-DEST WKS-COPY-SOURCE   037500      
000577        INSPECT WKS-COPY-DEST REPLACING ALL "NNNN" BY "0500"      037600      
000578        CHANGE ATTRIBUTE TITLE OF "LIBL030-S500"                  037700      
000579                                        TO WKS-COPY-DEST          037800      
000580        MOVE    WKS-COPY-DEST           TO WKS-REM-DEST           037900      
000581        CALL SYSTEM WFL USING WKS-COPY-L030                       038000      
000582        MOVE 500                        TO WKS-PAN-ENTSIS         038100      
000583                                           WKS-ENT-P00-SIS        038200      
000584        MOVE 0                          TO WKS-PAN-ENTNUMPAN      038300      
000585        PERFORM 030364-CALL-L030-S500.                            038400      
000586                                                                  038500      
000587     ACCEPT WKS-FECHA-MAQUINA      FROM TODAYS-DATE.              038600      
000588                                                                  038700      
000589     ACCEPT WKS-HR-MAQUINA         FROM TIME.                     038800      
000590                                                                  038900      
000591     MOVE WKS-FECMAQ-AAAA          TO WKS-FEC-AAAA                039000      
000592     MOVE WKS-FECMAQ-MM            TO WKS-FEC-MM                  039100      
000593     MOVE WKS-FECMAQ-DD            TO WKS-FEC-DD.                 039200      
000594                                                                  039300      
000595 030100-PROCESO.                                                  039400      
000596*===============                                                  039500      
000597                                                                  039600      
000598     PERFORM 030304-ARMA-NOMBRE-ARCHLIDE.                         039700      
000599                                                                  039800      
000600     IF WKS-NUMCSI-HOST = 04                                      039900      
000601        PERFORM 030360-ENVIA-S087.                                040000      
000602                                                                  040100      
000603     PERFORM 030360-ENVIA-S264.                                   040200      
000604     PERFORM 030360-ENVIA-S500.                                   040300      
000605     PERFORM 030370-GRABA-TRAILER.                                040400      
000606                                                                  040500      
000607 030304-ARMA-NOMBRE-ARCHLIDE.                                     040600      
000608*============================                                     040700      
000609                                                                  040800      
000610     MOVE WKS-NUMCSI-HOST          TO WKS-TOTLIDE-CCI.            040900      
000611                                                                  041000      
000612     MOVE WKS-FECMAQ-AA            TO WKS-FEC-ARCH-AA             041100      
000613                                      WKS-FEC-ARCH1-AA            041200      
000614                                      WKS-FEC-ARCH2-AA            041300      
000615                                      WKS-FEC-ARCHUNI-AA          041400      
000616     MOVE WKS-FECMAQ-MM            TO WKS-FEC-ARCH-MM             041500      
000617                                      WKS-FEC-ARCH1-MM            041600      
000618                                      WKS-FEC-ARCH2-MM            041700      
000619                                      WKS-FEC-ARCHUNI-MM          041800      
000620     MOVE WKS-FECMAQ-DD            TO WKS-FEC-ARCH-DD             041900      
000621                                      WKS-FEC-ARCH1-DD            042000      
000622                                      WKS-FEC-ARCH2-DD            042100      
000623                                      WKS-FEC-ARCHUNI-DD.         042200      
000624                                                                  042300      
000625     CHANGE ATTRIBUTE TITLE OF ARCH-TOT-LIDE                      042400      
000626                                   TO WKS-S151-TOTLIDE.           042500      
000627                                                                  042600      
000628     OPEN OUTPUT ARCH-TOT-LIDE.                                   042700      
000629                                                                  042800      
000630     MOVE 1                        TO A00-R00-S502-TIPREG.        042900      
000631     MOVE WKS-FECMAQ-AA            TO A00-R00-S502-FECPRO-AA.     043000      
000632     MOVE WKS-FECMAQ-MM            TO A00-R00-S502-FECPRO-MM.     043100      
000633     MOVE WKS-FECMAQ-DD            TO A00-R00-S502-FECPRO-DD.     043200      
000634     MOVE WKS-HH-MAQUINA           TO A00-R00-S502-HORAPRO-HH.    043300      
000635     MOVE WKS-MM-MAQUINA           TO A00-R00-S502-HORAPRO-MM.    043400      
000636     MOVE WKS-SS-MAQUINA           TO A00-R00-S502-HORAPRO-SS.    043500      
000637     WRITE REG-TOTLIDE             FROM A00-R00-S502-HDR.         043600      
000638                                                                  043700      
000639 030360-ENVIA-S087.                                               043800      
000640*==================                                               043900      
000641                                                                  044000      
000642     MOVE LOW-VALUES               TO WKS-PANTALLAS-ENT           044100      
000643                                      A00-R01-S502-REGDET.        044200      
000644     MOVE 2                        TO A00-R01-S502-TIPREG.        044300      
000645     MOVE 1                        TO WKS-ENT-P16MON.             044400      
000646     PERFORM 030362-ARMA-L030-S087                                044500      
000647     MOVE WKS-SAL-P16CON (8)       TO A00-R01-S502-NOMRENG.       044600      
000648     MOVE WKS-SAL-P16NUCA(8)       TO WKS-TOT-NUM.                044700      
000649     MOVE WKS-TOT-NUM-1            TO WKS-R01-S502-NUMCAR-A1.     044800      
000650     MOVE WKS-TOT-NUM-2            TO WKS-R01-S502-NUMCAR-A2.     044900      
000651     MOVE WKS-R01-S502-NUMCAR-NUM  TO A00-R01-S502-NUMCAR.        045000      
000652     MOVE WKS-SAL-P16IMCA(8)       TO WKS-TOT-IMP.                045100      
000653     MOVE W77-TOT-IMP-1            TO WKS-R01-S502-IMPCAR-A1.     045200      
000654     MOVE W77-TOT-IMP-2            TO WKS-R01-S502-IMPCAR-A2.     045300      
000655     MOVE W77-TOT-IMP-3            TO WKS-R01-S502-IMPCAR-A3.     045400      
000656     MOVE W77-TOT-IMP-4            TO WKS-R01-S502-IMPCAR-A4.     045500      
000657     MOVE W77-TOT-IMP-5            TO WKS-R01-S502-IMPCAR-A5.     045600      
000658     MOVE W77-TOT-IMP-6            TO WKS-R01-S502-IMPCAR-A6.     045700      
000659     MOVE WKS-R01-S502-IMPCAR-NUM  TO A00-R01-S502-IMPCAR.        045800      
000660     MOVE WKS-SAL-P16NUAB(8)       TO WKS-TOT-NUM.                045900      
000661     MOVE WKS-TOT-NUM-1            TO WKS-R01-S502-NUMABO-A1.     046000      
000662     MOVE WKS-TOT-NUM-2            TO WKS-R01-S502-NUMABO-A2.     046100      
000663     MOVE WKS-R01-S502-NUMABO-NUM  TO A00-R01-S502-NUMABO.        046200      
000664     MOVE WKS-SAL-P16IMAB(8)       TO WKS-TOT-IMP.                046300      
000665     MOVE W77-TOT-IMP-1            TO WKS-R01-S502-IMPABO-A1.     046400      
000666     MOVE W77-TOT-IMP-2            TO WKS-R01-S502-IMPABO-A2.     046500      
000667     MOVE W77-TOT-IMP-3            TO WKS-R01-S502-IMPABO-A3.     046600      
000668     MOVE W77-TOT-IMP-4            TO WKS-R01-S502-IMPABO-A4.     046700      
000669     MOVE W77-TOT-IMP-5            TO WKS-R01-S502-IMPABO-A5.     046800      
000670     MOVE W77-TOT-IMP-6            TO WKS-R01-S502-IMPABO-A6.     046900      
000671     MOVE WKS-R01-S502-IMPABO-NUM  TO A00-R01-S502-IMPABO.        047000      
000672     MOVE 087                      TO A00-R01-S502-SIS.           047100      
000673     MOVE WKS-NUMCSI-HOST          TO A00-R01-S502-CCI.           047200      
000674     MOVE "NAL"                    TO A00-R01-S502-COB.           047300      
000675                                                                  047400      
000676     IF ((WKS-SAL-P16NUCA(8) > " " OR > 0 ) OR                    047500      
000677         (WKS-SAL-P16NUAB(8) > " " OR > 0 ) OR                    047600      
000678         (WKS-SAL-P16IMCA(8) > " " OR > 0 ) OR                    047700      
000679         (WKS-SAL-P16IMAB(8) > " " OR > 0 ))                      047800      
000680         MOVE 8                    TO W77-L030                    047900      
000681         PERFORM 030361-LLENA-CEROS.                              048000      
000682                                                                  048100      
000683     WRITE REG-TOTLIDE             FROM A00-R01-S502-REGDET.      048200      
000684     ADD 1                         TO   W77-TOT-REG.              048300      
000685     ADD A00-R01-S502-NUMCAR       TO   W77-TOT-NUM-CAR.          048400      
000686     ADD A00-R01-S502-IMPCAR       TO   W77-TOT-IMP-CAR.          048500      
000687     ADD A00-R01-S502-NUMABO       TO   W77-TOT-NUM-ABO.          048600      
000688     ADD A00-R01-S502-IMPABO       TO   W77-TOT-IMP-ABO.          048700      
000689                                                                  048800      
000690 030361-LLENA-CEROS.                                              048900      
000691*===================                                              049000      
000692                                                                  049100      
000693     IF WKS-SAL-P16NUCA(W77-L030) = ALL " "                       049200      
000694        INSPECT WKS-R01-S502-NUMCAR REPLACING ALL " " BY "0".     049300      
000695                                                                  049400      
000696     IF WKS-SAL-P16NUAB(W77-L030) = ALL " "                       049500      
000697        INSPECT WKS-R01-S502-NUMABO REPLACING ALL " " BY "0".     049600      
000698                                                                  049700      
000699     IF WKS-SAL-P16IMCA(W77-L030) = ALL " "                       049800      
000700        INSPECT WKS-R01-S502-IMPCAR REPLACING ALL " " BY "0".     049900      
000701                                                                  050000      
000702     IF WKS-SAL-P16IMAB(W77-L030) = ALL " "                       050100      
000703        INSPECT WKS-R01-S502-IMPABO REPLACING ALL " " BY "0".     050200      
000704                                                                  050300      
000705 030362-ARMA-L030-S087.                                           050400      
000706*======================                                           050500      
000707                                                                  050600      
000708     MOVE 087                      TO WKS-ENT-P16SIS.             050700      
000709     MOVE 16                       TO WKS-PAN-ENTNUMPAN.          050800      
000710     MOVE WKS-FECHA                TO WKS-ENT-P16FEC.             050900      
000711     MOVE 0                        TO WKS-ENT-P16SUC              051000      
000712                                      WKS-ENT-P16CAJ              051100      
000713                                      WKS-ENT-P16CSI.             051200      
000714     MOVE 2                        TO WKS-ENT-P16BCOORI           051300      
000715                                      WKS-ENT-P16BCODES.          051400      
000716                                                                  051500      
000717     PERFORM 030364-CALL-L030-S087.                               051600      
000718                                                                  051700      
000719 030364-CALL-L030-S087.                                           051800      
000720*======================                                           051900      
000721                                                                  052000      
000722     CALL "S151LIB030 IN LIBL030-S087" USING WKS-PANTALLAS-ENT,   052100      
000723                                       WKS-PANTALLAS-SAL,         052200      
000724                                       W77-RESULT-LIBCON.         052300      
000725                                                                  052400      
000726     IF W77-RESULT-LIBCON = 0 OR 3 OR 4                           052500      
000727        NEXT SENTENCE                                             052600      
000728     ELSE                                                         052700      
000729        MOVE 0 TO WKS-SAL-P16NUCA(8)  WKS-SAL-P16IMCA(8)          052800      
000730                  WKS-SAL-P16NUAB(8)  WKS-SAL-P16IMAB(8).         052900      
000731                                                                  053000      
000732 030360-ENVIA-S264.                                               053100      
000733*==================                                               053200      
000734                                                                  053300      
000735     MOVE LOW-VALUES               TO WKS-PANTALLAS-ENT           053400      
000736                                      A00-R01-S502-REGDET.        053500      
000737     MOVE 2                        TO A00-R01-S502-TIPREG.        053600      
000738     MOVE 1                        TO WKS-ENT-P16MON.             053700      
000739     PERFORM 030362-ARMA-L030-S264                                053800      
000740     MOVE WKS-SAL-P16CON (8)       TO A00-R01-S502-NOMRENG.       053900      
000741     MOVE WKS-SAL-P16NUCA(8)       TO WKS-TOT-NUM.                054000      
000742     MOVE WKS-TOT-NUM-1            TO WKS-R01-S502-NUMCAR-A1.     054100      
000743     MOVE WKS-TOT-NUM-2            TO WKS-R01-S502-NUMCAR-A2.     054200      
000744     MOVE WKS-R01-S502-NUMCAR-NUM  TO A00-R01-S502-NUMCAR.        054300      
000745     MOVE WKS-SAL-P16IMCA(8)       TO WKS-TOT-IMP.                054400      
000746     MOVE W77-TOT-IMP-1            TO WKS-R01-S502-IMPCAR-A1.     054500      
000747     MOVE W77-TOT-IMP-2            TO WKS-R01-S502-IMPCAR-A2.     054600      
000748     MOVE W77-TOT-IMP-3            TO WKS-R01-S502-IMPCAR-A3.     054700      
000749     MOVE W77-TOT-IMP-4            TO WKS-R01-S502-IMPCAR-A4.     054800      
000750     MOVE W77-TOT-IMP-5            TO WKS-R01-S502-IMPCAR-A5.     054900      
000751     MOVE W77-TOT-IMP-6            TO WKS-R01-S502-IMPCAR-A6.     055000      
000752     MOVE WKS-R01-S502-IMPCAR-NUM  TO A00-R01-S502-IMPCAR.        055100      
000753     MOVE WKS-SAL-P16NUAB(8)       TO WKS-TOT-NUM.                055200      
000754     MOVE WKS-TOT-NUM-1            TO WKS-R01-S502-NUMABO-A1.     055300      
000755     MOVE WKS-TOT-NUM-2            TO WKS-R01-S502-NUMABO-A2.     055400      
000756     MOVE WKS-R01-S502-NUMABO-NUM  TO A00-R01-S502-NUMABO.        055500      
000757     MOVE WKS-SAL-P16IMAB(8)       TO WKS-TOT-IMP.                055600      
000758     MOVE W77-TOT-IMP-1            TO WKS-R01-S502-IMPABO-A1.     055700      
000759     MOVE W77-TOT-IMP-2            TO WKS-R01-S502-IMPABO-A2.     055800      
000760     MOVE W77-TOT-IMP-3            TO WKS-R01-S502-IMPABO-A3.     055900      
000761     MOVE W77-TOT-IMP-4            TO WKS-R01-S502-IMPABO-A4.     056000      
000762     MOVE W77-TOT-IMP-5            TO WKS-R01-S502-IMPABO-A5.     056100      
000763     MOVE W77-TOT-IMP-6            TO WKS-R01-S502-IMPABO-A6.     056200      
000764     MOVE WKS-R01-S502-IMPABO-NUM  TO A00-R01-S502-IMPABO.        056300      
000765     MOVE 264                      TO A00-R01-S502-SIS.           056400      
000766     MOVE WKS-NUMCSI-HOST          TO A00-R01-S502-CCI.           056500      
000767                                                                  056600      
000768     IF WKS-NUMCSI-HOST = 10                                      056700      
000769        MOVE "VDM"                 TO A00-R01-S502-COB            056800      
000770     ELSE                                                         056900      
000771        MOVE "MTY"                 TO A00-R01-S502-COB.           057000      
000772                                                                  057100      
000773     IF ((WKS-SAL-P16NUCA(8) > " " OR > 0 ) OR                    057200      
000774         (WKS-SAL-P16NUAB(8) > " " OR > 0 ) OR                    057300      
000775         (WKS-SAL-P16IMCA(8) > " " OR > 0 ) OR                    057400      
000776         (WKS-SAL-P16IMAB(8) > " " OR > 0 ))                      057500      
000777         MOVE 8                    TO W77-L030                    057600      
000778         PERFORM 030361-LLENA-CEROS.                              057700      
000779                                                                  057800      
000780     WRITE REG-TOTLIDE             FROM A00-R01-S502-REGDET.      057900      
000781     ADD 1                         TO   W77-TOT-REG.              058000      
000782     ADD A00-R01-S502-NUMCAR       TO   W77-TOT-NUM-CAR.          058100      
000783     ADD A00-R01-S502-IMPCAR       TO   W77-TOT-IMP-CAR.          058200      
000784     ADD A00-R01-S502-NUMABO       TO   W77-TOT-NUM-ABO.          058300      
000785     ADD A00-R01-S502-IMPABO       TO   W77-TOT-IMP-ABO.          058400      
000786                                                                  058500      
000787 030362-ARMA-L030-S264.                                           058600      
000788*======================                                           058700      
000789                                                                  058800      
000790     MOVE 264                      TO WKS-ENT-P16SIS.             058900      
000791     MOVE 16                       TO WKS-PAN-ENTNUMPAN.          059000      
000792     MOVE WKS-FECHA                TO WKS-ENT-P16FEC.             059100      
000793     MOVE 0                        TO WKS-ENT-P16SUC              059200      
000794                                      WKS-ENT-P16CAJ              059300      
000795                                      WKS-ENT-P16CSI.             059400      
000796     MOVE 2                        TO WKS-ENT-P16BCOORI           059500      
000797                                      WKS-ENT-P16BCODES.          059600      
000798                                                                  059700      
000799     PERFORM 030364-CALL-L030-S264.                               059800      
000800                                                                  059900      
000801 030364-CALL-L030-S264.                                           060000      
000802*======================                                           060100      
000803                                                                  060200      
000804     CALL "S151LIB030 IN LIBL030-S264" USING WKS-PANTALLAS-ENT,   060300      
000805                                       WKS-PANTALLAS-SAL,         060400      
000806                                       W77-RESULT-LIBCON.         060500      
000807                                                                  060600      
000808     IF W77-RESULT-LIBCON = 0 OR 3 OR 4                           060700      
000809        NEXT SENTENCE                                             060800      
000810     ELSE                                                         060900      
000811        MOVE 0 TO WKS-SAL-P16NUCA(8)  WKS-SAL-P16IMCA(8)          061000      
000812                  WKS-SAL-P16NUAB(8)  WKS-SAL-P16IMAB(8).         061100      
000813                                                                  061200      
000814 030360-ENVIA-S500.                                               061300      
000815*==================                                               061400      
000816                                                                  061500      
000817     MOVE LOW-VALUES               TO WKS-PANTALLAS-ENT           061600      
000818                                      A00-R01-S502-REGDET.        061700      
000819     MOVE 2                        TO A00-R01-S502-TIPREG.        061800      
000820     MOVE 1                        TO WKS-ENT-P16MON.             061900      
000821     PERFORM 030362-ARMA-L030-S500                                062000      
000822     MOVE WKS-SAL-P16CON (8)       TO A00-R01-S502-NOMRENG.       062100      
000823     MOVE WKS-SAL-P16NUCA(8)       TO WKS-TOT-NUM.                062200      
000824     MOVE WKS-TOT-NUM-1            TO WKS-R01-S502-NUMCAR-A1.     062300      
000825     MOVE WKS-TOT-NUM-2            TO WKS-R01-S502-NUMCAR-A2.     062400      
000826     MOVE WKS-R01-S502-NUMCAR-NUM  TO A00-R01-S502-NUMCAR.        062500      
000827     MOVE WKS-SAL-P16IMCA(8)       TO WKS-TOT-IMP.                062600      
000828     MOVE W77-TOT-IMP-1            TO WKS-R01-S502-IMPCAR-A1.     062700      
000829     MOVE W77-TOT-IMP-2            TO WKS-R01-S502-IMPCAR-A2.     062800      
000830     MOVE W77-TOT-IMP-3            TO WKS-R01-S502-IMPCAR-A3.     062900      
000831     MOVE W77-TOT-IMP-4            TO WKS-R01-S502-IMPCAR-A4.     063000      
000832     MOVE W77-TOT-IMP-5            TO WKS-R01-S502-IMPCAR-A5.     063100      
000833     MOVE W77-TOT-IMP-6            TO WKS-R01-S502-IMPCAR-A6.     063200      
000834     MOVE WKS-R01-S502-IMPCAR-NUM  TO A00-R01-S502-IMPCAR.        063300      
000835     MOVE WKS-SAL-P16NUAB(8)       TO WKS-TOT-NUM.                063400      
000836     MOVE WKS-TOT-NUM-1            TO WKS-R01-S502-NUMABO-A1.     063500      
000837     MOVE WKS-TOT-NUM-2            TO WKS-R01-S502-NUMABO-A2.     063600      
000838     MOVE WKS-R01-S502-NUMABO-NUM  TO A00-R01-S502-NUMABO.        063700      
000839     MOVE WKS-SAL-P16IMAB(8)       TO WKS-TOT-IMP.                063800      
000840     MOVE W77-TOT-IMP-1            TO WKS-R01-S502-IMPABO-A1.     063900      
000841     MOVE W77-TOT-IMP-2            TO WKS-R01-S502-IMPABO-A2.     064000      
000842     MOVE W77-TOT-IMP-3            TO WKS-R01-S502-IMPABO-A3.     064100      
000843     MOVE W77-TOT-IMP-4            TO WKS-R01-S502-IMPABO-A4.     064200      
000844     MOVE W77-TOT-IMP-5            TO WKS-R01-S502-IMPABO-A5.     064300      
000845     MOVE W77-TOT-IMP-6            TO WKS-R01-S502-IMPABO-A6.     064400      
000846     MOVE WKS-R01-S502-IMPABO-NUM  TO A00-R01-S502-IMPABO.        064500      
000847     MOVE 500                      TO A00-R01-S502-SIS.           064600      
000848     MOVE WKS-NUMCSI-HOST          TO A00-R01-S502-CCI.           064700      
000849                                                                  064800      
000850     IF WKS-NUMCSI-HOST = 10                                      064900      
000851        MOVE "VDM"                 TO A00-R01-S502-COB            065000      
000852     ELSE                                                         065100      
000853        MOVE "MTY"                 TO A00-R01-S502-COB.           065200      
000854                                                                  065300      
000855     IF ((WKS-SAL-P16NUCA(8) > " " OR > 0 ) OR                    065400      
000856         (WKS-SAL-P16NUAB(8) > " " OR > 0 ) OR                    065500      
000857         (WKS-SAL-P16IMCA(8) > " " OR > 0 ) OR                    065600      
000858         (WKS-SAL-P16IMAB(8) > " " OR > 0 ))                      065700      
000859         MOVE 8                    TO W77-L030                    065800      
000860         PERFORM 030361-LLENA-CEROS.                              065900      
000861                                                                  066000      
000862     WRITE REG-TOTLIDE             FROM A00-R01-S502-REGDET.      066100      
000863     ADD 1                         TO   W77-TOT-REG.              066200      
000864     ADD A00-R01-S502-NUMCAR       TO   W77-TOT-NUM-CAR.          066300      
000865     ADD A00-R01-S502-IMPCAR       TO   W77-TOT-IMP-CAR.          066400      
000866     ADD A00-R01-S502-NUMABO       TO   W77-TOT-NUM-ABO.          066500      
000867     ADD A00-R01-S502-IMPABO       TO   W77-TOT-IMP-ABO.          066600      
000868                                                                  066700      
000869 030362-ARMA-L030-S500.                                           066800      
000870*======================                                           066900      
000871                                                                  067000      
000872     MOVE 500                      TO WKS-ENT-P16SIS.             067100      
000873     MOVE 16                       TO WKS-PAN-ENTNUMPAN.          067200      
000874     MOVE WKS-FECHA                TO WKS-ENT-P16FEC.             067300      
000875     MOVE 0                        TO WKS-ENT-P16SUC              067400      
000876                                      WKS-ENT-P16CAJ              067500      
000877                                      WKS-ENT-P16CSI.             067600      
000878     MOVE 2                        TO WKS-ENT-P16BCOORI           067700      
000879                                      WKS-ENT-P16BCODES.          067800      
000880                                                                  067900      
000881     PERFORM 030364-CALL-L030-S500.                               068000      
000882                                                                  068100      
000883 030364-CALL-L030-S500.                                           068200      
000884*======================                                           068300      
000885                                                                  068400      
000886     CALL "S151LIB030 IN LIBL030-S500" USING WKS-PANTALLAS-ENT,   068500      
000887                                       WKS-PANTALLAS-SAL,         068600      
000888                                       W77-RESULT-LIBCON.         068700      
000889                                                                  068800      
000890     IF W77-RESULT-LIBCON = 0 OR 3 OR 4                           068900      
000891        NEXT SENTENCE                                             069000      
000892     ELSE                                                         069100      
000893        MOVE 0 TO WKS-SAL-P16NUCA(8)  WKS-SAL-P16IMCA(8)          069200      
000894                  WKS-SAL-P16NUAB(8)  WKS-SAL-P16IMAB(8).         069300      
000895                                                                  069400      
000896 030370-GRABA-TRAILER.                                            069500      
000897*=====================                                            069600      
000898                                                                  069700      
000899     MOVE LOW-VALUES               TO A00-R02-S502-TRAILER.       069800      
000900                                                                  069900      
000901     MOVE 3                        TO A00-R02-S502-TIPREG.        070000      
000902     MOVE W77-TOT-REG              TO A00-R02-S502-TOTREG.        070100      
000903     MOVE W77-TOT-NUM-CAR          TO A00-R02-S502-TOTNUMCAR.     070200      
000904     MOVE W77-TOT-IMP-CAR          TO A00-R02-S502-TOTIMPCAR.     070300      
000905     MOVE W77-TOT-NUM-ABO          TO A00-R02-S502-TOTNUMABO.     070400      
000906     MOVE W77-TOT-IMP-ABO          TO A00-R02-S502-TOTIMPABO.     070500      
000907     WRITE REG-TOTLIDE             FROM A00-R02-S502-TRAILER.     070600      
000908     CLOSE ARCH-TOT-LIDE WITH SAVE.                               070700      
000909                                                                  070800      
000910 050100-ARMA-NOMBRES-ARCHS.                                       070900      
000911*==========================                                       071000      
000912                                                                  071100      
000913     CHANGE ATTRIBUTE TITLE OF A01-TOT-LIDE-VDM TO                071200      
000914                               WKS-S151-TOTLIDE-VDM.              071300      
000915                                                                  071400      
000916     CHANGE ATTRIBUTE TITLE OF A02-TOT-LIDE-MTY TO                071500      
000917                               WKS-S151-TOTLIDE-MTY.              071600      
000918                                                                  071700      
000919     CHANGE ATTRIBUTE TITLE OF A03-TOT-LIDE-UNI TO                071800      
000920                               WKS-S151-TOTLIDE-UNI.              071900      
000921                                                                  072000      
000922 060100-VALIDA-RESIDENCIA.                                        072100      
000923*=========================                                        072200      
000924                                                                  072300      
000925     IF ATTRIBUTE RESIDENT OF A02-TOT-LIDE-MTY = 1 AND            072400      
000926        W77-UNE-LIDE = 0                                          072500      
000927        PERFORM 060200-CONCENTRA-ARCH-LIDE                        072600      
000928        MOVE 1                    TO W77-UNE-LIDE                 072700      
000929     ELSE                                                         072800      
000930        IF W77-UNE-LIDE = 0                                       072900      
000931        STRING "NO SE ENCUENTRA RESIDENTE EL ARCHIVO "            073000      
000932               WKS-S151-TOTLIDE-MTY                               073100      
000933              " ESPERO 1 MIN. PARA VOLVER A VERIFICAR RESIDENCIA" 073200      
000934        DELIMITED BY SIZE                                         073300      
000935        INTO TEXTO-LJ                                             073400      
000936        MOVE "O"                    TO TIPO-LJ                    073500      
000937        MOVE 010401                 TO CODIGO-LJ                  073600      
000938        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      073700      
000939                                                                  073800      
000940     IF W77-UNE-LIDE = 0                                          073900      
000941        WAIT(60).                                                 074000      
000942                                                                  074100      
000943 060200-CONCENTRA-ARCH-LIDE.                                      074200      
000944*===========================                                      074300      
000945                                                                  074400      
000946     OPEN INPUT  A01-TOT-LIDE-VDM.                                074500      
000947     OPEN OUTPUT A03-TOT-LIDE-UNI.                                074600      
000948                                                                  074700      
000949     MOVE 0                        TO W77-FIN                     074800      
000950                                      W77-TOT-REG                 074900      
000951                                      W77-TOT-NUM-CAR             075000      
000952                                      W77-TOT-IMP-CAR             075100      
000953                                      W77-TOT-NUM-ABO             075200      
000954                                      W77-TOT-IMP-ABO.            075300      
000955                                                                  075400      
000956     PERFORM 060300-LEE-A01-TOTLIDE-VDM UNTIL W77-FIN = 1.        075500      
000957                                                                  075600      
000958     MOVE 0                        TO W77-FIN.                    075700      
000959                                                                  075800      
000960     OPEN INPUT A02-TOT-LIDE-MTY.                                 075900      
000961                                                                  076000      
000962     PERFORM 060400-PROCESO-LIDE UNTIL W77-FIN = 1.               076100      
000963                                                                  076200      
000964     CLOSE A01-TOT-LIDE-VDM.                                      076300      
000965     CLOSE A02-TOT-LIDE-MTY.                                      076400      
000966     CLOSE A03-TOT-LIDE-UNI WITH SAVE.                            076500      
000967                                                                  076600      
000968 060300-LEE-A01-TOTLIDE-VDM.                                      076700      
000969*===========================                                      076800      
000970                                                                  076900      
000971     READ A01-TOT-LIDE-VDM INTO A00-R01-S502-REGDET AT END        077000      
000972          MOVE 1                   TO W77-FIN.                    077100      
000973                                                                  077200      
000974     IF A00-R02-S502-TIPREG = 3                                   077300      
000975        MOVE 1                     TO W77-FIN                     077400      
000976     ELSE                                                         077500      
000977     IF W77-FIN = 0                                               077600      
000978        IF A00-R00-S502-TIPREG = 1                                077700      
000979           ACCEPT  WKS-HR-MAQUINA  FROM TIME                      077800      
000980           MOVE    WKS-HH-MAQUINA  TO   A00-R00-S502-HORAPRO-HH   077900      
000981           MOVE    WKS-MM-MAQUINA  TO   A00-R00-S502-HORAPRO-MM   078000      
000982           MOVE    WKS-SS-MAQUINA  TO   A00-R00-S502-HORAPRO-SS   078100      
000983           WRITE REG-TOTLIDE-UNI   FROM A00-R00-S502-HDR          078200      
000984        ELSE                                                      078300      
000985           WRITE REG-TOTLIDE-UNI   FROM A00-R01-S502-REGDET       078400      
000986           ADD A00-R01-S502-NUMCAR TO   W77-TOT-NUM-CAR           078500      
000987           ADD A00-R01-S502-IMPCAR TO   W77-TOT-IMP-CAR           078600      
000988           ADD A00-R01-S502-NUMABO TO   W77-TOT-NUM-ABO           078700      
000989           ADD A00-R01-S502-IMPABO TO   W77-TOT-IMP-ABO           078800      
000990           ADD 1                   TO   W77-TOT-REG.              078900      
000991                                                                  079000      
000992 060400-PROCESO-LIDE.                                             079100      
000993*====================                                             079200      
000994                                                                  079300      
000995    READ A02-TOT-LIDE-MTY INTO A00-R01-S502-REGDET AT END         079400      
000996         MOVE 1                    TO W77-FIN.                    079500      
000997                                                                  079600      
000998    IF W77-FIN = 0                                                079700      
000999       IF A00-R00-S502-TIPREG = 1                                 079800      
001000          NEXT SENTENCE                                           079900      
001001       ELSE                                                       080000      
001002       IF A00-R01-S502-TIPREG = 2                                 080100      
001003          PERFORM 060500-DETALLE-MTY-UNI                          080200      
001004       ELSE                                                       080300      
001005          IF A00-R02-S502-TIPREG = 3                              080400      
001006             PERFORM 060600-TRAILER-UNI.                          080500      
001007                                                                  080600      
001008 060500-DETALLE-MTY-UNI.                                          080700      
001009*=======================                                          080800      
001010                                                                  080900      
001011     ADD A00-R01-S502-NUMCAR TO   W77-TOT-NUM-CAR                 081000      
001012     ADD A00-R01-S502-IMPCAR TO   W77-TOT-IMP-CAR                 081100      
001013     ADD A00-R01-S502-NUMABO TO   W77-TOT-NUM-ABO                 081200      
001014     ADD A00-R01-S502-IMPABO TO   W77-TOT-IMP-ABO                 081300      
001015     ADD 1                   TO   W77-TOT-REG.                    081400      
001016                                                                  081500      
001017     WRITE REG-TOTLIDE-UNI   FROM A00-R01-S502-REGDET.            081600      
001018                                                                  081700      
001019 060600-TRAILER-UNI.                                              081800      
001020*===================                                              081900      
001021                                                                  082000      
001022     MOVE LOW-VALUES               TO   A00-R02-S502-TRAILER.     082100      
001023                                                                  082200      
001024     MOVE 3                        TO   A00-R02-S502-TIPREG.      082300      
001025     MOVE W77-TOT-REG              TO   A00-R02-S502-TOTREG.      082400      
001026     MOVE W77-TOT-NUM-CAR          TO   A00-R02-S502-TOTNUMCAR.   082500      
001027     MOVE W77-TOT-IMP-CAR          TO   A00-R02-S502-TOTIMPCAR.   082600      
001028     MOVE W77-TOT-NUM-ABO          TO   A00-R02-S502-TOTNUMABO.   082700      
001029     MOVE W77-TOT-IMP-ABO          TO   A00-R02-S502-TOTIMPABO.   082800      
001030     WRITE REG-TOTLIDE-UNI         FROM A00-R02-S502-TRAILER.     082900      
001031                                                                  083000      
001032 070100-DETERMINA-NODOS.                                          083100      
001033*=======================                                          083200      
001034                                                                  083300      
001035     IF WKS-NOMEQUIPO = "ACYPGAMA."                               083400      
001036        MOVE "ACYPGAMA"            TO WKS-NODO-ORI                083500      
001037        MOVE "MONALFA"             TO WKS-NODO-DES                083600      
001038     ELSE                                                         083700      
001039     IF WKS-NOMEQUIPO = "MONALFA."                                083800      
001040        MOVE "MONALFA"             TO WKS-NODO-ORI                083900      
001041        MOVE "ACYPGAMA"            TO WKS-NODO-DES                084000      
001042     ELSE                                                         084100      
001043     IF WKS-NOMEQUIPO = "VDMALFA."                                084200      
001044        MOVE "VDMALFA"             TO WKS-NODO-ORI                084300      
001045        MOVE "MONBETA"             TO WKS-NODO-DES                084400      
001046     ELSE                                                         084500      
001047     IF WKS-NOMEQUIPO = "MONBETA."                                084600      
001048        MOVE "MONBETA"             TO WKS-NODO-ORI                084700      
001049        MOVE "VDMALFA"             TO WKS-NODO-DES                084800      
001050     ELSE                                                         084900      
001051     IF WKS-NOMEQUIPO = "ACYPBETA."                               085000      
001052        MOVE "ACYPBETA"            TO WKS-NODO-ORI                085100      
001053        MOVE "VDMBETA"             TO WKS-NODO-DES                085200      
001054     ELSE                                                         085300      
001055     IF WKS-NOMEQUIPO = "VDMBETA."                                085400      
001056        MOVE "VDMBETA"             TO WKS-NODO-ORI                085500      
001057        MOVE "ACYPBETA"            TO WKS-NODO-DES.               085600      
001058                                                                  085700      
001059 080100-ENVIA-ARCHIVO.                                            085800      
001060*=====================                                            085900      
001061                                                                  086000      
001062     MOVE WKS-TITULO-ARCH-CAP      TO   WS-TRF-COMANDO.           086100      
001063     MOVE 127                      TO   WS-TRF-TAMACOM.           086200      
001064     CALL "ENVIA_XFER IN XFER" USING  WS-TRF-COMANDO              086300      
001065                                      WS-TRF-TAMACOM              086400      
001066                               GIVING WS-TRF-RESULT.              086500      
001067                                                                  086600      
001068     IF WS-TRF-RESULT > 0                                         086700      
001069        MOVE "O"                   TO TIPO-LJ                     086800      
001070        MOVE 020101                TO CODIGO-LJ                   086900      
001071        STRING "ERROR AL LLAMAR LIBRARY XRAPID PARA ARCHIVO ",    087000      
001072               WKS-NOMB-ARCH                                 ,    087100      
001073               " FAVOR DE COPIAR MANUALMENTE EL ARCHIVO "    ,    087200      
001074               WKS-TITULO-ARCH-CAP DELIMITED BY SIZE INTO TEXTO-LJ087300      
001075        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                   087400      
001076                                    MENSAJE-LJ.                   087500      
001077                                                                  087600      
