000001*INICIA CODIGO DE RENOVACION CRONOS 2000                          000200      
000002$SET XREF                                                         000300      
000003$SET LISTOMITTED                                                  000400      
000004$SET OLDCODE                                                      000500      
000005*$SET TADS                                                        000550      
000006*TERMINA CODIGO DE RENOVACION CRONOS 2000                         000600      
000007 IDENTIFICATION DIVISION.                                         000700      
000008 ENVIRONMENT DIVISION.                                            000800      
000009 INPUT-OUTPUT SECTION.                                            000900      
000010 FILE-CONTROL.                                                    001000      
000011      SELECT LOG151         ASSIGN TO DISK.                       001100      
000012      SELECT MOVS151        ASSIGN TO DISK.                       001200      
000013      SELECT L02-DATOS      ASSIGN TO DISK                        001300      
000014                            ACCESS MODE IS RANDOM                 001400      
000015                            ACTUAL KEY IS W77-NUM-REG.            001500      
000016      SELECT SMOVS151       ASSIGN TO SORT DISK.                  001600      
000017      SELECT SALDOS151      ASSIGN TO DISK.                       001700      
000018      SELECT SALDOS015      ASSIGN TO DISK.                       001800      
000019      SELECT SSALDOS        ASSIGN TO SORT DISK.                  001900      
000020      SELECT SDOSYMOVS015   ASSIGN TO DISK.                       002000      
000021      SELECT V00-REPORTE2   ASSIGN TO PRINTER.                    002100      
000022                                                                  002200      
000023 DATA DIVISION.                                                   002300      
000024 FILE SECTION.                                                    002400      
000025 FD LOG151                                                        002500      
000026    VALUE OF BUFFERS IS 1                                         002600      
000027    VALUE OF TITLE   IS WKS-TIT-LOG151                            002700      
000028    BLOCK CONTAINS 144 RECORDS.                                   002800      
000029                                                                  002900      
000030 01 REG-LOG151                            PIC X(450).             003000      
000031*                                                                 003100      
000032 FD L02-DATOS                                                     003200      
000033    VALUE OF BUFFERS IS 1                                         003300      
000034    BLOCK CONTAINS 120 RECORDS                                    003400      
000035    VALUE OF TITLE   IS WKS-TIT-LOG151-COMP.                      003500      
000036 01  L02-DAT.                                                     003600      
000037     03 L02-DAT-DATOS                      PIC X(540).            003700      
000038*                                                                 003900      
000039 FD MOVS151                                                       004000      
000040    VALUE OF AREAS 1000                                           004100      
000041    VALUE OF AREASIZE IS 6000                                     004200      
000042    BLOCK CONTAINS 144 RECORDS.                                   004300      
000043                                                                  004400      
000044 01 REG-MOVS151                           PIC X(450).             004500      
000045                                                                  004600      
000046 FD V00-REPORTE2                                                  004700      
000047    VALUE OF TITLE IS WKS-TIT-REPORTE2.                           004800      
000048                                                                  004900      
000049 01 V00-R00-REPORTE2                      PIC X(132).             005000      
000050*                                                                 005100      
000051 SD   SMOVS151.                                                   005200      
000052 01   REG-ARCH-ORD.                                               005300      
000053      03 FILLER                           PIC X(162).             005400      
000054      03 KEY-SUCPROM                      PIC 9(04) COMP.         005500      
000055      03 KEY-CONTRATO                     PIC 9(16) COMP.         005600      
000056      03 FILLER                           PIC X(278).             005700      
000057                                                                  005800      
000058 FD SALDOS151                                                     005900      
000059*   VALUE OF DEPENDENTSPECS IS TRUE                               006000      
000060*INICIO CJMG TESOFE 2019                                          006050      
000061*    BLOCK CONTAINS 300 RECORDS                                   006100      
000062    BLOCK CONTAINS 168 RECORDS                                    006120      
000063    VALUE OF TITLE IS WKS-TIT-SALDOS.                             006200      
000064*01 REG-SALDOS                           PIC X(186).              006300      
000065*INICIA CODIGO DE RENOVACION CRONOS 2000                          006400      
000066* 01 REG-SALDOS                           PIC X(216).             006500      
000067*TERMINA CODIGO DE RENOVACION CRONOS 2000                         006600      
000068 01 REG-SALDOS                           PIC X(390).              006620      
000069*FIN CJMG TESOFE 2019                                             006640      
000070                                                                  006700      
000071 FD SALDOS015                                                     006800      
000072    BLOCK CONTAINS 300 RECORDS.                                   006900      
000073 01 REG-SALDOS015                         PIC X(180).             007000      
000074                                                                  007100      
000075 SD SSALDOS.                                                      007200      
000076                                                                  007300      
000077 01 REG-SSALDOS.                                                  007400      
000078    02 FILLER                             PIC X(03).              007500      
000079    02 KEY-SALDOS-SUCPROM                 PIC 9(04) COMP.         007600      
000080    02 KEY-SALDOS-CTA                     PIC 9(16) COMP.         007700      
000081    02 FILLER                             PIC X(167).             007800      
000082                                                                  007900      
000083* IBM <INICIO> JGVD - CAMPOS NUEVOS, NOMBRE ORD, BANCO EMISOR     007990      
000084 FD SDOSYMOVS015                                                  008000      
000085    BLOCK CONTAINS 400 RECORDS                                    008100      
000086    VALUE OF TITLE IS WKS-TIT-SDOSYMOVS015                        008200      
000087             AREAS IS 1000                                        008300      
000088             AREASIZE IS 6000                                     008400      
000089             SECURITYTYPE IS PUBLIC.                              008500      
000090 01 REG-SDOSYMOVS015              PIC X(146).                     008600      
000091* IBM <INICIO> JGVD - CAMPOS NUEVOS, NOMBRE ORD, BANCO EMISOR     008610      
000092                                                                  008700      
000093/                                                                 008800      
000094 WORKING-STORAGE SECTION.                                         008900      
000095*INICIA CODIGO DE RENOVACION CRONOS 2000                          009000      
000096*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000097*  COPY "S151/CRONOS2K/CPY/WS".                                   009100      
000098******************************************************************000100      
000099** This copyBook defines all the additional variables that      **000200      
000100** Unisys has defined for the CRONOS2K project                  **000300      
000101** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000102******************************************************************000500      
000103                                                                  000600      
000104******************************************************************000700      
000105** These Variables are used to Accept the system date in long   **000800      
000106** format and get the century information                       **000900      
000107** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000108 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000109 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000110    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000111    05 FILLER      PIC X(1).                                      001400      
000112    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000113    05 FILLER      PIC X(1).                                      001600      
000114    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000115    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000116      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000117      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000118******************************************************************002100      
000119                                                                  002200      
000120******************************************************************002300      
000121** This variable defines a date in the format MMDDCCAA          **002400      
000122**                                                              **002500      
000123 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000124 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000125    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000126    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000127    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000128    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000129      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000130      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000131******************************************************************003400      
000132                                                                  003500      
000133******************************************************************003600      
000134** This variable defines a date in the format CCAAMMDD          **003700      
000135**                                                              **003800      
000136 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000137 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000138    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000139    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000140      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000141      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000142    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000143    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000144******************************************************************004700      
000145                                                                  004800      
000146******************************************************************004900      
000147** This variable defines a date in the format DDMMCCAA          **005000      
000148**                                                              **005100      
000149 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000150 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000151    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000152    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000153    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000154    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000155      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000156      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000157******************************************************************006000      
000158                                                                  006100      
000159******************************************************************006200      
000160** This variable defines a date in the Julian Format CCAADDD    **006300      
000161**                                                              **006400      
000162 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000163 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000164    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000165    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000166                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000167      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000168      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000169    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000170******************************************************************007300      
000171                                                                  007400      
000172******************************************************************007500      
000173** This variable defines a date in the format AAMMDD            **007600      
000174**                                                              **007700      
000175 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000176 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000177    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000178    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000179    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000180******************************************************************008300      
000181                                                                  008400      
000182******************************************************************008500      
000183** This variable defines a date in the format MMDDAA            **008600      
000184**                                                              **008700      
000185 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000186 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000187    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000188    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000189    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000190******************************************************************009300      
000191                                                                  009400      
000192******************************************************************009500      
000193** This variable defines a date in the format DDMMAA            **009600      
000194**                                                              **009700      
000195 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000196 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000197    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000198    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000199    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000200******************************************************************010300      
000201                                                                  010400      
000202******************************************************************010500      
000203** These variables are defined to be used for CALL bridge logic **010600      
000204**                                                              **010700      
000205 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000206 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000207 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000208 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000209 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000210 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000211******************************************************************011400      
000212                                                                  011500      
000213******************************************************************011600      
000214** This variable is used for converting only a year field AA to **011700      
000215** CCAA and a CCAA to AA                                        **011800      
000216 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000217 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000218    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000219    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000220 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000221 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000222******************************************************************012300      
000223                                                                  012400      
000224******************************************************************012500      
000225** These variables are Bridge Variables for Intercambio files   **012600      
000226** para EDOCTA                                                  **012700      
000227 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000228 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000229 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000230 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000231 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000232 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000233 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000234******************************************************************013500      
000235* Para MODULO                                                     013600      
000236 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000237******************************************************************013800      
000238******************************************************************013900      
000239** Para FMOVSCHABO                                                014000      
000240 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000241******************************************************************014200      
000242                                                                  014300      
000243******************************************************************014400      
000244***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000245******************************************************************014600      
000246                                                                  014700      
000247 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000248 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000249     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000250     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000251     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000252******************************************************************015300      
000253                                                                  015400      
000254******************************************************************015500      
000255***  These Variables Are Defined For Date In AAMM Format       ***015600      
000256******************************************************************015700      
000257                                                                  015800      
000258 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000259 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000260     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000261     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000262******************************************************************016300      
000263                                                                  016400      
000264                                                                  016500      
000265*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000266  01  A2K-BASE-YEAR     PIC 9(02) VALUE 50.                       009200      
000267*TERMINA CODIGO DE RENOVACION CRONOS 2000                         009300      
000268                                                                  009400      
000269*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000270* COPY "(S151)S151/FORMATO/DISPLAY.".                             009500      
000271                                                                  000100      
000272*===============================================================* 000200      
000273*         FORMATO PARA DISPLAYS                                 * 000300      
000274*===============================================================* 000400      
000275                                                                  000500      
000276 01 WKS-TIT-REPORTE2.                                             000600      
000277    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000278    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000279    02 FILLER                       PIC X(06) VALUE               000900      
000280                                              "/LIST/".           001000      
000281    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000282    02 FILLER                       PIC X(01) VALUE "/".          001071      
000283    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000284    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000285    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000286    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000287    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000288    02 FILLER                       PIC X(11) VALUE               001600      
000289                                              "/001MSGIMP.".      001700      
000290                                                                  002100      
000291 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000292                                                                  002300      
000293***********************************************************       002400      
000294*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000295***********************************************************       002600      
000296 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000297*8D                                                               002800      
000298 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000299 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000300    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000301    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000302    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000303*8D                                                               003400      
000304 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000305 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000306    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000307    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000308    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000309                                                                  004100      
000310 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000311                                                                  004300      
000312 01 WKS-FECHA-HORA2.                                              004400      
000313    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000314    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000315       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000316       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000317    02 WKS-TIME-MAQ2.                                             004600      
000318       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
000319       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
000320          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
000321          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
000322          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
000323       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
000324    02 FILLER                             PIC X(01).              004900      
000325    02 WKS-RESTO2                         PIC X(04).              005000      
000326                                                                  005100      
000327*8D                                                               005200      
000328****************** REPORTE DE MENSAJES *********************      005300      
000329 01 WLI-ENCAB-12.                                                 005400      
000330    03 FILLER                             PIC X(05) VALUE         005500      
000331       "S151-".                                                   005600      
000332    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000333    03 FILLER                             PIC X(15) VALUE         005671      
000334       "-001IMPMENSAJES".                                         005691      
000335    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000336    03 FILLER                             PIC X(34) VALUE         005800      
000337       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000338    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000339    03 FILLER                             PIC X(26) VALUE         006100      
000340       "FECHA DE LA INFORMACION : ".                              006200      
000341    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000342    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000343       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000344       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000345       05  WKS-SLASH1                         PIC X(01).          006356      
000346       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000347       05  WKS-SLASH2                         PIC X(01).          006358      
000348       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000349 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000350 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000351    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000352    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000353    03 FILLER                          PIC X(01).                 006371      
000354    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000355    03 FILLER                          PIC X(01).                 006381      
000356    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000357*8D                                                               006400      
000358 01 WLI-ENCAB-22.                                                 006500      
000359     03 FILLER                          PIC X(11) VALUE           006600      
000360        "F.PROCESO: ".                                            006700      
000361     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000362     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000363     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
000364     03 FILLER                          PIC X(01) VALUE ":".      007020      
000365     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
000366     03 FILLER                          PIC X(01) VALUE ":".      007060      
000367     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
000368     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000369     03 FILLER                          PIC X(24) VALUE           007200      
000370              "IMPRESION MENSAJES DEL S".                         007300      
000371     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000372     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000373     03 FILLER                          PIC X(14) VALUE           007600      
000374        "TIPO PROCESO: ".                                         007700      
000375     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000376*8D                                                               007900      
000377 01 WLI-ENCAB-32.                                                 008000      
000378     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000379*       "VERSION  : ".                                            008200      
000380*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000381     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000382     03 FILLER                     PIC X(07) VALUE                008500      
000383        "HOJA : ".                                                008600      
000384     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000385                                                                  008800      
000386 01 WLI-ENCAB-42.                                                 008900      
000387     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000388     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000389     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000390                                                                  009300      
000391 01 WLI-ENCAB-52.                                                 009400      
000392    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000393    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000394    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000395    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000396                                                                  009900      
000397*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
000398 01 WLI-ENCAB-62.                                                 009910      
000399    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
000400    03 WLI-RESULT                 PIC X(04).                      009920      
000401    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
000402    03 WLI-TEXTO                  PIC X(110).                     009930      
000403                                                                  009935      
000404 01 WLI-TOT-ENVIO.                                                009940      
000405    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
000406    03 FILLER                     PIC X(37) VALUE                 009950      
000407       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
000408    03 WLI-ENV-CTD                PIC X(04).                      009960      
000409*FIN - INFOWARE                                                   009970      
000410****************************************************************  010000      
000411*                 CONTADORES DE HOJAS                          *  010100      
000412****************************************************************  010200      
000413                                                                  010300      
000414  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000415*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000416                                                                  009600      
000417******************************************************************009700      
000418*            NOMBRE EXTERNO DEL ARCHIVO LOG DEL S151             *009800      
000419******************************************************************009900      
000420 01  WKS-TIT-LOG151.                                              010000      
000421     02  FILLER                        PIC X(10) VA "(S151)S151". 010100      
000422     02  FILLER                        PIC X(10) VA "/FILE/MOVS". 010200      
000423     02  WKS-TIT-SISTEMA               PIC 9(03) VALUE 0.         010300      
000424     02  FILLER                        PIC X(01) VALUE "/".       010400      
000425     02  WKS-FEC-LOG                   PIC 9(06) VALUE 0.         010500      
000426     02  FILLER                        PIC X(04) VALUE " ON ".    010600      
000427     02  WKS-PACK-LOG                  PIC X(12).                 010700      
000428     02  FILLER                        PIC X(01) VALUE ".".       010800      
000429                                                                  010900      
000430******************************************************************011000      
000431****    NOMBRE EXTERNO DEL ARCHIVO DE SALDOS                 *****011100      
000432******************************************************************011200      
000433 01  WKS-TIT-SALDOS.                                              011300      
000434     03  FILLER                        PIC X(20) VALUE            011400      
000435                                       "(S151)S151/FILE/SDOS".    011500      
000436     03  WKS-TIT-SIST-SALDOS           PIC 9(03) VALUE 0.         011600      
000437     03  FILLER                        PIC X(01) VALUE "/".       011700      
000438     03  WKS-FEC-SALDOS                PIC 9(06) VALUE 0.         011800      
000439     03  FILLER                        PIC X(04) VALUE  " ON ".   011900      
000440     03  WKS-PACK-SALDOS               PIC X(12).                 012000      
000441     03  FILLER                        PIC X(01) VALUE ".".       012100      
000442******************************************************************012200      
000443****    NOMBRE EXTERNO DEL ARCHIVO COMPLEMENTARIO DEL LOG    *****012300      
000444******************************************************************012400      
000445 01  WKS-TIT-LOG151-COMP.                                         012500      
000446     03  FILLER                        PIC X(20) VALUE            012600      
000447                                       "(S151)S151/FILE/DESS".    012700      
000448     03  WKS-TIT-SIST-DES              PIC 9(03) VALUE 0.         012800      
000449     03  FILLER                        PIC X(01) VALUE "/".       012900      
000450     03  WKS-FEC-DES                   PIC 9(06) VALUE 0.         013000      
000451     03  FILLER                        PIC X(04) VALUE  " ON ".   013100      
000452     03  WKS-PACK-DES                  PIC X(12).                 013200      
000453     03  FILLER                        PIC X(01) VALUE ".".       013300      
000454*************************************************************     013400      
000455******     NOMBRE EXTERNO DE ARCHIVO SDOSYMOVS015   *********     013500      
000456*************************************************************     013600      
000457 01  WKS-TIT-SDOSYMOVS015.                                        013700      
000458     02  FILLER                        PIC X(21) VALUE            013800      
000459                                      "(S015)S151/FILE/S015/".    013900      
000460     02  WKS-NODO-ORIGEN-S015          PIC 9(02).                 014000      
000461     02  FILLER                        PIC X     VALUE "/".       014100      
000462     02  WKS-NODO-DESTINO-S015         PIC 9(02).                 014200      
000463     02  WKS-NOMB-DESCRIPTIVO          PIC X(09) VALUE            014300      
000464                                       "/MCHEQUES".               014400      
000465     02  WKS-NOMBRE-FILE-S015          PIC X(05).                 014500      
000466     02  WKS-FEC-S015                  PIC 9(06) VALUE 0.         014600      
000467     02  FILLER                        PIC X(12) VALUE            014700      
000468                                       " ON S015BCA.".            014800      
000469                                                                  014900      
000470***************************************************************** 015000      
000471**             VARIABLES PARA USO DEL CALENDAR                 ** 015100      
000472***************************************************************** 015200      
000473*                                                                 015300      
000474 77  WS-FUNCION                        PIC S9(11) BINARY.         015400      
000475 77  WS-FORMATO                        PIC S9(11) BINARY.         015500      
000476                                                                  015600      
000477*  01  WS-FECHA1                         PIC X(06).               015700      
000478*INICIA CODIGO DE RENOVACION CRONOS 2000                          015800      
000479 01 WS-FECHA1                          PIC X(08).                 015900      
000480*TERMINA CODIGO DE RENOVACION CRONOS 2000                         016000      
000481 01  WS-FECHA1-RED                      REDEFINES WS-FECHA1.      016100      
000482*    02  WS-AMO1-RED                   PIC 9(02).                 016200      
000483*INICIA CODIGO DE RENOVACION CRONOS 2000                          016300      
000484     02  WS-AMO1-RED                   PIC 9(04).                 016400      
000485*TERMINA CODIGO DE RENOVACION CRONOS 2000                         016500      
000486     02  WS-MES1-RED                   PIC 9(02).                 016600      
000487     02  WS-DIA1-RED                   PIC 9(02).                 016700      
000488                                                                  016800      
000489*  01  WS-FECHA2                         PIC X(06).               016900      
000490*INICIA CODIGO DE RENOVACION CRONOS 2000                          017000      
000491 01 WS-FECHA2                          PIC X(08).                 017100      
000492*TERMINA CODIGO DE RENOVACION CRONOS 2000                         017200      
000493 01  WS-FECHA2-RED                     REDEFINES WS-FECHA2.       017300      
000494*    02  WS-AMO2-RED                   PIC 9(02).                 017400      
000495*INICIA CODIGO DE RENOVACION CRONOS 2000                          017500      
000496     02  WS-AMO2-RED                   PIC 9(04).                 017600      
000497*TERMINA CODIGO DE RENOVACION CRONOS 2000                         017700      
000498     02  WS-MES2-RED                   PIC 9(02).                 017800      
000499     02  WS-DIA2-RED                   PIC 9(02).                 017900      
000500                                                                  018000      
000501                                                                  018100      
000502***************************************************************** 018200      
000503**           PARAMETROS PARA LIBRERIA CLTVERS                  ** 018300      
000504***************************************************************** 018400      
000505*                                                                 018500      
000506 01  WKS-CTLVER-NUMREG                 PIC 9(02).                 018600      
000507 01  WKS-CTLVERS-LIBRERIA              PIC X(12).                 018700      
000508 01  WKS-CTLVERS-TITULO                PIC X(72).                 018800      
000509 77  WKS-CTLVERS-STATUS                PIC S9(11) BINARY.         018900      
000510                                                                  019000      
000511******************************************************************019100      
000512*           CATALOGOS PARAMETRICOS  S080                         *019200      
000513******************************************************************019300      
000514 77 S080-CP-SISTEMA                       PIC S9(11) BINARY.      019400      
000515 77 S080-CP-PROGRAMA                      PIC S9(11) BINARY.      019500      
000516 77 S080-CP-RESULT                        PIC S9(11) BINARY.      019600      
000517 01 S080-CP-PARAMETRO-ENT.                                        019700      
000518    02 S080-CPPE-CATALOGO                 PIC 9(06) COMP.         019800      
000519    02 S080-CPPE-CLAVE                    PIC 9(02) COMP.         019900      
000520    02 S080-CPPE-ORDEN-BUSQ               PIC 9(02) COMP.         020000      
000521    02 S080-CPPE-REGISTROS                PIC 9(02) COMP.         020100      
000522    02 S080-CPPE-LLAVE1                   PIC 9(12).              020200      
000523    02 S080-CPPE-LLAVE2                   PIC 9(12).              020300      
000524    02 S080-CPPE-LLAVE3                   PIC X(12).              020400      
000525    02 S080-CPPE-LLAVE4                   PIC X(12).              020500      
000526    02 S080-CPPE-LLAVE5                   PIC X(12).              020600      
000527    02 S080-CPPE-LLAVE6                   PIC X(12).              020700      
000528    02 S080-CPPE-FECHA-VIG                PIC 9(06) COMP.         020800      
000529    02 S080-CPPE-FECHA-CONS               PIC 9(06) COMP.         020900      
000530    02 S080-CPPE-NIVEL-INI                PIC 9(02) COMP.         021000      
000531    02 FILLER                             PIC X(11).              021100      
000532                                                                  021200      
000533 01 S080-CP-PARAMETRO-SAL.                                        021300      
000534    02 S080-CPPS-NUM-REGISTRO             PIC 9(02) COMP.         021400      
000535    02 S080-CPPS-NUM-CATALOGO             PIC 9(06) COMP.         021500      
000536    02 S080-CPPS-FECHA-CONS               PIC 9(06) COMP.         021600      
000537    02 S080-CPPS-NIVEL-INI                PIC 9(02) COMP.         021700      
000538    02 FILLER                             PIC X(22).              021800      
000539    02 S080-CPPS-REGISTROS.                                       021900      
000540       04 S080-CPPS-DATOS OCCURS 28 TIMES PIC 9(12).              022000      
000541       04 S080-CPPS-FECHA-ALTA            PIC 9(06) COMP.         022100      
000542       04 S080-CPPS-FECHA-BAJA            PIC 9(06) COMP.         022200      
000543       04 S080-CPPS-FECHA-ULTMOD          PIC 9(06) COMP.         022300      
000544       04 S080-CPPS-FECHA-VIG             PIC 9(06) COMP.         022400      
000545       04 FILLER                          PIC X(500).             022500      
000546******************************************************************022502      
000547*    VARIABLES PARA EL USO DE LA LIBRERIA  S080   AGF            *022504      
000548******************************************************************022506      
000549  01 WS-CTR-RESULT                   PIC S9(11) BINARY.           022508      
000550  01 WS-CTR-TITULO                   PIC X(72).                   022510      
000551  01 WS-CTR-LIBRERIA                 PIC X(12).                   022512      
000552  77 WKS-TXC-SISTEMA                 PIC S9(11) BINARY.           022514      
000553  77 WKS-TXC-PROG                    PIC S9(11) BINARY.           022516      
000554  77 WKS-TXC-RESULT                  PIC S9(11) BINARY.           022518      
000555  01 S080-PARAMETRO-ENT.                                          022520      
000556    03 S080-ETXC-CATALOGO            PIC 9(06) COMP.              022522      
000557    03 S080-ETXC-CLAVE               PIC 9(02) COMP.              022524      
000558    03 S080-ETXC-ORDEN-BUSQUEDA      PIC 9(02) COMP.              022526      
000559    03 S080-ETXC-REGISTROS           PIC 9(02) COMP.              022528      
000560    03 S080-ETXC-LLAVE1              PIC X(12).                   022530      
000561    03 S080-ETXC-LLAVE2              PIC 9(12).                   022532      
000562    03 S080-ETXC-LLAVE3              PIC 9(12).                   022534      
000563    03 S080-ETXC-LLAVE4              PIC 9(12).                   022536      
000564    03 S080-ETXC-LLAVE5              PIC X(12).                   022538      
000565    03 S080-ETXC-LLAVE6              PIC 9(12).                   022540      
000566    03 S080-ETXC-FEC-VIG             PIC 9(06) COMP.              022542      
000567    03 S080-ETXC-FEC-INI-CONS        PIC 9(06) COMP.              022544      
000568    03 S080-ETXC-NIVEL-INI           PIC 9(02) COMP.              022546      
000569    03 FILLER                        PIC X(11).                   022548      
000570                                                                  022550      
000571  01 S080-PARAMETRO-SAL.                                          022552      
000572    03 S080-STXC-NUM-REG             PIC 9(02) COMP.              022554      
000573    03 S080-STXC-CATALOGO            PIC 9(06) COMP.              022556      
000574    03 S080-STXC-FEC-INI-CONS        PIC 9(06) COMP.              022558      
000575    03 S080-STXC-NIVEL-INI           PIC 9(02) COMP.              022560      
000576    03 FILLER                        PIC X(22).                   022562      
000577    03 S080-STXC-REGISTROSSAL           OCCURS 10 TIMES.          022564      
000578       05 S080-STXC-LLAVE1             PIC X(12).                 022566      
000579       05 S080-STXC-LLAVE2             PIC 9(12).                 022568      
000580       05 S080-STXC-LLAVE3             PIC 9(12).                 022570      
000581       05 S080-STXC-LLAVE4             PIC 9(12).                 022572      
000582       05 S080-STXC-LLAVE5             PIC X(12).                 022574      
000583       05 S080-STXC-LLAVE6             PIC 9(12).                 022576      
000584       05 S080-STXC-FEC-ALT            PIC 9(06) COMP.            022578      
000585       05 S080-STXC-FEC-BAJA           PIC 9(06) COMP.            022580      
000586       05 S080-STXC-FEC-ULTMOD         PIC 9(06) COMP.            022582      
000587       05 S080-STXC-FEC-VIGSAL         PIC 9(06) COMP.            022584      
000588       05 S080-STXC-LEYENDA            PIC X(300).                022586      
000589       05 FILLER                       PIC X(66).                 022588      
000590  77 WKS-EOF                           PIC 9.                     022590      
000591  01 WKS-TAXID                         PIC X(12).                 022592      
000592  01 WKS-INDTAX                        PIC 9(04)  VALUE 0.        022594      
000593  01 WKS-NUM-OCCURS                    PIC 9(02).                 022596      
000594  01 WKS-V-POS                         PIC 9(04).                 022600      
000595  01 LEYENDAS-TAXID.                                              022605      
000596     03 WKS-LEYENDAS                   PIC X(30).                 022610      
000597     03 WKS-TXID                       PIC X(10).                 022615      
000598  01 WKS-POSTAX                        PIC 9(04).                 022620      
000599*************************************************************     022625      
000600*      CARGA DE CATALOGOS ARREGLOS  AGF                     *     022630      
000601*************************************************************     022635      
000602  01 WKS-CVETRAN-POSCI.                                           022640      
000603   05 WKS-CVETRAN-POSCI-OC   OCCURS 10000 TIMES.                  022645      
000604       10 WKS-POSCI-TAX            PIC 9(04) COMP.                022650      
000605  01 WKS-TAX-POSCI.                                               022655      
000606   05 WKS-TAX-POSCI-OC      OCCURS 6500 TIMES.                    022660      
000607       10 WKS-TAX-ID        PIC X(10).                            022665      
000608  77 ERR-CAT                        PIC 9(02).                    022670      
000609**************************************************************    022672      
000610*      REFEFINICION TXID             AGF                     *    022674      
000611**************************************************************    022676      
000612  01 WKS-DES-TXC.                                                 022678      
000613    03 WKS-VAL-TXC                      PIC X(02).                022680      
000614    03 WKS-TIP-TXC                      PIC X(04).                022682      
000615    03 WKS-NUM-TXC                      PIC X(04).                022684      
000616**************************************************************    022686      
000617*    VARIABLES PARA OBTENER DATOS DEL HOST DONDE SE CORRE    *    022700      
000618**************************************************************    022800      
000619 01  WKS-DATOS-HOST.                                              022900      
000620     03 WKS-NUMCSI                           PIC 9(02).           023000      
000621     03 WKS-NOMEQUIPO                        PIC X(10).           023100      
000622     03 WKS-NOMCSI                           PIC X(26).           023200      
000623     03 WKS-LINEABATCH                       PIC X(05).           023300      
000624                                                                  023400      
000625******************************************************************023500      
000626*            PARAMETROS DE LAS CVES DE TRANSACCION               *023600      
000627******************************************************************023700      
000628 01 WKS-TABLA-PARAMETROS-TRANS.                                   023800      
000629    02 WKS-T-PARAMETROS-TRANS OCCURS 5000 TIMES.                  023900      
000630       04 WKS-PT-ENVEDC                   PIC 9(02) COMP.         024000      
000631       04 WKS-PT-NATURALEZA               PIC 9(02) COMP.         024100      
000632                                                                  024200      
000633****************************************************************  024300      
000634*    COPY DE PARAMETROS PARA LIBRERIA L100 (DATOS CLIENTES)    *  024400      
000635****************************************************************  024500      
000636                                                                  024600      
000637*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000638* COPY "(S016)S016/PARAMETROS/L100/COMISIONES ON CLIENTES."       024700      
000639*       FROM 47600 TO 50700.                                      024800      
000640*************************************************************     047600      
000641***  PARAMETROS PARA EL ENTRY POINT S016S500_01           ***     047700      
000642*************************************************************     047800      
000643 01  E100-05-CTR-ENTRADA.                                         047900      
000644     02  E100-05-CTR-NUMSIST         PIC 9(04) COMP.              048000      
000645     02  E100-05-CTR-NUMPASO         PIC 9(04) COMP.              048200      
000646     02  E100-05-CTA-NUMPROD         PIC 9(04) COMP.              048400      
000647     02  E100-05-CTA-CVEINST         PIC 9(04) COMP.              048600      
000648     02  E100-05-CTO-NUM.                                         048800      
000649         03  E100-05-CTA-NUMPREF     PIC 9(04) COMP.              049000      
000650         03  E100-05-CTA-NUM         PIC 9(12) COMP.              049100      
000651     02  E100-05-OPCION              PIC 9(02) COMP.              049150      
000652     02  E100-05-CTR-NUMCSI          PIC 9(02) COMP.              049170      
000653     02  FILLER                       PIC X(87).                  049200      
000654 01  S100-05-CTR-SALIDA.                                          049300      
000655     02 S100-05-CTR-REGISTRO.                                     049400      
000656        03 S100-05-CTA-NUMPROD         PIC 9(04) COMP.            049500      
000657        03 S100-05-CTA-CVEINST         PIC 9(04) COMP.            049600      
000658        03 S100-05-CTA-NUMSUC          PIC 9(04) COMP.            049700      
000659        03 S100-05-CTE-CVEPERS         PIC 9(02) COMP.            049800      
000660        03 S100-05-CTE-CVESECTOR       PIC 9(02) COMP.            049900      
000661        03 S100-05-CTE-BANCA           PIC 9(02) COMP.            050000      
000662        03 S100-05-CTE-ACTBNM          PIC 9(06) COMP.            050100      
000663        03 S100-05-CTA-CVEMON          PIC 9(02) COMP.            050200      
000664        03 S100-05-CTE-NOMBRE          PIC X(55).                 050300      
000665        03 S100-05-CTE-CVESOCFUN       PIC 9(02) COMP.            050400      
000666        03 S100-05-CTE-CVEPERBCO       PIC 9(02) COMP.            050500      
000667        03 S100-05-CTE-NUM             PIC 9(12) COMP.            050550      
000668        03 S100-05-CTA-CVESTATUS       PIC 9(02) COMP.            050570      
000669        03 S100-05-CTE-CODRFC.                                    050575      
000670           04 S100-05-CTE-CODINI       PIC X(04).                 050580      
000671           04 S100-05-CTE-FECNAC       PIC 9(06) COMP.            050585      
000672           04 S100-05-CTE-CODHOM       PIC X(05).                 050590      
000673        03 S100-05-CTA-CVEUSO          PIC 9(02) COMP.            050595      
000674        03 S100-05-CTA-CVEMANEJO       PIC 9(02) COMP.            050596      
000675        03 S100-05-INFADICTA.                                     050597      
000676           04 S100-05-FECONSTIT        PIC 9(06) COMP.            050598      
000677           04 S100-05-FEPODER          PIC 9(06) COMP.            050599      
000678           04 S100-05-FEDICJURI        PIC 9(06) COMP.            050600      
000679        03 S100-05-CTR-NUMCSI          PIC 9(02) COMP.            050605      
000680     02 FILLER                         PIC X(87).                 050610      
000681 77  R100-05-CTR-ERROR           PIC S9(11) BINARY.               050700      
000682*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000683                                                                  024900      
000684****************************************************************  025000      
000685*    COPY DEL FORMATO DE ARCHIVOS DE MOVIMIENTOS DEL S151      *  025100      
000686****************************************************************  025200      
000687                                                                  025300      
000688*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000689*  COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS.".                     025400      
000690                                                                  000100      
000691******************************************************************000200      
000692**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
000693**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
000694**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
000695******************************************************************000600      
000696                                                                  000700      
000697 01 A00-R00-HDR-MOV .                                             000800      
000698    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
000699    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
000700    02 FILLER                          PIC  X(08).                001100      
000701    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
000702    02 FILLER                          PIC  X(430).               001300      
000703                                                                  001400      
000704 01 A00-R01-REGMOV .                                              001500      
000705    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
000706    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
000707    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
000708                                                                  001900      
000709    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
000710    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
000711                                       PIC  9(04)      COMP.      002200      
000712    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
000713                                       PIC  9(04)      COMP.      002400      
000714                                                                  002500      
000715    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000716    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
000717                                       PIC  9(02)      COMP.      002800      
000718    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
000719                                       PIC  9(02)      COMP.      003000      
000720    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
000721    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
000722                                       A00-R01-SERVICIO-ALERTA.   003060      
000723       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
000724       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
000725    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
000726    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
000727    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
000728                                       PIC  9(04)      COMP.      003420      
000729    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
000730    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
000731                                       PIC  9(04)      COMP.      003520      
000732    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
000733    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
000734    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
000735                                       PIC  9(02)      COMP.      003900      
000736                                                                  004000      
000737    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
000738    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
000739       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
000740          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
000741          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
000742          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
000743          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
000744          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
000745          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
000746          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
000747                                                                  005100      
000748    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
000749       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
000750       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
000751       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
000752       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
000753       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
000754       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
000755       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
000756                                                                  006000      
000757       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
000758       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
000759       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
000760       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
000761       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
000762       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
000763       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
000764                                                                  006800      
000765       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
000766       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
000767       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
000768       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
000769       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
000770       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
000771       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
000772                                                                  007600      
000773       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
000774       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
000775       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
000776       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
000777       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
000778       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
000779       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
000780                                                                  008400      
000781       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
000782       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
000783       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
000784       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
000785       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
000786       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
000787       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
000788                                                                  009200      
000789    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
000790    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
000791    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
000792    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
000793    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
000794    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
000795       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
000796    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
000797    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
000798    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
000799    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
000800    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
000801    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
000802    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
000803    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
000804       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
000805       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
000806    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
000807    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
000808    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
000809    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
000810    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
000811    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
000812    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
000813    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
000814    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
000815    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
000816    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
000817    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
000818    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
000819    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
000820                                       PIC X(10).                 012600      
000821    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
000822       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
000823       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
000824    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
000825    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
000826    03 A00-R01-FILIAL                  PIC  X(05).                013200      
000827    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
000828       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
000829       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
000830                                                                  013300      
000831    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
000832    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
000833                                       PIC  X(09).                013600      
000834    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
000835                                       PIC  9(18)      COMP.      013800      
000836    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
000837    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
000838                                       PIC  X(9).                 014100      
000839    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
000840    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
000841                                       PIC  X(05).                014400      
000842    03 A00-R01-NIO                     PIC  X(16).                014500      
000843    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
000844    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
000845    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
000846       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
000847    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
000848    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
000849       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
000850    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
000851    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
000852    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
000853    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
000854    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
000855    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
000856                                       PIC  X(04).                015900      
000857    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
000858    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
000859    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
000860                                       PIC  9(04)      COMP.      016300      
000861    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
000862    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
000863    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
000864    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
000865    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
000866                                                                  016900      
000867    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
000868    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
000869       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
000870    03 A00-R01-FILXAPL                 PIC X(165).                017300      
000871                                                                  017400      
000872    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
000873       05 FILLER                       PIC X(96).                 017510      
000874       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
000875       05 FILLER                       PIC X(67).                 017700      
000876                                                                  017702      
000877    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
000878       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
000879       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
000880       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
000881       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
000882       06 WKS-MOV-FILS084              PIC X(154).                017714      
000883                                                                  017800      
000884    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
000885       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
000886       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
000887       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
000888       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
000889       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
000890       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
000891       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
000892       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
000893       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018155      
000894*      CAMPOS NUEVOS                                              018160      
000895       05 A00-R01-SUCFOND              PIC 9(04)      COMP.       018161      
000896       05 A00-R01-CTAFOND              PIC 9(16)      COMP.       018162      
000897       05 A00-R01-OPBANEL              PIC 9(04)      COMP.       018163      
000898       05 A00-R01-GATN                 PIC S9(03)V99   COMP.      018164      
000899       05 A00-R01-GATR                 PIC S9(03)V99   COMP.      018165      
000900       05 A00-R01-FECGAT               PIC 9(08)      COMP.       018166      
000901       05 FILLER                       PIC X(43).                 018167      
000902*       05 FILLER                       PIC X(62).                018170      
000903       05 A00-R01-CTE-087              PIC X(07).                 018210      
000904       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
000905          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
000906          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
000907          07 FILLER                    PIC X(01).                 018281      
000908       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
000909       05 FILLER                       PIC X(58).                 018400      
000910                                                                  018500      
000911    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
000912       05 FILLER                       PIC  X(96).                018610      
000913       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
000914       05 FILLER                       PIC  X(65).                018630      
000915                                                                  018640      
000916    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
000917       05 A00-R01-FORMATO0             PIC  9(02).                018700      
000918       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
000919       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
000920       05 FILLER                       PIC  X(141).               018910      
000921                                                                  019100      
000922    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
000923       05 A00-R01-FORMATO1             PIC  9(02).                019300      
000924       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
000925       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
000926       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
000927       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
000928       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
000929       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
000930       05 A00-R01-ENTSAL               PIC  X(01).                020000      
000931       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
000932       05 FILLER                       PIC  X(69).                020200      
000933                                                                  020300      
000934    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
000935       05 A00-R01-FORMATO2             PIC  9(02).                020500      
000936       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
000937       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
000938       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
000939       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
000940       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
000941       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
000942       05 FILLER                       PIC  X(77).                021200      
000943                                                                  021300      
000944    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
000945       05 A00-R01-FORMATO3             PIC  9(02).                021500      
000946       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
000947       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
000948       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
000949       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
000950       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
000951       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
000952       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
000953       05 FILLER                       PIC  X(69).                022300      
000954                                                                  022400      
000955    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
000956       05 A00-R01-FORMATO4             PIC  9(02).                022600      
000957       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
000958       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
000959       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
000960       05 A00-R01-RFCFT04              PIC  X(13).                023000      
000961       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
000962       05 A00-R01-DIRECCION            PIC  X(40).                023200      
000963       05 FILLER                       PIC  X(85).                023300      
000964                                                                  023400      
000965    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
000966       05 A00-R01-COBERTURA            PIC  X(01).                023408      
000967       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
000968       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
000969       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
000970       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
000971       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
000972       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
000973       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
000974       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
000975       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
000976       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
000977       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
000978       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
000979       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
000980       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
000981       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
000982       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
000983       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
000984       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
000985       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
000986       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
000987       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
000988       05 FILLER                       PIC  X(05).                023492      
000989                                                                  023497      
000990    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
000991       05 A00-R01-4CEROS               PIC  9(04).                023600      
000992       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
000993       05 FILLER                       PIC  X(157).               023800      
000994                                                                  023900      
000995    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
000996       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
000997        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
000998       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
000999       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
001000       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
001001       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
001002       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
001003       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
001004       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
001005       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
001006       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
001007       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
001008       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
001009       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
001010       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
001011       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
001012       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
001013       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
001014       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
001015       05 A00-R01-FILLER               PIC  X(41).                025850      
001016       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
001017       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
001018       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
001019       05 A00-R01-INDPAGO              PIC  9(01).                026200      
001020       05 FILLER                       PIC  X(01).                026210      
001021       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
001022       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
001023       05 FILLER                       PIC  X(52).                026300      
001024                                                                  026400      
001025    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
001026       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
001027       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
001028       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
001029       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
001030       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
001031       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
001032       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
001033       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
001034       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
001035       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
001036       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
001037       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
001038       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
001039          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
001040          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
001041       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
001042       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
001043          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
001044       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
001045          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
001046       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
001047          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
001048       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
001049          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
001050       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
001051          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
001052       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
001053          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
001054       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
001055          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
001056       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
001057          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
001058       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
001059          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
001060       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
001061          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
001062          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
001063       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
001064       05 FILLER                       PIC X(01).                 030101      
001065       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
001066       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
001067       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
001068       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
001069       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
001070       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
001071       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
001072       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
001073          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
001074       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
001075       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
001076       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
001077       05 FILLER                       PIC X(14).                 030700      
001078                                                                  030800      
001079    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
001080       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
001081       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
001082       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
001083       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
001084       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
001085       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
001086       05 A00-R01-151-CITI             PIC  9(02)     COMP.       031520      
001087       05 A00-R01-151-IND-BNE          PIC  9(02)     COMP.       031540      
001088       05 FILLER                       PIC  X(140).               031600      
001089                                                                  031700      
001090    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
001091       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
001092       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
001093       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
001094       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
001095       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
001096       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
001097       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
001098       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
001099       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
001100       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
001101          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
001102          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
001103          07 FILLER                    PIC  X(08).                032740      
001104       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
001105       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
001106       05 A00-R01-NOMORD               PIC  X(30).                033000      
001107       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
001108       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
001109       05 A00-R01-REF-CECO             PIC  X(07).                033500      
001110       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
001111       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
001112          A00-R01-NUM-ORD-PAGO.                                   033800      
001113          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
001114          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
001115                                                                  034100      
001116    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
001117       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
001118       05 A00-R01-RFC-S501             PIC  X(13).                034160      
001119       05 FILLER                       PIC  X(151).               034180      
001120                                                                  034190      
001121    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
001122       05 A00-R01-DATOS-S701           PIC X(116).                034300      
001123       05 A00-R01-PAG-SERV             REDEFINES                  034400      
001124                                       A00-R01-DATOS-S701.        034500      
001125          07 A00-R01-ID                PIC X(30).                 034600      
001126          07 A00-R01-FECREC            PIC 9(06).                 034700      
001127          07 A00-R01-REF1              PIC X(20).                 034800      
001128          07 A00-R01-REF2              PIC X(20).                 034900      
001129          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
001130          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
001131                                       A00-R01-TIPOPAGO.          035200      
001132             09 A00-R01-ESTAB          PIC 9(04).                 035300      
001133             09 A00-R01-SEQ            PIC 9(02).                 035400      
001134          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
001135          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
001136          07 A00-R01-EBPP              PIC 9(03).                 035700      
001137          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
001138          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
001139          07 FILLER                    PIC X(01).                 035728      
001140          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
001141          07 FILLER                    PIC X(18).                 035760      
001142       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
001143                                       A00-R01-DATOS-S701.        035900      
001144          07 A00-R01-RFC               PIC X(13).                 036000      
001145          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
001146          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
001147          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
001148          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
001149          07 FILLER                    PIC X(85).                 036200      
001150       05 FILLER                       PIC X(49).                 036300      
001151                                                                  036400      
001152    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
001153       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
001154       05 A00-R01-CTA-S702             PIC X(40).                 036700      
001155       05 FILLER                       PIC X(113).                036710      
001156                                                                  036720      
001157    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
001158       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
001159       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
001160       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
001161       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
001162       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
001163       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
001164       05 FILLER                       PIC X(72).                 036800      
001165                                                                  036810      
001166                                                                  036820      
001167    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
001168       05 A00-R01-TRUI-S711.                                      036915      
001169          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
001170          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
001171          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
001172           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
001173          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
001174       05 A00-R01-MICR-S711.                                      036945      
001175          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
001176          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
001177          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
001178          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
001179          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
001180          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
001181          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
001182          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
001183       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
001184       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
001185       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
001186       05 A00-R01-FIL-S711             PIC X(05).                 036965      
001187       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
001188       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
001189       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
001190                                                                  036990      
001191    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
001192       05 A00-R01-RFC-502              PIC  X(13).                037100      
001193       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
001194          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
001195          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
001196          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
001197          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
001198          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
001199          07 FILLER                    PIC  9(01) COMP.           037650      
001200       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
001201       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
001202       05 FILLER                       PIC  X(06).                038680      
001203                                                                  038682      
001204    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
001205       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
001206       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
001207       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
001208       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
001209       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
001210       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
001211       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
001212       05 FILLER                       PIC  X(81).                038750      
001213                                                                  038755      
001214    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
001215       05 A00-R01-COP                  PIC  9(13)        .        038900      
001216       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
001217       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
001218       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
001219       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
001220       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
001221       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
001222       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
001223       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
001224       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
001225       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
001226       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
001227       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
001228       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
001229       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
001230       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
001231       05 FILLER                       PIC  X(81)        .        040800      
001232                                                                  040810      
001233    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
001234       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
001235       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
001236       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
001237       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
001238       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
001239       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
001240       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
001241       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
001242       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
001243       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
001244       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
001245       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
001246       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
001247       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
001248       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
001249       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
001250       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
001251       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
001252       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
001253       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
001254       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
001255       05 FILLER                       PIC  X(18).                041040      
001256                                                                  041400      
001257    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
001258    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
001259*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001260*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001261*  COPY "(S151)S151/FORMATO/ARCHIVO/DATOSADIC.".                  025500      
001262 01 A01-R00-HDR-DES .                                             000100      
001263     03 A00-R00-HDR-HD                 PIC X(02).                 000200      
001264     03 A00-R00-HDR-FCH                PIC 9(08).                 000300      
001265     03 FILLER                         PIC X(530).                000400      
001266 01 A01-R01-DATOS.                                                000500      
001267     03 A01-R01-AUTS151ORI             PIC 9(08) COMP.            000600      
001268     03 A01-R01-DATOS-1.                                          000610      
001269        05 A01-R01-REF-BANAMEX         PIC X(26).                 000620      
001270        05 A01-R01-CVECON-YREFLOC REDEFINES                       000640      
001271           A01-R01-REF-BANAMEX         PIC X(26).                 000700      
001272        05 A01-R01-CVECON-Y-REFV REDEFINES A01-R01-REF-BANAMEX.   000800      
001273           07 A01-R01-CONT-ORIG        PIC 9(20) COMP.            000900      
001274           07 A01-R01-REFLOC-BNM       PIC X(12).                 001000      
001275           07 A01-R01-REFLOC-23POS REDEFINES A01-R01-REFLOC-BNM.  001100      
001276              09 A01-R01-COMPREF       PIC 9(01) COMP.            001200      
001277              09 A01-R01-REF23POS      PIC 9(23) COMP.            001250      
001278           07 A01-R01-REFALFA REDEFINES A01-R01-REFLOC-BNM        001270      
001279                                       PIC X(12).                 001290      
001280           07 FILLER                   PIC X(04).                 001300      
001281        05 A01-R01-REFLOC7-BNM REDEFINES A01-R01-REF-BANAMEX.     001400      
001282           07 FILLER                   PIC X(02).                 001500      
001283           07 A01-R01-LOC07BNM         PIC X(24).                 001600      
001284        05 A01-R01-NOMINA-FUN1         PIC 9(14) COMP.            003600      
001285        05 A01-R01-NOMINA-FUN2         PIC 9(14) COMP.            003700      
001286        05 A01-R01-SDO-FIN.                                       003720      
001287           07 A01-R01-SDO-FIN-S500     PIC S9(15)V99 COMP.        003740      
001288           07 FILLER                   PIC X(05).                 003760      
001289        05 A01-R01-NOMINAS-MC REDEFINES A01-R01-SDO-FIN.          003780      
001290           07 A01-R01-NOM-MAKER        PIC 9(14) COMP.            003800      
001291           07 A01-R01-NOM-CHECKER      PIC 9(14) COMP.            003900      
001292        05 A01-R01-REF-CLIENTE         PIC X(16).                 004000      
001293        05 A01-R01-REFERENCIA1         PIC X(35).                 004100      
001294        05 A01-R01-REFERENCIA1-S500 REDEFINES A01-R01-REFERENCIA1.004110      
001295           07 A01-R01-ORIG-HRAMOV      PIC 9(06).                 004120      
001296           07 A01-R01-ORIG-FECMOV      PIC 9(06).                 004130      
001297           07 A01-R01-ORIG-FOLIO       PIC X(12).                 004140      
001298           07 A01-R01-ORIG-MDE         PIC 9(02).                 004150      
001299           07 A01-R01-ORIG-FILREF1     PIC X(09).                 004160      
001300        05 A01-R01-REF2-CTE            PIC X(35).                 004200      
001301        05 A01-R01-REF3-CTE            PIC X(35).                 004300      
001302        05 A01-R01-REF4-CTE            PIC X(35).                 004400      
001303        05 A01-R01-DATOS-2.                                       004450      
001304           07 A01-R01-LEY1             PIC X(40).                 004500      
001305           07 A01-R02-LEY2             PIC X(40).                 004600      
001306           07 A01-R02-LEY3             PIC X(40).                 004700      
001307           07 A01-R02-LEY4             PIC X(40).                 004800      
001308           07 A01-R02-LEY5             PIC X(40).                 004900      
001309           07 A01-R01-FILXAPL          PIC X(120).                004910      
001310           07 A01-R01-FILXAPL-S203 REDEFINES A01-R01-FILXAPL.     004912      
001311              09 A01-R01-CVE-IMPTO10   PIC 9(06).                 004914      
001312              09 A01-R01-FORMA-PAG10   PIC 9(03).                 004916      
001313              09 A01-R01-IMP-IMPTO10   PIC 9(12).                 004918      
001314              09 A01-R01-CVE-IMPTO11   PIC 9(06).                 004920      
001315              09 A01-R01-FORMA-PAG11   PIC 9(03).                 004922      
001316              09 A01-R01-IMP-IMPTO11   PIC 9(12).                 004924      
001317              09 A01-R01-CVE-IMPTO12   PIC 9(06).                 004926      
001318              09 A01-R01-FORMA-PAG12   PIC 9(03).                 004928      
001319              09 A01-R01-IMP-IMPTO12   PIC 9(12).                 004930      
001320              09 A01-R01-CVE-IMPTO13   PIC 9(06).                 004932      
001321              09 A01-R01-FORMA-PAG13   PIC 9(03).                 004934      
001322              09 A01-R01-IMP-IMPTO13   PIC 9(12).                 004936      
001323              09 A01-R01-CVE-IMPTO14   PIC 9(06).                 004938      
001324              09 A01-R01-FORMA-PAG14   PIC 9(03).                 004940      
001325              09 A01-R01-IMP-IMPTO14   PIC 9(12).                 004942      
001326              09 FILLER                PIC X(15).                 004944      
001327                                                                  004946      
001328*          07 A01-R01-FILXAPL-S711 REDEFINES A01-R01-FILXAPL.     004948      
001329*             09 A01-R01-TRUI-S711.                               004949      
001330*                11 A01-R01-CSIREC-S711 PIC 9(08) COMP.           004950      
001331*                11 A01-R01-CSIOR-S711  PIC 9(08) COMP.           004951      
001332*                11 A01-R01-NUMOP-S711  PIC 9(08) COMP.           004952      
001333*                11 A01-R01-NUMTR-S711  PIC 9(08) COMP.           004953      
001334*                11 A01-R01-INSMN-S711  PIC 9(02) COMP.           004954      
001335*             09 A01-R01-MICR-S711.                               004955      
001336*                11 A01-R01-CODSEG-S711 PIC 9(04) COMP.           004956      
001337*                11 A01-R01-VERPRE-S711 PIC 9(02) COMP.           004957      
001338*                11 A01-R01-CTRMON-S711 PIC 9(02) COMP.           004958      
001339*                11 A01-R01-PLCEC-S711  PIC 9(04) COMP.           004959      
001340*                11 A01-R01-BNCEM-S711  PIC 9(04) COMP.           004960      
001341*                11 A01-R01-DVEIN-S711  PIC 9(02) COMP.           004961      
001342*                11 A01-R01-CTACH-S711  PIC 9(12) COMP.           004962      
001343*                11 A01-R01-REFCH-S711  PIC 9(08) COMP.           004963      
001344*             09 A01-R01-CTABEN-S711    PIC 9(20) COMP.           004964      
001345*             09 A01-R01-BCREC-S711     PIC 9(04) COMP.           004965      
001346*             09 A01-R01-NOMBEN-S711    PIC X(40).                004966      
001347*             09 A01-R01-RFCBCO-S711    PIC X(13).                004967      
001348*             09 A01-R01-FILLER-S711    PIC X(19).                004968      
001349                                                                  004969      
001350           07 A01-R01-FILXAPL-S701 REDEFINES A01-R01-FILXAPL.     004970      
001351              09 A01-R01-NVAAUT-S701   PIC 9(08).                 004971      
001352              09 A01-R01-NVASUCTR-S701 PIC 9(04).                 004972      
001353              09 A01-R01-NVACAJTR-S701 PIC 9(02).                 004973      
001354              09 A01-R01-NVAFECT-S701  PIC 9(08).                 004974      
001355              09 A01-R01-NVOMDPA-S701  PIC 9(02).                 004975      
001356              09 A01-R01-NVALINC-S701  PIC X(30).                 004976      
001357              09 A01-R01-FILLER2-S701  PIC X(66).                 004977      
001358                                                                  004978      
001359           07 A01-R01-FILXAPL-S702 REDEFINES A01-R01-FILXAPL.     004979      
001360              09 A01-R01-STTRAN-S702   PIC 9(01).                 004980      
001361              09 A01-R01-CTEEMI-S702   PIC 9(12) COMP.            004981      
001362              09 A01-R01-CTADES-S702   PIC 9(20) COMP.            004982      
001363              09 A01-R01-IDEORI-S702   PIC 9(01).                 004983      
001364              09 A01-R01-IDEDES-S702   PIC 9(01).                 004984      
001365              09 A01-R01-TCTAEM-S702   PIC 9(02) COMP.            004985      
001366              09 A01-R01-TIARCH-S702   PIC X(01).                 004986      
001367              09 A01-R01-FECARC-S702   PIC 9(08) COMP.            004987      
001368              09 A01-R01-SECARC-S702   PIC 9(02) COMP.            004988      
001369              09 A01-R01-AUTORI-S702   PIC 9(20) COMP.            004989      
001370              09 A01-R01-NOMUSU-S702   PIC X(40).                 004990      
001371              09 A01-R01-TCTAUS-S702   PIC 9(02) COMP.            004991      
001372              09 A01-R01-SUCCON-S702   PIC 9(04) COMP.            004992      
001373              09 A01-R01-CAJCON-S702   PIC 9(04) COMP.            004993      
001374              09 A01-R01-FILLER-S702   PIC X(39).                 004994      
001375                                                                  004995      
001376           07 A01-R01-FILXAPL-S500 REDEFINES A01-R01-FILXAPL.     004996      
001377              09 A01-R01-NOMB-CTE          PIC  X(36).            004997      
001378              09 A01-R01-NOMB-BENEF        PIC  X(50).            004998      
001379              09 A01-R01-CVE-RASTREO-S500  PIC  X(30).            004999      
001380* INI VML                                                         005000      
001381              09 A01-R01-CVE-RASTREO-S500-R REDEFINES             005001      
001382                              A01-R01-CVE-RASTREO-S500.           005002      
001383                 11 A01-R01-TIP-CTA-TRASP  PIC 9(02).             005004      
001384                 11 A01-R01-BCO-CTA-TRASP  PIC 9(05).             005006      
001385                 11 A01-R01-NUM-CTA-TRASP  PIC 9(18).             005007      
001386                 11 A01-R01-FILLER-TRASP   PIC X(05).             005008      
001387* FIN VML                                                         005009      
001388              09 A01-R01-FECHA-PAGO        PIC  9(08)     COMP.   005010      
001389        05 A01-R01-DATOS-2-S264 REDEFINES A01-R01-DATOS-2.        005012      
001390           07 A01-R01-NOMINA-FUN3      PIC 9(14) COMP.            005014      
001391           07 A01-R01-COMISION         PIC 9(10)V99 COMP.         005016      
001392           07 A01-R01-SITUACION        PIC 9(10)V99 COMP.         005018      
001393           07 A01-R01-IVA-COMIS        PIC 9(08)V99 COMP.         005020      
001394           07 A01-R01-IVA-SITUACION    PIC 9(08)V99 COMP.         005022      
001395           07 A01-R01-IVA-FISCAL       PIC 9(12)V99 COMP.         005024      
001396           07 A01-R01-FOLIO-RECEP      PIC 9(10) COMP.            005026      
001397           07 A01-R01-OCUPACION        PIC X(40).                 005028      
001398           07 A01-R01-POBLACION        PIC X(40).                 005030      
001399           07 A01-R01-TIPO-CTA         PIC 9(02) COMP.            005032      
001400           07 A01-R01-NUM-CTE          PIC 9(12) COMP.            005034      
001401           07 A01-R01-NUM-CTA          PIC 9(20) COMP.            005036      
001402           07 A01-R01-CVE-TIPO-IDEN    PIC 9(02) COMP.            005038      
001403           07 A01-R01-NUM-IDEN-OFIC    PIC X(18).                 005040      
001404           07 A01-R01-FECHA-NAC-BEN    PIC 9(08) COMP.            005042      
001405           07 A01-R01-DOMICILIO        PIC X(55).                 005044      
001406           07 A01-R01-COLONIA          PIC X(30).                 005046      
001407           07 A01-R01-TELEFONO         PIC X(10).                 005048      
001408           07 A01-R01-COD-POS          PIC 9(06) COMP.            005050      
001409           07 A01-R01-REF-EMISOR       PIC X(20).                 005052      
001410           07 A01-R01-PIN              PIC 9(12) COMP.            005054      
001411           07 A01-R01-TIPO-CHQ-ORD     PIC 9(02) COMP.            005056      
001412           07 A01-R01-FECHA-EVENTO     PIC 9(08) COMP.            005058      
001413           07 A01-R01-CVE-RASTREO-S264 PIC X(30).                 005060      
001414     03 A01-R01-DATOS-1-R    REDEFINES A01-R01-DATOS-1.           005062      
001415        05 A01-R01-SUB-STA-DOC         PIC 9(02) COMP.            005064      
001416        05 A01-R01-SUC-DESTINO         PIC 9(04) COMP.            005066      
001417        05 A01-R01-TIPO-PREV           PIC X(01).                 005068      
001418        05 A01-R01-CAUSA-CAN-DEV       PIC 9(04) COMP.            005070      
001419        05 A01-R01-NVO-BCO-ORI         PIC 9(06) COMP.            005072      
001420        05 A01-R01-NVO-BCO-DES         PIC 9(06) COMP.            005074      
001421        05 A01-R01-NOM-BENEF-IDEN      PIC X(55).                 005076      
001422        05 A01-R01-NVO-NOM-BENEF       PIC X(55).                 005078      
001423        05 A01-R01-RFC-CURP-BENEF      PIC X(18).                 005080      
001424        05 A01-R01-GTOS-ORD-PAGO       PIC 9(16)V99 COMP.         005082      
001425        05 A01-R01-TIPO-PAGO-CECO      PIC 9(02) COMP.            005084      
001426        05 A01-R01-TIPO-PAGO-SPEI      PIC 9(02) COMP.            005086      
001427        05 A01-R01-TIPO-CONVENIO       PIC 9(02) COMP.            005088      
001428        05 A01-R01-PZA-EDO             PIC 9(06) COMP.            005090      
001429        05 A01-R01-TIPO-CTA-ABO        PIC 9(02) COMP.            005092      
001430        05 A01-R01-NUM-CTE-ABO         PIC 9(12) COMP.            005094      
001431        05 A01-R01-NUM-CTA-ABO         PIC 9(20) COMP.            005096      
001432        05 FILLER                      PIC X(358).                005098      
001433                                                                  005100      
001434     03 A01-R01-DATOS-2-S500 REDEFINES A01-R01-DATOS-1.           005102      
001435        05 A01-R01-TRUI.                                          005104      
001436           07 A01-R01-CSIID-RECEPTOR   PIC 9(08) COMP.            005106      
001437           07 A01-R01-CSIID-ORIGEN     PIC 9(08) COMP.            005108      
001438           07 A01-R01-NUM-OPERACION    PIC 9(08) COMP.            005110      
001439           07 A01-R01-NUM-TRANSACCI    PIC 9(08) COMP.            005112      
001440           07 A01-R01-INST-MONETARIO   PIC 9(02) COMP.            005114      
001441        05 A01-R01-MICR.                                          005116      
001442           07 A01-R01-COD-SEGURIDAD    PIC 9(04) COMP.            005118      
001443           07 A01-R01-VER-PREMARCADO   PIC 9(02) COMP.            005120      
001444           07 A01-R01-COD-TRANSMONE    PIC 9(02) COMP.            005122      
001445           07 A01-R01-PLAZA-CECOBAN    PIC 9(04) COMP.            005124      
001446           07 A01-R01-COD-BCOEMISOR    PIC 9(04) COMP.            005126      
001447           07 A01-R01-DIG-VINTERCAM    PIC 9(02) COMP.            005128      
001448           07 A01-R01-NUM-CTACHEQUE    PIC 9(12) COMP.            005130      
001449           07 A01-R01-NUM-REFCHEQUE    PIC 9(08) COMP.            005132      
001450        05 A01-R01-CTA-BENEFOTROBCO    PIC 9(20) COMP.            005134      
001451        05 A01-R01-BCO-RECEPOTROBCO    PIC 9(04) COMP.            005136      
001452        05 A01-R01-NOM-BENEFOTROBCO    PIC X(40).                 005138      
001453        05 A01-R01-RFC-OTROBCO         PIC X(13).                 005140      
001454        05 A01-R01-NOMPAN-S500         PIC X(05).                 005142      
001455        05 A01-R01-OPCPAN-S500         PIC X(01).                 005144      
001456        05 A01-R01-NUMCTO1-S500        PIC 9(16) COMP.            005146      
001457        05 A01-R01-NUMCTO2-S500        PIC 9(16) COMP.            005148      
001458        05 A01-R01-NUMCTO3-S500        PIC 9(16) COMP.            005150      
001459        05 A01-R01-INDIC-EST           PIC 9(08) COMP.            005152      
001460        05 A01-R01-IND-SUBC            PIC 9(01) COMP.            005154      
001461        05 A01-R01-PRO-SUBC            PIC 9(04) COMP.            005156      
001462        05 A01-R01-INST-SUBC           PIC 9(04) COMP.            005158      
001463        05 A01-R01-MON-SUBC            PIC 9(03) COMP.            005160      
001464        05 A01-R01-CONT-SUBC           PIC 9(16) COMP.            005162      
001465        05 A01-R01-CTAMDA-SUBC         PIC 9(16) COMP.            005164      
001466        05 A01-R01-STA-SUBC            PIC 9(04) COMP.            005166      
001467        05 A01-R01-INDALER-SUBC        PIC 9(04) COMP.            005168      
001468        05 A01-R01-INDCTACON-SUBC      PIC 9(02) COMP.            005170      
001469        05 A01-R01-LEYENDA-SUBC        PIC X(40).                 005171      
001470        05 A01-R01-VALOR-IND           PIC X(02).                 005172      
001471        05 A01-R01-NOMB-BENEF-AMPLI    PIC X(120).                005173      
001472        05 A01-R01-IND-EXTNET          PIC 9(01) COMP.            005174      
001473        05 A01-R01-FILLER              PIC 9(01) COMP.            005176      
001474        05 A01-R01-FILLER-DATOS2-S500  PIC X(205).                005178      
001475*        05 A01-R01-FILLER-DATOS2-S500  PIC X(328).               005180      
001476*        05 A01-R01-FILLER-DATOS2-S500  PIC X(395).               005182      
001477                                                                  005184      
001478     03 FILLER                         PIC X(01).                 005198      
001479     03 A01-R01-APUDES                 PIC 9(08) COMP.            005200      
001480     03 A01-R01-TIPREG                 PIC 9(02) COMP.            005300      
001481                                                                  005400      
001482******************************************************************005500      
001483*          VARIABLES DE LECTURA DATOS ADICIONALES "2"            *005600      
001484******************************************************************005700      
00148501 A01-R02-TESOFE.                                                005800      
001486    03 A01-R02-AUTS151ORI             PIC 9(08) COMP.             005900      
001487    03 A01-R02-DATOS-2-S500.                                      006000      
001488       05 A01-R02-TRUI.                                           006100      
001489          07 A01-R02-CSIID-RECEPTOR   PIC 9(08) COMP.             006200      
001490          07 A01-R02-CSIID-ORIGEN     PIC 9(08) COMP.             006300      
001491          07 A01-R02-NUM-OPERACION    PIC 9(08) COMP.             006400      
001492          07 A01-R02-NUM-TRANSACCI    PIC 9(08) COMP.             006500      
001493          07 A01-R02-INST-MONETARIO   PIC 9(02) COMP.             006600      
001494       05 A01-R02-MICR.                                           006700      
001495          07 A01-R02-COD-SEGURIDAD    PIC 9(04) COMP.             006800      
001496          07 A01-R02-VER-PREMARCADO   PIC 9(02) COMP.             006900      
001497          07 A01-R02-COD-TRANSMONE    PIC 9(02) COMP.             007000      
001498          07 A01-R02-PLAZA-CECOBAN    PIC 9(04) COMP.             007100      
001499          07 A01-R02-COD-BCOEMISOR    PIC 9(04) COMP.             007200      
001500          07 A01-R02-DIG-VINTERCAM    PIC 9(02) COMP.             007300      
001501          07 A01-R02-NUM-CTACHEQUE    PIC 9(12) COMP.             007400      
001502          07 A01-R02-NUM-REFCHEQUE    PIC 9(08) COMP.             007500      
001503       05 A01-R02-CTA-BENEFOTROBCO    PIC 9(20) COMP.             007600      
001504       05 A01-R02-BCO-RECEPOTROBCO    PIC 9(04) COMP.             007700      
001505       05 A01-R02-NOM-BENEFOTROBCO    PIC X(40).                  007800      
001506       05 A01-R02-RFC-OTROBCO         PIC X(13).                  007900      
001507       05 A01-R02-NOMPAN-S500         PIC X(05).                  008000      
001508       05 A01-R02-OPCPAN-S500         PIC X(01).                  008100      
001509       05 A01-R02-NUMCTO1-S500        PIC 9(16) COMP.             008200      
001510       05 A01-R02-NUMCTO2-S500        PIC 9(16) COMP.             008300      
001511       05 A01-R02-NUMCTO3-S500        PIC 9(16) COMP.             008400      
001512       05 A01-R02-INDIC-EST           PIC 9(08) COMP.             008500      
001513       05 A01-R02-IND-SUBC            PIC 9(01) COMP.             008600      
001514       05 A01-R02-PRO-SUBC            PIC 9(04) COMP.             008700      
001515       05 A01-R02-INST-SUBC           PIC 9(04) COMP.             008800      
001516       05 A01-R02-MON-SUBC            PIC 9(03) COMP.             008900      
001517       05 A01-R02-CONT-SUBC           PIC 9(16) COMP.             009000      
001518       05 A01-R02-CTAMDA-SUBC         PIC 9(16) COMP.             009100      
001519       05 A01-R02-STA-SUBC            PIC 9(04) COMP.             009200      
001520       05 A01-R02-INDALER-SUBC        PIC 9(04) COMP.             009300      
001521       05 A01-R02-INDCTACON-SUBC      PIC 9(02) COMP.             009400      
001522       05 A01-R02-LEYENDA-SUBC        PIC X(40).                  009500      
001523       05 A01-R02-VALOR-IND           PIC X(02).                  009520      
001524       05 A01-R02-NOMB-BENEF-AMPLI    PIC X(120).                 009540      
001525       05 A01-R02-IND-EXTNET          PIC 9(01) COMP.             009545      
001526       05 A01-R02-FILLER              PIC 9(01) COMP.             009550      
001527       05 A01-R02-FILLER-DATOS2-S500  PIC X(205).                 009560      
001528*       05 A01-R02-FILLER-DATOS2-S500  PIC X(327).                009600      
001529                                                                  009700      
001530    03 FILLER                         PIC X(01).                  009800      
001531    03 A01-R02-APUDES                 PIC 9(08) COMP.             009900      
001532    03 A01-R02-TIPREG                 PIC 9(02) COMP.             010000      
001533                                                                  010100      
001534*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001535*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001536*  COPY "(S151)S151/FORMATO/ARCHIVO/SALDOS.".                     025600      
001537******************************************************************000100      
001538*                                                                *000200      
001539*             FORMATO DEL ARCHIVO DE SALDOS                      *000300      
001540*                                                                *000400      
001541******************************************************************000500      
001542                                                                  000600      
001543                                                                  000700      
001544                                                                  000800      
001545 01 A02-R00-SALDOS.                                               000900      
001546    02 A02-R00-TIPO-REG            PIC  9(02)       COMP.         001000      
001547*   02 A02-R00-FILGRAL             PIC  X(179).                   001100      
001548*INICIA CODIGO DE RENOVACION CRONOS 2000                          001101      
001549    02 A02-R00-FILGRAL             PIC  X(389).                   001102      
001550*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001103      
001551                                                                  001200      
001552    02 A02-R00-HEADER              REDEFINES A02-R00-FILGRAL.     001300      
001553       03 A02-R00-HDR-SISTEMA      PIC  9(04)       COMP.         001400      
001554       03 A02-R00-HDR-PRODUCTO     PIC  9(04)       COMP.         001500      
001555*      03 A02-R00-HDR-FECHA        PIC  9(06)       COMP.         001600      
001556*INICIA CODIGO DE RENOVACION CRONOS 2000                          001601      
001557       03 A02-R00-HDR-FECHA        PIC  9(08)       COMP.         001602      
001558*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001603      
001559*      03 FILLER                   PIC  X(172).                   001700      
001560*INICIA CODIGO DE RENOVACION CRONOS 2000                          001701      
001561       03 FILLER                   PIC  X(381).                   001702      
001562*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001703      
001563                                                                  001800      
001564    02 A02-R01-REG-SAL             REDEFINES A02-R00-FILGRAL.     001900      
001565       03 A02-R01-SIS              PIC  9(04)       COMP.         002000      
001566       03 A02-R01-PRD              PIC  9(04)       COMP.         002100      
001567       03 A02-R01-INS              PIC  9(04)       COMP.         002200      
001568       03 A02-R01-CTA              PIC  9(20)       COMP.         002300      
001569       03 A02-R01-CTA-R            REDEFINES A02-R01-CTA.         002400      
001570          05 A02-R01-SUCPRO        PIC  9(04)       COMP.         002500      
001571          05 A02-R01-CNT           PIC  9(16)       COMP.         002600      
001572       03 A02-R01-EDOCTA           PIC  9(02)       COMP.         002700      
001573*      03 A02-R01-FECPRO           PIC  9(06)       COMP.         002800      
001574*INICIA CODIGO DE RENOVACION CRONOS 2000                          002801      
001575       03 A02-R01-FECPRO           PIC  9(08)       COMP.         002802      
001576*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002803      
001577*      03 A02-R01-FECINI           PIC  9(06)       COMP.         002900      
001578*INICIA CODIGO DE RENOVACION CRONOS 2000                          002901      
001579       03 A02-R01-FECINI           PIC  9(08)       COMP.         002902      
001580*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002903      
001581*      03 A02-R01-FECFIN           PIC  9(06)       COMP.         003000      
001582*INICIA CODIGO DE RENOVACION CRONOS 2000                          003001      
001583       03 A02-R01-FECFIN           PIC  9(08)       COMP.         003002      
001584*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003003      
001585*      03 A02-R01-FECULTMOV        PIC  9(06)       COMP.         003100      
001586*INICIA CODIGO DE RENOVACION CRONOS 2000                          003101      
001587       03 A02-R01-FECULTMOV        PIC  9(08)       COMP.         003102      
001588*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003103      
001589       03 A02-R01-STATUS           PIC  9(02)       COMP.         003200      
001590       03 A02-R01-ELEM-IMP         OCCURS 30 TIMES.               003300      
001591          04 A02-R01-CVESDO        PIC  9(04)       COMP.         003400      
001592          04 A02-R01-IMPT          PIC S9(13)V99    COMP.         003500      
001593*      03 A02-R01-FILXAPL          PIC  X(19).                    003600      
001594*INICIA CODIGO DE RENOVACION CRONOS 2000                          003601      
001595       03 A02-R01-FILXAPL          PIC  X(55).                    003602      
001596*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003603      
001597                                                                  003700      
001598       03 A02-R01-S084             REDEFINES A02-R01-FILXAPL.     003800      
001599          04 A02-R01-TASNET        PIC  9(04)V9(04) COMP.         003900      
001600          04 A02-R01-TASBRU        PIC  9(04)V9(04) COMP.         004000      
001601          04 A02-R01-NETPER        PIC  9(04)V9(04) COMP.         004100      
001602          04 A02-R01-NETANU        PIC  9(04)V9(04) COMP.         004200      
001603          04 A02-R01-DIASPER       PIC  9(02)       COMP.         004300      
001604          04 A02-R01-DIASANU       PIC  9(02)       COMP.         004400      
001605          04 A02-R01-MONS084       PIC  9(02)       COMP.         004500      
001606*INICIA CODIGO DE RENOVACION CRONOS 2000                          004520      
001607          04 FILLER                PIC  X(36).                    004540      
001608*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004560      
001609                                                                  004600      
001610       03 A02-R01-S084AVB          REDEFINES A02-R01-FILXAPL.     004700      
001611          04 FILLER                PIC X(03).                     004800      
001612*         04 A02-R01-FECAPE        PIC  9(06)       COMP.         004900      
001613*INICIA CODIGO DE RENOVACION CRONOS 2000                          004901      
001614          04 A02-R01-FECAPE        PIC  9(08)       COMP.         004902      
001615*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004903      
001616*         04 A02-R01-FECSIGPAGO    PIC  9(06)       COMP.         005000      
001617*INICIA CODIGO DE RENOVACION CRONOS 2000                          005001      
001618          04 A02-R01-FECSIGPAGO    PIC  9(08)       COMP.         005002      
001619*TERMINA CODIGO DE RENOVACION CRONOS 2000                         005003      
001620          04 A02-R01-SORTEO        PIC  9(02)       COMP.         005100      
001621          04 A02-R01-RESTANTES     PIC  9(03)       COMP.         005200      
001622          04 A02-R01-ANTICIPADAS   PIC  9(03)       COMP.         005300      
001623          04 A02-R01-OPORTUNAS     PIC  9(02)       COMP.         005400      
001624          04 A02-R01-TOTALES       PIC  9(02)       COMP.         005500      
001625          04 A02-R01-ATRASOS       PIC  9(02)       COMP.         005600      
001626          04 A02-R01-BONOS         PIC  9(02)       COMP.         005700      
001627          04 A02-R01-ESQUEMA       PIC  9(02)       COMP.         005800      
001628          04 A02-R01-MOVEDAAVB     PIC  9(02)       COMP.         005900      
001629          04 FILLER                PIC  X(34).                    005950      
001630                                                                  006000      
001631       03 A02-R01-S087                REDEFINES A02-R01-FILXAPL.  006100      
001632          04 A02-R01-PLAZO            PIC  9(04)       COMP.      006200      
001633          04 A02-R01-TASS087          PIC  9(04)V9(04) COMP.      006300      
001634          04 A02-R01-INSTRUCCIONES    PIC  9(02)       COMP.      006400      
001635          04 A02-R01-TIPOPER          PIC  9(04)       COMP.      006500      
001636          04 A02-R01-PM               PIC  9(02)       COMP.      006600      
001637          04 A02-R01-FILS087          PIC  X(07).                 006700      
001638          04 A02-R01-MON              PIC  9(04)       COMP.      006701      
001639          04 FILLER                   PIC  X(36).                 006702      
001640                                                                  006800      
001641       03 A02-R01-S500             REDEFINES A02-R01-FILXAPL.     006900      
001642          04 A02-R01-DIASCICLO     PIC  9(03)       COMP.         007000      
001643          04 A02-R01-DIASANO       PIC  9(03)       COMP.         007100      
001644          04 A02-R01-TASRENET      PIC  9(04)V9(04) COMP.         007200      
001645          04 A02-R01-TASREBRU      PIC  9(04)V9(04) COMP.         007300      
001646          04 A02-R01-TASREANO      PIC  9(04)V9(04) COMP.         007400      
001647          04 A02-R01-STATION       PIC  9(04)       COMP.         007500      
001648          04 A02-R01-CTACON        PIC  9(02)       COMP.         007600      
001649          04 A02-R01-MONEDA        PIC  9(02)       COMP.         007700      
001650          04 A02-R01-GENEDOCTA     PIC  9(01).                    007702      
001651          04 A02-R01-INDENVCTD     PIC  9(02)       COMP.         007706      
001652          04 A02-R01-P-CTO-ORI     PIC  9(04)       COMP.         007708      
001653          04 A02-R01-I-CTO-ORI     PIC  9(04)       COMP.         007710      
001654          04 A02-R01-M-CTO-ORI     PIC  9(02)       COMP.         007712      
001655          04 A02-R01-C-TAR-ORI     PIC  9(16)       COMP.         007714      
001656          04 A02-R01-FILS500       PIC  X(21).                    007716      
001657                                                                  007800      
001658       03 A02-R01-S408             REDEFINES A02-R01-FILXAPL.     007900      
001659*         04 A02-R01-FECVEN        PIC  9(06)       COMP.         008000      
001660*INICIA CODIGO DE RENOVACION CRONOS 2000                          008001      
001661          04 A02-R01-FECVEN        PIC  9(08)       COMP.         008002      
001662*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008003      
001663          04 A02-R01-TASINT        PIC  9(04)V9(04) COMP.         008100      
001664          04 A02-R01-DIASBG        PIC  9(04)       COMP.         008200      
001665          04 A02-R01-LINEA         PIC  9(04)       COMP.         008300      
001666          04 A02-R01-FOLIO         PIC  9(04)       COMP.         008400      
001667          04 A02-R01-FILS408       PIC  X(06).                    008500      
001668*INICIA CODIGO DE RENOVACION CRONOS 2000                          008501      
001669          04 FILLER                PIC  X(35).                    008502      
001670*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008503      
001671                                                                  008600      
001672    02 A02-R00-TRA-SAL             REDEFINES A02-R00-FILGRAL.     008700      
001673       03 A02-R02-TRA-TOTREG       PIC  9(08)       COMP.         008800      
001674       03 A02-R02-TRA-TOTCON       PIC  9(08)       COMP.         008900      
001675       03 A02-R02-TRA-IMPT         PIC S9(15)V99    COMP.         009000      
001676*      03 FILLER                   PIC  X(162).                   009100      
001677*INICIA CODIGO DE RENOVACION CRONOS 2000                          009101      
001678       03 FILLER                   PIC  X(372).                   009102      
001679*TERMINA CODIGO DE RENOVACION CRONOS 2000                         009103      
001680                                                                  009200      
001681                                                                  009300      
001682*=================================================================009400      
001683*====             DESCRIPCION DE CAMPOS                        ===009500      
001684*=================================================================009600      
001685                                                                  009700      
001686*=A02-R00-TIPO-REG     : 00 = HEADER                              009800      
001687*                        80 = INICIO                              009900      
001688*                        81 = REGISTRO DE SALDOS                  010000      
001689*                        82 = FIN                                 010100      
001690*                        99 = TRAILER                             010200      
001691                                                                  010300      
001692*=================================================================010400      
001693*===                REGISTRO HEADER                            ===010500      
001694*=================================================================010600      
001695                                                                  010700      
001696*=A02-R00-HDR-SISTEMA  : NUMERO DE SISTEMA EJ. 0500               010800      
001697*=A02-R00-HDR-PRODUCTO : NUMERO DE PRODUCTO EJ. 0066              010900      
001698*=A02-R00-HDR-FECHA    : FECHA CONTABLE DE LA APLICACION ORIGEN   011000      
001699                                                                  011100      
001700*=================================================================011200      
001701*===                   REGISTRO DE SALDOS                      ===011300      
001702*=================================================================011400      
001703                                                                  011500      
001704*=A02-R01-SIS          : NUMERO DE SISTEMA     EJ. 0500           011600      
001705*=A02-R01-PRD          : NUMERO DE PRODUCTO    EJ. 0066           011700      
001706*=A02-R01-INS          : NUMERO DE INSTRUMENTO EJ. 0006.          011800      
001707*=A02-R01-CTA          : NUMERO DE CUENTA/CONTRATO                011900      
001708*=A02-R01-EDOCTA       : 00 = NADA MAS ES REGISTRO DE SALDOS      012000      
001709*                        01 = ACTIVOS Y SE GENERA EDO. CTA.       012100      
001710*                        02 = CANCELADOS EN EL MES Y SE GENERA    012200      
001711*                             EDO CTA                             012300      
001712*                        03 = INACTIVOS Y SE GENERA EDO CTA       012400      
001713*                        04 = INACTIVOS Y NO SE GENERA EDO CTA    012500      
001714*=A02-R01-FECPRO       : FECHA CONTABLE DE LA APLICACION          012600      
001715*                        FORMATO AAMMDD                           012700      
001716*=A02-R01-FECINI       : FECHA INICIO DE CICLO PARA CORTE FORMATO 012800      
001717*                        AAMMDD (CAMPO OBLIGATORIO SI             012900      
001718*                        A02-R01-EDOCTA ES MAYOR A CERO)          013000      
001719*=A02-R01-FECFIN       : FECHA FINAL DE CICLO PARA CORTE FORMATO  013100      
001720*                        AAMMDD (CAMPO OBLIGATORIO SI             013200      
001721*                        A02-R01-EDOCTA ES MAYOR A CERO)          013300      
001722*=A02-R01-STATUS       : 00 = ULTIMO REGISTRO DE SALDOS POR       013400      
001723*                             CONTRATO                            013500      
001724*                        01 = SIGUIENTE REGISTRO PERTENECE AL     013600      
001725*                         CONTRATO DE ESTE REGISTRO.              013700      
001726*=A02-R01-CVESDO       : NUMERO DE CONCEPTO DE SALDOS             013800      
001727*                        EJ. 0002 (SALDO ACTUAL)                  013900      
001728*=A02-R01-IMPT         : IMPORTE DEL CONCEPTO DE SALDO            014000      
001729                                                                  014100      
001730*=================================================================014200      
001731*==                FILLER POR APLICACION                       ===014300      
001732*=================================================================014400      
001733                                                                  014500      
001734                                                                  014600      
001735                                                                  014700      
001736                                                                  014800      
001737*=================================================================014900      
001738*==                    SISTEMA S500                            ===015000      
001739*=================================================================015100      
001740                                                                  015200      
001741*=A02-R01-DIASCICLO    : DIAS EN EL CICLO DE CORTE                015300      
001742*=A02-R01-DIASANO      : DIAS EN EL A\O                           015400      
001743*=A02-R01-TASRENET     : TASA DE RENDIMIENTO NETA                 015500      
001744*=A02-R01-TASREBRU     : TASA DE RENDIMIENTO BRUTA                015600      
001745*=A02-R01-TASREANO     : TASA DE RENDIMIENTO NETA EN EL A\O       015700      
001746*=A02-R01-STATION      : IDENTIFICADOR PARA BANCA ELECTRONICA     015800      
001747*=A02-R01-CTACON       : 00 = SUCURSAL 870                        015900      
001748*                        01 = CUENTA CONCENTRADORA                016000      
001749*=A02-R01-MONEDA       : TIPO DE MONEDA                           016010      
001750*=A02-R01-GENEDOCTA    : VALOR PARA GENERACION ESTADO DE CTA      016020      
001751*=A02-R01-INDENVCTD    : VALOR DE INDICADOR DE ENVIO CITIDIRECT   016030      
001752*=A02-R01-P-CTO-ORI    : PROD DEL CTO ORIGINAL SE TRASP BENEF     016040      
001753*=A02-R01-I-CTO-ORI    : INST DEL CTO ORIGINAL SE TRASP BENEF     016050      
001754*=A02-R01-M-CTO-ORI    : MONE DEL CTO ORIGINAL SE TRASP BENEF     016060      
001755*=A02-R01-C-TAR-ORI    : CTO  TARJETA ORIGINAL SE TRASP BENEF     016070      
001756*=A02-R01-FILS500      : FILLER PARA USO FUTURO                   016100      
001757                                                                  016200      
001758*=================================================================016300      
001759*==                    SISTEMA S408                            ===016400      
001760*=================================================================016500      
001761                                                                  016600      
001762*=A02-R01-FECVEN       : FECHA DE VENCIMIENTO DE LA LINEA         016700      
001763*=A02-R01-TASINT       : TASA DE INTERES                          016800      
001764*=A02-R01-DIASBG       : DIAS DE SOBREGIRO                        016900      
001765*=A02-R01-LINEA        : NUMERO DE LINEA                          017000      
001766*=A02-R01-FOLIO        : NUMERO DE FOLIO                          017100      
001767*=A02-R01-FILS408      : FILLER PARA USO FUTURO                   017200      
001768                                                                  017300      
001769*=================================================================017400      
001770*==                   REGISTRO TRAILER                         ===017500      
001771*=================================================================017600      
001772                                                                  017700      
001773*=A02-R02-TRA-TOTREG : TOTAL DE REGISTROS SIN INCLUIR HEADER Y    017800      
001774*                      TRAILER.                                   017900      
001775*=A02-R02-TRA-TOTCON : TOTAL DE CONTRATOS                         018000      
001776*=A02-R02-TRA-IMPT   : SUMA DE TODOS LOS IMPORTES DE LOS CONCEPTOS018100      
001777*                      DE SALDOS.                                 018200      
001778                                                                  018300      
001779*=================================================================018400      
001780*==             NOMBRE EXTERNO DE ARCHIVO                      ===018500      
001781*=================================================================018600      
001782                                                                  018700      
001783*=  (SXXX)S151/FILE/S050/SALDOSYYY/AAMMDD                         018800      
001784                                                                  018900      
001785* XXX   = NUMERO DEL USERCODE EJ. S500                            019000      
001786* YYY   = NUMERO DEL PRODUCTO EJ. S066                            019100      
001787* AAMMDD = FECHA CONTABLE DEL SISTEMA ORIGEN                      019200      
001788*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001789                                                                  025700      
001790****************************************************************  025800      
001791*    COPY DEL FORMATO DEL ARCHIVO AL SISTEMA S015              *  025900      
001792****************************************************************  026000      
001793                                                                  026100      
001794*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001795*  COPY "S151/FORMATO/ARCHIVO/S015.".                             026200      
001796                                                                  001015      
001797*=================================================================002015      
001798*==       REGISTRO DEL ARCHIVO DE INTERFASE PARA S015           ==003015      
001799*=================================================================004015      
001800 01 A00-R00-HDR-S015.                                             005015      
001801    02 A00-R00-S015-SISORI         PIC X(04)   VALUE "S001".      006015      
001802    02 A00-R00-S015-FCH            PIC 9(06).                     007015      
001803    02 A00-R00-S015-FCH-R         REDEFINES A00-R00-S015-FCH.     008015      
001804       03 A00-R00-S015-AA-REAL     PIC 9(02).                     009015      
001805       03 A00-R00-S015-MM-REAL     PIC 9(02).                     010015      
001806       03 A00-R00-S015-DD-REAL     PIC 9(02).                     011015      
001807    02 A00-R00-S015-TIPFORMAT      PIC 9(02)   VALUE 02.          012015      
001808    02 A00-R00-TIPOCORRIDA         PIC 9(02).                     013015      
001809    02 FILLER                      PIC X(132).                    013115      
001810*                                                                 014015      
001811 01 A00-R01-S015-REGMOV.                                          015015      
001812    02 A00-R01-S015-TIPREG         PIC  9(02)    COMP VALUE 1.    016015      
001813    02 A00-R01-S015-NUMSTA         PIC  9(04)    COMP.            017015      
001814    02 A00-R01-S015-SUCPRO         PIC  9(04)    COMP.            018015      
001815    02 A00-R01-S015-CNT            PIC  9(12)    COMP.            019015      
001816    02 A00-R01-S015-MDA            PIC  9(02)    COMP.            019115      
001817    02 A00-R01-S015-SUCMDA         PIC  9(04)    COMP.            019215      
001818    02 A00-R01-S015-CNTMDA         PIC  9(16)    COMP.            019315      
001819    02 A00-R01-S015-CVETRA         PIC  9(04)    COMP.            020015      
001820    02 A00-R01-S015-REF            PIC  9(16)    COMP.            021015      
001821    02 A00-R01-S015-IMP            PIC S9(13)V99 COMP.            022015      
001822    02 A00-R01-S015-SUCTRA         PIC  9(04)    COMP.            023015      
001823    02 A00-R01-S015-CAJTRA         PIC  9(04)    COMP.            024015      
001824    02 A00-R01-S015-AUTAPL         PIC  9(08)    COMP.            024115      
001825    02 A00-R01-S015-FECMOV         PIC  9(06)    COMP.            025015      
001826    02 A00-R01-S015-FECMOV-R       REDEFINES A00-R01-S015-FECMOV. 026015      
001827       03 A00-R01-S015-FECMOV-AA   PIC  9(02)     COMP.           027015      
001828       03 A00-R01-S015-FECMOV-MM   PIC  9(02)     COMP.           028015      
001829       03 A00-R01-S015-FECMOV-DD   PIC  9(02)     COMP.           029015      
001830    02 A00-R01-S015-MOVALFA        PIC  X(01).                    030015      
001831    02 A00-R01-S015-MOVNUM         PIC  9(02)     COMP.           031015      
001832    02 A00-R01-S015-CTACON         PIC  9(02)     COMP.           032015      
001833    02 A00-R01-S015-LEYENDA        PIC  X(40).                    033015      
001834* IBM <INICIO> JGVD - CAMPOS NUEVOS, NOMBRE ORD, BANCO EMISOR     033025      
001835    02 A00-R01-S015-NOMORD         PIC  X(30).                    033035      
001836    02 A00-R01-S015-BCOEMI         PIC  X(20).                    033045      
001837* IBM <FIN>    JGVD - CAMPOS NUEVOS, NOMBRE ORD, BANCO EMISOR     033055      
001838*INICIO CJMG CAMBIO TESOFE 2019                                   033105      
001839*    02 FILLER                      PIC  X(02).                   033115      
001840    02 A00-R01-S015-USO-CTA        PIC  9(02)     COMP.           034115      
001841    02 FILLER                      PIC  X(01).                    035115      
001842*FIN CJMG CAMBIO TESOFE 2019                                      036115      
001843*                                                                 037015      
001844 01 A00-R02-S015-SDOS.                                            038015      
001845     02 A00-R02-S015-TIPREG        PIC  9(02)    COMP VALUE 2.    039015      
001846     02 A00-R02-S015-NUMSTA        PIC  9(04)    COMP.            040015      
001847     02 A00-R02-S015-SUCPRO        PIC  9(04)    COMP.            041015      
001848     02 A00-R02-S015-CNT           PIC  9(16)    COMP.            042015      
001849     02 A00-R02-S015-PRD           PIC  9(04)    COMP.            043015      
001850     02 A00-R02-S015-INS           PIC  9(04)    COMP.            043115      
001851     02 A00-R02-S015-SDOACT        PIC S9(13)V99 COMP.            044015      
001852     02 A00-R02-S015-REGSDO        PIC  9(02)    COMP VALUE 4.    046015      
001853     02 A00-R02-S015-CTACON        PIC  9(02)    COMP.            047015      
001854     02 FILLER                     PIC  X(119).                   049015      
001855*                                                                 050015      
001856 01 A00-R03-TRAILER-S015.                                         051015      
001857     02 A00-R03-S015-CVEREG        PIC  9(02)    COMP VALUE 99.   052015      
001858     02 A00-R03-S015-TOTREG        PIC  9(10)    COMP.            054015      
001859     02 A00-R03-S015-TOTCARABO     PIC S9(15)V99 COMP.            055015      
001860     02 FILLER                     PIC  X(131).                   056015      
001861*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001862                                                                  026300      
001863****************************************************************  026400      
001864*    VARIABLES PARA MANEJO DEL CHVV Y EVITAR SU ENVIO AL S015  *  026500      
001865****************************************************************  026600      
001866                                                                  027500      
001867/                                                                 027600      
001868******************************************************************027700      
001869*           COPY DEL FORMATO PARA LIBRERIA DE CONTROL            *027800      
001870******************************************************************027900      
001871*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001872*     COPY                                                        028000      
001873*     "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".          028100      
001874*================================================================ 000100      
001875*         ENTRY-POINT CONSISDIA :                               = 000200      
001876*                                                                 000300      
001877* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
001878* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
001879* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
001880* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
001881* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
001882* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
001883* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
001884* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
001885* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
001886* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
001887*                                                               = 001400      
001888*================================================================ 001500      
001889                                                                  001600      
001890                                                                  001700      
001891*================================================================ 001800      
001892* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
001893*                                                               = 002000      
001894* ENTRADA REQUERIDA :                                           = 002100      
001895*                                                               = 002200      
001896*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
001897*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
001898*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
001899*================================================================ 002600      
001900 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
001901    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
001902    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
001903    03 WKS-B01-CSI                 PIC 9(02).                     003000      
001904    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
001905    03 WKS-B01-FECCON              PIC 9(08).                     003202      
001906    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
001907    03 WKS-B01-STAREG              PIC 9(02).                     003400      
001908    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
001909    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
001910    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
001911    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
001912    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
001913    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
001914    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
001915    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
001916    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
001917    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
001918    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
001919    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
001920    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
001921       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
001922       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
001923       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
001924       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
001925*==============================================================   005200      
001926*                                                             =   005300      
001927* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
001928*                                                             =   005500      
001929* CAMPOS REQUERIDOS :                                         =   005600      
001930*                                                             =   005700      
001931* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
001932* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
001933* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
001934* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
001935*==============================================================   006200      
001936 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
001937    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
001938    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
001939    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
001940    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
001941                                                                  006800      
001942*==============================================================   006900      
001943*                                                             =   007000      
001944* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
001945*                                                             =   007200      
001946* CAMPOS REQUERIDOS :                                         =   007300      
001947*                                                             =   007400      
001948* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
001949* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
001950* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
001951* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
001952*==============================================================   007900      
001953 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
001954    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
001955    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
001956    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
001957    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
001958                                                                  008500      
001959*==============================================================   008600      
001960*                                                             =   008700      
001961* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
001962*                                                             =   008900      
001963* CAMPOS REQUERIDOS :                                         =   009000      
001964*                                                             =   009100      
001965* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
001966* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
001967* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
001968* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
001969*==============================================================   009600      
001970 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
001971    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
001972    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
001973    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
001974    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
001975                                                                  010200      
001976*============================================================     010300      
001977* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
001978*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
001979*                                                           =     010600      
001980*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
001981*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
001982*                                                           =     010900      
001983*  ENTRADA REQUERIDA.                                       =     011000      
001984*                                                           =     011100      
001985*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
001986*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
001987*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
001988*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
001989*============================================================     011600      
001990                                                                  011700      
001991 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
001992     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
001993     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
001994     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
001995     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
001996                                                                  012300      
001997*=============================================================    012400      
001998*                                                            =    012500      
001999* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
002000*             B01-SIS-FECARMOV.                              =    012700      
002001*                                                            =    012800      
002002* ENTRADA REQUERIDAD :                                       =    012900      
002003*                                                            =    013000      
002004*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
002005*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
002006*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
002007*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
002008*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
002009*=============================================================    013600      
002010                                                                  013700      
002011 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
002012     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
002013     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
002014     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
002015     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
002016     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
002017*================================================================ 014400      
002018*                                                               = 014500      
002019* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
002020*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
002021*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
002022*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
002023*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
002024*                                                               = 015100      
002025* ENTRADA REQUERIDA :                                           = 015200      
002026*                                                               = 015300      
002027* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
002028* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
002029* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
002030* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
002031* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
002032*================================================================ 015900      
002033 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
002034    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
002035    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
002036    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
002037    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
002038    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
002039                                                                  016600      
002040*============================================================     016700      
002041*                                                           =     016800      
002042* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
002043*                                                           =     017000      
002044* DATOS REQUERIDOS :                                        =     017100      
002045*                                                           =     017200      
002046* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
002047* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
002048* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
002049* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
002050* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
002051*============================================================     017800      
002052                                                                  017900      
002053 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
002054     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
002055     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
002056     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
002057     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
002058     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
002059                                                                  018600      
002060*============================================================     018700      
002061*                                                           =     018800      
002062* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
002063*                                                           =     019000      
002064* DATOS REQUERIDOS :                                        =     019100      
002065*                                                           =     019200      
002066* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
002067* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
002068* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
002069* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
002070* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
002071*============================================================     019800      
002072                                                                  019900      
002073 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
002074     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
002075     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
002076     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
002077     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
002078     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
002079                                                                  020600      
002080*===============================================================  020700      
002081*                                                              =  020800      
002082* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
002083*              MOVIMIENTOS.                                    =  021000      
002084* DATOS REQUERIDOS :                                           =  021100      
002085*                                                              =  021200      
002086* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
002087* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
002088* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
002089* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
002090* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
002091* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
002092*==============================================================   021900      
002093                                                                  022000      
002094 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
002095     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
002096     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
002097     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
002098     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
002099     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
002100     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
002101*==============================================================   022800      
002102*                                                             =   022900      
002103* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
002104*                                                             =   023100      
002105* CAMPOS REQUERIDOS :                                         =   023200      
002106*                                                             =   023300      
002107* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
002108* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
002109* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
002110* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
002111*==============================================================   023800      
002112 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
002113    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
002114    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
002115    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
002116    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
002117                                                                  024304      
002118*=================================================================024306      
002119*                ENTRY POINT CONSISB01                           =024308      
002120*                                                                =024310      
002121*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
002122*                                                                =024314      
002123*  FUNCIONES DISPONIBLES :                                       =024316      
002124*                                                                =024318      
002125*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
002126*                                                                =024322      
002127*  PARAMETROS REQUERIDOS                                         =024324      
002128*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
002129*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
002130*=================================================================024330      
002131                                                                  024332      
002132 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
002133     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
002134     03 WKS-CON-CSI                PIC 9(02).                     024336      
002135     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
002136     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
002137        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
002138        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
002139        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
002140        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
002141        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
002142                                                                  024400      
002143*=================================================================024500      
002144*                ENTRY POINT B02ARCINTER                         =024600      
002145*                                                                =024700      
002146*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
002147*                                                                =024900      
002148*  FUNCIONES DISPONIBLES :                                       =025000      
002149*                                                                =025100      
002150*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
002151* 19.- ALTAS DE ARCHIVOS.                                        =025300      
002152* 22.- BAJAS DE ARCHIVOS.                                        =025400      
002153* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
002154*                                                                =025600      
002155*  PARAMETROS REQUERIDOS                                         =025700      
002156*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
002157*                                                                =025900      
002158*=================================================================026000      
002159 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
002160     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
002161     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
002162     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
002163     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
002164     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
002165     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
002166     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
002167     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
002168     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
002169     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
002170     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
002171     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
002172     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
002173     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
002174     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
002175     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
002176     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
002177     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
002178     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
002179     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
002180     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
002181     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
002182     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
002183     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
002184     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
002185     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
002186     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
002187     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
002188                                                                  029000      
002189*=================================================================029100      
002190*                ENTRY POINT B04SISTEMA                          =029200      
002191*                                                                =029300      
002192*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
002193*                                                                =029500      
002194*  FUNCIONES DISPONIBLES :                                       =029600      
002195*                                                                =029700      
002196*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
002197*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
002198*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
002199*                                                                =030100      
002200*  PARAMETROS REQUERIDOS                                         =030200      
002201*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
002202*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
002203*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
002204*                                                                =030600      
002205*=================================================================030700      
002206 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
002207     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
002208     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
002209     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
002210     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
002211     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
002212     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
002213     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
002214                                                                  031600      
002215*================================================================ 031700      
002216*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
002217*                                                               = 031900      
002218*  FUNCION                                                      = 032000      
002219*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
002220*   19       ALTAS.                                             = 032200      
002221*   22       BAJAS                                              = 032300      
002222*   37       CAMBIOS.                                           = 032400      
002223*                                                               = 032500      
002224*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
002225*                      FECHA DE PROCESO                         = 032700      
002226*                      NUMERO DE PROCESO                        = 032800      
002227*                      FECHA INICIO                             = 032900      
002228*                      REGISTRO INICIAL                         = 033000      
002229*================================================================ 033100      
002230                                                                  033200      
002231 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
002232     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
002233     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
002234     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
002235     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
002236     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
002237     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
002238     03 WKS-B05-MIX                PIC 9(08).                     034000      
002239     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
002240     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
002241     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
002242     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
002243     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
002244     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
002245                                                                  034700      
002246                                                                  034800      
002247*================================================================ 034900      
002248*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
002249*                                                               = 035100      
002250*  FUNCION                                                      = 035200      
002251*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
002252*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
002253*                                                               = 035500      
002254*================================================================ 035600      
002255                                                                  035700      
002256 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
002257     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
002258     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
002259     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
002260     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
002261     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
002262     03 WKS-B09-NOMREN             PIC X(15).                     036400      
002263                                                                  036500      
002264*===============================================================  036600      
002265*                                                              =  036700      
002266*         ENTRY-POINT CONSISMEN                                =  036800      
002267*                                                              =  036900      
002268*   DATOS REQUERIDOS : FUNCION                                 =  037000      
002269*                      SISTEMA                                 =  037100      
002270*                                                              =  037200      
002271*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
002272*                                                              =  037400      
002273*===============================================================  037500      
002274 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
002275     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
002276     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
002277     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
002278     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
002279     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
002280     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
002281     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
002282     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
002283     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
002284     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
002285     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
002286     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
002287     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
002288     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
002289     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
002290        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
002291        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
002292        05 WKS-B03-AAMM            PIC 9(06).                     039402      
002293        05 WKS-B03-SECOK           PIC 9(10).                     039500      
002294        05 WKS-B03-SECINF          PIC 9(10).                     039600      
002295        05 WKS-B03-SECERR          PIC 9(10).                     039700      
002296        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
002297                                                                  039900      
002298*=====================================================            040000      
002299*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
002300*=====================================================            040200      
002301 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
002302     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
002303     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
002304     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
002305                                                                  040700      
002306*=====================================================            040800      
002307*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
002308*=====================================================            041000      
002309 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
002310     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
002311     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
002312     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
002313                                                                  041500      
002314*=====================================================            041600      
002315*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
002316*=====================================================            041800      
002317 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
002318     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
002319     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
002320     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
002321*=====================================================            042300      
002322*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
002323*=====================================================            042500      
002324 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
002325     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
002326     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
002327     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
002328                                                                  043000      
002329*=====================================================            043100      
002330*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
002331*=====================================================            043300      
002332 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
002333     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
002334     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
002335     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
002336                                                                  043800      
002337*=====================================================            043900      
002338*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
002339*=====================================================            044100      
002340 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
002341     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
002342     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
002343     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
002344                                                                  044600      
002345*=====================================================            044700      
002346*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
002347*=====================================================            044900      
002348 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
002349     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
002350     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
002351     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
002352                                                                  045400      
002353*=====================================================            045500      
002354*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
002355*=====================================================            045700      
002356 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
002357     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
002358     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
002359     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
002360                                                                  046200      
002361*=====================================================            046300      
002362*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
002363*=====================================================            046500      
002364 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
002365     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
002366     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
002367     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
002368                                                                  047000      
002369*=====================================================            047100      
002370*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
002371*=====================================================            047300      
002372 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
002373     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
002374     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
002375     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
002376                                                                  047800      
002377*=====================================================            047900      
002378*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
002379*=====================================================            048100      
002380 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
002381     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
002382     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
002383     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
002384                                                                  048600      
002385*=====================================================            048700      
002386*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
002387*=====================================================            048900      
002388 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
002389     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
002390     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
002391     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
002392                                                                  049400      
002393*=====================================================            049500      
002394*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
002395*=====================================================            049700      
002396 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
002397     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
002398     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
002399     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
002400     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
002401     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
002402     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
002403     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
002404     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
002405     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
002406     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
002407                                                                  050900      
002408*=====================================================            051000      
002409*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
002410*=====================================================            051200      
002411 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
002412     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
002413     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
002414     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
002415     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
002416                                                                  051800      
002417*=====================================================            051900      
002418*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
002419*=====================================================            052100      
002420 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
002421     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
002422     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
002423     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
002424     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
002425                                                                  052700      
002426*=====================================================            052800      
002427*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
002428*=====================================================            053000      
002429 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
002430     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
002431     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
002432     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
002433     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
002434                                                                  053600      
002435*=====================================================            053700      
002436*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
002437*=====================================================            053900      
002438 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
002439     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
002440     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
002441     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
002442     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
002443                                                                  054500      
002444*=====================================================            054600      
002445*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
002446*=====================================================            054800      
002447 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
002448     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
002449     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
002450     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
002451     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
002452                                                                  055400      
002453*=====================================================            055500      
002454*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
002455*=====================================================            055700      
002456 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
002457     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
002458     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
002459     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
002460     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
002461                                                                  056300      
002462*=====================================================            056400      
002463*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
002464*=====================================================            056600      
002465 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
002466     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
002467     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
002468     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
002469     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
002470                                                                  057200      
002471 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
002472*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002473**** Inicia cambio Fabrica de software **** Abarbosa       P05-355028200      
002474*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002475* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP001 ON CMEMP."         028210      
002476*                                      FROM 000100 TO 099999      028220      
002477                                                                  000100      
002478*----------------------------------------------------------------*000200      
002479*     VARIABLES PARA EL CALCULO DINAMICO DE ESPACIO PARA SORT    *000300      
002480*----------------------------------------------------------------*000400      
002481 77  W77-FRAMESIZE                PIC  9(002) COMP.               000500      
002482 77  W77-LASTRECORD               PIC  9(012) COMP.               000600      
002483 77  W77-MAXRECSIZE               PIC  9(012) COMP.               000700      
002484 77  W77-DISK-SIZE                PIC  9(018) COMP.               000800      
002485 77  W77-MEMORY-SIZE              PIC  9(018) COMP.               000900      
002486                                                                  001000      
002487 01  WS-CALC-WORD                 PIC  9(012)V99.                 001100      
002488 01  WS-CALC-WORD-RED   REDEFINES WS-CALC-WORD.                   001200      
002489     02 WS-WORD-ENT               PIC  9(012).                    001300      
002490     02 WS-WORD-RES               PIC  9(002).                    001400      
002491                                                                  001500      
002492*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002493**** Fin    cambio Fabrica de software **** Abarbosa       P05-355028221      
002494 01 WKS-ERRORES.                                                  028300      
002495    03 WKS-ER01 PIC X(31) VALUE "SISTEMA NO HABILITADO EN S151  ".028400      
002496    03 WKS-ER02 PIC X(31) VALUE "FUNCION NO VALIDA              ".028500      
002497    03 WKS-ER03 PIC X(31) VALUE "TRANSACCION NO CATALOGADA      ".028600      
002498    03 WKS-ER04 PIC X(31) VALUE "FECHA CONTABLE NO VALIDA       ".028700      
002499    03 WKS-ER05 PIC X(31) VALUE "FALTA LA SUCURSAL PROMOTORA    ".028800      
002500    03 WKS-ER06 PIC X(31) VALUE "FALTA LA SUCURSAL OPERADORA    ".028900      
002501    03 WKS-ER07 PIC X(31) VALUE "EL IMPORTE ES 0                ".029000      
002502    03 WKS-ER08 PIC X(31) VALUE "FALTA REF S151 PARA ELIMINAR   ".029100      
002503    03 WKS-ER09 PIC X(31) VALUE "MOVIMINETO A ELIMINAR NO EXISTE".029200      
002504    03 WKS-ER10 PIC X(31) VALUE "ORIGEN ERRONEO                 ".029300      
002505    03 WKS-ER11 PIC X(31) VALUE "ELIMINANDO A REG DE ELIMINACION".029400      
002506 01 WKS-ERRORES-R REDEFINES WKS-ERRORES.                          029500      
002507    03 WKS-ERROR PIC X(31) OCCURS 11 TIMES.                       029600      
002508 77 WKS-151-RESULT            PIC S9(11) BINARY.                  029700      
002509****************************************************************  029800      
002510*             VARIABLES PARA EL MANEJO DE CORTES               *  029900      
002511****************************************************************  030000      
002512 77  I                                 PIC 9(4)   COMP.           030100      
002513 77  J                                 PIC 9(4)   COMP.           030200      
002514 77  K                                 PIC 9(4)   COMP.           030300      
002515 77  L                                 PIC 9(4)   COMP.           030400      
002516 77  W77-SIS-ENT                       PIC 9(4)   COMP.           030500      
002517 77  WKS-151-CSI                       PIC 9(2)  COMP.            030600      
002518*  77  WKS-151-FECPROC                   PIC 9(6)  COMP.          030700      
002519*INICIA CODIGO DE RENOVACION CRONOS 2000                          030800      
002520 77 WKS-151-FECPROC                    PIC 9(08)  COMP.           030900      
002521*TERMINA CODIGO DE RENOVACION CRONOS 2000                         031000      
002522 77  M                                 PIC 9(4)   COMP.           031100      
002523 77   X                                PIC 9(4)   COMP.           031200      
002524 77   Y                                PIC 9(4)   COMP.           031300      
002525 77   Z                                PIC 9(4)   COMP.           031400      
002526*INICIA CJMG CAMBIO TESOFE 2019                                   031420      
002527 77 W77-REG-02                         PIC 9(10).                 031440      
002528 77 W77-REGISTRO                       PIC 9(08).                 031460      
002529*FIN CJMG CAMBIO TESOFE 2019                                      031480      
002530                                                                  031500      
002531***************************************************************** 031600      
002532*       VARIABLES PARA ALMACENAR LAS FECHAS Y TIEMPOS           * 031700      
002533***************************************************************** 031800      
002534 01  FECHAS.                                                      031900      
002535                                                                  032000      
002536     02  WKS-FECHA-ACTUAL-AMD.                                    032100      
002537*        03  WKS-AMO-ACTUAL-AMD        PIC 9(2).                  032200      
002538*INICIA CODIGO DE RENOVACION CRONOS 2000                          032300      
002539         03  WKS-AMO-ACTUAL-AMD        PIC 9(4).                  032400      
002540*TERMINA CODIGO DE RENOVACION CRONOS 2000                         032500      
002541         03  WKS-MES-ACTUAL-AMD        PIC 9(2).                  032600      
002542         03  WKS-DIA-ACTUAL-AMD        PIC 9(2).                  032700      
002543*                                                                 032800      
002544     02  WKS-FECHA-ACTUAL-DMA.                                    032900      
002545         03  WKS-DIA-ACTUAL-DMA        PIC 9(2).                  033000      
002546         03  WKS-MES-ACTUAL-DMA        PIC 9(2).                  033100      
002547*        03  WKS-AMO-ACTUAL-DMA        PIC 9(2).                  033200      
002548*INICIA CODIGO DE RENOVACION CRONOS 2000                          033300      
002549         03  WKS-AMO-ACTUAL-DMA        PIC 9(4).                  033400      
002550*TERMINA CODIGO DE RENOVACION CRONOS 2000                         033500      
002551*                                                                 033600      
002552     02  WKS-FECHA-TEMP.                                          033700      
002553         03  WKS-DIA-TEMP-DMA          PIC 9(2).                  033800      
002554         03  WKS-MES-TEMP-DMA          PIC 9(2).                  033900      
002555*        03  WKS-AMO-TEMP-DMA          PIC 9(2).                  034000      
002556*INICIA CODIGO DE RENOVACION CRONOS 2000                          034100      
002557         03  WKS-AMO-TEMP-DMA          PIC 9(4).                  034200      
002558*TERMINA CODIGO DE RENOVACION CRONOS 2000                         034300      
002559     02  WKS-FECHA-ACTUAL-MDA.                                    034400      
002560         03  WKS-MES-ACTUAL-MDA        PIC 9(2).                  034500      
002561         03  WKS-DIA-ACTUAL-MDA        PIC 9(2).                  034600      
002562*        03  WKS-AMO-ACTUAL-MDA        PIC 9(2).                  034700      
002563*INICIA CODIGO DE RENOVACION CRONOS 2000                          034800      
002564         03  WKS-AMO-ACTUAL-MDA        PIC 9(4).                  034900      
002565*TERMINA CODIGO DE RENOVACION CRONOS 2000                         035000      
002566                                                                  035100      
002567*      02  WKS-FECCONT                   PIC 9(06).               035200      
002568*INICIA CODIGO DE RENOVACION CRONOS 2000                          035300      
002569       02 WKS-FECCONT                    PIC 9(08).               035400      
002570*TERMINA CODIGO DE RENOVACION CRONOS 2000                         035500      
002571     02  WKS-FECCONT-R  REDEFINES   WKS-FECCONT.                  035600      
002572*        03  WKS-FC-AA                  PIC 9(02).                035700      
002573*INICIA CODIGO DE RENOVACION CRONOS 2000                          035800      
002574         03  WKS-FC-AA                  PIC 9(04).                035900      
002575*TERMINA CODIGO DE RENOVACION CRONOS 2000                         036000      
002576         03  WKS-FC-MM                  PIC 9(02).                036100      
002577         03  WKS-FC-DD                  PIC 9(02).                036200      
002578                                                                  036300      
002579     02  WKS-FORMATO-FECHA.                                       036400      
002580         03  WKS-FORM-DD                PIC 9(02).                036500      
002581         03  FILLER                     PIC X(01) VALUE "/".      036600      
002582         03  WKS-FORM-MM                PIC X(03).                036700      
002583         03  FILLER                     PIC X(01) VALUE "/".      036800      
002584*        03  WKS-FORM-AA                PIC 9(02).                036900      
002585*INICIA CODIGO DE RENOVACION CRONOS 2000                          037000      
002586         03  WKS-FORM-AA                PIC 9(04).                037100      
002587*TERMINA CODIGO DE RENOVACION CRONOS 2000                         037200      
002588*                                                                 037300      
002589 01  WKS-HORA-OPERACION                 PIC 9(6) COMP.            037400      
002590                                                                  037500      
002591 01  WKS-HORA-OPERACION-R  REDEFINES WKS-HORA-OPERACION.          037600      
002592     02  WKS-HH-OP                      PIC 9(2) COMP.            037700      
002593     02  WKS-MM-OP                      PIC 9(2) COMP.            037800      
002594     02  WKS-SS-OP                      PIC 9(2) COMP.            037900      
002595*                                                                 038000      
002596 01  WKS-HORA-HM-R.                                               038100      
002597     02  WKS-HORA-HH                    PIC 9(2) COMP.            038200      
002598     02  WKS-HORA-MM                    PIC 9(2) COMP.            038300      
002599     02  FILLER                        PIC 9(4) COMP.             038400      
002600*                                                                 038500      
002601 01  WKS-HORA-HM-RR REDEFINES WKS-HORA-HM-R.                      038600      
002602     02  WKS-HORA-HMS                  PIC 9(6) COMP.             038700      
002603     02  FILLER                        PIC 9(2) COMP.             038800      
002604*                                                                 038900      
002605 01  WKS-HORA-HMS-R REDEFINES WKS-HORA-HM-R.                      039000      
002606     02  WKS-HORA-HMS-HH               PIC 9(2) COMP.             039100      
002607     02  WKS-HORA-HMS-MM               PIC 9(2) COMP.             039200      
002608     02  WKS-HORA-HMS-SS               PIC 9(2) COMP.             039300      
002609     02  FILLER                        PIC 9(2) COMP.             039400      
002610 01  WKS-HORA-HM    REDEFINES WKS-HORA-HM-R   PIC 9(8) COMP.      039500      
002611****************************************************************  039600      
002612*             VARIABLES PARA LA LOCAL SUPPORT                  *  039700      
002613****************************************************************  039800      
002614 01  WKS-CODIGO-ESTRUCT                PIC 9(6).                  039900      
002615 01  WKS-CODIGO-ESTRUCT-R  REDEFINES WKS-CODIGO-ESTRUCT.          040000      
002616     03  WKS-LLAVE-ESTRUCT             PIC 9(4).                  040100      
002617     03  WKS-CLAVE-ESTRUCT             PIC 9(2).                  040200      
002618                                                                  040300      
002619 01  WKS-RESPUESTA-ESTRUCT.                                       040400      
002620     03  WKS-RESULTADO-ESTRUCT         PIC 9(1).                  040500      
002621     03  WKS-NOMBRE-SUC-ESTRUCT        PIC X(40).                 040600      
002622     03  FILLER                        PIC X(40).                 040700      
002623                                                                  040800      
002624 01  WKS-CSI-RESP-ESTRUCT.                                        040900      
002625     03  WKS-RESULT-CSI-ESTRUCT        PIC 9(1).                  041000      
002626     03  WKS-CSI-ESTRUCT               PIC 9(2).                  041100      
002627     03  FILLER                        PIC X(78).                 041200      
002628                                                                  041300      
002629 77  W77-FUNCION                       PIC S9(11) BINARY.         041400      
002630 77  W77-FORMATO                       PIC S9(11) BINARY.         041500      
002631                                                                  041600      
002632*  01  WKS-FECHA1                        PIC X(06).               041700      
002633*INICIA CODIGO DE RENOVACION CRONOS 2000                          041800      
002634 01 WKS-FECHA1                           PIC X(08).               041900      
002635*TERMINA CODIGO DE RENOVACION CRONOS 2000                         042000      
002636 01  WKS-FECHA1-RED   REDEFINES WKS-FECHA1.                       042100      
002637*    05  WKS-AMO1-RED                  PIC 9(02).                 042200      
002638*INICIA CODIGO DE RENOVACION CRONOS 2000                          042300      
002639     05  WKS-AMO1-RED                  PIC 9(04).                 042400      
002640*TERMINA CODIGO DE RENOVACION CRONOS 2000                         042500      
002641     05  WKS-MES1-RED                  PIC 9(02).                 042600      
002642     05  WKS-DIA1-RED                  PIC 9(02).                 042700      
002643*                                                                 042800      
002644*  01  WKS-FECHA2                        PIC X(06).               042900      
002645*INICIA CODIGO DE RENOVACION CRONOS 2000                          043000      
002646 01 WKS-FECHA2                           PIC X(08).               043100      
002647*TERMINA CODIGO DE RENOVACION CRONOS 2000                         043200      
002648*                                                                 043300      
002649 01  WKS-FECHA2-RED   REDEFINES WKS-FECHA2.                       043400      
002650*    05  WKS-AMO2-RED                  PIC 9(02).                 043500      
002651*INICIA CODIGO DE RENOVACION CRONOS 2000                          043600      
002652     05  WKS-AMO2-RED                  PIC 9(04).                 043700      
002653*TERMINA CODIGO DE RENOVACION CRONOS 2000                         043800      
002654     05  WKS-MES2-RED                  PIC 9(02).                 043900      
002655     05  WKS-DIA2-RED                  PIC 9(02).                 044000      
002656/                                                                 044100      
002657*                                                                 044200      
002658 01  CSI.                                                         044300      
002659     02  FILLER       PIC X(25) VALUE "XXXN O  E X I S T E  1   ".044400      
002660     02  FILLER       PIC X(25) VALUE "XXXN O  E X I S T E  2   ".044500      
002661     02  FILLER       PIC X(25) VALUE "XXXN O  E X I S T E  3   ".044600      
002662     02  FILLER       PIC X(25) VALUE "MONM O N T E R R E Y     ".044700      
002663     02  FILLER       PIC X(25) VALUE "XXXN O  E X I S T E  5   ".044800      
002664     02  FILLER       PIC X(25) VALUE "XXXN O  E X I S T E  6   ".044900      
002665     02  FILLER       PIC X(25) VALUE "XXXN O  E X I S T E  7   ".045000      
002666     02  FILLER       PIC X(25) VALUE "XXXN O  E X I S T E  8   ".045100      
002667     02  FILLER       PIC X(25) VALUE "XXXN O  E X I S T E  9   ".045200      
002668     02  FILLER       PIC X(25) VALUE "VDMB A N C O M A T I C O ".045300      
002669 01  TABLA-CSI REDEFINES CSI.                                     045400      
002670     02  TAB-CSI OCCURS 10 TIMES.                                 045500      
002671         03  WKS-NOMB-CSI              PIC X(03).                 045600      
002672         03  WKS-NOMB-LARGO-CSI        PIC X(22).                 045700      
002673**************************************************************    045800      
002674*          TABLA PARA LA TIPIFICACION DE TRANSACCIONES       *    045900      
002675**************************************************************    046000      
002676 01  WKS-CAMPO-INICIALIZACION.                                    046100      
002677     02  WKS-TRANS-INICIAL             PIC X(12).                 046200      
002678     02  WKS-NUM-TRANSACCION           PIC 9(04).                 046300      
002679                                                                  046400      
002680                                                                  046500      
002681 01  WKS-TABLA-TRANSAC.                                           046600      
002682     03  WKS-TAB-TRANSAC               OCCURS 6000 TIMES.         046700      
002683         05  WKS-TT-NUM-LEYEN          PIC 9(04) COMP.            046800      
002684         05  WKS-CON-CONTABLE          PIC 9(02) COMP.            046900      
002685         05  WKS-AS-EDOCTA             PIC 9(01) COMP.            047000      
002686         05  WKS-AS-APLSDO             PIC 9(01) COMP.            047100      
002687                                                                  047200      
002688 01  WKS-LEYENDAS-TRANSACCION1.                                   047300      
002689     03  WKS-LT-NOMBRE1                OCCURS 3000 TIMES.         047400      
002690         05  WKS-NOM-TRANSAC1          PIC X(20).                 047500      
002691                                                                  047600      
002692 01  WKS-LEYENDAS-TRANSACCION2.                                   047700      
002693     03  WKS-LT-NOMBRE2                OCCURS 3000 TIMES.         047800      
002694         05  WKS-NOM-TRANSAC2          PIC X(20).                 047900      
002695                                                                  048000      
002696****************************************************************  048100      
002697*                  VARIABLES MISCELANEAS                       *  048200      
002698****************************************************************  048300      
002699 01  WKS-R01-S015-LEYENDA              PIC X(40).                 048310      
002700 01  WKS-R01-S015-LEYENDAR             REDEFINES                  048320      
002701     WKS-R01-S015-LEYENDA.                                        048330      
002702     04 WKS-R01-S015-LEYENDA-A         PIC X(18).                 048340      
002703     04 WKS-R01-S015-LEYENDA-B         PIC X(22).                 048350      
002704 01  WKS-R01-S015-IMP-ED               PIC                        048360      
002705                                        -ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.   048370      
002706* MDP INICIA 16-02-2011                                           048371      
002707 01 WKS-A01-R01-REF1.                                             048372      
002708    03 WKS-R01-REF1        PIC X(10).                             048373      
002709    03 WKS-TAB-REF1 REDEFINES WKS-R01-REF1.                       048374      
002710       05 WKS-A01-R01-REF OCCURS 10 TIMES PIC X(01).              048375      
002711    03 FILLER              PIC X(20).                             048376      
002712 01 WKS-A01-R01-REFNUM-AUX             PIC X(10) JUST RIGHT.      048377      
002713 01 WKS-A01-R01-REFNUM-AUX-R REDEFINES WKS-A01-R01-REFNUM-AUX     048378      
002714                                       PIC 9(10).                 048379      
002715 01 WKS-REF-NONUM                      PIC 9(01).                 048380      
002716 01 WKS-I                              PIC 9(02).                 048381      
002717 01 WKS-A01-REF-35.                                               048382      
002718    03 WKS-A01-REF-PRI-10              PIC X(10).                 048383      
002719    03 WKS-A01-REF-LAS-25              PIC X(25).                 048384      
002720* MDP TERMINA 16-02-2011                                          048385      
002721                                                                  048386      
002722 77  W77-TAM-SORT                      PIC 9(10)V9999 COMP.       048400      
002723 77  W77-TAM-MODU                      PIC 9(10) COMP.            048500      
002724* INICIO CJPL LEY DE TRANSPARENCIA ISI                            048510      
002725 01 WKS-LEYENDA-TRANS.                                            048520      
002726    03  WKS-DESC-TRANS                 PIC X(13).                 048530      
002727    03  FILLER                         PIC X(01)   VALUE SPACES.  048540      
002728    03  WKS-NUM-ORD-S264               PIC 9(12).                 048550      
002729    03  FILLER                         PIC X(01)   VALUE SPACES.  048560      
002730    03  WKS-NOM-ORD                    PIC X(13).                 048570      
002731* FIN CJPL LEY DE TRANSPARENCIA ISI                               048580      
002732                                                                  048600      
002733***********************************************************       048700      
002734*       VARIABLES DE LECTURA DE LOG DEL S151              *       048800      
002735***********************************************************       048900      
002736 77  W77-LEYEN-ADIC                    PIC 9(01) COMP VALUE 0.    049000      
002737     88  W88-LEYEN-ADIC                VALUE 1.                   049100      
002738 77  W77-FINLOG                        PIC 9(01) COMP VALUE 0.    049200      
002739     88  W88-FINLOG                    VALUE 1.                   049300      
002740 77  W77-FINSDO                        PIC 9(01) COMP VALUE 0.    049400      
002741 77  W77-REGACT                        PIC 9(01) COMP VALUE 0.    049700      
002742     88  W88-REGACT                    VALUE 1.                   049800      
002743 77  W77-DESCRIP                       PIC 9(02)  VALUE 0.        049900      
002744     88  W88-DESCRIP                   VALUE 1.                   050000      
002745 77  W77-TIPOTRAN                      PIC 9(02) COMP VALUE 0.    050100      
002746     88  W88-VALIDO                    VALUE 1, 2, 3.             050200      
002747     88  W88-CARGOS                    VALUE 1.                   050300      
002748     88  W88-ABONOS                    VALUE 2.                   050400      
002749     88  W88-NOCONT                    VALUE 3.                   050500      
002750 77  W77-DAT-AD1                       PIC 9 VALUE 0.             050600      
002751     88 W88-DAT-AD1                    VALUE 1.                   050700      
002752 77  W77-NUM-REG                       PIC 9(08) VALUE 0.         051000      
002753 77  W77-CAMPO-DISPLAY                 PIC 9(06).                 051100      
002754*  77  W77-FECHA-AX                    PIC 9(06) VALUE 0.         051200      
002755*INICIA CODIGO DE RENOVACION CRONOS 2000                          051300      
002756 77 W77-FECHA-AX                       PIC 9(08) VALUE 0.         051400      
002757*TERMINA CODIGO DE RENOVACION CRONOS 2000                         051500      
002758 77  W77-LOG-AX                        PIC 9(01) VALUE 0.         051600      
002759 77  W77-BAN-NOLOG                     PIC 9(01) VALUE 0.         051700      
002760 77  W77-SW-ENCONTRE                   PIC 9(01) VALUE 0.         051800      
002761 77  W77-IND                           PIC 9(04) VALUE 0.         051900      
002762 77  W77-IND2                          PIC 9(04) VALUE 0.         052000      
002763 77  W77-IND3                          PIC 9(04) VALUE 0.         052100      
002764 77  W77-CTA-ANT                       PIC 9(20) VALUE 0.         052200      
002765 77  W77-TOT-REG                       PIC 9(10) COMP VALUE 0.    052300      
002766 77  W77-TOT-REG-CHEQ                  PIC 9(08) COMP VALUE 0.    052400      
002767 77  W77-TOT-IMP                       PIC S9(15)V99 COMP.        052500      
002768 77  W77-TOT-IMP-CHEQ                  PIC 9(16)V99 COMP.         052600      
002769 77  W77-PRODUCTOS                     PIC 9(04).                 052700      
002770     88 W88-PROD-S500                            VALUE 001,066,84.052800      
002771 77  W77-LOG-KEY                       PIC 9(08).                 052900      
002772 77  W77-SUC                           PIC 9(04) VALUE 0.         053000      
002773 77  W77-CVETRAN                       PIC 9(04) VALUE 0.         053100      
002774 77  W77-SCVETRAN                      PIC 9(02) VALUE 0.         053200      
002775 77  W77-CVE-CAT                       PIC 9(04) VALUE 0.         053300      
002776 77  W77-IND-S408                      PIC 9(04) VALUE 0.         053400      
002777 77  W77-DIR-TEMP                      PIC 9(04) VALUE 0.         053500      
002778*  77  W77-FECHA-PROY                    PIC 9(06) VALUE 0.       053600      
002779*INICIA CODIGO DE RENOVACION CRONOS 2000                          053700      
002780 77 W77-FECHA-PROY                     PIC 9(08) VALUE 0.         053800      
002781*TERMINA CODIGO DE RENOVACION CRONOS 2000                         053900      
002782 77  DIS-AUT-S151                      PIC 9(08).                 054100      
002783*77  WKS-VALUE                         PIC 9(06) VALUE 0.         054200      
002784*INICIA CODIGO DE RENOVACION CRONOS 2000                          054300      
002785 77  WKS-VALUE                         PIC 9(08) VALUE 0.         054400      
002786*TERMINA CODIGO DE RENOVACION CRONOS 2000                         054500      
002787 77  DIS-CVETRAN1                      PIC 9(04).                 054600      
002788 01  WKS-TABLA-CLAVES.                                            054700      
002789     03  WKS-TBL-CLAVES      OCCURS  5 TIMES.                     054800      
002790         05 WKS-TAB-CVE                PIC 9(04).                 054900      
002791         05 WKS-TAB-IMP                PIC 9(14)V99.              055000      
002792                                                                  055100      
002793 01 W77-SIST-PARAM                     PIC 9(05).                 055200      
002794 01 WKS-SIST-PARAM                     PIC 9(05).                 055300      
002795 01 WKS-SIST-PARAM-R      REDEFINES WKS-SIST-PARAM.               055400      
002796    03  WKS-PROCESO-PARAM              PIC 9(02).                 055500      
002797    03  W77-SISTEMA-PARAMETRO          PIC 9(03).                 055600      
002798                                                                  055700      
002799 77 WS-VALUE                              PIC 9(06) VALUE 0.      055800      
002800                                                                  055900      
002801 01  WKS-TABLA-ESTRUCTURA.                                        056000      
002802     03  WKS-TBL-ESTRUCTURA  OCCURS  5000 TIMES.                  056100      
002803         05  WKS-TAB-NOD-SUB           PIC 9(04) COMP.            056200      
002804         05  WKS-TAB-NOD-SUB-R REDEFINES WKS-TAB-NOD-SUB.         056300      
002805             07  WKS-TAB-NODO          PIC 9(02) COMP.            056400      
002806             07  WKS-TAB-SUBNODO       PIC 9(02) COMP.            056500      
002807                                                                  056600      
002808*  01  WKS-FECAPLI                       PIC 9(06).               056700      
002809*INICIA CODIGO DE RENOVACION CRONOS 2000                          056800      
002810 01 WKS-FECAPLI                        PIC 9(08).                 056900      
002811*TERMINA CODIGO DE RENOVACION CRONOS 2000                         057000      
002812 01  WKS-FECAPLI-R REDEFINES WKS-FECAPLI.                         057100      
002813*      03  WKS-AA-FECAPLI                PIC 9(02).               057200      
002814*INICIA CODIGO DE RENOVACION CRONOS 2000                          057300      
002815     03  WKS-AA-FECAPLI                PIC 9(04).                 057400      
002816*TERMINA CODIGO DE RENOVACION CRONOS 2000                         057500      
002817     03  WKS-MM-FECAPLI                PIC 9(02).                 057600      
002818     03  WKS-DD-FECAPLI                PIC 9(02).                 057700      
002819                                                                  057800      
002820*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002821*    COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".        057900      
002822**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
002823  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
002824  01 MENSAJE-LJ.                                                  100300      
002825     02 SISTEMA-LJ     PIC X(04).                                 100400      
002826     02 FILLER         PIC X VALUE "/".                           100500      
002827     02 PASO-LJ        PIC X(04).                                 100600      
002828     02 FILLER         PIC X VALUE "/".                           100700      
002829     02 MTP-LJ         PIC 9(03).                                 100800      
002830     02 FILLER         PIC X VALUE ":".                           100900      
002831     02 TIPO-LJ        PIC X.                                     101000      
002832     02 FILLER         PIC X VALUE ">".                           101100      
002833     02 CODIGO-LJ      PIC 9(06).                                 101200      
002834     02 FILLER         PIC X VALUE "<".                           101300      
002835     02 TEXTO-LJ       PIC X(250).                                101400      
002836*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002837*                                                                 058000      
002838 01  WKS-TEXTO.                                                   058100      
002839     02  FILLER    PIC X(20) VALUE "INICIO DE PROCESO   ".        058200      
002840*      02  FEC-TEX   PIC X(06).                                   058300      
002841*INICIA CODIGO DE RENOVACION CRONOS 2000                          058400      
002842     02 FEC-TEX      PIC X(08).                                   058500      
002843*TERMINA CODIGO DE RENOVACION CRONOS 2000                         058600      
002844                                                                  058610      
002845 01 WKS-R01-REF-CLIENTE-R     PIC X(10).                          058620      
002846 01 WKS-R01-REF-CLIENTE-R1 REDEFINES WKS-R01-REF-CLIENTE-R        058630      
002847                              PIC 9(10).                          058640      
002848/**************************************************************** 058700      
002849*             P R O C E D U R E     D I V I S I O N             * 058800      
002850***************************************************************** 058900      
002851 PROCEDURE DIVISION USING W77-SIST-PARAM.                         059000      
002852 00000-INICIO.                                                    059100      
002853     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   059200      
002854        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          059300      
002855                                                                  059320      
002856     CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION.     059340      
002857     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP".       059360      
002858                                                                  059380      
002859     CHANGE ATTRIBUTE LIBACCESS OF "SOPORTECOMS" TO BYFUNCTION.   059400      
002860     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            059500      
002861                                      "SOPORTECOMS".              059600      
002862     CHANGE ATTRIBUTE LIBACCESS    OF "CTRLVERS" TO BYFUNCTION.   059700      
002863     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".    059800      
002864                                                                  059900      
002865     MOVE W77-SIST-PARAM           TO WKS-SIST-PARAM.             060000      
002866                                                                  060100      
002867     IF WKS-PROCESO-PARAM = 1                                     060200      
002868        MOVE "/LIN/" TO WKS-NOMBRE-FILE-S015                      060300      
002869     ELSE                                                         060400      
002870     IF WKS-PROCESO-PARAM = 2                                     060500      
002871        MOVE "/LOT/" TO WKS-NOMBRE-FILE-S015                      060600      
002872     ELSE                                                         060700      
002873     IF WKS-PROCESO-PARAM = 3                                     060800      
002874        MOVE "/SDO/" TO WKS-NOMBRE-FILE-S015.                     060900      
002875                                                                  061000      
002876     MOVE WKS-PROCESO-PARAM        TO A00-R00-TIPOCORRIDA.        061100      
002877                                                                  061200      
002878     MOVE "S151" TO SISTEMA-LJ                                    061300      
002879     MOVE "P177" TO PASO-LJ                                       061400      
002880                    WKS-PASO-BACK2                                061500      
002881                    WLI-RB-E1-PASO                                061600      
002882     MOVE "001"  TO MTP-LJ                                        061700      
002883     MOVE "I"    TO TIPO-LJ                                       061800      
002884     MOVE 020101 TO CODIGO-LJ                                     061900      
002885     MOVE WKS-TEXTO TO TEXTO-LJ.                                  062000      
002886*    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         062100      
002887                                                                  062200      
002888     PERFORM 000-005-CHECA-LIBCONTROL.                            062300      
002889     MOVE WKS-151-FECPROC         TO FEC-TEX                      062400      
002890     MOVE SPACES       TO      WLI-ENCAB-52,TEXTO-LJ              062500      
002891     MOVE "I"    TO TIPO-LJ                                       062600      
002892     MOVE 020101 TO CODIGO-LJ                                     062700      
002893     STRING "PROCESANDO CON FECHA : ",FEC-TEX DELIMITED BY SIZE   062800      
002894                                      INTO TEXTO-LJ               062900      
002895     MOVE TIPO-LJ        TO      WLI-TIPO-LJ                      063000      
002896     MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                     063100      
002897     PERFORM  000-030-IMPRIME-MENSAJE.                            063200      
002898*    CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ.         063300      
002899                                                                  063400      
002900     PERFORM 12000-CARGA-CATALOGOS.                               063500      
002901                                                                  063550      
002902     PERFORM 13000-CARGA-CATALOGO-LEYTXID.                        063600      
002903                                                                  063650      
002904     PERFORM 10000-PROCESO                                        063700      
002905                                                                  063800      
002906     IF WKS-PROCESO-PARAM = 1 OR 2                                063900      
002907        CLOSE L02-DATOS WITH SAVE.                                064000      
002908                                                                  064100      
002909     MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ             064200      
002910     MOVE "I"    TO TIPO-LJ                                       064300      
002911     MOVE 020101 TO CODIGO-LJ                                     064400      
002912     MOVE "FIN NORMAL DE PROCESO  " TO TEXTO-LJ                   064500      
002913     MOVE TIPO-LJ        TO      WLI-TIPO-LJ                      064600      
002914     MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                     064700      
002915     PERFORM  000-030-IMPRIME-MENSAJE.                            064800      
002916*    CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ.         064900      
002917                                                                  065000      
002918     STOP RUN.                                                    065100      
002919*                                                                 065200      
002920  000-005-FORMATO-DISPLAY.                                        065300      
002921*=========================                                        065400      
002922*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002923*     COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY.".               065500      
002924                                                                  000100      
002925*===============================================================* 000200      
002926*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
002927*         PARA LLAMADO DE DISPLAY                               * 000400      
002928*===============================================================* 000500      
002929                                                                  000600      
002930     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
002931            TO BYFUNCTION.                                        000671      
002932                                                                  000691      
002933     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
002934          USING WKS-DATE-ARRAY2.                                  000800      
002935     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
002936     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
002937     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
002938     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
002939     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
002940     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
002941                                                                  001300      
002942     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
002943     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
002944     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
002945                               WKS-TIT-REPORTE2.                  001700      
002946*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
002947*                                  GIVING WKS-COMPILA2.           001900      
002948*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
002949*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
002950*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
002951*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
002952                                                                  002066      
002953*    IF WKS-AAA-VERSION2  < 50                                    002071      
002954*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
002955*    ELSE                                                         002081      
002956*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
002957                                                                  002091      
002958                                                                  002500      
002959*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
002960     OPEN OUTPUT V00-REPORTE2.                                    002700      
002961     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
002962     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
002963                                                                  003000      
002964 000-050-CHECA-SALTO-HOJA2.                                       003051      
002965*==========================                                       003071      
002966    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
002967     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
002968        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
002969     ELSE                                                         003079      
002970        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
002971     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
002972     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
002973     MOVE "/"                     TO WKS-SLASH1.                  003086      
002974     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
002975     MOVE "/"                     TO WKS-SLASH2.                  003088      
002976     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
002977     IF  WKS-NUM-LINEAS2 > 56                                     003091      
002978         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
002979         ADD 1                   TO    W77-CONT-HOJA2             003200      
002980         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
002981         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
002982         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
002983         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
002984         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
002985         MOVE SPACES             TO V00-R00-REPORTE2              003800      
002986         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
002987         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
002988                                                                  004100      
002989 000-030-IMPRIME-MENSAJE.                                         004200      
002990*========================                                         004300      
002991*LP                                                               004400      
002992     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
002993     ADD             2       TO WKS-NUM-LINEAS2                   004600      
002994     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
002995                                                                  004800      
002996*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002997                                                                  065600      
002998  000-005-CHECA-LIBCONTROL.                                       065700      
002999*==========================                                       065800      
003000                                                                  065900      
003001     MOVE "S151L001CTL"         TO WKS-CTLVERS-LIBRERIA           066000      
003002     CALL "DAME_TIT IN CTRLVERS"                                  066100      
003003          USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO          066200      
003004          GIVING WKS-CTLVERS-STATUS.                              066300      
003005                                                                  066400      
003006     IF WKS-CTLVERS-STATUS < 0                                    066500      
003007        MOVE "I"    TO TIPO-LJ                                    066600      
003008        MOVE 020101 TO CODIGO-LJ                                  066700      
003009        STRING "ERROR EN CTLVERS, USO LICBRERIA DE CONTROL SIN ", 066800      
003010               "RELEASE NI MTP." DELIMITED BY SIZE INTO TEXTO-LJ  066900      
003011*       CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ       067000      
003012        CHANGE ATTRIBUTE TITLE  OF "S151LIBCONTROL" TO            067100      
003013               "(S151)S151/OBJECT/L001/CONTROL ON CMEMP."         067200      
003014     ELSE                                                         067300      
003015        CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL" TO             067400      
003016               WKS-CTLVERS-TITULO.                                067500      
003017                                                                  067600      
003018     CALL "CSIID OF SOPORTECOMS" USING WKS-DATOS-HOST.            067700      
003019     MOVE WKS-NUMCSI      TO      WKS-151-CSI                     067800      
003020                                  WKS-NODO-ORIGEN-S015            067900      
003021                                  WKS-NODO-DESTINO-S015           068000      
003022                                  WKS-B01-CSI                     068100      
003023                                  WKS-TR-CSI2                     068200      
003024     MOVE W77-SISTEMA-PARAMETRO TO  WKS-B01-SISTEMA               068300      
003025                                    WKS-SIS-BACK2                 068400      
003026                                    WLI-RB-E3-SISTEMA2            068500      
003027     MOVE "DIARIO"              TO WLI-RB-E2-TIPO-PROC2           068600      
003028     MOVE 01              TO      WKS-B01-FUNCION.                068700      
003029     CALL "CONSISDIA IN S151LIBCONTROL" USING  WKS-S151B01SISDIA  068800      
003030                                        GIVING WKS-151-RESULT.    068900      
003031                                                                  069000      
003032     IF WKS-151-RESULT > 0                                        069100      
003033        STRING "ERROR AL CONSULTAR LIB-NVACONTROL PARA OBTENER",  069200      
003034               "FECHA DE PROCESO, ERROR : " ,                     069300      
003035               WKS-ERROR(WKS-151-RESULT)                          069400      
003036               DELIMITED BY SIZE INTO TEXTO-LJ                    069500      
003037        MOVE "O"          TO      TIPO-LJ                         069600      
003038        MOVE 020901       TO      CODIGO-LJ                       069700      
003039        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       069800      
003040        SET MYSELF(STATUS) TO -1                                  069900      
003041     ELSE                                                         070000      
003042        MOVE WKS-B01-NOMPACMOV TO WKS-PACK-LOG                    070100      
003043        MOVE WKS-B01-NOMPACDES TO WKS-PACK-DES                    070200      
003044        MOVE WKS-B01-NOMPACSAL TO WKS-PACK-SALDOS.                070300      
003045                                                                  070400      
003046     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-VALUE.             070500      
003047                                                                  070600      
003048     IF WKS-VALUE > 0                                             070700      
003049*       MOVE WKS-VALUE         TO WKS-151-FECPROC                 070800      
003050*                                 WKS-FEC-LOG                     070900      
003051*                                 WKS-FEC-DES                     071000      
003052*                                 WKS-FEC-SALDOS                  071100      
003053*                                 WKS-FEC-S015                    071200      
003054*INICIA CODIGO DE RENOVACION CRONOS 2000                          071300      
003055$SET OMIT = OLDCODE                                               071400      
003056        MOVE WKS-VALUE         TO WKS-151-FECPROC                 071500      
003057                                  WKS-FEC-LOG                     071600      
003058                                  WKS-FEC-DES                     071700      
003059                                  WKS-FEC-SALDOS                  071800      
003060                                  WKS-FEC-S015                    071900      
003061$POP OMIT                                                         072000      
003062$SET OMIT = NOT OLDCODE                                           072100      
003063       MOVE ZEROS             TO A2K-FEC-CAMD-001                 072200      
003064       MOVE WKS-VALUE         TO WKS-151-FECPROC A2K-FEC-CAMD-001 072300      
003065       PERFORM A2K-CONV-CAMD-TO-AMD THRU                          072400      
003066               A2K-CONV-CAMD-TO-AMD-EXIT                          072500      
003067       MOVE A2K-FEC-AMD-001 TO    WKS-FEC-LOG                     072600      
003068                                  WKS-FEC-DES                     072700      
003069                                  WKS-FEC-SALDOS                  072800      
003070                                  WKS-FEC-S015                    072900      
003071$POP OMIT                                                         073000      
003072*TERMINA CODIGO DE RENOVACION CRONOS 2000                         073100      
003073                                  WLI-RB-E1-FECHA-INF2            073200      
003074     ELSE                                                         073300      
003075*       MOVE WKS-B01-FECPRO    TO WKS-151-FECPROC                 073400      
003076*                                 WKS-FEC-LOG                     073500      
003077*                                 WKS-FEC-DES                     073600      
003078*                                 WKS-FEC-SALDOS                  073700      
003079*                                 WKS-FEC-S015.                   073800      
003080*INICIA CODIGO DE RENOVACION CRONOS 2000                          073900      
003081$SET OMIT = OLDCODE                                               074000      
003082        MOVE WKS-B01-FECPRO    TO WKS-151-FECPROC                 074100      
003083                                  WKS-FEC-LOG                     074200      
003084                                  WKS-FEC-DES                     074300      
003085                                  WKS-FEC-SALDOS                  074400      
003086                                  WLI-RB-E1-FECHA-INF2            074500      
003087                                  WKS-FEC-S015.                   074600      
003088$POP OMIT                                                         074700      
003089$SET OMIT = NOT OLDCODE                                           074800      
003090       MOVE ZEROS             TO A2K-FEC-CAMD-001                 074900      
003091       MOVE WKS-B01-FECPRO    TO WKS-151-FECPROC A2K-FEC-CAMD-001 075000      
003092       PERFORM A2K-CONV-CAMD-TO-AMD THRU                          075100      
003093               A2K-CONV-CAMD-TO-AMD-EXIT                          075200      
003094       MOVE A2K-FEC-AMD-001 TO    WKS-FEC-LOG                     075300      
003095                                  WKS-FEC-DES                     075400      
003096                                  WKS-FEC-SALDOS                  075500      
003097                                  WKS-FEC-S015.                   075600      
003098$POP OMIT                                                         075700      
003099*TERMINA CODIGO DE RENOVACION CRONOS 2000                         075800      
003100                                                                  075900      
003101     PERFORM      000-005-FORMATO-DISPLAY.                        076000      
003102                                                                  076100      
003103     MOVE W77-SISTEMA-PARAMETRO   TO WKS-TIT-SISTEMA              076200      
003104                                  WKS-TIT-SIST-DES                076300      
003105                                  WKS-TIT-SIST-SALDOS.            076400      
003106     MOVE ZEROS                TO WKS-151-RESULT.                 076500      
003107                                                                  076600      
003108                                                                  076700      
003109     IF WKS-PROCESO-PARAM = 3                                     076800      
003110        IF WKS-VALUE > 0                                          076900      
003111           MOVE WKS-VALUE      TO WS-FECHA1                       077000      
003112        ELSE                                                      077100      
003113           MOVE WKS-B01-FECPRO TO WS-FECHA1.                      077200      
003114                                                                  077300      
003115                                                                  077400      
003116     IF WKS-PROCESO-PARAM = 3                                     077500      
003117        MOVE 13                TO WS-FUNCION                      077600      
003118        MOVE "00000001"        TO WS-FECHA2                       077700      
003119*       MOVE 3                 TO WS-FORMATO                      077800      
003120*INICIA CODIGO DE RENOVACION CRONOS 2000                          077900      
003121        MOVE 13 TO WS-FORMATO                                     078000      
003122*TERMINA CODIGO DE RENOVACION CRONOS 2000                         078100      
003123        CALL "THECALENDAR IN LOCSUP" USING WS-FUNCION,            078200      
003124                                           WS-FECHA1,             078300      
003125                                           WS-FECHA2,             078400      
003126                                           WS-FORMATO             078500      
003127        IF WS-FUNCION > 0                                         078600      
003128           MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ       078700      
003129           MOVE  "E"           TO TIPO-LJ                         078800      
003130           MOVE 010105         TO CODIGO-LJ                       078900      
003131           MOVE "ERROR AL CALCULAR FECHA DE DIA SIGUIENTE "       079000      
003132                               TO TEXTO-LJ                        079100      
003133           MOVE TIPO-LJ        TO      WLI-TIPO-LJ                079200      
003134           MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ               079300      
003135           PERFORM  000-030-IMPRIME-MENSAJE                       079400      
003136           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ     079500      
003137           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                079600      
003138        ELSE                                                      079700      
003139*         MOVE WS-FECHA1         TO WKS-FEC-S015.                 079800      
003140*INICIA CODIGO DE RENOVACION CRONOS 2000                          079900      
003141$SET OMIT = OLDCODE                                               080000      
003142          MOVE WS-FECHA1         TO WKS-FEC-S015.                 080100      
003143$POP OMIT                                                         080200      
003144$SET OMIT = NOT OLDCODE                                           080300      
003145          MOVE ZEROS             TO A2K-FEC-CAMD-001              080400      
003146          MOVE WS-FECHA1         TO A2K-FEC-CAMD-001              080500      
003147          PERFORM A2K-CONV-CAMD-TO-AMD THRU                       080600      
003148                  A2K-CONV-CAMD-TO-AMD-EXIT                       080700      
003149          MOVE  A2K-FEC-AMD-001  TO WKS-FEC-S015.                 080800      
003150$POP OMIT                                                         080900      
003151*TERMINA CODIGO DE RENOVACION CRONOS 2000                         081000      
003152                                                                  081100      
003153                                                                  081200      
003154 12000-CARGA-CATALOGOS.                                           081300      
003155*======================                                           081400      
003156                                                                  081500      
003157     MOVE "S080BD01CON"                    TO WKS-CTLVERS-LIBRERIA081600      
003158     CALL "DAME_TIT IN CTRLVERS"                                  081700      
003159          USING  WKS-CTLVERS-LIBRERIA                             081800      
003160                 WKS-CTLVERS-TITULO                               081900      
003161          GIVING WKS-CTLVERS-STATUS.                              082000      
003162                                                                  082100      
003163     IF WKS-CTLVERS-STATUS < 0                                    082200      
003164        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          082300      
003165        MOVE "ERROR AL OBTENER NOMBRE S08BD01CON"                 082400      
003166                                           TO TEXTO-LJ            082500      
003167        MOVE "O"                           TO TIPO-LJ             082600      
003168        MOVE 020901                        TO CODIGO-LJ           082700      
003169        MOVE TIPO-LJ        TO      WLI-TIPO-LJ                   082800      
003170        MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                  082900      
003171        PERFORM  000-030-IMPRIME-MENSAJE                          083000      
003172        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       083100      
003173        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                   083200      
003174     ELSE                                                         083300      
003175       CHANGE ATTRIBUTE TITLE OF "S080BD01CON" TO                 083400      
003176              WKS-CTLVERS-TITULO.                                 083500      
003177                                                                  083600      
003178     MOVE 151                             TO S080-CP-SISTEMA      083700      
003179     MOVE 177                             TO S080-CP-PROGRAMA     083800      
003180     MOVE 6                               TO S080-CPPE-CATALOGO   083900      
003181     MOVE 20                              TO S080-CPPE-CLAVE      084000      
003182     MOVE 2                               TO S080-CPPE-ORDEN-BUSQ 084100      
003183     MOVE 1                               TO S080-CPPE-REGISTROS  084200      
003184     MOVE W77-SISTEMA-PARAMETRO               TO S080-CPPE-LLAVE2 084300      
003185     MOVE 0                               TO S080-CPPE-LLAVE1     084400      
003186                                             S080-CPPE-LLAVE3     084500      
003187                                             S080-CPPE-LLAVE4     084600      
003188                                             S080-CPPE-LLAVE5     084700      
003189                                             S080-CPPE-LLAVE6     084800      
003190                                                                  084810      
003191*    MOVE WKS-151-FECPROC                 TO S080-CPPE-FECHA-VIG  084900      
003192*INICIA CODIGO DE RENOVACION CRONOS 2000                          085000      
003193$SET OMIT = OLDCODE                                               085100      
003194          MOVE WKS-151-FECPROC            TO S080-CPPE-FECHA-VIG  085200      
003195$POP OMIT                                                         085300      
003196$SET OMIT = NOT OLDCODE                                           085400      
003197          MOVE ZEROS             TO A2K-FEC-CAMD-001              085500      
003198          MOVE WKS-151-FECPROC   TO A2K-FEC-CAMD-001              085600      
003199          PERFORM A2K-CONV-CAMD-TO-AMD THRU                       085700      
003200                  A2K-CONV-CAMD-TO-AMD-EXIT                       085800      
003201          MOVE  A2K-FEC-AMD-001  TO S080-CPPE-FECHA-VIG           085900      
003202$POP OMIT                                                         086000      
003203*TERMINA CODIGO DE RENOVACION CRONOS 2000                         086100      
003204     MOVE 0                               TO S080-CPPE-FECHA-VIG  086200      
003205     MOVE 0                               TO S080-CPPE-FECHA-CONS 086300      
003206                                             S080-CPPE-NIVEL-INI  086400      
003207     MOVE 0                               TO W77-FINLOG.          086500      
003208                                                                  086600      
003209     PERFORM 12200-CARGA-TRANSACCIONES UNTIL W77-FINLOG > 0.      086700      
003210                                                                  086800      
003211                                                                  086850      
003212 12200-CARGA-TRANSACCIONES.                                       086900      
003213*==========================                                       087000      
003214                                                                  087100      
003215     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    087200      
003216           USING  S080-CP-SISTEMA                                 087300      
003217                  S080-CP-PROGRAMA                                087400      
003218                  S080-CP-PARAMETRO-ENT                           087500      
003219                  S080-CP-PARAMETRO-SAL                           087600      
003220           GIVING S080-CP-RESULT                                  087700      
003221                                                                  087800      
003222     IF S080-CP-RESULT = 0 OR = 1                                 087900      
003223        MOVE S080-CPPS-DATOS(1)        TO S080-CPPE-LLAVE1        088000      
003224                                          W77-IND                 088100      
003225        MOVE S080-CPPS-NIVEL-INI       TO S080-CPPE-NIVEL-INI     088200      
003226        MOVE S080-CPPS-FECHA-CONS      TO S080-CPPE-FECHA-CONS    088300      
003227        MOVE S080-CPPS-DATOS(5)        TO WKS-PT-ENVEDC(W77-IND)  088400      
003228        MOVE S080-CPPS-DATOS(6)        TO                         088500      
003229                                      WKS-PT-NATURALEZA(W77-IND)  088600      
003230     ELSE                                                         088700      
003231        MOVE 1                            TO W77-FINLOG           088800      
003232        MOVE S080-CP-RESULT               TO W77-CAMPO-DISPLAY    088900      
003233        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          089000      
003234        MOVE "O"                          TO TIPO-LJ              089100      
003235        MOVE 020901                       TO CODIGO-LJ            089200      
003236        STRING "ERROR EN CALL PARAMETROS S080BD01CON,RESULT = ",  089300      
003237                W77-CAMPO-DISPLAY                                 089400      
003238                DELIMITED BY SIZE                                 089500      
003239                INTO TEXTO-LJ                                     089600      
003240        MOVE TIPO-LJ        TO      WLI-TIPO-LJ                   089700      
003241        MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                  089800      
003242        PERFORM  000-030-IMPRIME-MENSAJE                          089900      
003243        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      090000      
003244                                                                  090100      
003245     IF S080-CP-RESULT = 0                                        090200      
003246        MOVE 1                            TO W77-FINLOG.          090300      
003247* INI CAMBIOS AGF                                                 090302      
003248 13000-CARGA-CATALOGO-LEYTXID.                                    090304      
003249*=========================                                        090306      
003250     MOVE "S080BD01CON"                TO WS-CTR-LIBRERIA.        090308      
003251     CALL "DAME_TIT IN CTRLVERS"                                  090310      
003252               USING WS-CTR-LIBRERIA, WS-CTR-TITULO               090312      
003253               GIVING WS-CTR-RESULT                               090314      
003254     IF WS-CTR-RESULT = 0                                         090316      
003255             CHANGE ATTRIBUTE TITLE OF "S080BD01CON"              090318      
003256                           TO WS-CTR-TITULO.                      090320      
003257     MOVE 254                        TO S080-ETXC-CATALOGO.       090322      
003258     MOVE 2                          TO S080-ETXC-ORDEN-BUSQUEDA. 090324      
003259     MOVE ZERO                       TO S080-ETXC-LLAVE1.         090326      
003260     MOVE 145886                       TO S080-ETXC-LLAVE2.       090328      
003261     MOVE W77-SISTEMA-PARAMETRO        TO WKS-TXC-SISTEMA.        090330      
003262     MOVE 151                          TO WKS-TXC-PROG.           090332      
003263     MOVE 20                           TO S080-ETXC-CLAVE.        090334      
003264     MOVE 10                           TO S080-ETXC-REGISTROS.    090336      
003265     MOVE ZERO                         TO S080-ETXC-LLAVE3        090338      
003266                                          S080-ETXC-LLAVE4        090340      
003267                                         S080-ETXC-LLAVE5         090342      
003268                                         S080-ETXC-LLAVE6         090344      
003269                                         S080-ETXC-NIVEL-INI      090346      
003270                                         S080-ETXC-FEC-INI-CONS   090348      
003271                                         S080-ETXC-FEC-VIG.       090350      
003272     MOVE ZERO                        TO WKS-EOF.                 090352      
003273     MOVE 0                           TO S080-ETXC-NIVEL-INI      090354      
003274                                         S080-ETXC-FEC-INI-CONS   090356      
003275                                         S080-ETXC-FEC-VIG.       090358      
003276                                                                  090362      
003277     PERFORM 13201-CARGA-TRANSACCIONES UNTIL WKS-EOF > 0.         090364      
003278                                                                  090366      
003279 13201-CARGA-TRANSACCIONES.                                       090368      
003280*==========================                                       090370      
003281     CALL "L710_CONSUL_LEYENDA IN S080BD01CON"                    090372      
003282          USING          WKS-TXC-SISTEMA,                         090374      
003283                            WKS-TXC-PROG,                         090376      
003284                   S080-PARAMETRO-ENT,                            090378      
003285                   S080-PARAMETRO-SAL,                            090380      
003286          GIVING   WKS-TXC-RESULT.                                090382      
003287     IF WKS-TXC-RESULT = 0 OR = 1                                 090384      
003288        PERFORM 010620-LLENA-CATALOGO                             090386      
003289                VARYING WKS-NUM-OCCURS FROM 1 BY 1                090388      
003290                UNTIL WKS-NUM-OCCURS > S080-STXC-NUM-REG          090390      
003291         MOVE S080-STXC-LLAVE1(S080-STXC-NUM-REG)  TO             090392      
003292                                              S080-ETXC-LLAVE1    090394      
003293         MOVE S080-STXC-LLAVE2(S080-STXC-NUM-REG)  TO             090396      
003294                                              S080-ETXC-LLAVE2    090398      
003295         MOVE S080-STXC-LLAVE3(S080-STXC-NUM-REG)  TO             090400      
003296                                              S080-ETXC-LLAVE3    090402      
003297         MOVE S080-STXC-LLAVE4(S080-STXC-NUM-REG)  TO             090404      
003298                                              S080-ETXC-LLAVE4    090406      
003299         MOVE S080-STXC-LLAVE5(S080-STXC-NUM-REG)  TO             090408      
003300                                              S080-ETXC-LLAVE5    090410      
003301         MOVE S080-STXC-LLAVE6(S080-STXC-NUM-REG)  TO             090412      
003302                                              S080-ETXC-LLAVE6    090414      
003303         MOVE S080-STXC-NIVEL-INI                  TO             090416      
003304                                              S080-ETXC-NIVEL-INI 090418      
003305         MOVE S080-STXC-FEC-INI-CONS               TO             090420      
003306                                          S080-ETXC-FEC-INI-CONS  090422      
003307     ELSE                                                         090424      
003308        MOVE 1                          TO WKS-EOF                090426      
003309        ADD  1                          TO S080-STXC-NUM-REG      090428      
003310        MOVE WKS-TXC-RESULT             TO W77-CAMPO-DISPLAY      090430      
003311        MOVE SPACES                     TO WLI-ENCAB-52,          090432      
003312                                           TEXTO-LJ               090434      
003313        MOVE "O"                        TO TIPO-LJ                090436      
003314        MOVE 020901                     TO CODIGO-LJ              090438      
003315        STRING "ERROR EN CALL PARAMETROS S080BD01CON"             090440      
003316                DELIMITED BY SIZE                                 090446      
003317                INTO TEXTO-LJ                                     090448      
003318        MOVE TIPO-LJ        TO      WLI-TIPO-LJ                   090450      
003319        MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                  090452      
003320        PERFORM  000-030-IMPRIME-MENSAJE                          090454      
003321        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      090456      
003322                                                                  090458      
003323     IF WKS-TXC-RESULT = 0                                        090460      
003324        MOVE 1                            TO WKS-EOF.             090462      
003325                                                                  090464      
003326010620-LLENA-CATALOGO.                                            090466      
003327*   MOVE S080-STXC-LLAVE1(WKS-NUM-OCCURS) TO WKS-DES-TXC          090470      
003328   IF S080-STXC-LLAVE3(WKS-NUM-OCCURS) > 0 AND                    090475      
003329      S080-STXC-LLAVE3(WKS-NUM-OCCURS) < 9999                     090476      
003330*      IF WKS-TIP-TXC = "CAPT"                                    090480      
003331         ADD 1 TO WKS-INDTAX                                      090485      
003332         MOVE S080-STXC-LLAVE1(WKS-NUM-OCCURS) TO                 090490      
003333                                           WKS-TAX-ID(WKS-INDTAX) 090495      
003334         MOVE WKS-INDTAX                       TO                 090500      
003335                  WKS-POSCI-TAX(S080-STXC-LLAVE3(WKS-NUM-OCCURS)) 090505      
003336*      ELSE                                                       090510      
003337*         NEXT SENTENCE                                           090515      
003338   ELSE                                                           090520      
003339      STRING "LA CLAVE DE TRANSACION ESTA MAL",                   090525      
003340                DELIMITED BY SIZE                                 090530      
003341                INTO TEXTO-LJ                                     090535      
003342      MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                    090540      
003343      PERFORM  000-030-IMPRIME-MENSAJE.                           090545      
003344                                                                  090550      
003345* FIN CAMBIA AGF                                                  090555      
003346                                                                  090560      
003347 10000-PROCESO.                                                   090565      
003348*==============                                                   090600      
003349                                                                  090700      
003350     IF WKS-PROCESO-PARAM = 1 OR 2                                090800      
003351        PERFORM 10030-MOVIMIENTOS                                 090900      
003352        OPEN INPUT MOVS151                                        091000      
003353             OUTPUT SDOSYMOVS015                                  091100      
003354        PERFORM 10050-GENERA-MOVTOS                               091200      
003355     ELSE                                                         091300      
003356     IF WKS-PROCESO-PARAM = 3                                     091400      
003357        PERFORM 10010-SALDOS                                      091500      
003358        OPEN INPUT SALDOS015                                      091600      
003359             OUTPUT SDOSYMOVS015                                  091700      
003360        PERFORM 10040-GENERA-SALDOS.                              091800      
003361                                                                  091900      
003362 10010-SALDOS.                                                    092000      
003363*=============                                                    092100      
003364                                                                  092200      
003365     OPEN INPUT SALDOS151                                         092300      
003366          OUTPUT SALDOS015                                        092400      
003367                                                                  092500      
003368     READ SALDOS151 INTO A02-R00-HEADER AT END                    092600      
003369          MOVE SPACES       TO      WLI-ENCAB-52,TEXTO-LJ         092700      
003370          MOVE "ARCHIVO DE SALDOS SIN HEADER" TO TEXTO-LJ         092800      
003371          MOVE "I"    TO TIPO-LJ                                  092900      
003372          MOVE 020101 TO CODIGO-LJ                                093000      
003373          MOVE TIPO-LJ        TO      WLI-TIPO-LJ                 093100      
003374          MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                093200      
003375          PERFORM  000-030-IMPRIME-MENSAJE.                       093300      
003376*         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.    093400      
003377                                                                  093500      
003378     READ SALDOS151 INTO A02-R00-SALDOS AT END                    093600      
003379          MOVE SPACES       TO      WLI-ENCAB-52,TEXTO-LJ         093700      
003380          MOVE  "ARCHIVO VACIO DE SALDOS" TO TEXTO-LJ             093800      
003381          MOVE "I"    TO TIPO-LJ                                  093900      
003382          MOVE 020101 TO CODIGO-LJ                                094000      
003383          MOVE TIPO-LJ        TO      WLI-TIPO-LJ                 094100      
003384          MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                094200      
003385          PERFORM  000-030-IMPRIME-MENSAJE.                       094300      
003386*         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.    094400      
003387                                                                  094500      
003388     MOVE 0               TO W77-FINLOG                           094600      
003389     PERFORM 100-050-SELECCIONA-CTAS-S015 UNTIL W77-FINLOG > 0    094700      
003390     MOVE 0               TO W77-TOT-REG                          094800      
003391                                                                  094900      
003392     CLOSE SALDOS015 SAVE                                         095000      
003393           SALDOS151                                              095100      
003394**** Inicia cambio Fabrica de software **** Abarbosa       P05-355095101      
003395     OPEN    INPUT                SALDOS015                       095200      
003396     COMPUTE W77-FRAMESIZE        =                               095210      
003397            (ATTRIBUTE FRAMESIZE  OF SALDOS015)                   095220      
003398     COMPUTE W77-MAXRECSIZE       =                               095230      
003399            (ATTRIBUTE MAXRECSIZE OF SALDOS015)                   095240      
003400     COMPUTE W77-LASTRECORD       =                               095250      
003401            (ATTRIBUTE LASTRECORD OF SALDOS015                    095260      
003402                                  +   1)                          095270      
003403     CLOSE   SALDOS015            WITH SAVE                       095280      
003404     PERFORM                      70000-CALCULA-ESPACIO           095290      
003405**** Fin    cambio Fabrica de software **** Abarbosa       P05-355095291      
003406     SORT SSALDOS ON ASCENDING KEY                                095300      
003407*         KEY-SALDOS-SUCPROM                                      095400      
003408          KEY-SALDOS-CTA                                          095500      
003409          USING  SALDOS015                                        095600      
003410          GIVING SALDOS015                                        095700      
003411**** Inicia cambio Fabrica de software **** Abarbosa       P05-355095701      
003412          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    095800      
003413          DISK   SIZE IS W77-DISK-SIZE   WORDS.                   095900      
003414**** Fin    cambio Fabrica de software **** Abarbosa       P05-355095901      
003415                                                                  096000      
003416 10030-MOVIMIENTOS.                                               096100      
003417*==================                                               096200      
003418                                                                  096300      
003419     OPEN INPUT LOG151                                            096400      
003420          OUTPUT MOVS151                                          096500      
003421                                                                  096600      
003422     MOVE 0                       TO W77-FINLOG                   096700      
003423     READ LOG151 INTO A00-R00-HDR-MOV AT END                      096800      
003424          MOVE SPACES       TO      WLI-ENCAB-52,TEXTO-LJ         096900      
003425          MOVE "ARCHIVO DE MOVTOS SIN HEADER" TO TEXTO-LJ         097000      
003426          MOVE "I"    TO TIPO-LJ                                  097100      
003427          MOVE 020101 TO CODIGO-LJ                                097200      
003428          MOVE TIPO-LJ        TO      WLI-TIPO-LJ                 097300      
003429          MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                097400      
003430          PERFORM  000-030-IMPRIME-MENSAJE.                       097500      
003431*         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.    097600      
003432                                                                  097700      
003433     OPEN INPUT L02-DATOS                                         097900      
003434                                                                  098100      
003435     READ LOG151 INTO A00-R01-REGMOV  AT END                      098200      
003436          MOVE SPACES       TO      WLI-ENCAB-52,TEXTO-LJ         098300      
003437          MOVE "ARCHIVO VACIO DE MOVTOS" TO TEXTO-LJ              098400      
003438          MOVE "I"    TO TIPO-LJ                                  098500      
003439          MOVE 020101 TO CODIGO-LJ                                098600      
003440          MOVE TIPO-LJ        TO      WLI-TIPO-LJ                 098700      
003441          MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                098800      
003442          PERFORM  000-030-IMPRIME-MENSAJE.                       098900      
003443*         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.    099000      
003444                                                                  099100      
003445     PERFORM 200-050-SELECCIONA-MOVTOS UNTIL W77-FINLOG > 0       099800      
003446                                                                  099900      
003447     CLOSE LOG151                                                 100000      
003448           MOVS151   SAVE                                         100100      
003449**** Inicia cambio Fabrica de software **** Abarbosa       P05-355100101      
003450     OPEN    INPUT                MOVS151                         100200      
003451     COMPUTE W77-FRAMESIZE        =                               100210      
003452            (ATTRIBUTE FRAMESIZE  OF MOVS151)                     100220      
003453     COMPUTE W77-MAXRECSIZE       =                               100230      
003454            (ATTRIBUTE MAXRECSIZE OF MOVS151)                     100240      
003455     COMPUTE W77-LASTRECORD       =                               100250      
003456            (ATTRIBUTE LASTRECORD OF MOVS151                      100260      
003457                                  +   1)                          100270      
003458     CLOSE   MOVS151              WITH SAVE                       100280      
003459     PERFORM                      70000-CALCULA-ESPACIO           100290      
003460**** Fin    cambio Fabrica de software **** Abarbosa       P05-355100291      
003461     SORT SMOVS151 ON ASCENDING KEY                               100300      
003462*         KEY-SUCPROM                                             100400      
003463          KEY-CONTRATO                                            100500      
003464          USING  MOVS151                                          100600      
003465          GIVING MOVS151                                          100700      
003466**** Inicia cambio Fabrica de software **** Abarbosa       P05-355100701      
003467          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    100800      
003468          DISK   SIZE IS W77-DISK-SIZE   WORDS.                   100900      
003469**** Fin    cambio Fabrica de software **** Abarbosa       P05-355100901      
003470                                                                  101000      
003471 10040-GENERA-SALDOS.                                             101100      
003472*====================                                             101200      
003473                                                                  101300      
003474                                                                  101400      
003475*    MOVE WS-FECHA1               TO A00-R00-S015-FCH             101500      
003476*INICIA CODIGO PARA PUENTE CRONOS 2000                            101600      
003477$SET OMIT = OLDCODE                                               101700      
003478          MOVE WS-FECHA1         TO A00-R00-S015-FCH              101800      
003479$POP OMIT                                                         101900      
003480$SET OMIT = NOT OLDCODE                                           102000      
003481          MOVE ZEROS             TO A2K-FEC-CAMD-001              102100      
003482          MOVE WS-FECHA1         TO A2K-FEC-CAMD-001              102200      
003483          PERFORM A2K-CONV-CAMD-TO-AMD THRU                       102300      
003484                  A2K-CONV-CAMD-TO-AMD-EXIT                       102400      
003485          MOVE  A2K-FEC-AMD-001  TO A00-R00-S015-FCH              102500      
003486$POP OMIT                                                         102600      
003487*TERMINA CODIGO PARA PUENET CRONOS 2000                           102700      
003488     WRITE REG-SDOSYMOVS015       FROM A00-R00-HDR-S015           102800      
003489                                                                  102900      
003490     MOVE 0               TO W77-FINLOG                           103000      
003491     READ SALDOS015 INTO A00-R02-S015-SDOS AT END                 103100      
003492          MOVE 1 TO W77-FINSDO.                                   103200      
003493                                                                  103300      
003494     IF W77-FINSDO = 0                                            103400      
003495        PERFORM GRABA-RESTO-SDOS UNTIL W77-FINSDO > 0.            103500      
003496                                                                  103600      
003497     MOVE W77-TOT-REG             TO A00-R03-S015-TOTREG          103700      
003498     MOVE W77-TOT-IMP             TO A00-R03-S015-TOTCARABO       103800      
003499     WRITE REG-SDOSYMOVS015 FROM A00-R03-TRAILER-S015             103900      
003500                                                                  104000      
003501     CLOSE SALDOS015 WITH PURGE.                                  104100      
003502     CLOSE SDOSYMOVS015    SAVE.                                  104200      
003503                                                                  104300      
003504 10050-GENERA-MOVTOS.                                             104400      
003505*====================                                             104500      
003506                                                                  104600      
003507*    MOVE WKS-151-FECPROC         TO A00-R00-S015-FCH             104700      
003508*INICIA CODIGO PARA PUENTE CRONOS 2000                            104800      
003509$SET OMIT = OLDCODE                                               104900      
003510          MOVE WKS-151-FECPROC   TO A00-R00-S015-FCH              105000      
003511$POP OMIT                                                         105100      
003512$SET OMIT = NOT OLDCODE                                           105200      
003513          MOVE ZEROS             TO A2K-FEC-CAMD-001              105300      
003514          MOVE WKS-151-FECPROC   TO A2K-FEC-CAMD-001              105400      
003515          PERFORM A2K-CONV-CAMD-TO-AMD THRU                       105500      
003516                  A2K-CONV-CAMD-TO-AMD-EXIT                       105600      
003517          MOVE  A2K-FEC-AMD-001  TO A00-R00-S015-FCH              105700      
003518$POP OMIT                                                         105800      
003519*TERMINA CODIGO PARA PUENTE CRONOS 2000                           105900      
003520     WRITE REG-SDOSYMOVS015       FROM A00-R00-HDR-S015           106000      
003521                                                                  106100      
003522     MOVE 0               TO W77-FINLOG.                          106200      
003523     READ MOVS151 INTO A00-R01-REGMOV AT END                      106300      
003524          MOVE 1 TO W77-FINLOG.                                   106400      
003525                                                                  106500      
003526     PERFORM 30000-CREA-FILE-S015 UNTIL W77-FINLOG > 0 OR         106600      
003527                                        W77-FINSDO > 0            106700      
003528                                                                  106800      
003529     MOVE W77-TOT-REG             TO A00-R03-S015-TOTREG          106900      
003530     MOVE W77-TOT-IMP             TO A00-R03-S015-TOTCARABO       107000      
003531     WRITE REG-SDOSYMOVS015 FROM A00-R03-TRAILER-S015             107100      
003532                                                                  107200      
003533     CLOSE MOVS151 WITH PURGE.                                    107300      
003534     CLOSE SDOSYMOVS015 SAVE.                                     107400      
003535                                                                  107500      
003536 100-050-SELECCIONA-CTAS-S015.                                    107600      
003537*=============================                                    107700      
003538                                                                  107800      
003539     IF A02-R00-TIPO-REG = 81                                     107900      
003540     IF A02-R01-STATION > 0                                       108000      
003541        MOVE 0 TO W77-SW-ENCONTRE                                 108100      
003542        PERFORM BUSCA-SDO-ACTUAL VARYING W77-IND FROM 1 BY 1      108200      
003543*INICIA CJMG CAMBIO TESOFE 2019                                   108250      
003544*                                 UNTIL W77-IND         > 13 OR   108300      
003545                                  UNTIL W77-IND         > 30 OR   108320      
003546*FIN CJMG CAMBIO TESOFE 2019                                      108340      
003547                                       W77-SW-ENCONTRE > 0.       108400      
003548                                                                  108500      
003549     READ SALDOS151 INTO A02-R00-SALDOS AT END                    108600      
003550          MOVE 1 TO W77-FINLOG.                                   108700      
003551     ADD 1 TO W77-TOT-REG-CHEQ.                                   108800      
003552                                                                  108900      
003553 BUSCA-SDO-ACTUAL.                                                109000      
003554*=================                                                109100      
003555                                                                  109200      
003556     IF A02-R01-CVESDO(W77-IND) = 2                               109300      
003557        MOVE A02-R01-STATION              TO A00-R02-S015-NUMSTA  109400      
003558        ADD 1                             TO W77-TOT-REG          109500      
003559        MOVE A02-R01-INS                  TO A00-R02-S015-INS     109600      
003560        MOVE A02-R01-PRD                  TO A00-R02-S015-PRD     109700      
003561        MOVE A02-R01-SUCPRO               TO A00-R02-S015-SUCPRO  109800      
003562        MOVE A02-R01-CTA                  TO A00-R02-S015-CNT     109900      
003563        MOVE A02-R01-IMPT(W77-IND)        TO A00-R02-S015-SDOACT  110000      
003564        MOVE A02-R01-CTACON               TO A00-R02-S015-CTACON  110100      
003565        WRITE REG-SALDOS015 FROM A00-R02-S015-SDOS.               110200      
003566                                                                  110300      
003567 200-050-SELECCIONA-MOVTOS.                                       110400      
003568*==========================                                       110500      
003569                                                                  110600      
003570     IF A00-R01-FUNCION = 01 AND A00-R01-STATUS = 01 AND          110700      
003571*INICIA CJMG CAMBIO TESOFE 2019                                   110750      
003572        (A00-R01-ORIGEN = 1 OR = 03) AND (A00-R01-ESTACION> 0 OR  110800      
003573        (A00-R01-ESTACION> 0  AND A00-R01-CTACON = 60 OR 61))     110820      
003574*FIN CJMG CAMBIO TESOFE 2019                                      110840      
003575        IF WKS-PROCESO-PARAM = 1 AND A00-R01-TIPO-PROC < 20       110900      
003576              WRITE REG-MOVS151 FROM A00-R01-REGMOV               111000      
003577        ELSE                                                      111100      
003578        IF WKS-PROCESO-PARAM = 2 AND A00-R01-TIPO-PROC > 19       111200      
003579           PERFORM 200-060-FILTRA-MOVS-TELETON.                   111300      
003580                                                                  111400      
003581     READ LOG151 INTO A00-R01-REGMOV  AT END                      111500      
003582          MOVE 1 TO W77-FINLOG.                                   111600      
003583                                                                  112300      
003584     IF A00-R01-FUNCION = 99                                      112400      
003585        MOVE 1 TO W77-FINLOG.                                     112500      
003586                                                                  112600      
003587*MFPD-INI ADECUACION FILTRO DE PROCESOS TELETON                   112605      
003588 200-060-FILTRA-MOVS-TELETON.                                     112610      
003589     IF W77-SISTEMA-PARAMETRO = 500                               112615      
003590        IF A00-R01-TIPO-PROC = 40 OR 41 OR 42 OR 43               112620      
003591           NEXT SENTENCE                                          112625      
003592        ELSE                                                      112630      
003593           WRITE REG-MOVS151 FROM A00-R01-REGMOV                  112635      
003594     ELSE                                                         112640      
003595        WRITE REG-MOVS151 FROM A00-R01-REGMOV.                    112645      
003596*MFPD-FIN ADECUACION FILTRO DE PROCESOS TELETON                   112650      
003597                                                                  112655      
003598 30000-CREA-FILE-S015.                                            112700      
003599*=====================                                            112800      
003600                                                                  112900      
003601     MOVE ZEROS TO W77-DAT-AD1.                                   113000      
003602     PERFORM 31100-DATADIC.                                       113100      
003603     PERFORM GRABA-MOVS VARYING W77-IND FROM 1 BY 1               113200      
003604             UNTIL   W77-IND > 5.                                 113300      
003605     PERFORM LEE-MOVTOS.                                          113400      
003606                                                                  113500      
003607 GRABA-MOVS.                                                      113600      
003608*===========                                                      113700      
003609                                                                  113800      
003610     IF A00-R01-CVETRAN(W77-IND) > 999 OR                         113900      
003611        (A00-R01-CVETRAN(W77-IND)> 730 AND                        113950      
003612         A00-R01-CVETRAN(W77-IND)< 747) OR                        113970      
003613*INICIO CAMBIO CJMG TESOFE 2019                                   113972      
003614        ((A00-R01-CVETRAN(W77-IND) > 857 AND                      113974      
003615        A00-R01-CVETRAN(W77-IND) < 870) OR                        113976      
003616        A00-R01-CVETRAN(W77-IND) = 873 OR                         113978      
003617        A00-R01-CVETRAN(W77-IND) = 885)                           113980      
003618*FIN CAMBIO CJMG TESOFE 2019                                      113982      
003619        MOVE A00-R01-ESTACION     TO A00-R01-S015-NUMSTA          114000      
003620*INICIA CODIGO PARA PUENTE CRONOS 2000                *** MGGD-CR2114100      
003621*$SET OMIT = OLDCODE                                  *** MGGD-CR2114200      
003622*         MOVE A00-R01-FEC-VEN      TO A00-R01-S015-NUMSTA GGD-CR2114300      
003623*$POP OMIT                                            *** MGGD-CR2114400      
003624*$SET OMIT = NOT OLDCODE                              *** MGGD-CR2114500      
003625*         MOVE ZEROS             TO A2K-FEC-CAMD-001  *** MGGD-CR2114600      
003626*         MOVE A00-R01-FEC-VEN   TO A2K-FEC-CAMD-001  *** MGGD-CR2114700      
003627*         PERFORM A2K-CONV-CAMD-TO-AMD THRU           *** MGGD-CR2114800      
003628*                 A2K-CONV-CAMD-TO-AMD-EXIT           *** MGGD-CR2114900      
003629*         MOVE  A2K-FEC-AMD-001  TO A00-R01-S015-NUMSTA * MGGD-CR2115000      
003630*$POP OMIT                                            *** MGGD-CR2115100      
003631*TERMINA CODIGO PARA PUENTE CRONOS 2000               *** MGGD-CR2115200      
003632        MOVE A00-R01-SUCPROM      TO A00-R01-S015-SUCPRO          115300      
003633        MOVE A00-R01-CONTRATO     TO A00-R01-S015-CNT             115400      
003634        MOVE A00-R01-CVEMDA       TO A00-R01-S015-MDA             115500      
003635        MOVE A00-R01-MDA-SUC      TO A00-R01-S015-SUCMDA          115600      
003636        MOVE A00-R01-MDA-CTA      TO A00-R01-S015-CNTMDA          115700      
003637        MOVE A00-R01-CVETRAN(W77-IND) TO A00-R01-S015-CVETRA      115800      
003638        PERFORM MUEVE-REFERENCIA                                  115900      
003639        MOVE A00-R01-IMPORTE(W77-IND) TO A00-R01-S015-IMP         116000      
003640        MOVE A00-R01-SUCTRAN      TO A00-R01-S015-SUCTRA          116100      
003641        MOVE A00-R01-CAJATRAN     TO A00-R01-S015-CAJTRA          116200      
003642        MOVE A00-R01-AUTORIZA     TO A00-R01-S015-AUTAPL          116300      
003643*       MOVE A00-R01-FECCONT      TO A00-R01-S015-FECMOV          116400      
003644*INICIA CODIGO PARA PUENTE CRONOS 2000                            116500      
003645$SET OMIT = OLDCODE                                               116600      
003646          MOVE A00-R01-FECCONT      TO A00-R01-S015-FECMOV        116700      
003647$POP OMIT                                                         116800      
003648$SET OMIT = NOT OLDCODE                                           116900      
003649          MOVE ZEROS             TO A2K-FEC-CAMD-001              117000      
003650          MOVE A00-R01-FECCONT   TO A2K-FEC-CAMD-001              117100      
003651          PERFORM A2K-CONV-CAMD-TO-AMD THRU                       117200      
003652                  A2K-CONV-CAMD-TO-AMD-EXIT                       117300      
003653          MOVE  A2K-FEC-AMD-001  TO A00-R01-S015-FECMOV           117400      
003654$POP OMIT                                                         117500      
003655*TERMINA CODIGO PARA PUENTE CRONOS 2000                           117600      
003656        PERFORM 31000-NATURALEZA                                  117700      
003657        PERFORM 31200-LEYENDAS                                    117800      
003658        MOVE A00-R02-S015-CTACON  TO A00-R01-S015-CTACON          117900      
003659        MOVE A00-R01-SUCPROM      TO A00-R02-S015-SUCPRO          118000      
003660        PERFORM 31300-CONVERSION-IMPORTE                          118050      
003661* IBM <INICIO> JGVD - CAMPOS NUEVOS, NOMBRE ORD, BANCO EMISOR     118060      
003662        MOVE A00-R01-NOMORD       TO A00-R01-S015-NOMORD          118070      
003663        MOVE A00-R01-NOMB-BCO     TO A00-R01-S015-BCOEMI          118080      
003664        MOVE 0                    TO A00-R01-S015-USO-CTA         118085      
003665* IBM <FIN>    JGVD - CAMPOS NUEVOS, NOMBRE ORD, BANCO EMISOR     118090      
003666        IF (WKS-PT-ENVEDC(A00-R01-S015-CVETRA) = 2 OR 3 OR 4) OR  118100      
003667           (A00-R01-S015-CVETRA = 1009  OR 1072 OR 3018 OR 4016)  118200      
003668*INICIO CJMG CAMBIO TESOFE 2019                                   118210      
003669           IF (A00-R01-CTACON = 61 OR 60)                         118220      
003670               PERFORM GRABA-TESOFE                               118230      
003671           ELSE                                                   118240      
003672*FIN CJMG CAMBIO TESOFE 2019                                      118250      
003673           WRITE REG-SDOSYMOVS015 FROM A00-R01-S015-REGMOV        118300      
003674           ADD 1                     TO W77-TOT-REG               118400      
003675           ADD A00-R01-S015-IMP      TO W77-TOT-IMP.              118500      
003676                                                                  118502      
003677 31300-CONVERSION-IMPORTE.                                        118504      
003678*=========================                                        118506      
003679                                                                  118508      
003680     IF A00-R01-S015-CVETRA > 730 AND A00-R01-S015-CVETRA < 747   118512      
003681        MOVE A00-R01-S015-LEYENDA TO WKS-R01-S015-LEYENDA         118514      
003682        MOVE A00-R01-S015-IMP     TO WKS-R01-S015-IMP-ED          118516      
003683        MOVE WKS-R01-S015-IMP-ED  TO WKS-R01-S015-LEYENDA-B       118518      
003684        MOVE WKS-R01-S015-LEYENDA TO A00-R01-S015-LEYENDA         118520      
003685        MOVE ZEROS                TO A00-R01-S015-IMP.            118522      
003686                                                                  118600      
003687 MUEVE-REFERENCIA.                                                118605      
003688*=================                                                118610      
003689     MOVE A00-R01-REFNUM             TO A00-R01-S015-REF.         118615      
003690     IF A00-R01-CVETRAN(W77-IND) =   1134 OR 1135 OR 1136 OR      118620      
003691                                     1137 OR 2227 OR 2228         118622      
003692        MOVE A00-R01-REF-CECO        TO A00-R01-S015-REF          118625      
003693     ELSE                                                         118630      
003694*    IF A00-R01-CVETRAN(W77-IND) =   1133 OR 2226                 118635      
003695*       MOVE A01-R01-REF-CLIENTE     TO WKS-R01-REF-CLIENTE-R     118645      
003696*       MOVE WKS-R01-REF-CLIENTE-R1  TO A00-R01-S015-REF.         118650      
003697* MDP INICIA 16-02-2011                                           118652      
003698     IF A00-R01-NIO IS NUMERIC OR                                 118660      
003699        A00-R01-NIO = ALL SPACES                                  118663      
003700        NEXT SENTENCE                                             118664      
003701     ELSE                                                         118666      
003702     IF A00-R01-CVETRAN(W77-IND) = 1133                           118668      
003703        MOVE 0                       TO WKS-REF-NONUM             118669      
003704        MOVE A01-R01-REFERENCIA1     TO WKS-A01-REF-35            118670      
003705        MOVE WKS-A01-REF-PRI-10      TO WKS-R01-REF1              118671      
003706        IF WKS-R01-REF1 = ALL SPACES                              118673      
003707           NEXT SENTENCE                                          118674      
003708        ELSE                                                      118675      
003709           PERFORM VALIDA-REF VARYING WKS-I FROM 1 BY 1           118676      
003710                              UNTIL WKS-I         > 10 OR         118677      
003711                                    WKS-REF-NONUM > 0             118678      
003712           IF WKS-REF-NONUM = 0                                   118679      
003713              UNSTRING WKS-R01-REF1      DELIMITED BY " "         118680      
003714              INTO  WKS-A01-R01-REFNUM-AUX                        118682      
003715              MOVE  WKS-A01-R01-REFNUM-AUX                        118684      
003716                                        TO A00-R01-S015-REF       118690      
003717           ELSE                                                   118692      
003718              MOVE A00-R01-REFNUM       TO A00-R01-S015-REF.      118693      
003719 VALIDA-REF.                                                      118694      
003720*==================                                               118696      
003721     IF WKS-A01-R01-REF(WKS-I) IS NOT = SPACE AND                 118698      
003722        WKS-A01-R01-REF(WKS-I) IS NOT NUMERIC                     118700      
003723        MOVE 1 TO WKS-REF-NONUM.                                  118710      
003724* MDP TERMINA 16-02-2011                                          118720      
003725                                                                  118730      
003726 LEE-MOVTOS.                                                      118750      
003727*===========                                                      118800      
003728                                                                  118900      
003729     READ MOVS151 INTO A00-R01-REGMOV AT END                      119000      
003730          MOVE 1 TO W77-FINLOG.                                   119100      
003731                                                                  119200      
003732 LEE-SALDO.                                                       119300      
003733*==========                                                       119400      
003734                                                                  119500      
003735     READ SALDOS015 INTO A00-R02-S015-SDOS AT END                 119600      
003736          MOVE 1 TO W77-FINSDO.                                   119700      
003737                                                                  119800      
003738 31000-NATURALEZA.                                                119900      
003739*=================                                                120000      
003740                                                                  120100      
003741     IF A00-R01-S015-CVETRA > 5000                                120200      
003742        MOVE "*"                  TO A00-R01-S015-MOVALFA         120300      
003743        MOVE 3                    TO A00-R01-S015-MOVNUM          120400      
003744     ELSE                                                         120500      
003745     IF A00-R01-S015-CVETRA = 1009 OR 1072                        120600      
003746        MOVE "A"               TO A00-R01-S015-MOVALFA            120700      
003747     ELSE                                                         120800      
003748     IF A00-R01-S015-CVETRA = 3009 OR 3036                        120900      
003749        MOVE "*"               TO A00-R01-S015-MOVALFA            121000      
003750     ELSE                                                         121100      
003751        MOVE WKS-PT-NATURALEZA(A00-R01-S015-CVETRA) TO            121200      
003752                                     A00-R01-S015-MOVNUM          121300      
003753        IF WKS-PT-NATURALEZA(A00-R01-S015-CVETRA) = 1             121400      
003754           MOVE "C"               TO A00-R01-S015-MOVALFA         121500      
003755        ELSE                                                      121600      
003756        IF WKS-PT-NATURALEZA(A00-R01-S015-CVETRA) = 2             121700      
003757           MOVE "A"               TO A00-R01-S015-MOVALFA         121800      
003758        ELSE                                                      121900      
003759           MOVE "*"               TO A00-R01-S015-MOVALFA.        122000      
003760                                                                  122100      
003761 31100-DATADIC.                                                   122200      
003762*==============                                                   122300      
003763                                                                  122400      
003764     IF A00-R01-APUDES > 0 AND (NOT W88-DAT-AD1)                  122500      
003765        COMPUTE W77-NUM-REG = A00-R01-APUDES + 1                  122600      
003766        READ L02-DATOS INTO A01-R01-DATOS                         122700      
003767          INVALID KEY                                             122800      
003768             MOVE ZEROS       TO  W77-DAT-AD1                     122900      
003769             MOVE SPACES       TO      WLI-ENCAB-52,TEXTO-LJ      123000      
003770             MOVE "E"         TO  TIPO-LJ                         123100      
003771             MOVE 010105      TO  CODIGO-LJ                       123200      
003772             COMPUTE W77-NUM-REG = W77-NUM-REG - 1                123300      
003773             STRING "ERROR AL LEER DATOS ADICIONALES APUNTADOR : "123400      
003774              , W77-NUM-REG DELIMITED BY SIZE INTO TEXTO-LJ       123500      
003775             MOVE TIPO-LJ        TO      WLI-TIPO-LJ              123600      
003776             MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ             123700      
003777             PERFORM  000-030-IMPRIME-MENSAJE                     123800      
003778             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ. 123900      
003779     IF A01-R01-TIPREG = 1                                        124000      
003780        MOVE 1  TO W77-DAT-AD1.                                   124100      
003781                                                                  124200      
003782 31200-LEYENDAS.                                                  126500      
003783*===============                                                  126600      
003784                                                                  126700      
003785     IF W77-IND = 1 AND W88-DAT-AD1 AND A00-R01-INDLEY(1) > 0     126800      
003786        MOVE A01-R01-LEY1   TO      A00-R01-S015-LEYENDA          126900      
003787*INICIO CJPL LEY DE TRANSPARENCIA ISI FIN                         126925      
003788        PERFORM 31200-LEYENDAS-MOVSEXT                            126950      
003789* INI CAMBIO AGF                                                  126960      
003790*        PERFORM 13300-LEYENDAS-TAXID                             126980      
003791     ELSE                                                         127000      
003792     IF W77-IND = 2 AND W88-DAT-AD1 AND A00-R01-INDLEY(2) > 0     127100      
003793        MOVE A01-R02-LEY2   TO      A00-R01-S015-LEYENDA          127200      
003794*INICIO CJPL LEY DE TRANSPARENCIA ISI FIN                         127225      
003795        PERFORM 31200-LEYENDAS-MOVSEXT                            127250      
003796* INI CAMBIO AGF                                                  127260      
003797*        PERFORM 13300-LEYENDAS-TAXID                             127280      
003798     ELSE                                                         127300      
003799     IF W77-IND = 3 AND W88-DAT-AD1 AND A00-R01-INDLEY(3) > 0     127400      
003800        MOVE A01-R02-LEY3   TO      A00-R01-S015-LEYENDA          127500      
003801*INICIO CJPL LEY DE TRANSPARENCIA ISI FIN                         127525      
003802        PERFORM 31200-LEYENDAS-MOVSEXT                            127550      
003803* INI CAMBIO AGF                                                  127560      
003804*        PERFORM 13300-LEYENDAS-TAXID                             127580      
003805     ELSE                                                         127600      
003806     IF W77-IND =  4 AND W88-DAT-AD1 AND A00-R01-INDLEY(4) > 0    127700      
003807        MOVE A01-R02-LEY4   TO      A00-R01-S015-LEYENDA          127800      
003808*INICIO CJPL LEY DE TRANSPARENCIA ISI FIN                         127825      
003809        PERFORM 31200-LEYENDAS-MOVSEXT                            127850      
003810* INI CAMBIO AGF                                                  127860      
003811*        PERFORM 13300-LEYENDAS-TAXID                             127880      
003812     ELSE                                                         127900      
003813     IF W77-IND = 5 AND W88-DAT-AD1 AND A00-R01-INDLEY(5) > 0     128000      
003814        MOVE A01-R02-LEY5   TO      A00-R01-S015-LEYENDA          128100      
003815*INICIO CJPL LEY DE TRANSPARENCIA ISI FIN                         128125      
003816        PERFORM 31200-LEYENDAS-MOVSEXT                            128150      
003817* INI CAMBIO AGF                                                  128160      
003818*        PERFORM 13300-LEYENDAS-TAXID                             128180      
003819     ELSE                                                         128200      
003820        MOVE SPACES         TO      A00-R01-S015-LEYENDA.         128210      
003821     PERFORM 13300-LEYENDAS-TAXID.                                128260      
003822* MDP INICIA 16-02-2011                                           128301      
003823     IF A00-R01-NIO IS NUMERIC OR                                 128302      
003824        A00-R01-NIO = ALL SPACES                                  128303      
003825        NEXT SENTENCE                                             128304      
003826     ELSE                                                         128305      
003827        IF A00-R01-CVETRAN(W77-IND) = 1133                        128307      
003828           IF A01-R01-REF2-CTE = ALL SPACES                       128308      
003829              MOVE A00-R01-NOMORD   TO  A00-R01-S015-LEYENDA      128309      
003830           ELSE                                                   128310      
003831              MOVE A01-R01-REF2-CTE TO  A00-R01-S015-LEYENDA.     128311      
003832                                                                  128314      
003833* MDP TERMINA 16-02-2011                                          128315      
003834                                                                  128316      
003835* INICIO CJPL LEY DE TRANSPARENCIA ISI                            128317      
003836 31200-LEYENDAS-MOVSEXT.                                          128320      
003837*=======================                                          128325      
003838     IF A00-R01-CVETRAN(W77-IND) = 1133 AND                       128330      
003839     (A00-R01-SIST-ORIG = 0264 OR = 264)                          128335      
003840        MOVE A00-R01-S015-LEYENDA    TO   WKS-DESC-TRANS          128340      
003841        MOVE A00-R01-REFNUM          TO   WKS-NUM-ORD-S264        128345      
003842        MOVE A00-R01-NOMORD          TO   WKS-NOM-ORD             128350      
003843        MOVE WKS-LEYENDA-TRANS       TO A00-R01-S015-LEYENDA.     128355      
003844* FIN CJPL LEY DE TRANSPARENCIA ISI                               128360      
003845* INI CAMBIOS AGF                                                 128370      
003846 13300-LEYENDAS-TAXID.                                            128380      
003847*=====================                                            128390      
003848   IF WKS-POSCI-TAX(A00-R01-CVETRAN(W77-IND)) > 0                 128420      
003849      MOVE WKS-POSCI-TAX(A00-R01-CVETRAN(W77-IND)) TO WKS-POSTAX  128430      
003850      MOVE A00-R01-S015-LEYENDA                TO WKS-LEYENDAS    128440      
003851      MOVE WKS-TAX-ID(WKS-POSTAX)                  TO WKS-TXID    128450      
003852      MOVE LEYENDAS-TAXID                      TO                 128460      
003853                                             A00-R01-S015-LEYENDA.128470      
003854                                                                  128494      
003855* FIN CAMBIOS AGF                                                 128500      
003856                                                                  128550      
003857 GRABA-RESTO-SDOS.                                                128600      
003858*=================                                                128700      
003859                                                                  128800      
003860     WRITE REG-SDOSYMOVS015 FROM A00-R02-S015-SDOS.               128900      
003861     ADD 1                  TO W77-TOT-REG.                       129000      
003862     ADD A00-R02-S015-SDOACT TO W77-TOT-IMP.                      129100      
003863                                                                  129200      
003864     READ SALDOS015 INTO A00-R02-S015-SDOS AT END                 129300      
003865          MOVE 1 TO W77-FINSDO.                                   129400      
003866*INICIA CODIGO DE RENOVACION CRONOS 2000                          129500      
003867*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003868*  COPY "S151/CRONOS2K/CPY/PD".                                   129600      
003869** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
003870** Unisys has defined for CRONOS2K project                     ** 000200      
003871** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
003872***************************************************************** 000400      
003873***************************************************************** 000600      
003874** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
003875** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
003876** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
003877** date MMDDCCAA, which is returned into the variable          ** 001000      
003878** A2K-FEC-MDCA-001.                                           ** 001100      
003879***************************************************************** 001200      
003880                                                                  001300      
003881 A2K-ACCEPT-TODAYS-DATE.                                          001400      
003882        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
003883*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
003884        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
003885        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
003886        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
003887        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
003888        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
003889                                                                  002200      
003890 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
003891        EXIT.                                                     002240      
003892                                                                  002500      
003893****************************************************************  002600      
003894** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
003895**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
003896**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
003897**baseyear to add the century to the year part.               **  003000      
003898**INPUT is A2K-FEC-AMD-001                                    **  003100      
003899**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
003900****************************************************************  003300      
003901                                                                  003400      
003902 A2K-CONV-AMD-TO-CAMD.                                            003500      
003903         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
003904         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
003905         IF A2K-FEC-AMD-001 = 0                                   003720      
003906            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
003907         ELSE                                                     003741      
003908          IF A2K-FEC-AMD-001 = 999999                             003742      
003909             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
003910         ELSE                                                     003760      
003911         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
003912                 A2K-OBTAIN-CENTURY-EXIT                          003900      
003913         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
003914         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
003915         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
003916         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
003917                                                                  004400      
003918 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
003919         EXIT.                                                    004600      
003920                                                                  004700      
003921******************************************************************004800      
003922**A2K-CONV-MDA-TO-MDCA.                                         **004900      
003923**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
003924** an eight digit format as MMDDCCAA. It use a                  **005100      
003925** baseyear to add century to the yaer.                         **005200      
003926** INPUT is A2K-FEC-MDA-001                                     **005300      
003927** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
003928                                                                  005500      
003929 A2K-CONV-MDA-TO-MDCA.                                            005600      
003930     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
003931     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
003932     IF A2K-FEC-MDA-001 = 0                                       005820      
003933        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
003934     ELSE                                                         005845      
003935      IF A2K-FEC-MDA-001 = 999999                                 005850      
003936         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
003937     ELSE                                                         005860      
003938     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
003939             A2K-OBTAIN-CENTURY-EXIT                              006000      
003940     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
003941     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
003942     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
003943     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
003944                                                                  006500      
003945 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
003946     EXIT.                                                        006700      
003947                                                                  006800      
003948***************************************************************** 006900      
003949**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
003950**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
003951**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
003952**baseyear to add century to the year.                         ** 007300      
003953**INPUT is A2K-FEC-DMA-001                                     ** 007400      
003954**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
003955                                                                  007600      
003956 A2K-CONV-DMA-TO-DMCA.                                            007700      
003957       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
003958       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
003959       IF  A2K-FEC-DMA-001   = 0                                  007920      
003960          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
003961       ELSE                                                       007945      
003962        IF A2K-FEC-DMA-001 = 999999                               007950      
003963          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
003964       ELSE                                                       007960      
003965       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
003966               A2K-OBTAIN-CENTURY-EXIT                            008100      
003967       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
003968       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
003969       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
003970       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
003971                                                                  008600      
003972 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
003973       EXIT.                                                      008800      
003974                                                                  008900      
003975***************************************************************** 009000      
003976** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
003977** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
003978** a 6 digit format as AAMMDD.                                 ** 009300      
003979** It simply removes the century information in the output     ** 009400      
003980** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
003981** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
003982                                                                  009700      
003983 A2K-CONV-CAMD-TO-AMD.                                            009800      
003984     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
003985     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
003986     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
003987     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
003988                                                                  010300      
003989 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
003990      EXIT.                                                       010500      
003991                                                                  010600      
003992******************************************************************010700      
003993******************************************************************010800      
003994** A2K-CONV-MDCA-TO-MDA.                                        **010900      
003995** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
003996** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
003997** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
003998** INPUT is A2K-FEC-MDCA-001                                    **011300      
003999** OUTPUT is A2K-FEC-MDA-001                                    **011400      
004000                                                                  011500      
004001 A2K-CONV-MDCA-TO-MDA.                                            011600      
004002     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
004003     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
004004     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
004005     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
004006                                                                  012100      
004007 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
004008      EXIT.                                                       012300      
004009                                                                  012400      
004010******************************************************************012500      
004011***************************************************************** 012600      
004012** A2K-CONV-DMCA-TO-DMA.                                        **012700      
004013** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
004014** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
004015** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
004016** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
004017** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
004018                                                                  013300      
004019 A2K-CONV-DMCA-TO-DMA.                                            013400      
004020     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
004021     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
004022     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
004023     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
004024                                                                  013900      
004025 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
004026      EXIT.                                                       014100      
004027                                                                  014200      
004028***************************************************************** 014300      
004029 A2K-CONV-MDCA-TO-CAMD.                                           014400      
004030      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
004031      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
004032      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
004033      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
004034      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
004035 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
004036      EXIT.                                                       015100      
004037***************************************************************** 015200      
004038** This paragraph adds century to an year field which is 9(02) ** 015300      
004039** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
004040** Output is A2K-FEC-CCAA-001.                                 ** 015600      
004041***************************************************************** 015700      
004042 A2K-CONV-AA-TO-CCAA.                                             015800      
004043      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
004044      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
004045              A2K-OBTAIN-CENTURY-EXIT.                            016100      
004046      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
004047 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
004048      EXIT.                                                       016400      
004049***************************************************************** 016500      
004050** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
004051** format.                                                     ** 016700      
004052** Input is A2K-FEC-DMCA-001.                                  ** 016800      
004053** Output is A2K-FEC-CAMD-001.                                 ** 016900      
004054***************************************************************** 017000      
004055 A2K-CONV-DMCA-TO-CAMD.                                           017100      
004056      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
004057      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
004058      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
004059      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
004060      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
004061 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
004062      EXIT.                                                       017800      
004063***************************************************************** 017900      
004064** This paragraph desides the Century to be added depending    ** 018000      
004065** on the base year.                                           ** 018100      
004066** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
004067** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
004068***************************************************************** 018400      
004069 A2K-OBTAIN-CENTURY.                                              018500      
004070      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
004071          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
004072      ELSE                                                        018800      
004073          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
004074 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
004075      EXIT.                                                       019100      
004076                                                                  019200      
004077***************************************************************** 019300      
004078** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
004079**  Format                                                     ** 019500      
004080** Input Is A2K-FEC-CAMD-001                                   ** 019600      
004081** Output Is A2K-FEC-DMCA-001                                  ** 019700      
004082***************************************************************** 019800      
004083 A2K-CONV-CAMD-TO-DMCA.                                           019900      
004084      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
004085      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
004086      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
004087      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
004088      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
004089                                                                  020500      
004090 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
004091      EXIT.                                                       020700      
004092                                                                  020800      
004093******************************************************************020900      
004094******************************************************************021000      
004095 A2K-CONV-AM-TO-CAM.                                              021100      
004096      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
004097      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
004098      IF A2K-FEC-AM-001 = 0                                       021220      
004099         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
004100      ELSE                                                        021245      
004101      IF A2K-FEC-AM-001 = 9999                                    021250      
004102         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
004103      ELSE                                                        021260      
004104      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
004105      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
004106      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
004107              A2K-OBTAIN-CENTURY-EXIT                             021600      
004108      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
004109                                                                  021800      
004110 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
004111      EXIT.                                                       022000      
004112                                                                  022100      
004113******************************************************************022200      
004114******************************************************************022300      
004115 A2K-CONV-CAM-TO-AM.                                              022400      
004116      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
004117      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
004118      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
004119                                                                  022800      
004120 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
004121   EXIT.                                                          023000      
004122                                                                  023100      
004123                                                                  023200      
004124                                                                  023500      
004125*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
004126 A2K-CPY-EXIT-PARA.                                               129700      
004127  EXIT.                                                           129800      
004128*TERMINA CODIGO DE RENOVACION CRONOS 2000                         129900      
004129**** Inicia cambio Fabrica de software **** Abarbosa       P05-355130000      
004130*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
004131* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP001 ON CMEMP."         130100      
004132*                                      FROM 100000 TO 999999      130200      
004133                                                                  100000      
004134*----------------------------------------------------------------*100100      
004135*   PROCEDIMIENTO DE CALCULO DINAMICO DE ESPACIO PARA EL SORT    *100200      
004136*----------------------------------------------------------------*100300      
004137 70000-CALCULA-ESPACIO.                                           100400      
004138*======================                                           100500      
004139     IF W77-FRAMESIZE             =   8                           100600      
004140        COMPUTE WS-CALC-WORD      =   W77-MAXRECSIZE              100700      
004141                                  /   6                           100800      
004142        IF WS-WORD-RES            >   ZEROS                       100900      
004143           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                 101000      
004144                                  +   1                           101100      
004145        ELSE                                                      101200      
004146           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                .101300      
004147                                                                  101400      
004148     COMPUTE W77-MEMORY-SIZE ROUNDED                              101500      
004149                                  =   (W77-MAXRECSIZE + 3)        101600      
004150                                  *   2000                        101700      
004151                                  +   1500                        101800      
004152                                                                  101900      
004153     COMPUTE W77-DISK-SIZE ROUNDED                                102000      
004154                                  =   W77-MAXRECSIZE              102100      
004155                                  *   W77-LASTRECORD              102200      
004156                                  *   3.5                        .102300      
004157                                                                  102400      
004158*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
004159**** Fin    cambio Fabrica de software **** Abarbosa       P05-355130300      
004160******************************************************************130400      
004161*        INICIO        CJMG        TESOFE        2019            *130500      
004162******************************************************************130600      
004163 GRABA-TESOFE.                                                    130700      
004164*=============                                                    130800      
004165    MOVE 0 TO W77-REG-02                                          130900      
004166              W77-REGISTRO.                                       131000      
004167                                                                  131100      
004168*    IF A00-R01-CTACON = 60                                       131200      
004169*       IF A01-R01-APUDES > 0                                     131300      
004170*          PERFORM LEE-ADIC-TESOFE.                               131400      
004171                                                                  131500      
004172    IF A00-R01-CTACON = 60 OR 61                                  131600      
004173       MOVE A00-R01-CTACON      TO A00-R01-S015-USO-CTA           131700      
004174       WRITE REG-SDOSYMOVS015 FROM A00-R01-S015-REGMOV            131800      
004175       ADD 1                     TO W77-TOT-REG                   131900      
004176       ADD A00-R01-S015-IMP      TO W77-TOT-IMP                   132000      
004177       IF A01-R01-APUDES > 0                                      132100      
004178          PERFORM LEE-ADIC-TESOFE.                                132200      
004179                                                                  132300      
004180 LEE-ADIC-TESOFE.                                                 132400      
004181*================                                                 132500      
004182    MOVE A01-R01-APUDES TO W77-REGISTRO                           132600      
004183    COMPUTE W77-NUM-REG = A01-R01-APUDES + 1                      132700      
004184    READ L02-DATOS        INTO A01-R02-TESOFE                     132800      
004185         INVALID KEY                                              132900      
004186    MOVE 1              TO W77-REG-02.                            133000      
004187                                                                  133100      
004188    IF W77-REGISTRO > 0 AND W77-REG-02 = 0 AND                    133200      
004189       A01-R02-INDCTACON-SUBC = 62 OR 63                          133300      
004190       MOVE A01-R02-INDCTACON-SUBC TO A00-R01-S015-USO-CTA        133400      
004191       MOVE A01-R02-CONT-SUBC      TO A00-R01-S015-CNT            133500      
004192       WRITE REG-SDOSYMOVS015 FROM A00-R01-S015-REGMOV            133600      
004193       ADD 1                     TO W77-TOT-REG                   133700      
004194       ADD A00-R01-S015-IMP      TO W77-TOT-IMP.                  133800      
004195******************************************************************133900      
004196*         FIN         CJMG         TESOFE        2019            *134000      
004197******************************************************************134100      
