000001$SET LIST MAP XREF LINEINFO ERRORLIMIT=100                        000100      
000002*INICIA CODIGO DE RENOVACION CRONOS 2000                          000200      
000003$SET LISTOMITTED                                                  000300      
000004$SET OLDCODE                                                      000400      
000005*TERMINA CODIGO DE RENOVACION CRONOS 2000                         000500      
000006$SET OPTIMIZE                                                     000600      
000007******************************************************************000700      
000008*  PROGRAMA QUE ACTUALIZA LA BASE DE DATOS SEMANAL DEL S151,     *000800      
000009*  S151BD10MOVDIA151 (DATA SET B50).                             *000900      
000010*   FUNCIONES:                                                   *001000      
000011*     -EXTRAER DE LA BASE DE CONTROL LA FECHA DE PROCESO DEL SIST*001100      
000012*      ORIGEN.                                                   *001200      
000013*     - EXTRAER LA FECHA DE PROCESO DEL SISTEMA ORIGEN           *001300      
000014*     - EXTRAER EL NOMBRE DE LA BASE DE DIARIA DEL SISTEMA       *001400      
000015*     - EXTRAER EL NOMBRE DEL ARCHIVO DE MOVIMIENTOS             *001500      
000016*     - ABRIR BASE DIARIA Y ARCHIVO A PROCESAR                   *001600      
000017*     - CERRAR BD DE CONTROL                                     *001700      
000018*     - LEER EL ARCHIVO DE MOVIMIENTOS SELECCIONADO AQUELLOS     *001800      
000019*       QUE TENGAN EL CAMPO DE FUNCION = 1 Y STATUS = 1 Y        *001900      
000020*       FECCONT <= FECHA DE PROCESO. CREANDO UN ARCHIVO EL CUAL  *002000      
000021*       CONTENGA LA SIGUIENTE INFORMACION:                       *002100      
000022*         FECHA DE PROCESO                                       *002200      
000023*         NUMERO DE PROCESO                                      *002300      
000024*         NUMERO DE PRODUCTO                                     *002400      
000025*         NUMERO DE INSTRUMENTO                                  *002500      
000026*         NUMERO DE MONEDA                                       *002600      
000027*         TIPO DE MOVIMIENTO                                     *002700      
000028*         TIPO DE ESQUEMA CONTABLE                               *002800      
000029*         TIPO DE ESQUEMA CONTABLE                               *002900      
000030*         IMPORTE                                                *003000      
000031*                                                                *003010      
000032* RECOMPILACION POR EL UPGRADE DEL MCP A 55                      *003012      
000033* 20141208 15MTP001 MJGRG                                        *003014      
000034******************************************************************003100      
000035 IDENTIFICATION DIVISION.                                         003200      
000036 PROGRAM-ID.      P111.                                           003300      
000037 AUTHOR.          ROBERTO HERNANDEZ MORENO.                       003400      
000038 INSTALLATION.    BANAMEX.                                        003500      
000039 DATE-WRITTEN.    NOVIEMBRE 1995.                                 003600      
000040 ENVIRONMENT DIVISION.                                            003700      
000041 INPUT-OUTPUT SECTION.                                            003800      
000042 FILE-CONTROL.                                                    003900      
000043      SELECT L01-DATOS             ASSIGN TO DISK.                004000      
000044                                                                  004100      
000045      SELECT A01-SDO-MOVS          ASSIGN TO SORT DISK.           004200      
000046                                                                  004300      
000047      SELECT A02-ARCH-SORT         ASSIGN TO DISK.                004400      
000048                                                                  004500      
000049      SELECT V00-REPORTE2          ASSIGN TO PRINTER.             004600      
000050                                                                  004700      
000051/                                                                 004800      
000052 DATA DIVISION.                                                   004900      
000053 FILE SECTION.                                                    005000      
000054                                                                  005100      
000055 FD L01-DATOS                                                     005200      
000056    VALUE OF MAXRECSIZE IS 75                                     005300      
000057             FRAMESIZE  IS 48                                     005400      
000058    VALUE OF TITLE IS WKS-TIT-LOG151                              005500      
000059    BLOCK  CONTAINS 144 RECORDS.                                  005600      
000060 01  L01-R00-DAT                   PIC X(450).                    005700      
000061                                                                  005800      
000062 SD A01-SDO-MOVS.                                                 005900      
000063 01  A01-R00-REG.                                                 006000      
000064     03 A01-R00-KEY                PIC X(42).                     006100      
000065     03 A01-R00-IMPORTE            PIC 9(16)V99.                  006200      
000066                                                                  006400      
000067 FD A02-ARCH-SORT                                                 006500      
000068     VALUE OF TITLE IS WKS-TIT-SORT,                              006600      
000069     BLOCK CONTAINS 900 RECORDS,                                  006700      
000070     RECORD CONTAINS 60 CHARACTERS,                               006800      
000071     VALUE OF AREAS IS 1000, AREASIZE IS 6000.                    006900      
000072 01 A02-R00-REG-DISK               PIC X(60).                     007000      
000073                                                                  007100      
000074 FD V00-REPORTE2                                                  007200      
000075     VALUE OF TITLE IS WKS-TIT-REPORTE2.                          007300      
000076                                                                  007400      
000077 01 V00-R00-REPORTE2               PIC X(132).                    007500      
000078*                                                                 007600      
000079 DATA-BASE SECTION.                                               007700      
000080 DB MOVDB = S151BD10MOVDIA151.                                    007800      
000081                                                                  007900      
000082 WORKING-STORAGE SECTION.                                         008000      
000083*INICIA CODIGO DE RENOVACION CRONOS 2000                          008100      
000084*  COPY "S151/CRONOS2K/CPY/WS".                                   008200      
000085*  01  A2K-BASE-YEAR     PIC 9(02) VALUE  50.                     008300      
000086*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008400      
000087                                                                  008500      
000088*=============    VARIABLES LIBRERIA DE CONTROL    ============== 008600      
000089                                                                  008700      
000090*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000091*  COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL.".                 008800      
000092*================================================================ 000100      
000093*         ENTRY-POINT CONSISDIA :                               = 000200      
000094*                                                                 000300      
000095* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000096* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000097* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000098* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000099* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000100* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000101* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000102* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000103* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000104* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000105*                                                               = 001400      
000106*================================================================ 001500      
000107                                                                  001600      
000108                                                                  001700      
000109*================================================================ 001800      
000110* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000111*                                                               = 002000      
000112* ENTRADA REQUERIDA :                                           = 002100      
000113*                                                               = 002200      
000114*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000115*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000116*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000117*================================================================ 002600      
000118 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000119    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000120    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000121    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000122    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000123    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000124    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000125    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000126    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000127    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000128    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000129    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000130    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000131    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000132    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000133    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000134    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000135    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000136    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000137    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000138    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000139       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000140       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000141       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000142       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000143*==============================================================   005200      
000144*                                                             =   005300      
000145* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000146*                                                             =   005500      
000147* CAMPOS REQUERIDOS :                                         =   005600      
000148*                                                             =   005700      
000149* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000150* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000151* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000152* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000153*==============================================================   006200      
000154 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000155    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000156    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000157    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000158    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000159                                                                  006800      
000160*==============================================================   006900      
000161*                                                             =   007000      
000162* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000163*                                                             =   007200      
000164* CAMPOS REQUERIDOS :                                         =   007300      
000165*                                                             =   007400      
000166* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000167* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000168* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000169* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000170*==============================================================   007900      
000171 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000172    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000173    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000174    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000175    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000176                                                                  008500      
000177*==============================================================   008600      
000178*                                                             =   008700      
000179* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000180*                                                             =   008900      
000181* CAMPOS REQUERIDOS :                                         =   009000      
000182*                                                             =   009100      
000183* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000184* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000185* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000186* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000187*==============================================================   009600      
000188 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000189    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000190    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000191    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000192    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000193                                                                  010200      
000194*============================================================     010300      
000195* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000196*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000197*                                                           =     010600      
000198*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000199*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000200*                                                           =     010900      
000201*  ENTRADA REQUERIDA.                                       =     011000      
000202*                                                           =     011100      
000203*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000204*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000205*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000206*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000207*============================================================     011600      
000208                                                                  011700      
000209 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000210     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000211     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000212     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000213     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000214                                                                  012300      
000215*=============================================================    012400      
000216*                                                            =    012500      
000217* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000218*             B01-SIS-FECARMOV.                              =    012700      
000219*                                                            =    012800      
000220* ENTRADA REQUERIDAD :                                       =    012900      
000221*                                                            =    013000      
000222*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000223*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000224*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000225*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000226*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000227*=============================================================    013600      
000228                                                                  013700      
000229 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000230     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000231     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000232     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000233     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000234     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000235*================================================================ 014400      
000236*                                                               = 014500      
000237* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000238*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000239*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000240*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000241*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000242*                                                               = 015100      
000243* ENTRADA REQUERIDA :                                           = 015200      
000244*                                                               = 015300      
000245* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000246* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000247* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000248* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000249* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000250*================================================================ 015900      
000251 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000252    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000253    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000254    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000255    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000256    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000257                                                                  016600      
000258*============================================================     016700      
000259*                                                           =     016800      
000260* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000261*                                                           =     017000      
000262* DATOS REQUERIDOS :                                        =     017100      
000263*                                                           =     017200      
000264* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000265* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000266* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000267* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000268* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000269*============================================================     017800      
000270                                                                  017900      
000271 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000272     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000273     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000274     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000275     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000276     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000277                                                                  018600      
000278*============================================================     018700      
000279*                                                           =     018800      
000280* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000281*                                                           =     019000      
000282* DATOS REQUERIDOS :                                        =     019100      
000283*                                                           =     019200      
000284* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000285* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000286* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000287* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000288* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000289*============================================================     019800      
000290                                                                  019900      
000291 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000292     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000293     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000294     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000295     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000296     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000297                                                                  020600      
000298*===============================================================  020700      
000299*                                                              =  020800      
000300* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000301*              MOVIMIENTOS.                                    =  021000      
000302* DATOS REQUERIDOS :                                           =  021100      
000303*                                                              =  021200      
000304* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000305* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000306* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000307* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000308* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000309* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000310*==============================================================   021900      
000311                                                                  022000      
000312 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000313     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000314     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000315     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000316     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000317     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000318     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000319*==============================================================   022800      
000320*                                                             =   022900      
000321* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000322*                                                             =   023100      
000323* CAMPOS REQUERIDOS :                                         =   023200      
000324*                                                             =   023300      
000325* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000326* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000327* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000328* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000329*==============================================================   023800      
000330 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000331    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000332    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000333    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000334    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000335                                                                  024304      
000336*=================================================================024306      
000337*                ENTRY POINT CONSISB01                           =024308      
000338*                                                                =024310      
000339*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000340*                                                                =024314      
000341*  FUNCIONES DISPONIBLES :                                       =024316      
000342*                                                                =024318      
000343*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000344*                                                                =024322      
000345*  PARAMETROS REQUERIDOS                                         =024324      
000346*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000347*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000348*=================================================================024330      
000349                                                                  024332      
000350 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000351     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000352     03 WKS-CON-CSI                PIC 9(02).                     024336      
000353     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000354     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000355        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000356        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000357        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000358        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000359        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000360                                                                  024400      
000361*=================================================================024500      
000362*                ENTRY POINT B02ARCINTER                         =024600      
000363*                                                                =024700      
000364*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000365*                                                                =024900      
000366*  FUNCIONES DISPONIBLES :                                       =025000      
000367*                                                                =025100      
000368*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000369* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000370* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000371* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000372*                                                                =025600      
000373*  PARAMETROS REQUERIDOS                                         =025700      
000374*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000375*                                                                =025900      
000376*=================================================================026000      
000377 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000378     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000379     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000380     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000381     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000382     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000383     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000384     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000385     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000386     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000387     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000388     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000389     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000390     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000391     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000392     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000393     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000394     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000395     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000396     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000397     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000398     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000399     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000400     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000401     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000402     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000403     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000404     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000405     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000406                                                                  029000      
000407*=================================================================029100      
000408*                ENTRY POINT B04SISTEMA                          =029200      
000409*                                                                =029300      
000410*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000411*                                                                =029500      
000412*  FUNCIONES DISPONIBLES :                                       =029600      
000413*                                                                =029700      
000414*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000415*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000416*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000417*                                                                =030100      
000418*  PARAMETROS REQUERIDOS                                         =030200      
000419*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000420*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000421*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000422*                                                                =030600      
000423*=================================================================030700      
000424 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000425     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000426     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000427     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000428     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000429     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000430     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000431     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000432                                                                  031600      
000433*================================================================ 031700      
000434*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000435*                                                               = 031900      
000436*  FUNCION                                                      = 032000      
000437*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000438*   19       ALTAS.                                             = 032200      
000439*   22       BAJAS                                              = 032300      
000440*   37       CAMBIOS.                                           = 032400      
000441*                                                               = 032500      
000442*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000443*                      FECHA DE PROCESO                         = 032700      
000444*                      NUMERO DE PROCESO                        = 032800      
000445*                      FECHA INICIO                             = 032900      
000446*                      REGISTRO INICIAL                         = 033000      
000447*================================================================ 033100      
000448                                                                  033200      
000449 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000450     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000451     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000452     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000453     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000454     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000455     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000456     03 WKS-B05-MIX                PIC 9(08).                     034000      
000457     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000458     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000459     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000460     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000461     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000462     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000463                                                                  034700      
000464                                                                  034800      
000465*================================================================ 034900      
000466*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000467*                                                               = 035100      
000468*  FUNCION                                                      = 035200      
000469*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000470*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000471*                                                               = 035500      
000472*================================================================ 035600      
000473                                                                  035700      
000474 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000475     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000476     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000477     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000478     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000479     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000480     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000481                                                                  036500      
000482*===============================================================  036600      
000483*                                                              =  036700      
000484*         ENTRY-POINT CONSISMEN                                =  036800      
000485*                                                              =  036900      
000486*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000487*                      SISTEMA                                 =  037100      
000488*                                                              =  037200      
000489*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000490*                                                              =  037400      
000491*===============================================================  037500      
000492 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000493     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000494     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000495     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000496     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000497     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000498     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000499     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000500     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000501     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000502     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000503     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000504     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000505     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000506     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000507     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000508        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000509        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000510        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000511        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000512        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000513        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000514        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000515                                                                  039900      
000516*=====================================================            040000      
000517*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000518*=====================================================            040200      
000519 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000520     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000521     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000522     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000523                                                                  040700      
000524*=====================================================            040800      
000525*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000526*=====================================================            041000      
000527 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000528     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000529     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000530     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000531                                                                  041500      
000532*=====================================================            041600      
000533*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000534*=====================================================            041800      
000535 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000536     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000537     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000538     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000539*=====================================================            042300      
000540*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000541*=====================================================            042500      
000542 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000543     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000544     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000545     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000546                                                                  043000      
000547*=====================================================            043100      
000548*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000549*=====================================================            043300      
000550 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000551     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000552     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000553     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000554                                                                  043800      
000555*=====================================================            043900      
000556*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000557*=====================================================            044100      
000558 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000559     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000560     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000561     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000562                                                                  044600      
000563*=====================================================            044700      
000564*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000565*=====================================================            044900      
000566 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000567     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000568     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000569     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000570                                                                  045400      
000571*=====================================================            045500      
000572*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000573*=====================================================            045700      
000574 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000575     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000576     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000577     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000578                                                                  046200      
000579*=====================================================            046300      
000580*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000581*=====================================================            046500      
000582 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000583     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000584     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000585     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000586                                                                  047000      
000587*=====================================================            047100      
000588*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000589*=====================================================            047300      
000590 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000591     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000592     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000593     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000594                                                                  047800      
000595*=====================================================            047900      
000596*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000597*=====================================================            048100      
000598 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000599     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000600     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000601     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000602                                                                  048600      
000603*=====================================================            048700      
000604*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000605*=====================================================            048900      
000606 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000607     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000608     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000609     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000610                                                                  049400      
000611*=====================================================            049500      
000612*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000613*=====================================================            049700      
000614 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000615     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000616     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000617     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000618     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000619     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000620     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000621     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000622     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000623     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000624     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000625                                                                  050900      
000626*=====================================================            051000      
000627*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000628*=====================================================            051200      
000629 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000630     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000631     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000632     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000633     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000634                                                                  051800      
000635*=====================================================            051900      
000636*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000637*=====================================================            052100      
000638 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000639     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000640     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000641     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000642     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000643                                                                  052700      
000644*=====================================================            052800      
000645*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000646*=====================================================            053000      
000647 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000648     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000649     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000650     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000651     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
000652                                                                  053600      
000653*=====================================================            053700      
000654*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
000655*=====================================================            053900      
000656 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
000657     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
000658     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
000659     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
000660     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
000661                                                                  054500      
000662*=====================================================            054600      
000663*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
000664*=====================================================            054800      
000665 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
000666     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
000667     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
000668     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
000669     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
000670                                                                  055400      
000671*=====================================================            055500      
000672*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
000673*=====================================================            055700      
000674 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
000675     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
000676     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
000677     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
000678     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
000679                                                                  056300      
000680*=====================================================            056400      
000681*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
000682*=====================================================            056600      
000683 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
000684     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
000685     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
000686     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
000687     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
000688                                                                  057200      
000689 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
000690*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000691                                                                  008900      
000692*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000693* COPY "(S151)S151/FORMATO/DISPLAY.".                             009000      
000694                                                                  000100      
000695*===============================================================* 000200      
000696*         FORMATO PARA DISPLAYS                                 * 000300      
000697*===============================================================* 000400      
000698                                                                  000500      
000699 01 WKS-TIT-REPORTE2.                                             000600      
000700    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000701    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000702    02 FILLER                       PIC X(06) VALUE               000900      
000703                                              "/LIST/".           001000      
000704    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000705    02 FILLER                       PIC X(01) VALUE "/".          001071      
000706    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000707    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000708    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000709    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000710    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000711    02 FILLER                       PIC X(11) VALUE               001600      
000712                                              "/001MSGIMP.".      001700      
000713                                                                  002100      
000714 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000715                                                                  002300      
000716***********************************************************       002400      
000717*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000718***********************************************************       002600      
000719 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000720*8D                                                               002800      
000721 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000722 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000723    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000724    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000725    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000726*8D                                                               003400      
000727 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000728 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000729    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000730    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000731    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000732                                                                  004100      
000733 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000734                                                                  004300      
000735 01 WKS-FECHA-HORA2.                                              004400      
000736    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000737    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000738       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000739       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000740    02 WKS-TIME-MAQ2.                                             004600      
000741       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
000742       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
000743          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
000744          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
000745          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
000746       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
000747    02 FILLER                             PIC X(01).              004900      
000748    02 WKS-RESTO2                         PIC X(04).              005000      
000749                                                                  005100      
000750*8D                                                               005200      
000751****************** REPORTE DE MENSAJES *********************      005300      
000752 01 WLI-ENCAB-12.                                                 005400      
000753    03 FILLER                             PIC X(05) VALUE         005500      
000754       "S151-".                                                   005600      
000755    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000756    03 FILLER                             PIC X(15) VALUE         005671      
000757       "-001IMPMENSAJES".                                         005691      
000758    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000759    03 FILLER                             PIC X(34) VALUE         005800      
000760       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000761    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000762    03 FILLER                             PIC X(26) VALUE         006100      
000763       "FECHA DE LA INFORMACION : ".                              006200      
000764    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000765    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000766       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000767       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000768       05  WKS-SLASH1                         PIC X(01).          006356      
000769       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000770       05  WKS-SLASH2                         PIC X(01).          006358      
000771       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000772 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000773 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000774    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000775    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000776    03 FILLER                          PIC X(01).                 006371      
000777    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000778    03 FILLER                          PIC X(01).                 006381      
000779    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000780*8D                                                               006400      
000781 01 WLI-ENCAB-22.                                                 006500      
000782     03 FILLER                          PIC X(11) VALUE           006600      
000783        "F.PROCESO: ".                                            006700      
000784     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000785     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000786     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
000787     03 FILLER                          PIC X(01) VALUE ":".      007020      
000788     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
000789     03 FILLER                          PIC X(01) VALUE ":".      007060      
000790     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
000791     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000792     03 FILLER                          PIC X(24) VALUE           007200      
000793              "IMPRESION MENSAJES DEL S".                         007300      
000794     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000795     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000796     03 FILLER                          PIC X(14) VALUE           007600      
000797        "TIPO PROCESO: ".                                         007700      
000798     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000799*8D                                                               007900      
000800 01 WLI-ENCAB-32.                                                 008000      
000801     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000802*       "VERSION  : ".                                            008200      
000803*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000804     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000805     03 FILLER                     PIC X(07) VALUE                008500      
000806        "HOJA : ".                                                008600      
000807     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000808                                                                  008800      
000809 01 WLI-ENCAB-42.                                                 008900      
000810     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000811     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000812     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000813                                                                  009300      
000814 01 WLI-ENCAB-52.                                                 009400      
000815    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000816    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000817    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000818    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000819                                                                  009900      
000820*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
000821 01 WLI-ENCAB-62.                                                 009910      
000822    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
000823    03 WLI-RESULT                 PIC X(04).                      009920      
000824    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
000825    03 WLI-TEXTO                  PIC X(110).                     009930      
000826                                                                  009935      
000827 01 WLI-TOT-ENVIO.                                                009940      
000828    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
000829    03 FILLER                     PIC X(37) VALUE                 009950      
000830       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
000831    03 WLI-ENV-CTD                PIC X(04).                      009960      
000832*FIN - INFOWARE                                                   009970      
000833****************************************************************  010000      
000834*                 CONTADORES DE HOJAS                          *  010100      
000835****************************************************************  010200      
000836                                                                  010300      
000837  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000838*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000839                                                                  009100      
000840                                                                  009200      
000841*=============    VARIABLES LIB. CTL DE VERSIONES  ============== 009300      
000842                                                                  009400      
000843 01  WKS-LIBID                     PIC X(12).                     009500      
000844 01  WKS-NOMBLIB                   PIC X(72).                     009600      
000845 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             009700      
000846                                                                  009800      
000847 01  WKS-TIT-SORT.                                                009900      
000848     03 FILLER                    PIC X(15) VALUE                 010000      
000849     "S151/FILE/A01/S".                                           010100      
000850     03 WKS-SIS-SORT              PIC 9(03).                      010200      
000851     03 FILLER                    PIC X(01) VALUE "/".            010300      
000852     03 WKS-FEC-SORT              PIC 9(06).                      010400      
000853     03 FILLER                    PIC X(01) VALUE ".".            010500      
000854                                                                  010600      
000855 01  WKS-NOM-BASE-DIARIO.                                         010700      
000856     03 FILLER                     PIC X(06) VALUE "(S151)".      010800      
000857     03 WKS-NOM-BASE-DIA           PIC X(21).                     010900      
000858     03 FILLER                     PIC X(01) VALUE SPACES.        011000      
000859     03 WKS-NOM-PACK               PIC X(09) VALUE "ON CMEMP.".   011100      
000860                                                                  011200      
000861******************************************************************011300      
000862*                VARIABLES DE DIVERSO USO                        *011400      
000863******************************************************************011500      
000864 77  W77-FIN                       PIC 9     VALUE 0.             011600      
000865 77  W77-FIN-25                    PIC 9     VALUE 0.             011700      
000866 77  W77-DIF-NIV                   PIC 9(08) VALUE 0.             011800      
000867 77  W77-MAY-25                    PIC 9     VALUE 0.             011900      
000868 77  W77-FIN-CVES                  PIC 9     VALUE 0.             012000      
000869 77  W77-IND                       PIC 9(02) VALUE 0.             012100      
000870*  77  W77-FEC-PROCESO               PIC 9(06).                   012200      
000871*INICIA CODIGO DE RENOVACION CRONOS 2000                          012300      
000872 77 W77-FEC-PROCESO                PIC 9(08) .                    012400      
000873*TERMINA CODIGO DE RENOVACION CRONOS 2000                         012500      
000874 77  W77-NUM-DIA                   PIC 9(02) COMP.                012600      
000875 77  W77-LLAVE                     PIC X(28).                     012700      
000876 77  W77-DIA-SEM                   PIC 9(06).                     012800      
000877 77  W77-BAN-CREA                  PIC 9     VALUE 0.             012900      
000878 77  W77-NUM-REN                   PIC 9(02) VALUE 0.             013000      
000879 77  W77-DIF-25                    PIC 9(08) VALUE 0.             013100      
000880 77  W77-AUT-S151                  PIC 9(08) VALUE 0.             013200      
000881 77  W77-AUT-AELIM                 PIC 9(08) VALUE 0.             013300      
000882 77  W77-AUTO-GEN                  PIC 9(08) VALUE 0.             013400      
000883 77  W77-PROC-GEN                  PIC 9(02) VALUE 0.             013500      
000884 77  W77-PROD-GEN                  PIC 9(04) VALUE 0.             013600      
000885 77  W77-INST-GEN                  PIC 9(02) VALUE 0.             013700      
000886 77  W77-AUT-GEN                   PIC 9(08) VALUE 0.             013800      
000887 77  W77-SUCI-GEN                  PIC 9(04) VALUE 0.             013900      
000888 77  W77-CAJI-GEN                  PIC 9(02) VALUE 0.             014000      
000889 77  W77-MONE-GEN                  PIC 9(03) VALUE 0.             014100      
000890 77  W77-MDE-GEN                   PIC 9(02) VALUE 0.             014200      
000891                                                                  014300      
000892 77  W77-NUM-MOVS-LEI              PIC 9(06).                     014400      
000893 77  W77-NUM-REG-ESCR              PIC 9(06).                     014500      
000894 77  W77-NIV-BASE                  PIC 9(08) VALUE 0.             014600      
000895 77  W77-STATUS-BASE               PIC 9(03).                     014700      
000896 77  W77-ERROR-BASE                PIC 9(06).                     014800      
000897 77  W77-NUM-CSI                   PIC 9(02).                     014900      
000898 77  W77-SISTEMA                   PIC 9(04).                     015000      
000899 77  W77-NOMBRE-BASE               PIC X(17).                     015100      
000900 77  W77-NUMERO-MIX                PIC 9(07).                     015200      
000901 77  W77-BD-CONTROL                PIC 9 VALUE 0.                 015300      
000902 77  W77-IMPMOV                    PIC 9(16)V99.                  015400      
000903 77  W77-NUMMOV                    PIC 9(08).                     015500      
000904 77  W77-MOVESCR                   PIC 9(06).                     015600      
000905 77  W77-REG-OK                    PIC 9(01).                     015700      
000906******************************************************************015800      
000907*    HORA DE PROCESO                                             *015900      
000908******************************************************************016000      
000909 01  WKS-HORA-PROCESO              PIC 9(08).                     016100      
000910                                                                  016200      
000911 01  WKS-HORA-R REDEFINES WKS-HORA-PROCESO.                       016300      
000912     03 WKS-HORA-HMS               PIC 9(06).                     016400      
000913     03 FILLER                     PIC X(02).                     016500      
000914                                                                  016600      
000915*=================================================================016700      
000916*         VARIABLES PARA CALCULO DE MEMORIA Y DISCO DEL SORT     =016800      
000917*=================================================================016900      
000918                                                                  017000      
000919 77  W77-MEMORIA                   PIC 9(06).                     017100      
000920 77  W77-DISCO                     PIC 9(10).                     017200      
000921                                                                  017300      
000922******************************************************************017400      
000923*                   VARIABLES NIVEL 88                           *017500      
000924******************************************************************017600      
000925  77  W77-INTERRUP                 PIC 9(01) VALUE 0.             017700      
000926  88  W88-HI4                                VALUE 4.             017800      
000927  77  W77-LINEA                    PIC 9(02) VALUE 0.             017900      
000928  88  W88-LINEA                              VALUE 01 THRU 09.    018000      
000929  77  W77-LOTE                     PIC 9(02) VALUE 0.             018100      
000930  88  W88-LOTE                               VALUE 10 THRU 99.    018200      
000931  77  W77-AFS-S028                 PIC 9(01) VALUE 0.             018300      
000932  88  W88-AFS-028                            VALUE 1.             018400      
000933  77  W77-AFS-S250                 PIC 9(01) VALUE 0.             018500      
000934  88  W88-AFS-250                            VALUE 1.             018600      
000935  77  W77-IMP-ADI                  PIC 9(01) VALUE 0.             018700      
000936  88  W88-IMP-ADI                            VALUE 0.             018800      
000937  77  W77-MOVIMIENTOS              PIC 9(01) VALUE 0.             018900      
000938  88  W88-MOVIMIENTOS                        VALUE 0.             019000      
000939  77  W77-SUCYCAJ                  PIC 9(01) VALUE 0.             019100      
000940  88  W88-SUCYCAJ                            VALUE 0.             019200      
000941  77  W77-CSI28250                 PIC 9(01) VALUE 0.             019300      
000942  88  W88-CSI28250                           VALUE 0.             019400      
000943  77  W77-ELIMINA                  PIC 9(01) VALUE 0.             019500      
000944  88  W88-ELIMINA                            VALUE 0.             019600      
000945  77  W77-BORRA-PROC               PIC 9(01) VALUE 0.             019700      
000946  88  W88-BORRA-PROC                         VALUE 1.             019800      
000947  77  W77-BORRA-PROD               PIC 9(01) VALUE 0.             019900      
000948  88  W88-BORRA-PROD                         VALUE 1.             020000      
000949  77  W77-BORRA-INST               PIC 9(01) VALUE 0.             020100      
000950  88  W88-BORRA-INST                         VALUE 1.             020200      
000951  77  W77-LEE-FIN                  PIC 9(01) VALUE 0.             020300      
000952  88  W88-LEE-FIN                            VALUE 1.             020400      
000953*LP                                                               020500      
000954  77  W77-TOTREG                   PIC 9(07) VALUE 0.             020600      
000955  77  W77-NO-ERROR                 PIC 9(01) VALUE 0.             020700      
000956  88  W88-NO-ERROR                           VALUE 0.             020800      
000957  77  W77-ES-INICIO                PIC 9(01) VALUE 0.             020900      
000958  88  W88-ES-INICIO                          VALUE 0.             021000      
000959                                                                  021100      
000960******************************************************************021200      
000961*     VARIABLE PARA PASAR FECHA Y ENTRYPOINT COMO PARAMETRO      *021300      
000962******************************************************************021400      
000963                                                                  021500      
000964 01  WKS-PARAM-SIS                 PIC 9(03).                     021600      
000965*01  WKS-PARAM-FCH                 PIC 9(06).                     021700      
000966*INICIA CODIGO DE RENOVACION CRONOS 2000                          021800      
000967  01 WKS-PARAM-FCH                 PIC 9(08).                     021900      
000968*TERMINA CODIGO DE RENOVACION CRONOS 2000                         022000      
000969 01 WKS-FEC-PRO                    PIC 9(08).                     022100      
000970                                                                  022200      
000971******************************************************************022300      
000972*         ARREGLO PARA ACUMULAR TOTALES POR SUCURSAL             *022400      
000973******************************************************************022500      
000974*01  WKS-TABLA-TOTSUC.                                            022600      
000975*    03  WKS-TAB-TOTSUC OCCURS 10 TIMES.                          022700      
000976*        05  WKS-SUC-NUM-ABO       PIC 9(02).                     022800      
000977*        05  WKS-SUC-IMP-ABO       PIC 9(14)V99.                  022900      
000978*        05  WKS-SUC-NUM-CAR       PIC 9(02).                     023000      
000979*        05  WKS-SUC-IMP-CAR       PIC 9(14)V99.                  023100      
000980**************************************************************    023200      
000981*    VARIABLES PARA OBTENER DATOS DEL HOST DONDE SE CORRE    *    023300      
000982**************************************************************    023400      
000983 01  WKS-DATOS-HOST.                                              023500      
000984     03 WKS-NUMCSI                 PIC 9(02).                     023600      
000985     03 WKS-NOMEQUIPO              PIC X(10).                     023700      
000986     03 WKS-NOMCSI                 PIC X(26).                     023800      
000987     03 WKS-LINEABATCH             PIC X(05).                     023900      
000988                                                                  024000      
000989***************************************************************** 024100      
000990*            TABLA PARA CARGAR CLAVES E IMPORTES                * 024200      
000991***************************************************************** 024300      
000992*01  WKS-TABLA-CVES.                                              024400      
000993*    03  WKS-TAB-CVES OCCURS 5 TIMES.                             024500      
000994*        05  WKS-TAB-CVE           PIC 9(04) COMP.                024600      
000995*        05  WKS-TAB-SCVE          PIC 9(02) COMP.                024700      
000996*        05  WKS-TAB-IMP           PIC 9(14)V99 COMP.             024800      
000997                                                                  024802      
000998 01 WKS-CATEGORIAS.                                               024804      
000999    03 FILLER            PIC X(13) VALUE "NOTFOUND     ".         024806      
001000    03 FILLER            PIC X(13) VALUE "DUPLICATES   ".         024808      
001001    03 FILLER            PIC X(13) VALUE "DEADLOCK     ".         024810      
001002    03 FILLER            PIC X(13) VALUE "DATAERROR    ".         024812      
001003    03 FILLER            PIC X(13) VALUE "NOTLOCKED    ".         024814      
001004    03 FILLER            PIC X(13) VALUE "KEYCHANGE    ".         024816      
001005    03 FILLER            PIC X(13) VALUE "SYSTEM ERROR ".         024818      
001006    03 FILLER            PIC X(13) VALUE "READONLY     ".         024820      
001007    03 FILLER            PIC X(13) VALUE "IOERROR      ".         024822      
001008    03 FILLER            PIC X(13) VALUE "LIMITERROR   ".         024824      
001009    03 FILLER            PIC X(13) VALUE "OPENERROR    ".         024826      
001010    03 FILLER            PIC X(13) VALUE "CLOSEERROR   ".         024828      
001011    03 FILLER            PIC X(13) VALUE "NORECORD     ".         024830      
001012    03 FILLER            PIC X(13) VALUE "INUSE        ".         024832      
001013    03 FILLER            PIC X(13) VALUE "AUDITERROR   ".         024834      
001014    03 FILLER            PIC X(13) VALUE "ABORT        ".         024836      
001015    03 FILLER            PIC X(13) VALUE "SECURITYERROR".         024838      
001016    03 FILLER            PIC X(13) VALUE "VERSIONERROR ".         024840      
001017    03 FILLER            PIC X(13) VALUE "FATALERROR   ".         024842      
001018    03 FILLER            PIC X(13) VALUE "INTEGRITY ERR".         024844      
001019    03 FILLER            PIC X(13) VALUE "INTLIBERROR  ".         024846      
001020                                                                  024848      
001021 01 WKS-DB-CATEGORIAS     REDEFINES WKS-CATEGORIAS.               024850      
001022    03 WKS-DB-CAT         OCCURS 21 TIMES PIC X(13).              024852      
001023                                                                  024854      
001024 77 W77-NUM-CAT                    PIC 9(03).                     024856      
001025 77 W77-NUM-SUBCAT                 PIC 9(06).                     024858      
001026                                                                  024860      
001027 77 W77-BASE                       PIC 9(02).                     024862      
001028 88 W88-BASE-CLOSE                 VALUE ZERO.                    024864      
001029 88 W88-BASE-OPEN                  VALUE 1.                       024866      
001030                                                                  024868      
001031 77 W77-INTENTOS                   PIC 9(02) COMP VALUE ZERO.     024870      
001032                                                                  024872      
001033******************************************************************024900      
001034*              VARIABLES PARA LLAMAR AL CALENDAR                 *025000      
001035******************************************************************025100      
001036 77  WKS-FUNCION                   PIC S9(11) BINARY.             025200      
001037 77  WKS-FORMATO                   PIC S9(11) BINARY.             025300      
001038                                                                  025400      
001039*  01  WKS-FECHA1                    PIC X(06).                   025500      
001040*INICIA CODIGO DE RENOVACION CRONOS 2000                          025600      
001041 01 WKS-FECHA1                     PIC X(08).                     025700      
001042*TERMINA CODIGO DE RENOVACION CRONOS 2000                         025800      
001043 01  WKS-FECHA1-R REDEFINES WKS-FECHA1.                           025900      
001044*    03  WKS-AMO1-R                PIC 9(02).                     026000      
001045*INICIA CODIGO DE RENOVACION CRONOS 2000                          026100      
001046     03 WKS-AMO1-R                PIC 9(04).                      026200      
001047*TERMINA CODIGO DE RENOVACION CRONOS 2000                         026300      
001048     03  WKS-MES1-R                PIC 9(02).                     026400      
001049     03  WKS-DIA1-R                PIC 9(02).                     026500      
001050                                                                  026600      
001051*  01  WKS-FECHA2                    PIC X(06).                   026700      
001052*INICIA CODIGO DE RENOVACION CRONOS 2000                          026800      
001053 01 WKS-FECHA2                     PIC X(08).                     026900      
001054*TERMINA CODIGO DE RENOVACION CRONOS 2000                         027000      
001055 01  WKS-FECHA2-R REDEFINES WKS-FECHA2.                           027100      
001056*    03  WKS-AMO2-R                PIC 9(02).                     027200      
001057*INICIA CODIGO DE RENOVACION CRONOS 2000                          027300      
001058     03  WKS-AMO2-R                PIC 9(04).                     027400      
001059*TERMINA CODIGO DE RENOVACION CRONOS 2000                         027500      
001060     03  WKS-MES2-R                PIC 9(02).                     027600      
001061     03  WKS-DIA2-R                PIC 9(02).                     027700      
001062******************************************************************027800      
001063*              FORMATO DE LLAMADA A LIBRERIA ACTUALIZA           *027900      
001064******************************************************************028000      
001065 01  WKS-151-DATOS WITH LOWER-BOUNDS.                             028100      
001066     03 WKS-FUN                    PIC 9(04).                     028200      
001067     03 WKS-NIVBASE                PIC 9(08).                     028300      
001068     03 WKS-NIVLOG                 PIC 9(08).                     028400      
001069     03 WKS-NUMASIN                PIC 9(02).                     028500      
001070     03 WKS-PROCESO                PIC 9(02).                     028600      
001071                                                                  028700      
001072 01  WKS-ENTRY-POINT               PIC X(64).                     028800      
001073                                                                  028900      
001074 01  WKS-ENTRY-POINT-R REDEFINES WKS-ENTRY-POINT.                 029000      
001075     03 WKS-1A-EP                  PIC X(10).                     029100      
001076     03 WKS-NUM-EP                 PIC 9(02).                     029200      
001077     03 WKS-2A-EP                  PIC X(52).                     029300      
001078                                                                  029400      
001079 01  WKS-ERRORES.                                                 029500      
001080     03 FILLER                     PIC X(31)                      029600      
001081        VALUE "SISTEMA NO HABILITADO EN S151  ".                  029700      
001082     03 FILLER                     PIC X(31)                      029800      
001083        VALUE "FUNCION NO VALIDA              ".                  029900      
001084     03 FILLER                     PIC X(31)                      030000      
001085        VALUE "TRANSACCION NO CATALOGADA      ".                  030100      
001086     03 FILLER                     PIC X(31)                      030200      
001087        VALUE "FECHA CONTABLE NO VALIDA       ".                  030300      
001088     03 FILLER                     PIC X(31)                      030400      
001089        VALUE "FALTA LA SUCURSAL PROMOTORA    ".                  030500      
001090     03 FILLER                     PIC X(31)                      030600      
001091        VALUE "FALTA LA SUCURSAL OPERADORA    ".                  030700      
001092     03 FILLER                     PIC X(31)                      030800      
001093        VALUE "EL IMPORTE ES 0                ".                  030900      
001094     03 FILLER                     PIC X(31)                      031000      
001095        VALUE "FALTA REF S151 PARA ELIMINAR   ".                  031100      
001096     03 FILLER                     PIC X(31)                      031200      
001097        VALUE "MOVIMINETO A ELIMINAR NO EXISTE".                  031300      
001098     03 FILLER                     PIC X(31)                      031400      
001099        VALUE "ORIGEN ERRONEO                 ".                  031500      
001100     03 FILLER                     PIC X(31)                      031600      
001101        VALUE "ELIMINANDO A REG DE ELIMINACION".                  031700      
001102 01  WKS-ERRORES-R REDEFINES WKS-ERRORES.                         031800      
001103     03 WKS-ERROR                  PIC X(31) OCCURS 11 TIMES.     031900      
001104 77  WKS-151-RESULT                PIC S9(11) BINARY.             032000      
001105******************************************************************032100      
001106*           COPY DEL FORMATO DE MOVIMIENTOS DEL S151             *032200      
001107******************************************************************032300      
001108                                                                  032400      
001109*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001110*  COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS.".                     032500      
001111                                                                  000100      
001112******************************************************************000200      
001113**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
001114**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
001115**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
001116******************************************************************000600      
001117                                                                  000700      
001118 01 A00-R00-HDR-MOV .                                             000800      
001119    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
001120    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
001121    02 FILLER                          PIC  X(08).                001100      
001122    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
001123    02 FILLER                          PIC  X(430).               001300      
001124                                                                  001400      
001125 01 A00-R01-REGMOV .                                              001500      
001126    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
001127    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
001128    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
001129                                                                  001900      
001130    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
001131    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
001132                                       PIC  9(04)      COMP.      002200      
001133    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
001134                                       PIC  9(04)      COMP.      002400      
001135                                                                  002500      
001136    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
001137    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
001138                                       PIC  9(02)      COMP.      002800      
001139    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
001140                                       PIC  9(02)      COMP.      003000      
001141    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
001142    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
001143                                       A00-R01-SERVICIO-ALERTA.   003060      
001144       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
001145       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
001146    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
001147    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
001148    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
001149                                       PIC  9(04)      COMP.      003420      
001150    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
001151    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
001152                                       PIC  9(04)      COMP.      003520      
001153    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
001154    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
001155    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
001156                                       PIC  9(02)      COMP.      003900      
001157                                                                  004000      
001158    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
001159    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
001160       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
001161          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
001162          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
001163          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
001164          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
001165          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
001166          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
001167          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
001168                                                                  005100      
001169    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
001170       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
001171       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
001172       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
001173       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
001174       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
001175       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
001176       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
001177                                                                  006000      
001178       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
001179       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
001180       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
001181       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
001182       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
001183       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
001184       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
001185                                                                  006800      
001186       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
001187       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
001188       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
001189       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
001190       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
001191       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
001192       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
001193                                                                  007600      
001194       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
001195       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
001196       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
001197       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
001198       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
001199       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
001200       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
001201                                                                  008400      
001202       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
001203       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
001204       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
001205       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
001206       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
001207       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
001208       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
001209                                                                  009200      
001210    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
001211    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
001212    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
001213    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
001214    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
001215    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
001216       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
001217    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
001218    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
001219    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
001220    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
001221    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
001222    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
001223    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
001224    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
001225       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
001226       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
001227    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
001228    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
001229    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
001230    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
001231    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
001232    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
001233    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
001234    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
001235    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
001236    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
001237    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
001238    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
001239    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
001240    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
001241                                       PIC X(10).                 012600      
001242    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
001243       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
001244       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
001245    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
001246    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
001247    03 A00-R01-FILIAL                  PIC  X(05).                013200      
001248    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
001249       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
001250       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
001251                                                                  013300      
001252    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
001253    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
001254                                       PIC  X(09).                013600      
001255    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
001256                                       PIC  9(18)      COMP.      013800      
001257    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
001258    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
001259                                       PIC  X(9).                 014100      
001260    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
001261    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
001262                                       PIC  X(05).                014400      
001263    03 A00-R01-NIO                     PIC  X(16).                014500      
001264    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
001265    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
001266    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
001267       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
001268    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
001269    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
001270       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
001271    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
001272    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
001273    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
001274    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
001275    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
001276    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
001277                                       PIC  X(04).                015900      
001278    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
001279    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
001280    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
001281                                       PIC  9(04)      COMP.      016300      
001282    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
001283    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
001284    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
001285    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
001286    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
001287                                                                  016900      
001288    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
001289    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
001290       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
001291    03 A00-R01-FILXAPL                 PIC X(165).                017300      
001292                                                                  017400      
001293    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
001294       05 FILLER                       PIC X(96).                 017510      
001295       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
001296       05 FILLER                       PIC X(67).                 017700      
001297                                                                  017702      
001298    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
001299       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
001300       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
001301       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
001302       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
001303       06 WKS-MOV-FILS084              PIC X(154).                017714      
001304                                                                  017800      
001305    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
001306       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
001307       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
001308       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
001309       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
001310       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
001311       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
001312       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
001313       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
001314       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018160      
001315       05 FILLER                       PIC X(62).                 018170      
001316       05 A00-R01-CTE-087              PIC X(07).                 018210      
001317       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
001318          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
001319          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
001320          07 FILLER                    PIC X(01).                 018281      
001321       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
001322       05 FILLER                       PIC X(61).                 018400      
001323                                                                  018500      
001324    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
001325       05 FILLER                       PIC  X(96).                018610      
001326       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
001327       05 FILLER                       PIC  X(65).                018630      
001328                                                                  018640      
001329    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
001330       05 A00-R01-FORMATO0             PIC  9(02).                018700      
001331       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
001332       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
001333       05 FILLER                       PIC  X(141).               018910      
001334                                                                  019100      
001335    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
001336       05 A00-R01-FORMATO1             PIC  9(02).                019300      
001337       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
001338       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
001339       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
001340       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
001341       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
001342       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
001343       05 A00-R01-ENTSAL               PIC  X(01).                020000      
001344       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
001345       05 FILLER                       PIC  X(69).                020200      
001346                                                                  020300      
001347    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
001348       05 A00-R01-FORMATO2             PIC  9(02).                020500      
001349       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
001350       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
001351       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
001352       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
001353       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
001354       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
001355       05 FILLER                       PIC  X(77).                021200      
001356                                                                  021300      
001357    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
001358       05 A00-R01-FORMATO3             PIC  9(02).                021500      
001359       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
001360       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
001361       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
001362       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
001363       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
001364       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
001365       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
001366       05 FILLER                       PIC  X(69).                022300      
001367                                                                  022400      
001368    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
001369       05 A00-R01-FORMATO4             PIC  9(02).                022600      
001370       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
001371       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
001372       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
001373       05 A00-R01-RFCFT04              PIC  X(13).                023000      
001374       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
001375       05 A00-R01-DIRECCION            PIC  X(40).                023200      
001376       05 FILLER                       PIC  X(85).                023300      
001377                                                                  023400      
001378    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
001379       05 A00-R01-COBERTURA            PIC  X(01).                023408      
001380       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
001381       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
001382       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
001383       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
001384       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
001385       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
001386       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
001387       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
001388       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
001389       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
001390       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
001391       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
001392       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
001393       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
001394       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
001395       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
001396       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
001397       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
001398       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
001399       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
001400       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
001401       05 FILLER                       PIC  X(05).                023492      
001402                                                                  023497      
001403    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
001404       05 A00-R01-4CEROS               PIC  9(04).                023600      
001405       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
001406       05 FILLER                       PIC  X(157).               023800      
001407                                                                  023900      
001408    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
001409       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
001410        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
001411       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
001412       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
001413       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
001414       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
001415       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
001416       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
001417       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
001418       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
001419       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
001420       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
001421       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
001422       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
001423       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
001424       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
001425       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
001426       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
001427       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
001428       05 A00-R01-FILLER               PIC  X(41).                025850      
001429       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
001430       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
001431       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
001432       05 A00-R01-INDPAGO              PIC  9(01).                026200      
001433       05 FILLER                       PIC  X(01).                026210      
001434       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
001435       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
001436       05 FILLER                       PIC  X(52).                026300      
001437                                                                  026400      
001438    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
001439       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
001440       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
001441       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
001442       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
001443       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
001444       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
001445       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
001446       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
001447       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
001448       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
001449       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
001450       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
001451       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
001452          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
001453          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
001454       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
001455       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
001456          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
001457       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
001458          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
001459       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
001460          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
001461       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
001462          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
001463       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
001464          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
001465       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
001466          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
001467       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
001468          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
001469       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
001470          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
001471       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
001472          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
001473       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
001474          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
001475          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
001476       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
001477       05 FILLER                       PIC X(01).                 030101      
001478       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
001479       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
001480       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
001481       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
001482       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
001483       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
001484       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
001485       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
001486          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
001487       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
001488       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
001489       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
001490       05 FILLER                       PIC X(14).                 030700      
001491                                                                  030800      
001492    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
001493       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
001494       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
001495       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
001496       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
001497       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
001498       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
001499       05 FILLER                       PIC  X(142).               031600      
001500                                                                  031700      
001501    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
001502       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
001503       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
001504       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
001505       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
001506       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
001507       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
001508       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
001509       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
001510       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
001511       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
001512          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
001513          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
001514          07 FILLER                    PIC  X(08).                032740      
001515       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
001516       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
001517       05 A00-R01-NOMORD               PIC  X(30).                033000      
001518       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
001519       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
001520       05 A00-R01-REF-CECO             PIC  X(07).                033500      
001521       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
001522       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
001523          A00-R01-NUM-ORD-PAGO.                                   033800      
001524          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
001525          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
001526                                                                  034100      
001527    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
001528       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
001529       05 A00-R01-RFC-S501             PIC  X(13).                034160      
001530       05 FILLER                       PIC  X(151).               034180      
001531                                                                  034190      
001532    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
001533       05 A00-R01-DATOS-S701           PIC X(116).                034300      
001534       05 A00-R01-PAG-SERV             REDEFINES                  034400      
001535                                       A00-R01-DATOS-S701.        034500      
001536          07 A00-R01-ID                PIC X(30).                 034600      
001537          07 A00-R01-FECREC            PIC 9(06).                 034700      
001538          07 A00-R01-REF1              PIC X(20).                 034800      
001539          07 A00-R01-REF2              PIC X(20).                 034900      
001540          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
001541          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
001542                                       A00-R01-TIPOPAGO.          035200      
001543             09 A00-R01-ESTAB          PIC 9(04).                 035300      
001544             09 A00-R01-SEQ            PIC 9(02).                 035400      
001545          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
001546          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
001547          07 A00-R01-EBPP              PIC 9(03).                 035700      
001548          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
001549          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
001550          07 FILLER                    PIC X(01).                 035728      
001551          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
001552          07 FILLER                    PIC X(18).                 035760      
001553       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
001554                                       A00-R01-DATOS-S701.        035900      
001555          07 A00-R01-RFC               PIC X(13).                 036000      
001556          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
001557          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
001558          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
001559          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
001560          07 FILLER                    PIC X(85).                 036200      
001561       05 FILLER                       PIC X(49).                 036300      
001562                                                                  036400      
001563    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
001564       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
001565       05 A00-R01-CTA-S702             PIC X(40).                 036700      
001566       05 FILLER                       PIC X(113).                036710      
001567                                                                  036720      
001568    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
001569       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
001570       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
001571       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
001572       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
001573       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
001574       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
001575       05 FILLER                       PIC X(72).                 036800      
001576                                                                  036810      
001577                                                                  036820      
001578    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
001579       05 A00-R01-TRUI-S711.                                      036915      
001580          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
001581          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
001582          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
001583           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
001584          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
001585       05 A00-R01-MICR-S711.                                      036945      
001586          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
001587          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
001588          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
001589          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
001590          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
001591          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
001592          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
001593          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
001594       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
001595       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
001596       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
001597       05 A00-R01-FIL-S711             PIC X(05).                 036965      
001598       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
001599       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
001600       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
001601                                                                  036990      
001602    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
001603       05 A00-R01-RFC-502              PIC  X(13).                037100      
001604       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
001605          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
001606          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
001607          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
001608          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
001609          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
001610          07 FILLER                    PIC  9(01) COMP.           037650      
001611       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
001612       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
001613       05 FILLER                       PIC  X(06).                038680      
001614                                                                  038682      
001615    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
001616       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
001617       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
001618       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
001619       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
001620       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
001621       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
001622       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
001623       05 FILLER                       PIC  X(81).                038750      
001624                                                                  038755      
001625    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
001626       05 A00-R01-COP                  PIC  9(13)        .        038900      
001627       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
001628       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
001629       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
001630       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
001631       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
001632       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
001633       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
001634       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
001635       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
001636       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
001637       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
001638       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
001639       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
001640       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
001641       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
001642       05 FILLER                       PIC  X(81)        .        040800      
001643                                                                  040810      
001644    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
001645       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
001646       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
001647       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
001648       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
001649       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
001650       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
001651       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
001652       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
001653       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
001654       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
001655       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
001656       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
001657       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
001658       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
001659       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
001660       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
001661       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
001662       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
001663       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
001664       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
001665       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
001666       05 FILLER                       PIC  X(18).                041040      
001667                                                                  041400      
001668    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
001669    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
001670*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001671**** Inicia cambio Fabrica de software **** Abarbosa       P05-355032600      
001672*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001673* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP002 ON CMEMP."         032610      
001674*                                      FROM 000100 TO 099999      032620      
001675                                                                  000100      
001676*----------------------------------------------------------------*000200      
001677*     VARIABLES PARA EL CALCULO DINAMICO DE ESPACIO PARA SORT    *000300      
001678*----------------------------------------------------------------*000400      
001679 77  W77-FRAMESIZE                PIC  9(002) COMP.               000500      
001680 77  W77-LASTRECORD               PIC  9(012) COMP.               000600      
001681 77  W77-MAXRECSIZE               PIC  9(012) COMP.               000700      
001682 77  W77-DISK-SIZE                PIC  9(018) COMP.               000800      
001683 77  W77-MEMORY-SIZE              PIC  9(018) COMP.               000900      
001684 77  W77-MEMORY-65K               PIC  9(018) COMP.               001000      
001685 01  WS-CALC-WORD                 PIC  9(012)V99.                 001100      
001686 01  WS-CALC-WORD-RED   REDEFINES WS-CALC-WORD.                   001200      
001687     02 WS-WORD-ENT               PIC  9(012).                    001300      
001688     02 WS-WORD-RES               PIC  9(002).                    001400      
001689                                                                  001500      
001690*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001691**** Fin    cambio Fabrica de software **** Abarbosa       P05-355032630      
001692*================================================================ 032700      
001693*         REGISTRO DE WORKING PARA SORT                         = 032800      
001694*================================================================ 032900      
001695                                                                  033000      
001696 01  WKS-REG-SORT.                                                033100      
001697     02 WKS-RS-LLAVE              PIC X(42).                      033200      
001698     02 WKS-RS-LLAVE-R REDEFINES WKS-RS-LLAVE.                    033300      
001699        03 WKS-RS-FECHA-PRO        PIC 9(08).                     033400      
001700        03 WKS-RS-TIPO-PROC        PIC 9(02).                     033500      
001701        03 WKS-RS-NUM-PRODUCTO     PIC 9(04).                     033600      
001702        03 WKS-RS-INSTRUMENTO      PIC 9(02).                     033700      
001703        03 WKS-RS-MONEDA           PIC 9(04).                     033800      
001704        03 WKS-RS-BCOS             PIC 9(10).                     033900      
001705        03 WKS-RS-BCOS-R  REDEFINES  WKS-RS-BCOS.                 034000      
001706           05 WKS-RS-BCOORI        PIC 9(05).                     034100      
001707           05 WKS-RS-BCODES        PIC 9(05).                     034200      
001708        03 WKS-RS-TIPO-MOV         PIC 9(02).                     034300      
001709        03 WKS-RS-CVETRAN          PIC 9(06).                     034400      
001710        03 WKS-RS-ESQCON           PIC 9(04).                     034500      
001711     02 WKS-RS-IMPORTE             PIC 9(16)V99.                  034600      
001712 01  WKS-LLAVE-ANT                 PIC X(42).                     034800      
001713 01  WKS-LLAVE-ANT-R   REDEFINES  WKS-LLAVE-ANT.                  034900      
001714     03 WKS-FECHA-PRO-ANT          PIC 9(08).                     035000      
001715     03 WKS-TIPO-PROC-ANT          PIC 9(02).                     035100      
001716     03 WKS-NUM-PRODUCTO-ANT       PIC 9(04).                     035200      
001717     03 WKS-INSTRUMENTO-ANT        PIC 9(02).                     035300      
001718     03 WKS-MONEDA-ANT             PIC 9(04).                     035400      
001719     03 WKS-BCOS-ANT               PIC 9(10).                     035500      
001720     03 WKS-BCOS-ANT-R  REDEFINES  WKS-BCOS-ANT.                  035600      
001721        05 WKS-BCOORI-ANT          PIC 9(05).                     035700      
001722        05 WKS-BCODES-ANT          PIC 9(05).                     035800      
001723     03 WKS-TIPO-MOV-ANT           PIC 9(02).                     035900      
001724     03 WKS-CVETRAN-ANT            PIC 9(06).                     036000      
001725     03 WKS-ESQCON-ANT             PIC 9(04).                     036100      
001726******************************************************************036200      
001727*                     NOMBRE DE LA LOG DEL S151                  *036300      
001728******************************************************************036400      
001729 01 WKS-TIT-LOG151.                                               036500      
001730     02  FILLER                    PIC X(10) VALUE "(S151)S151".  036600      
001731     02  FILLER                    PIC X(10) VALUE "/FILE/MOVS".  036700      
001732     02  WKS-LOG-SISTEMA           PIC 9(03).                     036800      
001733     02  FILLER                    PIC X(01) VALUE "/".           036900      
001734     02  WKS-FEC-LOG               PIC 9(06) VALUE 0.             037000      
001735     02  FILLER                    PIC X(04) VALUE " ON ".        037100      
001736     02  WKS-PACK-LOG              PIC X(17).                     037200      
001737     02  FILLER                    PIC X(01) VALUE ".".           037300      
001738                                                                  037400      
001739*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001740*  COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".          037500      
001741**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
001742  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
001743  01 MENSAJE-LJ.                                                  100300      
001744     02 SISTEMA-LJ     PIC X(04).                                 100400      
001745     02 FILLER         PIC X VALUE "/".                           100500      
001746     02 PASO-LJ        PIC X(04).                                 100600      
001747     02 FILLER         PIC X VALUE "/".                           100700      
001748     02 MTP-LJ         PIC 9(03).                                 100800      
001749     02 FILLER         PIC X VALUE ":".                           100900      
001750     02 TIPO-LJ        PIC X.                                     101000      
001751     02 FILLER         PIC X VALUE ">".                           101100      
001752     02 CODIGO-LJ      PIC 9(06).                                 101200      
001753     02 FILLER         PIC X VALUE "<".                           101300      
001754     02 TEXTO-LJ       PIC X(250).                                101400      
001755*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001756                                                                  037600      
001757/**************************************************************** 037700      
001758*             P R O C E D U R E     D I V I S I O N             * 037800      
001759***************************************************************** 037900      
001760 PROCEDURE DIVISION USING WKS-PARAM-SIS.                          038000      
001761 DECLARATIVES.                                                    038100      
001762 HI-INTERRUPT SECTION.                                            038200      
001763     USE AS INTERRUPT PROCEDURE.                                  038300      
001764 INTERRUP-BY-HI.                                                  038400      
001765     DISALLOW INTERRUPT.                                          038500      
001766     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-INTERRUP.          038600      
001767     IF W88-HI4                                                   038700      
001768        MOVE SPACES                TO WLI-ENCAB-52                038800      
001769        MOVE "I"                   TO WLI-TIPO-LJ                 038900      
001770        MOVE 020201                TO CODIGO-LJ                   039000      
001771        MOVE "TERMINA P111 POR HI 4"                              039100      
001772                                   TO WLI-TEXTO-LJ                039200      
001773        PERFORM   000-030-IMPRIME-MENSAJE                         039300      
001774        MOVE WLI-TIPO-LJ   TO  TIPO-LJ                            039400      
001775        MOVE WLI-TEXTO-LJ  TO  TEXTO-LJ                           039500      
001776        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       039600      
001777        PERFORM 000900-CIERRA-ARCHIVOS                            039700      
001778        STOP RUN                                                  039800      
001779     ELSE                                                         039900      
001780        MOVE SPACES                TO WLI-ENCAB-52                040000      
001781        MOVE "E"                   TO  WLI-TIPO-LJ, TIPO-LJ       040100      
001782        MOVE 030101                TO CODIGO-LJ                   040200      
001783        MOVE "HI NO IMPLEMENTADO " TO WLI-TEXTO-LJ,TEXTO-LJ       040300      
001784        PERFORM   000-030-IMPRIME-MENSAJE                         040400      
001785        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      040500      
001786                                                                  040600      
001787 END DECLARATIVES.                                                040700      
001788/                                                                 040800      
001789**********************************************************        040900      
001790 INICIO-PROGRAMA SECTION.                                         041000      
001791                                                                  041100      
001792 000000-INICIO-PROCESO.                                           041200      
001793*======================                                           041300      
001794                                                                  041400      
001795     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   041500      
001796            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".      041600      
001797     CHANGE ATTRIBUTE LIBACCESS OF "SOPORTECOMS" TO BYFUNCTION.   041700      
001798     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            041800      
001799                                      "SOPORTECOMS".              041900      
001800     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     042000      
001801     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      042100      
001802                                                                  042200      
001803     MOVE "S151L001CTL"            TO WKS-LIBID.                  042300      
001804     CALL "DAME_TIT IN CTLVER"     USING WKS-LIBID, WKS-NOMBLIB   042400      
001805                                   GIVING W77-ERR-CTLVER.         042500      
001806     IF W77-ERR-CTLVER = 0                                        042600      
001807        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO WKS-NOMBLIB    042700      
001808     ELSE                                                         042800      
001809        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                042900      
001810           "(S151)S151/OBJECT/L001/CONTROL/02MTP001 ON CMEMP.".   043000      
001811                                                                  043100      
001812     MOVE "S151"                   TO SISTEMA-LJ.                 043200      
001813     MOVE "P111"                   TO PASO-LJ                     043300      
001814                                      WKS-PASO-BACK2              043400      
001815                                       WLI-RB-E1-PASO.            043500      
001816                                                                  043600      
001817     MOVE "004"                    TO MTP-LJ.                     043700      
001818     MOVE "I"                      TO WLI-TIPO-LJ.                043800      
001819     CALL "CSIID IN SOPORTECOMS"   USING WKS-DATOS-HOST.          043900      
001820     CANCEL "SOPORTECOMS".                                        044000      
001821     CANCEL "CTLVER".                                             044100      
001822                                                                  044200      
001823     ATTACH HI-INTERRUPT           TO                             044300      
001824                            ATTRIBUTE EXCEPTIONEVENT OF MYSELF.   044400      
001825     ALLOW INTERRUPT.                                             044500      
001826                                                                  044600      
001827     MOVE WKS-PARAM-SIS            TO WKS-B01-SISTEMA             044700      
001828                                      WKS-LOG-SISTEMA             044800      
001829                                      WKS-SIS-BACK2               044900      
001830                                       WLI-RB-E3-SISTEMA2.        045000      
001831     MOVE WKS-NUMCSI               TO WKS-B01-CSI                 045100      
001832                                      WKS-TR-CSI2.                045200      
001833     MOVE 1                        TO WKS-B01-FUNCION.            045300      
001834     CALL "CONSISDIA IN LIB-CONTROL" USING  WKS-S151B01SISDIA     045400      
001835                                     GIVING W77-RESULT-LIBCON.    045500      
001836     IF W77-RESULT-LIBCON = 0                                     045600      
001837        MOVE WKS-B01-NOMPACMOV     TO WKS-PACK-LOG                045700      
001838        MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-PARAM-FCH       045800      
001839        IF WKS-PARAM-FCH > ZEROS                                  045900      
001840           MOVE WKS-PARAM-FCH      TO WKS-FEC-PRO                 046000      
001841        ELSE                                                      046100      
001842           MOVE WKS-B01-FECPRO     TO WKS-FEC-PRO                 046200      
001843     ELSE                                                         046300      
001844        IF W77-RESULT-LIBCON = 1                                  046400      
001845           MOVE "I"                TO TIPO-LJ                     046500      
001846           MOVE 010401             TO CODIGO-LJ                   046600      
001847           MOVE "SISTEMA NO DADO DE ALTA"                         046700      
001848                                   TO TEXTO-LJ                    046800      
001849           CALL "LJ IN LIB-DISP"   USING CONTADOR-LJ,             046900      
001850                                         MENSAJE-LJ               047000      
001851           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                047100      
001852        ELSE                                                      047200      
001853           MOVE "I"                TO TIPO-LJ                     047300      
001854           MOVE 010401             TO CODIGO-LJ                   047400      
001855           MOVE "ERROR EN BASE DE CONTROL"                        047500      
001856                                   TO TEXTO-LJ                    047600      
001857           CALL "LJ IN LIB-DISP"   USING CONTADOR-LJ,             047700      
001858                                         MENSAJE-LJ               047800      
001859           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.               047900      
001860                                                                  048000      
001861      MOVE WKS-FEC-PRO              TO WKS-FEC-LOG                048100      
001862                                       WLI-RB-E1-FECHA-INF2.      048200      
001863      MOVE "DIARIO"                 TO WLI-RB-E2-TIPO-PROC2.      048300      
001864     PERFORM      001000-FORMATO-DISPLAY.                         048400      
001865                                                                  048500      
001866     MOVE SPACES                   TO WLI-ENCAB-52.               048600      
001867     MOVE "I"                      TO WLI-TIPO-LJ.                048700      
001868*    MOVE 020101                   TO CODIGO-LJ.                  048800      
001869     STRING "INICIO PROCESO FECHA :  "                            048900      
001870            WKS-FEC-PRO                                           049000      
001871            " SIST. S"                                            049100      
001872            WKS-PARAM-SIS                                         049200      
001873     DELIMITED BY SIZE                                            049300      
001874     INTO WLI-TEXTO-LJ.                                           049400      
001875     PERFORM      000-030-IMPRIME-MENSAJE.                        049500      
001876*    CALL "LJ IN LIB-DISP"   USING CONTADOR-LJ                    049600      
001877*                                  MENSAJE-LJ.                    049700      
001878     CHANGE ATTRIBUTE TITLE OF L01-DATOS                          049800      
001879                                   TO WKS-TIT-LOG151.             049900      
001880     OPEN INPUT L01-DATOS.                                        050000      
001881     READ L01-DATOS INTO A00-R00-HDR-MOV                          050100      
001882       AT END                                                     050200      
001883          MOVE SPACES                TO WLI-ENCAB-52              050300      
001884          MOVE "E"                 TO WLI-TIPO-LJ, TIPO-LJ        050400      
001885          MOVE 010105              TO CODIGO-LJ                   050500      
001886          MOVE " ERROR AL ABRIR ARCH. MOVTOS.  "                  050600      
001887                                   TO WLI-TEXTO-LJ,TEXTO-LJ       050700      
001888          PERFORM         000-030-IMPRIME-MENSAJE                 050800      
001889          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                050900      
001890                                      MENSAJE-LJ.                 051000      
001891     MOVE WKS-B01-NOMBDSEM         TO WKS-NOM-BASE-DIA.           051100      
001892     CHANGE ATTRIBUTE TITLE OF MOVDB                              051200      
001893                                   TO WKS-NOM-BASE-DIARIO.        051300      
001894     MOVE WKS-FEC-PRO              TO WKS-FEC-SORT.               051400      
001895     MOVE WKS-PARAM-SIS            TO WKS-SIS-SORT.               051500      
001896     OPEN OUTPUT A02-ARCH-SORT.                                   051600      
001897                                                                  051700      
001898     PERFORM 000700-ABRE-BASE UNTIL W88-BASE-OPEN.                051750      
001899                                                                  054000      
001900     FIND MOVDB                                                   054100      
001901       ON EXCEPTION                                               054200      
001902          MOVE SPACES              TO WLI-ENCAB-52                054300      
001903          MOVE "E"                 TO WLI-TIPO-LJ, TIPO-LJ        054400      
001904          MOVE 010105              TO CODIGO-LJ                   054500      
001905          MOVE " ERROR AL LEER GLOBALES S151BDMOVSEMANAL "        054600      
001906                                   TO WLI-TEXTO-LJ, TEXTO-LJ      054700      
001907          PERFORM         000-030-IMPRIME-MENSAJE                 054800      
001908          CALL "LJ IN LIB-DISP"    USING CONTADOR-LJ,             054900      
001909                                         MENSAJE-LJ               055000      
001910          CALL SYSTEM DMTERMINATE.                                055100      
001911                                                                  055200      
001912     ACCEPT WKS-HORA-PROCESO       FROM TIME.                     055300      
001913     MOVE ATTRIBUTE STACKNO OF MYSELF TO W77-NUMERO-MIX.          055400      
001914     MOVE ZEROS                    TO W77-FIN,                    055500      
001915                                      W77-LEE-FIN.                055600      
001916     ACCEPT WKS-HORA-PROCESO       FROM TIME.                     055700      
001917     PERFORM 000800-DELETE-B50SXTOTXCVE                           055800      
001918             UNTIL W77-NO-ERROR = 1.                              055900      
001919     MOVE 0                        TO W77-BAN-CREA,               056000      
001920                                      W77-NO-ERROR.               056100      
001921     MOVE 0                        TO W77-TOTREG.                 056200      
001922      READ L01-DATOS INTO A00-R01-REGMOV                          056300      
001923        AT END MOVE 1               TO W77-LEE-FIN.               056400      
001924                                                                  056500      
001925      IF A00-R01-FUNCION = 99                                     056600      
001926         MOVE 1                     TO W77-LEE-FIN.               056700      
001927**LP                                                              056800      
001928      IF A00-R01-FUNCION = 1      AND  A00-R01-STATUS  = 1        056900      
001929         ADD  1          TO W77-TOTREG.                           057000      
001930                                                                  057100      
001931     PERFORM 001000-ARMA-ARCHIVO                                  057200      
001932             UNTIL W88-LEE-FIN.                                   057300      
001933     CLOSE A02-ARCH-SORT WITH SAVE.                               057400      
001934     PERFORM 002000-SORT-ARCHIVO.                                 057500      
001935     MOVE 0                        TO W77-LEE-FIN.                057600      
001936     OPEN INPUT A02-ARCH-SORT.                                    057700      
001937     READ A02-ARCH-SORT INTO WKS-REG-SORT                         057800      
001938       AT END MOVE 1 TO W77-LEE-FIN.                              057900      
001939     IF W77-LEE-FIN = 0                                           058000      
001940        MOVE WKS-RS-LLAVE          TO WKS-LLAVE-ANT               058100      
001941        MOVE ZERO                  TO W77-IMPMOV                  058200      
001942                                      W77-NUMMOV                  058300      
001943        PERFORM 002100-ARMA-BDTOTXCVE   UNTIL W88-LEE-FIN         058400      
001944        PERFORM 002200-ACT-BD.                                    058500      
001945     PERFORM 000900-CIERRA-ARCHIVOS.                              058600      
001946     CLOSE A02-ARCH-SORT WITH PURGE.                              058700      
001947*    MOVE "I"                      TO WLI-TIPO-LJ.                058800      
001948*    MOVE 020201                   TO CODIGO-LJ.                  058900      
001949*    MOVE "FIN NORMAL DE PROCESO"  TO WLI-TEXTO-LJ.               059000      
001950*    CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ,             059100      
001951*                                        MENSAJE-LJ.              059200      
001952     STOP RUN.                                                    059300      
001953                                                                  059400      
001954 000700-ABRE-BASE.                                                059410      
001955*=================                                                059412      
001956                                                                  059414      
001957     MOVE 1                         TO W77-BASE.                  059416      
001958     ADD  1                         TO W77-INTENTOS.              059418      
001959                                                                  059420      
001960     IF WKS-B01-STABDSEM = 0                                      059422      
001961        OPEN UPDATE MOVDB                                         059424      
001962          ON EXCEPTION                                            059426      
001963             IF DMSTATUS(OPENERROR)     AND                       059428      
001964                DMSTATUS(DMERRORTYPE) = 39                        059430      
001965                WAIT(20)                                          059432      
001966                MOVE ZERO           TO W77-BASE                   059434      
001967             ELSE                                                 059436      
001968                MOVE SPACES         TO WLI-ENCAB-52               059438      
001969                MOVE "E"            TO WLI-TIPO-LJ, TIPO-LJ       059440      
001970                MOVE 010101         TO CODIGO-LJ                  059442      
001971                MOVE " ERROR AL ABRIR LA BASE SEMANAL"            059444      
001972                                    TO WLI-TEXTO-LJ, TEXTO-LJ     059446      
001973                PERFORM 000-030-IMPRIME-MENSAJE                   059448      
001974                CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ059450      
001975                CHANGE ATTRIBUTE STATUS OF MYSELF TO -1           059452      
001976     ELSE                                                         059454      
001977        MOVE SPACES                 TO WLI-ENCAB-52               059456      
001978        MOVE "O"                    TO WLI-TIPO-LJ                059458      
001979        MOVE "010105"               TO CODIGO-LJ                  059460      
001980        MOVE "ESTADO INVALIDO DE LA BASE DE MOVTOS"               059462      
001981                                    TO WLI-TEXTO-LJ               059464      
001982        PERFORM           000-030-IMPRIME-MENSAJE                 059466      
001983        MOVE WLI-TIPO-LJ   TO  TIPO-LJ                            059468      
001984        MOVE WLI-TEXTO-LJ  TO  TEXTO-LJ                           059470      
001985        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       059472      
001986        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  059474      
001987                                                                  059476      
001988     IF W77-INTENTOS > 5                                          059478      
001989        MOVE "O"                TO WLI-TIPO-LJ TIPO-LJ            059480      
001990        MOVE ZERO               TO W77-INTENTOS                   059482      
001991        MOVE 060315             TO CODIGO-LJ                      059484      
001992        MOVE DMSTATUS(DMCATEGORY)    TO W77-NUM-CAT               059486      
001993        MOVE DMSTATUS(DMERRORTYPE)   TO W77-NUM-SUBCAT            059488      
001994        STRING "ERROR EN BASE BD10 : ARCHIVO DE CONTROL EN USO "  059490      
001995               "EN FORMA EXCLUSIVA"                               059492      
001996               " ERROR DMSII CAT. " WKS-DB-CAT(W77-NUM-CAT)       059494      
001997               " SUBCATEGORIA " W77-NUM-SUBCAT                    059496      
001998        DELIMITED BY SIZE                                         059498      
001999        INTO TEXTO-LJ                                             059500      
002000        MOVE TEXTO-LJ           TO WLI-TEXTO-LJ                   059502      
002001        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      059504      
002002                                                                  059600      
002003 000800-DELETE-B50SXTOTXCVE.                                      059700      
002004     LOCK FIRST B50SXTOTXCVE                                      059800      
002005      AT B50-MOV-FEC NOT > WKS-FEC-PRO                            059900      
002006       ON EXCEPTION                                               060000      
002007          IF DMSTATUS (NOTFOUND)                                  060100      
002008             MOVE 1 TO W77-NO-ERROR                               060200      
002009          ELSE                                                    060300      
002010             MOVE 1                TO W77-NO-ERROR                060400      
002011             MOVE SPACES           TO WLI-ENCAB-52                060500      
002012             MOVE "E"              TO WLI-TIPO-LJ, TIPO-LJ        060600      
002013             MOVE 010105           TO CODIGO-LJ                   060700      
002014             MOVE " ERROR AL HACER LOCK B50TOTXTOTXCVE "          060800      
002015                                   TO WLI-TEXTO-LJ, TEXTO-LJ      060900      
002016             PERFORM      000-030-IMPRIME-MENSAJE                 061000      
002017             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,             061100      
002018                                         MENSAJE-LJ.              061200      
002019     PERFORM 000810-NEXT-DELETE UNTIL W77-NO-ERROR = 1.           061300      
002020                                                                  061400      
002021 000810-NEXT-DELETE.                                              061500      
002022                                                                  061600      
002023     BEGIN-TRANSACTION NO-AUDIT S151B99REINICIO                   061700      
002024                                                                  061800      
002025     DELETE S151B50TOTXCVE                                        061900      
002026         ON EXCEPTION                                             062000      
002027            MOVE 1                 TO W77-NO-ERROR                062100      
002028            MOVE SPACES            TO WLI-ENCAB-52                062200      
002029            MOVE "O"               TO WLI-TIPO-LJ                 062300      
002030            MOVE 010105            TO CODIGO-LJ                   062400      
002031            MOVE " ERROR AL HACER DELETE S151B50TOTXCVE "         062500      
002032                                   TO WLI-TEXTO-LJ                062600      
002033            PERFORM      000-030-IMPRIME-MENSAJE                  062700      
002034            CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,             062800      
002035                                         MENSAJE-LJ.              062900      
002036     END-TRANSACTION NO-AUDIT S151B99REINICIO.                    063000      
002037                                                                  063100      
002038     LOCK NEXT B50SXTOTXCVE                                       063200      
002039      AT B50-MOV-FEC NOT > WKS-FEC-PRO                            063300      
002040       ON EXCEPTION                                               063400      
002041          IF DMSTATUS (NOTFOUND)                                  063500      
002042             MOVE 1 TO W77-NO-ERROR                               063600      
002043          ELSE                                                    063700      
002044             MOVE 1                TO      W77-NO-ERROR           063800      
002045             MOVE SPACES           TO      WLI-ENCAB-52           063900      
002046             MOVE "O"              TO      WLI-TIPO-LJ            064000      
002047*            MOVE 010105           TO      CODIGO-LJ              064100      
002048             MOVE " ERROR AL HACER LOCK NEXT B50TOTXTOTXCVE "     064200      
002049                                   TO      WLI-TEXTO-LJ           064300      
002050             PERFORM      000-030-IMPRIME-MENSAJE.                064400      
002051*            CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,             064500      
002052*                                        MENSAJE-LJ.              064600      
002053                                                                  064700      
002054 000900-CIERRA-ARCHIVOS.                                          064800      
002055*-----------------------                                          064900      
002056     CLOSE L01-DATOS WITH SAVE.                                   065000      
002057     CLOSE MOVDB                                                  065100      
002058        ON EXCEPTION                                              065200      
002059        IF DMSTATUS (CLOSEERROR)                                  065300      
002060           MOVE SPACES             TO WLI-ENCAB-52                065400      
002061           MOVE "E"                TO WLI-TIPO-LJ                 065500      
002062           MOVE 010105             TO CODIGO-LJ                   065600      
002063           MOVE  " ERROR AL CERRAR BASE S151B50TOTXCVE "          065700      
002064                                   TO WLI-TEXTO-LJ                065800      
002065           PERFORM      000-030-IMPRIME-MENSAJE                   065900      
002066           MOVE WLI-TIPO-LJ   TO  TIPO-LJ                         066000      
002067           MOVE WLI-TEXTO-LJ  TO  TEXTO-LJ                        066100      
002068           CALL "LJ IN LIB-DISP"   USING CONTADOR-LJ,             066200      
002069                                         MENSAJE-LJ.              066300      
002070                                                                  066400      
002071 001000-FORMATO-DISPLAY.                                          066500      
002072*=======================                                          066600      
002073                                                                  066700      
002074*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002075*      COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY.".              066800      
002076                                                                  000100      
002077*===============================================================* 000200      
002078*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
002079*         PARA LLAMADO DE DISPLAY                               * 000400      
002080*===============================================================* 000500      
002081                                                                  000600      
002082     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
002083            TO BYFUNCTION.                                        000671      
002084                                                                  000691      
002085     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
002086          USING WKS-DATE-ARRAY2.                                  000800      
002087     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
002088     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
002089     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
002090     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
002091     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
002092     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
002093                                                                  001300      
002094     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
002095     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
002096     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
002097                               WKS-TIT-REPORTE2.                  001700      
002098*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
002099*                                  GIVING WKS-COMPILA2.           001900      
002100*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
002101*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
002102*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
002103*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
002104                                                                  002066      
002105*    IF WKS-AAA-VERSION2  < 50                                    002071      
002106*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
002107*    ELSE                                                         002081      
002108*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
002109                                                                  002091      
002110                                                                  002500      
002111*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
002112     OPEN OUTPUT V00-REPORTE2.                                    002700      
002113     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
002114     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
002115                                                                  003000      
002116 000-050-CHECA-SALTO-HOJA2.                                       003051      
002117*==========================                                       003071      
002118    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
002119     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
002120        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
002121     ELSE                                                         003079      
002122        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
002123     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
002124     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
002125     MOVE "/"                     TO WKS-SLASH1.                  003086      
002126     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
002127     MOVE "/"                     TO WKS-SLASH2.                  003088      
002128     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
002129     IF  WKS-NUM-LINEAS2 > 56                                     003091      
002130         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
002131         ADD 1                   TO    W77-CONT-HOJA2             003200      
002132         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
002133         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
002134         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
002135         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
002136         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
002137         MOVE SPACES             TO V00-R00-REPORTE2              003800      
002138         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
002139         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
002140                                                                  004100      
002141 000-030-IMPRIME-MENSAJE.                                         004200      
002142*========================                                         004300      
002143*LP                                                               004400      
002144     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
002145     ADD             2       TO WKS-NUM-LINEAS2                   004600      
002146     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
002147                                                                  004800      
002148*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002149                                                                  066900      
002150 001000-ARMA-ARCHIVO.                                             067000      
002151                                                                  067100      
002152     IF WKS-PARAM-SIS = 87                                        067200      
002153        MOVE 87                    TO A00-R01-PRODUCTO.           067300      
002154                                                                  067400      
002155     IF WKS-PARAM-SIS = 500                                       067500      
002156        IF A00-R01-TIPO-PROC < 15 OR                              067600      
002157          ((A00-R01-TIPO-PROC = 15  OR 16 OR 17) AND              067700      
002158           (A00-R01-CVETRAN(1)=3009 OR A00-R01-CVETRAN(1)=3036))  067800      
002159          MOVE 1                   TO A00-R01-TIPO-PROC           067900      
002160        ELSE                                                      068000      
002161           MOVE 11                 TO A00-R01-TIPO-PROC.          068100      
002162                                                                  068200      
002163     ADD 1                         TO W77-NUM-MOVS-LEI            068300      
002164     IF A00-R01-FUNCION = 1 AND A00-R01-STATUS = 1                068400      
002165        MOVE A00-R01-FECCONT       TO WKS-RS-FECHA-PRO            068500      
002166        MOVE A00-R01-TIPO-PROC     TO WKS-RS-TIPO-PROC            068600      
002167        MOVE A00-R01-PRODUCTO      TO WKS-RS-NUM-PRODUCTO         068700      
002168        MOVE A00-R01-INSTRUMENTO                                  068800      
002169                                   TO WKS-RS-INSTRUMENTO          068900      
002170        MOVE A00-R01-MONEDA        TO WKS-RS-MONEDA               069000      
002171        MOVE ZERO                  TO WKS-RS-TIPO-MOV             069100      
002172                                                                  069200      
002173        IF WKS-PARAM-SIS   = 500                                  069300      
002174           MOVE A00-R01-BCO-ORI       TO WKS-RS-BCOORI            069400      
002175           MOVE A00-R01-BCO-DES       TO WKS-RS-BCODES            069500      
002176        ELSE                                                      069600      
002177        IF WKS-PARAM-SIS   = 403 OR 404                           069700      
002178           NEXT SENTENCE                                          069800      
002179        ELSE                                                      069900      
002180            MOVE 2                  TO WKS-RS-BCOORI              070000      
002181                                       WKS-RS-BCODES.             070100      
002182                                                                  070200      
002183     IF A00-R01-FUNCION = 1 AND A00-R01-STATUS = 1                070300      
002184        PERFORM 001100-ARMA-REGISTRO                              070400      
002185                VARYING W77-IND FROM 1 BY 1                       070500      
002186                UNTIL   W77-IND > 5.                              070600      
002187                                                                  070700      
002188     MOVE 1                        TO W77-TOTREG.                 070710      
002189     MOVE ZERO                     TO W77-REG-OK.                 070720      
002190     PERFORM 001000-LEE-REGISTRO UNTIL W77-REG-OK = 1 OR          070730      
002191                                       W88-LEE-FIN .              070740      
002192                                                                  070750      
002193 001000-LEE-REGISTRO.                                             070760      
002194*====================                                             070770      
002195     READ L01-DATOS INTO A00-R01-REGMOV                           070780      
002196       AT END MOVE 1               TO W77-LEE-FIN.                070790      
002197                                                                  070800      
002198*<<INICIO-IBM>>MGGR EXCLUSION DE MOVIMIENTOS TELETON              070810      
002199        IF WKS-PARAM-SIS = 500 AND                                070820      
002200          (A00-R01-TIPO-PROC = 40 OR 41 OR 42 OR 43)              070830      
002201           NEXT SENTENCE                                          070840      
002202        ELSE                                                      070850      
002203           MOVE 1                 TO W77-REG-OK.                  070860      
002204*<<FIN-IBM>>MGGR EXCLUSION DE MOVIMIENTOS TELETON                 070870      
002205                                                                  070880      
002206     IF A00-R01-FUNCION = 99                                      070890      
002207        MOVE 1                     TO W77-LEE-FIN.                070900      
002208**LP                                                              070910      
002209     IF A00-R01-FUNCION = 1  AND    A00-R01-STATUS = 1            070920      
002210        ADD  1          TO W77-TOTREG.                            070930      
002211                                                                  070940      
002212 001100-ARMA-REGISTRO.                                            071800      
002213                                                                  071900      
002214     IF A00-R01-CVETRAN(W77-IND) > 0                              072000      
002215        MOVE A00-R01-CVETRAN(W77-IND)                             072100      
002216                                   TO WKS-RS-CVETRAN              072200      
002217        MOVE A00-R01-ESQCON(W77-IND)                              072300      
002218                                   TO WKS-RS-ESQCON               072400      
002219        MOVE A00-R01-IMPORTE(W77-IND)                             072500      
002220                                   TO WKS-RS-IMPORTE              072600      
002221        PERFORM 001150-ESCRIBE-REGISTRO.                          072700      
002222                                                                  072800      
002223 001150-ESCRIBE-REGISTRO.                                         072900      
002224     WRITE A02-R00-REG-DISK FROM WKS-REG-SORT                     073000      
002225           INVALID KEY                                            073100      
002226           MOVE SPACES             TO WLI-ENCAB-52                073200      
002227           MOVE "I"                TO WLI-TIPO-LJ                 073300      
002228*          MOVE 010105             TO CODIGO-LJ                   073400      
002229           MOVE "ERROR EN WRITE EN ARCHIVO PARA SORT"             073500      
002230                                   TO WLI-TEXTO-LJ                073600      
002231           PERFORM      000-030-IMPRIME-MENSAJE.                  073700      
002232*          CALL "LJ IN LIB-DISP"   USING CONTADOR-LJ,             073800      
002233*                                        MENSAJE-LJ.              073900      
002234     ADD 1                         TO W77-NUM-REG-ESCR.           074000      
002235                                                                  074100      
002236 002000-SORT-ARCHIVO.                                             074200      
002237**** Inicia cambio Fabrica de software **** Abarbosa       P05-355074201      
002238     OPEN INPUT   A02-ARCH-SORT                                   074205      
002239     COMPUTE W77-FRAMESIZE        =                               074210      
002240            (ATTRIBUTE FRAMESIZE  OF A02-ARCH-SORT)               074215      
002241     COMPUTE W77-MAXRECSIZE       =                               074220      
002242            (ATTRIBUTE MAXRECSIZE OF A02-ARCH-SORT)               074225      
002243     COMPUTE W77-LASTRECORD       =                               074230      
002244            (ATTRIBUTE LASTRECORD OF A02-ARCH-SORT                074235      
002245                                  +   1)                          074240      
002246     CLOSE        A02-ARCH-SORT WITH SAVE                         074245      
002247     PERFORM                      70000-CALCULA-ESPACIO           074250      
002248**** Fin    cambio Fabrica de software **** Abarbosa       P05-355074255      
002249     SORT A01-SDO-MOVS ASCENDING KEY A01-R00-KEY                  074300      
002250**** Inicia cambio Fabrica de software **** Abarbosa       P05-355074301      
002251          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    074400      
002252          DISK   SIZE IS W77-DISK-SIZE   WORDS                    074500      
002253**** Fin    cambio Fabrica de software **** Abarbosa       P05-355074501      
002254          USING A02-ARCH-SORT                                     074600      
002255          GIVING A02-ARCH-SORT.                                   074700      
002256                                                                  074800      
002257 002100-ARMA-BDTOTXCVE.                                           074900      
002258                                                                  075000      
002259     IF WKS-LLAVE-ANT = WKS-RS-LLAVE                              075100      
002260        ADD WKS-RS-IMPORTE         TO W77-IMPMOV                  075200      
002261        ADD 1                      TO W77-NUMMOV                  075300      
002262     ELSE                                                         075400      
002263        PERFORM 002200-ACT-BD                                     075500      
002264        MOVE WKS-RS-LLAVE          TO WKS-LLAVE-ANT,              075600      
002265        MOVE WKS-RS-IMPORTE        TO W77-IMPMOV                  075700      
002266        MOVE 1                     TO W77-NUMMOV.                 075800      
002267     READ A02-ARCH-SORT INTO WKS-REG-SORT                         075900      
002268        AT END MOVE 1              TO W77-LEE-FIN.                076000      
002269                                                                  076100      
002270 002200-ACT-BD.                                                   076200      
002271     MOVE 0                        TO W77-BAN-CREA,               076300      
002272                                      W77-NO-ERROR.               076400      
002273                                                                  076500      
002274     LOCK B50SXTOTXCVE AT                                         076600      
002275          B50-MOV-FEC         = WKS-FECHA-PRO-ANT    AND          076700      
002276          B50-MOV-PROCESO     = WKS-TIPO-PROC-ANT    AND          076800      
002277          B50-MOV-PRD         = WKS-NUM-PRODUCTO-ANT AND          076900      
002278          B50-MOV-INS         = WKS-INSTRUMENTO-ANT  AND          077000      
002279          B50-MOV-MONEDA      = WKS-MONEDA-ANT       AND          077100      
002280*         B50-MOV-BCOORI      = WKS-BCOORI-ANT       AND          077200      
002281*         B50-MOV-BCODES      = WKS-BCODES-ANT       AND          077300      
002282          B50-MOV-BANCOS      = WKS-BCOS-ANT         AND          077400      
002283*************B50-MOV-TIPMOV   = WKS-TIPO-MOV-ANT     AND          077500      
002284          B50-MOV-CVETRA      = WKS-CVETRAN-ANT      AND          077600      
002285          B50-MOV-ESQCON      = WKS-ESQCON-ANT                    077700      
002286       ON EXCEPTION                                               077800      
002287          IF DMSTATUS (NOTFOUND)                                  077900      
002288             CREATE S151B50TOTXCVE                                078000      
002289             MOVE WKS-FECHA-PRO-ANT       TO B50-MOV-FEC          078100      
002290             MOVE WKS-TIPO-PROC-ANT       TO B50-MOV-PROCESO      078200      
002291             MOVE WKS-NUM-PRODUCTO-ANT    TO B50-MOV-PRD          078300      
002292             MOVE WKS-INSTRUMENTO-ANT     TO B50-MOV-INS          078400      
002293             MOVE WKS-MONEDA-ANT          TO B50-MOV-MONEDA       078500      
002294*            MOVE WKS-BCOORI-ANT          TO B50-MOV-BCOORI       078600      
002295*            MOVE WKS-BCODES-ANT          TO B50-MOV-BCODES       078700      
002296             MOVE WKS-BCOS-ANT            TO B50-MOV-BANCOS       078800      
002297             MOVE WKS-CVETRAN-ANT         TO B50-MOV-CVETRA       078900      
002298             MOVE WKS-ESQCON-ANT          TO B50-MOV-ESQCON       079000      
002299          ELSE                                                    079100      
002300             MOVE 1                TO W77-SUCYCAJ                 079200      
002301                                      W77-NO-ERROR                079300      
002302             MOVE SPACES           TO WLI-ENCAB-52                079400      
002303             MOVE "E"              TO WLI-TIPO-LJ, TIPO-LJ        079500      
002304             MOVE 010105           TO CODIGO-LJ                   079600      
002305             MOVE " ERROR AL HACER LOCK B50TOTXTOTXCVE "          079700      
002306                                   TO   WLI-TEXTO-LJ, TEXTO-LJ    079800      
002307             PERFORM      000-030-IMPRIME-MENSAJE                 079900      
002308             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,MENSAJE-LJ.  080000      
002309                                                                  080100      
002310     BEGIN-TRANSACTION NO-AUDIT S151B99REINICIO                   080200      
002311     IF W88-NO-ERROR                                              080300      
002312        MOVE W77-NUMMOV            TO B50-MOV-NUMMOV              080400      
002313        MOVE W77-IMPMOV            TO B50-MOV-IMPMOV              080500      
002314        ADD 1                      TO W77-MOVESCR                 080600      
002315        STORE S151B50TOTXCVE                                      080700      
002316           ON EXCEPTION                                           080800      
002317              MOVE DMSTATUS(DMCATEGORY)  TO W77-STATUS-BASE       080900      
002318              MOVE DMSTATUS(DMERRORTYPE) TO W77-ERROR-BASE        081000      
002319              MOVE "E"             TO WLI-TIPO-LJ, TIPO-LJ        081100      
002320              MOVE 010105          TO CODIGO-LJ                   081200      
002321              STRING " ERROR AL HACER STORE S151B50TOTXCVE "      081300      
002322                     "DMSTATUS : ", W77-STATUS-BASE,              081400      
002323                     " ERROR " W77-ERROR-BASE DELIMITED BY SIZE   081500      
002324              INTO WLI-TEXTO-LJ                                   081600      
002325              MOVE WLI-TEXTO-LJ           TO TEXTO-LJ             081700      
002326              PERFORM      000-030-IMPRIME-MENSAJE                081800      
002327              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,            081900      
002328                                          MENSAJE-LJ.             082000      
002329                                                                  082100      
002330     END-TRANSACTION NO-AUDIT S151B99REINICIO.                    082200      
002331*INICIA CODIGO DE RENOVACION CRONOS 2000                          082300      
002332*A2K-CPY-SECTION SECTION.                                         082400      
002333*    COPY "S151/CRONOS2K/CPY/PD".                                 082500      
002334*A2K-CPY-EXIT-PARA.                                               082600      
002335*EXIT.                                                            082700      
002336**** Inicia cambio Fabrica de software **** Abarbosa       P05-355082710      
002337*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002338* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP002 ON CMEMP."         082720      
002339*                                      FROM 100000 TO 999999      082730      
002340                                                                  100000      
002341*----------------------------------------------------------------*100100      
002342*   PROCEDIMIENTO DE CALCULO DINAMICO DE ESPACIO PARA EL SORT    *100200      
002343*----------------------------------------------------------------*100300      
002344 70000-CALCULA-ESPACIO.                                           100400      
002345*======================                                           100500      
002346     IF W77-FRAMESIZE             =   8                           100600      
002347        COMPUTE WS-CALC-WORD      =   W77-MAXRECSIZE              100700      
002348                                  /   6                           100800      
002349        IF WS-WORD-RES            >   ZEROS                       100900      
002350           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                 101000      
002351                                  +   1                           101100      
002352        ELSE                                                      101200      
002353           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                .101300      
002354     COMPUTE W77-MEMORY-65K  =   66000 * W77-MAXRECSIZE     .     101400      
002355                                                                  101402      
002356     COMPUTE W77-MEMORY-SIZE ROUNDED                              101500      
002357                                  =   (W77-MAXRECSIZE + 3)        101600      
002358                                  *   (W77-LASTRECORD / 16)       101700      
002359                                  +   1500                       .101750      
002360                                                                  101770      
002361     IF W77-MEMORY-SIZE > 258435000                               101800      
002362        MOVE 258435000              TO W77-MEMORY-SIZE            101820      
002363     ELSE                                                         101850      
002364     IF W77-MEMORY-SIZE < 400000                                  101870      
002365        MOVE W77-MEMORY-65K         TO W77-MEMORY-SIZE.           101900      
002366                                                                  101990      
002367     COMPUTE W77-DISK-SIZE ROUNDED                                102000      
002368                                  =  (W77-MAXRECSIZE + 3)         102100      
002369                                  *   W77-LASTRECORD              102200      
002370                                  *   3.5                        .102300      
002371                                                                  102400      
002372*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002373**** Fin    cambio Fabrica de software **** Abarbosa       P05-355082740      
002374*TERMINA CODIGO DE RENOVACION CRONOS 2000                         082800      
