000001$SET LIST LINEINFO MAP XREF OPTIMIZE                              000100      
000002*INICIA CODIGO DE RENOVACION CRONOS 2000                          000101      
000003$SET LISTOMITTED                                                  000102      
000004$SET OLDCODE                                                      000103      
000005*TERMINA CODIGO DE RENOVACION CRONOS 2000                         000104      
000006*$SET TADS                                                        000154      
000007**************************************************************    000170      
000008* RECOMPILACION POR EL UPGRADE DEL MCP A 55                  *    000172      
000009* 20141205 15MTP001 MJGRG                                    *    000174      
000010**************************************************************    000176      
000011 IDENTIFICATION DIVISION.                                         000200      
000012 PROGRAM-ID.             ADMOV.                                   000300      
000013 AUTHOR.                 GERARDO PE&A DUE&AS.                     000400      
000014 INSTALLATION.           BANAMEX                                  000500      
000015                         INGENIERIA DE SISTEMAS PROD EST          000600      
000016                         CENTRO DE DESARROLLO LEON.               000700      
000017 DATE-WRITTEN.           OCTUBRE DE 1993.                         000800      
000018 DATE-COMPILED.                                                   000900      
000019 SECURITY.               COPYRIGHT 1993 BY BANAMEX                001000      
000020*                                                                 001100      
000021 ENVIRONMENT DIVISION.                                            001200      
000022 CONFIGURATION SECTION.                                           001300      
000023 SOURCE-COMPUTER.        A-10.                                    001400      
000024 OBJECT-COMPUTER.        A-19.                                    001500      
000025*                                                                 001600      
000026 INPUT-OUTPUT SECTION.                                            001700      
000027 FILE-CONTROL.                                                    001800      
000028                                                                  001900      
000029     SELECT MONITOREO     ASSIGN TO DISK.                         002000      
000030                                                                  002100      
000031 DATA        DIVISION.                                            002200      
000032 FILE SECTION.                                                    002300      
000033                                                                  002400      
000034 FD MONITOREO.                                                    002500      
000035 01  REG-MONITOREO                PIC X(132).                     002600      
000036                                                                  002700      
000037 WORKING-STORAGE SECTION.                                         002800      
000038*INICIA CODIGO DE RENOVACION CRONOS 2000                          002801      
000039*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000040* COPY "S151/CRONOS2K/CPY/WS".                                    002802      
000041******************************************************************000100      
000042** This copyBook defines all the additional variables that      **000200      
000043** Unisys has defined for the CRONOS2K project                  **000300      
000044** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000045******************************************************************000500      
000046                                                                  000600      
000047******************************************************************000700      
000048** These Variables are used to Accept the system date in long   **000800      
000049** format and get the century information                       **000900      
000050** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000051 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000052 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000053    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000054    05 FILLER      PIC X(1).                                      001400      
000055    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000056    05 FILLER      PIC X(1).                                      001600      
000057    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000058    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000059      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000060      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000061******************************************************************002100      
000062                                                                  002200      
000063******************************************************************002300      
000064** This variable defines a date in the format MMDDCCAA          **002400      
000065**                                                              **002500      
000066 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000067 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000068    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000069    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000070    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000071    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000072      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000073      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000074******************************************************************003400      
000075                                                                  003500      
000076******************************************************************003600      
000077** This variable defines a date in the format CCAAMMDD          **003700      
000078**                                                              **003800      
000079 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000080 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000081    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000082    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000083      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000084      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000085    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000086    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000087******************************************************************004700      
000088                                                                  004800      
000089******************************************************************004900      
000090** This variable defines a date in the format DDMMCCAA          **005000      
000091**                                                              **005100      
000092 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000093 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000094    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000095    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000096    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000097    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000098      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000099      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000100******************************************************************006000      
000101                                                                  006100      
000102******************************************************************006200      
000103** This variable defines a date in the Julian Format CCAADDD    **006300      
000104**                                                              **006400      
000105 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000106 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000107    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000108    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000109                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000110      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000111      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000112    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000113******************************************************************007300      
000114                                                                  007400      
000115******************************************************************007500      
000116** This variable defines a date in the format AAMMDD            **007600      
000117**                                                              **007700      
000118 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000119 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000120    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000121    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000122    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000123******************************************************************008300      
000124                                                                  008400      
000125******************************************************************008500      
000126** This variable defines a date in the format MMDDAA            **008600      
000127**                                                              **008700      
000128 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000129 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000130    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000131    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000132    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000133******************************************************************009300      
000134                                                                  009400      
000135******************************************************************009500      
000136** This variable defines a date in the format DDMMAA            **009600      
000137**                                                              **009700      
000138 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000139 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000140    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000141    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000142    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000143******************************************************************010300      
000144                                                                  010400      
000145******************************************************************010500      
000146** These variables are defined to be used for CALL bridge logic **010600      
000147**                                                              **010700      
000148 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000149 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000150 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000151 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000152 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000153 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000154******************************************************************011400      
000155                                                                  011500      
000156******************************************************************011600      
000157** This variable is used for converting only a year field AA to **011700      
000158** CCAA and a CCAA to AA                                        **011800      
000159 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000160 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000161    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000162    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000163 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000164 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000165******************************************************************012300      
000166                                                                  012400      
000167******************************************************************012500      
000168** These variables are Bridge Variables for Intercambio files   **012600      
000169** para EDOCTA                                                  **012700      
000170 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000171 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000172 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000173 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000174 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000175 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000176 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000177******************************************************************013500      
000178* Para MODULO                                                     013600      
000179 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000180******************************************************************013800      
000181******************************************************************013900      
000182** Para FMOVSCHABO                                                014000      
000183 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000184******************************************************************014200      
000185                                                                  014300      
000186******************************************************************014400      
000187***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000188******************************************************************014600      
000189                                                                  014700      
000190 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000191 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000192     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000193     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000194     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000195******************************************************************015300      
000196                                                                  015400      
000197******************************************************************015500      
000198***  These Variables Are Defined For Date In AAMM Format       ***015600      
000199******************************************************************015700      
000200                                                                  015800      
000201 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000202 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000203     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000204     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000205******************************************************************016300      
000206                                                                  016400      
000207                                                                  016500      
000208*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000209  01  A2K-BASE-YEAR                 PIC 9(02) VALUE 50.           002803      
000210*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002804      
000211                                                                  002900      
000212  01  WKS-TIT-TASKFILE.                                           003000      
000213      03 FILLER                     PIC X(30) VALUE               003100      
000214         "FILE TASKFILE (USERBACKUPNAME=".                        003200      
000215      03 FILLER                     PIC X(30) VALUE               003300      
000216         "TRUE,TITLE=S151/TASKFILE/P030/".                        003400      
000217      03 WKS-TSK-NODO               PIC 9(02).                    003500      
000218      03 WKS-TSK-SUBN               PIC 9(02) VALUE ZERO.         003600      
000219      03 FILLER                     PIC X(06) VALUE               003700      
000220         "/R000/".                                                003800      
000221      03 WKS-TSK-FECHA              PIC 9(06).                    003900      
000222      03 FILLER                     PIC X(01) VALUE "/".          004000      
000223      03 WKS-TSK-MXNB               PIC 9(07).                    004100      
000224      03 FILLER                     PIC X(01) VALUE "/".          004200      
000225      03 WKS-TSK-MNEMONICO          PIC X(14) VALUE               004300      
000226         "001TASKFILE );".                                        004400      
000227                                                                  004500      
000228*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000229* COPY "S151/COPY/COBOL ON CMEMP." FROM 4100 TO 6200.             004600      
000230******************************************************************004100      
000231*               LIBRERIA LOCSUP        ( S006 )                  *004200      
000232******************************************************************004300      
000233                                                                  004400      
000234 77  WKS-FUNCION                   PIC S9(11) BINARY.             004500      
000235 77  WKS-FORMATO                   PIC S9(11) BINARY.             004600      
000236 01  WKS-CAMNUM-ALFA               PIC X(23).                     004700      
000237 01  WKS-CAMNUM-NUM                REDEFINES                      004800      
000238     WKS-CAMNUM-ALFA               PIC 9(23).                     004900      
000239                                                                  005000      
000240 01  WKS-FECHA1                    PIC X(06).                     005100      
000241 01  WKS-FECHA1-RED   REDEFINES    WKS-FECHA1.                    005200      
000242     05  WKS-AMO1-RED              PIC 9(02).                     005300      
000243     05  WKS-MES1-RED              PIC 9(02).                     005400      
000244     05  WKS-DIA1-RED              PIC 9(02).                     005500      
000245*                                                                 005600      
000246 01  WKS-FECHA2                    PIC X(06).                     005700      
000247*                                                                 005800      
000248 01  WKS-FECHA2-RED   REDEFINES    WKS-FECHA2.                    005900      
000249     05  WKS-AMO2-RED              PIC 9(02).                     006000      
000250     05  WKS-MES2-RED              PIC 9(02).                     006100      
000251     05  WKS-DIA2-RED              PIC 9(02).                     006200      
000252*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000253 77  W77-IND-CON             PIC 9(04).                           004700      
000254 77  W77-I                   PIC 9(02) VALUE ZEROS.               004800      
000255 77  W77-ELEMENTOS           PIC 9(04) VALUE ZEROS.               004810      
000256 77  77-VAR                  PIC 9(18) BINARY.                    004900      
000257 77  LIB-LONGMSG             PIC 9(11)   BINARY.                  005000      
000258 77  77-ADMOV-FECPROC-6DIG   PIC 9(06)   COMP.                    005100      
000259*INICIA CODIGO DE RENOVACION CRONOS 2000                          005101      
000260 77  77-ADMOV-FECPROC        PIC 9(08)   COMP.                    005102      
000261*TERMINA CODIGO DE RENOVACION CRONOS 2000                         005103      
000262 77  W77-CHQS-ANT            PIC 9(02)   COMP.                    005200      
000263     88 W88-CHQS-ANT         VALUE 1.                             005300      
000264 01  WS-MSG-COMS             PIC X(1926) WITH LOWER-BOUNDS.       005600      
000265 01  WS-MSG-COMS-R           REDEFINES WS-MSG-COMS.               005700      
000266     02 WS-HEADER-COMS.                                           005800      
000267        03 WS-HDR-COMS-PREFIJO    PIC X.                          005900      
000268        03 WS-HDR-COMS-APL-DES    PIC X.                          006000      
000269        03 WS-HDR-COMS-CCR-DES    PIC 99.                         006100      
000270        03 WS-HDR-COMS-LST-ORG    PIC 9999.                       006200      
000271        03 WS-HDR-COMS-LST-ORG-R REDEFINES                        006300      
000272           WS-HDR-COMS-LST-ORG    PIC 9(08) COMP.                 006400      
000273        03 WS-HDR-COMS-STATION.                                   006500      
000274           04 WS-HDR-COMS-TPO     PIC X.                          006600      
000275           04 WS-HDR-COMS-SUC     PIC 9999.                       006700      
000276           04 WS-HDR-COMS-PRIV    PIC X.                          006800      
000277           04 WS-HDR-COMS-CAJ     PIC 99.                         006900      
000278        03 WS-HDR-COMS-CCR-ORG    PIC 99.                         007000      
000279        03 WS-HDR-COMS-COP-ORG    PIC 99.                         007100      
000280        03 WS-HDR-COMS-FAC        PIC 99.                         007200      
000281        03 WS-HDR-COMS-APL-ORG    PIC X.                          007300      
000282        03 WS-HDR-COMS-RES        PIC 99.                         007400      
000283        03 WS-HDR-COMS-MASC       PIC X(5).                       007500      
000284        03 WS-HDR-COMS-PWR        PIC X(6).                       007600      
000285     02 WS-TEXTO-COMS-SA2         PIC X(1890).                    007700      
000286     02 WS-TEXTO-COMS-SA2-R REDEFINES WS-TEXTO-COMS-SA2.          007800      
000287        03 WS-TRANCODE-COMS       PIC 9(6).                       007900      
000288        03 WS-TEXTO-COMS          PIC X(1884).                    008000      
000289 01  WS-MSG                  PIC X(1920) WITH LOWER-BOUNDS.       008100      
000290 01  WS-MSG-R                REDEFINES WS-MSG.                    008200      
000291     02 WS-HEADER.                                                008300      
000292        03 WS-HDR-PREFIJO    PIC X.                               008400      
000293        03 WS-HDR-APL-DES    PIC X.                               008500      
000294        03 WS-HDR-CCR-DES    PIC 99.                              008600      
000295        03 WS-HDR-LST-ORG    PIC 9999.                            008700      
000296        03 WS-HDR-LST-ORG-R REDEFINES                             008800      
000297           WS-HDR-LST-ORG    PIC 9(08) COMP.                      008900      
000298        03 WS-HDR-STATION.                                        009000      
000299           04 WS-HDR-TPO     PIC X.                               009100      
000300           04 WS-HDR-SUC     PIC 9999.                            009200      
000301           04 WS-HDR-PRIV    PIC X.                               009300      
000302           04 WS-HDR-CAJ     PIC 99.                              009400      
000303        03 WS-HDR-CCR-ORG    PIC 99.                              009500      
000304        03 WS-HDR-COP-ORG    PIC 99.                              009600      
000305        03 WS-HDR-FAC        PIC 99.                              009700      
000306        03 WS-HDR-FAC-R REDEFINES WS-HDR-FAC PIC X(02).           009800      
000307        03 WS-HDR-APL-ORG    PIC X.                               009900      
000308        03 WS-HDR-RES        PIC 99.                              010000      
000309           88 MSG-DE-APLICACION       VALUE 2, 4.                 010100      
000310           88 MSG-DE-RED              VALUE 11, 12.               010200      
000311           88 MSG-RED-FOR             VALUE 12.                   010300      
000312           88 MSG-A-MASCARA           VALUE 3.                    010400      
000313           88 MSG-A-TERMINAL          VALUE 1.                    010500      
000314           88 MSG-DE-ERRORES          VALUE 31, 32, 33.           010600      
000315           88 MSG-NO-EXIST-APL        VALUE 32.                   010700      
000316        03 WS-HDR-MASC       PIC X(5).                            010800      
000317        03 WS-HDR-PWR        PIC X(6).                            010900      
000318     02 WS-TEXTO             PIC X(1884).                         011000      
000319     02 WS-TEXTO-R2          REDEFINES WS-TEXTO.                  011100      
000320        03 WS-TXT-F          PIC X(3).                            011200      
000321         03 WS-TXT-FUN        PIC 999.                            011300      
000322        03 WS-TXT-FS         PIC X(03).                           011400      
000323        03 WS-TXT-MSG        PIC X(1875).                         011500      
000324     02 WS-TEXTO-TABLA REDEFINES WS-TEXTO OCCURS 1884 TIMES.      011600      
000325        03 WS-REM-TEXTO-CHAR    PIC X(01).                        011700      
000326     02 WS-TEXTO-SA2         REDEFINES WS-TEXTO.                  011800      
000327        03 WS-AMPLIACION-HEADER.                                  011900      
000328           05  WS-PREFIJO-DESTINO         PIC 9(06).              012000      
000329           05  WS-PREFIJO-ORIGEN          PIC 9(06).              012100      
000330        03 WS-SEGMENTO-DE-INFRAESTRUCTURA.                        012200      
000331           05  WS-SA2-DESTINO-SISTEMA     PIC 9(04).              012300      
000332           05  WS-SA2-DESTINO-CODSERV     PIC 9(02).              012400      
000333           05  WS-SA2-DESTINO-SUBCODSERV  PIC 9(03).              012500      
000334           05  WS-SA2-ORIGEN-SISTEMA      PIC 9(04).              012600      
000335           05  WS-SA2-ORIGEN-CODSERV      PIC 9(02).              012700      
000336           05  WS-SA2-ORIGEN-SUBCODSERV   PIC 9(03).              012800      
000337           05  WS-SA2-DIRECCION           PIC 9.                  012900      
000338           05  WS-SA2-LONG-MSG            PIC 9(04).              013000      
000339           05  WS-SA2-TIEMPO-ESPERA       PIC 9(05).              013100      
000340           05  WS-SA2-RESULT-ICA          PIC 9(02).              013200      
000341           05  WS-SA2-FORMATO-ID          PIC 9(02).              013300      
000342           05  WS-SA2-FORMATO-RECON       PIC 9.                  013400      
000343           05  WS-SA2-FORMATO-VERSION     PIC X.                  013500      
000344           05  WS-SA2-MENSAJE-CLASE       PIC 9.                  013600      
000345           05  WS-SA2-MENSAJE-RESULT      PIC 9.                  013700      
000346           05  WS-SA2-MENSAJE-MODO        PIC 9.                  013800      
000347        03 WS-SEGMENTO-DE-APLICACIONES.                           013900      
000348           05  WS-SA2-ENTIDAD-ORIGEN      PIC 9(04).              014000      
000349           05  WS-SA2-CAJA-ORIGEN         PIC X(03).              014100      
000350           05  WS-SA2-NUMERO-TRANS        PIC 9(08).              014200      
000351           05  WS-SA2-FECHA               PIC 9(06).              014300      
000352           05  WS-SA2-HORA                PIC 9(06).              014400      
000353           05  WS-SA2-MODALIDAD           PIC 9(02).              014500      
000354           05  WS-SA2-OPERADOR            PIC X(10).              014600      
000355           05  WS-SA2-VERSION-DATOS-OPC   PIC X.                  014700      
000356        03 WS-MENSAJE-ENTRE-APLICACIONES  PIC X(1700).            014800      
000357        03 FILLER            PIC X(95).                           014900      
000358******************************************************************015000      
000359*          DIALOGO  ENTRE APLICACIONES CON SA2                   *015100      
000360******************************************************************015200      
000361 01  WS-MENSAJE-ENT-SA2                   PIC X(1700).            015300      
000362 01  WS-SOLICITUD-TOTALES        REDEFINES WS-MENSAJE-ENT-SA2.    015400      
000363     02  WS-ST-CAJA                       PIC 9(02).              015500      
000364     02  WS-ST-CONTINUACION               PIC 9(10).              015600      
000365     02  WS-ST-CONTINUACION-RED REDEFINES WS-ST-CONTINUACION.     015700      
000366         04  WS-ST-CONT-PROD              PIC 9(04).              015800      
000367         04  WS-ST-CONT-CAJA              PIC 9(02).              015900      
000368         04  WS-ST-CONT-MONEDA            PIC 9(04).              016000      
000369     02  WS-ST-OCURRENCIAS                PIC 9(02).              016100      
000370     02  WS-ST-PRODUCTOS                  OCCURS 50 TIMES.        016200      
000371         04  WS-ST-NUMPROD                PIC 9(04).              016300      
000372     02  FILLER                           PIC X(1486).            016400      
000373                                                                  016410      
000374 01  WS-DIALOGO-TOTALES         REDEFINES WS-MENSAJE-ENT-SA2.     016412      
000375     02  WS-DIA-CONTINUACION              PIC 9(10).              016414      
000376     02  WS-DIA-CAJA                      PIC 9(02).              016416      
000377     02  WS-DIA-OCURRENCIAS               PIC 9(02).              016418      
000378     02  WS-DIA-DATOS-DE-TOTALES OCCURS 17 TIMES.                 016420      
000379         04  WS-DIA-PRODUCTO              PIC 9(04).              016422      
000380         04  WS-DIA-MONEDA                PIC 9(04).              016424      
000381         04  WS-DIA-NUM-CARGO             PIC 9(04).              016426      
000382         04  WS-DIA-IMP-CARGO             PIC 9(14)V99.           016428      
000383         04  WS-DIA-NUM-ABONO             PIC 9(04).              016430      
000384         04  WS-DIA-IMP-ABONO             PIC 9(14)V99.           016432      
000385         04  WS-DIA-NUM-INST-CARGO        PIC 9(04).              016434      
000386         04  WS-DIA-IMP-INST-CARGO        PIC 9(14)V99.           016436      
000387         04  WS-DIA-NUM-INST-ABONO        PIC 9(04).              016438      
000388         04  WS-DIA-IMP-INST-ABONO        PIC 9(14)V99.           016440      
000389         04  WS-DIA-CONSULTA              PIC 9(01).              016442      
000390     02  FILLER                           PIC X(173).             016444      
000391                                                                  016500      
000392 01  WS-SOLICITUD-MOVIMIENTOS    REDEFINES WS-MENSAJE-ENT-SA2.    016600      
000393     02  WS-SM-CONTINUACION               PIC 9(16).              016700      
000394     02  WS-SM-CONTINUACION-R REDEFINES WS-SM-CONTINUACION.       016800      
000395         04  WS-SM-CONT-AUTAPL            PIC 9(08).              016900      
000396         04  WS-SM-CONT-AUTADM            PIC 9(08).              017000      
000397     02  WS-SM-CAJA                       PIC 9(04).              017100      
000398     02  WS-SM-PRODUCTO                   PIC 9(04).              017200      
000399     02  WS-SM-MONEDA                     PIC 9(04).              017300      
000400     02  WS-SM-NATURALEZAC                PIC 9(01).              017400      
000401     02  WS-SM-NATURALEZAA                PIC 9(01).              017500      
000402     02  WS-SM-NATURALEZAIC               PIC 9(01).              017600      
000403     02  WS-SM-NATURALEZAIA               PIC 9(01).              017700      
000404     02  FILLER                           PIC X(1668).            017800      
000405                                                                  017900      
000406 01  WS-SOLICITUD-COMPENSACION   REDEFINES WS-MENSAJE-ENT-SA2.    018000      
000407     02  WS-SC-NUMERO-CAJA                PIC 9(04).              018100      
000408     02  WS-SC-NUMERO-OCURRENCIAS         PIC 9(02).              018200      
000409     02  WS-SC-DATOS-A-COMPENSAR          OCCURS 50 TIMES.        018300      
000410         04  WS-SC-PRODUCTOS              PIC 9(04).              018400      
000411         04  WS-SC-MONEDA                 PIC 9(04).              018500      
000412     02  FILLER                           PIC X(1294).            018600      
000413                                                                  018700      
000414 01  WS-SOLICITUD-MOVESPECIFICO  REDEFINES WS-MENSAJE-ENT-SA2.    018800      
000415     02  WS-SOL-ME-NUMPROD                PIC 9(04).              018900      
000416     02  WS-SOL-ME-NUMSUC                 PIC 9(04).              019000      
000417     02  WS-SOL-ME-NUMCAJ                 PIC 9(02).              019100      
000418     02  WS-SOL-ME-NUMMON                 PIC 9(03).              019200      
000419     02  WS-SOL-ME-NUMAUT                 PIC 9(08).              019300      
000420     02  FILLER                           PIC X(1679).            019400      
000421                                                                  019500      
000422 01  WS-MENSAJE-SAL-SA2                   PIC X(1700).            019600      
000423 01  WS-RESPUESTA-PRODUCTOS-OK  REDEFINES WS-MENSAJE-SAL-SA2.     019700      
000424     02  WS-RP-OCURRENCIAS                PIC 9(02).              019800      
000425     02  WS-RP-DATOS-PRODUCTOS        OCCURS 50 TIMES.            019900      
000426         04  WS-RP-PROD-NUMERO            PIC 9(04).              020000      
000427         04  WS-RP-PROD-NOMBRE            PIC X(25).              020100      
000428     02  FILLER                           PIC X(248).             020200      
000429                                                                  020300      
000430 01  WS-RESPUESTA-PRODUCTO-MAL  REDEFINES WS-MENSAJE-SAL-SA2.     020400      
000431     02  WS-RP-NUMERR                     PIC 9(04).              020500      
000432     02  WS-RP-TEXT0-ERROR                PIC X(50).              020600      
000433     02  FILLER                           PIC X(1646).            020700      
000434                                                                  020800      
000435 01  WS-RESPUESTA-TOTALES-OK    REDEFINES WS-MENSAJE-SAL-SA2.     020900      
000436     02  WS-RT-CONTINUACION               PIC 9(10).              021000      
000437     02  WS-RT-CONTINUACION-R   REDEFINES WS-RT-CONTINUACION.     021050      
000438         04  WS-RT-CONT-PROD              PIC 9(04).              021060      
000439         04  WS-RT-CONT-CAJA              PIC 9(02).              021070      
000440         04  WS-RT-CONT-MONEDA            PIC 9(04).              021080      
000441     02  WS-RT-CAJA                       PIC 9(02).              021100      
000442     02  WS-RT-OCURRENCIAS                PIC 9(02).              021200      
000443     02  WS-RT-DATOS-DE-TOTALES OCCURS 17 TIMES.                  021300      
000444         04  WS-RT-PRODUCTO               PIC 9(04).              021400      
000445         04  WS-RT-MONEDA                 PIC 9(04).              021500      
000446         04  WS-RT-NUM-CARGO              PIC 9(04).              021600      
000447         04  WS-RT-IMP-CARGO              PIC 9(14)V99.           021700      
000448         04  WS-RT-NUM-ABONO              PIC 9(04).              021800      
000449         04  WS-RT-IMP-ABONO              PIC 9(14)V99.           021900      
000450         04  WS-RT-NUM-INST-CARGO         PIC 9(04).              022000      
000451         04  WS-RT-IMP-INST-CARGO         PIC 9(14)V99.           022100      
000452         04  WS-RT-NUM-INST-ABONO         PIC 9(04).              022200      
000453         04  WS-RT-IMP-INST-ABONO         PIC 9(14)V99.           022300      
000454     02  FILLER                           PIC X(190).             022400      
000455 01  WS-DIALOGO-TOTALES-SAL         REDEFINES WS-MENSAJE-SAL-SA2. 022412      
000456     02  WS-DIAS-CONTINUACION              PIC 9(10).             022414      
000457     02  WS-DIAS-CAJA                      PIC 9(02).             022416      
000458     02  WS-DIAS-OCURRENCIAS               PIC 9(02).             022418      
000459     02  WS-DIAS-DATOS-DE-TOTALES OCCURS 17 TIMES.                022420      
000460         04  WS-DIAS-PRODUCTO              PIC 9(04).             022422      
000461         04  WS-DIAS-MONEDA                PIC 9(04).             022424      
000462         04  WS-DIAS-NUM-CARGO             PIC 9(04).             022426      
000463         04  WS-DIAS-IMP-CARGO             PIC 9(14)V99.          022428      
000464         04  WS-DIAS-NUM-ABONO             PIC 9(04).             022430      
000465         04  WS-DIAS-IMP-ABONO             PIC 9(14)V99.          022432      
000466         04  WS-DIAS-NUM-INST-CARGO        PIC 9(04).             022434      
000467         04  WS-DIAS-IMP-INST-CARGO        PIC 9(14)V99.          022436      
000468         04  WS-DIAS-NUM-INST-ABONO        PIC 9(04).             022438      
000469         04  WS-DIAS-IMP-INST-ABONO        PIC 9(14)V99.          022440      
000470         04  WS-DIAS-CONSULTA              PIC 9(01).             022442      
000471     02  FILLER                            PIC X(173).            022444      
000472                                                                  022500      
000473 01  WS-RESPUESTA-TOTALES-MAL   REDEFINES WS-MENSAJE-SAL-SA2.     022600      
000474     02  WS-RT-NUMERR                     PIC 9(04).              022700      
000475     02  WS-RT-TEXTO-ERROR                PIC X(50).              022800      
000476     02  FILLER                           PIC X(1646).            022900      
000477                                                                  023000      
000478 01  WS-RESPUESTA-MOVIMIENTO-OK  REDEFINES WS-MENSAJE-SAL-SA2.    023100      
000479     02  WS-RM-CAJA                       PIC 9(02).              023200      
000480     02  WS-RM-PRODUCTO                   PIC 9(04).              023300      
000481     02  WS-RM-MONEDA                     PIC 9(03).              023400      
000482     02  WS-RM-OCURRENCIAS                PIC 9(02).              023500      
000483     02  WS-RM-CONT-AUTAPL                PIC 9(08).              023600      
000484     02  WS-RM-CONT-AUTADM                PIC 9(08).              023700      
000485     02  WS-RM-DATOS-MOVIMIENTOS     OCCURS 25 TIMES.             023800      
000486         04  WS-RM-NATURALEZA             PIC 9(01).              023900      
000487         04  WS-RM-IMPORTE                PIC 9(16)V99.           024000      
000488         04  WS-RM-AUTORIZACION           PIC 9(06).              024100      
000489         04  WS-RM-CLAVE-TRANS            PIC 9(04).              024200      
000490         04  WS-RM-SUC-PROM               PIC 9(04).              024300      
000491         04  WS-RM-CONTRATO               PIC 9(16).              024400      
000492         04  WS-RM-REFERENCIA             PIC 9(12).              024500      
000493     02  FILLER                           PIC X(148).             024600      
000494                                                                  024700      
000495 01  WS-RESPUESTA-MOVIMIENTO-MAL  REDEFINES WS-MENSAJE-SAL-SA2.   024800      
000496     02  WS-RM-NUMERR                     PIC 9(04).              024900      
000497     02  WS-RM-TEXT0-ERROR                PIC X(50).              025000      
000498     02  FILLER                           PIC X(1646).            025100      
000499                                                                  025200      
000500 01  WS-RESPUESTA-COMPENSACION-OK REDEFINES WS-MENSAJE-SAL-SA2.   025300      
000501     02  WS-RC-AUTORIZACION               PIC 9.                  025400      
000502     02  FILLER                           PIC X(1699).            025500      
000503                                                                  025600      
000504 01  WS-RESPUESTA-MOVESPECIFICO-OK REDEFINES WS-MENSAJE-SAL-SA2.  025700      
000505     02  WS-RC-AUTORIZAOK                 PIC 9(04).              025800      
000506     02  FILLER                           PIC X(1696).            025900      
000507                                                                  026000      
000508 01  WS-RESPUESTA-COMPENSACION-MAL REDEFINES WS-MENSAJE-SAL-SA2.  026100      
000509     02  WS-RC-NUMERR                     PIC 9(04).              026200      
000510     02  WS-RC-TEXTO-ERROR                PIC X(50).              026300      
000511     02  FILLER                           PIC X(1646).            026400      
000512                                                                  026500      
000513 01  WS-HDR-LST-ORG-AUX                   PIC 9(04).              026600      
000514 01  WS-HDR-LST-ORG-AUX-R REDEFINES                               026700      
000515     WS-HDR-LST-ORG-AUX                   PIC 9(08) COMP.         026800      
000516******************************************************************026900      
000517*                                                                *027000      
000518******************************************************************027100      
000519 01 WS-DATOS-SIS-CTA    WITH LOWER-BOUNDS.                        027200      
000520    03 WS-SIS-CTA-FUN        PIC 9(02).                           027300      
000521    03 WS-SIS-CTA-SPROM      PIC 9(04).                           027400      
000522    03 WS-SIS-CTA-CTA        PIC 9(16).                           027500      
000523    03 WS-SIS-CTA-CTROL      PIC 9(06).                           027600      
000524    03 WS-SIS-CTA-NMOV       PIC 9(02).                           027700      
000525    03 WS-SIS-CTA-TABLA OCCURS 12 TIMES.                          027800      
000526       05 WS-SIS-CTA-SISTEMA PIC 9(04).                           027900      
000527       05 WS-SIS-CTA-INST    PIC 9(02).                           028000      
000528       05 WS-SIS-CTA-SUCUR   PIC 9(04).                           028100      
000529       05 WS-SIS-CTA-SUCTRA  PIC 9(04).                           028200      
000530       05 WS-SIS-CTA-CAJA    PIC 9(02).                           028300      
000531       05 WS-SIS-CTA-AUTO    PIC 9(06).                           028400      
000532       05 WS-SIS-CTA-CVET    PIC 9(03).                           028500      
000533       05 WS-SIS-CTA-REF     PIC 9(14).                           028600      
000534*INICIA CODIGO DE RENOVACION CRONOS 2000                          028601      
000535*JM    05 WS-SIS-CTA-REF     PIC 9(16).                           028602      
000536*TERMINA CODIGO DE RENOVACION CRONOS 2000                         028603      
000537       05 WS-SIS-CTA-R    REDEFINES WS-SIS-CTA-REF.               028700      
000538          07 WS-SICTA-RFIL   PIC 9(06).                           028800      
000539          07 WS-SICTA-RFEC   PIC 9(06).                           028900      
000540*INICIA CODIGO DE RENOVACION CRONOS 2000                          028901      
000541*JM       07 WS-SICTA-RFEC   PIC 9(08).                           028902      
000542*TERMINA CODIGO DE RENOVACION CRONOS 2000                         028903      
000543          07 WS-SICTA-RINS   PIC 9(02).                           029000      
000544       05 WS-SIS-CTA-MONEDA  PIC 9(04).                           029100      
000545       05 WS-SIS-CTA-SDO     PIC 9(14)V99.                        029200      
000546       05 WS-SIS-CTA-HRA     PIC 9(06).                           029300      
000547       05 WS-SIS-CTA-HHMMSS  REDEFINES WS-SIS-CTA-HRA.            029400      
000548          07 WS-SIS-CTA-HH   PIC 9(02).                           029500      
000549          07 WS-SIS-CTA-MM   PIC 9(02).                           029550      
000550          07 WS-SIS-CTA-SS   PIC 9(02).                           029600      
000551       05 WS-SIS-CTA-FECVAL  PIC 9(06).                           029700      
000552*INICIA CODIGO DE RENOVACION CRONOS 2000                          029701      
000553*JM    05 WS-SIS-CTA-FECVAL  PIC 9(08).                           029702      
000554*TERMINA CODIGO DE RENOVACION CRONOS 2000                         029703      
000555 01 WS-DATOS-SIS-CAJA   WITH LOWER-BOUNDS.                        029800      
000556    03 WS-SIS-CAJA-FUN       PIC 9(02).                           029900      
000557    03 WS-SIS-CAJA-SUCUR     PIC 9(04).                           030000      
000558    03 WS-SIS-CAJA-CAJA      PIC 9(02).                           030100      
000559    03 WS-SIS-CAJA-SIST      PIC 9(04).                           030200      
000560    03 WS-SIS-CAJA-AUTO      PIC 9(06).                           030300      
000561    03 WS-SIS-CAJA-CTROL     PIC 9(06).                           030400      
000562    03 WS-SIS-CAJA-NMOV      PIC 9(02).                           030500      
000563    03 WS-SIS-CAJA-TABLA OCCURS 12 TIMES.                         030600      
000564       05 WS-SIS-CAJA-SUCTR  PIC 9(04).                           030700      
000565       05 WS-SIS-CAJA-SISTEMA PIC 9(4).                           030800      
000566       05 WS-SIS-CAJA-INST   PIC 9(02).                           030900      
000567       05 WS-SIS-CAJA-AUTOT  PIC 9(06).                           031000      
000568       05 WS-SIS-CAJA-SPROM  PIC 9(04).                           031100      
000569       05 WS-SIS-CAJA-CTA    PIC 9(16).                           031200      
000570       05 WS-SIS-CAJA-CVET   PIC 9(03).                           031300      
000571       05 WS-SIS-CAJA-REFER  PIC 9(14).                           031400      
000572       05 WS-SIS-CAJA-REF-R  REDEFINES WS-SIS-CAJA-REFER.         031500      
000573          07 WS-CJ-CVE-264   PIC 9(04).                           031600      
000574          07 WS-CJ-INS-CTA   PIC 9(02).                           031700      
000575          07 WS-CJ-COM-CTA   PIC 9(03).                           031800      
000576          07 WS-CJ-TIP-OPE   PIC 9(02).                           031900      
000577          07 WS-CJ-AGENCIA   PIC 9(02).                           032000      
000578          07 WS-CJ-LIBRE     PIC 9(01).                           032100      
000579       05 WS-SIS-CAJA-MONEDA PIC 9(04).                           032200      
000580       05 WS-SIS-CAJA-SDO    PIC 9(14)V99.                        032300      
000581       05 WS-SIS-CAJA-HRA    PIC 9(06).                           032400      
000582       05 WS-SIS-CAJA-HMS    REDEFINES WS-SIS-CAJA-HRA.           032500      
000583          07 WS-SIS-CAJA-HH   PIC 9(02).                          032600      
000584          07 WS-SIS-CAJA-MM   PIC 9(02).                          032650      
000585          07 WS-SIS-CAJA-SS   PIC 9(02).                          032700      
000586       05 WS-SIS-CAJA-FECHA   PIC 9(06).                          032800      
000587*INICIA CODIGO DE RENOVACION CRONOS 2000                          032801      
000588*JM    05 WS-SIS-CAJA-FECHA   PIC 9(08).                          032802      
000589*TERMINA CODIGO DE RENOVACION CRONOS 2000                         032803      
000590 01 WS-ADMOV-MOVSXCAJA  WITH LOWER-BOUNDS.                        032900      
000591    03 WS-MXCAJA-FUN                 PIC 9(02)    COMP.           033000      
000592    03 WS-MXCAJA-FECAPLI             PIC 9(06)    COMP.           033100      
000593*INICIA CODIGO DE RENOVACION CRONOS 2000                          033101      
000594*JM 03 WS-MXCAJA-FECAPLI             PIC 9(08)    COMP.           033102      
000595*TERMINA CODIGO DE RENOVACION CRONOS 2000                         033103      
000596    03 WS-MXCAJA-SISTEMA             PIC 9(04)    COMP.           033200      
000597    03 WS-MXCAJA-PRODUCTO            PIC 9(04)    COMP.           033300      
000598    03 WS-MXCAJA-SUCOPER             PIC 9(04)    COMP.           033400      
000599    03 WS-MXCAJA-CAJA                PIC 9(02)    COMP.           033500      
000600    03 WS-MXCAJA-AUTAPL              PIC 9(08)    COMP.           033600      
000601    03 WS-MXCAJA-AUTS151             PIC 9(08)    COMP.           033700      
000602    03 WS-MXCAJA-NMOV                PIC 9(02)    COMP.           033800      
000603    03 WS-MXCAJA-NAT-CGO             PIC 9(01)    COMP.           033900      
000604    03 WS-MXCAJA-NAT-ABO             PIC 9(01)    COMP.           034000      
000605    03 WS-MXCAJA-NAT-ICGO            PIC 9(01)    COMP.           034100      
000606    03 WS-MXCAJA-NAT-IABO            PIC 9(01)    COMP.           034200      
000607    03 WS-MXCAJA-3N-MON              PIC 9(02)    COMP.           034300      
000608    03 WS-MXCAJA-TABLA OCCURS 25 TIMES.                           034400      
000609       05 WS-MXCAJA-MEDENT           PIC 9(02)    COMP.           034500      
000610       05 WS-MXCAJA-AUT              PIC 9(08)    COMP.           034600      
000611       05 WS-MXCAJA-SPROM            PIC 9(04)    COMP.           034700      
000612       05 WS-MXCAJA-CTA              PIC 9(12)    COMP.           034800      
000613       05 WS-MXCAJA-CVET             PIC 9(04)    COMP.           034900      
000614       05 WS-MXCAJA-SUBCVET          PIC 9(02)    COMP.           035000      
000615       05 WS-MXCAJA-MONEDA           PIC 9(04)    COMP.           035100      
000616       05 WS-MXCAJA-REFER            PIC 9(16)    COMP.           035200      
000617*INICIA CODIGO DE RENOVACION CRONOS 2000                          035201      
000618*JM    05 WS-MXCAJA-REFER            PIC 9(18)  COMP.             035202      
000619*TERMINA CODIGO DE RENOVACION CRONOS 2000                         035203      
000620       05 WS-MXCAJA-REF-R  REDEFINES WS-MXCAJA-REFER.             035300      
000621          07 WS-MXCAJA-RFIL          PIC 9(08)    COMP.           035400      
000622          07 WS-MXCAJA-RFEC          PIC 9(06)    COMP.           035500      
000623*INICIA CODIGO DE RENOVACION CRONOS 2000                          035501      
000624*JM       07 WS-MXCAJA-RFEC          PIC 9(08)    COMP.           035502      
000625*TERMINA CODIGO DE RENOVACION CRONOS 2000                         035503      
000626          07 WS-MXCAJA-RINS          PIC 9(02)    COMP.           035600      
000627       05 WS-MXCAJA-IMP              PIC 9(14)V99 COMP.           035700      
000628       05 WS-MXCAJA-HORA             PIC 9(06)    COMP.           035800      
000629       05 WS-MXCAJA-HMS    REDEFINES WS-MXCAJA-HORA.              035900      
000630          07 WS-MXCAJA-HHMM          PIC 9(04)    COMP.           036000      
000631          07 WS-MXCAJA-SS            PIC 9(02)    COMP.           036100      
000632       05 WS-MXCAJA-STATUS           PIC 9(02)    COMP.           036200      
000633       05 WS-MXCAJA-NATUR            PIC 9(02)    COMP.           036300      
000634       05 WS-MXCAJA-SUCTR            PIC 9(04)    COMP.           036400      
000635       05 WS-MXCAJA-INST             PIC 9(02)    COMP.           036500      
000636       05 WS-MXCAJA-FECMOV           PIC 9(06)    COMP.           036600      
000637*INICIA CODIGO DE RENOVACION CRONOS 2000                          036601      
000638*JM    05 WS-MXCAJA-FECMOV           PIC 9(08)    COMP.           036602      
000639*TERMINA CODIGO DE RENOVACION CRONOS 2000                         036603      
000640                                                                  036650      
000641*INICIA CODIGO DE RENOVACION CRONOS 2000    JMF                   036651      
000642 01 WS-ADMOV-MOVSXCAJA-L011  WITH LOWER-BOUNDS.                   036652      
000643    03 WS-MXCAJA-FUN-L011            PIC 9(02)    COMP.           036653      
000644    03 WS-MXCAJA-FECAPLI-L011        PIC 9(08)    COMP.           036654      
000645    03 WS-MXCAJA-SISTEMA-L011        PIC 9(04)    COMP.           036655      
000646    03 WS-MXCAJA-PRODUCTO-L011       PIC 9(04)    COMP.           036656      
000647    03 WS-MXCAJA-SUCOPER-L011        PIC 9(04)    COMP.           036657      
000648    03 WS-MXCAJA-CAJA-L011           PIC 9(02)    COMP.           036658      
000649    03 WS-MXCAJA-AUTAPL-L011         PIC 9(08)    COMP.           036659      
000650    03 WS-MXCAJA-AUTS151-L011        PIC 9(08)    COMP.           036660      
000651    03 WS-MXCAJA-NMOV-L011           PIC 9(02)    COMP.           036661      
000652    03 WS-MXCAJA-NAT-CGO-L011        PIC 9(01)    COMP.           036662      
000653    03 WS-MXCAJA-NAT-ABO-L011        PIC 9(01)    COMP.           036663      
000654    03 WS-MXCAJA-NAT-ICGO-L011       PIC 9(01)    COMP.           036664      
000655    03 WS-MXCAJA-NAT-IABO-L011       PIC 9(01)    COMP.           036665      
000656    03 WS-MXCAJA-3N-MON-L011         PIC 9(02)    COMP.           036666      
000657    03 WS-MXCAJA-BCOORI-L011         PIC 9(03)    COMP.           036667      
000658    03 WS-MXCAJA-BCODES-L011         PIC 9(03)    COMP.           036668      
000659    03 WS-MXCAJA-TABLA-L011 OCCURS 25 TIMES.                      036717      
000660       05 WS-MXCAJA-MEDENT-L011      PIC 9(02)    COMP.           036718      
000661       05 WS-MXCAJA-AUT-L011         PIC 9(08)    COMP.           036719      
000662       05 WS-MXCAJA-SPROM-L011       PIC 9(04)    COMP.           036720      
000663       05 WS-MXCAJA-CTA-L011         PIC 9(12)    COMP.           036721      
000664       05 WS-MXCAJA-CVET-L011        PIC 9(04)    COMP.           036722      
000665       05 WS-MXCAJA-SUBCVET-L011     PIC 9(02)    COMP.           036723      
000666       05 WS-MXCAJA-MONEDA-L011      PIC 9(04)    COMP.           036724      
000667       05 WS-MXCAJA-REFER-L011       PIC 9(18)  COMP.             036725      
000668       05 WS-MXCAJA-REF-R-L011 REDEFINES WS-MXCAJA-REFER-L011.    036726      
000669          07 WS-MXCAJA-RFIL-L011     PIC 9(08)    COMP.           036727      
000670          07 WS-MXCAJA-RFEC-L011     PIC 9(08)    COMP.           036728      
000671          07 WS-MXCAJA-RINS-L011     PIC 9(02)    COMP.           036729      
000672       05 WS-MXCAJA-IMP-L011         PIC 9(14)V99 COMP.           036730      
000673       05 WS-MXCAJA-HORA-L011        PIC 9(06)    COMP.           036731      
000674       05 WS-MXCAJA-HMS-L011 REDEFINES WS-MXCAJA-HORA-L011.       036732      
000675          07 WS-MXCAJA-HHMM-L011     PIC 9(04)    COMP.           036733      
000676          07 WS-MXCAJA-SS-L011       PIC 9(02)    COMP.           036734      
000677       05 WS-MXCAJA-STATUS-L011      PIC 9(02)    COMP.           036735      
000678       05 WS-MXCAJA-NATUR-L011       PIC 9(02)    COMP.           036736      
000679       05 WS-MXCAJA-SUCTR-L011       PIC 9(04)    COMP.           036737      
000680       05 WS-MXCAJA-INST-L011        PIC 9(02)    COMP.           036738      
000681       05 WS-MXCAJA-FECMOV-L011      PIC 9(08)    COMP.           036739      
000682*TERMINA CODIGO DE RENOVACION CRONOS 2000    JMF                  036740      
000683                                                                  036745      
000684 01 WS-MOVXCTA   WITH LOWER-BOUNDS.                               036800      
000685    03 WS-MXCTA-FUNCION              PIC 9(02)    COMP.           036900      
000686    03 WS-MXCTA-FECAPLI              PIC 9(06)    COMP.           037000      
000687*INICIA CODIGO DE RENOVACION CRONOS 2000                          037001      
000688*JM 03 WS-MXCTA-FECAPLI              PIC 9(08)    COMP.           037002      
000689*TERMINA CODIGO DE RENOVACION CRONOS 2000                         037003      
000690    03 WS-MXCTA-SISTEMA              PIC 9(04)    COMP.           037100      
000691    03 WS-MXCTA-PRODUCTO             PIC 9(04)    COMP.           037200      
000692    03 WS-MXCTA-SUCPROM              PIC 9(04)    COMP.           037300      
000693    03 WS-MXCTA-CUENTA               PIC 9(12)    COMP.           037400      
000694    03 WS-MXCTA-NUMAUT               PIC 9(08)    COMP.           037500      
000695    03 WS-MXCTA-NUMMOV               PIC 9(02)    COMP.           037600      
000696    03 WS-MXCTA-NUMIMP               PIC 9(02)    COMP.           037700      
000697    03 WS-MXCTA-DATOS                OCCURS 12 TIMES.             037800      
000698       05 WS-MXCTA-CVEMDE            PIC 9(02)    COMP.           037900      
000699       05 WS-MXCTA-SUCOPER           PIC 9(04)    COMP.           038000      
000700       05 WS-MXCTA-CAJA              PIC 9(02)    COMP.           038100      
000701       05 WS-MXCTA-SISORIG           PIC 9(04)    COMP.           038200      
000702       05 WS-MXCTA-SECAPLI           PIC 9(08)    COMP.           038300      
000703       05 WS-MXCTA-CVE               PIC 9(04)    COMP.           038400      
000704       05 WS-MXCTA-SUBCVE            PIC 9(02)    COMP.           038500      
000705       05 WS-MXCTA-REFMOV            PIC 9(16)    COMP.           038600      
000706*INICIA CODIGO DE RENOVACION CRONOS 2000                          038601      
000707*JM    05 WS-MXCTA-REFMOV            PIC 9(18)    COMP.           038602      
000708*TERMINA CODIGO DE RENOVACION CRONOS 2000                         038603      
000709       05 WS-MXCTA-REF-R    REDEFINES WS-MXCTA-REFMOV.            038700      
000710          07 WS-MXCTA-RFIL           PIC 9(08)  COMP.             038800      
000711          07 WS-MXCTA-RFEC           PIC 9(06)  COMP.             038900      
000712*INICIA CODIGO DE RENOVACION CRONOS 2000                          038901      
000713*JM       07 WS-MXCTA-RFEC           PIC 9(08)  COMP.             038902      
000714*TERMINA CODIGO DE RENOVACION CRONOS 2000                         038903      
000715          07 WS-MXCTA-RINS           PIC 9(02)  COMP.             039000      
000716       05 WS-MXCTA-IMPO              PIC 9(14)V99 COMP.           039100      
000717       05 WS-MXCTA-HORAOPE           PIC 9(06)    COMP.           039200      
000718       05 WS-MXCTA-HHMMSS   REDEFINES WS-MXCTA-HORAOPE.           039300      
000719          07 WS-MXCTA-HHMM           PIC 9(04)    COMP.           039400      
000720          07 WS-MXCTA-SS             PIC 9(02)    COMP.           039500      
000721       05 WS-MXCTA-STATUS            PIC 9(02)    COMP.           039600      
000722 01 WS-TOTALES-MOV      WITH LOWER-BOUNDS.                        039700      
000723    03 WS-TOT-FUN            PIC 99.                              039800      
000724    03 WS-TOT-SISTEMA        PIC 9(4).                            039900      
000725    03 WS-TOT-SUCURSAL       PIC 9(4).                            040000      
000726    03 WS-TOT-CAJA           PIC 9(2).                            040100      
000727    03 WS-TOT-MONEDA         PIC 9(2).                            040200      
000728    03 WS-TOT-DATOS          OCCURS 20 TIMES.                     040300      
000729       05 WS-TOT-NUMCR       PIC 9(08).                           040400      
000730       05 WS-TOT-IMPCR       PIC 9(16)V99.                        040500      
000731       05 WS-TOT-NUMAB       PIC 9(08).                           040600      
000732       05 WS-TOT-IMPAB       PIC 9(16)V99.                        040700      
000733 01 WS-TOTALES-S403     WITH LOWER-BOUNDS.                        040750      
000734    03 WS-403-FUN            PIC 99       COMP.                   040753      
000735    03 WS-403-SISTEMA        PIC 9(4)     COMP.                   040756      
000736    03 WS-403-SUCURSAL       PIC 9(4)     COMP.                   040759      
000737    03 WS-403-CAJA           PIC 9(2)     COMP.                   040762      
000738    03 WS-403-MONEDA         PIC 9(2)     COMP.                   040765      
000739    03 WS-403-FECHA          PIC 9(6)     COMP.                   040767      
000740    03 WS-403-DATOS          OCCURS 17 TIMES.                     040768      
000741       05 WS-403-PRD         PIC 9(04)    COMP.                   040769      
000742       05 WS-403-MON         PIC 9(04)    COMP.                   040770      
000743       05 WS-403-NUMCR       PIC 9(04)    COMP.                   040775      
000744       05 WS-403-IMPCR       PIC 9(14)V99 COMP.                   040776      
000745       05 WS-403-NUMAB       PIC 9(04)    COMP.                   040777      
000746       05 WS-403-IMPAB       PIC 9(14)V99 COMP.                   040780      
000747       05 WS-403-NUMCRINS    PIC 9(04)    COMP.                   040782      
000748       05 WS-403-IMPCRINS    PIC 9(14)V99 COMP.                   040784      
000749       05 WS-403-NUMABINS    PIC 9(04)    COMP.                   040786      
000750       05 WS-403-IMPABINS    PIC 9(14)V99 COMP.                   040788      
000751 01 WS-TOTALES-SUC      WITH LOWER-BOUNDS.                        040800      
000752    03 WS-SUC-FUN            PIC 99.                              040900      
000753    03 WS-SUC-SISTEMA        PIC 9(4).                            041000      
000754    03 WS-SUC-SUCURSAL       PIC 9(4).                            041100      
000755    03 WS-SUC-CAJA           PIC 9(2).                            041200      
000756    03 WS-SUC-DATOS          OCCURS 10 TIMES.                     041300      
000757       05 WS-SUC-NUMCR       PIC 9(08).                           041400      
000758       05 WS-SUC-IMPCR       PIC 9(16)V99.                        041500      
000759       05 WS-SUC-NUMAB       PIC 9(08).                           041600      
000760       05 WS-SUC-IMPAB       PIC 9(16)V99.                        041700      
000761******************************************************************041702      
000762*     CONSULTA DE MOVIMIENTO ESPECIFICO EN L011                  *041704      
000763******************************************************************041706      
000764 01 WKS-DATOS-MOVESPEC   WITH LOWER-BOUNDS.                       041720      
000765    03 WKS-L011-MESP-FECHA     PIC 9(08).                         041722      
000766    03 WKS-L011-MESP-PROD      PIC 9(04).                         041724      
000767    03 WKS-L011-MESP-SUC       PIC 9(04).                         041726      
000768    03 WKS-L011-MESP-CAJA      PIC 9(02).                         041728      
000769    03 WKS-L011-MESP-MON       PIC 9(04).                         041730      
000770    03 WKS-L011-MESP-AUTAPL    PIC 9(08).                         041732      
000771                                                                  041740      
000772******************************************************************041800      
000773*         CONSULTA DE MOVIMIENTOS POR CAJA PARA 3 NIVEL          *041900      
000774******************************************************************042000      
000775 01 WS-DATOS-SIS-3NIV   WITH LOWER-BOUNDS.                        042100      
000776    03 WS-SIS-3NIV-FUN       PIC 9(02).                           042200      
000777    03 WS-SIS-3NIV-SUC       PIC 9(04).                           042300      
000778    03 WS-SIS-3NIV-CAJA      PIC 9(02).                           042400      
000779    03 WS-SIS-3NIV-SIST      PIC 9(04).                           042500      
000780    03 WS-SIS-3NIV-AUTAPL    PIC 9(08).                           042600      
000781    03 WS-SIS-3NIV-AUTADM    PIC 9(08).                           042700      
000782    03 WS-SIS-3NIV-NAT-CGO   PIC 9(01).                           042800      
000783    03 WS-SIS-3NIV-NAT-ABO   PIC 9(01).                           042900      
000784    03 WS-SIS-3NIV-NAT-ICGO  PIC 9(01).                           043000      
000785    03 WS-SIS-3NIV-NAT-IABO  PIC 9(01).                           043100      
000786    03 WS-SIS-3NIV-MONEDA    PIC 9(04).                           043200      
000787    03 WS-SIS-3NIV-NMOV      PIC 9(02).                           043300      
000788    03 WS-SIS-3NIV-TABLA OCCURS 25 TIMES.                         043400      
000789       05 WS-SIS-3NIV-NATUR  PIC 9(01).                           043500      
000790       05 WS-SIS-3NIV-SUCTR  PIC 9(04).                           043600      
000791       05 WS-SIS-3NIV-INST   PIC 9(02).                           043700      
000792       05 WS-SIS-3NIV-AUTOT  PIC 9(06).                           043800      
000793       05 WS-SIS-3NIV-SPROM  PIC 9(04).                           043900      
000794       05 WS-SIS-3NIV-CTA    PIC 9(16).                           044000      
000795       05 WS-SIS-3NIV-CVET   PIC 9(03).                           044100      
000796       05 WS-SIS-3NIV-REFER  PIC 9(14).                           044200      
000797       05 WS-SIS-3NIV-SDO    PIC 9(14)V99.                        044300      
000798       05 WS-SIS-3NIV-HRA    PIC 9(06).                           044400      
000799       05 WS-SIS-3NIV-FECHA  PIC 9(06).                           044500      
000800*INICIA CODIGO DE RENOVACION CRONOS 2000                          044501      
000801*JM    05 WS-SIS-3NIV-FECHA  PIC 9(08).                           044502      
000802*TERMINA CODIGO DE RENOVACION CRONOS 2000                         044503      
000803******************************************************************044600      
000804*         CONSULTA BASE ADMOV                                    *044700      
000805******************************************************************044800      
000806 01  WS-DATOS-ADMOV                       WITH LOWER-BOUNDS.      044900      
000807*****03 FILLER                            PIC X(253).             045000      
000808     03 FILLER                            PIC X(255).             045100      
000809*INICIA CODIGO DE RENOVACION CRONOS 2000                          045101      
000810*JM  03 FILLER                            PIC X(267).             045102      
000811*TERMINA CODIGO DE RENOVACION CRONOS 2000                         045103      
000812 01  WS-TOTALES REDEFINES WS-DATOS-ADMOV.                         045200      
000813     03 WS-TOT-ADMOV-FUNCION              PIC 9(02)    COMP.      045300      
000814     03 WS-TOT-ADMOV-FECAPLI              PIC 9(06)    COMP.      045400      
000815*INICIA CODIGO DE RENOVACION CRONOS 2000                          045401      
000816*JM  03 WS-TOT-ADMOV-FECAPLI              PIC 9(08)    COMP.      045402      
000817*TERMINA CODIGO DE RENOVACION CRONOS 2000                         045403      
000818     03 WS-TOT-ADMOV-SISTEMA              PIC 9(04)    COMP.      045500      
000819     03 WS-TOT-ADMOV-PRODUCTO             PIC 9(04)    COMP.      045600      
000820     03 WS-TOT-ADMOV-SUCURSAL             PIC 9(04)    COMP.      045700      
000821     03 WS-TOT-ADMOV-CAJA                 PIC 9(02)    COMP.      045800      
000822     03 WS-TOT-ADMOV-MONEDA               PIC 9(04)    COMP.      045900      
000823     03 WS-TOT-ADMOV-MONSIG               PIC 9(04)    COMP.      046000      
000824     03 WS-TOT-ADMOV-DATOS                OCCURS 20 TIMES.        046100      
000825        05 WS-TOT-ADMOV-NUMCR             PIC 9(06)    COMP.      046200      
000826        05 WS-TOT-ADMOV-IMPCR             PIC 9(16)V99 COMP.      046300      
000827        05 WS-TOT-ADMOV-NUMAB             PIC 9(06)    COMP.      046400      
000828        05 WS-TOT-ADMOV-IMPAB             PIC 9(16)V99 COMP.      046500      
000829*INICIA CODIGO DE RENOVACION CRONOS 2000                          046501      
000830*JM  03 FILLER                            PIC X(11).              046502      
000831*TERMINA CODIGO DE RENOVACION CRONOS 2000                         046503      
000832                                                                  046600      
000833 01 WS-ADMOV-CTR REDEFINES WS-DATOS-ADMOV.                        046700      
000834    05 WS-CTR-FUNCION                 PIC 9(04).                  046800      
000835    05 FILLER                         PIC X(10).                  046900      
000836    05 WS-CTR-CSI                     PIC 9(02).                  047000      
000837    05 WS-CTR-FECPROC                 PIC 9(06).                  047100      
000838*INICIA CODIGO DE RENOVACION CRONOS 2000                          047101      
000839*JM 05 WS-CTR-FECPROC                 PIC 9(08).                  047102      
000840*TERMINA CODIGO DE RENOVACION CRONOS 2000                         047103      
000841    05 WS-CTR-FECANT                  PIC 9(06).                  047200      
000842*INICIA CODIGO DE RENOVACION CRONOS 2000                          047201      
000843*JM 05 WS-CTR-FECANT                  PIC 9(08).                  047202      
000844*TERMINA CODIGO DE RENOVACION CRONOS 2000                         047203      
000845    05 WS-CTR-FECSIG                  PIC 9(06).                  047300      
000846*INICIA CODIGO DE RENOVACION CRONOS 2000                          047301      
000847*JM 05 WS-CTR-FECSIG                  PIC 9(08).                  047302      
000848*TERMINA CODIGO DE RENOVACION CRONOS 2000                         047303      
000849    05 WS-CTR-FECBASE1                PIC 9(06).                  047400      
000850*INICIA CODIGO DE RENOVACION CRONOS 2000                          047401      
000851*JM 05 WS-CTR-FECBASE1                PIC 9(08).                  047402      
000852*TERMINA CODIGO DE RENOVACION CRONOS 2000                         047403      
000853    05 WS-CTR-STATUS1                 PIC 9(01).                  047500      
000854    05 WS-CTR-FECBASE2                PIC 9(06).                  047600      
000855*INICIA CODIGO DE RENOVACION CRONOS 2000                          047601      
000856*JM 05 WS-CTR-FECBASE2                PIC 9(08).                  047602      
000857*TERMINA CODIGO DE RENOVACION CRONOS 2000                         047603      
000858    05 WS-CTR-STATUS2                 PIC 9(01).                  047700      
000859    05 WS-CTR-FECBASE3                PIC 9(06).                  047800      
000860*INICIA CODIGO DE RENOVACION CRONOS 2000                          047801      
000861*JM 05 WS-CTR-FECBASE3                PIC 9(08).                  047802      
000862*TERMINA CODIGO DE RENOVACION CRONOS 2000                         047803      
000863    05 WS-CTR-STATUS3                 PIC 9(01).                  047900      
000864    05 FILLER                         PIC X(198).                 048000      
000865 01 WS-3ERNIVEL-MOVESP      WITH LOWER-BOUNDS.                    048100      
000866    05 WS-3ER-PROD                    PIC 9(04).                  048200      
000867    05 WS-3ER-SUC                     PIC 9(04).                  048300      
000868    05 WS-3ER-CAJ                     PIC 9(02).                  048400      
000869    05 WS-3ER-AUT                     PIC 9(08).                  048500      
000870                                                                  048550      
000871*INICIA CODIGO DE RENOVACION CRONOS 2000   JMF                    048551      
000872 01  WS-DATOS-ADMOV-L011                  WITH LOWER-BOUNDS.      048552      
000873     03 FILLER                            PIC X(275).             048553      
000874 01  WS-TOTALES-L011 REDEFINES WS-DATOS-ADMOV-L011.               048554      
000875     03 WS-TOT-ADMOV-FUNCION-L011         PIC 9(02)    COMP.      048555      
000876     03 WS-TOT-ADMOV-FECAPLI-L011         PIC 9(08)    COMP.      048556      
000877     03 WS-TOT-ADMOV-SISTEMA-L011         PIC 9(04)    COMP.      048557      
000878     03 WS-TOT-ADMOV-PRODUCTO-L011        PIC 9(04)    COMP.      048558      
000879     03 WS-TOT-ADMOV-SUCURSAL-L011        PIC 9(04)    COMP.      048559      
000880     03 WS-TOT-ADMOV-CAJA-L011            PIC 9(02)    COMP.      048560      
000881     03 WS-TOT-ADMOV-MONEDA-L011          PIC 9(04)    COMP.      048561      
000882     03 WS-TOT-ADMOV-MONSIG-L011          PIC 9(04)    COMP.      048562      
000883     03 WS-TOT-ADMOV-BCOORI-L011          PIC 9(03)    COMP.      048563      
000884     03 WS-TOT-ADMOV-BCODES-L011          PIC 9(03)    COMP.      048564      
000885     03 WS-TOT-ADMOV-DATOS-L011           OCCURS 20 TIMES.        048613      
000886        05 WS-TOT-ADMOV-NUMCR-L011        PIC 9(06)    COMP.      048614      
000887        05 WS-TOT-ADMOV-IMPCR-L011        PIC 9(16)V99 COMP.      048615      
000888        05 WS-TOT-ADMOV-NUMAB-L011        PIC 9(06)    COMP.      048616      
000889        05 WS-TOT-ADMOV-IMPAB-L011        PIC 9(16)V99 COMP.      048617      
000890     03 FILLER                            PIC X(11).              048618      
000891*TERMINA CODIGO DE RENOVACION CRONOS 2000   JMF                   048619      
000892                                                                  048620      
000893*INICIA CODIGO DE RENOVACION CRONOS 2000   JMF                    048621      
000894 01 WS-ADMOV-CTR-L011 REDEFINES WS-DATOS-ADMOV-L011.              048622      
000895    05 WS-CTR-FUNCION-L011            PIC 9(04).                  048623      
000896    05 FILLER                         PIC X(10).                  048624      
000897    05 WS-CTR-CSI-L011                PIC 9(02).                  048625      
000898    05 WS-CTR-FECPROC-L011            PIC 9(08).                  048626      
000899    05 WS-CTR-FECANT-L011             PIC 9(08).                  048627      
000900    05 WS-CTR-FECSIG-L011             PIC 9(08).                  048628      
000901    05 WS-CTR-FECBASE1-L011           PIC 9(08).                  048629      
000902    05 WS-CTR-STATUS1-L011            PIC 9(01).                  048630      
000903    05 WS-CTR-FECBASE2-L011           PIC 9(08).                  048631      
000904    05 WS-CTR-STATUS2-L011            PIC 9(01).                  048632      
000905    05 WS-CTR-FECBASE3-L011           PIC 9(08).                  048633      
000906    05 WS-CTR-STATUS3-L011            PIC 9(01).                  048634      
000907    05 FILLER                         PIC X(198).                 048635      
000908*TERMINA CODIGO DE RENOVACION CRONOS 2000   JMF                   048636      
000909                                                                  048637      
000910                                                                  048640      
000911 01  WS-DATOS-ADMOV-30506                 WITH LOWER-BOUNDS.      048700      
000912     03 FILLER                            PIC X(253).             048800      
000913*INICIA CODIGO DE RENOVACION CRONOS 2000                          048801      
000914*JM  03 FILLER                            PIC X(254).             048802      
000915*TERMINA CODIGO DE RENOVACION CRONOS 2000                         048803      
000916 01  WS-TOTALES-30506 REDEFINES WS-DATOS-ADMOV-30506.             048900      
000917     03 WS-TOT-ADMOV-FUNCION-30506        PIC 9(02)    COMP.      049000      
000918     03 WS-TOT-ADMOV-FECAPLI-30506        PIC 9(06)    COMP.      049100      
000919*INICIA CODIGO DE RENOVACION CRONOS 2000                          049101      
000920*JM  03 WS-TOT-ADMOV-FECAPLI-30506        PIC 9(08)    COMP.      049102      
000921*TERMINA CODIGO DE RENOVACION CRONOS 2000                         049103      
000922     03 WS-TOT-ADMOV-SISTEMA-30506        PIC 9(04)    COMP.      049200      
000923     03 WS-TOT-ADMOV-PRODUCTO-30506       PIC 9(04)    COMP.      049300      
000924     03 WS-TOT-ADMOV-SUCURSAL-30506       PIC 9(04)    COMP.      049400      
000925     03 WS-TOT-ADMOV-CAJA-30506           PIC 9(02)    COMP.      049500      
000926     03 WS-TOT-ADMOV-MONEDA-30506         PIC 9(04)    COMP.      049600      
000927     03 WS-TOT-ADMOV-DATOS-30506          OCCURS 10 TIMES.        049700      
000928        05 WS-TOT-ADMOV-NUMCR-30506       PIC 9(06)    COMP.      049800      
000929        05 WS-TOT-ADMOV-IMPCR-30506       PIC 9(16)V99 COMP.      049900      
000930        05 WS-TOT-ADMOV-NUMAB-30506       PIC 9(06)    COMP.      050000      
000931        05 WS-TOT-ADMOV-IMPAB-30506       PIC 9(16)V99 COMP.      050100      
000932                                                                  050200      
000933 01  WS-OPERADORES          WITH LOWER-BOUNDS.                    050300      
000934     03 WS-OPE-FUNCION      PIC 99.                               050400      
000935        88 WS-OPE-ACT       VALUE 00 THRU 02 04 05 07.            050500      
000936     03 WS-OPE-CVEOPE       PIC X(6).                             050600      
000937        88 WS-OPE-PRI       VALUE "JGP602".                       050700      
000938     03 WS-OPE-SUCURSAL     PIC 9(4).                             050800      
000939     03 WS-OPE-SUC-ALFA     REDEFINES WS-OPE-SUCURSAL             050900      
000940                            PIC XXXX.                             051000      
000941     03 WS-OPE-STATUS       PIC 99.                               051100      
000942     03 WS-OPE-IMP          PIC 99.                               051200      
000943     03 WS-OPE-IMP-ALFA     REDEFINES WS-OPE-IMP                  051300      
000944                            PIC XX.                               051400      
000945     03 WS-OPE-STATION      PIC X(8).                             051500      
000946     03 WS-OPE-STN          REDEFINES WS-OPE-STATION.             051600      
000947        04 WS-OPE-TTER      PIC X.                                051700      
000948        04 WS-OPE-SSUC      PIC 9(4).                             051800      
000949        04 WS-OPE-PRIV      PIC X.                                051900      
000950        04 WS-OPE-CAJA      PIC 99.                               052000      
000951     03 WS-OPE-STNIMP       PIC X(8).                             052100      
000952     03 WS-OPE-CVESUP       PIC X(6).                             052200      
000953     03 WS-OPE-FECREG       PIC 9(6).                             052300      
000954*INICIA CODIGO DE RENOVACION CRONOS 2000                          052301      
000955*JM  03 WS-OPE-FECREG       PIC 9(08).                            052302      
000956*TERMINA CODIGO DE RENOVACION CRONOS 2000                         052303      
000957     03 WS-OPE-NIVEL        PIC 9(2).                             052400      
000958     03 WS-OPE-FUNC         PIC 9(2).                             052500      
000959     03 WS-OPE-RANGO        PIC 9(16).                            052600      
000960 01  WS-VARIOS.                                                   052700      
000961    02 WS-NMOV PIC 99.                                            052800      
000962     02 WS-RESPERROR        PIC 9(04).                            052900      
000963     02 WS-DIRECCIONA       PIC 9(02).                            053000      
000964     02 WS-SISTEMA          PIC 9(04).                            053100      
000965     02 WS-CVE-SUP          PIC X(6).                             053200      
000966     02 WS-IND              PIC 9(03).                            053300      
000967     02 WS-IND2             PIC 99.                               053400      
000968     02 INDICE              PIC 99.                               053500      
000969     02 WS-DESPROTEGE-HEX   PIC 9(08)    COMP   VA  @277D275D@.   053600      
000970     02 WS-DESPROTEGE REDEFINES WS-DESPROTEGE-HEX   PIC X(04).    053700      
000971     02 WS-PROTEGE-HEX       PIC 9(08)   COMP   VA  @274D2750@.   053800      
000972     02 WS-PROTEGE REDEFINES WS-PROTEGE-HEX         PIC X(04).    053900      
000973     02 WS-POS-05-60-HEX     PIC 9(08)   COMP   VA  @277E5B4A@.   054000      
000974     02 WS-POS-05-60 REDEFINES WS-POS-05-60-HEX     PIC X(04).    054100      
000975     02 WS-POS-03-16-HEX     PIC 9(08)   COMP   VA  @277E7F61@.   054200      
000976     02 WS-POS-03-16 REDEFINES WS-POS-03-16-HEX     PIC X(04).    054300      
000977     02 WS-POS-03-23-HEX     PIC 9(08)   COMP   VA  @277E7FF6@.   054400      
000978     02 WS-POS-03-23 REDEFINES WS-POS-03-23-HEX     PIC X(04).    054500      
000979     02 WS-POS-03-36-HEX     PIC 9(08)   COMP   VA  @277E7FC3@.   054600      
000980     02 WS-POS-03-36 REDEFINES WS-POS-03-36-HEX     PIC X(04).    054700      
000981     02 WS-FS-HEX            PIC 9(02)   COMP   VA  @1C@.         054800      
000982     02 WS-FS                REDEFINES WS-FS-HEX    PIC X.        054900      
000983     02 WS-TAB-HEX           PIC 9(08)   COMP   VA  @277E7B91@.   055000      
000984     02 WS-TAB               REDEFINES WS-TAB-HEX   PIC XXXX.     055100      
000985     02 WS-POS-HEX           PIC 9(08)   COMP   VA  @277EF640@.   055200      
000986     02 WS-POS               REDEFINES WS-POS-HEX   PIC XXXX.     055300      
000987     02 WS-HOME-HEX          PIC 9(02)   COMP   VA  @1E@.         055400      
000988     02 WS-HOME              REDEFINES WS-HOME-HEX  PIC X.        055500      
000989     02 WS-ETX-HEX           PIC 99      COMP   VA  @03@.         055600      
000990     02 WS-ETX               REDEFINES WS-ETX-HEX   PIC X.        055700      
000991     02 WS-CLEAR-HEX         PIC 9(4)    COMP   VA @275E@.        055800      
000992     02 WS-CLEAR             REDEFINES WS-CLEAR-HEX PIC XX.       055900      
000993     02 WS-CLEAR-ALL-HEX     PIC 9(4)    COMP   VA @275C@.        056000      
000994     02 WS-CLEAR-ALL         REDEFINES WS-CLEAR-ALL-HEX PIC XX.   056100      
000995     02 WS-NUMCR             PIC 9(9).                            056200      
000996     02 WS-IMPCR             PIC 9(20)V99.                        056300      
000997     02 WS-NUMAB             PIC 9(9).                            056400      
000998     02 WS-IMPAB             PIC 9(20)V99.                        056500      
000999     02 WS-I                 PIC 99.                              056600      
001000*==============================================================   056650      
001001*         VARIABLES PARA LIBRERIA ESTRUCTURA                  =   056700      
001002*==============================================================   056750      
001003*RGV v                                                            056800      
001004 77  W77-RES-STRUCT                PIC S9(11) BINARY.             056850      
001005 77  W77-NUMSIS                    PIC S9(11) BINARY.             056900      
001006 77  W77-NUMPASO                   PIC S9(11) BINARY.             056950      
001007 77  W77-DEPTO                     PIC 9(04).                     057000      
001008 01  WKS-ENT-STRUCT.                                              057050      
001009     03 WKS-ENT-CVERANGO           PIC 9(02) COMP.                057100      
001010     03 WKS-ENT-OFICINA            PIC 9(04) COMP.                057150      
001011     03 FILLER                     PIC X(27).                     057200      
001012 01  WKS-SAL-STRUCT.                                              057250      
001013     03 WKS-SAL-OFICINA            PIC 9(04) COMP.                057300      
001014     03 WKS-SAL-CVERANGO           PIC 9(02) COMP.                057350      
001015*RGV ^                                                            057400      
001016     03 WKS-SAL-COMITE             PIC 9(04) COMP.                057450      
001017     03 WKS-SAL-AREA               PIC 9(04) COMP.                057500      
001018     03 WKS-SAL-DIVISION           PIC 9(04) COMP.                057550      
001019     03 WKS-SAL-DIRECCION          PIC 9(04) COMP.                057600      
001020     03 WKS-SAL-GERENCIA           PIC 9(04) COMP.                057650      
001021     03 WKS-SAL-OPECOM             PIC 9(04) COMP.                057700      
001022     03 WKS-SAL-TIPO-OFICINA       PIC 9(02) COMP.                057710      
001023     03 WKS-SAL-NCORTO             PIC X(20).                     057720      
001024     03 WKS-SAL-NLARGO             PIC X(40).                     057730      
001025     03 WKS-SAL-DOMICILIO          PIC X(84).                     057740      
001026     03 WKS-SAL-APOSTAL            PIC X(35).                     057750      
001027     03 WKS-SAL-CORRESPONDENCIA    PIC 9(02) COMP.                057760      
001028     03 WKS-SAL-TELEFONO           PIC 9(10) COMP.                057770      
001029     03 WKS-SAL-RESPONSABLE        PIC X(36).                     057780      
001030     03 WKS-SAL-FECALTA            PIC 9(06) COMP.                057790      
001031     03 WKS-SAL-TELRESP            PIC 9(10) COMP.                057800      
001032     03 WKS-SAL-EDO                PIC 9(02) COMP.                057810      
001033     03 WKS-SAL-CD                 PIC 9(04) COMP.                057820      
001034     03 WKS-SAL-MPIO               PIC 9(04) COMP.                057830      
001035     03 WKS-SAL-REGION             PIC 9(02) COMP.                057840      
001036     03 WKS-SAL-ZONA               PIC 9(02) COMP.                057850      
001037     03 WKS-SAL-ZONA-ECO           PIC X(04).                     057860      
001038     03 WKS-SAL-ZONA-SAL           PIC 9(02) COMP.                057870      
001039     03 WKS-SAL-LOC-BDM            PIC 9(08) COMP.                057880      
001040     03 WKS-SAL-NIVEL-AUTO         PIC 9(02) COMP.                057890      
001041     03 WKS-SAL-CSI                PIC 9(02) COMP.                057900      
001042     03 WKS-SAL-CSI-TARCRE         PIC 9(08) COMP.                057910      
001043     03 WKS-SAL-SUCRESP1           PIC 9(08) COMP.                057920      
001044     03 WKS-SAL-SUCRESP2           PIC 9(08) COMP.                057940      
001045     03 WKS-SAL-CTAUNICA           PIC 9(08) COMP.                057960      
001046     03 WKS-SAL-BANCA              PIC 9(02) COMP.                057980      
001047     03 WKS-SAL-FECHA-ALTA         PIC 9(06) COMP.                058000      
001048     03 WKS-SAL-FECHA-BAJA         PIC 9(06) COMP.                058020      
001049     03 WKS-SAL-FECMODIF           PIC 9(06) COMP.                058040      
001050     03 FILLER                     PIC X(72).                     058060      
001051 01 WS-DE-DATOS-ENTRADA.                                          058200      
001052     03 WS-DE-LOOP-ESPACIOS PIC 9(02).                            058300      
001053     03 WS-DE-LOOP-CARACTER PIC 9(02).                            058400      
001054     03 WS-DE-CVE-SUP       PIC X(06).                            058500      
001055     03 WS-DE-SECAUTS151    PIC 9(16).                            058600      
001056     03 WS-DE-SECAUTS151-R  REDEFINES WS-DE-SECAUTS151.           058700      
001057        05 WS-DE-AUTAPLI    PIC 9(08).                            058800      
001058        05 WS-DE-CTRLS151   PIC 9(08).                            058900      
001059     03 WS-DE-AUTORIZACION  PIC 9(08).                            059000      
001060     03 WS-DE-CONTROL2      PIC 9(08).                            059100      
001061     03 WS-DE-NIMP          PIC 9(02).                            059200      
001062     03 WS-DE-SUCURSAL-ALFA PIC X(04).                            059300      
001063     03 WS-DE-SUCURSAL    REDEFINES WS-DE-SUCURSAL-ALFA PIC 9(04).059400      
001064     03 WS-DE-CUENTA-ALFA   PIC X(12).                            059500      
001065     03 WS-DE-CUENTA        REDEFINES WS-DE-CUENTA-ALFA PIC 9(12).059600      
001066     03 WS-DE-CONTROL-ALFA  PIC X(08).                            059700      
001067     03 WS-DE-CONTROL      REDEFINES WS-DE-CONTROL-ALFA PIC 9(08).059800      
001068     03 WS-DE-CAJA-ALFA     PIC X(02).                            059900      
001069        88 WS-DE-CAJA-OK    VALUE "00" THRU "99".                 060000      
001070     03 WS-DE-CAJA          REDEFINES WS-DE-CAJA-ALFA PIC 9(02).  060100      
001071     03 WS-DE-AUTOR-ALFA    PIC X(08).                            060200      
001072     03 WS-DE-AUTOR         REDEFINES WS-DE-AUTOR-ALFA PIC 9(08). 060300      
001073     03 WS-DE-SISTEMA-ALFA  PIC X(04).                            060400      
001074     03 WS-DE-SISTEMA       REDEFINES WS-DE-SISTEMA-ALFA PIC 9(4).060500      
001075        88 WS-DE-SISNVO     VA 1,18,264,404,                      060600      
001076                               501,                               060610      
001077                               502,701.                           060700      
001078        88 WS-DE-SISNVO1    VA 66,500.                            060800      
001079        88 WS-DE-SIS001     VA 001.                               060900      
001080        88 WS-DE-SIS003     VA 003.                               060910      
001081        88 WS-DE-SIS701     VA 701.                               060952      
001082        88 WS-DE-SIS264     VA 264.                               060954      
001083        88 WS-DE-SIS404     VA 404.                               060956      
001084        88 WS-DE-SIS018     VA 018.                               060958      
001085        88 WS-DE-SIS501     VA 501.                               060960      
001086        88 WS-DE-SIS502     VA 502.                               060970      
001087     03 WS-DE-CSI-ALFA      PIC X(02).                            061000      
001088     03 WS-DE-CSI           REDEFINES WS-DE-CSI-ALFA PIC 9(2).    061100      
001089        88 WS-DE-CSIOK      VA 01 04 06 07 09 10 12 26 32 33 34   061200      
001090                               35.                                061250      
001091     03 WS-DE-MONEDA-ALFA   PIC X(02).                            061300      
001092     03 WS-DE-MONEDA        REDEFINES WS-DE-MONEDA-ALFA PIC 9(02).061400      
001093        88 WS-DE-MONEDA-OK  VA 01 THRU 99.                        061500      
001094     03 WS-DE-MDAFIJA-ALFA  PIC X(02).                            061600      
001095        03 WS-DE-MDAFIJA REDEFINES WS-DE-MDAFIJA-ALFA PIC 9(02).  061700      
001096     03 WS-CUENTA           PIC 9(10).                            061800      
001097     03 WS-CUENTA-SUC REDEFINES WS-CUENTA.                        061900      
001098        05 WS-SUC-CTA       PIC 9(03).                            062000      
001099        05 WS-CTA-CTA       PIC 9(07).                            062100      
001100     03 WS-CUENTA-DIG REDEFINES WS-CUENTA.                        062200      
001101        05 WS-CTA-D1           PIC 9(01).                         062300      
001102        05 WS-CTA-D2           PIC 9(01).                         062400      
001103        05 WS-CTA-D3           PIC 9(01).                         062500      
001104        05 WS-CTA-D4           PIC 9(01).                         062600      
001105        05 WS-CTA-D5           PIC 9(01).                         062700      
001106        05 WS-CTA-D6           PIC 9(01).                         062800      
001107        05 WS-CTA-D7           PIC 9(01).                         062900      
001108        05 WS-CTA-D8           PIC 9(01).                         063000      
001109        05 WS-CTA-D9           PIC 9(01).                         063100      
001110        05 WS-CTA-DCTO         PIC 9(01).                         063200      
001111 01  WS-DATOS-RESPUESTA      PIC X(1884).                         063300      
001112 01  WS-DS-DATOS-SALIDA.                                          063400      
001113     03 WS-DS-ADMOV-CUENTA OCCURS 10 TIMES.                       063500      
001114        05 WS-DS-CTA-SUCU-ALFA       PIC X(04).                   063600      
001115        05 WS-DS-CTA-SUCU-ALFA-R REDEFINES WS-DS-CTA-SUCU-ALFA.   063700      
001116           07 WS-DS-CTA-SUCUR        PIC ZZZ9.                    063800      
001117        05 WS-DS-CTA-CAJA-ALFA       PIC X(02).                   063900      
001118        05 WS-DS-CTA-CAJA-ALFA-R REDEFINES WS-DS-CTA-CAJA-ALFA.   064000      
001119           07 WS-DS-CTA-CAJA         PIC Z9.                      064100      
001120        05 WS-DS-CTA-SIS             PIC ZZZZ.                    064200      
001121        05 WS-DS-CTA-AUTO            PIC ZZZZZZZZ.                064300      
001122        05 WS-DS-CTA-CVET            PIC X(04).                   064400      
001123        05 WS-DS-CTA-CVESTATUS  REDEFINES WS-DS-CTA-CVET.         064500      
001124           07 WS-DS-CTA-CVEST        PIC ZZZ.                     064600      
001125           07 WS-DS-CTA-STATUS       PIC X(01).                   064700      
001126        05 WS-DS-CTA-REF             PIC Z(14).                   064800      
001127        05 WS-DS-CTA-R               REDEFINES WS-DS-CTA-REF.     064900      
001128           07 WS-DS-CTA-MONEDA       PIC ZZ.                      065000      
001129           07 WS-DS-CTA-FILLER       PIC X(12).                   065100      
001130           07 WS-DS-CTA-REF084       REDEFINES WS-DS-CTA-FILLER.  065200      
001131              09 WS-CTA-R084-FILL1   PIC X(01).                   065300      
001132              09 WS-CTA-R084-FECHA   PIC Z9/99/99.                065400      
001133              09 WS-CTA-R084-FILL2   PIC X(01).                   065500      
001134              09 WS-CTA-R084-INST    PIC Z9.                      065600      
001135        05 WS-DS-CTA-SDO             PIC ZZZZ,ZZZ,ZZZ,ZZZ.ZZ.     065700      
001136        05 WS-DS-CTA-HR              PIC ZZ.                      065800      
001137        05 WS-DS-DOS-PUNTOS          PIC X .                      065820      
001138        05 WS-DS-CTA-MM              PIC 99.                      065840      
001139                                                                  065860      
001140     03 WS-DS-ADMOV-CAJA OCCURS 12 TIMES.                         065900      
001141        05 WS-DS-CAJA-AUTOT          PIC ZZZZZZZZ.                066000      
001142        05 WS-DS-CAJA-SPROM          PIC ZZZZ.                    066100      
001143        05 WS-DS-CAJA-CTA            PIC Z(12).                   066200      
001144        05 WS-DS-CAJA-CTA-R          REDEFINES WS-DS-CAJA-CTA.    066300      
001145           07 WS-CAJ-FILLER          PIC X(05).                   066400      
001146           07 WS-CAJ-INSCTA          PIC X(04).                   066500      
001147           07 WS-CAJ-COMCTA          PIC 9(03).                   066600      
001148        05 WS-DS-CAJA-CVET           PIC Z(04).                   066700      
001149        05 WS-DS-CAJA-CVET-STATUS    REDEFINES WS-DS-CAJA-CVET.   066800      
001150           07 WS-DS-CAJA-CVESTA      PIC ZZZ.                     066900      
001151           07 WS-DS-CAJA-STATUS      PIC X.                       067000      
001152        05 WS-DS-CAJA-REFER          PIC Z(14).                   067100      
001153        05 WS-DS-CAJA-R              REDEFINES WS-DS-CAJA-REFER.  067200      
001154           07 WS-DS-CAJA-MONEDA      PIC ZZ.                      067300      
001155           07 WS-DS-CAJA-FILLER      PIC X(12).                   067400      
001156           07 WS-DS-CAJA-FILLER-R    REDEFINES WS-DS-CAJA-FILLER. 067500      
001157              09 WS-CAJ-FILL1        PIC X(02).                   067600      
001158              09 WS-CAJ-TIPOPE       PIC 9(02).                   067700      
001159              09 WS-CAJ-FILL2        PIC X(01).                   067800      
001160              09 WS-CAJ-AGENC        PIC X(04).                   067900      
001161              09 WS-CAJ-FILL3        PIC X(03).                   068000      
001162           07 WS-DS-CAJA-REF084      REDEFINES WS-DS-CAJA-FILLER. 068100      
001163              09 WS-R084-FILL1       PIC X(01).                   068200      
001164              09 WS-R084-FECHA       PIC Z9/99/99.                068300      
001165              09 WS-R084-FILL2       PIC X(01).                   068400      
001166              09 WS-R084-INST        PIC Z9.                      068500      
001167        05 WS-DS-CAJA-SDO            PIC ZZZZ,ZZZ,ZZZ,ZZZ.ZZ.     068600      
001168        05 WS-DS-CAJA-HR             PIC ZZ.                      068700      
001169        05 WS-DS-2-PUNTOS            PIC X .                      068720      
001170        05 WS-DS-CAJA-MM             PIC ZZ.                      068740      
001171     03 WS-DS-CASA1.                                              068800      
001172        04 WS-DS-CASA1-SIGNUMOP      PIC 9(08).                   068900      
001173        04 WS-DS-CASA1-DATOS         OCCURS 10 TIMES.             069000      
001174        05 WS-DS-CASA1-AUTOT         PIC 9(08).                   069100      
001175        05 WS-DS-CASA1-SPROM         PIC 9(04).                   069200      
001176        05 WS-DS-CASA1-CTA           PIC 9(16).                   069300      
001177        05 WS-DS-CASA1-CVET          PIC 999.                     069400      
001178        05 WS-DS-CASA1-REFER         PIC 9(20).                   069500      
001179        05 WS-DS-CASA1-SDO           PIC 9(15)V99.                069600      
001180        05 WS-DS-CASA1-HRA           PIC 9(06).                   069700      
001181     03 WS-DS-TOSA1.                                              069800      
001182        04 WS-DS-TOSA1-DATOS         OCCURS 10 TIMES.             069900      
001183        05 WS-DS-TOSA1-CVESER        PIC 9(02).                   070000      
001184        05 WS-DS-TOSA1-NUMCAR        PIC 9(06).                   070100      
001185        05 WS-DS-TOSA1-IMPCAR        PIC 9(18)V99.                070200      
001186        05 WS-DS-TOSA1-NUMABO        PIC 9(06).                   070300      
001187        05 WS-DS-TOSA1-IMPABO        PIC 9(18)V99.                070400      
001188     03 WS-DS-DESCSIS                PIC X(30).                   070500      
001189     03 WS-DS-AUT-APLIC              PIC 9(08).                   070600      
001190     03 WS-DS-CTRL-AUT               PIC 9(08).                   070700      
001191     03 WS-DS-ADMOV-TOT  OCCURS 11 TIMES.                         070800      
001192        05 WS-DS-TOT-DESC            PIC X(14).                   070900      
001193        05 WS-DS-TOT-NUMCR           PIC ZZZ,ZZZ.                 071000      
001194        05 WS-DS-TOT-IMPCR           PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ.   071100      
001195        05 WS-DS-TOT-NUMAB           PIC ZZZ,ZZZ.                 071200      
001196        05 WS-DS-TOT-IMPAB           PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.ZZ.   071300      
001197     03 WS-DS-TOT-SALDOS.                                         071400      
001198        05 WS-DS-SDO-DESC            PIC X(03).                   071500      
001199        05 WS-DS-SDO-NUMCR           PIC ZZZ,ZZZ.                 071600      
001200        05 WS-DS-SDO-IMPCR           PIC ZZ,ZZZ,ZZ9.              071700      
001201        05 WS-DS-SDO-NUMAB           PIC ZZZ,ZZZ.                 071800      
001202        05 WS-DS-SDO-IMPAB           PIC ZZ,ZZZ,ZZ9.              071900      
001203        05 WS-DS-SDO-VAR             PIC ZZ,ZZZ,ZZ9.              072000      
001204        05 WS-DS-SDO-SIG             PIC X(01).                   072100      
001205 01  WS-LEY.                                                      072200      
001206     03 WS-DS-LEYENDA.                                            072300      
001207        05 WS-DS-FILLER              PIC X(40).                   072400      
001208        05 WS-DS-SYSTEM              PIC ZZZZ.                    072500      
001209        05 WS-DS-FILL                PIC X(20).                   072600      
001210 01  WS-FECHAS.                                                   072700      
001211*    02 WS-FECHA-MDA         PIC 9(6).                            072800      
001212*INICIA CODIGO DE RENOVACION CRONOS 2000                          072801      
001213     02 WS-FECHA-MDA         PIC 9(08).                           072802      
001214*TERMINA CODIGO DE RENOVACION CRONOS 2000                         072803      
001215     02 WS-FECHA-M-D-A       REDEFINES   WS-FECHA-MDA.            072900      
001216        03 WS-FECHA-MDA-M    PIC 99.                              073000      
001217        03 WS-FECHA-MDA-D    PIC 99.                              073100      
001218*       03 WS-FECHA-MDA-A    PIC 99.                              073200      
001219*INICIA CODIGO DE RENOVACION CRONOS 2000                          073201      
001220        03 WS-FECHA-MDA-A    PIC 9999.                            073202      
001221*TERMINA CODIGO DE RENOVACION CRONOS 2000                         073203      
001222*    02 WS-FECHA-DMA         PIC 9(6).                            073300      
001223*INICIA CODIGO DE RENOVACION CRONOS 2000                          073301      
001224     02 WS-FECHA-DMA         PIC 9(08).                           073302      
001225*TERMINA CODIGO DE RENOVACION CRONOS 2000                         073303      
001226     02 WS-FECHA-D-M-A       REDEFINES   WS-FECHA-DMA.            073400      
001227        03 WS-FECHA-DMA-D    PIC 99.                              073500      
001228        03 WS-FECHA-DMA-M    PIC 99.                              073600      
001229*       03 WS-FECHA-DMA-A    PIC 99.                              073700      
001230*INICIA CODIGO DE RENOVACION CRONOS 2000                          073701      
001231        03 WS-FECHA-DMA-A    PIC 9999.                            073702      
001232*TERMINA CODIGO DE RENOVACION CRONOS 2000                         073703      
001233*    02 WS-FECHA-AMD         PIC 9(6).                            073800      
001234*INICIA CODIGO DE RENOVACION CRONOS 2000                          073801      
001235     02 WS-FECHA-AMD         PIC 9(08).                           073802      
001236*TERMINA CODIGO DE RENOVACION CRONOS 2000                         073803      
001237     02 WS-FECHA-AMD-R       REDEFINES   WS-FECHA-AMD.            073900      
001238*        03 WS-FECHA-AMD-A   PIC 99.                              074000      
001239*INICIA CODIGO DE RENOVACION CRONOS 2000                          074001      
001240         03 WS-FECHA-AMD-A   PIC 9999.                            074002      
001241*TERMINA CODIGO DE RENOVACION CRONOS 2000                         074003      
001242         03 WS-FECHA-AMD-M   PIC 99.                              074100      
001243         03 WS-FECHA-AMD-D   PIC 99.                              074200      
001244*INICIA CODIGO DE RENOVACION CRONOS 2000   JMF                    074250      
001245     02 WS-FECHA-DMA-6DIG    PIC 9(06).                           074254      
001246     02 WS-FECHA-DMA-6DIG-R  REDEFINES   WS-FECHA-DMA-6DIG.       074258      
001247        03 WS-FEC-DMA-6DIG-D PIC 99.                              074262      
001248        03 WS-FEC-DMA-6DIG-M PIC 99.                              074266      
001249        03 WS-FEC-DMA-6DIG-A PIC 99.                              074270      
001250     02 WS-FECHA-AMD-6DIG    PIC 9(06).                           074274      
001251     02 WS-FECHA-AMD-6DIG-R  REDEFINES   WS-FECHA-AMD-6DIG.       074278      
001252        03 WS-FEC-AMD-6DIG-A PIC 99.                              074282      
001253        03 WS-FEC-AMD-6DIG-M PIC 99.                              074286      
001254        03 WS-FEC-AMD-6DIG-D PIC 99.                              074290      
001255*TERMINA CODIGO DE RENOVACION CRONOS 2000  JMF                    074294      
001256                                                                  074298      
001257 01  WS-HORAS.                                                    074300      
001258     02 WS-HORA-BLOQUEO      PIC 9(8)    VALUE 13300000.          074400      
001259     02 WS-HORA-MAQUINA      PIC 9(8).                            074500      
001260     02 WS-HORA-MAQUINA-R REDEFINES WS-HORA-MAQUINA.              074600      
001261        04  WS-HHMMSS-MAQUINA PIC 9(06).                          074700      
001262        04  FILLER            PIC 9(02).                          074800      
001263     02 WS-BLOQUEA           PIC 9       VALUE ZEROS.             074900      
001264        88 BLOQUEA           VA 1.                                075000      
001265***************************************************************** 075100      
001266***       PARAMETRO PARA CONSULTA DE NUMERO DE CSI            *** 075200      
001267***************************************************************** 075300      
001268 01  WKS-DATOS-HOST.                                              075400      
001269     03  WKS-NUMCSI           PIC 9(02).                          075500      
001270     03  WKS-NOMEQUIPO        PIC X(10).                          075600      
001271     03  WKS-NOMCSI           PIC X(26).                          075700      
001272     03  WKS-LINEA-BATCH      PIC X(05).                          075800      
001273                                                                  075900      
001274 77  WS-STATUS-MOV           PIC 9(01).                           076000      
001275     88 STATUS-MOV           VA 1.                                076100      
001276 77  WS-HORA-INI             PIC 9(8).                            076200      
001277 77  WS-HORA-MAX             PIC 9(8).                            076300      
001278 77  WS-HORA-FIN             PIC 9(8).                            076400      
001279 77  WS-HORA-ED              PIC 99999999.                        076500      
001280 77  WS-NUM-CON              PIC 9(8)    VALUE 0.                 076600      
001281 77  WS-NUM-CON-ED           PIC ZZZZZZ,ZZZ.                      076700      
001282 77  WS-STATUS               PIC 9(06).                           076800      
001283 77  WS-MON                  PIC 9(01) VALUE 0.                   076900      
001284 77  WS-CONXPAN              PIC 9(01) VALUE 1.                   077000      
001285 77  WS-TOT-IMPORTE          PIC 9(16)V99   VALUE ZEROS.          077100      
001286 77  WS-FIN                  PIC 9(01) VALUE 0.                   077200      
001287 77  WS-BAN-CALLL011-500     PIC 9(01) VALUE 0.                   077255      
001288 77  WS-BAN-CALLL011-701     PIC 9(01) VALUE 0.                   077260      
001289 77  WS-BAN-CALLL011-264     PIC 9(01) VALUE 0.                   077265      
001290 77  WS-BAN-CALLL011-404     PIC 9(01) VALUE 0.                   077270      
001291 77  WS-BAN-CALLL011-018     PIC 9(01) VALUE 0.                   077272      
001292 77  WS-BAN-CALLL011-501     PIC 9(01) VALUE 0.                   077275      
001293 77  WS-BAN-CALLL011-502     PIC 9(01) VALUE 0.                   077278      
001294 77  WS-LONG-MSG             PIC 9(04).                           077300      
001295 77  WS-SUMA                 PIC 9(06).                           077400      
001296 77  WS-COCI                 PIC 9(06).                           077500      
001297 77  WS-RESULT               PIC 9(03).                           077600      
001298 77  WS-DIGIT                PIC 9(01).                           077700      
001299 77  WS-CONT-SCR              PIC 9(03).                          077800      
001300 77  WS-IND-SCR               PIC 9(03).                          077900      
001301 77  WS-INDS                  PIC 9(02).                          078000      
001302 77  WS-INDR                  PIC 9(02).                          078100      
001303 77  WS-BLANCOS               PIC X(80)  VALUE SPACES.            078200      
001304 77  WS-MONED-PASO            PIC 9(02)  VALUE ZEROS.             078300      
001305 77  WS-CSI-403               PIC 9(02)  VALUE 10.                078600      
001306*77  WS-CSI-703               PIC 9(02)  VALUE 35.                078700      
001307 77  WS-CSI-703               PIC 9(02)  VALUE 10.                078800      
001308 77  WS-CSI-VAL               PIC 9(02).                          078900      
001309/***************************************************************  079000      
001310*      REGISTRO PARA EXTRAER LA FECHA DE LA BASE DE DATOS      *  079100      
001311****************************************************************  079200      
001312 01 GLOBALES      WITH LOWER-BOUNDS.                              079300      
001313     03   GLOB-FUNCION                      PIC 9(02).            079400      
001314     03   GLOB-CSI                          PIC 9(02).            079500      
001315     03   GLOB-STATUS-FECHA                 PIC 9(02).            079600      
001316*    03   GLOB-FECHA-PROC                   PIC 9(06).            079700      
001317*INICIA CODIGO DE RENOVACION CRONOS 2000                          079701      
001318     03   GLOB-FECHA-PROC                   PIC 9(08).            079702      
001319*TERMINA CODIGO DE RENOVACION CRONOS 2000                         079703      
001320     03   GLOB-FECHA-PROCESO REDEFINES GLOB-FECHA-PROC.           079800      
001321*         04 GLOB-AMO-PROCESO               PIC 9(02).            079900      
001322*INICIA CODIGO DE RENOVACION CRONOS 2000                          079901      
001323          04 GLOB-AMO-PROCESO               PIC 9(04).            079902      
001324*TERMINA CODIGO DE RENOVACION CRONOS 2000                         079903      
001325          04 GLOB-MES-PROCESO               PIC 9(02).            080000      
001326          04 GLOB-DIA-PROCESO               PIC 9(02).            080100      
001327*    03   GLOB-FECHA-OPERACION              PIC 9(06).            080200      
001328*INICIA CODIGO DE RENOVACION CRONOS 2000                          080201      
001329     03 GLOB-FECHA-OPERACION                PIC 9(08).            080202      
001330*TERMINA CODIGO DE RENOVACION CRONOS 2000                         080203      
001331*    03   GLOB-FECHA-APLICACION             PIC 9(06).            080300      
001332*INICIA CODIGO DE RENOVACION CRONOS 2000                          080301      
001333     03 GLOB-FECHA-APLICACION               PIC 9(08).            080302      
001334*TERMINA CODIGO DE RENOVACION CRONOS 2000                         080303      
001335 01 WS-ERRORES.                                                   080400      
001336     02 WS-ERR01 PIC X(32) VA "TERMINAL NO ACTIVA          7711". 080500      
001337     02 WS-ERR02 PIC X(32) VA "TRANSACCION NO IMPLEMENTADA 3310". 080600      
001338     02 WS-ERR03 PIC X(32) VA "CVE. SUPERVI. NO CORRESPONDE0013". 080700      
001339     02 WS-ERR04 PIC X(32) VA "SUCURSAL INVALIDA           9999". 080800      
001340     02 WS-ERR05 PIC X(32) VA "CUENTA... DIGITO DE CONTROL 9999". 080900      
001341     02 WS-ERR06 PIC X(32) VA "CONTROL NO NUMERICO         9999". 081000      
001342     02 WS-ERR07 PIC X(32) VA "NO HAY MOVIMIENTOS          9999". 081100      
001343     02 WS-ERR08 PIC X(32) VA "CUENTA NO NUMERICA          9999". 081200      
001344     02 WS-ERR09 PIC X(32) VA "CAJA NO NUMERICA            9999". 081300      
001345     02 WS-ERR10 PIC X(32) VA "AUTORIZACION NO NUMERICA    9999". 081400      
001346     02 WS-ERR11 PIC X(32) VA "NO HAY MOVIMIENTOS          9999". 081500      
001347     02 WS-ERR12 PIC X(32) VA "CONSULTA BLOQUEADA          9999". 081600      
001348     02 WS-ERR13 PIC X(32) VA "SISTEMA INVALIDO            9999". 081700      
001349     02 WS-ERR14 PIC X(32) VA "CAJA SIN TOTALES SOLICITADOS9999". 081800      
001350     02 WS-ERR15 PIC X(32) VA "C.S.I. INVALIDO, VERIFIQUE  9999". 081900      
001351     02 WS-ERR16 PIC X(32) VA "MONEDA NO NUMERICA          9999". 082000      
001352     02 WS-ERR17 PIC X(32) VA "SISTEMA NO CALIFICADO       9999". 082100      
001353     02 WS-ERR18 PIC X(32) VA "ERROR EN CUENTA             9999". 082200      
001354     02 WS-ERR19 PIC X(32) VA "FIN CONSULTA OTRAS MONEDAS  9999". 082300      
001355     02 WS-ERR20 PIC X(32) VA "CONS POR LA PANTALLA Q0151129999". 082400      
001356     02 WS-ERR21 PIC X(32) VA "CONS POR LA PANTALLA Q0151139999". 082500      
001357     02 WS-ERR22 PIC X(32) VA "CONS POR LA PANTALLA Q0151149999". 082600      
001358     02 WS-ERR23 PIC X(32) VA "CONS POR LA PANTALLA Q0151159999". 082700      
001359     02 WS-ERR24 PIC X(32) VA "CONS POR LA PANTALLA Q0151169999". 082800      
001360     02 WS-ERR25 PIC X(32) VA "CONS POR LA PANTALLA Q0151179999". 082900      
001361                                                                  083000      
001362 01  TABLA-ERRORES REDEFINES WS-ERRORES.                          083100      
001363     02  WS-TBL-ERROR   OCCURS 25 TIMES.                          083200      
001364         03  WS-TBL-ERRORES              PIC X(28).               083300      
001365         03  WS-TBL-ERROR-NUME           PIC 9(04).               083400      
001366 01  WKS-TABSIS-CONS.                                             083402      
001367     03 WKS-SIS-CONSULTA OCCURS 25 TIMES PIC 9(02).               083404      
001368                                                                  083410      
001369 01 WKS-TOTALES-CAJA.                                             083415      
001370    03 WKS-TCAJ-CAJA                     PIC 9(04).               083416      
001371    03 WKS-TOTCAJA  OCCURS 17 TIMES.                              083420      
001372       05  WKS-TCAJ-PRODUCTO             PIC 9(04).               083425      
001373       05  WKS-TCAJ-MONEDA               PIC 9(04).               083430      
001374       05  WKS-TCAJ-NCARGO               PIC 9(04).               083435      
001375       05  WKS-TCAJ-ICARGO               PIC 9(14)V99.            083440      
001376       05  WKS-TCAJ-NABONO               PIC 9(04).               083445      
001377       05  WKS-TCAJ-IABONO               PIC 9(14)V99.            083450      
001378       05  WKS-TCAJ-INST-NCARGO          PIC 9(04).               083455      
001379       05  WKS-TCAJ-INST-ICARGO          PIC 9(14)V99.            083460      
001380       05  WKS-TCAJ-INST-NABONO          PIC 9(04).               083465      
001381       05  WKS-TCAJ-INST-IABONO          PIC 9(14)V99.            083470      
001382       05  WKS-TCAJ-CONSULTA             PIC 9(02).               083472      
001383  01 WKS-TOTALES-CAJA-ACUM.                                       083474      
001384     03 WKS-ACUM-TOTCAJA  OCCURS 17 TIMES.                        083476      
001385        05  WKS-ACUM-PRODUCTO             PIC 9(04).              083478      
001386        05  WKS-ACUM-MONEDA               PIC 9(04).              083480      
001387        05  WKS-ACUM-NCARGO               PIC 9(04).              083482      
001388        05  WKS-ACUM-ICARGO               PIC 9(14)V99.           083484      
001389        05  WKS-ACUM-NABONO               PIC 9(04).              083486      
001390        05  WKS-ACUM-IABONO               PIC 9(14)V99.           083488      
001391        05  WKS-ACUM-INST-NCARGO          PIC 9(04).              083490      
001392        05  WKS-ACUM-INST-ICARGO          PIC 9(14)V99.           083492      
001393        05  WKS-ACUM-INST-NABONO          PIC 9(04).              083494      
001394        05  WKS-ACUM-INST-IABONO          PIC 9(14)V99.           083496      
001395                                                                  083500      
001396*=================================================================083510      
001397*     VARIABLES DE USO PARA DIALOGO ENTRE CSI                     083520      
001398*=================================================================083530      
001399 77  W77-VECES                            PIC 9(02).              083532      
001400 77  W77-IND                              PIC 9(04).              083540      
001401 77  W77-IND2                             PIC 9(04).              083545      
001402 77  W77-CONS-L011                        PIC 9(04).              083550      
001403 77  W77-MI-CSI                           PIC 9(02).              083600      
001404 77  W77-SIS-CSIRES                       PIC 9(02).              083610      
001405 77  W77-DIALOGO                          PIC 9(02).              083700      
001406 77  W77-CSI-ORIGEN                       PIC 9(02).              083730      
001407 77  W77-CSI-DESTINO                      PIC 9(02).              083740      
001408 77  W77-SUC                              PIC 9(05).              083760      
001409 77  W77-IND-CSI                          PIC 9(02).              083765      
001410 77  W77-SALIDA                           PIC 9(02).              083768      
001411 77  W77-TELETON                          PIC 9(02) VALUE ZERO.   083769      
001412 88  W88-TELETON                          VALUE 1.                083770      
001413 01  WKS-APLICACIONES.                                            083771      
001414     03 WKS-APL-ORIGEN                    PIC X(01).              083772      
001415     03 WKS-APL-DESTINO                   PIC X(01).              083774      
001416                                                                  083776      
001417 01  WKS-TABLA-SUCURSALES.                                        083778      
001418     03 WKS-CSIRES-SUC  OCCURS 10000 TIMES PIC 9(02) COMP.        083780      
001419                                                                  084900      
001420******************************************************************085000      
001421*            TABLA DE PRODUCTOS PARA TERCER NIVEL                *085100      
001422******************************************************************085200      
001423 01  TABLA-DE-PRODUCTOS-3NIVEL.                                   085300      
001424     02 FILLER PIC X(29) VALUE "0001 CHEQUES BANAMEX     0000".   085400      
001425     02 FILLER PIC X(29) VALUE "0502 RECAUDACION DE IMP. 0000".   085500      
001426     02 FILLER PIC X(29) VALUE "0404 CREDITOS BANAMEX    0000".   085700      
001427     02 FILLER PIC X(29) VALUE "0264 TRANSF. DE FONDOS   0000".   085800      
001428     02 FILLER PIC X(29) VALUE "0701 INTEGRAL DE PAGOS   0000".   085900      
001429     02 FILLER PIC X(29) VALUE "0403 CREDITO EMPRESA.    0000".   086000      
001430     02 FILLER PIC X(29) VALUE "0018 ADMON DE EFECTIVO   0000".   086030      
001431     02 FILLER PIC X(29) VALUE "0501 TELETON.            0000".   086050      
001432     02 FILLER PIC X(29) VALUE "9999 FIN DE TABLA        0000".   086160      
001433     02 FILLER PIC X(29) VALUE "                         0000".   086180      
001434     02 FILLER PIC X(29) VALUE "                         0000".   086190      
001435     02 FILLER PIC X(29) VALUE "                         0000".   086195      
001436 01  TABLA-DE-PRODUCTOS-RED REDEFINES TABLA-DE-PRODUCTOS-3NIVEL.  086200      
001437     02 TABLA-DE-PROD          OCCURS 12 TIMES.                   086300      
001438        04  WS-PROD-NUMERO                PIC 9(04).              086400      
001439        04  FILLER                        PIC X.                  086500      
001440        04  WS-PROD-NOMBRE                PIC X(20).              086600      
001441        04  WS-MODALIDAD                  PIC 9(02).              086620      
001442        04  WS-CSI-RES                    PIC 9(02).              086700      
001443******************************************************************086800      
001444*         TABLA DE NATURALEZA DE LOS TOTALES POR SISTEMA         *086900      
001445******************************************************************087000      
001446 01  TABLA-DE-TOTALES-X-SIST.                                     087100      
001447     02 TT-S001    PIC X(20) VALUE "11110000000000000000".        087200      
001448     02 TT-S502    PIC X(20) VALUE "11111111111111000000".        087300      
001449     02 TT-S404    PIC X(20) VALUE "11111111000000000000".        087310      
001450*****02 TT-S400    PIC X(20) VALUE "10000000000000000000".        087400      
001451     02 TT-S264    PIC X(20) VALUE "11110011100000000000".        087500      
001452     02 TT-S701    PIC X(20) VALUE "11111100000000000000".        087600      
001453     02 TT-S403    PIC X(20) VALUE "11111111100000000000".        087700      
001454     02 TT-S018    PIC X(20) VALUE "10000000000000000000".        087800      
001455     02 TT-S501    PIC X(20) VALUE "11111100000000000000".        087850      
001456     02 FILLER     PIC X(20) VALUE "00000000000000000000".        087860      
001457     02 FILLER     PIC X(20) VALUE "00000000000000000000".        087870      
001458     02 FILLER     PIC X(20) VALUE "00000000000000000000".        087880      
001459     02 FILLER     PIC X(20) VALUE "00000000000000000000".        087890      
001460 01  TABLA-DE-TOTALES-X-SIST-R REDEFINES TABLA-DE-TOTALES-X-SIST. 087900      
001461     02 TABLA-TOT-SIST          OCCURS 12 TIMES.                  088000      
001462        04  TABLA-TOT-SIST-RENG OCCURS 20 TIMES.                  088100      
001463            06  TABLA-TOT-TIPO            PIC 9.                  088200      
001464                                                                  088300      
001465 01  WS-REM-TEXTO-SE                     PIC X(1879).             088400      
001466 01 WS-REM-TEXTO-TBL REDEFINES WS-REM-TEXTO-SE.                   088500      
001467    03 WS-REM-TEXTO-TABLA OCCURS 1879 TIMES.                      088600      
001468       05 WS-REM-TEXTO-SE-CHAR       PIC X(01).                   088700      
001469******************************************************************088800      
001470*             INTERFASE CON LIBRERIA ACTBD S151                  *088900      
001471******************************************************************089000      
001472 01  WS-MOVIMIENTO                            WITH LOWER-BOUNDS.  089100      
001473    03 WS-MOV-FUNCION            PIC 9(02).                       089200      
001474    03 WS-MOV-SUCURSAL           PIC 9(04).                       089300      
001475    03 WS-MOV-CAJA               PIC 99.                          089400      
001476    03 WS-MOV-SISTEMA            PIC 9(04).                       089500      
001477    03 WS-MOV-INST               PIC 9(02).                       089600      
001478    03 WS-MOV-CUENTA             PIC 9(16).                       089700      
001479    03 WS-MOV-CONTROL            PIC 9(06).                       089800      
001480    03 WS-MOV-AUTORIZA           PIC 9(06).                       089900      
001481    03 WS-MOV-SUCPROM            PIC 9(04).                       090000      
001482    03 WS-MOV-SUCTRAN            PIC 9(04).                       090100      
001483    03 WS-MOV-CLAVE              PIC 99.                          090200      
001484    03 WS-MOV-REFER              PIC 9(14).                       090300      
001485    03 WS-MOV-MONEDA             PIC 9(04).                       090400      
001486    03 WS-MOV-IMPORTE            PIC 9(14)V99.                    090500      
001487    03 WS-MOV-HORA               PIC 9(6).                        090600      
001488    03 WS-MOV-FECHAVALOR         PIC 9(6).                        090700      
001489*INICIA CODIGO DE RENOVACION CRONOS 2000                          090701      
001490*JM 03 WS-MOV-FECHAVALOR         PIC 9(08).                       090702      
001491*TERMINA CODIGO DE RENOVACION CRONOS 2000                         090703      
001492                                                                  090800      
001493******************************************************************090900      
001494*             INTERFASE CON LIBRERIA ACTUALIZA S151              *091000      
001495******************************************************************091100      
001496 01 WS-LG-DATOS WITH LOWER-BOUNDS.                                091200      
001497    07 WS-LG-FUNCION         PIC 9(02)    COMP.                   091300      
001498    07 WS-LG-SISTEMA         PIC 9(04)    COMP.                   091400      
001499    07 WS-LG-PRODUCTO        PIC 9(04)    COMP.                   091500      
001500    07 WS-LG-INTRUMENTO      PIC 9(02)    COMP.                   091600      
001501    07 WS-LG-SUCPROM         PIC 9(04)    COMP.                   091700      
001502    07 WS-LG-CUENTA          PIC 9(16)    COMP.                   091800      
001503    07 WS-LG-CVETRAN1        PIC 9(04)    COMP.                   091900      
001504    07 WS-LG-SUBCVETRAN1     PIC 9(02)    COMP.                   092000      
001505    07 WS-LG-IMPORTE1        PIC 9(14)V99 COMP.                   092100      
001506    07 FILLER                PIC X(44).                           092200      
001507    07 WS-LG-FECOPER         PIC 9(06)    COMP.                   092300      
001508*INICIA CODIGO DE RENOVACION CRONOS 2000                          092301      
001509*JM 07 WS-LG-FECOPER         PIC 9(08)    COMP.                   092302      
001510*TERMINA CODIGO DE RENOVACION CRONOS 2000                         092303      
001511    07 WS-LG-HOROPER         PIC 9(06)    COMP.                   092400      
001512    07 WS-LG-FECCONT         PIC 9(06)    COMP.                   092500      
001513*INICIA CODIGO DE RENOVACION CRONOS 2000                          092501      
001514*JM 07 WS-LG-FECCONT         PIC 9(08)    COMP.                   092502      
001515*TERMINA CODIGO DE RENOVACION CRONOS 2000                         092503      
001516    07 WS-LG-FECHVAL         PIC 9(06)    COMP.                   092600      
001517*INICIA CODIGO DE RENOVACION CRONOS 2000                          092601      
001518*JM 07 WS-LG-FECHVAL         PIC 9(08)    COMP.                   092602      
001519*TERMINA CODIGO DE RENOVACION CRONOS 2000                         092603      
001520    07 WS-LG-AUT-APLIC       PIC 9(08)    COMP.                   092700      
001521    07 FILLER                PIC X(26).                           092800      
001522          07 WS-LG-SUCTRAN         PIC 9(04)    COMP.             092900      
001523          07 WS-LG-CAJATRAN        PIC 9(02)    COMP.             093000      
001524          07 WS-LG-NOMI-OPE        PIC 9(08)    COMP.             093100      
001525          07 WS-LG-NOMI-FUN1       PIC 9(08)    COMP.             093200      
001526          07 WS-LG-NOMI-FUN2       PIC 9(08)    COMP.             093300      
001527          07 WS-LG-SIST-ORIG       PIC 9(04)    COMP.             093400      
001528          07 WS-LG-PROD-ORIG       PIC 9(04)    COMP.             093500      
001529          07 WS-LG-INST-ORIG       PIC 9(02)    COMP.             093600      
001530          07 WS-LG-ORIGEN          PIC 9(02)    COMP.             093700      
001531*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001532* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           093800      
001533**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
001534  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
001535  01 MENSAJE-LJ.                                                  100300      
001536     02 SISTEMA-LJ     PIC X(04).                                 100400      
001537     02 FILLER         PIC X VALUE "/".                           100500      
001538     02 PASO-LJ        PIC X(04).                                 100600      
001539     02 FILLER         PIC X VALUE "/".                           100700      
001540     02 MTP-LJ         PIC 9(03).                                 100800      
001541     02 FILLER         PIC X VALUE ":".                           100900      
001542     02 TIPO-LJ        PIC X.                                     101000      
001543     02 FILLER         PIC X VALUE ">".                           101100      
001544     02 CODIGO-LJ      PIC 9(06).                                 101200      
001545     02 FILLER         PIC X VALUE "<".                           101300      
001546     02 TEXTO-LJ       PIC X(250).                                101400      
001547*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001548************************************************************      093900      
001549*        PARAMETROS PARA LLAMADO A CTLVERS S006            *      094000      
001550************************************************************      094100      
001551*                                                                 094200      
001552 01 WKS-CTLVER-LIBID             PIC X(12).                       094300      
001553 01 WKS-CTLVER-NOMLIB               PIC X(72).                    094400      
001554 01 W77-CTLVER-RSLT               PIC S9(11) BINARY.              094500      
001555****************************************************************  094600      
001556*              VARIABLES PARA EL CONTROL DEL PROCESO           *  094700      
001557****************************************************************  094800      
001558 77  WS-CONTROL               PIC S9(0011) BINARY VALUE 0.        094900      
001559 77  AX-SCRATCH               PIC 9(4).                           095000      
001560 01  WKS-FECHA-S500                PIC 9(08).                     095152      
001561 01  WKS-FECHA-S701                PIC 9(08).                     095154      
001562 01  WKS-FECHA-S264                PIC 9(08).                     095155      
001563 01  WKS-FECHA-S404                PIC 9(08).                     095156      
001564 01  WKS-FECHA-S018                PIC 9(08).                     095157      
001565 01  WKS-FECHA-S501                PIC 9(08).                     095158      
001566 01  WKS-FECHA-S502                PIC 9(08).                     095160      
001567*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001568* COPY "S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".               095170      
001569*================================================================ 000100      
001570*         ENTRY-POINT CONSISDIA :                               = 000200      
001571*                                                                 000300      
001572* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
001573* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
001574* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
001575* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
001576* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
001577* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
001578* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
001579* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
001580* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
001581* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
001582*                                                               = 001400      
001583*================================================================ 001500      
001584                                                                  001600      
001585                                                                  001700      
001586*================================================================ 001800      
001587* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
001588*                                                               = 002000      
001589* ENTRADA REQUERIDA :                                           = 002100      
001590*                                                               = 002200      
001591*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
001592*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
001593*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
001594*================================================================ 002600      
001595 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
001596    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
001597    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
001598    03 WKS-B01-CSI                 PIC 9(02).                     003000      
001599    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
001600    03 WKS-B01-FECCON              PIC 9(08).                     003202      
001601    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
001602    03 WKS-B01-STAREG              PIC 9(02).                     003400      
001603    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
001604    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
001605    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
001606    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
001607    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
001608    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
001609    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
001610    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
001611    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
001612    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
001613    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
001614    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
001615    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
001616       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
001617       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
001618       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
001619       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
001620*==============================================================   005200      
001621*                                                             =   005300      
001622* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
001623*                                                             =   005500      
001624* CAMPOS REQUERIDOS :                                         =   005600      
001625*                                                             =   005700      
001626* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
001627* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
001628* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
001629* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
001630*==============================================================   006200      
001631 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
001632    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
001633    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
001634    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
001635    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
001636                                                                  006800      
001637*==============================================================   006900      
001638*                                                             =   007000      
001639* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
001640*                                                             =   007200      
001641* CAMPOS REQUERIDOS :                                         =   007300      
001642*                                                             =   007400      
001643* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
001644* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
001645* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
001646* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
001647*==============================================================   007900      
001648 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
001649    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
001650    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
001651    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
001652    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
001653                                                                  008500      
001654*==============================================================   008600      
001655*                                                             =   008700      
001656* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
001657*                                                             =   008900      
001658* CAMPOS REQUERIDOS :                                         =   009000      
001659*                                                             =   009100      
001660* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
001661* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
001662* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
001663* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
001664*==============================================================   009600      
001665 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
001666    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
001667    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
001668    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
001669    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
001670                                                                  010200      
001671*============================================================     010300      
001672* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
001673*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
001674*                                                           =     010600      
001675*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
001676*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
001677*                                                           =     010900      
001678*  ENTRADA REQUERIDA.                                       =     011000      
001679*                                                           =     011100      
001680*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
001681*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
001682*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
001683*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
001684*============================================================     011600      
001685                                                                  011700      
001686 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
001687     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
001688     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
001689     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
001690     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
001691                                                                  012300      
001692*=============================================================    012400      
001693*                                                            =    012500      
001694* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
001695*             B01-SIS-FECARMOV.                              =    012700      
001696*                                                            =    012800      
001697* ENTRADA REQUERIDAD :                                       =    012900      
001698*                                                            =    013000      
001699*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
001700*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
001701*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
001702*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
001703*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
001704*=============================================================    013600      
001705                                                                  013700      
001706 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
001707     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
001708     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
001709     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
001710     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
001711     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
001712*================================================================ 014400      
001713*                                                               = 014500      
001714* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
001715*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
001716*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
001717*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
001718*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
001719*                                                               = 015100      
001720* ENTRADA REQUERIDA :                                           = 015200      
001721*                                                               = 015300      
001722* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
001723* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
001724* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
001725* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
001726* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
001727*================================================================ 015900      
001728 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
001729    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
001730    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
001731    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
001732    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
001733    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
001734                                                                  016600      
001735*============================================================     016700      
001736*                                                           =     016800      
001737* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
001738*                                                           =     017000      
001739* DATOS REQUERIDOS :                                        =     017100      
001740*                                                           =     017200      
001741* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
001742* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
001743* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
001744* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
001745* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
001746*============================================================     017800      
001747                                                                  017900      
001748 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
001749     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
001750     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
001751     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
001752     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
001753     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
001754                                                                  018600      
001755*============================================================     018700      
001756*                                                           =     018800      
001757* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
001758*                                                           =     019000      
001759* DATOS REQUERIDOS :                                        =     019100      
001760*                                                           =     019200      
001761* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
001762* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
001763* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
001764* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
001765* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
001766*============================================================     019800      
001767                                                                  019900      
001768 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
001769     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
001770     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
001771     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
001772     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
001773     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
001774                                                                  020600      
001775*===============================================================  020700      
001776*                                                              =  020800      
001777* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
001778*              MOVIMIENTOS.                                    =  021000      
001779* DATOS REQUERIDOS :                                           =  021100      
001780*                                                              =  021200      
001781* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
001782* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
001783* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
001784* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
001785* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
001786* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
001787*==============================================================   021900      
001788                                                                  022000      
001789 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
001790     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
001791     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
001792     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
001793     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
001794     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
001795     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
001796*==============================================================   022800      
001797*                                                             =   022900      
001798* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
001799*                                                             =   023100      
001800* CAMPOS REQUERIDOS :                                         =   023200      
001801*                                                             =   023300      
001802* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
001803* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
001804* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
001805* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
001806*==============================================================   023800      
001807 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
001808    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
001809    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
001810    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
001811    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
001812                                                                  024304      
001813*=================================================================024306      
001814*                ENTRY POINT CONSISB01                           =024308      
001815*                                                                =024310      
001816*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
001817*                                                                =024314      
001818*  FUNCIONES DISPONIBLES :                                       =024316      
001819*                                                                =024318      
001820*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
001821*                                                                =024322      
001822*  PARAMETROS REQUERIDOS                                         =024324      
001823*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
001824*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
001825*=================================================================024330      
001826                                                                  024332      
001827 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
001828     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
001829     03 WKS-CON-CSI                PIC 9(02).                     024336      
001830     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
001831     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
001832        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
001833        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
001834        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
001835        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
001836        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
001837                                                                  024400      
001838*=================================================================024500      
001839*                ENTRY POINT B02ARCINTER                         =024600      
001840*                                                                =024700      
001841*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
001842*                                                                =024900      
001843*  FUNCIONES DISPONIBLES :                                       =025000      
001844*                                                                =025100      
001845*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
001846* 19.- ALTAS DE ARCHIVOS.                                        =025300      
001847* 22.- BAJAS DE ARCHIVOS.                                        =025400      
001848* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
001849*                                                                =025600      
001850*  PARAMETROS REQUERIDOS                                         =025700      
001851*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
001852*                                                                =025900      
001853*=================================================================026000      
001854 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
001855     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
001856     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
001857     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
001858     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
001859     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
001860     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
001861     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
001862     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
001863     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
001864     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
001865     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
001866     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
001867     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
001868     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
001869     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
001870     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
001871     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
001872     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
001873     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
001874     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
001875     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
001876     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
001877     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
001878     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
001879     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
001880     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
001881     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
001882     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
001883                                                                  029000      
001884*=================================================================029100      
001885*                ENTRY POINT B04SISTEMA                          =029200      
001886*                                                                =029300      
001887*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
001888*                                                                =029500      
001889*  FUNCIONES DISPONIBLES :                                       =029600      
001890*                                                                =029700      
001891*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
001892*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
001893*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
001894*                                                                =030100      
001895*  PARAMETROS REQUERIDOS                                         =030200      
001896*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
001897*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
001898*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
001899*                                                                =030600      
001900*=================================================================030700      
001901 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
001902     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
001903     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
001904     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
001905     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
001906     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
001907     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
001908     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
001909                                                                  031600      
001910*================================================================ 031700      
001911*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
001912*                                                               = 031900      
001913*  FUNCION                                                      = 032000      
001914*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
001915*   19       ALTAS.                                             = 032200      
001916*   22       BAJAS                                              = 032300      
001917*   37       CAMBIOS.                                           = 032400      
001918*                                                               = 032500      
001919*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
001920*                      FECHA DE PROCESO                         = 032700      
001921*                      NUMERO DE PROCESO                        = 032800      
001922*                      FECHA INICIO                             = 032900      
001923*                      REGISTRO INICIAL                         = 033000      
001924*================================================================ 033100      
001925                                                                  033200      
001926 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
001927     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
001928     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
001929     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
001930     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
001931     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
001932     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
001933     03 WKS-B05-MIX                PIC 9(08).                     034000      
001934     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
001935     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
001936     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
001937     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
001938     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
001939     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
001940                                                                  034700      
001941                                                                  034800      
001942*================================================================ 034900      
001943*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
001944*                                                               = 035100      
001945*  FUNCION                                                      = 035200      
001946*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
001947*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
001948*                                                               = 035500      
001949*================================================================ 035600      
001950                                                                  035700      
001951 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
001952     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
001953     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
001954     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
001955     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
001956     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
001957     03 WKS-B09-NOMREN             PIC X(15).                     036400      
001958                                                                  036500      
001959*===============================================================  036600      
001960*                                                              =  036700      
001961*         ENTRY-POINT CONSISMEN                                =  036800      
001962*                                                              =  036900      
001963*   DATOS REQUERIDOS : FUNCION                                 =  037000      
001964*                      SISTEMA                                 =  037100      
001965*                                                              =  037200      
001966*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
001967*                                                              =  037400      
001968*===============================================================  037500      
001969 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
001970     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
001971     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
001972     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
001973     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
001974     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
001975     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
001976     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
001977     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
001978     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
001979     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
001980     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
001981     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
001982     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
001983     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
001984     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
001985        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
001986        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
001987        05 WKS-B03-AAMM            PIC 9(06).                     039402      
001988        05 WKS-B03-SECOK           PIC 9(10).                     039500      
001989        05 WKS-B03-SECINF          PIC 9(10).                     039600      
001990        05 WKS-B03-SECERR          PIC 9(10).                     039700      
001991        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
001992                                                                  039900      
001993*=====================================================            040000      
001994*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
001995*=====================================================            040200      
001996 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
001997     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
001998     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
001999     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
002000                                                                  040700      
002001*=====================================================            040800      
002002*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
002003*=====================================================            041000      
002004 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
002005     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
002006     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
002007     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
002008                                                                  041500      
002009*=====================================================            041600      
002010*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
002011*=====================================================            041800      
002012 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
002013     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
002014     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
002015     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
002016*=====================================================            042300      
002017*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
002018*=====================================================            042500      
002019 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
002020     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
002021     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
002022     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
002023                                                                  043000      
002024*=====================================================            043100      
002025*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
002026*=====================================================            043300      
002027 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
002028     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
002029     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
002030     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
002031                                                                  043800      
002032*=====================================================            043900      
002033*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
002034*=====================================================            044100      
002035 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
002036     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
002037     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
002038     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
002039                                                                  044600      
002040*=====================================================            044700      
002041*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
002042*=====================================================            044900      
002043 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
002044     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
002045     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
002046     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
002047                                                                  045400      
002048*=====================================================            045500      
002049*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
002050*=====================================================            045700      
002051 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
002052     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
002053     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
002054     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
002055                                                                  046200      
002056*=====================================================            046300      
002057*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
002058*=====================================================            046500      
002059 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
002060     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
002061     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
002062     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
002063                                                                  047000      
002064*=====================================================            047100      
002065*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
002066*=====================================================            047300      
002067 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
002068     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
002069     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
002070     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
002071                                                                  047800      
002072*=====================================================            047900      
002073*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
002074*=====================================================            048100      
002075 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
002076     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
002077     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
002078     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
002079                                                                  048600      
002080*=====================================================            048700      
002081*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
002082*=====================================================            048900      
002083 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
002084     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
002085     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
002086     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
002087                                                                  049400      
002088*=====================================================            049500      
002089*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
002090*=====================================================            049700      
002091 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
002092     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
002093     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
002094     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
002095     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
002096     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
002097     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
002098     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
002099     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
002100     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
002101     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
002102                                                                  050900      
002103*=====================================================            051000      
002104*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
002105*=====================================================            051200      
002106 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
002107     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
002108     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
002109     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
002110     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
002111                                                                  051800      
002112*=====================================================            051900      
002113*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
002114*=====================================================            052100      
002115 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
002116     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
002117     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
002118     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
002119     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
002120                                                                  052700      
002121*=====================================================            052800      
002122*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
002123*=====================================================            053000      
002124 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
002125     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
002126     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
002127     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
002128     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
002129                                                                  053600      
002130*=====================================================            053700      
002131*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
002132*=====================================================            053900      
002133 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
002134     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
002135     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
002136     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
002137     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
002138                                                                  054500      
002139*=====================================================            054600      
002140*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
002141*=====================================================            054800      
002142 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
002143     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
002144     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
002145     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
002146     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
002147                                                                  055400      
002148*=====================================================            055500      
002149*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
002150*=====================================================            055700      
002151 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
002152     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
002153     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
002154     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
002155     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
002156                                                                  056300      
002157*=====================================================            056400      
002158*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
002159*=====================================================            056600      
002160 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
002161     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
002162     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
002163     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
002164     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
002165                                                                  057200      
002166 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
002167*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002168                                                                  095180      
002169 77  WS-HI-INTERRUPT          PIC S9(0011) BINARY VALUE 0.        095200      
002170     88  WS-HI-MONITOR                            VALUE 2.        095300      
002171     88  WS-HI-FIN-MONITOR                        VALUE 3.        095400      
002172     88  WS-HI-FIN-NORMAL                         VALUE 4.        095500      
002173     88  WS-HI-FIN-EMERGENCIA                     VALUE 6.        095600      
002174     88  WS-HI-DUMPALL                            VALUE 7.        095700      
002175     88  WS-HI-BAJACOPIA                          VALUE 8.        095800      
002176     88  WS-HI-DESHABACT                          VALUE 11.       095900      
002177     88  WS-HI-HABACT                             VALUE 12.       096000      
002178     88  WS-HI-STACONS                            VALUE 13.       096100      
002179     88  WS-HI-DESBLOCON                          VALUE 14.       096200      
002180     88  WS-HI-STAADMOV                           VALUE 15.       096300      
002181     88  WS-HI-ADMOVNIVCERO                       VALUE 16.       096400      
002182     88  WS-HI-CLOSEADMOV                         VALUE 17.       096500      
002183     88  WS-HI-OPENADMOV                          VALUE 18.       096600      
002184     88  WS-HI-FCHCONS                            VALUE 19.       096700      
002185     88  WS-HI-CHQSANT                            VALUE 25.       096800      
002186     88  WS-HI-DESHABACTCHQS                      VALUE 31.       096900      
002187*    88  WS-HI-HABACTCHQS                         VALUE 32.       097000      
002188     88  WS-HI-ACTFECL001                         VALUE 32.       097052      
002189     88  WS-HI-NIVELCHQS                          VALUE 35.       097100      
002190     88  WS-HI-NIVCEROCHQS                        VALUE 36.       097200      
002191     88  WS-HI-CLOSEMOVCHQS                       VALUE 37.       097300      
002192     88  WS-HI-OPENMOVCHQS                        VALUE 38.       097400      
002193     88  WS-HI-HABCONXPAN                         VALUE 46.       098200      
002194     88  WS-HI-DESHABCONXPAN                      VALUE 47.       098300      
002195*                                                                 098400      
002196 01  MY-ID                   PIC X(10) VALUE "S151/P030".         098500      
002197*=================================================================098600      
002198/**************************************************************** 098700      
002199 LINKAGE SECTION.                                                 098800      
002200***************************************************************** 098900      
002201                                                                  099000      
002202*-------------- FUNCIONES DE SERVICIO DE COMS --------------------099100      
002203                                                                  099200      
002204 01  LS-COMS-MY-PROGRAM-NAME                  PIC X(0018).        099300      
002205 77  LS-COMS-MY-PROGRAM-DESG                               REAL.  099400      
002206                                                                  099500      
002207 01  LS-COMS-EX-AGENDA-NAME.                                      099600      
002208     03 FILLER                         PIC X    VALUE   "S".      099700      
002209     03 LS-COMS-EX-AGENDA-SIS          PIC 999  VALUE   151.      099800      
002210     03 LS-COMS-EX-AGENDA-MOD          PIC  99  VALUE   30.       099900      
002211 77  LS-COMS-EX-AGENDA-DESG                                REAL.  100000      
002212                                                                  100100      
002213 01  LS-COMS-AG-SALIDA-NAME                   PIC X(0050).        100200      
002214 77  LS-COMS-AG-SALIDA-DESG                                REAL.  100300      
002215                                                                  100400      
002216 77  LS-COMS-RESULT                           PIC S9(011)  BINARY.100500      
002217     88 LS-COMS-OK                  VALUE 0.                      100600      
002218                                                                  100700      
002219 01  LS-COMS-DEFSTATION-NAME                  PIC X(0018).        100800      
002220 77  LS-COMS-DEFSTATION-DESG                               REAL.  100900      
002221                                                                  101000      
002222*------------ PARAMETROS DE APLINCLUDE Y CHANGEATT ---------------101100      
002223                                                                  101200      
002224 01  LS-NOAPLINCLUDE-PARAMETRO                 PIC X(0030).       101300      
002225 77  LS-NOAPLINCLUDE-DESG                      REAL.              101400      
002226 77  LS-APLINCLUDE-RESULT                     PIC S9(011)  BINARY.101500      
002227     88 LS-APLINCLUDE-OK        VALUE 0.                          101600      
002228                                                                  101700      
002229*------------------ PARAMETROS DE ESPERACOMS ---------------------101800      
002230                                                                  101900      
002231 77  LS-ESPERACOMS-TIEMPO            PIC S9(011) BINARY  VALUE 60.102000      
002232 77  LS-ESPERACOMS-TIPO-EVENTO       PIC S9(011) BINARY.          102100      
002233     88  LS-POR-MSG                                      VALUE  1.102200      
002234     88  LS-POR-ACCEPT                                   VALUE  2.102300      
002235     88  LS-POR-HI                                       VALUE  3.102400      
002236     88  LS-POR-TIMEOUT                                  VALUE  4.102500      
002237     88  LS-POR-EVENTO                                   VALUE  5.102600      
002238                                                                  102700      
002239*------------------- PARAMETROS DE SMCOMS ------------------------102800      
002240                                                                  102900      
002241 01  LS-SMCOMS-COMANDO.                                           103000      
002242     03  LS-SMCOMS-STRING1                    PIC X(0020).        103100      
002243     03  LS-SMCOMS-STRING2                    PIC X(0020).        103200      
002244 01  LS-SMCOMS-TRABAJO                        PIC X(0132).        103300      
002245 77  LS-SMCOMS-RESULT                         PIC S9(011)  BINARY.103400      
002246     88  LS-SMCOMS-OK                VALUE 0.                     103500      
002247*=================================================================103600      
002248/=================================================================103700      
002249 COMMUNICATION SECTION.                                           103800      
002250*=================================================================103900      
002251*                                                                 104000      
002252*-----------------------------------------------------------------104100      
002253*                     HEADER'S DE COMS                            104200      
002254*-----------------------------------------------------------------104300      
002255                                                                  104400      
002256  INPUT HEADER CS-COMS-IN;                                        104500      
002257                                                                  104600      
002258      PROGRAMDESG            IS CS-COMS-IN-PROGRAM;               104700      
002259      FUNCTIONSTATUS         IS CS-COMS-IN-FUNCTION-STATUS;       104800      
002260      FUNCTIONINDEX          IS CS-COMS-IN-FUNCTION-INDEX;        104900      
002261      USERCODE               IS CS-COMS-IN-USERCODE;              105000      
002262      SECURITYDESG           IS CS-COMS-IN-SECURITY-DESG;         105100      
002263      TRANSPARENT            IS CS-COMS-IN-TRANSPARENT;           105200      
002264      VTFLAG                 IS CS-COMS-IN-VT-FLAG;               105300      
002265      TIMESTAMP              IS CS-COMS-IN-TIMESTAMP;             105400      
002266      STATION                IS CS-COMS-IN-STATION;               105500      
002267      TEXTLENGTH             IS CS-COMS-IN-TEXT-LENGTH;           105600      
002268      STATUSVALUE            IS CS-COMS-IN-STATUS-KEY;            105700      
002269      MESSAGECOUNT           IS CS-COMS-IN-MSG-COUNT;             105800      
002270      RESTART                IS CS-COMS-IN-RST-LOC;               105900      
002271      AGENDA                 IS CS-COMS-IN-AGENDA.                106000      
002272                                                                  106100      
002273  OUTPUT HEADER CS-COMS-OUT;                                      106200      
002274                                                                  106300      
002275       DESTCOUNT              IS CS-COMS-OUT-COUNT;               106400      
002276       TEXTLENGTH             IS CS-COMS-OUT-TEXT-LENGTH;         106500      
002277       STATUSVALUE            IS CS-COMS-OUT-STATUS-KEY;          106600      
002278       TRANSPARENT            IS CS-COMS-OUT-TRANSPARENT;         106700      
002279       VTFLAG                 IS CS-COMS-OUT-VT-FLAG;             106800      
002280       CONFIRMFLAG            IS CS-COMS-OUT-CONFIRM-FLAG;        106900      
002281       CONFIRMKEY             IS CS-COMS-OUT-CONFIRM-KEY;         107000      
002282       DESTINATIONDESG        IS CS-COMS-OUT-DESTINATION;         107100      
002283       NEXTINPUTAGENDA        IS CS-COMS-OUT-NEXT-INPUT-AGENDA;   107200      
002284       SETNEXTINPUTAGENDA     IS CS-COMS-OUT-SNEXT-INPUT-AGENDA;  107300      
002285       RETAINTRANSACTIONMODE  IS CS-COMS-OUT-SAVE-TRANS-MODE;     107400      
002286       AGENDA                 IS CS-COMS-OUT-AGENDA.              107500      
002287*=================================================================107600      
002288/**********************************************************       107700      
002289*                                                         *       107800      
002290*                 PROCEDURE DIVISION                      *       107900      
002291*                                                         *       108000      
002292***********************************************************       108100      
002293 PROCEDURE DIVISION.                                              108200      
002294 DECLARATIVES.                                                    108300      
002295 INTERRUPT-BY-HI SECTION.                                         108400      
002296     USE AS INTERRUPT PROCEDURE.                                  108500      
002297 000A-BEGIN-INTERRUPT.                                            108600      
002298     DISALLOW INTERRUPT.                                          108700      
002299    MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WS-HI-INTERRUPT         108800      
002300    IF WS-HI-MONITOR                                              108900      
002301       MOVE 050102                        TO CODIGO-LJ            109000      
002302       IF WS-MON = 0                                              109100      
002303          MOVE "PRENDE MONITOR      "     TO TEXTO-LJ             109200      
002304          PERFORM 900900-DISPLAY                                  109300      
002305          MOVE 1 TO WS-MON                                        109400      
002306          OPEN OUTPUT MONITOREO                                   109500      
002307       ELSE                                                       109600      
002308          MOVE "MONITOR YA ENCENDIDO"     TO TEXTO-LJ             109700      
002309          PERFORM 900900-DISPLAY                                  109800      
002310    ELSE                                                          109900      
002311    IF WS-HI-FIN-MONITOR                                          110000      
002312       MOVE 050103                        TO CODIGO-LJ            110100      
002313       IF WS-MON = 1                                              110200      
002314          MOVE "APAGA MONITOR         "   TO TEXTO-LJ             110300      
002315          PERFORM 900900-DISPLAY                                  110400      
002316          MOVE 0 TO WS-MON                                        110500      
002317          CLOSE MONITOREO WITH SAVE                               110600      
002318       ELSE                                                       110700      
002319          MOVE "MONITOR NO ENCENDIDO  "   TO TEXTO-LJ             110800      
002320          PERFORM 900900-DISPLAY                                  110900      
002321    ELSE                                                          111000      
002322    IF WS-HI-FIN-NORMAL                                           111100      
002323       MOVE "FIN NORMAL POR OPERADOR"               TO TEXTO-LJ   111200      
002324       MOVE 050104                                  TO CODIGO-LJ  111300      
002325       PERFORM 900900-DISPLAY                                     111400      
002326       MOVE 1 TO WS-FIN                                           111500      
002327    ELSE                                                          111600      
002328    IF WS-HI-FIN-EMERGENCIA                                       111700      
002329       MOVE 050106                                  TO CODIGO-LJ  111800      
002330       MOVE "TERMINACION DE EMERGENCIA"             TO TEXTO-LJ   111900      
002331       PERFORM 900900-DISPLAY                                     112000      
002332       MOVE 1 TO WS-FIN                                           112100      
002333    ELSE                                                          112200      
002334    IF WS-HI-DUMPALL                                              112300      
002335       MOVE "MODULO 030, GENERA DUMP"               TO TEXTO-LJ   112400      
002336       PERFORM 900900-DISPLAY                                     112500      
002337       CALL SYSTEM DUMP                                           112600      
002338    ELSE                                                          112700      
002339    IF WS-HI-STACONS                                              116400      
002340       MOVE WS-HORA-INI TO WS-HORA-ED                             116500      
002341       MOVE WS-NUM-CON  TO WS-NUM-CON-ED                          116600      
002342       ACCEPT WS-HORA-FIN FROM TIME                               116700      
002343       DISPLAY "-- ** ADMOV ....>>> STATUS DE CONSULTAS ** --"    116800      
002344       DISPLAY "-- ** ADMOV : DESDE LAS " WS-HORA-ED              116900      
002345       MOVE WS-HORA-FIN TO WS-HORA-ED                             117000      
002346       DISPLAY "-- ** ADMOV : HASTA LAS " WS-HORA-ED              117100      
002347       DISPLAY "-- ** ADMOV : CONSULTAS  " WS-NUM-CON-ED          117200      
002348    ELSE                                                          117300      
002349    IF WS-HI-DESBLOCON                                            117400      
002350       ACCEPT WS-HORA-MAQUINA FROM TIME                           117500      
002351       IF WS-HORA-BLOQUEO > WS-HORA-MAQUINA                       117600      
002352          DISPLAY "S151/ADMOV : *********************************"117700      
002353          DISPLAY "S151/ADMOV : DESBLOQUEO CONSULTA DE MOVTOS .." 117800      
002354          DISPLAY "S151/ADMOV : ****************** O.K.         " 117900      
002355          COMPUTE WS-HORA-BLOQUEO = ZEROS                         118000      
002356       ELSE                                                       118100      
002357          DISPLAY "S151/ADMOV : *********************************"118200      
002358          DISPLAY "S151/ADMOV : BLOQUEO CONSULTA DE MOVTOS .."    118300      
002359          DISPLAY "S151/ADMOV : *************** O.K.            " 118400      
002360          COMPUTE WS-HORA-BLOQUEO = 99999999                      118500      
002361     ELSE                                                         118600      
002362     IF WS-HI-FCHCONS                                             127500      
002363*       DISPLAY "S151/030/ADMOV: DAME FECHA DE CONSULTA (AAMMDD)" 127600      
002364*INICIA CODIGO DE RENOVACION CRONOS 2000                          127601      
002365      DISPLAY "S151/030/ADMOV: DAME FECHA DE CONSULTA (CCAAMMDD)" 127602      
002366*TERMINA CODIGO DE RENOVACION CRONOS 2000                         127603      
002367        ACCEPT 77-ADMOV-FECPROC                                   127700      
002368        DISPLAY "S151/030/ADMOV: CONSULTA CON FECHA "             127800      
002369                       77-ADMOV-FECPROC                           127900      
002370        MOVE 77-ADMOV-FECPROC     TO  77-ADMOV-FECPROC-6DIG       127955      
002371     ELSE                                                         128000      
002372     IF WS-HI-CHQSANT                                             128100      
002373        IF W88-CHQS-ANT                                           128200      
002374           DISPLAY "S151/030/ADMOV: CONSULTA LIBRERIA NUEVA"      128300      
002375           MOVE 0                 TO  W77-CHQS-ANT                128400      
002376        ELSE                                                      128500      
002377           MOVE 1                 TO  W77-CHQS-ANT                128600      
002378           DISPLAY "S151/030/ADMOV: CONSULTA LIBRERIA ANTERIOR"   128700      
002379     ELSE                                                         128800      
002380     IF WS-HI-HABCONXPAN                                          129700      
002381        IF WS-CONXPAN = ZEROS                                     129800      
002382           DISPLAY "S151/030/ADMOV: CONS. YA HABILITADAS"         129900      
002383        ELSE                                                      130000      
002384           DISPLAY "S151/030/ADMOV: HABILITO CONS. POR PANTALLA"  130100      
002385           MOVE ZEROS             TO WS-CONXPAN                   130200      
002386     ELSE                                                         130300      
002387     IF WS-HI-DESHABCONXPAN                                       130400      
002388        IF WS-CONXPAN = 1                                         130500      
002389           DISPLAY "S151/030/ADMOV: CONS. YA DESHABILITADAS"      130600      
002390        ELSE                                                      130700      
002391           DISPLAY "S151/030/ADMOV: DESHABILITO CONS POR PANTALLA"130800      
002392           MOVE 1                 TO WS-CONXPAN                   130900      
002393     ELSE                                                         131000      
002394     IF WS-HI-ACTFECL001                                          131056      
002395        DISPLAY "S151/030/ADMOV: CARGA FECHA DE L001/CONTROL"     131060      
002396        PERFORM 09000-LIGA-L001                                   131064      
002397        PERFORM 90000-FECHAS-L001                                 131068      
002398     ELSE                                                         131070      
002399        DISPLAY "S151/030/ADMOV   ---> HI'S DISPONIBLES"          131100      
002400        DISPLAY "           HI2   -> PRENDE MONITOR"              131200      
002401        DISPLAY "           HI3   -> APAGA MONITOR "              131300      
002402        DISPLAY "           HI4   -> FIN NORMAL POR OPERADOR"     131400      
002403        DISPLAY "           HI6   -> TERMINACION DE EMERGENCIA"   131500      
002404        DISPLAY "           HI7   -> DUMP ALL"                    131600      
002405        DISPLAY "           HI8   -> BAJA COPIA DE PROGRAMA"      131700      
002406        DISPLAY "           HI11  -> DESHABILITA ACTMOV"          131800      
002407        DISPLAY "           HI12  -> HABILITA ACTMOV"             131900      
002408        DISPLAY "           HI13  -> NUMERO DE CONSULTAS "        132000      
002409        DISPLAY "           HI14  -> ACTIVA O DESACTIVA CONSULTA" 132100      
002410        DISPLAY "           HI15  -> NIVEL DEL TAKING"            132200      
002411        DISPLAY "           HI16  -> INICIO CON NIVEL CERO"       132300      
002412        DISPLAY "           HI17  -> BLOQUEA ACCESA A BASE"       132400      
002413        DISPLAY "           HI18  -> DESBLOQUEA ACCESA A BASE"    132500      
002414        DISPLAY "           HI19  -> CAMBIO FECHA DE CONSULTA"    132600      
002415*       DISPLAY "           HI25  -> CONSULTA MOVS. CHEQUES  "    132700      
002416*       DISPLAY "           HI31  -> DESHABILITA ACTCHQS"         132800      
002417        DISPLAY "           HI32  -> CARGA FECHAS DE L001/CONTROL"132900      
002418*       DISPLAY "           HI35  -> NIVEL DEL TAKING CHQS "      133000      
002419*       DISPLAY "           HI36  -> INICIO CON NIVEL CERO CHQS"  133100      
002420*       DISPLAY "           HI37  -> CIERRA ACCES0 A BASE CHQS"   133200      
002421*       DISPLAY "           HI38  -> ABRE   ACCES0 A BASE CHQS"   133300      
002422        DISPLAY "           HI46  -> HABILITA CONSULTAS/PATALLAS" 134100      
002423        DISPLAY "           HI47  -> DESHABILITA CONS/PANTALLAS". 134200      
002424     ALLOW INTERRUPT.                                             134300      
002425 0000A-END.                                                       134400      
002426 END DECLARATIVES.                                                134500      
002427$SET PAGE                                                         134600      
002428 00000-INICIA-PROGRAMA SECTION.                                   134700      
002429 00001-INICIO.                                                    134800      
002430                                                                  134900      
002431                                                                  135000      
002432     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS"               135100      
002433                                   TO  BYFUNCTION.                135200      
002434                                                                  135300      
002435     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS"               135400      
002436                                   TO "SOPORTECOMS".              135500      
002437     CALL "CSIID OF SOPORTECOMS" USING WKS-DATOS-HOST.            135600      
002438     CHANGE ATTRIBUTE LIBACCESS    OF "CTRLVERS" TO BYFUNCTION.   135700      
002439     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".    135800      
002440                                                                  135820      
002441     CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION.     135840      
002442     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP".       135860      
002443                                                                  135880      
002444     MOVE WKS-NUMCSI                       TO W77-MI-CSI.         135900      
002445     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"  TO                     138500      
002446            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".      138600      
002447                                                                  138602      
002448*INICIA CODIGO DE RENOVACION CRONOS 2000                          138604      
002449     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          138606      
002450             A2K-ACCEPT-TODAYS-DATE-EXIT.                         138608      
002451     MOVE A2K-FEC-MDCA-001 TO WS-FECHA-MDA                        138610      
002452*TERMINA CODIGO DE RENOVACION CRONOS 2000                         138612      
002453                                                                  138614      
002454*INICIA CODIGO DE RENOVACION CRONOS 2000                          138616      
002455     MOVE WS-FECHA-MDA TO A2K-FEC-MDCA-001.                       138618      
002456     PERFORM A2K-CONV-MDCA-TO-CAMD THRU                           138620      
002457             A2K-CONV-MDCA-TO-CAMD-EXIT.                          138622      
002458     MOVE A2K-FEC-CAMD-001 TO WS-FECHA-AMD.                       138624      
002459*TERMINA CODIGO DE RENOVACION CRONOS 2000                         138626      
002460                                                                  138628      
002461     MOVE WKS-NUMCSI               TO WKS-TSK-NODO.               138630      
002462                                                                  138632      
002463*INICIA CODIGO DE RENOVACION CRONOS 2000                          138634      
002464$SET OMIT = OLDCODE                                               138636      
002465      MOVE WS-FECHA-AMD TO WKS-TSK-FECHA.                         138638      
002466$POP OMIT                                                         138640      
002467$SET OMIT = NOT OLDCODE                                           138642      
002468      MOVE ZEROS TO A2K-FEC-CAMD-001.                             138644      
002469      MOVE WS-FECHA-AMD TO A2K-FEC-CAMD-001.                      138646      
002470      PERFORM A2K-CONV-CAMD-TO-AMD THRU                           138648      
002471                A2K-CONV-CAMD-TO-AMD-EXIT.                        138650      
002472       MOVE A2K-FEC-AMD-001 TO WKS-TSK-FECHA.                     138652      
002473$POP OMIT                                                         138654      
002474*TERMINA CODIGO DE RENOVACION CRONOS 2000                         138656      
002475     MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WKS-TSK-MXNB.          138658      
002476     SET MYSELF (OPTION)           TO 1926.                       138660      
002477     SET MYSELF (FILECARDS)        TO WKS-TIT-TASKFILE.           138662      
002478                                                                  138664      
002479     PERFORM 09000-LIGA-L001.                                     138669      
002480     PERFORM 90000-FECHAS-L001.                                   138674      
002481     PERFORM 00100-RESIDENCIAS                                    138679      
002482             VARYING W77-IND FROM 1 BY 1                          138684      
002483             UNTIL   W77-IND > 12 OR                              138689      
002484                     WS-PROD-NUMERO(W77-IND) = 9999.              138694      
002485                                                                  138700      
002486     IF WKS-NUMCSI = 04 OR 32                                     138750      
002487        MOVE "S151L011C018"    TO     WKS-CTLVER-LIBID            138800      
002488        CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID        138810      
002489                                          WKS-CTLVER-NOMLIB       138820      
002490                                   GIVING W77-CTLVER-RSLT         138830      
002491        IF W77-CTLVER-RSLT = 0                                    138840      
002492           CHANGE ATTRIBUTE TITLE OF "LIB-L011018" TO             138850      
002493                                                WKS-CTLVER-NOMLIB 138860      
002494        ELSE                                                      138870      
002495           CHANGE ATTRIBUTE TITLE OF "LIB-L011018"  TO            138880      
002496                  "(S151)S151/OBJECT/L011/CONSMOVS018 ON CMEMP.". 138890      
002497                                                                  138900      
002498     IF WKS-NUMCSI = 04 OR 32                                     138910      
002499        MOVE LOW-VALUES               TO WS-ADMOV-MOVSXCAJA-L011  138920      
002500        CALL "MOVS3NIVEL IN LIB-L011018" USING                    138930      
002501             WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS.            138940      
002502                                                                  138950      
002503     IF WKS-NUMCSI = 10 OR 32                                     138951      
002504        MOVE "S151L011C502"    TO     WKS-CTLVER-LIBID            138952      
002505        CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID        138954      
002506                                          WKS-CTLVER-NOMLIB       138956      
002507                                   GIVING W77-CTLVER-RSLT         138958      
002508        IF W77-CTLVER-RSLT = 0                                    138960      
002509           CHANGE ATTRIBUTE TITLE OF "LIB-L011502" TO             138962      
002510                                                WKS-CTLVER-NOMLIB 138964      
002511        ELSE                                                      138966      
002512           CHANGE ATTRIBUTE TITLE OF "LIB-L011502"  TO            138968      
002513                  "(S151)S151/OBJECT/L011/CONSMOVS502 ON CMEMP.". 138970      
002514                                                                  138972      
002515     IF WKS-NUMCSI = 10 OR 32                                     138974      
002516        MOVE LOW-VALUES               TO WS-ADMOV-MOVSXCAJA-L011  138976      
002517        CALL "MOVS3NIVEL IN LIB-L011502" USING                    138978      
002518             WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS.            138980      
002519                                                                  140000      
002520     IF WKS-NUMCSI = 10 OR 32                                     140100      
002521        MOVE "S151L011C701"    TO     WKS-CTLVER-LIBID.           140152      
002522        CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID        140154      
002523                                    WKS-CTLVER-NOMLIB             140156      
002524                                    GIVING W77-CTLVER-RSLT        140158      
002525        IF W77-CTLVER-RSLT = 0                                    140160      
002526           CHANGE ATTRIBUTE TITLE OF "LIB-L011701" TO             140162      
002527                                             WKS-CTLVER-NOMLIB    140164      
002528        ELSE                                                      140166      
002529           CHANGE ATTRIBUTE TITLE OF "LIB-L011701"  TO            140168      
002530                  "(S151)S151/OBJECT/L011/CONSMOVS701 ON CMEMP.". 140170      
002531     IF WKS-NUMCSI = 10 OR 32                                     140172      
002532        MOVE LOW-VALUES        TO WS-ADMOV-MOVSXCAJA-L011         140174      
002533        CALL "MOVS3NIVEL IN LIB-L011701" USING                    140176      
002534             WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS.            140178      
002535                                                                  140180      
002536     MOVE "S151L011C264"    TO     WKS-CTLVER-LIBID.              140212      
002537     CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID           140214      
002538                                       WKS-CTLVER-NOMLIB          140216      
002539                                GIVING W77-CTLVER-RSLT.           140218      
002540     IF W77-CTLVER-RSLT = 0                                       140220      
002541        CHANGE ATTRIBUTE TITLE OF "LIB-L011264" TO                140222      
002542                                             WKS-CTLVER-NOMLIB    140224      
002543     ELSE                                                         140226      
002544        CHANGE ATTRIBUTE TITLE OF "LIB-L011264"  TO               140228      
002545               "(S151)S151/OBJECT/L011/CONSMOVS264 ON CMEMP.".    140230      
002546                                                                  140232      
002547     MOVE LOW-VALUES               TO WS-ADMOV-MOVSXCAJA-L011.    140234      
002548     CALL "MOVS3NIVEL IN LIB-L011264" USING                       140236      
002549          WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS.               140238      
002550                                                                  140300      
002551     IF WKS-NUMCSI = 4  OR 32                                     140400      
002552        MOVE "S151L011C404"    TO     WKS-CTLVER-LIBID            140402      
002553        CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID        140404      
002554                                          WKS-CTLVER-NOMLIB       140406      
002555                                   GIVING W77-CTLVER-RSLT         140410      
002556        IF W77-CTLVER-RSLT = 0                                    140412      
002557           CHANGE ATTRIBUTE TITLE OF "LIB-L011404" TO             140414      
002558                                             WKS-CTLVER-NOMLIB    140416      
002559        ELSE                                                      140418      
002560           CHANGE ATTRIBUTE TITLE OF "LIB-L011404"  TO            140420      
002561                  "(S151)S151/OBJECT/L011/CONSMOVS404 ON CMEMP.". 140422      
002562     IF WKS-NUMCSI = 4  OR 32                                     140424      
002563        MOVE LOW-VALUES            TO WS-ADMOV-MOVSXCAJA-L011     140426      
002564        CALL "MOVS3NIVEL IN LIB-L011404" USING                    140428      
002565              WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS.           140430      
002566*=============== L001 S501 ==============                         140440      
002567     IF W88-TELETON                                               140450      
002568        MOVE "S151L011C501"    TO   WKS-CTLVER-LIBID              140452      
002569        CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID        140454      
002570                                          WKS-CTLVER-NOMLIB       140456      
002571                                   GIVING W77-CTLVER-RSLT         140458      
002572        IF W77-CTLVER-RSLT = 0                                    140460      
002573           CHANGE ATTRIBUTE TITLE OF "LIB-L011501" TO             140462      
002574                                          WKS-CTLVER-NOMLIB       140464      
002575        ELSE                                                      140466      
002576           CHANGE ATTRIBUTE TITLE OF "LIB-L011501"  TO            140468      
002577                  "(S151)S151/OBJECT/L011/CONSMOVS501 ON CMEMP.". 140470      
002578     IF W88-TELETON                                               140472      
002579        MOVE LOW-VALUES            TO WS-ADMOV-MOVSXCAJA-L011     140474      
002580        CALL "MOVS3NIVEL IN LIB-L011501" USING                    140476      
002581             WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS.            140478      
002582                                                                  140480      
002583     MOVE "S151L011C500"    TO      WKS-CTLVER-LIBID.             140500      
002584     CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID           140600      
002585                                       WKS-CTLVER-NOMLIB          140700      
002586                                GIVING W77-CTLVER-RSLT.           140800      
002587     IF W77-CTLVER-RSLT = 0                                       140900      
002588        CHANGE ATTRIBUTE TITLE OF "LIB-L011500"  TO               141000      
002589                                             WKS-CTLVER-NOMLIB    141100      
002590     ELSE                                                         141200      
002591        CHANGE ATTRIBUTE TITLE OF "LIB-L011500"  TO               141300      
002592               "(S151)S151/OBJECT/L011/CONSMOVS500 ON CMEMP.".    141400      
002593                                                                  141500      
002594     MOVE LOW-VALUES               TO WS-ADMOV-MOVSXCAJA-L011.    141552      
002595     CALL "MOVS3NIVEL IN LIB-L011500" USING                       141554      
002596          WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS.               141556      
002597                                                                  144000      
002598     IF WKS-NUMCSI NOT = 10 AND NOT = 04                          144300      
002599        MOVE WKS-NUMCSI TO WS-CSI-403 WS-CSI-VAL                  144400      
002600                           WS-CSI-703.                            144500      
002601                                                                  144600      
002602     IF WKS-NUMCSI = 35                                           144700      
002603        MOVE 33                   TO WS-CSI-703.                  144800      
002604                                                                  144900      
002605*      ACCEPT WS-FECHA-MDA FROM TODAYS-DATE                       145000      
002606*INICIA CODIGO DE RENOVACION CRONOS 2000                          145001      
002607*    PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          145002      
002608*            A2K-ACCEPT-TODAYS-DATE-EXIT.                         145003      
002609*    MOVE A2K-FEC-MDCA-001 TO WS-FECHA-MDA                        145004      
002610*TERMINA CODIGO DE RENOVACION CRONOS 2000                         145005      
002611*    MOVE WS-FECHA-MDA-M           TO WS-FECHA-AMD-A.             145100      
002612*    MOVE WS-FECHA-MDA-D           TO WS-FECHA-AMD-M.             145200      
002613*    MOVE WS-FECHA-MDA-A           TO WS-FECHA-AMD-D.             145300      
002614*INICIA CODIGO DE RENOVACION CRONOS 2000                          145301      
002615*    MOVE WS-FECHA-MDA TO A2K-FEC-MDCA-001.                       145302      
002616*    PERFORM A2K-CONV-MDCA-TO-CAMD THRU                           145303      
002617*            A2K-CONV-MDCA-TO-CAMD-EXIT.                          145304      
002618*    MOVE A2K-FEC-CAMD-001 TO WS-FECHA-AMD.                       145305      
002619*TERMINA CODIGO DE RENOVACION CRONOS 2000                         145306      
002620*    MOVE WKS-NUMCSI               TO WKS-TSK-NODO.               145400      
002621*    MOVE WS-FECHA-AMD             TO WKS-TSK-FECHA.              145500      
002622*INICIA CODIGO DE RENOVACION CRONOS 2000                          145501      
002623*$SET OMIT = OLDCODE                                              145502      
002624*     MOVE WS-FECHA-AMD TO WKS-TSK-FECHA.                         145503      
002625*$POP OMIT                                                        145504      
002626*$SET OMIT = NOT OLDCODE                                          145505      
002627*     MOVE ZEROS TO A2K-FEC-CAMD-001.                             145506      
002628*     MOVE WS-FECHA-AMD TO A2K-FEC-CAMD-001.                      145507      
002629*     PERFORM A2K-CONV-CAMD-TO-AMD THRU                           145508      
002630*               A2K-CONV-CAMD-TO-AMD-EXIT.                        145509      
002631*      MOVE A2K-FEC-AMD-001 TO WKS-TSK-FECHA.                     145510      
002632*$POP OMIT                                                        145511      
002633*TERMINA CODIGO DE RENOVACION CRONOS 2000                         145512      
002634*    MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WKS-TSK-MXNB.          145600      
002635*    SET MYSELF (OPTION)           TO 1926.                       145700      
002636*    SET MYSELF (FILECARDS)        TO WKS-TIT-TASKFILE.           145800      
002637     MOVE "S151"                  TO SISTEMA-LJ.                  145900      
002638     MOVE "P030"                  TO PASO-LJ.                     146000      
002639     MOVE  002                    TO MTP-LJ.                      146100      
002640     MOVE "I"                     TO TIPO-LJ.                     146200      
002641     MOVE 020101                  TO CODIGO-LJ.                   146300      
002642     MOVE "INICIO DE PROCESO"     TO TEXTO-LJ.                    146400      
002643*    PERFORM 900900-DISPLAY.                                      146500      
002644*    PERFORM 09000-LIGA-L001.                                     146550      
002645*    PERFORM 00100-RESIDENCIAS                                    146560      
002646*            VARYING W77-IND FROM 1 BY 1                          146565      
002647*            UNTIL   W77-IND > 12 OR                              146570      
002648*                    WS-PROD-NUMERO(W77-IND) = 9999.              146575      
002649*    PERFORM 90000-FECHAS-L001.                                   146580      
002650     MOVE "S080BD01CON "          TO WKS-CTLVER-LIBID.            146600      
002651     CALL "DAME_TIT IN CTRLVERS"                                  146700      
002652          USING  WKS-CTLVER-LIBID, WKS-CTLVER-NOMLIB              146800      
002653          GIVING W77-CTLVER-RSLT.                                 146900      
002654                                                                  147000      
002655     IF W77-CTLVER-RSLT < 0                                       147100      
002656        MOVE "ERROR EN CTLVERS "  TO TEXTO-LJ                     147200      
002657        MOVE "O"                  TO TIPO-LJ                      147300      
002658        PERFORM 900900-DISPLAY                                    147400      
002659        CHANGE ATTRIBUTE TITLE OF "ESTRUCTURA" TO                 147500      
002660               "(S080)S080/OBJECT/LIBRARY/LIBEST ON BNA."         147600      
002661     ELSE                                                         147700      
002662        CHANGE ATTRIBUTE TITLE OF "ESTRUCTURA" TO                 147800      
002663               WKS-CTLVER-NOMLIB.                                 147900      
002664*RGV v                                                            147950      
002665     MOVE  0                   TO  WKS-SAL-OFICINA                148000      
002666                                   W77-RES-STRUCT.                148010      
002667     MOVE  71                  TO  WKS-ENT-CVERANGO.              148020      
002668     PERFORM                   00200-CARGA-SUC      UNTIL         148030      
002669                               W77-RES-STRUCT  > 1.               148050      
002670*RGV ^                                                            148070      
002671     CANCEL "CTRLVERS"                                            148100      
002672                                                                  148200      
002673*----                                                             148300      
002674     CHANGE ATTRIBUTE LIBACCESS    OF "DCILIBRARY"                148400      
002675                                   TO  BYFUNCTION.                148500      
002676*----                                                             148600      
002677     CHANGE ATTRIBUTE FUNCTIONNAME OF "DCILIBRARY"                148700      
002678                                   TO "COMSSUPPORT".              148800      
002679*----                                                             148900      
002680     ENABLE INPUT CS-COMS-IN KEY "ONLINE".                        149000      
002681*----                                                             149100      
002682     MOVE "OUTPUT OF LINEA" TO LS-COMS-AG-SALIDA-NAME.            149200      
002683     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               149300      
002684           USING LS-COMS-AG-SALIDA-NAME                           149400      
002685                 VALUE AGENDA                                     149500      
002686                 LS-COMS-AG-SALIDA-DESG                           149600      
002687           GIVING LS-COMS-RESULT.                                 149700      
002688     IF LS-COMS-OK                                                149800      
002689        NEXT SENTENCE                                             149900      
002690     ELSE                                                         150000      
002691        PERFORM 900000-FIN-MAL.                                   150100      
002692*----                                                             150200      
002693     MOVE CS-COMS-IN-PROGRAM TO LS-COMS-MY-PROGRAM-DESG           150300      
002694     CALL "GET-NAME-USING-DESIGNATOR OF DCILIBRARY"               150400      
002695           USING  LS-COMS-MY-PROGRAM-DESG                         150500      
002696                  LS-COMS-MY-PROGRAM-NAME                         150600      
002697           GIVING LS-COMS-RESULT.                                 150700      
002698     IF LS-COMS-OK                                                150800      
002699        NEXT SENTENCE                                             150900      
002700     ELSE                                                         151000      
002701        PERFORM 900000-FIN-MAL.                                   151100      
002702*----                                                             151200      
002703     MOVE "DEFAULTSTATION" TO LS-COMS-DEFSTATION-NAME.            151300      
002704     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               151400      
002705           USING LS-COMS-DEFSTATION-NAME                          151500      
002706                 VALUE STATION                                    151600      
002707                 LS-COMS-DEFSTATION-DESG                          151700      
002708           GIVING LS-COMS-RESULT.                                 151800      
002709     IF LS-COMS-OK                                                151900      
002710        NEXT SENTENCE                                             152000      
002711     ELSE                                                         152100      
002712        PERFORM 900000-FIN-MAL.                                   152200      
002713*---                                                              152300      
002714     MOVE "NOAPL"        TO LS-NOAPLINCLUDE-PARAMETRO             152400      
002715     CALL   "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"             152500      
002716            USING  LS-NOAPLINCLUDE-PARAMETRO                      152600      
002717                   VALUE PROGRAM                                  152700      
002718                   LS-NOAPLINCLUDE-DESG                           152800      
002719            GIVING LS-APLINCLUDE-RESULT.                          152900      
002720     IF NOT LS-APLINCLUDE-OK                                      153000      
002721        PERFORM 900000-FIN-MAL.                                   153100      
002722                                                                  153200      
002723*    MOVE WS-FECHA-MDA     TO WKS-FECHA1.                         154000      
002724*INICIA CODIGO DE RENOVACION CRONOS2000                           154001      
002725$SET OMIT = OLDCODE                                               154002      
002726     MOVE WS-FECHA-MDA     TO WKS-FECHA1.                         154003      
002727$POP OMIT                                                         154004      
002728$SET OMIT = NOT OLDCODE                                           154005      
002729      MOVE ZEROS TO A2K-FEC-MDCA-001.                             154006      
002730      MOVE WS-FECHA-MDA TO A2K-FEC-MDCA-001.                      154007      
002731      PERFORM A2K-CONV-MDCA-TO-MDA THRU                           154008      
002732                A2K-CONV-MDCA-TO-MDA-EXIT.                        154009      
002733      MOVE A2K-FEC-MDA-001 TO WKS-FECHA1.                         154010      
002734$POP OMIT                                                         154011      
002735*TERMINA CODIGO DE RENOVACION CRONOS 2000                         154012      
002736     MOVE "000001"         TO WKS-FECHA2.                         154100      
002737     MOVE 1                TO WKS-FORMATO.                        154200      
002738     MOVE 18               TO WKS-FUNCION.                        154300      
002739     PERFORM 09000-CALENDAR.                                      154400      
002740     IF WKS-FUNCION = ZEROS                                       154500      
002741        NEXT SENTENCE                                             154600      
002742     ELSE                                                         154700      
002743        DISPLAY "ERROR EN LLAMADO "WKS-FUNCION.                   154800      
002744     IF WKS-FECHA1 = ZEROS                                        154900      
002745*       MOVE WS-FECHA-MDA     TO WKS-FECHA1                       155000      
002746*INICIA CODIGO DE RENOVACION CRONOS 2000                          155001      
002747$SET OMIT = OLDCODE                                               155002      
002748     MOVE WS-FECHA-MDA     TO WKS-FECHA1                          155003      
002749$POP OMIT                                                         155004      
002750$SET OMIT = NOT OLDCODE                                           155005      
002751      MOVE ZEROS TO A2K-FEC-MDCA-001                              155006      
002752      MOVE WS-FECHA-MDA TO A2K-FEC-MDCA-001                       155007      
002753      PERFORM A2K-CONV-MDCA-TO-MDA THRU                           155008      
002754                A2K-CONV-MDCA-TO-MDA-EXIT                         155009      
002755      MOVE A2K-FEC-MDA-001 TO WKS-FECHA1                          155010      
002756$POP OMIT                                                         155011      
002757*TERMINA CODIGO DE RENOVACION CRONOS 2000                         155012      
002758        MOVE "000001"         TO WKS-FECHA2                       155100      
002759        MOVE 1                TO WKS-FORMATO                      155200      
002760        MOVE 13               TO WKS-FUNCION                      155300      
002761        PERFORM 09000-CALENDAR                                    155400      
002762        IF WKS-FUNCION = ZEROS                                    155500      
002763*          MOVE WKS-FECHA1    TO WS-FECHA-MDA                     155600      
002764*INICIA CODIGO DE RENOVACION CRONOS2000                           155601      
002765$SET OMIT = OLDCODE                                               155602      
002766           MOVE WKS-FECHA1    TO WS-FECHA-MDA                     155603      
002767$POP OMIT                                                         155604      
002768$SET OMIT = NOT OLDCODE                                           155605      
002769      MOVE ZEROS TO A2K-FEC-MDA-001                               155606      
002770      MOVE WKS-FECHA1 TO A2K-FEC-MDA-001                          155607      
002771      PERFORM A2K-CONV-MDA-TO-MDCA THRU                           155608      
002772                A2K-CONV-MDA-TO-MDCA-EXIT                         155609      
002773      MOVE A2K-FEC-MDCA-001 TO WS-FECHA-MDA                       155610      
002774$POP OMIT                                                         155611      
002775*TERMINA CODIGO DE RENOVACION CRONOS 2000                         155612      
002776        ELSE                                                      155700      
002777           DISPLAY "ERROR EN LLAMADO "WKS-FUNCION.                155800      
002778*    MOVE WS-FECHA-MDA-A  TO WS-FECHA-DMA-D                       155900      
002779*    MOVE WS-FECHA-MDA-M  TO WS-FECHA-DMA-M                       156000      
002780*    MOVE WS-FECHA-MDA-D  TO WS-FECHA-DMA-A                       156100      
002781*INICIA CODIGO DE RENOVACION CRONOS 2000                          156101      
002782     MOVE ZEROS TO A2K-FEC-MDCA-001.                              156102      
002783     MOVE WS-FECHA-MDA TO A2K-FEC-MDCA-001.                       156103      
002784     PERFORM A2K-CONV-MDCA-TO-CAMD THRU                           156104      
002785             A2K-CONV-MDCA-TO-CAMD-EXIT.                          156105      
002786     PERFORM A2K-CONV-CAMD-TO-DMCA THRU                           156106      
002787             A2K-CONV-CAMD-TO-DMCA-EXIT.                          156107      
002788     MOVE A2K-FEC-DMCA-001 TO WS-FECHA-DMA.                       156108      
002789*TERMINA CODIGO DE RENOVACION CRONOS 2000                         156109      
002790     MOVE WS-FECHA-DMA    TO 77-ADMOV-FECPROC.                    156200      
002791                                                                  156250      
002792*INICIA CODIGO DE RENOVACION CRONOS 2000   JMF                    156252      
002793     MOVE ZEROS TO A2K-FEC-DMCA-001.                              156254      
002794     MOVE WS-FECHA-DMA    TO A2K-FEC-DMCA-001.                    156256      
002795     PERFORM A2K-CONV-DMCA-TO-DMA THRU                            156258      
002796             A2K-CONV-DMCA-TO-DMA-EXIT.                           156260      
002797     MOVE A2K-FEC-DMA-001 TO 77-ADMOV-FECPROC-6DIG.               156262      
002798*TERMINA CODIGO DE RENOVACION CRONOS 2000  JMF                    156264      
002799                                                                  156270      
002800     MOVE ALL SPACES TO WS-MSG.                                   156300      
002801     MOVE "                  MOVIMIENTOS SISTEMA" TO WS-DS-FILLER.156400      
002802     MOVE SPACES  TO WS-DS-FILL.                                  156500      
002803     ACCEPT WS-HORA-INI FROM TIME.                                156600      
002804     ACCEPT WS-HORA-MAX FROM TIME.                                156700      
002805     ADD    2000 TO WS-HORA-MAX.                                  156800      
002806     ALLOW INTERRUPT.                                             156900      
002807     ATTACH INTERRUPT-BY-HI TO ATTRIBUTE EXCEPTIONEVENT OF MYSELF.157000      
002808                                                                  157100      
002809****   ENVIO DE MOVIMIENTO AL ACTBD PARA LEVANTAR EL ASINCRONO    157200      
002810                                                                  157300      
002811                                                                  157400      
002812     MOVE 50      TO      WS-MOV-FUNCION                          157500      
002813     MOVE 0       TO      WS-MOV-SUCURSAL                         157600      
002814                          WS-MOV-CAJA                             157700      
002815                          WS-MOV-INST                             157800      
002816                          WS-MOV-CUENTA                           157900      
002817                          WS-MOV-CONTROL                          158000      
002818                          WS-MOV-SUCPROM                          158100      
002819                          WS-MOV-SUCTRAN                          158200      
002820                          WS-MOV-REFER                            158300      
002821                          WS-MOV-IMPORTE                          158400      
002822                          WS-MOV-FECHAVALOR                       158500      
002823                          WS-MOV-HORA                             158600      
002824     MOVE 1       TO      WS-MOV-AUTORIZA                         158700      
002825                          WS-MOV-CLAVE                            158800      
002826                          WS-MOV-MONEDA                           158900      
002827     MOVE 151     TO      WS-MOV-SISTEMA                          159000      
002828     MOVE 1       TO      WS-LG-FUNCION                           159100      
002829                          WS-LG-ORIGEN                            159200      
002830     MOVE 10           TO WS-LG-CVETRAN1                          159300      
002831*JM  MOVE WS-FECHA-DMA TO WS-LG-FECCONT                           159400      
002832*INICIA CODIGO DE RENOVACION CRONOS 2000    JMF                   159450      
002833*    MOVE 77-ADMOV-FECPROC-6DIG   TO WS-LG-FECCONT                159452      
002834     MOVE 77-ADMOV-FECPROC-6DIG   TO WS-FECHA-DMA-6DIG            159453      
002835     MOVE WS-FEC-DMA-6DIG-A       TO WS-FEC-AMD-6DIG-A            159454      
002836     MOVE WS-FEC-DMA-6DIG-M       TO WS-FEC-AMD-6DIG-M            159455      
002837     MOVE WS-FEC-DMA-6DIG-D       TO WS-FEC-AMD-6DIG-D            159456      
002838     MOVE WS-FECHA-AMD-6DIG       TO WS-LG-FECCONT                159458      
002839*TERMINA CODIGO DE RENOVACION CRONOS 2000   JMF                   159460      
002840     MOVE 151     TO      WS-LG-SISTEMA                           159500      
002841     MOVE 1151         TO WS-LG-PRODUCTO.                         159600      
002842                                                                  159655      
002843     MOVE 0 TO WS-STATUS.                                         160700      
002844                                                                  163600      
002845     PERFORM 10000-PROCESO UNTIL WS-FIN = 1.                      163700      
002846     STOP RUN.                                                    163800      
002847                                                                  163805      
002848 00100-RESIDENCIAS.                                               163810      
002849*==================                                               163812      
002850     IF WS-PROD-NUMERO(W77-IND) = 3                               163814      
002851        NEXT SENTENCE                                             163816      
002852     ELSE                                                         163818      
002853        IF WS-PROD-NUMERO(W77-IND) = 1                            163820      
002854           MOVE 500                     TO WKS-B03-SISTEMA        163825      
002855        ELSE                                                      163830      
002856           MOVE WS-PROD-NUMERO(W77-IND) TO WKS-B03-SISTEMA.       163835      
002857                                                                  163838      
002858     IF WS-PROD-NUMERO(W77-IND) = 3                               163840      
002859        NEXT SENTENCE                                             163842      
002860     ELSE                                                         163844      
002861        MOVE 1                        TO     WKS-B03-FUNCION      163846      
002862        CALL "CONSISMEN IN LIB-L001"  USING  WKS-S151B03SISMEN    163848      
002863                                      GIVING W77-RESULT-LIBCON    163850      
002864        IF W77-RESULT-LIBCON = 0                                  163856      
002865           MOVE WKS-B03-MODSIS        TO WS-MODALIDAD(W77-IND)    163858      
002866           MOVE WKS-B03-RESCSI        TO WS-CSI-RES(W77-IND)      163860      
002867        ELSE                                                      163867      
002868           MOVE W77-MI-CSI            TO WS-CSI-RES(W77-IND).     163870      
002869                                                                  163880      
002870 00200-CARGA-SUC.                                                 163915      
002871*================                                                 163920      
002872*RGV v                                                            163922      
002873     MOVE  WKS-SAL-OFICINA        TO  WKS-ENT-OFICINA             163925      
002874     MOVE  0                      TO  W77-RES-STRUCT.             163930      
002875     CALL  "L120_NEXT_OFICINA     IN  ESTRUCTURA"          USING  163935      
002876           W77-NUMSIS                                             163936      
002877           W77-NUMPASO                                            163937      
002878           WKS-ENT-STRUCT                                         163938      
002879           WKS-SAL-STRUCT                                  GIVING 163939      
002880           W77-RES-STRUCT.                                        163940      
002881     IF  W77-RES-STRUCT           =   00 OR 01                    163941      
002882         MOVE WKS-SAL-OFICINA     TO  W77-SUC                     163942      
002883         IF W77-MI-CSI            =   32                   AND    163943      
002884            WKS-SAL-CSI           =   4                           163944      
002885            MOVE W77-MI-CSI       TO  WKS-CSIRES-SUC(W77-SUC)     163945      
002886         ELSE                                                     163950      
002887            MOVE WKS-SAL-CSI      TO  WKS-CSIRES-SUC(W77-SUC).    163954      
002888*      ELSE                                                       163956      
002889*         MOVE W77-MI-CSI          TO  WKS-CSIRES-SUC(W77-SUC).   163958      
002890*RGV ^                                                            163960      
002891 09000-CALENDAR.                                                  164000      
002892     CALL "THECALENDAR IN LOCSUP"                                 164100      
002893     USING WKS-FUNCION, WKS-FECHA1, WKS-FECHA2, WKS-FORMATO.      164200      
002894                                                                  164254      
002895 09000-LIGA-L001.                                                 164256      
002896*===============                                                  164258      
002897                                                                  164259      
002898     MOVE "S151L001CTL"   TO       WKS-CTLVER-LIBID.              164260      
002899     CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID           164262      
002900                                       WKS-CTLVER-NOMLIB          164264      
002901                                GIVING W77-CTLVER-RSLT.           164266      
002902     IF W77-CTLVER-RSLT = 0                                       164268      
002903        CHANGE ATTRIBUTE TITLE OF "LIB-L001" TO                   164270      
002904                                             WKS-CTLVER-NOMLIB    164272      
002905     ELSE                                                         164274      
002906        CHANGE ATTRIBUTE TITLE OF "LIB-L001"  TO                  164276      
002907               "(S151)S151/OBJECT/L001/CONTROL    ON CMEMP.".     164278      
002908                                                                  164280      
002909 90000-FECHAS-L001.                                               164300      
002910*==================                                               164305      
002911                                                                  164307      
002912     MOVE WKS-NUMCSI               TO WKS-B01-CSI.                164310      
002913                                                                  164311      
002914     MOVE 264                      TO WKS-B01-SISTEMA.            164312      
002915     MOVE 1                        TO WKS-B01-FUNCION.            164314      
002916     PERFORM 90010-L001-SISDIA.                                   164316      
002917     IF W77-RESULT-LIBCON = 0                                     164320      
002918        MOVE WKS-B01-FECCON        TO WKS-FECHA-S264              164322      
002919     ELSE                                                         164324      
002920        MOVE ZERO                  TO WKS-FECHA-S264.             164326      
002921                                                                  164328      
002922     MOVE 404                      TO WKS-B01-SISTEMA.            164330      
002923     MOVE 1                        TO WKS-B01-FUNCION.            164332      
002924     PERFORM 90010-L001-SISDIA.                                   164334      
002925     IF W77-RESULT-LIBCON = 0                                     164338      
002926        MOVE WKS-B01-FECCON        TO WKS-FECHA-S404              164340      
002927     ELSE                                                         164342      
002928        MOVE ZERO                  TO WKS-FECHA-S404.             164344      
002929     PERFORM 90020-L001-B04SIS.                                   164345      
002930     IF W88-TELETON                                               164346      
002931        MOVE 501                   TO WKS-B01-SISTEMA             164347      
002932        MOVE 1                     TO WKS-B01-FUNCION             164348      
002933        PERFORM 90010-L001-SISDIA                                 164349      
002934        IF W77-RESULT-LIBCON = 0                                  164350      
002935           MOVE WKS-B01-FECCON     TO WKS-FECHA-S501              164351      
002936*          IF WS-FECHA-AMD > WKS-B01-FECCON                       164352      
002937*             MOVE ZERO            TO W77-TELETON                 164353      
002938*          ELSE                                                   164355      
002939*             NEXT SENTENCE                                       164356      
002940        ELSE                                                      164357      
002941           MOVE ZERO               TO WKS-FECHA-S501.             164358      
002942     MOVE 701                      TO WKS-B01-SISTEMA.            164361      
002943     MOVE 1                        TO WKS-B01-FUNCION.            164362      
002944     PERFORM 90010-L001-SISDIA.                                   164363      
002945     IF W77-RESULT-LIBCON = 0                                     164366      
002946        MOVE WKS-B01-FECCON        TO WKS-FECHA-S701              164368      
002947     ELSE                                                         164370      
002948        MOVE ZERO                  TO WKS-FECHA-S701.             164372      
002949                                                                  164374      
002950     MOVE 500                      TO WKS-B01-SISTEMA.            164376      
002951     MOVE 1                        TO WKS-B01-FUNCION.            164378      
002952     PERFORM 90010-L001-SISDIA.                                   164380      
002953     IF W77-RESULT-LIBCON = 0                                     164384      
002954        MOVE WKS-B01-FECCON        TO WKS-FECHA-S500              164386      
002955     ELSE                                                         164388      
002956        MOVE ZERO                  TO WKS-FECHA-S500.             164390      
002957                                                                  164394      
002958     MOVE 018                      TO WKS-B01-SISTEMA.            164396      
002959     MOVE 1                        TO WKS-B01-FUNCION.            164398      
002960     PERFORM 90010-L001-SISDIA.                                   164400      
002961     IF W77-RESULT-LIBCON = 0                                     164404      
002962        MOVE WKS-B01-FECCON        TO WKS-FECHA-S018              164406      
002963     ELSE                                                         164408      
002964        MOVE ZERO                  TO WKS-FECHA-S018.             164410      
002965                                                                  164420      
002966     MOVE 502                      TO WKS-B01-SISTEMA.            164422      
002967     MOVE 1                        TO WKS-B01-FUNCION.            164424      
002968     PERFORM 90010-L001-SISDIA.                                   164426      
002969     IF W77-RESULT-LIBCON = 0                                     164430      
002970        MOVE WKS-B01-FECCON        TO WKS-FECHA-S502              164432      
002971     ELSE                                                         164434      
002972        MOVE ZERO                  TO WKS-FECHA-S502.             164436      
002973                                                                  164438      
002974     CANCEL "LIB-L001".                                           164440      
002975                                                                  164450      
002976 90010-L001-SISDIA.                                               164455      
002977*=========================                                        164460      
002978    CALL "CONSISDIA IN LIB-L001"  USING  WKS-S151B01SISDIA        164465      
002979                                  GIVING W77-RESULT-LIBCON.       164470      
002980                                                                  164475      
002981 90020-L001-B04SIS.                                               164477      
002982*==================                                               164479      
002983    MOVE ZERO                     TO W77-TELETON.                 164480      
002984    MOVE 1                        TO WKS-B04-FUNCION.             164481      
002985    MOVE 501                      TO WKS-B04-SISTEMA.             164482      
002986    MOVE ZERO                     TO WKS-B04-PRODUCTO,            164483      
002987                                     WKS-B04-INSTRUM .            164484      
002988    CALL "B04SISTEM IN LIB-L001"  USING  WKS-B04SISTEMA           164485      
002989                                  GIVING W77-RESULT-LIBCON.       164486      
002990                                                                  164487      
002991    IF W77-RESULT-LIBCON = 0 THEN                                 164488      
002992       IF WKS-B04-ESTATUS   = 3 THEN                              164489      
002993          MOVE 1                  TO W77-TELETON                  164490      
002994          MOVE 501                TO WS-PROD-NUMERO(8)            164491      
002995          MOVE 9999               TO WS-PROD-NUMERO(9)            164492      
002996       ELSE                                                       164494      
002997          MOVE 9999               TO WS-PROD-NUMERO (8).          164496      
002998/                                                                 164498      
002999 10000-PROCESO.                                                   164500      
003000*=============                                                    164600      
003001    PERFORM 10100-ACEPTA-MSG THRU 10100-END.                      164700      
003002    MOVE "I" TO TIPO-LJ.                                          164800      
003003    MOVE 050110 TO CODIGO-LJ.                                     164900      
003004    ACCEPT WS-HORA-MAQUINA FROM TIME.                             165000      
003005    IF WS-MON = 1                                                 165100      
003006       STRING "* ENTRADA:",WS-MSG DELIMITED BY SIZE INTO          165200      
003007              REG-MONITOREO                                       165300      
003008      WRITE REG-MONITOREO                                         165400      
003009      DISPLAY  REG-MONITOREO.                                     165500      
003010    PERFORM 20000-PROCESA-MENSAJE.                                165600      
003011 10100-ACEPTA-MSG.                                                165700      
003012     MOVE ZERO TO WS-CONTROL.                                     165800      
003013     CALL "ESPERACOMS OF SOPORTECOMS"                             165900      
003014           USING  LS-ESPERACOMS-TIEMPO                            166000      
003015           GIVING LS-ESPERACOMS-TIPO-EVENTO.                      166100      
003016                                                                  166200      
003017     IF LS-POR-MSG                                                166300      
003018        NEXT SENTENCE                                             166400      
003019     ELSE                                                         166500      
003020        IF LS-POR-ACCEPT                                          166600      
003021           ACCEPT AX-SCRATCH                                      166700      
003022           MOVE 1         TO WS-CONTROL                           166800      
003023        ELSE                                                      166900      
003024        IF LS-POR-HI                                              167000      
003025           IF WS-HI-FIN-NORMAL OR WS-HI-FIN-EMERGENCIA OR         167100      
003026              WS-HI-BAJACOPIA                                     167200      
003027              PERFORM 999999-FIN                                  167300      
003028              MOVE 1            TO WS-CONTROL                     167400      
003029           ELSE                                                   167500      
003030              MOVE 1            TO WS-CONTROL                     167600      
003031        ELSE                                                      167700      
003032        IF LS-POR-TIMEOUT                                         167800      
003033           MOVE 1         TO WS-CONTROL.                          167900      
003034******* ELSE                                                      168000      
003035******* IF LS-POR-EVENTO                                          168100      
003036*********  MOVE WS-V-EOP TO WS-CONTROL                            168200      
003037********   MOVE 1        TO WS-FIN.                               168300      
003038                                                                  168400      
003039*****MOVE LOW-VALUES TO WS-HI-INTERRUPT                           168500      
003040     IF WS-CONTROL = ZEROS                                        168600      
003041        RECEIVE CS-COMS-IN MESSAGE INTO WS-MSG-COMS               168700      
003042        IF CS-COMS-IN-STATUS-KEY = 99                             168800      
003043           STOP RUN                                               168900      
003044        ELSE                                                      169000      
003045        IF CS-COMS-IN-STATUS-KEY = 0 OR 89 OR 92 OR 93            169100      
003046           MOVE WS-HEADER-COMS            TO WS-HEADER            169200      
003047           IF WS-HDR-COMS-LST-ORG-R IS NUMERIC                    169300      
003048              MOVE WS-HDR-COMS-LST-ORG-R TO WS-HDR-LST-ORG-AUX-R  169400      
003049           ELSE                                                   169500      
003050              MOVE WS-HDR-COMS-LST-ORG      TO WS-HDR-LST-ORG-AUX.169600      
003051     IF WS-CONTROL = ZEROS                                        169700      
003052        IF CS-COMS-IN-STATUS-KEY = 0 OR 89 OR 92 OR 93            169800      
003053***********IF WS-HDR-APL-ORG = "G"                                169900      
003054              MOVE WS-TEXTO-COMS-SA2      TO WS-TEXTO             170000      
003055***********ELSE                                                   170100      
003056***********   MOVE WS-TEXTO-COMS          TO WS-TEXTO             170200      
003057        ELSE                                                      170300      
003058           MOVE " >> ERROR RECEIVE MSG >>> " TO TEXTO-LJ          170400      
003059           PERFORM 900900-DISPLAY                                 170500      
003060           MOVE WS-MSG-COMS                  TO TEXTO-LJ          170600      
003061           PERFORM 900900-DISPLAY                                 170700      
003062           MOVE 1        TO WS-CONTROL.                           170800      
003063                                                                  170900      
003064                                                                  171000      
003065     IF WS-CONTROL = ZEROS                                        171100      
003066        IF MSG-DE-RED OR MSG-DE-APLICACION OR MSG-DE-ERRORES      171200      
003067           NEXT SENTENCE                                          171300      
003068        ELSE                                                      171400      
003069          MOVE "RESULT DEL HEADER NO TRATADO " TO TEXTO-LJ        171500      
003070          PERFORM 900900-DISPLAY                                  171600      
003071          MOVE WS-MSG-COMS                     TO TEXTO-LJ        171700      
003072          PERFORM 900900-DISPLAY                                  171800      
003073          MOVE 1        TO WS-CONTROL.                            171900      
003074     IF WS-CONTROL = 1                                            172000      
003075        GO TO 10100-ACEPTA-MSG.                                   172100      
003076 10100-END.                                                       172200      
003077     EXIT.                                                        172300      
003078 20000-PROCESA-MENSAJE.                                           172400      
003079    ADD 1 TO WS-NUM-CON.                                          172500      
003080    PERFORM 20001-LIMPIA-CAMPOS.                                  172600      
003081    MOVE 55 TO WS-OPE-FUNCION.                                    172700      
003082    MOVE ZEROS                 TO WS-STATUS.                      174300      
003083                                                                  174400      
003084    IF WS-TXT-FUN = 506                                           174500      
003085       MOVE 0 TO WS-STATUS.                                       174600      
003086    IF WS-STATUS = 0 OR WS-OPE-PRI                                174700      
003087       MOVE WS-OPE-CVESUP TO WS-CVE-SUP                           174800      
003088       MOVE 60 TO WS-DE-LOOP-ESPACIOS WS-DE-LOOP-CARACTER         174900      
003089       PERFORM 20100-QUITA-ESPACIOS                               175000      
003090          UNTIL  WS-IND-SCR = WS-DE-LOOP-CARACTER                 175100      
003091       PERFORM 20200-TRANSACCIONES                                175200      
003092    ELSE                                                          175300      
003093       IF WS-STATUS = 4                                           175400      
003094          MOVE 12 TO WS-RESPERROR                                 175500      
003095       ELSE                                                       175600      
003096          MOVE 1  TO WS-RESPERROR.                                175700      
003097                                                                  175710      
003098    IF WS-PREFIJO-DESTINO = 040310                                175750      
003099       NEXT SENTENCE                                              175752      
003100    ELSE                                                          175754      
003101    IF WS-RESPERROR > 0                                           175800      
003102       PERFORM 30000-RESPONDE-MAL.                                175900      
003103    PERFORM 40000-SENDCOMS.                                       176000      
003104                                                                  176050      
003105 20001-LIMPIA-CAMPOS.                                             176100      
003106    MOVE SPACES TO WS-DE-CVE-SUP.                                 176200      
003107    MOVE 0 TO WS-DE-CAJA,WS-DE-SUCURSAL,WS-DE-CUENTA,WS-DE-CONTROL176300      
003108              WS-DE-AUTOR,WS-CUENTA.                              176400      
003109    MOVE 0 TO WS-RESPERROR.                                       176500      
003110    MOVE 1 TO WS-LONG-MSG.                                        176600      
003111    MOVE 0 TO WS-STATUS WS-CONT-SCR WS-RESPERROR.                 176700      
003112    MOVE 10 TO WS-IND-SCR.                                        176800      
003113    MOVE ALL "0" TO WS-OPERADORES,W77-RES-STRUCT,                 176900      
003114                    WS-DS-DATOS-SALIDA.                           176950      
003115    MOVE ALL SPACES TO WS-DATOS-RESPUESTA WS-REM-TEXTO-SE.        177000      
003116    MOVE 0 TO WKS-SAL-CSI WS-DIRECCIONA WS-IND2.                  177100      
003117    PERFORM 20002-LIMPI-TABLA VARYING WS-IND FROM 1 BY 1          177200      
003118                               UNTIL WS-IND > 10.                 177300      
003119 20002-LIMPI-TABLA.                                               177400      
003120    MOVE 0 TO WS-DS-CTA-SUCUR(WS-IND) , WS-DS-CTA-CAJA(WS-IND)    177500      
003121              WS-DS-CTA-CVET(WS-IND)  , WS-DS-CTA-REF(WS-IND)     177600      
003122              WS-DS-CTA-SDO (WS-IND)  , WS-DS-CTA-HR (WS-IND)     177700      
003123              WS-DS-CTA-SIS (WS-IND)  , WS-DS-CTA-MM (WS-IND)     177800      
003124              WS-DS-CAJA-AUTOT(WS-IND) , WS-DS-CAJA-AUTOT(11)     177900      
003125              WS-DS-CAJA-SPROM(WS-IND) , WS-DS-CAJA-AUTOT(12)     178000      
003126              WS-DS-CAJA-SPROM(11)     , WS-DS-CAJA-SPROM(12)     178100      
003127              WS-DS-CAJA-CTA(WS-IND)   , WS-DS-CAJA-CTA  (11)     178200      
003128              WS-DS-CAJA-CVET(WS-IND)  , WS-DS-CAJA-CTA  (12)     178300      
003129              WS-DS-CAJA-CVET(11)      , WS-DS-CAJA-CVET (12)     178400      
003130              WS-DS-CAJA-REFER(WS-IND) , WS-DS-CAJA-REFER(11)     178500      
003131              WS-DS-CAJA-SDO  (WS-IND) , WS-DS-CAJA-REFER(12)     178600      
003132              WS-DS-CAJA-SDO  (11)     , WS-DS-CAJA-SDO  (12)     178700      
003133              WS-DS-CAJA-HR (WS-IND)   , WS-DS-CAJA-HR   (12)     178800      
003134              WS-DS-CAJA-HR (11)       , WS-DS-CAJA-MM   (12)     178900      
003135              WS-DS-CAJA-MM (WS-IND)   , WS-DS-CAJA-MM   (11).    178910      
003136    MOVE ":"  TO WS-DS-DOS-PUNTOS(WS-IND) WS-DS-2-PUNTOS(WS-IND)  178920      
003137                                          WS-DS-2-PUNTOS(11)      178940      
003138                                          WS-DS-2-PUNTOS(12)      178960      
003139    MOVE ALL "0" TO WS-SIS-CAJA-TABLA(WS-IND)                     179000      
003140                    WS-SIS-CTA-TABLA(WS-IND)                      179100      
003141                    WS-SIS-CAJA-TABLA(11)                         179200      
003142                    WS-SIS-CAJA-TABLA(12) .                       179300      
003143 20100-QUITA-ESPACIOS.                                            179400      
003144    ADD 1 TO WS-IND-SCR.                                          179500      
003145    IF (WS-REM-TEXTO-CHAR ( WS-IND-SCR ) = SPACES ) AND           179600      
003146       (WS-IND-SCR < WS-DE-LOOP-ESPACIOS)                         179700      
003147       NEXT SENTENCE                                              179800      
003148    ELSE                                                          179900      
003149       ADD 1 TO WS-CONT-SCR                                       180000      
003150       MOVE WS-REM-TEXTO-CHAR(WS-IND-SCR) TO                      180100      
003151         WS-REM-TEXTO-SE-CHAR(WS-CONT-SCR).                       180200      
003152******************************************************************180300      
003153*                    DISTRIBUYE MENSAJE                          *180400      
003154******************************************************************180500      
003155 20200-TRANSACCIONES.                                             180600      
003156    MOVE ZERO                     TO W77-DIALOGO.                 180610      
003157    IF WS-PREFIJO-DESTINO = 015130 AND                            180700      
003158       WS-PREFIJO-ORIGEN  = 040310                                180750      
003159       IF WS-SA2-DESTINO-SUBCODSERV = 001                         180754      
003160          PERFORM 22000-CONSULTA-TOTALES                          180756      
003161       ELSE                                                       180758      
003162       IF WS-SA2-DESTINO-SUBCODSERV = 002                         180760      
003163          PERFORM 23000-CONSULTA-MOVIMIENTOS                      180762      
003164       ELSE                                                       180764      
003165          PERFORM 29000-RESPONDE-ERROR                            180766      
003166    ELSE                                                          180768      
003167    IF WS-HDR-APL-ORG = "G"                                       180788      
003168       IF WS-SA2-DESTINO-SUBCODSERV = 003                         180800      
003169          PERFORM 21000-CONSULTA-PRODUCTOS                        180900      
003170       ELSE                                                       181000      
003171       IF WS-SA2-DESTINO-SUBCODSERV = 001                         181100      
003172          PERFORM 22000-CONSULTA-TOTALES                          181200      
003173       ELSE                                                       181300      
003174       IF WS-SA2-DESTINO-SUBCODSERV = 002                         181400      
003175          PERFORM 23000-CONSULTA-MOVIMIENTOS                      181500      
003176       ELSE                                                       181600      
003177       IF WS-SA2-DESTINO-SUBCODSERV = 004                         181700      
003178          PERFORM 24000-SOLICITUD-COMPENSACION                    181800      
003179       ELSE                                                       181900      
003180       IF WS-SA2-DESTINO-SUBCODSERV = 005                         182000      
003181          PERFORM 25000-SOLICITUD-MOVESPECIFICO                   182100      
003182       ELSE                                                       182200      
003183          PERFORM 29000-RESPONDE-ERROR                            182300      
003184    ELSE                                                          182400      
003185    IF WS-CONXPAN = ZEROS                                         182500      
003186       IF WS-TXT-FUN = 502                                        182600      
003187          PERFORM 20210-CONSULTA-POR-CUENTA                       182700      
003188       ELSE IF WS-TXT-FUN = 503  OR  504                          182800      
003189          PERFORM 20220-CONSULTA-POR-CAJA                         182900      
003190       ELSE IF WS-TXT-FUN = 505                                   183000      
003191          PERFORM 20230-CONSULTA-TOTALES                          183100      
003192       ELSE IF WS-TXT-FUN = 506                                   183200      
003193          PERFORM 20240-CONSULTA-SALDOS                           183300      
003194       ELSE                                                       183400      
003195          MOVE 2 TO WS-RESPERROR                                  183500      
003196    ELSE                                                          183600      
003197    IF WS-CONXPAN = 1                                             183700      
003198       IF WS-TXT-FUN = 502                                        183800      
003199          MOVE 20 TO WS-RESPERROR                                 183900      
003200       ELSE                                                       184000      
003201       IF WS-TXT-FUN = 503                                        184100      
003202          MOVE 21 TO WS-RESPERROR                                 184200      
003203       ELSE                                                       184300      
003204       IF WS-TXT-FUN = 504                                        184400      
003205          MOVE 22 TO WS-RESPERROR                                 184500      
003206       ELSE                                                       184600      
003207       IF WS-TXT-FUN = 505                                        184700      
003208          MOVE 23 TO WS-RESPERROR                                 184800      
003209       ELSE                                                       184900      
003210       IF WS-TXT-FUN = 506                                        185000      
003211          MOVE 25 TO WS-RESPERROR                                 185100      
003212       ELSE                                                       185200      
003213          MOVE 2 TO WS-RESPERROR.                                 185300      
003214                                                                  185400      
003215*20201-UNIFICA-CSI.                                               185500      
003216*   IF WS-TXT-FUN = 503 OR 504                                    185600      
003217*      UNSTRING WS-REM-TEXTO-SE DELIMITED BY WS-FS OR "@" INTO    185700      
003218*               WS-DE-SUCURSAL WS-DE-CAJA WS-DE-SISTEMA           185800      
003219*      PERFORM 20202-SEND                                         185900      
003220*   ELSE IF WS-TXT-FUN = 505                                      186000      
003221*      UNSTRING WS-REM-TEXTO-SE DELIMITED BY WS-FS OR "@" INTO    186100      
003222*               WS-DE-CSI WS-DE-SUCURSAL WS-DE-CAJA WS-DE-SISTEMA 186200      
003223*      PERFORM 20202-SEND.                                        186300      
003224*20202-SEND.                                                      186400      
003225*   IF WS-DE-SISTEMA = 264 OR 600                                 186500      
003226*      IF WS-HDR-CCR-DES = 05                                     186600      
003227*         MOVE 06 TO WS-DE-CSI                                    186700      
003228*         MOVE WS-TEXTO TO WS-REM-TEXTO-SE                        186800      
003229*         STRING WS-HOME, WS-POS,                                 186900      
003230*                "MENSAJE ENVIADO A C.S.I., ESPERE P.F.",         187000      
003231*                WS-ETX DELIMITED BY SIZE INTO                    187100      
003232*                WS-DATOS-RESPUESTA WITH POINTER                  187200      
003233*                WS-LONG-MSG                                      187300      
003234*         PERFORM 40000-SENDCOMS                                  187400      
003235*         MOVE WS-REM-TEXTO-SE TO WS-TEXTO                        187500      
003236*         MOVE WS-DE-CSI TO WS-HDR-CCR-DES                        187600      
003237*         MOVE 2         TO WS-HDR-RES                            187700      
003238*         MOVE  1 TO WS-DIRECCIONA.                               187800      
003239***********************************************************       187900      
003240*                                                         *       188000      
003241*               20210-CONSULTA-POR-CUENTA                 *       188100      
003242*                                                         *       188200      
003243***********************************************************       188300      
003244 20210-CONSULTA-POR-CUENTA.                                       188400      
003245    IF WS-MON = 1                                                 188500      
003246       DISPLAY "STRING "  WS-REM-TEXTO-SE.                        188600      
003247    UNSTRING WS-REM-TEXTO-SE DELIMITED BY WS-FS OR "@" INTO       188700      
003248*             WS-DE-CVE-SUP                                       188800      
003249******        WS-DE-CONTROL2                                      188900      
003250******        WS-DE-NIMP                                          189000      
003251              WS-DE-SUCURSAL                                      189100      
003252              WS-DE-CUENTA                                        189200      
003253              WS-DE-SISTEMA                                       189300      
003254              WS-DE-CONTROL.                                      189400      
003255*   IF WS-CVE-SUP NOT = WS-DE-CVE-SUP                             189500      
003256*      MOVE 3 TO WS-RESPERROR                                     189600      
003257*   ELSE                                                          189700      
003258    IF (WS-DE-SUCURSAL-ALFA IS NOT NUMERIC) OR                    189800      
003259         WS-DE-SUCURSAL < 1                                       189900      
003260        MOVE 4 TO WS-RESPERROR.                                   190000      
003261    IF WS-RESPERROR = 0                                           190100      
003262       IF WS-DE-CUENTA-ALFA IS NOT NUMERIC                        190200      
003263          MOVE 8 TO WS-RESPERROR.                                 190300      
003264                                                                  190400      
003265    IF WS-DE-SISTEMA-ALFA IS NOT NUMERIC                          190500      
003266       MOVE 13 TO WS-RESPERROR.                                   190600      
003267    IF WS-DE-SISTEMA = ZEROS                                      190700      
003268         MOVE 001 TO WS-DE-SISTEMA.                               190800      
003269    IF WS-RESPERROR = 0                                           190900      
003270       IF WS-DE-CONTROL > 0                                       191000      
003271          IF WS-DE-CONTROL-ALFA IS NOT NUMERIC                    191100      
003272             MOVE 6 TO WS-RESPERROR.                              191200      
003273    IF WS-RESPERROR = 0                                           191300      
003274       PERFORM 50000-LIBEST                                       191400      
003275       IF WKS-SAL-CSI = WS-HDR-CCR-DES OR WS-HDR-CCR-DES > 30     191500      
003276          IF WS-RESPERROR = 0                                     191600      
003277             PERFORM 20211-CARGA-LIB-502                          191700      
003278             IF WS-RESPERROR = 0                                  191800      
003279                PERFORM 20212-ARMA-RESPUESTA                      191900      
003280             ELSE                                                 192000      
003281                NEXT SENTENCE                                     192100      
003282          ELSE                                                    192200      
003283             NEXT SENTENCE                                        192300      
003284       ELSE                                                       192400      
003285          MOVE WKS-SAL-CSI TO WS-HDR-CCR-DES                      192500      
003286          MOVE 2      TO WS-HDR-RES                               192600      
003287          MOVE 1      TO WS-DIRECCIONA.                           192700      
003288                                                                  192755      
003289 20211-CARGA-LIB-502.                                             192800      
003290*====================                                             192855      
003291                                                                  192860      
003292    MOVE 7 TO WS-RESPERROR.                                       198600      
003293                                                                  198655      
003294 20212-ARMA-RESPUESTA.                                            198700      
003295*=====================                                            198755      
003296                                                                  198760      
003297    MOVE 0 TO WS-IND2 WS-STATUS-MOV.                              198800      
003298    MOVE WS-SIS-CTA-CTROL TO WS-DS-CTRL-AUT.                      198900      
003299    IF WS-DE-SISNVO                                               199000      
003300       MOVE 1 TO WS-STATUS-MOV                                    199100      
003301       MOVE WS-MXCTA-NUMAUT TO WS-DS-CTRL-AUT                     199200      
003302       PERFORM 20213-MUEVE-MXCTA VARYING WS-IND FROM 1 BY 1       199300      
003303                                   UNTIL WS-IND > 10.             199400      
003304    MOVE 0 TO WS-IND2 WS-IND.                                     199500      
003305                                                                  199600      
003306    PERFORM 20213-CARGA-TABLA VARYING WS-IND FROM 1 BY 1 UNTIL    199700      
003307                                       WS-IND > 10.               199800      
003308    IF WS-IND2 < 10                                               199900      
003309       MOVE 0 TO WS-SIS-CTA-CTROL WS-DS-CTRL-AUT.                 200000      
003310*      MOVE SPACES TO WS-DE-CVE-SUP.                              200100      
003311    STRING WS-CLEAR                                               200200      
003312*          WS-DE-CVE-SUP                                          200300      
003313           WS-DESPROTEGE                                          200400      
003314********** WS-POS-03-23                                           200500      
003315***********WS-DE-CONTROL2                                         200600      
003316           WS-POS-03-36                                           200700      
003317***********WS-DE-NIMP                                             200800      
003318           WS-PROTEGE                                             200900      
003319           WS-DE-SUCURSAL                                         201000      
003320           WS-DE-CUENTA                                           201100      
003321           WS-DE-SISTEMA                                          201200      
003322           WS-DS-CTRL-AUT                                         201300      
003323*          WS-SIS-CTA-CTROL                                       201400      
003324           " "                                                    201500      
003325           WS-DS-CTA-SUCUR(1),WS-DS-CTA-CAJA(1),WS-DS-CTA-SIS(1)  201600      
003326           WS-DS-CTA-AUTO(1)                                      201700      
003327           WS-DS-CTA-CVET(1) ,WS-DS-CTA-REF(1) ,WS-DS-CTA-SDO(1)  201800      
003328           WS-DS-CTA-HR  (1) ,WS-DS-DOS-PUNTOS(1),WS-DS-CTA-MM(1) 201900      
003329           WS-DS-CTA-SUCUR(2),WS-DS-CTA-CAJA(2),WS-DS-CTA-SIS(2)  202000      
003330           WS-DS-CTA-AUTO(2)                                      202100      
003331           WS-DS-CTA-CVET(2) ,WS-DS-CTA-REF(2) ,WS-DS-CTA-SDO(2)  202200      
003332           WS-DS-CTA-HR  (2) ,WS-DS-DOS-PUNTOS(2),WS-DS-CTA-MM(2) 202300      
003333           WS-DS-CTA-SUCUR(3),WS-DS-CTA-CAJA(3),WS-DS-CTA-SIS(3)  202400      
003334           WS-DS-CTA-AUTO(3)                                      202500      
003335           WS-DS-CTA-CVET(3) ,WS-DS-CTA-REF(3) ,WS-DS-CTA-SDO(3)  202600      
003336           WS-DS-CTA-HR  (3) ,WS-DS-DOS-PUNTOS(3),WS-DS-CTA-MM(3) 202700      
003337           WS-DS-CTA-SUCUR(4),WS-DS-CTA-CAJA(4),WS-DS-CTA-SIS(4)  202800      
003338           WS-DS-CTA-AUTO(4)                                      202900      
003339           WS-DS-CTA-CVET(4) ,WS-DS-CTA-REF(4) ,WS-DS-CTA-SDO(4)  203000      
003340           WS-DS-CTA-HR  (4) ,WS-DS-DOS-PUNTOS(4),WS-DS-CTA-MM(4) 203100      
003341           WS-DS-CTA-SUCUR(5),WS-DS-CTA-CAJA(5),WS-DS-CTA-SIS(5)  203200      
003342           WS-DS-CTA-AUTO(5)                                      203300      
003343           WS-DS-CTA-CVET(5) ,WS-DS-CTA-REF(5) ,WS-DS-CTA-SDO(5)  203400      
003344           WS-DS-CTA-HR  (5) ,WS-DS-DOS-PUNTOS(5),WS-DS-CTA-MM(5) 203500      
003345           WS-DS-CTA-SUCUR(6),WS-DS-CTA-CAJA(6),WS-DS-CTA-SIS(6)  203600      
003346           WS-DS-CTA-AUTO(6)                                      203700      
003347           WS-DS-CTA-CVET(6) ,WS-DS-CTA-REF(6) ,WS-DS-CTA-SDO(6)  203800      
003348           WS-DS-CTA-HR  (6) ,WS-DS-DOS-PUNTOS(6),WS-DS-CTA-MM(6) 203900      
003349           WS-DS-CTA-SUCUR(7),WS-DS-CTA-CAJA(7),WS-DS-CTA-SIS(7)  204000      
003350           WS-DS-CTA-AUTO(7)                                      204100      
003351           WS-DS-CTA-CVET(7) ,WS-DS-CTA-REF(7) ,WS-DS-CTA-SDO(7)  204200      
003352           WS-DS-CTA-HR  (7) ,WS-DS-DOS-PUNTOS(7),WS-DS-CTA-MM(7) 204300      
003353           WS-DS-CTA-SUCUR(8),WS-DS-CTA-CAJA(8),WS-DS-CTA-SIS(8)  204400      
003354           WS-DS-CTA-AUTO(8)                                      204500      
003355           WS-DS-CTA-CVET(8) ,WS-DS-CTA-REF(8) ,WS-DS-CTA-SDO(8)  204600      
003356           WS-DS-CTA-HR  (8) ,WS-DS-DOS-PUNTOS(8),WS-DS-CTA-MM(8) 204700      
003357           WS-DS-CTA-SUCUR(9),WS-DS-CTA-CAJA(9),WS-DS-CTA-SIS(9)  204800      
003358           WS-DS-CTA-AUTO(9)                                      204900      
003359           WS-DS-CTA-CVET(9) ,WS-DS-CTA-REF(9) ,WS-DS-CTA-SDO(9)  205000      
003360           WS-DS-CTA-HR  (9) ,WS-DS-DOS-PUNTOS(9),WS-DS-CTA-MM(9) 205100      
003361        WS-DS-CTA-SUCUR(10),WS-DS-CTA-CAJA(10),WS-DS-CTA-SIS(10)  205200      
003362        WS-DS-CTA-AUTO(10)                                        205300      
003363          WS-DS-CTA-CVET(10),WS-DS-CTA-REF(10),WS-DS-CTA-SDO(10)  205400      
003364           WS-DS-CTA-HR(10) ,WS-DS-DOS-PUNTOS(10),WS-DS-CTA-MM(10)205500      
003365           "    ",                                                205600      
003366           "                        MOVIMIENTOS   DE   CUENTA   ",205700      
003367            WS-TAB,                                               205800      
003368           WS-ETX                                                 205900      
003369           DELIMITED BY SIZE INTO WS-DATOS-RESPUESTA              206000      
003370           WITH POINTER WS-LONG-MSG.                              206100      
003371                                                                  206200      
003372 20213-MUEVE-MXCTA.                                               206300      
003373     MOVE WS-MXCTA-SECAPLI(WS-IND) TO WS-SIS-CTA-AUTO   (WS-IND). 206400      
003374     MOVE WS-MXCTA-SUCOPER(WS-IND) TO WS-SIS-CTA-SUCUR  (WS-IND). 206500      
003375     MOVE WS-MXCTA-CAJA   (WS-IND) TO WS-SIS-CTA-CAJA   (WS-IND). 206600      
003376     MOVE WS-MXCTA-SISORIG(WS-IND) TO WS-SIS-CTA-SISTEMA(WS-IND). 206700      
003377     MOVE WS-MXCTA-CVE    (WS-IND) TO WS-SIS-CTA-CVET   (WS-IND). 206800      
003378     MOVE WS-MXCTA-REFMOV (WS-IND) TO WS-SIS-CTA-REF    (WS-IND). 206900      
003379     MOVE WS-MXCTA-IMPO   (WS-IND) TO WS-SIS-CTA-SDO    (WS-IND). 207000      
003380     MOVE WS-MXCTA-HORAOPE(WS-IND) TO WS-SIS-CTA-HRA    (WS-IND). 207100      
003381                                                                  207200      
003382                                                                  207300      
003383 20213-CARGA-TABLA.                                               207400      
003384    MOVE WS-SIS-CTA-SUCUR(WS-IND)   TO WS-DS-CTA-SUCUR  (WS-IND). 207500      
003385    MOVE WS-SIS-CTA-CAJA(WS-IND)    TO WS-DS-CTA-CAJA   (WS-IND). 207600      
003386    MOVE WS-SIS-CTA-SISTEMA(WS-IND) TO WS-DS-CTA-SIS    (WS-IND). 207700      
003387    MOVE WS-SIS-CTA-AUTO(WS-IND)    TO WS-DS-CTA-AUTO   (WS-IND). 207800      
003388    MOVE WS-SIS-CTA-CVET(WS-IND)    TO WS-DS-CTA-CVEST  (WS-IND). 207900      
003389    IF STATUS-MOV AND WS-MXCTA-STATUS(WS-IND) = 2                 208000      
003390       MOVE "E"                     TO WS-DS-CTA-STATUS(WS-IND)   208100      
003391    ELSE                                                          208200      
003392       MOVE " "                     TO WS-DS-CTA-STATUS(WS-IND).  208300      
003393    MOVE WS-SIS-CTA-REF (WS-IND)    TO WS-DS-CTA-REF   (WS-IND).  208400      
003394    MOVE WS-SIS-CTA-SDO (WS-IND)    TO WS-DS-CTA-SDO   (WS-IND).  208500      
003395*   IF WS-DE-SISTEMA = 001                                        208600      
003396*      COMPUTE WS-SIS-CTA-HRA(WS-IND) = WS-SIS-CTA-HRA(WS-IND)    208700      
003397*                                       * 100.                    208800      
003398    MOVE WS-SIS-CTA-HH  (WS-IND)    TO WS-DS-CTA-HR    (WS-IND).  208900      
003399    MOVE WS-SIS-CTA-MM  (WS-IND)    TO WS-DS-CTA-MM    (WS-IND).  208950      
003400    IF WS-DE-SISTEMA = 084 AND WS-SIS-CTA-CVET(WS-IND) > 0        209000      
003401       MOVE " "                   TO WS-CTA-R084-FILL1(WS-IND)    209100      
003402                                     WS-CTA-R084-FILL2(WS-IND)    209200      
003403*      MOVE WS-MXCTA-RFEC(WS-IND) TO WS-CTA-R084-FECHA(WS-IND)    209300      
003404*INICIA CODIGO DE RENOVACION CRONOS 2000                          209301      
003405$SET OMIT = OLDCODE                                               209302      
003406      MOVE WS-MXCTA-RFEC(WS-IND) TO WS-CTA-R084-FECHA(WS-IND)     209303      
003407$POP OMIT                                                         209304      
003408$SET OMIT = NOT OLDCODE                                           209305      
003409      MOVE ZEROS TO A2K-FEC-CAMD-001                              209306      
003410      MOVE WS-MXCTA-RFEC(WS-IND) TO A2K-FEC-CAMD-001              209307      
003411      PERFORM A2K-CONV-CAMD-TO-AMD THRU                           209308      
003412                A2K-CONV-CAMD-TO-AMD-EXIT                         209309      
003413      MOVE A2K-FEC-AMD-001 TO WS-CTA-R084-FECHA(WS-IND)           209310      
003414$POP OMIT                                                         209311      
003415*TERMINA CODIGO DE RENOVACION CRONOS 2000                         209312      
003416       MOVE WS-MXCTA-RINS(WS-IND) TO WS-CTA-R084-INST (WS-IND).   209400      
003417    IF WS-SIS-CTA-CVET(WS-IND) = 0                                209500      
003418       MOVE "    "                TO WS-DS-CTA-SUCU-ALFA(WS-IND)  209600      
003419                                     WS-DS-CTA-CAJA-ALFA(WS-IND). 209700      
003420    IF WS-SIS-CTA-SDO(WS-IND) > 0                                 209800      
003421       OR WS-SIS-CTA-AUTO(WS-IND) > 0                             209900      
003422       OR WS-SIS-CTA-CVET(WS-IND) > 0                             210000      
003423       ADD 1 TO WS-IND2.                                          210100      
003424*                                                                 210200      
003425 20215-DEFINE-SISTPROD.                                           210300      
003426    MOVE WS-DE-SISTEMA  TO WS-MXCTA-PRODUCTO WS-MXCAJA-PRODUCTO   210400      
003427                           WS-TOT-ADMOV-PRODUCTO                  210500      
003428                           WS-MXCAJA-PRODUCTO-L011                210555      
003429                           WS-TOT-ADMOV-PRODUCTO-L011.            210560      
003430    MOVE 002            TO WS-MXCAJA-BCOORI-L011                  210562      
003431                           WS-MXCAJA-BCODES-L011                  210564      
003432                           WS-TOT-ADMOV-BCOORI-L011               210566      
003433                           WS-TOT-ADMOV-BCODES-L011               210568      
003434    IF WS-DE-SISTEMA = 500 OR = 66 OR = 001 OR = 003              210600      
003435       MOVE 500         TO WS-MXCTA-SISTEMA WS-MXCAJA-SISTEMA     210700      
003436                           WS-TOT-ADMOV-SISTEMA                   210800      
003437                           WS-MXCAJA-SISTEMA-L011                 210855      
003438                           WS-TOT-ADMOV-SISTEMA-L011              210860      
003439       IF WS-DE-SISTEMA = 3                                       210862      
003440          MOVE 012      TO WS-MXCAJA-BCODES-L011                  210864      
003441                           WS-TOT-ADMOV-BCODES-L011               210866      
003442       ELSE                                                       210868      
003443          NEXT SENTENCE                                           210870      
003444    ELSE                                                          210900      
003445    IF WS-DE-SISTEMA = 1151                                       211000      
003446       MOVE 151         TO WS-MXCTA-SISTEMA WS-MXCAJA-SISTEMA     211100      
003447                           WS-TOT-ADMOV-SISTEMA                   211200      
003448                           WS-MXCAJA-SISTEMA-L011                 211255      
003449                           WS-TOT-ADMOV-SISTEMA-L011              211260      
003450    ELSE                                                          211300      
003451     MOVE WS-DE-SISTEMA TO WS-MXCTA-SISTEMA WS-MXCAJA-SISTEMA     211400      
003452                           WS-TOT-ADMOV-SISTEMA                   211500      
003453                           WS-MXCAJA-SISTEMA-L011                 211555      
003454                           WS-TOT-ADMOV-SISTEMA-L011.             211560      
003455***********************************************************       212300      
003456*                                                         *       212400      
003457*              20220-CONSULTA-POR-CAJA                    *       212500      
003458*                                                         *       212600      
003459***********************************************************       212700      
003460 20220-CONSULTA-POR-CAJA.                                         212800      
003461    IF WS-MON = 1                                                 212900      
003462       DISPLAY "STRING "  WS-REM-TEXTO-SE.                        213000      
003463    UNSTRING WS-REM-TEXTO-SE DELIMITED BY WS-FS OR "@" INTO       213100      
003464*             WS-DE-CVE-SUP                                       213200      
003465**********    WS-DE-SECAUTS151                                    213300      
003466              WS-DE-SUCURSAL                                      213400      
003467              WS-DE-CAJA-ALFA                                     213500      
003468              WS-DE-SISTEMA                                       213600      
003469              WS-DE-AUTOR                                         213700      
003470              WS-DE-CONTROL.                                      213800      
003471*        IF WS-CVE-SUP NOT = WS-DE-CVE-SUP                        213900      
003472    IF WS-DE-CAJA-ALFA = SPACES                                   214000      
003473       MOVE WS-HDR-CAJ TO WS-DE-CAJA.                             214100      
003474    IF WS-DE-SUCURSAL-ALFA IS NOT NUMERIC                         214200      
003475*      WS-DE-SUCURSAL > 999                                       214300      
003476       MOVE 4 TO WS-RESPERROR.                                    214400      
003477    IF WS-DE-SUCURSAL   = ZEROES                                  214500      
003478       MOVE WS-HDR-SUC          TO WS-DE-SUCURSAL.                214600      
003479                                                                  214700      
003480    IF WS-DE-CAJA-ALFA IS NOT NUMERIC                             214800      
003481       MOVE 9 TO WS-RESPERROR.                                    214900      
003482    IF WS-DE-SISTEMA-ALFA IS NOT NUMERIC OR WS-DE-SISTEMA > 2264  215000      
003483       MOVE 13 TO WS-RESPERROR.                                   215100      
003484    IF WS-DE-SISTEMA = ZEROS                                      215200      
003485         MOVE 001 TO WS-DE-SISTEMA.                               215300      
003486    IF WS-RESPERROR = 0                                           215400      
003487       IF NOT WS-DE-CAJA-OK                                       215500      
003488          MOVE  WS-HDR-CAJ   TO WS-DE-CAJA.                       215600      
003489    IF WS-RESPERROR = 0                                           215700      
003490       IF WS-DE-AUTOR > 0                                         215800      
003491          IF WS-DE-AUTOR-ALFA IS NOT NUMERIC                      215900      
003492             MOVE 10 TO WS-RESPERROR                              216000      
003493          ELSE                                                    216100      
003494             MOVE 0 TO WS-DE-CONTROL                              216200      
003495       ELSE                                                       216300      
003496          IF WS-DE-CONTROL > 0                                    216400      
003497             IF WS-DE-CONTROL-ALFA IS NOT NUMERIC                 216500      
003498                MOVE 6 TO WS-RESPERROR.                           216600      
003499    IF WS-MON = 1                                                 216700      
003500       DISPLAY "WS-DE-SISTEMA  "WS-DE-SISTEMA                     216800      
003501       DISPLAY "WS-HDR-CCR-ORG "WS-HDR-CCR-ORG                    216900      
003502       DISPLAY "WS-HDR-RES     "WS-HDR-RES.                       217100      
003503    IF WS-DE-SISTEMA = 403                                        217400      
003504       MOVE WS-CSI-403 TO WS-CSI-VAL                              217500      
003505    ELSE IF WS-DE-SISTEMA = 703                                   217600      
003506       MOVE WS-CSI-703 TO WS-CSI-VAL.                             217700      
003507    IF WS-RESPERROR = 0                                           217800      
003508     IF ((WS-DE-SISTEMA = 403 AND WS-HDR-CCR-ORG NOT = WS-CSI-403)218000      
003509     OR (WS-DE-SISTEMA = 703 AND WS-HDR-CCR-ORG NOT = WS-CSI-703))218100      
003510          AND WS-HDR-RES NOT = 2                                  218200      
003511          MOVE WS-CSI-VAL TO WS-HDR-CCR-DES                       218300      
003512          MOVE 2          TO WS-HDR-RES                           218400      
003513          MOVE 1          TO WS-DIRECCIONA                        218500      
003514       ELSE                                                       218600      
003515          PERFORM 20221-CARGA-LIB-503                             218700      
003516          IF WS-RESPERROR = 0                                     218800      
003517             PERFORM 20222-ARMA-RESPUESTA.                        218900      
003518                                                                  219000      
003519 20221-CARGA-LIB-503.                                             220400      
003520     IF WS-DE-SISNVO                                              220500      
003521        MOVE LOW-VALUES           TO WS-ADMOV-MOVSXCAJA           220600      
003522                                     WS-ADMOV-MOVSXCAJA-L011      220655      
003523        PERFORM 20215-DEFINE-SISTPROD                             220700      
003524        MOVE WS-DE-SUCURSAL       TO WS-MXCAJA-SUCOPER            220800      
003525                                     WS-MXCAJA-SUCOPER-L011       220855      
003526        MOVE WS-DE-CAJA           TO WS-MXCAJA-CAJA               220900      
003527                                     WS-MXCAJA-CAJA-L011          220955      
003528        MOVE WS-DE-AUTOR TO WS-MXCAJA-AUTAPL WS-DE-AUTORIZACION   221000      
003529                            WS-MXCAJA-AUTAPL-L011                 221055      
003530        MOVE 0                    TO WS-MXCAJA-AUTS151            221100      
003531                                     WS-MXCAJA-AUTS151-L011       221155      
003532        PERFORM 20221-DEFINE-AUTORIZ                              221200      
003533        MOVE 12                   TO WS-MXCAJA-NMOV               221300      
003534                                     WS-MXCAJA-NMOV-L011          221355      
003535*       MOVE 1                    TO WS-MXCAJA-PROCESO            221400      
003536        MOVE 1                    TO WS-MXCAJA-NAT-ABO            221500      
003537                  WS-MXCAJA-NAT-IABO WS-MXCAJA-NAT-CGO            221600      
003538                  WS-MXCAJA-NAT-ICGO                              221700      
003539                  WS-MXCAJA-NAT-ABO-L011 WS-MXCAJA-NAT-IABO-L011  221755      
003540                  WS-MXCAJA-NAT-CGO-L011 WS-MXCAJA-NAT-ICGO-L011  221760      
003541        MOVE 52                   TO WS-MXCAJA-FUN                221800      
003542                                     WS-MXCAJA-FUN-L011           221855      
003543        MOVE 77-ADMOV-FECPROC      TO WS-MXCAJA-FECAPLI-L011      221900      
003544        MOVE 77-ADMOV-FECPROC-6DIG TO WS-MXCAJA-FECAPLI           221955      
003545*       IF WS-DE-SISNVO1                                          222000      
003546*          CALL "CONSULTA1 IN LIB-CONSULTA" USING                 222100      
003547*               WS-ADMOV-MOVSXCAJA GIVING WS-STATUS               222200      
003548*       ELSE                                                      222300      
003549        IF WS-DE-SIS001 OR WS-DE-SISNVO1                          222400      
003550           IF WKS-FECHA-S500 > 0                                  222452      
003551              MOVE WKS-FECHA-S500  TO WS-MXCAJA-FECAPLI-L011      222454      
003552              CALL "MOVS3NIVEL IN LIB-L011500" USING              222500      
003553                WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS          222600      
003554           ELSE                                                   222652      
003555              CALL "MOVS3NIVEL IN LIB-L011500" USING              222654      
003556                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       222656      
003557        ELSE                                                      222658      
003558        IF WS-DE-SIS701 AND (WKS-NUMCSI = 10 OR 32)               222660      
003559           IF WKS-FECHA-S701 > 0                                  222662      
003560              MOVE WKS-FECHA-S701  TO WS-MXCAJA-FECAPLI-L011      222664      
003561              CALL "MOVS3NIVEL IN LIB-L011701" USING              222666      
003562                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       222668      
003563           ELSE                                                   222670      
003564              CALL "MOVS3NIVEL IN LIB-L011701" USING              222672      
003565                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       222674      
003566        ELSE                                                      222675      
003567        IF WS-DE-SIS264                                           222677      
003568           IF WKS-FECHA-S264 > 0                                  222678      
003569              MOVE WKS-FECHA-S264  TO WS-MXCAJA-FECAPLI-L011      222680      
003570              CALL "MOVS3NIVEL IN LIB-L011264" USING              222682      
003571                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       222684      
003572           ELSE                                                   222686      
003573              CALL "MOVS3NIVEL IN LIB-L011264" USING              222688      
003574                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       222689      
003575        ELSE                                                      222690      
003576        IF WS-DE-SIS404 AND (WKS-NUMCSI = 4  OR 32)               222693      
003577           IF WKS-FECHA-S404 > 0                                  222696      
003578              MOVE WKS-FECHA-S404  TO WS-MXCAJA-FECAPLI-L011      222699      
003579              CALL "MOVS3NIVEL IN LIB-L011404" USING              222702      
003580                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       222705      
003581           ELSE                                                   222708      
003582              CALL "MOVS3NIVEL IN LIB-L011404" USING              222711      
003583                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       222714      
003584        ELSE                                                      222717      
003585        IF WS-DE-SIS501                                           222720      
003586           IF WKS-FECHA-S501 > 0                                  222723      
003587              MOVE WKS-FECHA-S501  TO WS-MXCAJA-FECAPLI-L011      222726      
003588              CALL "MOVS3NIVEL IN LIB-L011501" USING              222729      
003589                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       222732      
003590           ELSE                                                   222735      
003591              CALL "MOVS3NIVEL IN LIB-L011501" USING              222738      
003592                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       222741      
003593        ELSE                                                      223000      
003594        IF WS-DE-SIS018 AND (WKS-NUMCSI = 04 OR 32)               223100      
003595           IF WKS-FECHA-S018 > 0                                  223200      
003596              MOVE WKS-FECHA-S018  TO WS-MXCAJA-FECAPLI-L011      223300      
003597              CALL "MOVS3NIVEL IN LIB-L011018" USING              223400      
003598                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       223500      
003599           ELSE                                                   223600      
003600              CALL "MOVS3NIVEL IN LIB-L011018" USING              223700      
003601                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       223800      
003602        ELSE                                                      223804      
003603        IF WS-DE-SIS502 AND (WKS-NUMCSI = 10 OR 32)               223806      
003604           IF WKS-FECHA-S502 > 0                                  223808      
003605              MOVE WKS-FECHA-S502  TO WS-MXCAJA-FECAPLI-L011      223810      
003606              CALL "MOVS3NIVEL IN LIB-L011502" USING              223812      
003607                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       223814      
003608           ELSE                                                   223816      
003609              CALL "MOVS3NIVEL IN LIB-L011502" USING              223818      
003610                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS.      223820      
003611                                                                  224000      
003612    IF WS-MON = 1                                                 224900      
003613       DISPLAY "BACK CONBD 1 " WS-SIS-CAJA-TABLA(1)               225000      
003614       DISPLAY "           2 " WS-SIS-CAJA-TABLA(2)               225100      
003615       DISPLAY "           3 " WS-SIS-CAJA-TABLA(3)               225200      
003616       DISPLAY "           4 " WS-SIS-CAJA-TABLA(4)               225300      
003617       DISPLAY "           5 " WS-SIS-CAJA-TABLA(5)               225400      
003618       DISPLAY "           6 " WS-SIS-CAJA-TABLA(6)               225500      
003619       DISPLAY "           7 " WS-SIS-CAJA-TABLA(7)               225600      
003620       DISPLAY "           8 " WS-SIS-CAJA-TABLA(8)               225700      
003621       DISPLAY "           9 " WS-SIS-CAJA-TABLA(9)               225800      
003622       DISPLAY "          10 " WS-SIS-CAJA-TABLA(10).             225900      
003623    IF WS-STATUS > 0                                              226000      
003624       MOVE 11 TO WS-RESPERROR.                                   226100      
003625*                                                                 226200      
003626 20221-DEFINE-AUTORIZ.                                            226300      
003627     IF WS-DE-AUTAPLI = WS-DE-AUTORIZACION                        226400      
003628        MOVE WS-DE-CTRLS151 TO WS-MXCAJA-AUTS151                  226500      
003629                               WS-MXCAJA-AUTS151-L011             226555      
003630     ELSE                                                         226600      
003631        MOVE WS-DE-AUTORIZACION TO WS-MXCAJA-AUTAPL               226700      
003632                                   WS-MXCAJA-AUTAPL-L011          226755      
003633        MOVE 0                  TO WS-MXCAJA-AUTS151              226800      
003634                                   WS-MXCAJA-AUTS151-L011.        226855      
003635*                                                                 226900      
003636 20222-ARMA-RESPUESTA.                                            227000      
003637     IF WS-DE-SISNVO                                              227100      
003638        MOVE WS-MXCAJA-AUTAPL TO WS-SIS-CAJA-CTROL WS-DE-AUTAPLI  227200      
003639                                 WS-DS-AUT-APLIC                  227300      
003640        MOVE WS-MXCAJA-AUTS151 TO WS-DE-CTRLS151                  227400      
003641        PERFORM 20223-PASA-A-TABLA VARYING WS-IND FROM 1 BY 1     227500      
003642                UNTIL WS-IND > 12                                 227600      
003643        MOVE 1 TO WS-STATUS-MOV                                   227700      
003644     ELSE                                                         227800      
003645        MOVE 0 TO WS-DE-AUTAPLI WS-DE-CTRLS151 WS-STATUS-MOV      227900      
003646        MOVE WS-SIS-CAJA-AUTO   TO WS-DS-AUT-APLIC.               228000      
003647                                                                  228100      
003648    PERFORM 20223-CARGA-TABLA VARYING WS-IND FROM 1 BY 1          228200      
003649                               UNTIL   WS-IND > 12.               228300      
003650    PERFORM 20222-LIMPIA-TABLA VARYING INDICE FROM 1 BY 1         228400      
003651                               UNTIL   INDICE > 25.               228500      
003652    IF WS-IND2 < 12                                               228600      
003653       MOVE 0 TO WS-SIS-CAJA-CTROL WS-DS-AUT-APLIC                228700      
003654       MOVE SPACES TO WS-DE-CVE-SUP.                              228800      
003655    MOVE 0 TO WS-DE-AUTOR.                                        228900      
003656    IF  WS-TXT-FUN  = 504                                         229000      
003657       PERFORM 20222-ARMA-504                                     229100      
003658    ELSE                                                          229200      
003659       PERFORM 20222-ARMA-503.                                    229300      
003660*                                                                 229400      
003661 20222-LIMPIA-TABLA.                                              229500      
003662    MOVE LOW-VALUES TO WS-MXCAJA-TABLA(INDICE).                   229600      
003663*                                                                 229700      
003664 20222-ARMA-504.                                                  229800      
003665    MOVE WS-DE-SISTEMA TO WS-DS-SYSTEM.                           229900      
003666    IF WS-SIS-CAJA-CTROL = ZEROS                                  230000      
003667       MOVE "    FIN DE CONSULTA" TO WS-DS-FILL                   230100      
003668    ELSE                                                          230200      
003669       MOVE "     CONTINUA ..."   TO WS-DS-FILL.                  230300      
003670    STRING WS-CLEAR                                               230400      
003671*          WS-DE-CVE-SUP                                          230500      
003672           WS-DESPROTEGE,                                         230600      
003673           WS-POS-03-16,                                          230700      
003674***********WS-DE-SECAUTS151,                                      230800      
003675           WS-PROTEGE,                                            230900      
003676           WS-DE-SUCURSAL,                                        231000      
003677           WS-DE-CAJA,                                            231100      
003678           WS-DE-SISTEMA,                                         231200      
003679           WS-DS-AUT-APLIC,                                       231300      
003680            " ",                                                  231400      
003681      WS-DS-CAJA-AUTOT(1),WS-DS-CAJA-SPROM(1),WS-DS-CAJA-CTA(1)   231500      
003682      WS-DS-CAJA-CVET (1),WS-DS-CAJA-REFER(1),WS-DS-CAJA-SDO(1)   231600      
003683      WS-DS-CAJA-HR   (1),WS-DS-2-PUNTOS  (1),WS-DS-CAJA-MM (1)   231700      
003684      WS-DS-CAJA-AUTOT(2),WS-DS-CAJA-SPROM(2),WS-DS-CAJA-CTA(2)   231800      
003685      WS-DS-CAJA-CVET (2),WS-DS-CAJA-REFER(2),WS-DS-CAJA-SDO(2)   231900      
003686      WS-DS-CAJA-HR   (2),WS-DS-2-PUNTOS  (2),WS-DS-CAJA-MM (2)   232000      
003687      WS-DS-CAJA-AUTOT(3),WS-DS-CAJA-SPROM(3),WS-DS-CAJA-CTA(3)   232100      
003688      WS-DS-CAJA-CVET (3),WS-DS-CAJA-REFER(3),WS-DS-CAJA-SDO(3)   232200      
003689      WS-DS-CAJA-HR   (3),WS-DS-2-PUNTOS  (3),WS-DS-CAJA-MM (3)   232300      
003690      WS-DS-CAJA-AUTOT(4),WS-DS-CAJA-SPROM(4),WS-DS-CAJA-CTA(4)   232400      
003691      WS-DS-CAJA-CVET (4),WS-DS-CAJA-REFER(4),WS-DS-CAJA-SDO(4)   232500      
003692      WS-DS-CAJA-HR   (4),WS-DS-2-PUNTOS  (4),WS-DS-CAJA-MM (4)   232600      
003693      WS-DS-CAJA-AUTOT(5),WS-DS-CAJA-SPROM(5),WS-DS-CAJA-CTA(5)   232700      
003694      WS-DS-CAJA-CVET (5),WS-DS-CAJA-REFER(5),WS-DS-CAJA-SDO(5)   232800      
003695      WS-DS-CAJA-HR   (5),WS-DS-2-PUNTOS  (5),WS-DS-CAJA-MM (5)   232900      
003696      WS-DS-CAJA-AUTOT(6),WS-DS-CAJA-SPROM(6),WS-DS-CAJA-CTA(6)   233000      
003697      WS-DS-CAJA-CVET (6),WS-DS-CAJA-REFER(6),WS-DS-CAJA-SDO(6)   233100      
003698      WS-DS-CAJA-HR   (6),WS-DS-2-PUNTOS  (6),WS-DS-CAJA-MM (6)   233200      
003699      WS-DS-CAJA-AUTOT(7),WS-DS-CAJA-SPROM(7),WS-DS-CAJA-CTA(7)   233300      
003700      WS-DS-CAJA-CVET (7),WS-DS-CAJA-REFER(7),WS-DS-CAJA-SDO(7)   233400      
003701      WS-DS-CAJA-HR   (7),WS-DS-2-PUNTOS  (7),WS-DS-CAJA-MM (7)   233500      
003702      WS-DS-CAJA-AUTOT(8),WS-DS-CAJA-SPROM(8),WS-DS-CAJA-CTA(8)   233600      
003703      WS-DS-CAJA-CVET (8),WS-DS-CAJA-REFER(8),WS-DS-CAJA-SDO(8)   233700      
003704      WS-DS-CAJA-HR   (8),WS-DS-2-PUNTOS  (8),WS-DS-CAJA-MM (8)   233800      
003705      WS-DS-CAJA-AUTOT(9),WS-DS-CAJA-SPROM(9),WS-DS-CAJA-CTA(9)   233900      
003706      WS-DS-CAJA-CVET (9),WS-DS-CAJA-REFER(9),WS-DS-CAJA-SDO(9)   234000      
003707      WS-DS-CAJA-HR   (9),WS-DS-2-PUNTOS  (9),WS-DS-CAJA-MM (9)   234100      
003708     WS-DS-CAJA-AUTOT(10),WS-DS-CAJA-SPROM(10),WS-DS-CAJA-CTA(10) 234200      
003709     WS-DS-CAJA-CVET (10),WS-DS-CAJA-REFER(10),WS-DS-CAJA-SDO(10) 234300      
003710     WS-DS-CAJA-HR   (10),WS-DS-2-PUNTOS  (10),WS-DS-CAJA-MM (10) 234400      
003711     WS-DS-CAJA-AUTOT(11),WS-DS-CAJA-SPROM(11),WS-DS-CAJA-CTA(11) 234500      
003712     WS-DS-CAJA-CVET (11),WS-DS-CAJA-REFER(11),WS-DS-CAJA-SDO(11) 234600      
003713     WS-DS-CAJA-HR   (11),WS-DS-2-PUNTOS  (11),WS-DS-CAJA-MM (11) 234700      
003714     WS-DS-CAJA-AUTOT(12),WS-DS-CAJA-SPROM(12),WS-DS-CAJA-CTA(12) 234800      
003715     WS-DS-CAJA-CVET (12),WS-DS-CAJA-REFER(12),WS-DS-CAJA-SDO(12) 234900      
003716     WS-DS-CAJA-HR   (12),WS-DS-2-PUNTOS  (12),WS-DS-CAJA-MM (12) 235000      
003717           "    ",                                                235100      
003718           WS-DS-LEYENDA,                                         235200      
003719            WS-TAB,                                               235300      
003720           WS-ETX                                                 235400      
003721           DELIMITED BY SIZE INTO WS-DATOS-RESPUESTA              235500      
003722           WITH POINTER WS-LONG-MSG.                              235600      
003723 20222-ARMA-503.                                                  235700      
003724    MOVE WS-DE-SISTEMA TO WS-DS-SYSTEM.                           235800      
003725    IF WS-SIS-CAJA-CTROL = ZEROS                                  235900      
003726       MOVE "    FIN DE CONSULTA" TO WS-DS-FILL                   236000      
003727    ELSE                                                          236100      
003728       MOVE "     CONTINUA ..."   TO WS-DS-FILL.                  236200      
003729    STRING WS-CLEAR                                               236300      
003730*          WS-DE-CVE-SUP                                          236400      
003731*          WS-DE-SUCURSAL                                         236500      
003732           WS-DESPROTEGE,                                         236600      
003733           WS-POS-03-16,                                          236700      
003734***********WS-DE-SECAUTS151                                       236800      
003735           WS-PROTEGE,                                            236900      
003736           WS-DE-CAJA,                                            237000      
003737           WS-DE-SISTEMA,                                         237100      
003738           WS-DS-AUT-APLIC,                                       237200      
003739            " ",                                                  237300      
003740      WS-DS-CAJA-AUTOT(1),WS-DS-CAJA-SPROM(1),WS-DS-CAJA-CTA(1)   237400      
003741      WS-DS-CAJA-CVET (1),WS-DS-CAJA-REFER(1),WS-DS-CAJA-SDO(1)   237500      
003742      WS-DS-CAJA-HR   (1),WS-DS-2-PUNTOS  (1),WS-DS-CAJA-MM (1)   237600      
003743      WS-DS-CAJA-AUTOT(2),WS-DS-CAJA-SPROM(2),WS-DS-CAJA-CTA(2)   237700      
003744      WS-DS-CAJA-CVET (2),WS-DS-CAJA-REFER(2),WS-DS-CAJA-SDO(2)   237800      
003745      WS-DS-CAJA-HR   (2),WS-DS-2-PUNTOS  (2),WS-DS-CAJA-MM (2)   237900      
003746      WS-DS-CAJA-AUTOT(3),WS-DS-CAJA-SPROM(3),WS-DS-CAJA-CTA(3)   238000      
003747      WS-DS-CAJA-CVET (3),WS-DS-CAJA-REFER(3),WS-DS-CAJA-SDO(3)   238100      
003748      WS-DS-CAJA-HR   (3),WS-DS-2-PUNTOS  (3),WS-DS-CAJA-MM (3)   238200      
003749      WS-DS-CAJA-AUTOT(4),WS-DS-CAJA-SPROM(4),WS-DS-CAJA-CTA(4)   238300      
003750      WS-DS-CAJA-CVET (4),WS-DS-CAJA-REFER(4),WS-DS-CAJA-SDO(4)   238400      
003751      WS-DS-CAJA-HR   (4),WS-DS-2-PUNTOS  (4),WS-DS-CAJA-MM (4)   238500      
003752      WS-DS-CAJA-AUTOT(5),WS-DS-CAJA-SPROM(5),WS-DS-CAJA-CTA(5)   238600      
003753      WS-DS-CAJA-CVET (5),WS-DS-CAJA-REFER(5),WS-DS-CAJA-SDO(5)   238700      
003754      WS-DS-CAJA-HR   (5),WS-DS-2-PUNTOS  (5),WS-DS-CAJA-MM (5)   238800      
003755      WS-DS-CAJA-AUTOT(6),WS-DS-CAJA-SPROM(6),WS-DS-CAJA-CTA(6)   238900      
003756      WS-DS-CAJA-CVET (6),WS-DS-CAJA-REFER(6),WS-DS-CAJA-SDO(6)   239000      
003757      WS-DS-CAJA-HR   (6),WS-DS-2-PUNTOS  (6),WS-DS-CAJA-MM (6)   239100      
003758      WS-DS-CAJA-AUTOT(7),WS-DS-CAJA-SPROM(7),WS-DS-CAJA-CTA(7)   239200      
003759      WS-DS-CAJA-CVET (7),WS-DS-CAJA-REFER(7),WS-DS-CAJA-SDO(7)   239300      
003760      WS-DS-CAJA-HR   (7),WS-DS-2-PUNTOS  (7),WS-DS-CAJA-MM (7)   239400      
003761      WS-DS-CAJA-AUTOT(8),WS-DS-CAJA-SPROM(8),WS-DS-CAJA-CTA(8)   239500      
003762      WS-DS-CAJA-CVET (8),WS-DS-CAJA-REFER(8),WS-DS-CAJA-SDO(8)   239600      
003763      WS-DS-CAJA-HR   (8),WS-DS-2-PUNTOS  (8),WS-DS-CAJA-MM (8)   239700      
003764      WS-DS-CAJA-AUTOT(9),WS-DS-CAJA-SPROM(9),WS-DS-CAJA-CTA(9)   239800      
003765      WS-DS-CAJA-CVET (9),WS-DS-CAJA-REFER(9),WS-DS-CAJA-SDO(9)   239900      
003766      WS-DS-CAJA-HR   (9),WS-DS-2-PUNTOS  (9),WS-DS-CAJA-MM (9)   240000      
003767     WS-DS-CAJA-AUTOT(10),WS-DS-CAJA-SPROM(10),WS-DS-CAJA-CTA(10) 240100      
003768     WS-DS-CAJA-CVET (10),WS-DS-CAJA-REFER(10),WS-DS-CAJA-SDO(10) 240200      
003769     WS-DS-CAJA-HR   (10),WS-DS-2-PUNTOS  (10),WS-DS-CAJA-MM (10) 240300      
003770     WS-DS-CAJA-AUTOT(11),WS-DS-CAJA-SPROM(11),WS-DS-CAJA-CTA(11) 240400      
003771     WS-DS-CAJA-CVET (11),WS-DS-CAJA-REFER(11),WS-DS-CAJA-SDO(11) 240500      
003772     WS-DS-CAJA-HR   (11),WS-DS-2-PUNTOS  (11),WS-DS-CAJA-MM (11) 240600      
003773     WS-DS-CAJA-AUTOT(12),WS-DS-CAJA-SPROM(12),WS-DS-CAJA-CTA(12) 240700      
003774     WS-DS-CAJA-CVET (12),WS-DS-CAJA-REFER(12),WS-DS-CAJA-SDO(12) 240800      
003775     WS-DS-CAJA-HR   (12),WS-DS-2-PUNTOS  (12),WS-DS-CAJA-MM (12) 240900      
003776           "    ",                                                241000      
003777          WS-DS-LEYENDA,                                          241100      
003778            WS-TAB,                                               241200      
003779           WS-ETX                                                 241300      
003780           DELIMITED BY SIZE INTO WS-DATOS-RESPUESTA              241400      
003781           WITH POINTER WS-LONG-MSG.                              241500      
003782 20223-PASA-A-TABLA.                                              241600      
003783     MOVE WS-MXCAJA-AUT   (WS-IND) TO WS-SIS-CAJA-AUTOT (WS-IND). 241700      
003784     MOVE WS-MXCAJA-SPROM (WS-IND) TO WS-SIS-CAJA-SPROM (WS-IND). 241800      
003785     MOVE WS-MXCAJA-CTA   (WS-IND) TO WS-SIS-CAJA-CTA   (WS-IND). 241900      
003786     MOVE WS-MXCAJA-CVET  (WS-IND) TO WS-SIS-CAJA-CVET  (WS-IND). 242000      
003787     MOVE WS-MXCAJA-REFER (WS-IND) TO WS-SIS-CAJA-REFER (WS-IND). 242100      
003788     MOVE WS-MXCAJA-IMP   (WS-IND) TO WS-SIS-CAJA-SDO   (WS-IND). 242200      
003789     MOVE WS-MXCAJA-HORA  (WS-IND) TO WS-SIS-CAJA-HRA   (WS-IND). 242300      
003790     MOVE WS-MXCAJA-MONEDA(WS-IND) TO WS-SIS-CAJA-MONEDA(WS-IND). 242400      
003791                                                                  242500      
003792 20223-CARGA-TABLA.                                               242600      
003793    MOVE WS-SIS-CAJA-AUTOT(WS-IND) TO WS-DS-CAJA-AUTOT (WS-IND)   242700      
003794    MOVE WS-SIS-CAJA-SPROM(WS-IND) TO WS-DS-CAJA-SPROM (WS-IND).  242800      
003795    MOVE WS-SIS-CAJA-CTA  (WS-IND) TO WS-DS-CAJA-CTA   (WS-IND).  242900      
003796    MOVE WS-SIS-CAJA-CVET (WS-IND) TO WS-DS-CAJA-CVESTA(WS-IND).  243000      
003797    IF STATUS-MOV AND WS-MXCAJA-STATUS(WS-IND) = 2                243100      
003798       MOVE "E"                    TO WS-DS-CAJA-STATUS(WS-IND)   243200      
003799    ELSE                                                          243300      
003800       MOVE " "                    TO WS-DS-CAJA-STATUS(WS-IND).  243400      
003801    MOVE WS-SIS-CAJA-REFER(WS-IND) TO WS-DS-CAJA-REFER (WS-IND).  243500      
003802    MOVE WS-SIS-CAJA-SDO  (WS-IND) TO WS-DS-CAJA-SDO   (WS-IND).  243600      
003803    MOVE WS-SIS-CAJA-HH   (WS-IND) TO WS-DS-CAJA-HR    (WS-IND).  243700      
003804    MOVE WS-SIS-CAJA-MM   (WS-IND) TO WS-DS-CAJA-MM    (WS-IND).  243750      
003805    MOVE WS-SIS-CAJA-AUTOT(WS-IND) TO WS-DS-CASA1-AUTOT(WS-IND)   243800      
003806    MOVE WS-SIS-CAJA-SPROM(WS-IND) TO WS-DS-CASA1-SPROM(WS-IND).  243900      
003807    MOVE WS-SIS-CAJA-CTA  (WS-IND) TO WS-DS-CASA1-CTA  (WS-IND).  244000      
003808    MOVE WS-SIS-CAJA-CVET (WS-IND) TO WS-DS-CASA1-CVET (WS-IND).  244100      
003809    MOVE WS-SIS-CAJA-REFER(WS-IND) TO WS-DS-CASA1-REFER(WS-IND).  244200      
003810    MOVE WS-SIS-CAJA-SDO  (WS-IND) TO WS-DS-CASA1-SDO  (WS-IND).  244300      
003811    MOVE WS-SIS-CAJA-HRA  (WS-IND) TO WS-DS-CASA1-HRA  (WS-IND).  244400      
003812                                                                  244500      
003813*    IF WS-DE-SISTEMA = 264 AND WS-SIS-CAJA-CVET(WS-IND) > 100    244600      
003814*       PERFORM 20224-TRADUCE-VALOR                               244700      
003815*       MOVE WS-CJ-COM-CTA(WS-IND)  TO WS-CAJ-COMCTA(WS-IND)      244800      
003816*       MOVE WS-CJ-TIP-OPE(WS-IND)  TO WS-CAJ-TIPOPE(WS-IND)      244900      
003817*       MOVE SPACES TO WS-CAJ-FILLER(WS-IND) WS-CAJ-FILL1(WS-IND) 245000      
003818*                      WS-CAJ-FILL2(WS-IND) WS-CAJ-FILL3(WS-IND). 245100      
003819    IF WS-DE-SISTEMA = 084 AND WS-SIS-CAJA-CVET(WS-IND) > 0       245200      
003820       MOVE " "  TO  WS-R084-FILL1(WS-IND) WS-R084-FILL2(WS-IND)  245300      
003821*      MOVE WS-MXCAJA-RFEC(WS-IND) TO WS-R084-FECHA(WS-IND)       245400      
003822*INICIA CODIGO DE RENOVACION CRONOS 2000                          245401      
003823$SET OMIT = OLDCODE                                               245402      
003824       MOVE WS-MXCAJA-RFEC(WS-IND) TO WS-R084-FECHA(WS-IND)       245403      
003825$POP OMIT                                                         245404      
003826$SET OMIT = NOT OLDCODE                                           245405      
003827       MOVE ZEROS TO A2K-FEC-CAMD-001                             245406      
003828       MOVE WS-MXCAJA-RFEC(WS-IND) TO A2K-FEC-CAMD-001            245407      
003829       PERFORM A2K-CONV-CAMD-TO-AMD THRU                          245408      
003830                 A2K-CONV-CAMD-TO-AMD-EXIT                        245409      
003831       MOVE A2K-FEC-AMD-001 TO WS-R084-FECHA(WS-IND)              245410      
003832$POP OMIT                                                         245411      
003833*TERMINA CODIGO DE RENOVACION CRONOS 2000                         245412      
003834       MOVE WS-MXCAJA-RINS(WS-IND)  TO WS-R084-INST(WS-IND).      245500      
003835                                                                  245600      
003836    IF WS-SIS-CAJA-SDO(WS-IND) > 0                                245700      
003837       OR WS-SIS-CAJA-CVET(WS-IND) > 0                            245800      
003838       OR WS-SIS-CAJA-AUTOT(WS-IND) > 0                           245900      
003839       ADD 1 TO WS-IND2.                                          246000      
003840*   IF WS-SIS-CAJA-SIST = 001                                     246100      
003841*      IF WS-SIS-CAJA-MONEDA(WS-IND) = 1 THEN                     246200      
003842*         MOVE "MN" TO WS-DS-CAJA-MONEDA(WS-IND)                  246300      
003843*      ELSE                                                       246400      
003844*      IF WS-SIS-CAJA-MONEDA(WS-IND) = 5 THEN                     246500      
003845*   MOVE WS-SIS-CAJA-MONEDA(WS-IND) TO WS-MONED-PASO.             246600      
003846    MOVE WS-SIS-CAJA-MONEDA(WS-IND) TO WS-DS-CAJA-MONEDA(WS-IND). 246700      
003847                                                                  246800      
003848*20224-TRADUCE-VALOR.                                             246900      
003849*    IF WS-CJ-INS-CTA(WS-IND) = 0 OR > 10                         247000      
003850*       MOVE 11 TO WS-CJ-INS-CTA(WS-IND).                         247100      
003851*    IF WS-CJ-AGENCIA(WS-IND) = 0 OR > 6                          247200      
003852*       MOVE 7 TO WS-CJ-AGENCIA(WS-IND).                          247300      
003853*    MOVE WS-TAB-INST(WS-CJ-INS-CTA(WS-IND)) TO                   247400      
003854*         WS-CAJ-INSCTA(WS-IND).                                  247500      
003855*    MOVE WS-TAB-AGEN(WS-CJ-AGENCIA(WS-IND)) TO                   247600      
003856*         WS-CAJ-AGENC(WS-IND).                                   247700      
003857$RESET OMIT                                                       251500      
003858***********************************************************       251600      
003859*                                                         *       251700      
003860*              20230-CONSULTA-TOTALES                    *        251800      
003861*                                                         *       251900      
003862***********************************************************       252000      
003863 20230-CONSULTA-TOTALES.                                          252100      
003864    IF WS-MON = 1                                                 252200      
003865       DISPLAY "STRING "  WS-REM-TEXTO-SE.                        252300      
003866    UNSTRING WS-REM-TEXTO-SE DELIMITED BY WS-FS OR "@" INTO       252400      
003867              WS-DE-CSI,                                          252500      
003868              WS-DE-SUCURSAL,                                     252600      
003869              WS-DE-CAJA-ALFA,                                    252700      
003870              WS-DE-SISTEMA,                                      252800      
003871              WS-DE-MONEDA,                                       252900      
003872              WS-DE-MDAFIJA.                                      253000      
003873    IF WS-MON = 1                                                 253100      
003874       DISPLAY "ENTRE A RUT-20230-CONSULTA-TOTALES"               253200      
003875       DISPLAY "WS-DE-CSI       "WS-DE-CSI                        253300      
003876       DISPLAY "WS-DE-SUCURSAL  "WS-DE-SUCURSAL                   253400      
003877       DISPLAY "WS-DE-CAJA-ALFA "WS-DE-CAJA-ALFA                  253500      
003878       DISPLAY "WS-DE-SISTEMA   "WS-DE-SISTEMA                    253600      
003879       DISPLAY "WS-DE-MONEDA    "WS-DE-MONEDA                     253700      
003880       DISPLAY "WS-DE-MDAFIJA   "WS-DE-MDAFIJA.                   253800      
003881*   IF WS-DE-CAJA-ALFA = SPACES                                   253900      
003882*      MOVE WS-HDR-CAJ TO WS-DE-CAJA.                             254000      
003883                                                                  254100      
003884    IF WS-DE-CAJA-ALFA IS NOT NUMERIC                             254200      
003885       IF WS-DE-CAJA-ALFA NOT = SPACES                            254300      
003886          MOVE 9 TO WS-RESPERROR.                                 254400      
003887                                                                  254500      
003888    IF WS-MON = 1                                                 254600      
003889       DISPLAY "  INPUT CSI="  WS-DE-CSI  " SUC="  WS-DE-SUCURSAL 254700      
003890               " CAJA="        WS-DE-CAJA " SIST=" WS-DE-SISTEMA  254800      
003891               " MONEDA =   "  WS-DE-MONEDA.                      254900      
003892    IF WS-DE-MONEDA-ALFA = SPACES OR WS-DE-MONEDA = ZEROS         255000      
003893       IF WS-MON = 1                                              255100      
003894          DISPLAY "ENTRE POR VALIDACION MONEDA "WS-DE-MONEDA      255200      
003895          MOVE 01 TO WS-DE-MONEDA                                 255300      
003896       ELSE                                                       255400      
003897          MOVE 01 TO WS-DE-MONEDA                                 255500      
003898    ELSE                                                          255600      
003899       IF WS-DE-MONEDA-ALFA IS NOT NUMERIC                        255700      
003900          MOVE 16 TO WS-RESPERROR                                 255800      
003901       ELSE                                                       255900      
003902          IF NOT WS-DE-MONEDA-OK                                  256000      
003903             MOVE 16 TO WS-RESPERROR.                             256100      
003904    IF WS-RESPERROR = 0                                           256200      
003905     IF WS-DE-CAJA-ALFA = "00"                                    256300      
003906       IF WS-DE-SUCURSAL-ALFA IS NOT NUMERIC OR                   256400      
003907          WS-DE-SUCURSAL = ZEROS                                  256500      
003908          IF WS-DE-CSI-ALFA IS NOT NUMERIC OR WS-DE-CSI = ZEROS   256600      
003909             MOVE WS-HDR-CCR-DES TO WS-DE-CSI                     256700      
003910             MOVE WS-HDR-SUC     TO WS-DE-SUCURSAL                256800      
003911             MOVE WS-HDR-CAJ     TO WS-DE-CAJA                    256900      
003912          ELSE                                                    257000      
003913             IF WS-DE-CSIOK                                       257100      
003914                IF WS-DE-CSI = WS-HDR-CCR-DES                     257200      
003915                   MOVE WS-HDR-CCR-DES TO WS-DE-CSI               257300      
003916                   MOVE ZEROS          TO WS-DE-SUCURSAL          257400      
003917                   MOVE ZEROS          TO WS-DE-CAJA              257500      
003918                ELSE                                              257600      
003919                   MOVE WS-TEXTO TO WS-REM-TEXTO-SE               257700      
003920                   STRING WS-HOME, WS-POS,                        257800      
003921                          "MENSAJE ENVIADO A C.S.I., ESPERE P.F.",257900      
003922                          WS-ETX DELIMITED BY SIZE INTO           258000      
003923                          WS-DATOS-RESPUESTA WITH POINTER         258100      
003924                          WS-LONG-MSG                             258200      
003925                   PERFORM 40000-SENDCOMS                         258300      
003926                   MOVE WS-REM-TEXTO-SE TO WS-TEXTO               258400      
003927                   MOVE WS-DE-CSI TO WS-HDR-CCR-DES               258500      
003928                   MOVE 2         TO WS-HDR-RES                   258600      
003929                   MOVE 1         TO WS-DIRECCIONA                258700      
003930                   IF WS-MON = 1                                  258800      
003931                      DISPLAY "WS-MSG "WS-MSG                     258900      
003932                   ELSE                                           259000      
003933                      NEXT SENTENCE                               259100      
003934             ELSE                                                 259200      
003935                MOVE 15 TO WS-RESPERROR                           259300      
003936       ELSE                                                       259400      
003937          MOVE WS-HDR-CCR-DES TO WS-DE-CSI                        259500      
003938          MOVE ZEROS          TO WS-DE-CAJA                       259600      
003939     ELSE                                                         259700      
003940       IF WS-DE-SUCURSAL-ALFA IS NOT NUMERIC OR                   259800      
003941          WS-DE-SUCURSAL = ZEROS                                  259900      
003942          MOVE WS-HDR-CCR-DES TO WS-DE-CSI                        260000      
003943          MOVE WS-HDR-SUC     TO WS-DE-SUCURSAL                   260100      
003944       ELSE                                                       260200      
003945          IF WS-DE-CSI-ALFA IS NOT NUMERIC OR WS-DE-CSI = ZEROS   260300      
003946             MOVE WS-HDR-CCR-DES TO WS-DE-CSI                     260400      
003947          ELSE                                                    260500      
003948             IF WS-DE-CSIOK                                       260600      
003949                IF WS-DE-CSI = WS-HDR-CCR-DES                     260700      
003950                   NEXT SENTENCE                                  260800      
003951                ELSE                                              260900      
003952                   MOVE WS-TEXTO TO WS-REM-TEXTO-SE               261000      
003953                   STRING WS-HOME, WS-POS,                        261100      
003954                          "MENSAJE ENVIADO A C.S.I., ESPERE P.F.",261200      
003955                          WS-ETX DELIMITED BY SIZE INTO           261300      
003956                          WS-DATOS-RESPUESTA WITH POINTER         261400      
003957                          WS-LONG-MSG                             261500      
003958                   PERFORM 40000-SENDCOMS                         261600      
003959                   MOVE WS-REM-TEXTO-SE TO WS-TEXTO               261700      
003960                   MOVE WS-DE-CSI TO WS-HDR-CCR-DES               261800      
003961                   MOVE 2         TO WS-HDR-RES                   261900      
003962                   MOVE 1         TO WS-DIRECCIONA                262000      
003963                   IF WS-MON = 1                                  262100      
003964                      DISPLAY "WS-MSG "WS-MSG                     262200      
003965                   ELSE                                           262300      
003966                      NEXT SENTENCE                               262400      
003967             ELSE                                                 262500      
003968                MOVE 15 TO WS-RESPERROR.                          262600      
003969    IF WS-DE-SISTEMA-ALFA IS NOT NUMERIC  OR                      262700      
003970       WS-DE-SISTEMA > 2264                                       262800      
003971       MOVE 13 TO WS-RESPERROR.                                   262900      
003972*   IF WS-DE-SUCURSAL > 999                                       263000      
003973*      MOVE 4  TO WS-RESPERROR.                                   263100      
003974    IF WS-DE-SISTEMA = ZEROS                                      263200      
003975       MOVE 1 TO WS-DE-SISTEMA.                                   263300      
003976    IF WS-DE-SISTEMA = 403                                        263600      
003977       MOVE WS-CSI-403 TO WS-CSI-VAL                              263700      
003978    ELSE IF WS-DE-SISTEMA = 703                                   263800      
003979       MOVE WS-CSI-703 TO WS-CSI-VAL.                             263900      
003980    IF WS-RESPERROR = 0                                           264000      
003981     IF ((WS-DE-SISTEMA = 403 AND WS-HDR-CCR-ORG NOT = WS-CSI-403)264200      
003982     OR (WS-DE-SISTEMA = 703 AND WS-HDR-CCR-ORG NOT = WS-CSI-703))264300      
003983          AND WS-HDR-RES NOT = 2                                  264400      
003984          MOVE WS-CSI-VAL    TO WS-HDR-CCR-DES                    264500      
003985          MOVE 2             TO WS-HDR-RES                        264600      
003986          MOVE 1             TO WS-DIRECCIONA.                    264700      
003987    IF WS-MON = 1                                                 264800      
003988       DISPLAY " OUTPUT CSI="  WS-DE-CSI  " SUC="  WS-DE-SUCURSAL 264900      
003989               " CAJA="        WS-DE-CAJA " SIST=" WS-DE-SISTEMA  265000      
003990               " MONEDA =   "  WS-DE-MONEDA                       265100      
003991               " MON FIJA=  "WS-DE-MDAFIJA.                       265200      
003992    IF WS-RESPERROR = 0 AND WS-DIRECCIONA = 0                     265300      
003993       PERFORM 20231-CARGA-LIB-505                                265400      
003994       IF WS-RESPERROR = 0                                        265500      
003995          PERFORM 20236-ARMA-RESPUESTA.                           265600      
003996 20231-CARGA-LIB-505.                                             265700      
003997    MOVE ZEROS TO WS-STATUS.                                      265800      
003998    IF WS-DE-CAJA-ALFA = SPACES AND WS-DE-SUCURSAL > ZEROS        265900      
003999          MOVE ALL ZEROS      TO WS-TOTALES-SUC WS-TOTALES-MOV    266000      
004000          MOVE WS-DE-SISTEMA  TO WS-TOT-SISTEMA                   266100      
004001          MOVE WS-DE-SUCURSAL TO WS-TOT-SUCURSAL                  266200      
004002          MOVE ZEROS          TO WS-TOT-CAJA                      266300      
004003          COMPUTE WS-TOT-MONEDA = WS-DE-MONEDA - 1                266400      
004004          IF WS-DE-SISNVO                                         266500      
004005             MOVE 74 TO WS-TOT-ADMOV-FUNCION                      266600      
004006                        WS-TOT-ADMOV-FUNCION-L011                 266655      
004007             PERFORM 20235-TOT-ADMOV-CAJA                         266700      
004008          ELSE                                                    266800      
004009             PERFORM 20232-CALL-SUC UNTIL WS-STATUS > 0           266900      
004010    ELSE                                                          267000      
004011       PERFORM 20235-CALL-CAJA.                                   267100      
004012                                                                  267200      
004013 20232-CALL-SUC.                                                  267300      
004014    MOVE 81             TO WS-TOT-FUN.                            267400      
004015    IF WS-MON = 1                                                 267500      
004016       DISPLAY "CALL CONBD " WS-TOTALES-MOV.                      267600      
004017*   IF NOT W88-CHQS-ANT AND WS-DE-SISTEMA = 1                     267700      
004018*      CALL "TOTXCAJA    IN LIB-L011500" USING WS-DATOS-ADMOV     267800      
004019*                                        GIVING WS-STATUS         267900      
004020*   ELSE                                                          268000      
004021*    IF NOT W88-S264-ANT AND (WS-DE-SISTEMA = 264 OR 1264 OR 2264)268100      
004022*       CALL "TOTAL       IN LIB-CONS264" USING WS-TOTALES-MOV    268200      
004023*                                         GIVING WS-STATUS        268300      
004024*    ELSE                                                         268400      
004025    IF WS-MON = 1                                                 268700      
004026       DISPLAY "STATUS       " WS-STATUS                          268800      
004027       DISPLAY "BACK CONBD 1 " WS-TOT-NUMCR(1) WS-TOT-IMPCR(1)    268900      
004028                               WS-TOT-NUMAB(1) WS-TOT-IMPAB(1)    269000      
004029       DISPLAY "BACK CONBD 2 " WS-TOT-NUMCR(2) WS-TOT-IMPCR(2)    269100      
004030                               WS-TOT-NUMAB(2) WS-TOT-IMPAB(2).   269200      
004031*      DISPLAY "BACK CONBD 3 " WS-TOT-NUMCR(3) WS-TOT-IMPCR(3)    269300      
004032*                              WS-TOT-NUMAB(3) WS-TOT-IMPAB(3)    269400      
004033*      DISPLAY "BACK CONBD 4 " WS-TOT-NUMCR(4) WS-TOT-IMPCR(4)    269500      
004034*                              WS-TOT-NUMAB(4) WS-TOT-IMPAB(4)    269600      
004035*      DISPLAY "BACK CONBD 5 " WS-TOT-NUMCR(5) WS-TOT-IMPCR(5)    269700      
004036*                              WS-TOT-NUMAB(5) WS-TOT-IMPAB(5).   269800      
004037    IF WS-STATUS > 0 OR WS-DE-SUCURSAL NOT = WS-TOT-SUCURSAL      269900      
004038       OR WS-DE-SISTEMA NOT = WS-TOT-SISTEMA                      270000      
004039       MOVE 01 TO WS-STATUS                                       270100      
004040       IF WS-SUC-SUCURSAL = WS-DE-SUCURSAL                        270200      
004041          PERFORM 20233-MOVE-TOT VARYING WS-I FROM 1 BY 1 UNTIL   270300      
004042                                 WS-I > 10                        270400      
004043       ELSE                                                       270500      
004044          MOVE 14 TO WS-RESPERROR                                 270600      
004045    ELSE                                                          270700      
004046       IF WS-DE-MONEDA  = WS-TOT-MONEDA                           270800      
004047          PERFORM 20234-SUMA-TOT VARYING WS-I FROM 1 BY 1 UNTIL   270900      
004048                              WS-I > 10.                          271000      
004049 20233-MOVE-TOT.                                                  271100      
004050    MOVE WS-SUC-NUMCR(WS-I) TO WS-TOT-NUMCR(WS-I).                271200      
004051    MOVE WS-SUC-IMPCR(WS-I) TO WS-TOT-IMPCR(WS-I).                271300      
004052    MOVE WS-SUC-NUMAB(WS-I) TO WS-TOT-NUMAB(WS-I).                271400      
004053    MOVE WS-SUC-IMPAB(WS-I) TO WS-TOT-IMPAB(WS-I).                271500      
004054 20234-SUMA-TOT.                                                  271600      
004055       ADD  WS-TOT-NUMCR(WS-I) TO WS-SUC-NUMCR(WS-I)              272000      
004056       ADD  WS-TOT-IMPCR(WS-I) TO WS-SUC-IMPCR(WS-I)              272100      
004057       ADD  WS-TOT-NUMAB(WS-I) TO WS-SUC-NUMAB(WS-I)              272200      
004058       ADD  WS-TOT-IMPAB(WS-I) TO WS-SUC-IMPAB(WS-I)              272300      
004059       MOVE WS-TOT-SUCURSAL TO WS-SUC-SUCURSAL.                   272400      
004060 20235-CALL-CAJA.                                                 272500      
004061    MOVE ALL ZEROS      TO WS-TOTALES-MOV.                        272600      
004062    MOVE WS-DE-SISTEMA  TO WS-TOT-SISTEMA.                        272700      
004063    MOVE WS-DE-SUCURSAL TO WS-TOT-SUCURSAL WS-TOT-ADMOV-SUCURSAL  272800      
004064                                       WS-TOT-ADMOV-SUCURSAL-L011.272855      
004065    MOVE WS-DE-CAJA     TO WS-TOT-CAJA WS-TOT-ADMOV-CAJA          272900      
004066                                       WS-TOT-ADMOV-CAJA-L011.    272955      
004067    MOVE WS-DE-MONEDA   TO WS-TOT-MONEDA WS-TOT-ADMOV-MONEDA      273000      
004068                                         WS-TOT-ADMOV-MONEDA-L011.273055      
004069                                                                  273080      
004070    MOVE 77-ADMOV-FECPROC         TO WS-TOT-ADMOV-FECAPLI-L011.   273100      
004071    MOVE 77-ADMOV-FECPROC-6DIG    TO WS-TOT-ADMOV-FECAPLI.        273155      
004072*   IF WS-MON = 1                                                 273200      
004073*      DISPLAY "CALL CONBD " WS-TOTALES-MOV.                      273300      
004074    IF WS-DE-SUCURSAL = ZEROS                                     273400      
004075       IF WS-DE-SISNVO                                            273500      
004076          MOVE 71 TO WS-TOT-ADMOV-FUNCION                         273600      
004077                     WS-TOT-ADMOV-FUNCION-L011                    273655      
004078          IF WS-DE-SISNVO1 OR WS-DE-SIS001                        273700      
004079                           OR WS-DE-SIS701 OR WS-DE-SIS018        273705      
004080                           OR WS-DE-SIS264 OR WS-DE-SIS404        273706      
004081                           OR WS-DE-SIS502                        273708      
004082                           OR WS-DE-SIS501                        273710      
004083             PERFORM 20235-TOT-ADMOV-CAJA                         273800      
004084          ELSE                                                    273900      
004085             PERFORM 20235-TOT-ADMOV-SIST                         274000      
004086       ELSE                                                       274100      
004087       IF  WS-DE-MONEDA  NOT = WS-DE-MDAFIJA AND                  274200      
004088          (WS-DE-SISTEMA   = 264 OR  WS-DE-SISTEMA   = 1264) OR   274300      
004089          (WS-DE-SISTEMA NOT = 264 AND WS-DE-SISTEMA NOT = 1264)  274400      
004090          PERFORM 20237-SIST-264-703                              274500      
004091          MOVE 82 TO WS-TOT-FUN                                   274600      
004092          PERFORM 20235-QUE-LIBRARY-ACT                           274700      
004093       ELSE                                                       274800      
004094          MOVE 83 TO WS-TOT-FUN                                   274900      
004095          PERFORM 20235-QUE-LIBRARY-ACT                           275000      
004096          MOVE WS-TOT-MONEDA      TO WS-DE-MDAFIJA                275100      
004097                                     WS-DE-MONEDA                 275200      
004098          IF WS-STATUS = 3                                        275300      
004099             MOVE 19      TO WS-RESPERROR                         275400      
004100             MOVE 0       TO WS-STATUS                            275500      
004101             MOVE 0       TO WS-DE-MDAFIJA                        275600      
004102          ELSE                                                    275700      
004103             NEXT SENTENCE                                        275800      
004104    ELSE                                                          275900      
004105       IF WS-DE-SISNVO OR WS-DE-SIS701 OR WS-DE-SIS264            276000      
004106                       OR WS-DE-SIS404 OR WS-DE-SIS018            276050      
004107          MOVE 71 TO WS-TOT-ADMOV-FUNCION                         276100      
004108                     WS-TOT-ADMOV-FUNCION-L011                    276155      
004109          PERFORM 20235-TOT-ADMOV-CAJA                            276200      
004110       ELSE                                                       276300      
004111       IF  WS-DE-MONEDA  NOT = WS-DE-MDAFIJA AND                  276400      
004112          (WS-DE-SISTEMA   = 264 OR  WS-DE-SISTEMA   = 1264) OR   276500      
004113          (WS-DE-SISTEMA NOT = 264 AND WS-DE-SISTEMA NOT = 1264)  276600      
004114         PERFORM 20237-SIST-264-703                               276700      
004115         MOVE 80 TO WS-TOT-FUN                                    276800      
004116         PERFORM 20235-QUE-LIBRARY-CON                            276900      
004117      ELSE                                                        277000      
004118         MOVE 81 TO WS-TOT-FUN                                    277100      
004119         PERFORM 20235-QUE-LIBRARY-CON                            277200      
004120         PERFORM 20235-MUEVE-CHQS                                 277300      
004121         IF WS-DE-SISTEMA  = WS-TOT-SISTEMA  AND                  277400      
004122            WS-DE-SUCURSAL = WS-TOT-SUCURSAL AND                  277500      
004123            WS-DE-CAJA     = WS-TOT-CAJA     AND                  277600      
004124            WS-STATUS      = 0                                    277700      
004125            MOVE WS-TOT-MONEDA    TO WS-DE-MONEDA                 277800      
004126                                     WS-DE-MDAFIJA                277900      
004127         ELSE                                                     278000      
004128            MOVE 0        TO WS-DE-MDAFIJA                        278100      
004129                             WS-STATUS                            278200      
004130            MOVE 19       TO WS-RESPERROR.                        278300      
004131    IF WS-MON = 1                                                 278400      
004132       DISPLAY "SISTEMA " WS-DE-SISTEMA " RESULT " WS-STATUS      278500      
004133       DISPLAY "RENGLON 1 " WS-TOT-NUMCR(1) " " WS-TOT-IMPCR(1)   278600      
004134                        " " WS-TOT-NUMAB(1) " " WS-TOT-IMPAB(1)   278700      
004135       DISPLAY "RENGLON 2 " WS-TOT-NUMCR(2) " " WS-TOT-IMPCR(2)   278800      
004136                        " " WS-TOT-NUMAB(2) " " WS-TOT-IMPAB(2)   278900      
004137       DISPLAY "RENGLON 3 " WS-TOT-NUMCR(3) " " WS-TOT-IMPCR(3)   279000      
004138                        " " WS-TOT-NUMAB(3) " " WS-TOT-IMPAB(3)   279100      
004139       DISPLAY "RENGLON 4 " WS-TOT-NUMCR(4) " " WS-TOT-IMPCR(4)   279200      
004140                        " " WS-TOT-NUMAB(4) " " WS-TOT-IMPAB(4)   279300      
004141       DISPLAY "RENGLON 5 " WS-TOT-NUMCR(5) " " WS-TOT-IMPCR(5)   279400      
004142                        " " WS-TOT-NUMAB(5) " " WS-TOT-IMPAB(5).  279500      
004143    IF WS-STATUS > 0                                              279600      
004144       MOVE 14 TO WS-RESPERROR.                                   279700      
004145*                                                                 279800      
004146 20235-MUEVE-CHQS.                                                279900      
004147*=================                                                280000      
004148     IF WS-DE-SISTEMA = 1                                         280100      
004149        PERFORM 20235-MUEVE-ADMOV-ADABASE-L011 VARYING WS-I FROM 1280200      
004150                BY 1 UNTIL WS-I > 10.                             280300      
004151*                                                                 280400      
004152 20235-QUE-LIBRARY-ACT.                                           280500      
004153*======================                                           280600      
004154*                                                                 281800      
004155 20235-QUE-LIBRARY-CON.                                           281900      
004156    IF NOT W88-CHQS-ANT AND WS-DE-SISTEMA = 0001                  282000      
004157       CALL "TOTXCAJA IN LIB-L011500" USING WS-DATOS-ADMOV-L011   282100      
004158                                   GIVING WS-STATUS.              282200      
004159*    ELSE                                                         282300      
004160*    IF NOT W88-S264-ANT AND (WS-DE-SISTEMA = 0264 OR 1264 OR 2264282400      
004161*       CALL "TOTAL IN LIB-CONS264" USING WS-TOTALES-MOV          282500      
004162*                                   GIVING WS-STATUS              282600      
004163 20235-TOT-ADMOV-SIST.                                            283000      
004164*=====================                                            283100      
004165     MOVE 71                      TO WS-TOT-ADMOV-FUNCION-30506   283200      
004166     MOVE WS-DE-SISTEMA           TO WS-TOT-ADMOV-PRODUCTO-30506  283300      
004167     IF WS-DE-SISTEMA = 500 OR = 66 OR 001                        283400      
004168        MOVE 500                  TO WS-TOT-ADMOV-SISTEMA-30506   283500      
004169     ELSE                                                         283600      
004170     IF WS-DE-SISTEMA = 1151                                      283700      
004171        MOVE 151                  TO WS-TOT-ADMOV-SISTEMA-30506   283800      
004172     ELSE                                                         283900      
004173      MOVE WS-DE-SISTEMA          TO WS-TOT-ADMOV-SISTEMA-30506.  284000      
004174                                                                  284055      
004175     MOVE 0                       TO WS-TOT-ADMOV-SUCURSAL-30506  284100      
004176                                     WS-TOT-ADMOV-CAJA-30506      284200      
004177     MOVE WS-DE-MONEDA            TO WS-TOT-ADMOV-MONEDA-30506    284300      
004178*JMF MOVE 77-ADMOV-FECPROC        TO WS-TOT-ADMOV-FECAPLI-30506   284400      
004179     MOVE 77-ADMOV-FECPROC-6DIG   TO WS-TOT-ADMOV-FECAPLI-30506.  284455      
004180                                                                  284500      
004181     MOVE 14           TO WS-RESPERROR.                           285200      
004182                                                                  285300      
004183 20235-TOT-ADMOV-CAJA.                                            285400      
004184*=====================                                            285500      
004185*    MOVE 71                      TO WS-TOT-ADMOV-FUNCION         285600      
004186     PERFORM 20215-DEFINE-SISTPROD.                               285700      
004187     MOVE WS-DE-SUCURSAL          TO WS-TOT-ADMOV-SUCURSAL        285800      
004188                                     WS-TOT-ADMOV-SUCURSAL-L011   285855      
004189     MOVE WS-DE-CAJA              TO WS-TOT-ADMOV-CAJA            285900      
004190                                     WS-TOT-ADMOV-CAJA-L011       285955      
004191     IF WS-DE-SISNVO1                                             286000      
004192        MOVE WS-DE-MONEDA         TO WS-DE-MDAFIJA                286100      
004193     ELSE                                                         286200      
004194     IF WS-DE-MONEDA NOT = WS-DE-MDAFIJA                          286300      
004195        IF WS-DE-MONEDA = ZEROS                                   286400      
004196           MOVE 1                 TO WS-DE-MDAFIJA                286500      
004197        ELSE                                                      286600      
004198        IF WS-DE-MONEDA > WS-DE-MDAFIJA                           286700      
004199           MOVE WS-DE-MONEDA      TO WS-DE-MDAFIJA.               286800      
004200     MOVE WS-DE-MDAFIJA           TO WS-DE-MONEDA                 286900      
004201                                     WS-TOT-ADMOV-MONEDA          287000      
004202                                     WS-TOT-ADMOV-MONEDA-L011     287055      
004203                                     WS-TOT-ADMOV-MONSIG          287100      
004204                                     WS-TOT-ADMOV-MONSIG-L011.    287155      
004205     MOVE 77-ADMOV-FECPROC        TO WS-TOT-ADMOV-FECAPLI-L011    287200      
004206     MOVE 77-ADMOV-FECPROC-6DIG   TO WS-TOT-ADMOV-FECAPLI         287255      
004207     MOVE 0                       TO WS-BAN-CALLL011-500          287260      
004208                                     WS-BAN-CALLL011-701          287265      
004209                                     WS-BAN-CALLL011-264          287270      
004210                                     WS-BAN-CALLL011-404          287275      
004211                                     WS-BAN-CALLL011-018          287278      
004212                                     WS-BAN-CALLL011-501          287280      
004213                                     WS-BAN-CALLL011-502.         287290      
004214     IF WS-DE-SIS001                                              287700      
004215        IF WKS-FECHA-S500 > 0                                     287752      
004216          MOVE WKS-FECHA-S500     TO WS-TOT-ADMOV-FECAPLI-L011    287757      
004217          CALL "TOTXCAJA IN LIB-L011500" USING WS-DATOS-ADMOV-L011287800      
004218                                        GIVING WS-RESULT          287900      
004219          MOVE 1  TO      WS-BAN-CALLL011-500                     287905      
004220        ELSE                                                      287952      
004221          CALL "TOTXCAJA IN LIB-L011500" USING WS-DATOS-ADMOV-L011287954      
004222                                        GIVING WS-RESULT          287956      
004223          MOVE 1  TO      WS-BAN-CALLL011-500                     287958      
004224     ELSE                                                         287962      
004225     IF WS-DE-SIS701 AND (WKS-NUMCSI = 10 OR 32)                  287964      
004226        IF WKS-FECHA-S701 > 0                                     287965      
004227          MOVE WKS-FECHA-S701     TO WS-TOT-ADMOV-FECAPLI-L011    287966      
004228          CALL "TOTXCAJA IN LIB-L011701" USING WS-DATOS-ADMOV-L011287967      
004229                                        GIVING WS-RESULT          287968      
004230          MOVE 1  TO      WS-BAN-CALLL011-701                     287969      
004231        ELSE                                                      287970      
004232          CALL "TOTXCAJA IN LIB-L011701" USING WS-DATOS-ADMOV-L011287975      
004233                                        GIVING WS-RESULT          287980      
004234          MOVE 1  TO      WS-BAN-CALLL011-701                     287985      
004235     ELSE                                                         287990      
004236     IF WS-DE-SIS264                                              287992      
004237        IF WKS-FECHA-S264 > 0                                     287994      
004238          MOVE WKS-FECHA-S264     TO WS-TOT-ADMOV-FECAPLI-L011    287996      
004239          CALL "TOTXCAJA IN LIB-L011264" USING WS-DATOS-ADMOV-L011287998      
004240                                        GIVING WS-RESULT          288000      
004241          MOVE 1  TO      WS-BAN-CALLL011-264                     288002      
004242        ELSE                                                      288004      
004243          CALL "TOTXCAJA IN LIB-L011264" USING WS-DATOS-ADMOV-L011288006      
004244                                        GIVING WS-RESULT          288008      
004245          MOVE 1  TO      WS-BAN-CALLL011-264                     288010      
004246     ELSE                                                         288012      
004247     IF WS-DE-SIS404 AND (WKS-NUMCSI = 4  OR 32)                  288014      
004248        IF WKS-FECHA-S404 > 0                                     288016      
004249          MOVE WKS-FECHA-S404     TO WS-TOT-ADMOV-FECAPLI-L011    288018      
004250          CALL "TOTXCAJA IN LIB-L011404" USING WS-DATOS-ADMOV-L011288020      
004251                                        GIVING WS-RESULT          288022      
004252          MOVE 1  TO      WS-BAN-CALLL011-404                     288024      
004253        ELSE                                                      288026      
004254          CALL "TOTXCAJA IN LIB-L011404" USING WS-DATOS-ADMOV-L011288028      
004255                                        GIVING WS-RESULT          288030      
004256          MOVE 1  TO      WS-BAN-CALLL011-404                     288032      
004257     ELSE                                                         288050      
004258     IF WS-DE-SIS501                                              288052      
004259        IF WKS-FECHA-S501 > 0                                     288054      
004260          MOVE WKS-FECHA-S501     TO WS-TOT-ADMOV-FECAPLI-L011    288056      
004261          CALL "TOTXCAJA IN LIB-L011501" USING WS-DATOS-ADMOV-L011288058      
004262                                        GIVING WS-RESULT          288060      
004263          MOVE 1  TO      WS-BAN-CALLL011-501                     288062      
004264        ELSE                                                      288064      
004265          CALL "TOTXCAJA IN LIB-L011501" USING WS-DATOS-ADMOV-L011288066      
004266                                        GIVING WS-RESULT          288068      
004267          MOVE 1  TO      WS-BAN-CALLL011-501                     288070      
004268     ELSE                                                         289000      
004269     IF WS-DE-SIS018 AND (WKS-NUMCSI = 04 OR 32)                  289100      
004270        IF WKS-FECHA-S018 > 0                                     289200      
004271          MOVE WKS-FECHA-S018     TO WS-TOT-ADMOV-FECAPLI-L011    289300      
004272          CALL "TOTXCAJA IN LIB-L011018" USING WS-DATOS-ADMOV-L011289400      
004273                                        GIVING WS-RESULT          289500      
004274          MOVE 1  TO      WS-BAN-CALLL011-018                     289600      
004275        ELSE                                                      289700      
004276          CALL "TOTXCAJA IN LIB-L011018" USING WS-DATOS-ADMOV-L011289800      
004277                                        GIVING WS-RESULT          289900      
004278          MOVE 1  TO      WS-BAN-CALLL011-018                     290000      
004279     ELSE                                                         290010      
004280     IF WS-DE-SIS502 AND (WKS-NUMCSI = 10 OR 32)                  290012      
004281       IF WKS-FECHA-S502 > 0                                      290014      
004282          MOVE WKS-FECHA-S502     TO WS-TOT-ADMOV-FECAPLI-L011    290016      
004283          CALL "TOTXCAJA IN LIB-L011502" USING WS-DATOS-ADMOV-L011290018      
004284                                        GIVING WS-RESULT          290020      
004285          MOVE 1  TO      WS-BAN-CALLL011-502                     290022      
004286        ELSE                                                      290024      
004287          CALL "TOTXCAJA IN LIB-L011502" USING WS-DATOS-ADMOV-L011290026      
004288                                        GIVING WS-RESULT          290028      
004289          MOVE 1  TO      WS-BAN-CALLL011-502.                    290030      
004290                                                                  291000      
004291                                                                  291455      
004292     PERFORM 20235-LIMPIA-VARIABLES                               291460      
004293             VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 20.            291465      
004294                                                                  291480      
004295     IF WS-RESULT = 0                                             291500      
004296        IF WS-BAN-CALLL011-500 = 1 OR WS-BAN-CALLL011-701 = 1 OR  291555      
004297           WS-BAN-CALLL011-264 = 1 OR WS-BAN-CALLL011-404 = 1 OR  291557      
004298           WS-BAN-CALLL011-018 = 1 OR WS-BAN-CALLL011-502 = 1     291558      
004299           OR  WS-BAN-CALLL011-501 = 1                            291559      
004300           MOVE WS-TOT-ADMOV-MONEDA-L011  TO WS-DE-MONEDA         291560      
004301           MOVE WS-TOT-ADMOV-MONSIG-L011  TO WS-DE-MDAFIJA        291565      
004302           PERFORM 20235-MUEVE-ADMOV-ADABASE-L011 VARYING WS-I    291570      
004303                   FROM 1 BY 1 UNTIL WS-I > 20                    291575      
004304        ELSE                                                      291580      
004305           MOVE WS-TOT-ADMOV-MONEDA  TO WS-DE-MONEDA              291600      
004306           MOVE WS-TOT-ADMOV-MONSIG  TO WS-DE-MDAFIJA             291700      
004307           PERFORM 20235-MUEVE-ADMOV-ADABASE VARYING WS-I FROM 1  291800      
004308                   BY 1 UNTIL WS-I > 20                           291900      
004309     ELSE                                                         292000      
004310        PERFORM 20235-MUEVE-CEROS-RESPUESTA                       292010      
004311                VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 20          292020      
004312        MOVE 14           TO WS-RESPERROR.                        292100      
004313                                                                  292200      
004314 20235-LIMPIA-VARIABLES.                                          292292      
004315*=======================                                          292293      
004316                                                                  292294      
004317     MOVE ZERO    TO WS-TOT-NUMCR(WS-I)                           292295      
004318                     WS-TOT-IMPCR(WS-I)                           292296      
004319                     WS-TOT-NUMAB(WS-I)                           292297      
004320                     WS-TOT-IMPAB(WS-I).                          292298      
004321                                                                  292299      
004322 20235-MUEVE-ADMOV-ADABASE.                                       292300      
004323*==========================                                       292301      
004324     MOVE WS-TOT-ADMOV-NUMCR(WS-I)        TO WS-TOT-NUMCR(WS-I)   292302      
004325     MOVE WS-TOT-ADMOV-IMPCR(WS-I)        TO WS-TOT-IMPCR(WS-I)   292303      
004326     MOVE WS-TOT-ADMOV-NUMAB(WS-I)        TO WS-TOT-NUMAB(WS-I)   292304      
004327     MOVE WS-TOT-ADMOV-IMPAB(WS-I)        TO WS-TOT-IMPAB(WS-I).  292305      
004328                                                                  292306      
004329 20235-MUEVE-ADMOV-ADABASE-L011.                                  292307      
004330*===============================                                  292308      
004331                                                                  292309      
004332     MOVE WS-TOT-ADMOV-NUMCR-L011(WS-I)   TO WS-TOT-NUMCR(WS-I)   292310      
004333     MOVE WS-TOT-ADMOV-IMPCR-L011(WS-I)   TO WS-TOT-IMPCR(WS-I)   292311      
004334     MOVE WS-TOT-ADMOV-NUMAB-L011(WS-I)   TO WS-TOT-NUMAB(WS-I)   292312      
004335     MOVE WS-TOT-ADMOV-IMPAB-L011(WS-I)   TO WS-TOT-IMPAB(WS-I).  292313      
004336                                                                  292990      
004337 20235-MUEVE-CEROS-RESPUESTA.                                     293515      
004338*============================                                     293520      
004339     MOVE ZERO                           TO WS-TOT-NUMCR(WS-I)    293525      
004340                                            WS-TOT-IMPCR(WS-I)    293530      
004341                                            WS-TOT-NUMAB(WS-I)    293535      
004342                                            WS-TOT-IMPAB(WS-I).   293540      
004343                                                                  293600      
004344 20236-ARMA-RESPUESTA.                                            293700      
004345    MOVE SPACES TO WS-DS-TOT-DESC(1)   WS-DS-TOT-DESC(2)          293800      
004346         WS-DS-TOT-DESC(3)   WS-DS-TOT-DESC(4) WS-DS-TOT-DESC(5)  293900      
004347         WS-DS-TOT-DESC(6)   WS-DS-TOT-DESC(7) WS-DS-TOT-DESC(8)  294000      
004348         WS-DS-TOT-DESC(9)   WS-DS-TOT-DESC(10).                  294100      
004349    MOVE "TOTAL" TO          WS-DS-TOT-DESC(11).                  294200      
004350    IF WS-DE-SISTEMA = 001                                        294300      
004351       MOVE "SISTEMA DE CHEQUES"   TO WS-DS-DESCSIS               294400      
004352       MOVE "CHEQUES       "       TO WS-DS-TOT-DESC(1)           294500      
004353       MOVE "SVO.BUEN COBRO"       TO WS-DS-TOT-DESC(2)           294600      
004354       MOVE "              "       TO WS-DS-TOT-DESC(3)           294700      
004355       MOVE "              "       TO WS-DS-TOT-DESC(4)           294800      
004356       MOVE "              "       TO WS-DS-TOT-DESC(5)           294900      
004357    ELSE IF WS-DE-SISTEMA = 264                                   295000      
004358       MOVE "TRANSFERENCIA DE FONDOS     " TO WS-DS-DESCSIS       295100      
004359       MOVE "CHEQUES CAJA  "        TO WS-DS-TOT-DESC(1)          295200      
004360       MOVE "CH CERTIFICADO"        TO WS-DS-TOT-DESC(2)          295300      
004361       MOVE "ORDEN DE PAGO "        TO WS-DS-TOT-DESC(3)          295400      
004362       MOVE "ORDEN DE ABONO"        TO WS-DS-TOT-DESC(4)          295500      
004363       MOVE "POSTDATADOS NC"        TO WS-DS-TOT-DESC(5)          295600      
004364       MOVE "EQUIV.MON.NAC."        TO WS-DS-TOT-DESC(6)          295700      
004365       MOVE "GASTOS O.P M.N"        TO WS-DS-TOT-DESC(7)          295800      
004366       MOVE "SERVS.DE T. I."        TO WS-DS-TOT-DESC(8)          295900      
004367       MOVE "GIROS         "        TO WS-DS-TOT-DESC(9)          296000      
004368*   ELSE IF WS-DE-SISTEMA = 600                                   296100      
004369*      MOVE "HIPOTECARIOS       "          TO WS-DS-DESCSIS       296200      
004370*      MOVE "ALTAS         "        TO WS-DS-TOT-DESC(1)          296300      
004371*      MOVE "MOVIMIENTOS   "        TO WS-DS-TOT-DESC(2)          296400      
004372*      MOVE "MORATORIOS    "        TO WS-DS-TOT-DESC(3)          296500      
004373*      MOVE "MODIFICACIONES"        TO WS-DS-TOT-DESC(4)          296600      
004374    ELSE IF WS-DE-SISTEMA = 066                                   296700      
004375       MOVE "CUENTA MAESTRA     "          TO WS-DS-DESCSIS       296800      
004376       MOVE "MOVTOS DEL DIA"        TO WS-DS-TOT-DESC(1)          296900      
004377       MOVE "MOVTOS FEC.VAL"        TO WS-DS-TOT-DESC(2)          297000      
004378       MOVE "DEPOS. S.B.C. "        TO WS-DS-TOT-DESC(3)          297100      
004379       MOVE "CANCELACIONES "        TO WS-DS-TOT-DESC(4)          297200      
004380       MOVE "AUTORIZ. PEND."        TO WS-DS-TOT-DESC(5)          297300      
004381       MOVE "NO CONTABLES. "        TO WS-DS-TOT-DESC(6)          297400      
004382       MOVE "ELIMINACIONES "        TO WS-DS-TOT-DESC(9)          297500      
004383*   ELSE IF WS-DE-SISTEMA = 400                                   297600      
004384*      MOVE "CARTERA            "          TO WS-DS-DESCSIS       297700      
004385*      MOVE "ENTRADAS      "        TO WS-DS-TOT-DESC(1)          297800      
004386*      MOVE "SALIDAS       "        TO WS-DS-TOT-DESC(2)          297900      
004387*      MOVE "INCREMENTOS   "        TO WS-DS-TOT-DESC(3)          298000      
004388*      MOVE "CREDIPERSONAL "        TO WS-DS-TOT-DESC(4)          298100      
004389*      MOVE "DISP. AUTORIZ."        TO WS-DS-TOT-DESC(5)          298200      
004390*      MOVE "              "        TO WS-DS-TOT-DESC(6)          298300      
004391*      MOVE "              "        TO WS-DS-TOT-DESC(7)          298400      
004392    ELSE IF WS-DE-SISTEMA = 151                                   298500      
004393       MOVE "LINEAS SERV/CREDITO"          TO WS-DS-DESCSIS       298600      
004394       MOVE "NO CONTABLES  "        TO WS-DS-TOT-DESC(1)          298700      
004395       MOVE "              "        TO WS-DS-TOT-DESC(2)          298800      
004396       MOVE "              "        TO WS-DS-TOT-DESC(3)          298900      
004397       MOVE "              "        TO WS-DS-TOT-DESC(4)          299000      
004398    ELSE IF WS-DE-SISTEMA = 408                                   299100      
004399       MOVE "LINEAS DE CREDITO  "          TO WS-DS-DESCSIS       299200      
004400       MOVE "APERT. LINEA  "        TO WS-DS-TOT-DESC(1)          299300      
004401       MOVE "DISPOSICIONES "        TO WS-DS-TOT-DESC(2)          299400      
004402       MOVE "PAGOS         "        TO WS-DS-TOT-DESC(3)          299500      
004403       MOVE "NO CONTABLES  "        TO WS-DS-TOT-DESC(4)          299600      
004404       MOVE "              "        TO WS-DS-TOT-DESC(5)          299700      
004405       MOVE "              "        TO WS-DS-TOT-DESC(6)          299800      
004406       MOVE "              "        TO WS-DS-TOT-DESC(7)          299900      
004407       MOVE "              "        TO WS-DS-TOT-DESC(8)          300000      
004408       MOVE "ELIMINACIONES "        TO WS-DS-TOT-DESC(9)          300100      
004409*   ELSE IF WS-DE-SISTEMA = 044                                   300200      
004410*      MOVE "SISTEMA DE PAGOS        "    TO WS-DS-DESCSIS        300300      
004411*      MOVE "PAGOS         "        TO WS-DS-TOT-DESC(1)          300400      
004412*      MOVE "              "        TO WS-DS-TOT-DESC(2)          300500      
004413*      MOVE "              "        TO WS-DS-TOT-DESC(3)          300600      
004414*      MOVE "              "        TO WS-DS-TOT-DESC(4)          300700      
004415*      MOVE "              "        TO WS-DS-TOT-DESC(5)          300800      
004416    ELSE IF WS-DE-SISTEMA = 403                                   300900      
004417       MOVE "SIST. CREDITO EMPRESARIAL"    TO WS-DS-DESCSIS       301000      
004418       MOVE "CARTERA PROPIA"        TO WS-DS-TOT-DESC(1)          301100      
004419       MOVE "CARTERA REDESC"        TO WS-DS-TOT-DESC(2)          301200      
004420       MOVE "FIDEICOMISOS  "        TO WS-DS-TOT-DESC(3)          301300      
004421       MOVE "              "        TO WS-DS-TOT-DESC(4)          301400      
004422       MOVE "              "        TO WS-DS-TOT-DESC(5)          301500      
004423       MOVE "              "        TO WS-DS-TOT-DESC(6)          301600      
004424       MOVE "              "        TO WS-DS-TOT-DESC(7)          301700      
004425       MOVE "ELIMINACIONES "        TO WS-DS-TOT-DESC(9)          301800      
004426    ELSE IF WS-DE-SISTEMA = 404                                   303000      
004427       MOVE "CREDITO  BANAMEX          "    TO WS-DS-DESCSIS      303100      
004428       MOVE "PERS.(CONSUMO)"        TO WS-DS-TOT-DESC(1)          303200      
004429       MOVE "AUTO.(CONSUMO)"        TO WS-DS-TOT-DESC(2)          303300      
004430       MOVE "T.PRIV.(CONS.)"        TO WS-DS-TOT-DESC(3)          303400      
004431       MOVE "HIPOTECARIOS  "        TO WS-DS-TOT-DESC(4)          303500      
004432       MOVE "EMPRESARIAL   "        TO WS-DS-TOT-DESC(5)          303600      
004433       MOVE "REFINANCIADO  "        TO WS-DS-TOT-DESC(6)          303700      
004434       MOVE "REESTRUCTURA  "        TO WS-DS-TOT-DESC(7)          303800      
004435       MOVE "UDIS          "        TO WS-DS-TOT-DESC(8)          303900      
004436       MOVE "ELIMINACIONES "        TO WS-DS-TOT-DESC(9)          304000      
004437    ELSE IF WS-DE-SISTEMA = 500                                   304100      
004438       MOVE "SISTEMA DE AHORROS        "    TO WS-DS-DESCSIS      304200      
004439       MOVE "DEPOSITOS     "        TO WS-DS-TOT-DESC(1)          304300      
004440       MOVE "RETIROS       "        TO WS-DS-TOT-DESC(2)          304400      
004441       MOVE "CANCELACIONES "        TO WS-DS-TOT-DESC(3)          304500      
004442       MOVE "BLOQUEOS      "        TO WS-DS-TOT-DESC(4)          304600      
004443       MOVE "DESBLOQUEOS   "        TO WS-DS-TOT-DESC(5)          304700      
004444       MOVE "              "        TO WS-DS-TOT-DESC(6)          304800      
004445       MOVE "              "        TO WS-DS-TOT-DESC(7)          304900      
004446       MOVE "ELIMINACIONES "        TO WS-DS-TOT-DESC(9)          305000      
004447    ELSE IF WS-DE-SISTEMA = 1264                                  305100      
004448       MOVE "TRANS. DE FONDOS INTERNAC."    TO WS-DS-DESCSIS      305200      
004449       MOVE "ORDEN DE PAGO "        TO WS-DS-TOT-DESC(1)          305300      
004450       MOVE "COMISION      "        TO WS-DS-TOT-DESC(2)          305400      
004451       MOVE "CHEQUES       "        TO WS-DS-TOT-DESC(3)          305500      
004452       MOVE "EQUIV.MON.EXT."        TO WS-DS-TOT-DESC(4)          305600      
004453       MOVE "TARJETAS      "        TO WS-DS-TOT-DESC(5)          305700      
004454       MOVE "              "        TO WS-DS-TOT-DESC(6)          305800      
004455       MOVE "              "        TO WS-DS-TOT-DESC(7)          305900      
004456    ELSE IF WS-DE-SISTEMA = 703                                   306000      
004457       MOVE "REMESAS DEL EXTRANJERO    "    TO WS-DS-DESCSIS      306100      
004458       MOVE "REMESAS       "        TO WS-DS-TOT-DESC(1)          306200      
004459       MOVE "COMISION M.N. "        TO WS-DS-TOT-DESC(2)          306300      
004460       MOVE "EQUIV. M.N.   "        TO WS-DS-TOT-DESC(3)          306400      
004461       MOVE "CHEQUES       "        TO WS-DS-TOT-DESC(4)          306500      
004462       MOVE "REMESAS PAIS  "        TO WS-DS-TOT-DESC(5)          306600      
004463       MOVE "REMESAS EXTRAN"        TO WS-DS-TOT-DESC(6)          306700      
004464       MOVE "              "        TO WS-DS-TOT-DESC(7)          306800      
004465       MOVE "              "        TO WS-DS-TOT-DESC(8)          306900      
004466       MOVE "ELIMINACIONES "        TO WS-DS-TOT-DESC(9)          307000      
004467    ELSE IF WS-DE-SISTEMA = 84                                    307100      
004468       MOVE "INVERSION INTEGRAL.       "    TO WS-DS-DESCSIS      307200      
004469       MOVE "I.E.B. (CME)  "        TO WS-DS-TOT-DESC(1)          307300      
004470       MOVE "I.E.B.        "        TO WS-DS-TOT-DESC(2)          307400      
004471       MOVE "I.I.B. (18)   "        TO WS-DS-TOT-DESC(3)          307500      
004472       MOVE "I.I.B.        "        TO WS-DS-TOT-DESC(4)          307600      
004473       MOVE "INTEGRA 3     "        TO WS-DS-TOT-DESC(5)          307700      
004474       MOVE "INTEGRA 3 F.V."        TO WS-DS-TOT-DESC(6)          307800      
004475       MOVE "FONDO BNM     "        TO WS-DS-TOT-DESC(7)          307900      
004476       MOVE "F.I.B.ACCIONES"        TO WS-DS-TOT-DESC(8)          308000      
004477       MOVE "ELIMINACIONES "        TO WS-DS-TOT-DESC(9)          308100      
004478    ELSE IF WS-DE-SISTEMA = 1151                                  308200      
004479       MOVE "LINEAS SERV/CREDITO.      "    TO WS-DS-DESCSIS      308300      
004480       MOVE "ALTAS         "        TO WS-DS-TOT-DESC(1)          308400      
004481       MOVE "BAJAS         "        TO WS-DS-TOT-DESC(2)          308500      
004482       MOVE "CAMBIOS       "        TO WS-DS-TOT-DESC(3)          308600      
004483    ELSE IF WS-DE-SISTEMA = 701                                   308700      
004484       MOVE "SISTEMA DE PAGOS          "    TO WS-DS-DESCSIS      308800      
004485       MOVE "PAGO DE SERV. "        TO WS-DS-TOT-DESC(1)          308900      
004486       MOVE "PAGO IMP.MATUT"        TO WS-DS-TOT-DESC(2)          309000      
004487       MOVE "PAGO IMP.VESP."        TO WS-DS-TOT-DESC(3)          309100      
004488       MOVE "CHEQS. DEVUEL."        TO WS-DS-TOT-DESC(4)          309200      
004489       MOVE "CORRECCIONES  "        TO WS-DS-TOT-DESC(5)          309300      
004490       MOVE "COM. VENT.    "        TO WS-DS-TOT-DESC(6)          309400      
004491       MOVE "NO CONTABLES  "        TO WS-DS-TOT-DESC(7)          309500      
004492       MOVE "ELIMINACIONES "        TO WS-DS-TOT-DESC(9)          309600      
004493    ELSE IF WS-DE-SISTEMA = 2264                                  309700      
004494       MOVE "SPEUA                     "    TO WS-DS-DESCSIS      309800      
004495       MOVE "ORD. ENVIADAS "        TO WS-DS-TOT-DESC(1)          309900      
004496       MOVE "ORD. RECIBIDAS"        TO WS-DS-TOT-DESC(2)          310000      
004497       MOVE "DEV. ENVIADAS "        TO WS-DS-TOT-DESC(3)          310100      
004498       MOVE "DEV. RECIBIDAS"        TO WS-DS-TOT-DESC(4)          310200      
004499    ELSE IF WS-DE-SISTEMA = 018                                   310210      
004500       MOVE "ADMINISTRACION DE EFECTIVO"    TO WS-DS-DESCSIS      310220      
004501       MOVE "OPER. C/CAJERO"        TO WS-DS-TOT-DESC(1)          310230      
004502    ELSE                                                          310300      
004503       MOVE "SISTEMA NO CALIFICADO       " TO WS-DS-DESCSIS.      310400      
004504    MOVE ZEROS TO WS-NUMCR WS-IMPCR WS-NUMAB WS-IMPAB.            310500      
004505    PERFORM 20240-MOVE-SCREEN VARYING WS-I FROM 1 BY 1 UNTIL      310600      
004506                              WS-I > 10.                          310700      
004507    MOVE WS-NUMCR TO WS-DS-TOT-NUMCR(11).                         310800      
004508    MOVE WS-IMPCR TO WS-DS-TOT-IMPCR(11).                         310900      
004509    MOVE WS-NUMAB TO WS-DS-TOT-NUMAB(11).                         311000      
004510    MOVE ZEROS TO WS-NUMCR WS-IMPCR WS-NUMAB WS-IMPAB.            311100      
004511    PERFORM 20240-MOVE-SCREEN VARYING WS-I FROM 1 BY 1 UNTIL      311200      
004512                              WS-I > 10.                          311300      
004513*   IF WS-DE-SISTEMA = 84                                         311400      
004514*      MOVE SPACES TO WS-DS-ADMOV-TOT(7).                         311500      
004515    MOVE WS-NUMCR TO WS-DS-TOT-NUMCR(11).                         311600      
004516    MOVE WS-IMPCR TO WS-DS-TOT-IMPCR(11).                         311700      
004517    MOVE WS-NUMAB TO WS-DS-TOT-NUMAB(11).                         311800      
004518    MOVE WS-IMPAB TO WS-DS-TOT-IMPAB(11).                         311900      
004519    STRING WS-CLEAR                                               312000      
004520           WS-DE-CSI,                                             312100      
004521           WS-DE-SUCURSAL,                                        312200      
004522           WS-DE-CAJA,                                            312300      
004523           WS-DE-SISTEMA,                                         312400      
004524           WS-DE-MONEDA,                                          312500      
004525           " ",                                                   312600      
004526           WS-DS-DESCSIS,                                         312700      
004527      WS-DS-ADMOV-TOT(1), WS-DS-ADMOV-TOT(2), WS-DS-ADMOV-TOT(3), 312800      
004528      WS-DS-ADMOV-TOT(4), WS-DS-ADMOV-TOT(5), WS-DS-ADMOV-TOT(6), 312900      
004529      WS-DS-ADMOV-TOT(7), WS-DS-ADMOV-TOT(8), WS-DS-ADMOV-TOT(9), 313000      
004530      WS-DS-ADMOV-TOT(10),WS-DS-ADMOV-TOT(11),                    313100      
004531           "    ",                                                313200      
004532          "                             TOTALES POR SISTEMA    ", 313300      
004533           WS-TAB,                                                313400      
004534           WS-DESPROTEGE,                                         313500      
004535           WS-POS-05-60,                                          313600      
004536           WS-DE-MDAFIJA,                                         313700      
004537           WS-PROTEGE,                                            313800      
004538           WS-ETX                                                 313900      
004539           DELIMITED BY SIZE INTO WS-DATOS-RESPUESTA              314000      
004540           WITH POINTER WS-LONG-MSG.                              314100      
004541*                                                                 314200      
004542 20237-SIST-264-703.                                              314300      
004543    IF WS-DE-SISTEMA = 264 OR 1264 OR 703                         314400      
004544       MOVE WS-TOT-MONEDA TO WS-DE-MDAFIJA.                       314500      
004545$RESET OMIT                                                       317100      
004546 20240-MOVE-SCREEN.                                               317200      
004547      MOVE WS-TOT-NUMCR (WS-I)   TO WS-DS-TOT-NUMCR(WS-I).        317300      
004548      MOVE WS-TOT-IMPCR (WS-I)   TO WS-DS-TOT-IMPCR(WS-I).        317400      
004549      MOVE WS-TOT-NUMAB (WS-I)   TO WS-DS-TOT-NUMAB(WS-I).        317500      
004550      MOVE WS-TOT-IMPAB (WS-I)   TO WS-DS-TOT-IMPAB(WS-I).        317600      
004551      MOVE WS-TOT-NUMCR (WS-I)   TO WS-DS-TOSA1-NUMCAR(WS-I).     317700      
004552      MOVE WS-TOT-IMPCR (WS-I)   TO WS-DS-TOSA1-IMPCAR(WS-I).     317800      
004553      MOVE WS-TOT-NUMAB (WS-I)   TO WS-DS-TOSA1-NUMABO(WS-I).     317900      
004554      MOVE WS-TOT-IMPAB (WS-I)   TO WS-DS-TOSA1-IMPABO(WS-I).     318000      
004555      MOVE 2                     TO WS-DS-TOSA1-CVESER(WS-I).     318100      
004556      IF (WS-DE-SISTEMA = 404 AND WS-I > 8) OR                    318300      
004557*        (WS-DE-SISTEMA =  66 AND WS-I > 4) OR                    318400      
004558         (WS-DE-SISTEMA =1264 AND WS-I > 1) OR                    318500      
004559         (WS-DE-SISTEMA =  84 AND WS-I > 0) OR                    318600      
004560         (WS-DE-SISTEMA = 701 AND WS-I > 6) OR                    318700      
004561         (WS-DE-SISTEMA = 408 AND WS-I > 3) OR                    318800      
004562         (WS-DE-SISTEMA = 403 AND WS-I > 8) OR                    318900      
004563         (WS-DE-SISTEMA = 703 AND WS-I > 8) OR                    319000      
004564         (WS-DE-SISTEMA = 018 AND WS-I > 1)                       319050      
004565         NEXT SENTENCE                                            319100      
004566      ELSE                                                        319200      
004567         ADD  WS-TOT-NUMCR (WS-I)   TO WS-NUMCR                   319300      
004568         ADD  WS-TOT-IMPCR (WS-I)   TO WS-IMPCR                   319400      
004569         IF WS-DE-SISTEMA = 264 AND WS-I = 5                      319500      
004570            NEXT SENTENCE                                         319600      
004571         ELSE                                                     319700      
004572            ADD  WS-TOT-NUMAB (WS-I)   TO WS-NUMAB                319800      
004573            ADD  WS-TOT-IMPAB (WS-I)   TO WS-IMPAB                319900      
004574            IF WS-DE-SISTEMA = 264 AND WS-I = 4                   320000      
004575               SUBTRACT WS-TOT-NUMCR (WS-I) FROM WS-NUMCR         320100      
004576               SUBTRACT WS-TOT-IMPCR (WS-I) FROM WS-IMPCR.        320200      
004577***********************************************************       320300      
004578*                                                         *       320400      
004579*              20240-CONSULTA-SALDOS                      *       320500      
004580*                                                         *       320600      
004581***********************************************************       320700      
004582 20240-CONSULTA-SALDOS.                                           320800      
004583    IF WS-MON = 1                                                 320900      
004584       DISPLAY "STRING "  WS-REM-TEXTO-SE.                        321000      
004585    MOVE SPACES TO WS-DE-SISTEMA-ALFA.                            321100      
004586    IF WS-MON = 1                                                 321200      
004587       DISPLAY "STRING "  WS-REM-TEXTO-SE.                        321300      
004588    UNSTRING WS-REM-TEXTO-SE DELIMITED BY WS-FS OR "@" INTO       321400      
004589             WS-DE-SISTEMA WS-DE-MONEDA.                          321500      
004590    IF WS-DE-SISTEMA-ALFA IS NOT NUMERIC OR WS-DE-SISTEMA > 1264  321600      
004591       MOVE 13 TO WS-RESPERROR.                                   321700      
004592    IF WS-DE-SISTEMA = ZEROS                                      321800      
004593       MOVE 1 TO WS-DE-SISTEMA.                                   321900      
004594    IF WS-DE-MONEDA-ALFA = SPACES OR WS-DE-MONEDA = 0             322000      
004595       MOVE 01 TO WS-DE-MONEDA                                    322100      
004596    ELSE                                                          322200      
004597       IF WS-DE-MONEDA-ALFA IS NOT NUMERIC                        322300      
004598          MOVE 16 TO WS-RESPERROR                                 322400      
004599       ELSE                                                       322500      
004600          IF NOT WS-DE-MONEDA-OK                                  322600      
004601             MOVE 16 TO WS-RESPERROR.                             322700      
004602    IF WS-MON = 1                                                 322800      
004603       DISPLAY " SISTEMA   ="  WS-DE-SISTEMA " " WS-DE-MONEDA.    322900      
004604    IF WS-RESPERROR = 0                                           323000      
004605       MOVE 0 TO WS-DE-CAJA WS-DE-SUCURSAL                        323100      
004606       PERFORM 20231-CARGA-LIB-505                                323200      
004607       IF WS-RESPERROR = 0                                        323300      
004608          MOVE ZEROS TO WS-NUMCR WS-IMPCR WS-NUMAB WS-IMPAB       323400      
004609          PERFORM 20242-SUMA VARYING WS-I FROM 1 BY 1 UNTIL       323500      
004610                                     WS-I >    10                 323600      
004611          PERFORM 20245-ARMA-RESPUESTA THRU 20245-EXIT.           323700      
004612 20242-SUMA.                                                      323800      
004613    IF (WS-DE-SISTEMA = 404 AND WS-I > 8) OR                      324000      
004614*      (WS-DE-SISTEMA = 66  AND WS-I > 4) OR                      324100      
004615       (WS-DE-SISTEMA = 84  AND WS-I > 0) OR                      324200      
004616       (WS-DE-SISTEMA = 701 AND WS-I > 6) OR                      324300      
004617       (WS-DE-SISTEMA =1264 AND WS-I > 1) OR                      324400      
004618       (WS-DE-SISTEMA = 408 AND WS-I > 3) OR                      324500      
004619       (WS-DE-SISTEMA = 403 AND WS-I > 8) OR                      324600      
004620       (WS-DE-SISTEMA = 703 AND WS-I > 8) OR                      324700      
004621       (WS-DE-SISTEMA = 018 AND WS-I > 1)                         324750      
004622       NEXT SENTENCE                                              324800      
004623    ELSE                                                          324900      
004624       ADD  WS-TOT-NUMCR(WS-I) TO WS-NUMCR                        325000      
004625       ADD  WS-TOT-IMPCR(WS-I) TO WS-IMPCR                        325100      
004626       IF WS-DE-SISTEMA = 264 AND WS-I = 5                        325200      
004627          NEXT SENTENCE                                           325300      
004628       ELSE                                                       325400      
004629          ADD  WS-TOT-NUMAB(WS-I) TO WS-NUMAB                     325500      
004630          ADD  WS-TOT-IMPAB(WS-I) TO WS-IMPAB                     325600      
004631          IF WS-DE-SISTEMA = 264 AND WS-I = 4                     325700      
004632             SUBTRACT WS-TOT-NUMCR (WS-I) FROM WS-NUMCR           325800      
004633             SUBTRACT WS-TOT-IMPCR (WS-I) FROM WS-IMPCR.          325900      
004634 20245-ARMA-RESPUESTA.                                            326000      
004635    IF WS-DE-SISTEMA = 001                                        326100      
004636       MOVE "INTEGRAL DE CAPTACION "       TO WS-DS-DESCSIS       326200      
004637    ELSE IF WS-DE-SISTEMA = 264                                   326300      
004638       MOVE "TRANSFERENCIA DE FONDOS"      TO WS-DS-DESCSIS       326400      
004639    ELSE IF WS-DE-SISTEMA = 404                                   326500      
004640       MOVE "CREDITO BANAMEX     "         TO WS-DS-DESCSIS       326600      
004641*   ELSE IF WS-DE-SISTEMA = 600                                   326700      
004642*      MOVE "HIPOTECARIOS       "          TO WS-DS-DESCSIS       326800      
004643    ELSE IF WS-DE-SISTEMA = 066                                   326900      
004644       MOVE "INTEGRAL DE CAPTACION"        TO WS-DS-DESCSIS       327000      
004645*   ELSE IF WS-DE-SISTEMA = 400                                   327100      
004646*      MOVE "CARTERA            "          TO WS-DS-DESCSIS       327200      
004647    ELSE IF WS-DE-SISTEMA = 151                                   327300      
004648       MOVE "LINEAS SERV/CREDITO"          TO WS-DS-DESCSIS       327400      
004649    ELSE IF WS-DE-SISTEMA = 403                                   327500      
004650       MOVE "CREDITO EMPRESARIAL"          TO WS-DS-DESCSIS       327600      
004651*   ELSE IF WS-DE-SISTEMA = 044                                   327700      
004652*      MOVE "RECEPCION DE PAGOS "          TO WS-DS-DESCSIS       327800      
004653    ELSE IF WS-DE-SISTEMA = 408                                   327900      
004654       MOVE "LINEAS DE CREDITO  "          TO WS-DS-DESCSIS       328000      
004655    ELSE IF WS-DE-SISTEMA = 500                                   328300      
004656       MOVE "INTEGRAL DE CAPTACION"        TO WS-DS-DESCSIS       328400      
004657    ELSE IF WS-DE-SISTEMA = 1264                                  328500      
004658       MOVE "TRANS. FONDOS INT. "          TO WS-DS-DESCSIS       328600      
004659    ELSE IF WS-DE-SISTEMA = 703                                   328700      
004660       MOVE "REMESAS DEL EXTRAN."          TO WS-DS-DESCSIS       328800      
004661    ELSE IF WS-DE-SISTEMA = 84                                    328900      
004662       MOVE "INVERSION INTEGRAL "          TO WS-DS-DESCSIS       329000      
004663    ELSE IF WS-DE-SISTEMA = 1151                                  329100      
004664       MOVE "LINEAS SERV/CREDITO"          TO WS-DS-DESCSIS       329200      
004665    ELSE IF WS-DE-SISTEMA = 701                                   329300      
004666       MOVE "SISTEMA DE PAGOS   "          TO WS-DS-DESCSIS       329400      
004667    ELSE IF WS-DE-SISTEMA = 501                                   329420      
004668       MOVE "T E L E T O N      "          TO WS-DS-DESCSIS       329440      
004669    ELSE IF WS-DE-SISTEMA = 018                                   329460      
004670       MOVE "ADMON. DE EFECTIVO "          TO WS-DS-DESCSIS       329480      
004671    ELSE                                                          329500      
004672       MOVE 17                             TO WS-RESPERROR.       329600      
004673                                                                  329700      
004674    IF WS-HDR-CCR-DES = 1                                         329800      
004675       MOVE "HER"                          TO WS-DS-SDO-DESC      329900      
004676    ELSE IF WS-HDR-CCR-DES = 4                                    330000      
004677       MOVE "MTY"                          TO WS-DS-SDO-DESC      330100      
004678    ELSE IF WS-HDR-CCR-DES = 6 OR 26                              330200      
004679       MOVE "GDA"                          TO WS-DS-SDO-DESC      330300      
004680    ELSE IF WS-HDR-CCR-DES = 7                                    330400      
004681       MOVE "VER"                          TO WS-DS-SDO-DESC      330500      
004682    ELSE IF WS-HDR-CCR-DES = 9                                    330600      
004683       MOVE "MOR"                          TO WS-DS-SDO-DESC      330700      
004684    ELSE IF WS-HDR-CCR-DES = 10 OR 32                             330800      
004685       MOVE "VDM"                          TO WS-DS-SDO-DESC      330900      
004686    ELSE                                                          331000      
004687       MOVE "ALF"                          TO WS-DS-SDO-DESC.     331100      
004688    IF  WS-RESPERROR > 0  GO TO 20245-EXIT.                       331200      
004689    MOVE WS-NUMCR  TO WS-DS-SDO-NUMCR.                            331300      
004690    COMPUTE WS-DS-SDO-IMPCR = WS-IMPCR / 1000.                    331400      
004691    MOVE WS-NUMAB  TO WS-DS-SDO-NUMAB.                            331500      
004692    COMPUTE WS-DS-SDO-IMPAB = WS-IMPAB / 1000.                    331600      
004693    COMPUTE 77-VAR = (WS-IMPAB - WS-IMPCR) / 1000.                331700      
004694    MOVE 77-VAR    TO WS-DS-SDO-VAR.                              331800      
004695    IF  77-VAR = 0                                                331900      
004696          MOVE "-"        TO WS-DS-SDO-SIG                        332000      
004697    ELSE  IF  77-VAR > 10000                                      332100      
004698          MOVE "+"        TO WS-DS-SDO-SIG                        332200      
004699    ELSE  MOVE "-"        TO WS-DS-SDO-SIG.                       332300      
004700    MOVE ZEROES           TO 77-VAR.                              332400      
004701    IF WS-HDR-RES = 11                                            332500      
004702       PERFORM 20250-SEND-CSI VARYING WS-I FROM 1 BY 1 UNTIL      332600      
004703                              WS-I > 35                           332700      
004704       MOVE 0 TO WS-DIRECCIONA                                    332800      
004705       STRING WS-CLEAR, WS-DE-SISTEMA, WS-DE-MONEDA, " " ,        332900      
004706              WS-DS-DESCSIS, WS-DS-TOT-SALDOS                     333000      
004707              DELIMITED BY SIZE INTO WS-DATOS-RESPUESTA WITH      333100      
004708              POINTER WS-LONG-MSG                                 333200      
004709    ELSE                                                          333300      
004710       STRING WS-DS-TOT-SALDOS                                    333400      
004711              DELIMITED BY SIZE INTO WS-DATOS-RESPUESTA WITH      333500      
004712              POINTER WS-LONG-MSG.                                333600      
004713 20245-EXIT. EXIT.                                                333700      
004714 20250-SEND-CSI.                                                  333800      
004715    IF WS-I = 1 OR 4 OR 6 OR 7 OR 9 OR 10 OR 26 OR 32 OR 33 OR 35 333900      
004716       IF WS-HDR-CCR-ORG NOT = WS-I                               334000      
004717       MOVE 1 TO WS-DIRECCIONA                                    334100      
004718       MOVE WS-I TO WS-HDR-CCR-DES                                334200      
004719       MOVE 02   TO WS-HDR-RES                                    334300      
004720       PERFORM 40000-SENDCOMS.                                    334400      
004721******************************************************************334500      
004722*                                                                *334600      
004723*         CONSULTA DE PRODUCTOS PARA TERCER NIVEL                *334700      
004724*                                                                *334800      
004725******************************************************************334900      
004726 21000-CONSULTA-PRODUCTOS.                                        335000      
004727*========================                                         335100      
004728     MOVE ALL "00"        TO WS-MENSAJE-SAL-SA2                   335200      
004729     PERFORM 21100-CARGA-PRODUCTOS VARYING WS-IND FROM 1 BY 1     335300      
004730             UNTIL WS-PROD-NUMERO (WS-IND) = 9999                 335400      
004731     COMPUTE WS-RP-OCURRENCIAS = WS-IND - 1                       335500      
004732     MOVE WS-RESPUESTA-PRODUCTOS-OK TO                            335600      
004733                            WS-MENSAJE-ENTRE-APLICACIONES         335700      
004734     PERFORM 28000-LLENA-DATOS-SA2                                335800      
004735     MOVE WS-TEXTO-SA2    TO WS-DATOS-RESPUESTA.                  335900      
004736                                                                  336000      
004737 21100-CARGA-PRODUCTOS.                                           336100      
004738*======================                                           336200      
004739     MOVE WS-PROD-NUMERO(WS-IND)  TO WS-RP-PROD-NUMERO(WS-IND)    336300      
004740     MOVE WS-PROD-NOMBRE(WS-IND)  TO WS-RP-PROD-NOMBRE(WS-IND).   336400      
004741                                                                  336500      
004742******************************************************************336600      
004743*                                                                *336700      
004744*         CONSULTA DE TOTALES POR CAJA PARA TERCER NIVEL         *336800      
004745*                                                                *336900      
004746******************************************************************337000      
004747                                                                  337055      
004748 22000-CONSULTA-TOTALES.                                          337100      
004749*=======================                                          337200      
004750     PERFORM 22005-LIMPIA-SISCON VARYING W77-IND FROM 1 BY 1 UNTIL337210      
004751                                 W77-IND > 17.                    337220      
004752     MOVE ALL "00"                 TO WS-MENSAJE-SAL-SA2.         337250      
004753     MOVE ZERO                     TO W77-ELEMENTOS.              337251      
004754     MOVE WS-MENSAJE-ENTRE-APLICACIONES   TO WS-MENSAJE-ENT-SA2   337252      
004755     IF WS-PREFIJO-DESTINO = 015130 AND                           337254      
004756        WS-PREFIJO-ORIGEN  = 040310                               337256      
004757        MOVE 01                    TO WS-403-FUN                  337258      
004758        MOVE 403                   TO WS-403-SISTEMA              337260      
004759        MOVE WS-SA2-ENTIDAD-ORIGEN TO WS-403-SUCURSAL             337262      
004760        MOVE WS-ST-CAJA            TO WS-403-CAJA                 337264      
004761        MOVE WS-ST-CONT-MONEDA     TO WS-403-MONEDA               337266      
004762        MOVE 77-ADMOV-FECPROC-6DIG TO WS-403-FECHA                337268      
004763        MOVE 0              TO WS-RESULT WS-RESPERROR WS-STATUS   337270      
004764        PERFORM 22000-VALIDA-CSI-CALLTOTXMON                      337300      
004765*       CALL "TOTXMON IN LIB-CONSULTA" USING  WS-TOTALES-S403     337305      
004766*                                      GIVING WS-RESULT           337310      
004767        IF WS-RESULT > ZEROS                                      337315      
004768           MOVE 14                 TO WS-RESPERROR WS-STATUS      337320      
004769        ELSE                                                      337325      
004770           MOVE 403                TO WS-RT-CONT-PROD             337330      
004771           MOVE WS-403-CAJA        TO WS-RT-CONT-CAJA             337335      
004772           MOVE WS-403-MONEDA      TO WS-RT-CONT-MONEDA           337340      
004773           PERFORM 22100-TOTALES-X-S403 VARYING W77-I FROM 1 BY   337345      
004774                                            1 UNTIL W77-I > 17    337350      
004775     ELSE                                                         337355      
004776     IF WS-HDR-RES = 2                                            337360      
004777        MOVE WS-SA2-ENTIDAD-ORIGEN        TO WS-DE-SUCURSAL       337365      
004778        MOVE WS-DIA-CAJA                  TO WS-DE-CAJA           337370      
004779        MOVE 0                            TO WS-DE-MDAFIJA        337375      
004780        MOVE 0                            TO WS-DE-MONEDA         337380      
004781        MOVE 0                            TO WS-IND2              337385      
004782        MOVE WS-DIA-CAJA                  TO WKS-TCAJ-CAJA        337386      
004783        PERFORM 22114-MUEVE-TOTALES  VARYING W77-IND FROM 1 BY 1  337390      
004784                UNTIL W77-IND > 17                                337395      
004785        MOVE ZERO                         TO WS-RT-CAJA           337396      
004786        PERFORM 22115-LIMPIA-TOTALES VARYING W77-IND FROM 1 BY 1  337400      
004787                UNTIL W77-IND > 17                                337405      
004788        MOVE ALL "00"                     TO WS-MENSAJE-ENT-SA2   337410      
004789        MOVE 1                            TO W77-IND              337412      
004790        PERFORM 22010-CARGA-PRODUCTOS VARYING W77-IND2 FROM 1 BY 2337415      
004791           UNTIL W77-IND2 > 17  OR WKS-TCAJ-PRODUCTO(W77-IND2) = 0337420      
004792                                                                  337425      
004793        PERFORM 22100-TOTALES-X-PRODUCTO VARYING WS-IND FROM 1    337430      
004794              BY 1 UNTIL WS-ST-NUMPROD(WS-IND) = 0 OR WS-IND2 > 17337435      
004795                                                                  337440      
004796        PERFORM 22116-ACUMULA-TOTALES  VARYING W77-IND FROM 1 BY 1337445      
004797             UNTIL W77-IND > 17                                   337450      
004798                                                                  337455      
004799        PERFORM 22115-LIMPIA-TOTALES VARYING W77-IND FROM 1 BY 1  337460      
004800                UNTIL W77-IND > 17                                337465      
004801        MOVE ALL "00"                     TO WS-MENSAJE-SAL-SA2   337468      
004802        MOVE WKS-TCAJ-CAJA                TO WS-ST-CAJA           337470      
004803        PERFORM 22119-MUEVE-SALIDA   VARYING W77-IND FROM 1 BY 1  337475      
004804                UNTIL   W77-IND > 17                              337480      
004805        MOVE ZERO                         TO W77-DIALOGO          337485      
004806     ELSE                                                         337490      
004807     IF WS-ST-CONTINUACION = 0                                    337495      
004808        MOVE WS-SA2-ENTIDAD-ORIGEN        TO WS-DE-SUCURSAL       337500      
004809        MOVE WS-ST-CAJA                   TO WS-DE-CAJA           337505      
004810        MOVE 0                            TO WS-DE-MDAFIJA        337510      
004811        MOVE 0                            TO WS-DE-MONEDA         337515      
004812        MOVE 0                            TO WS-IND2              337520      
004813        PERFORM 22100-TOTALES-X-PRODUCTO VARYING WS-IND FROM 1    337530      
004814                BY 1 UNTIL WS-ST-NUMPROD(WS-IND) = 0     OR       338435      
004815                           WS-IND2 > 17                           338436      
004816        IF W77-DIALOGO = 1                                        338437      
004817           PERFORM 22113-MUEVE-TOTSAL  VARYING W77-IND FROM 1 BY 1338438      
004818                   UNTIL W77-IND > 17                             338439      
004819           PERFORM 22115-LIMPIA-TOTALES VARYING W77-IND FROM 1    338440      
004820                   BY 1 UNTIL W77-IND > 17                        338441      
004821           PERFORM 22113-MUEVE-SALIDA  VARYING W77-IND FROM 1 BY 1338442      
004822                   UNTIL W77-IND > 17.                            338443      
004823                                                                  338445      
004824     IF WS-PREFIJO-DESTINO = 015130 AND                           338450      
004825        WS-PREFIJO-ORIGEN  = 040310                               338460      
004826        NEXT SENTENCE                                             338470      
004827     ELSE                                                         338480      
004828        MOVE 0                          TO WS-RT-CONTINUACION     338800      
004829        MOVE WS-ST-CAJA                 TO WS-RT-CAJA             338900      
004830        MOVE W77-ELEMENTOS              TO WS-RT-OCURRENCIAS.     339000      
004831     IF WS-PREFIJO-DESTINO = 015130 AND                           339050      
004832        WS-PREFIJO-ORIGEN  = 040310                               339052      
004833        IF WS-RESPERROR > ZEROS                                   339054      
004834           MOVE WS-TBL-ERRORES(WS-RESPERROR) TO WS-RT-TEXTO-ERROR 339056      
004835           MOVE WS-RESPERROR             TO WS-RT-NUMERR          339058      
004836           MOVE WS-RESPUESTA-TOTALES-MAL TO                       339060      
004837                                    WS-MENSAJE-ENTRE-APLICACIONES 339062      
004838        ELSE                                                      339064      
004839           MOVE WS-RESPUESTA-TOTALES-OK TO                        339066      
004840                                    WS-MENSAJE-ENTRE-APLICACIONES 339068      
004841     ELSE                                                         339070      
004842        MOVE WS-RESPUESTA-TOTALES-OK    TO                        339100      
004843                                    WS-MENSAJE-ENTRE-APLICACIONES.339200      
004844     PERFORM 28000-LLENA-DATOS-SA2                                339300      
004845     MOVE WS-TEXTO-SA2                  TO WS-DATOS-RESPUESTA.    339400      
004846 22000-VALIDA-CSI-CALLTOTXMON.                                    339460      
004847*=============================                                    339465      
004848  22005-LIMPIA-SISCON.                                            339466      
004849*====================                                             339467      
004850    MOVE ZERO                       TO WKS-SIS-CONSULTA(W77-IND). 339468      
004851                                                                  339469      
004852 22010-CARGA-PRODUCTOS.                                           339472      
004853*======================                                           339474      
004854    IF  WKS-TCAJ-PRODUCTO(W77-IND2) > 0                           339475      
004855        MOVE WKS-TCAJ-PRODUCTO(W77-IND2) TO WS-ST-NUMPROD(W77-IND)339476      
004856        ADD 1                            TO W77-IND.              339477      
004857 22100-TOTALES-X-S403.                                            339550      
004858*=====================                                            339551      
004859                                                                  339552      
004860     IF WS-403-PRD          (W77-I) = 403                         339553      
004861        MOVE WS-403-PRD     (W77-I) TO WS-RT-PRODUCTO      (W77-I)339554      
004862        MOVE WS-403-MON     (W77-I) TO WS-RT-MONEDA        (W77-I)339555      
004863        MOVE WS-403-NUMCR   (W77-I) TO WS-RT-NUM-CARGO     (W77-I)339556      
004864        MOVE WS-403-IMPCR   (W77-I) TO WS-RT-IMP-CARGO     (W77-I)339558      
004865        MOVE WS-403-NUMAB   (W77-I) TO WS-RT-NUM-ABONO     (W77-I)339560      
004866        MOVE WS-403-IMPAB   (W77-I) TO WS-RT-IMP-ABONO     (W77-I)339562      
004867        MOVE WS-403-NUMCRINS(W77-I) TO WS-RT-NUM-INST-CARGO(W77-I)339564      
004868        MOVE WS-403-IMPCRINS(W77-I) TO WS-RT-IMP-INST-CARGO(W77-I)339566      
004869        MOVE WS-403-NUMABINS(W77-I) TO WS-RT-NUM-INST-ABONO(W77-I)339568      
004870        MOVE WS-403-IMPABINS(W77-I) TO WS-RT-IMP-INST-ABONO(W77-I)339570      
004871        MOVE W77-I                  TO WS-RT-OCURRENCIAS.         339572      
004872                                                                  339596      
004873 22100-TOTALES-X-PRODUCTO.                                        339600      
004874*========================                                         339700      
004875*****PERFORM 22110-CONSULTA-TOTALES 2 TIMES.                      339800      
004876     COMPUTE W77-IND-CON = WS-IND * 2.                            339802      
004877     MOVE WS-ST-NUMPROD(WS-IND)           TO WS-DE-SISTEMA.       339806      
004878     IF WS-MON = 1 AND WS-DE-SISNVO AND WS-HDR-RES = 2            339808      
004879        DISPLAY "IND " WS-IND " S" WS-DE-SISTEMA                  339810      
004880                " CONSULTA "WKS-TCAJ-CONSULTA(W77-IND-CON).       339812      
004881     IF WS-DE-SISNVO                                              339820      
004882        ADD 2                             TO W77-ELEMENTOS        339830      
004883        IF WS-HDR-RES = 2 AND WKS-TCAJ-CONSULTA(W77-IND-CON) = 1  339832      
004884           ADD 2                          TO WS-IND2              339834      
004885        ELSE                                                      339836      
004886           PERFORM 22110-CONSULTA-TOTALES VARYING W77-I FROM 1    339900      
004887                                          BY 1 UNTIL W77-I > 2.   340000      
004888                                                                  340100      
004889 22110-CONSULTA-TOTALES.                                          340200      
004890*======================                                           340300      
004891                                                                  340500      
004892     IF WS-ST-CONTINUACION = 0                                    340600      
004893        IF W77-I = 1                                              340700      
004894           MOVE 0                         TO WS-DE-MDAFIJA        340800      
004895           MOVE 0                         TO WS-DE-MONEDA.        340900      
004896                                                                  341000      
004897     IF WS-DE-MONEDA = 0                                          341100      
004898        MOVE 1                            TO WS-DE-MONEDA         341200      
004899     ELSE                                                         341300      
004900     IF WS-DE-MONEDA = 1                                          341400      
004901        MOVE 5                            TO WS-DE-MONEDA         341500      
004902     ELSE                                                         341600      
004903        MOVE 1                            TO WS-DE-MONEDA.        341700      
004904     MOVE 0 TO WS-RESULT WS-RESPERROR WS-STATUS.                  341800      
004905     MOVE LOW-VALUES              TO WS-DATOS-ADMOV-L011.         341850      
004906     MOVE ZERO                    TO W77-CONS-L011.               341852      
004907     IF WS-PREFIJO-DESTINO = 015130 AND                           341854      
004908        WS-PREFIJO-ORIGEN  = 040310                               341856      
004909        MOVE 1                            TO W77-CONS-L011        341858      
004910     ELSE                                                         341860      
004911        MOVE ZERO                         TO W77-SALIDA           341862      
004912        PERFORM 221120-BUSCA-SISTEMA                              341864      
004913                VARYING W77-IND-CSI FROM 1 BY 1                   341866      
004914                UNTIL   W77-IND-CSI > 12   OR                     341868      
004915                        W77-SALIDA  = 1    OR                     341870      
004916                        WS-PROD-NUMERO(W77-IND-CSI) = 9999.       341872      
004917     ADD 1                           TO WS-IND2.                  341874      
004918     MOVE WS-DE-SISTEMA              TO WS-RT-PRODUCTO(WS-IND2).  341876      
004919     MOVE WS-DE-MONEDA               TO WS-RT-MONEDA  (WS-IND2).  341878      
004920     IF W77-CONS-L011 = 1                                         341880      
004921        PERFORM 22112-CONS-TOTCAJA.                               341882      
004922     IF WS-MON = 1                                                341884      
004923        DISPLAY "CONSULTA S" WS-DE-SISTEMA                        341886      
004924        " CON L011 " W77-CONS-L011.                               341888      
004925  22112-CONS-TOTCAJA.                                             341890      
004926*====================                                             341892      
004927     PERFORM 20235-CALL-CAJA.                                     341900      
004928     MOVE 1                     TO WKS-SIS-CONSULTA(WS-IND2).     342000      
004929     IF WS-DE-SISTEMA = 1                                         342100      
004930        MOVE 1                            TO WS-INDS              342200      
004931     ELSE                                                         342300      
004932     IF WS-DE-SISTEMA = 502                                       342310      
004933        MOVE 2                            TO WS-INDS              342320      
004934     ELSE                                                         342330      
004935     IF WS-DE-SISTEMA = 404                                       342400      
004936        MOVE 3                            TO WS-INDS              342500      
004937     ELSE                                                         342600      
004938     IF WS-DE-SISTEMA = 264                                       342700      
004939        MOVE 4                            TO WS-INDS              342800      
004940     ELSE                                                         342900      
004941     IF WS-DE-SISTEMA = 701                                       343000      
004942        MOVE 5                            TO WS-INDS              343100      
004943     ELSE                                                         343200      
004944     IF WS-DE-SISTEMA = 403                                       343300      
004945        MOVE 6                            TO WS-INDS              343400      
004946     ELSE                                                         343430      
004947     IF WS-DE-SISTEMA = 018                                       343460      
004948        MOVE 7                            TO WS-INDS              343490      
004949     ELSE                                                         343500      
004950     IF WS-DE-SISTEMA = 501                                       343600      
004951        MOVE 8                            TO WS-INDS.             343700      
004952                                                                  344100      
004953     IF WS-RESPERROR = 0                                          344200      
004954*       ADD 1                             TO WS-IND2              344300      
004955        PERFORM 22130-ARMA-TOTALES VARYING WS-INDR FROM 1 BY 1    344400      
004956                UNTIL WS-INDR > 17                                344500      
004957*        MOVE WS-DE-SISTEMA              TO WS-RT-PRODUCTO(WS-IND2344600      
004958*        MOVE WS-DE-MONEDA               TO WS-RT-MONEDA  (WS-IND2344700      
004959     ELSE                                                         344800      
004960        MOVE 0                          TO WS-RESPERROR.          344801      
004961 22113-MUEVE-TOTSAL.                                              344802      
004962*===================                                              344804      
004963   MOVE WS-RT-PRODUCTO  (W77-IND) TO WKS-TCAJ-PRODUCTO (W77-IND). 344808      
004964   MOVE WS-RT-MONEDA    (W77-IND) TO WKS-TCAJ-MONEDA   (W77-IND). 344810      
004965   MOVE WS-RT-NUM-CARGO (W77-IND) TO WKS-TCAJ-NCARGO   (W77-IND). 344812      
004966   MOVE WS-RT-IMP-CARGO (W77-IND) TO WKS-TCAJ-ICARGO   (W77-IND). 344814      
004967   MOVE WS-RT-NUM-ABONO (W77-IND) TO WKS-TCAJ-NABONO   (W77-IND). 344816      
004968   MOVE WS-RT-IMP-ABONO (W77-IND) TO WKS-TCAJ-IABONO   (W77-IND). 344818      
004969   MOVE WS-RT-NUM-INST-CARGO (W77-IND) TO                         344820      
004970        WKS-TCAJ-INST-NCARGO (W77-IND).                           344822      
004971   MOVE WS-RT-IMP-INST-CARGO (W77-IND) TO                         344824      
004972        WKS-TCAJ-INST-ICARGO (W77-IND).                           344825      
004973   MOVE WS-RT-NUM-INST-ABONO (W77-IND) TO                         344826      
004974        WKS-TCAJ-INST-NABONO (W77-IND).                           344828      
004975   MOVE WS-RT-IMP-INST-ABONO (W77-IND) TO                         344830      
004976        WKS-TCAJ-INST-IABONO (W77-IND).                           344832      
004977                                                                  344840      
004978 22113-MUEVE-SALIDA.                                              344842      
004979*===================                                              344844      
004980   MOVE WKS-TCAJ-PRODUCTO (W77-IND) TO WS-DIAS-PRODUCTO (W77-IND).344848      
004981   MOVE WKS-TCAJ-MONEDA   (W77-IND) TO WS-DIAS-MONEDA   (W77-IND).344850      
004982   MOVE WKS-TCAJ-NCARGO   (W77-IND) TO WS-DIAS-NUM-CARGO(W77-IND).344852      
004983   MOVE WKS-TCAJ-ICARGO   (W77-IND) TO WS-DIAS-IMP-CARGO(W77-IND).344854      
004984   MOVE WKS-TCAJ-NABONO   (W77-IND) TO WS-DIAS-NUM-ABONO(W77-IND).344856      
004985   MOVE WKS-TCAJ-IABONO   (W77-IND) TO WS-DIAS-IMP-ABONO(W77-IND).344858      
004986   MOVE WKS-TCAJ-INST-NCARGO  (W77-IND) TO                        344860      
004987        WS-DIAS-NUM-INST-CARGO(W77-IND).                          344862      
004988   MOVE WKS-TCAJ-INST-ICARGO  (W77-IND) TO                        344864      
004989        WS-DIAS-IMP-INST-CARGO(W77-IND).                          344866      
004990   MOVE WKS-TCAJ-INST-NABONO  (W77-IND) TO                        344868      
004991        WS-DIAS-NUM-INST-ABONO(W77-IND).                          344870      
004992   MOVE WKS-TCAJ-INST-IABONO  (W77-IND) TO                        344872      
004993        WS-DIAS-IMP-INST-ABONO(W77-IND).                          344874      
004994   MOVE WKS-SIS-CONSULTA (W77-IND) TO WS-DIAS-CONSULTA(W77-IND).  344876      
004995 22114-MUEVE-TOTALES.                                             344904      
004996*===================                                              344906      
004997   MOVE WS-DIA-PRODUCTO (W77-IND) TO WKS-TCAJ-PRODUCTO(W77-IND).  344908      
004998   MOVE WS-DIA-MONEDA   (W77-IND) TO WKS-TCAJ-MONEDA  (W77-IND).  344910      
004999   MOVE WS-DIA-NUM-CARGO(W77-IND) TO WKS-TCAJ-NCARGO  (W77-IND).  344912      
005000   MOVE WS-DIA-IMP-CARGO(W77-IND) TO WKS-TCAJ-ICARGO  (W77-IND).  344914      
005001   MOVE WS-DIA-NUM-ABONO(W77-IND) TO WKS-TCAJ-NABONO  (W77-IND).  344916      
005002   MOVE WS-DIA-IMP-ABONO(W77-IND) TO WKS-TCAJ-IABONO  (W77-IND).  344918      
005003   MOVE WS-DIA-NUM-INST-CARGO(W77-IND) TO                         344920      
005004        WKS-TCAJ-INST-NCARGO (W77-IND).                           344921      
005005   MOVE WS-DIA-IMP-INST-CARGO(W77-IND) TO                         344922      
005006        WKS-TCAJ-INST-ICARGO (W77-IND).                           344923      
005007   MOVE WS-DIA-NUM-INST-ABONO(W77-IND) TO                         344924      
005008        WKS-TCAJ-INST-NABONO (W77-IND).                           344925      
005009   MOVE WS-DIA-IMP-INST-ABONO(W77-IND) TO                         344926      
005010        WKS-TCAJ-INST-IABONO (W77-IND).                           344927      
005011   MOVE WS-DIA-CONSULTA(W77-IND) TO WKS-TCAJ-CONSULTA (W77-IND).  344928      
005012   IF WS-MON = 1                                                  344929      
005013      DISPLAY "IND " W77-IND " S"  WKS-TCAJ-PRODUCTO(W77-IND)     344930      
005014              "-" WKS-TCAJ-MONEDA(W77-IND)                        344931      
005015              " CON " WKS-TCAJ-CONSULTA (W77-IND).                344932      
005016 22115-LIMPIA-TOTALES.                                            344933      
005017*=====================                                            344934      
005018  MOVE ZERO                      TO WS-RT-PRODUCTO (W77-IND)      344936      
005019                                    WS-RT-MONEDA   (W77-IND)      344938      
005020                                    WS-RT-NUM-CARGO(W77-IND)      344940      
005021                                    WS-RT-IMP-CARGO(W77-IND)      344942      
005022                                    WS-RT-NUM-ABONO(W77-IND)      344944      
005023                                    WS-RT-IMP-ABONO(W77-IND)      344946      
005024                                    WS-RT-NUM-INST-CARGO(W77-IND) 344948      
005025                                    WS-RT-IMP-INST-CARGO(W77-IND) 344950      
005026                                    WS-RT-NUM-INST-ABONO(W77-IND) 344952      
005027                                    WS-RT-IMP-INST-ABONO(W77-IND).344954      
005028 22116-ACUMULA-TOTALES.                                           344956      
005029*======================                                           344958      
005030  IF WKS-TCAJ-PRODUCTO (W77-IND) > 0 AND                          344960      
005031     WKS-TCAJ-MONEDA   (W77-IND) > 0                              344962      
005032     MOVE WKS-TCAJ-PRODUCTO(W77-IND) TO WKS-ACUM-PRODUCTO(W77-IND)344964      
005033     MOVE WKS-TCAJ-MONEDA  (W77-IND) TO WKS-ACUM-MONEDA (W77-IND).344966      
005034  COMPUTE WKS-ACUM-NCARGO(W77-IND) = WS-RT-NUM-CARGO(W77-IND)     344977      
005035                                   + WKS-TCAJ-NCARGO(W77-IND).    344978      
005036  COMPUTE WKS-ACUM-ICARGO(W77-IND) = WS-RT-IMP-CARGO(W77-IND)     344979      
005037                                   + WKS-TCAJ-ICARGO(W77-IND).    344980      
005038  COMPUTE WKS-ACUM-NABONO(W77-IND) = WS-RT-NUM-ABONO(W77-IND)     344981      
005039                                   + WKS-TCAJ-NABONO(W77-IND).    344982      
005040  COMPUTE WKS-ACUM-IABONO(W77-IND) = WS-RT-IMP-ABONO(W77-IND)     344983      
005041                                   + WKS-TCAJ-IABONO(W77-IND).    344984      
005042  COMPUTE WKS-ACUM-INST-NCARGO(W77-IND) =                         344985      
005043  WS-RT-NUM-INST-CARGO(W77-IND) + WKS-TCAJ-INST-NCARGO(W77-IND).  344986      
005044  COMPUTE WKS-ACUM-INST-ICARGO(W77-IND) =                         344987      
005045  WS-RT-IMP-INST-CARGO(W77-IND) + WKS-TCAJ-INST-ICARGO(W77-IND).  344988      
005046  COMPUTE WKS-ACUM-INST-NABONO(W77-IND) =                         344989      
005047  WS-RT-NUM-INST-ABONO(W77-IND) + WKS-TCAJ-INST-NABONO(W77-IND).  344992      
005048  COMPUTE WKS-ACUM-INST-IABONO(W77-IND) =                         344994      
005049  WS-RT-IMP-INST-ABONO(W77-IND) + WKS-TCAJ-INST-IABONO(W77-IND).  344996      
005050                                                                  344997      
005051 22119-MUEVE-SALIDA.                                              345011      
005052*===================                                              345012      
005053   MOVE WKS-ACUM-PRODUCTO    (W77-IND) TO WS-RT-PRODUCTO (W77-IND)345014      
005054   MOVE WKS-ACUM-MONEDA      (W77-IND) TO WS-RT-MONEDA   (W77-IND)345016      
005055   MOVE WKS-ACUM-NCARGO      (W77-IND) TO WS-RT-NUM-CARGO(W77-IND)345018      
005056   MOVE WKS-ACUM-ICARGO      (W77-IND) TO WS-RT-IMP-CARGO(W77-IND)345020      
005057   MOVE WKS-ACUM-NABONO      (W77-IND) TO WS-RT-NUM-ABONO(W77-IND)345022      
005058   MOVE WKS-ACUM-IABONO      (W77-IND) TO WS-RT-IMP-ABONO(W77-IND)345024      
005059   MOVE WKS-ACUM-INST-NCARGO (W77-IND) TO                         345026      
005060        WS-RT-NUM-INST-CARGO (W77-IND).                           345028      
005061   MOVE WKS-ACUM-INST-ICARGO (W77-IND) TO                         345030      
005062        WS-RT-IMP-INST-CARGO (W77-IND).                           345032      
005063   MOVE WKS-ACUM-INST-NABONO (W77-IND) TO                         345034      
005064        WS-RT-NUM-INST-ABONO (W77-IND).                           345036      
005065   MOVE WKS-ACUM-INST-IABONO (W77-IND) TO                         345038      
005066        WS-RT-IMP-INST-ABONO (W77-IND).                           345040      
005067   IF WS-MON = 1                  AND                             345041      
005068      WS-RT-PRODUCTO(W77-IND) > 0 AND                             345042      
005069      WS-RT-MONEDA  (W77-IND) > 0 AND                             345043      
005070     (WS-RT-IMP-CARGO(W77-IND) > 0 OR WS-RT-IMP-ABONO(W77-IND)> 0)345044      
005071     DISPLAY "SALIDA : IND " W77-IND                              345045      
005072          " S"WS-RT-PRODUCTO(W77-IND) "-" WS-RT-MONEDA(W77-IND)   345046      
005073     " #C "WS-RT-NUM-CARGO(W77-IND)" $C "WS-RT-IMP-CARGO(W77-IND) 345047      
005074     " #A "WS-RT-NUM-ABONO(W77-IND)" $A "WS-RT-IMP-ABONO(W77-IND).345048      
005075 221120-BUSCA-SISTEMA.                                            345049      
005076*=====================                                            345050      
005077     IF WS-PROD-NUMERO(W77-IND-CSI) =  WS-DE-SISTEMA              345053      
005078        MOVE 1                         TO W77-SALIDA              345054      
005079        IF WS-MODALIDAD(W77-IND-CSI) = 1                          345056      
005080           IF WS-CSI-RES(W77-IND-CSI) = W77-MI-CSI                345058      
005081              MOVE 1                   TO W77-CONS-L011           345060      
005082           ELSE                                                   345062      
005083              MOVE 1                   TO W77-DIALOGO             345064      
005084        ELSE                                                      345066      
005085           MOVE 1                      TO W77-CONS-L011.          345070      
005086                                                                  345076      
005087 22130-ARMA-TOTALES.                                              345100      
005088*==================                                               345200      
005089     IF TABLA-TOT-TIPO(WS-INDS , WS-INDR ) = 1                    345300      
005090        ADD WS-TOT-NUMCR(WS-INDR) TO WS-RT-NUM-CARGO(WS-IND2)     345400      
005091        ADD WS-TOT-IMPCR(WS-INDR) TO WS-RT-IMP-CARGO(WS-IND2)     345500      
005092        ADD WS-TOT-NUMAB(WS-INDR) TO WS-RT-NUM-ABONO(WS-IND2)     345600      
005093        ADD WS-TOT-IMPAB(WS-INDR) TO WS-RT-IMP-ABONO(WS-IND2)     345700      
005094     ELSE                                                         345800      
005095     IF TABLA-TOT-TIPO(WS-INDS , WS-INDR ) = 2                    345900      
005096        ADD WS-TOT-NUMCR(WS-INDR) TO WS-RT-NUM-INST-CARGO(WS-IND2)346000      
005097        ADD WS-TOT-IMPCR(WS-INDR) TO WS-RT-IMP-INST-CARGO(WS-IND2)346100      
005098        ADD WS-TOT-NUMAB(WS-INDR) TO WS-RT-NUM-INST-ABONO(WS-IND2)346200      
005099        ADD WS-TOT-IMPAB(WS-INDR) TO WS-RT-IMP-INST-ABONO(WS-IND2)346300      
005100     .                                                            346400      
005101******************************************************************346500      
005102*                                                                *346600      
005103*      CONSULTA DE MOVIMIENTOS POR CAJA PARA TERCER NIVEL        *346700      
005104*                                                                *346800      
005105******************************************************************346900      
005106 23000-CONSULTA-MOVIMIENTOS.                                      347000      
005107*==========================                                       347100      
005108     MOVE ALL "00"                        TO WS-MENSAJE-SAL-SA2   347200      
005109     MOVE WS-MENSAJE-ENTRE-APLICACIONES   TO WS-MENSAJE-ENT-SA2   347300      
005110     MOVE WS-SA2-ENTIDAD-ORIGEN           TO WS-DE-SUCURSAL       347400      
005111     MOVE WS-SM-CAJA                      TO WS-DE-CAJA           347500      
005112     MOVE WS-SM-PRODUCTO                  TO WS-DE-SISTEMA        347600      
005113     MOVE ZERO                            TO W77-DIALOGO          347610      
005114                                             W77-CONS-L011.       347620      
005115     IF WS-PREFIJO-DESTINO = 015130 AND                           347650      
005116        WS-PREFIJO-ORIGEN  = 040310                               347652      
005117        MOVE 403                          TO WS-DE-SISTEMA        347654      
005118        MOVE 1                            TO W77-CONS-L011        347656      
005119     ELSE                                                         347658      
005120        IF WS-HDR-RES = 2                                         347659      
005121           MOVE 1                         TO W77-CONS-L011        347661      
005122        ELSE                                                      347662      
005123           PERFORM 221120-BUSCA-SISTEMA                           347664      
005124                   VARYING W77-IND-CSI FROM 1 BY 1                347666      
005125                   UNTIL   W77-IND-CSI > 12   OR                  347668      
005126                           W77-SALIDA  = 1    OR                  347670      
005127                           WS-PROD-NUMERO(W77-IND-CSI) = 9999.    347672      
005128                                                                  347678      
005129     IF W77-CONS-L011 = 1                                         347680      
005130        PERFORM 23010-CONS-MOVTOS.                                347682      
005131                                                                  347684      
005132     PERFORM 28000-LLENA-DATOS-SA2.                               347686      
005133     MOVE WS-TEXTO-SA2                    TO WS-DATOS-RESPUESTA.  347687      
005134                                                                  347690      
005135     IF WS-MON = 1                                                347692      
005136        DISPLAY "CON. MOVS. S"WS-DE-SISTEMA " SUC " WS-DE-SUCURSAL347693      
005137                " CAJA " WS-DE-CAJA.                              347694      
005138                                                                  347695      
005139 23010-CONS-MOVTOS.                                               347696      
005140*==================                                               347700      
005141     IF WS-SM-CONTINUACION = 0                                    347710      
005142        MOVE 0                            TO WS-DE-AUTOR          347800      
005143                                             WS-DE-CONTROL        347900      
005144     ELSE                                                         348000      
005145        MOVE WS-SM-CONT-AUTAPL            TO WS-DE-AUTOR          348100      
005146        MOVE WS-SM-CONT-AUTADM            TO WS-DE-CONTROL.       348200      
005147                                                                  348300      
005148     MOVE SPACES                    TO WS-DATOS-SIS-3NIV          348400      
005149     MOVE LOW-VALUES                TO WS-ADMOV-MOVSXCAJA         348500      
005150                                       WS-ADMOV-MOVSXCAJA-L011.   348555      
005151     MOVE 01                        TO WS-SIS-3NIV-FUN            348600      
005152                                       WS-MXCAJA-FUN              348700      
005153                                       WS-MXCAJA-FUN-L011.        348705      
005154                                                                  348710      
005155     IF WS-DE-SISTEMA = 403                                       348750      
005156        MOVE 01                        TO WS-SIS-3NIV-FUN         348752      
005157                                          WS-MXCAJA-FUN.          348754      
005158                                                                  348756      
005159     MOVE 25                        TO WS-SIS-3NIV-NMOV           348800      
005160                                       WS-MXCAJA-NMOV             348900      
005161                                       WS-MXCAJA-NMOV-L011.       348955      
005162     MOVE WS-DE-SUCURSAL            TO WS-SIS-3NIV-SUC            349000      
005163                                       WS-MXCAJA-SUCOPER          349100      
005164                                       WS-MXCAJA-SUCOPER-L011.    349155      
005165     MOVE WS-DE-CAJA                TO WS-SIS-3NIV-CAJA           349200      
005166                                       WS-MXCAJA-CAJA             349300      
005167                                       WS-MXCAJA-CAJA-L011.       349355      
005168     MOVE WS-DE-SISTEMA             TO WS-SIS-3NIV-SIST.          349400      
005169     PERFORM 20215-DEFINE-SISTPROD.                               349500      
005170     MOVE WS-DE-AUTOR               TO WS-SIS-3NIV-AUTAPL         349600      
005171                                       WS-MXCAJA-AUTAPL           349700      
005172                                       WS-MXCAJA-AUTAPL-L011.     349755      
005173     MOVE WS-DE-CONTROL             TO WS-SIS-3NIV-AUTADM         349800      
005174                                       WS-MXCAJA-AUTS151          349900      
005175                                       WS-MXCAJA-AUTS151-L011.    349955      
005176     MOVE 77-ADMOV-FECPROC          TO WS-MXCAJA-FECAPLI-L011.    350000      
005177     MOVE 77-ADMOV-FECPROC-6DIG     TO WS-MXCAJA-FECAPLI.         350055      
005178     MOVE WS-SM-NATURALEZAC         TO WS-SIS-3NIV-NAT-CGO        350100      
005179                                       WS-MXCAJA-NAT-CGO          350200      
005180                                       WS-MXCAJA-NAT-CGO-L011.    350255      
005181     MOVE WS-SM-NATURALEZAA         TO WS-SIS-3NIV-NAT-ABO        350300      
005182                                       WS-MXCAJA-NAT-ABO          350400      
005183                                       WS-MXCAJA-NAT-ABO-L011.    350455      
005184     MOVE WS-SM-NATURALEZAIC        TO WS-SIS-3NIV-NAT-ICGO       350500      
005185                                       WS-MXCAJA-NAT-ICGO         350600      
005186                                       WS-MXCAJA-NAT-ICGO-L011.   350655      
005187     MOVE WS-SM-NATURALEZAIA        TO WS-SIS-3NIV-NAT-IABO       350700      
005188                                       WS-MXCAJA-NAT-IABO         350800      
005189                                       WS-MXCAJA-NAT-IABO-L011.   350855      
005190     MOVE WS-SM-MONEDA              TO WS-SIS-3NIV-MONEDA         350900      
005191                                       WS-MXCAJA-3N-MON           351000      
005192                                       WS-MXCAJA-3N-MON-L011.     351055      
005193                                                                  351060      
005194     MOVE 0                         TO WS-BAN-CALLL011-500        351065      
005195                                       WS-BAN-CALLL011-701        351070      
005196                                       WS-BAN-CALLL011-264        351075      
005197                                       WS-BAN-CALLL011-404        351080      
005198                                       WS-BAN-CALLL011-018        351082      
005199                                       WS-BAN-CALLL011-501        351085      
005200                                       WS-BAN-CALLL011-502.       351087      
005201                                                                  351090      
005202     IF NOT WS-DE-SISNVO                                          351100      
005203        IF NOT W88-CHQS-ANT AND WS-DE-SISTEMA = 1                 351200      
005204           MOVE  500                TO WS-MXCAJA-SISTEMA-L011     351355      
005205           MOVE  001                TO WS-MXCAJA-PRODUCTO-L011    351455      
005206           CALL "MOVS3NIVEL IN LIB-L011500" USING                 351500      
005207                WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS          351600      
005208           MOVE 1                   TO WS-BAN-CALLL011-500        351650      
005209        ELSE                                                      351700      
005210           NEXT SENTENCE                                          351800      
005211     ELSE                                                         352500      
005212        IF WS-DE-SIS001                                           353000      
005213           MOVE  500         TO WS-MXCAJA-SISTEMA-L011            353155      
005214           MOVE  001         TO WS-MXCAJA-PRODUCTO-L011           353255      
005215           IF WKS-FECHA-S500 > 0                                  353260      
005216              MOVE WKS-FECHA-S500  TO WS-MXCAJA-FECAPLI-L011      353270      
005217              CALL "MOVS3NIVEL  IN LIB-L011500" USING             353300      
005218                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       353400      
005219              MOVE 1      TO      WS-BAN-CALLL011-500             353451      
005220           ELSE                                                   353452      
005221              CALL "MOVS3NIVEL  IN LIB-L011500" USING             353456      
005222                   WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS       353460      
005223              MOVE 1      TO      WS-BAN-CALLL011-500             353461      
005224        ELSE                                                      353462      
005225        IF WS-DE-SIS701 AND (WKS-NUMCSI = 10 OR 32)               353464      
005226           MOVE 701             TO WS-MXCAJA-SISTEMA-L011         353466      
005227           IF WKS-FECHA-S701 > 0                                  353468      
005228              MOVE WKS-FECHA-S701  TO WS-MXCAJA-FECAPLI-L011      353469      
005229              CALL "MOVS3NIVEL  IN LIB-L011701" USING             353470      
005230                      WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS    353472      
005231              MOVE 1      TO      WS-BAN-CALLL011-701             353473      
005232           ELSE                                                   353474      
005233              CALL "MOVS3NIVEL  IN LIB-L011701" USING             353476      
005234                      WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS    353478      
005235              MOVE 1      TO      WS-BAN-CALLL011-701             353479      
005236        ELSE                                                      353500      
005237        IF WS-DE-SIS264                                           353501      
005238           MOVE 264             TO WS-MXCAJA-SISTEMA-L011         353502      
005239           IF WKS-FECHA-S264 > 0                                  353503      
005240              MOVE WKS-FECHA-S264  TO WS-MXCAJA-FECAPLI-L011      353504      
005241              CALL "MOVS3NIVEL  IN LIB-L011264" USING             353505      
005242                      WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS    353506      
005243              MOVE 1      TO      WS-BAN-CALLL011-264             353507      
005244           ELSE                                                   353508      
005245              CALL "MOVS3NIVEL  IN LIB-L011264" USING             353509      
005246                      WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS    353510      
005247              MOVE 1      TO      WS-BAN-CALLL011-264             353511      
005248        ELSE                                                      353512      
005249        IF WS-DE-SIS404 AND (WKS-NUMCSI = 4  OR 32)               353514      
005250           MOVE 404             TO WS-MXCAJA-SISTEMA-L011         353516      
005251           IF WKS-FECHA-S404 > 0                                  353518      
005252              MOVE WKS-FECHA-S404  TO WS-MXCAJA-FECAPLI-L011      353520      
005253              CALL "MOVS3NIVEL  IN LIB-L011404" USING             353522      
005254                      WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS    353524      
005255              MOVE 1      TO      WS-BAN-CALLL011-404             353526      
005256           ELSE                                                   353528      
005257              CALL "MOVS3NIVEL  IN LIB-L011404" USING             353530      
005258                      WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS    353532      
005259              MOVE 1      TO      WS-BAN-CALLL011-404             353534      
005260        ELSE                                                      353536      
005261        IF WS-DE-SIS501                                           353538      
005262           MOVE 501             TO WS-MXCAJA-SISTEMA-L011         353540      
005263           IF WKS-FECHA-S501 > 0                                  353541      
005264              MOVE WKS-FECHA-S501  TO WS-MXCAJA-FECAPLI-L011      353542      
005265              CALL "MOVS3NIVEL  IN LIB-L011501" USING             353543      
005266                      WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS    353544      
005267              MOVE 1      TO      WS-BAN-CALLL011-501             353545      
005268           ELSE                                                   353546      
005269              CALL "MOVS3NIVEL  IN LIB-L011501" USING             353547      
005270                      WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS    353548      
005271              MOVE 1      TO      WS-BAN-CALLL011-501             353549      
005272        ELSE                                                      353700      
005273        IF WS-DE-SIS018 AND (WKS-NUMCSI = 04 OR 32)               353710      
005274           MOVE 018             TO WS-MXCAJA-SISTEMA-L011         353720      
005275           IF WKS-FECHA-S018 > 0                                  353730      
005276              MOVE WKS-FECHA-S018  TO WS-MXCAJA-FECAPLI-L011      353740      
005277              CALL "MOVS3NIVEL  IN LIB-L011018" USING             353750      
005278                      WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS    353760      
005279              MOVE 1      TO      WS-BAN-CALLL011-018             353770      
005280           ELSE                                                   353780      
005281              CALL "MOVS3NIVEL  IN LIB-L011018" USING             353790      
005282                      WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS    353800      
005283              MOVE 1      TO      WS-BAN-CALLL011-018             353810      
005284        ELSE                                                      353812      
005285        IF WS-DE-SIS502 AND (WKS-NUMCSI = 10 OR 32)               353814      
005286           MOVE 502             TO WS-MXCAJA-SISTEMA-L011         353816      
005287           IF WKS-FECHA-S502 > 0                                  353818      
005288              MOVE WKS-FECHA-S502  TO WS-MXCAJA-FECAPLI-L011      353820      
005289              CALL "MOVS3NIVEL  IN LIB-L011502" USING             353822      
005290                      WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS    353824      
005291              MOVE 1      TO      WS-BAN-CALLL011-502             353826      
005292           ELSE                                                   353828      
005293              CALL "MOVS3NIVEL  IN LIB-L011502" USING             353830      
005294                      WS-ADMOV-MOVSXCAJA-L011 GIVING WS-STATUS    353832      
005295              MOVE 1      TO      WS-BAN-CALLL011-502.            353834      
005296                                                                  353850      
005297     MOVE 0 TO WS-IND2                                            353900      
005298     IF WS-STATUS = 0                                             354000      
005299        MOVE SPACES               TO WS-RESPUESTA-MOVIMIENTO-OK   354100      
005300        PERFORM 23100-ARMA-RESPUESTA VARYING WS-IND FROM 1 BY 1   354200      
005301                UNTIL WS-IND > 25 OR WS-IND2 > 24.                354300      
005302                                                                  354400      
005303     IF WS-PREFIJO-DESTINO = 015130 AND                           354450      
005304        WS-PREFIJO-ORIGEN  = 040310 AND                           354452      
005305        WS-STATUS > 0                                             354454      
005306        MOVE WS-TBL-ERRORES(11)           TO WS-RM-TEXT0-ERROR    354456      
005307        MOVE 11                           TO WS-RM-NUMERR         354458      
005308        MOVE WS-RESPUESTA-MOVIMIENTO-MAL  TO                      354460      
005309                                 WS-MENSAJE-ENTRE-APLICACIONES    354462      
005310     ELSE                                                         354464      
005311     IF WS-DE-SISNVO OR WS-DE-SISTEMA = 0001                      354500      
005312        OR WS-DE-SISTEMA = 0003                                   354550      
005313        IF WS-BAN-CALLL011-500 = 1 OR WS-BAN-CALLL011-701 = 1 OR  354555      
005314           WS-BAN-CALLL011-264 = 1 OR WS-BAN-CALLL011-404 = 1 OR  354557      
005315           WS-BAN-CALLL011-018 = 1 OR WS-BAN-CALLL011-502 = 1     354558      
005316           OR WS-BAN-CALLL011-501 = 1                             354559      
005317           MOVE WS-MXCAJA-AUTAPL-L011  TO WS-RM-CONT-AUTAPL       354560      
005318           MOVE WS-MXCAJA-AUTS151-L011 TO WS-RM-CONT-AUTADM       354565      
005319        ELSE                                                      354570      
005320           MOVE WS-MXCAJA-AUTAPL       TO WS-RM-CONT-AUTAPL       354600      
005321           MOVE WS-MXCAJA-AUTS151      TO WS-RM-CONT-AUTADM       354700      
005322     ELSE                                                         354800      
005323        MOVE WS-SIS-3NIV-AUTAPL        TO WS-RM-CONT-AUTAPL       354900      
005324        MOVE WS-SIS-3NIV-AUTADM        TO WS-RM-CONT-AUTADM.      355000      
005325                                                                  355030      
005326     IF WS-PREFIJO-DESTINO = 015130 AND                           355050      
005327        WS-PREFIJO-ORIGEN  = 040310 AND                           355060      
005328        WS-STATUS > 0                                             355070      
005329        NEXT SENTENCE                                             355080      
005330     ELSE                                                         355090      
005331        MOVE WS-SM-CAJA                   TO WS-RM-CAJA           355100      
005332        MOVE WS-SM-PRODUCTO               TO WS-RM-PRODUCTO       355200      
005333        MOVE WS-SM-MONEDA                 TO WS-RM-MONEDA         355300      
005334        MOVE WS-IND2                      TO WS-RM-OCURRENCIAS    355400      
005335        MOVE WS-RESPUESTA-MOVIMIENTO-OK   TO                      355500      
005336                                WS-MENSAJE-ENTRE-APLICACIONES.    355600      
005337                                                                  356000      
005338 23100-ARMA-RESPUESTA.                                            356100      
005339*==========================                                       356200      
005340     IF NOT WS-DE-SISNVO AND WS-DE-SISTEMA NOT = 1 AND            356300      
005341            WS-DE-SISTEMA NOT = 3                                 356350      
005342        IF WS-SIS-3NIV-CVET(WS-IND) > 0                           356400      
005343           ADD 1 TO WS-IND2                                       356500      
005344           MOVE WS-SIS-3NIV-NATUR(WS-IND)     TO                  356600      
005345                                     WS-RM-NATURALEZA (WS-IND2)   356700      
005346           MOVE WS-SIS-3NIV-AUTOT(WS-IND)     TO                  356800      
005347                                     WS-RM-AUTORIZACION(WS-IND2)  356900      
005348           MOVE WS-SIS-3NIV-SPROM(WS-IND)     TO                  357000      
005349                                     WS-RM-SUC-PROM   (WS-IND2)   357100      
005350           MOVE WS-SIS-3NIV-CTA  (WS-IND)     TO                  357200      
005351                                     WS-RM-CONTRATO   (WS-IND2)   357300      
005352           MOVE WS-SIS-3NIV-SDO  (WS-IND)     TO                  357400      
005353                                     WS-RM-IMPORTE    (WS-IND2)   357500      
005354           MOVE WS-SIS-3NIV-CVET (WS-IND)     TO                  357600      
005355                                     WS-RM-CLAVE-TRANS(WS-IND2)   357700      
005356           MOVE WS-SIS-3NIV-REFER(WS-IND)     TO                  357800      
005357                                     WS-RM-REFERENCIA (WS-IND2).  357900      
005358                                                                  358000      
005359     IF WS-DE-SISNVO OR WS-DE-SISTEMA = 1 OR WS-DE-SISTEMA = 3    358100      
005360        IF WS-MXCAJA-CVET(WS-IND) > 0                             358200      
005361           ADD 1 TO WS-IND2                                       358300      
005362           MOVE WS-MXCAJA-NATUR(WS-IND)     TO                    358400      
005363                               WS-RM-NATURALEZA  (WS-IND2)        358500      
005364           MOVE WS-MXCAJA-AUT  (WS-IND)     TO                    358600      
005365                               WS-RM-AUTORIZACION(WS-IND2)        358700      
005366           MOVE WS-MXCAJA-SPROM(WS-IND)     TO                    358800      
005367                               WS-RM-SUC-PROM    (WS-IND2)        358900      
005368           MOVE WS-MXCAJA-CTA  (WS-IND)     TO                    359000      
005369                               WS-RM-CONTRATO    (WS-IND2)        359100      
005370           MOVE WS-MXCAJA-IMP  (WS-IND)     TO                    359200      
005371                               WS-RM-IMPORTE     (WS-IND2)        359300      
005372           MOVE WS-MXCAJA-CVET (WS-IND)     TO                    359400      
005373                               WS-RM-CLAVE-TRANS (WS-IND2)        359500      
005374           MOVE WS-MXCAJA-REFER(WS-IND)     TO                    359600      
005375                               WS-RM-REFERENCIA  (WS-IND2).       359700      
005376                                                                  359800      
005377******************************************************************359900      
005378*                                                                *360000      
005379*          SOLICITUD DE COMPENSACION PARA TERCER NIVEL           *360100      
005380*                                                                *360200      
005381******************************************************************360300      
005382 24000-SOLICITUD-COMPENSACION.                                    360400      
005383*============================                                     360500      
005384                                                                  360600      
005385******************************************************************360700      
005386*                                                                *360800      
005387* SOLICITUD DE UN MOVIMIENTO EN ESPECIFICO PARA TERCER NIVEL     *360900      
005388*                                                                *361000      
005389******************************************************************361100      
005390 25000-SOLICITUD-MOVESPECIFICO.                                   361200      
005391*==============================                                   361300      
005392     MOVE ALL "00"                        TO WS-MENSAJE-SAL-SA2.  361400      
005393     MOVE ALL ZEROS                       TO WKS-DATOS-MOVESPEC.  361500      
005394     MOVE ZEROS                           TO WS-STATUS.           361600      
005395     MOVE WS-MENSAJE-ENTRE-APLICACIONES   TO WS-MENSAJE-ENT-SA2.  361800      
005396     MOVE WS-SOL-ME-NUMPROD               TO WS-DE-SISTEMA.       361804      
005397     MOVE WS-SOL-ME-NUMSUC                TO WS-DE-SUCURSAL.      361808      
005398     MOVE ZERO                            TO W77-DIALOGO          361812      
005399                                             W77-CONS-L011        361814      
005400                                             W77-SALIDA.          361816      
005401     IF WS-HDR-RES = 2                                            361818      
005402        MOVE 1                            TO W77-CONS-L011        361820      
005403     ELSE                                                         361822      
005404        PERFORM 221120-BUSCA-SISTEMA                              361824      
005405                VARYING W77-IND-CSI FROM 1 BY 1                   361826      
005406                UNTIL   W77-IND-CSI > 12   OR                     361828      
005407                        W77-SALIDA  = 1    OR                     361830      
005408                        WS-PROD-NUMERO(W77-IND-CSI) = 9999.       361832      
005409                                                                  361840      
005410     IF W77-CONS-L011 = 1                                         361852      
005411        PERFORM 25010-CONS-MOVESP                                 361854      
005412        IF WS-STATUS = 0                                          361856      
005413           MOVE ZEROS                     TO WS-RC-AUTORIZAOK     361858      
005414           MOVE WS-RESPUESTA-MOVESPECIFICO-OK TO                  361860      
005415                                     WS-MENSAJE-ENTRE-APLICACIONES361862      
005416        ELSE                                                      361864      
005417           MOVE 2                         TO WS-SA2-MENSAJE-RESULT361866      
005418           MOVE WS-STATUS                 TO WS-RP-NUMERR         361868      
005419           MOVE WS-RESPUESTA-MOVIMIENTO-MAL  TO                   361870      
005420                                    WS-MENSAJE-ENTRE-APLICACIONES 361871      
005421     ELSE                                                         361872      
005422        MOVE 2                            TO WS-SA2-MENSAJE-RESULT361873      
005423        MOVE 13                           TO WS-RP-NUMERR         361874      
005424        MOVE WS-TBL-ERRORES(13)           TO WS-RP-TEXT0-ERROR    361875      
005425        MOVE WS-RESPUESTA-MOVIMIENTO-MAL  TO                      361876      
005426                                 WS-MENSAJE-ENTRE-APLICACIONES.   361877      
005427     PERFORM 28000-LLENA-DATOS-SA2.                               361878      
005428     MOVE WS-TEXTO-SA2                    TO WS-DATOS-RESPUESTA.  361879      
005429                                                                  361880      
005430 25010-CONS-MOVESP.                                               361882      
005431*==================                                               361886      
005432     MOVE WS-SOL-ME-NUMPROD               TO WKS-L011-MESP-PROD.  362100      
005433*    PERFORM 20215-DEFINE-SISTPROD.                               362300      
005434     MOVE WS-SOL-ME-NUMSUC                TO WKS-L011-MESP-SUC.   362400      
005435     MOVE WS-SOL-ME-NUMCAJ                TO WKS-L011-MESP-CAJA.  362600      
005436     MOVE WS-SOL-ME-NUMAUT                TO WKS-L011-MESP-AUTAPL.362800      
005437     MOVE WS-SOL-ME-NUMMON                TO WKS-L011-MESP-MON.   363150      
005438                                                                  363200      
005439     IF WS-DE-SISNVO                                              363300      
005440        IF WS-DE-SIS001                                           365100      
005441           MOVE WKS-FECHA-S500     TO WKS-L011-MESP-FECHA         365154      
005442           CALL "MOVESPECIFICO IN LIB-L011500" USING              365156      
005443                WKS-DATOS-MOVESPEC GIVING WS-STATUS               365158      
005444        ELSE                                                      365452      
005445        IF WS-DE-SIS701 AND (WKS-NUMCSI = 10 OR 32)               365454      
005446           MOVE WKS-FECHA-S701     TO WKS-L011-MESP-FECHA         365456      
005447           CALL "MOVESPECIFICO IN LIB-L011701" USING              365457      
005448                WKS-DATOS-MOVESPEC GIVING WS-STATUS               365458      
005449        ELSE                                                      365469      
005450        IF WS-DE-SIS264                                           365470      
005451           MOVE WKS-FECHA-S264     TO WKS-L011-MESP-FECHA         365472      
005452           CALL "MOVESPECIFICO IN LIB-L011264" USING              365473      
005453                WKS-DATOS-MOVESPEC GIVING WS-STATUS               365474      
005454        ELSE                                                      365480      
005455        IF WS-DE-SIS404 AND (WKS-NUMCSI = 4  OR 32)               365482      
005456           MOVE WKS-FECHA-S404     TO WS-MXCAJA-FECAPLI-L011      365486      
005457           CALL "MOVESPECIFICO IN LIB-L011404" USING              365488      
005458                WKS-DATOS-MOVESPEC GIVING WS-STATUS               365490      
005459        ELSE                                                      365510      
005460        IF WS-DE-SIS501                                           365512      
005461           MOVE WKS-FECHA-S501     TO WS-MXCAJA-FECAPLI-L011      365516      
005462           CALL "MOVESPECIFICO IN LIB-L011501" USING              365518      
005463                WKS-DATOS-MOVESPEC GIVING WS-STATUS               365520      
005464        ELSE                                                      365600      
005465        IF WS-DE-SIS018 AND (WKS-NUMCSI = 04 OR 32)               365610      
005466           MOVE WKS-FECHA-S018     TO WKS-L011-MESP-FECHA         365630      
005467           CALL "MOVESPECIFICO IN LIB-L011018" USING              365640      
005468                WKS-DATOS-MOVESPEC GIVING WS-STATUS               365650      
005469        ELSE                                                      365802      
005470        IF WS-DE-SIS502 AND (WKS-NUMCSI = 10 OR 32)               365804      
005471           MOVE WKS-FECHA-S502     TO WKS-L011-MESP-FECHA         365808      
005472           CALL "MOVESPECIFICO IN LIB-L011502" USING              365810      
005473                WKS-DATOS-MOVESPEC GIVING WS-STATUS               365812      
005474     ELSE                                                         365900      
005475        MOVE 1                            TO WS-STATUS.           367890      
005476******************************************************************367900      
005477*                                                                *368000      
005478*      LLENADO DE DATOS GENERALES PARA MSG SA2                   *368100      
005479*                                                                *368200      
005480******************************************************************368300      
005481 28000-LLENA-DATOS-SA2.                                           368400      
005482*=====================                                            368500      
005483                                                                  368620      
005484     IF WS-PREFIJO-ORIGEN = 040310                                368640      
005485        MOVE "G0"                        TO WS-HDR-FAC-R.         368660      
005486     IF W77-DIALOGO = 1                                           368662      
005487        MOVE 15130                       TO WS-PREFIJO-DESTINO    368663      
005488        MOVE WS-HDR-CCR-DES              TO W77-CSI-DESTINO       368664      
005489        MOVE WS-HDR-CCR-ORG              TO W77-CSI-ORIGEN        368666      
005490        PERFORM 28010-CAMBIA-CSI                                  368668      
005491        MOVE 1                           TO WS-SA2-DIRECCION      368670      
005492        MOVE 0004                        TO WS-SA2-TIEMPO-ESPERA  368672      
005493        MOVE 00                          TO WS-SA2-RESULT-ICA     368674      
005494        MOVE 0                           TO WS-SA2-MENSAJE-CLASE  368676      
005495     ELSE                                                         368678      
005496        MOVE WS-PREFIJO-ORIGEN           TO WS-PREFIJO-DESTINO    368679      
005497        MOVE 11                          TO WS-HDR-RES            368680      
005498        MOVE 015130                      TO WS-PREFIJO-ORIGEN     368700      
005499        MOVE WS-SA2-ORIGEN-SISTEMA       TO WS-SA2-DESTINO-SISTEMA368800      
005500        MOVE 0151                        TO WS-SA2-ORIGEN-SISTEMA 368900      
005501        MOVE 2                           TO WS-SA2-DIRECCION      369000      
005502        MOVE 0001                        TO WS-SA2-TIEMPO-ESPERA  369100      
005503        MOVE 00                          TO WS-SA2-RESULT-ICA     369200      
005504        MOVE 0                           TO WS-SA2-MENSAJE-CLASE. 369300      
005505     IF WS-SA2-MENSAJE-RESULT = 2                                 369400      
005506        NEXT SENTENCE                                             369500      
005507     ELSE                                                         369600      
005508        MOVE 1                        TO WS-SA2-MENSAJE-RESULT.   369700      
005509     MOVE 1                           TO WS-SA2-MENSAJE-MODO      369800      
005510                                         WS-SA2-MODALIDAD         369900      
005511     ACCEPT WS-HORA-MAQUINA FROM TIME.                            370100      
005512     MOVE  WS-HHMMSS-MAQUINA          TO WS-SA2-HORA              370200      
005513     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          370302      
005514             A2K-ACCEPT-TODAYS-DATE-EXIT.                         370303      
005515     MOVE A2K-FEC-MDCA-001 TO WS-FECHA-MDA                        370304      
005516     MOVE ZEROS TO A2K-FEC-MDCA-001.                              370602      
005517     MOVE WS-FECHA-MDA TO A2K-FEC-MDCA-001.                       370603      
005518     PERFORM A2K-CONV-MDCA-TO-CAMD THRU                           370604      
005519             A2K-CONV-MDCA-TO-CAMD-EXIT.                          370605      
005520     PERFORM A2K-CONV-CAMD-TO-DMCA THRU                           370606      
005521             A2K-CONV-CAMD-TO-DMCA-EXIT.                          370607      
005522     MOVE A2K-FEC-DMCA-001 TO WS-FECHA-DMA.                       370608      
005523$SET OMIT = OLDCODE                                               370702      
005524     MOVE WS-FECHA-DMA                TO WS-SA2-FECHA.            370703      
005525$POP OMIT                                                         370704      
005526$SET OMIT = NOT OLDCODE                                           370705      
005527      MOVE ZEROS TO A2K-FEC-DMCA-001.                             370706      
005528      MOVE WS-FECHA-DMA TO A2K-FEC-DMCA-001.                      370707      
005529      PERFORM A2K-CONV-DMCA-TO-DMA THRU                           370708      
005530                A2K-CONV-DMCA-TO-DMA-EXIT.                        370709      
005531      MOVE A2K-FEC-DMA-001 TO WS-SA2-FECHA.                       370710      
005532$POP OMIT                                                         370711      
005533                                                                  370800      
005534 28010-CAMBIA-CSI.                                                370802      
005535*=================                                                370804      
005536    MOVE 2                     TO WS-HDR-RES.                     370806      
005537    MOVE W77-CSI-ORIGEN        TO WS-HDR-CCR-ORG.                 370808      
005538    IF W77-CSI-ORIGEN = 32 OR 4                                   370810      
005539       MOVE 10                 TO WS-HDR-CCR-DES                  370812      
005540    ELSE                                                          370814      
005541    IF W77-CSI-ORIGEN = 10                                        370816      
005542       MOVE 4                  TO WS-HDR-CCR-DES.                 370818      
005543                                                                  370820      
005544******************************************************************370900      
005545*         CODIGO DE TRANSACCION NO RECONOCIDO                    *371000      
005546******************************************************************371100      
005547 29000-RESPONDE-ERROR.                                            371200      
005548***********************************************************       371300      
005549*                                                         *       371400      
005550*               30000-RESPONDE-MAL                        *       371500      
005551*                                                         *       371600      
005552***********************************************************       371700      
005553 30000-RESPONDE-MAL.                                              371800      
005554    IF   WS-RESPERROR = 19                                        371900      
005555    STRING WS-DESPROTEGE,                                         372000      
005556           WS-POS-05-60,                                          372100      
005557           WS-DE-MDAFIJA,                                         372200      
005558           WS-PROTEGE,                                            372300      
005559           WS-HOME                                                372400      
005560           WS-POS                                                 372500      
005561           "     "                                                372600      
005562           WS-TBL-ERRORES(WS-RESPERROR),"                    ",   372700      
005563           WS-ETX                                                 372800      
005564           DELIMITED BY SIZE INTO WS-DATOS-RESPUESTA              372900      
005565           WITH POINTER WS-LONG-MSG                               373000      
005566    ELSE                                                          373100      
005567    IF   WS-RESPERROR = 7 OR 11 OR 12                             373200      
005568    STRING WS-HOME                                                373300      
005569           WS-POS                                                 373400      
005570           WS-TBL-ERRORES(WS-RESPERROR),"                    ",   373500      
005571           WS-ETX                                                 373600      
005572           DELIMITED BY SIZE INTO WS-DATOS-RESPUESTA              373700      
005573           WITH POINTER WS-LONG-MSG                               373800      
005574    ELSE                                                          373900      
005575    STRING WS-HOME                                                374000      
005576           WS-POS                                                 374100      
005577           "ERROR: "                                              374200      
005578           WS-TBL-ERRORES(WS-RESPERROR),"                    ",   374300      
005579           WS-ETX                                                 374400      
005580           DELIMITED BY SIZE INTO WS-DATOS-RESPUESTA              374500      
005581           WITH POINTER WS-LONG-MSG.                              374600      
005582************************************************************      374700      
005583*                                                          *      374800      
005584*                  40000-SENDCOMS                          *      374900      
005585*                                                          *      375000      
005586************************************************************      375100      
005587 40000-SENDCOMS.                                                  375200      
005588     IF WS-HDR-LST-ORG-AUX-R IS NUMERIC                           375300      
005589        MOVE WS-HDR-LST-ORG-AUX-R TO WS-HDR-COMS-LST-ORG-R        375400      
005590                                     WS-HDR-LST-ORG-R             375500      
005591     ELSE                                                         375600      
005592        MOVE WS-HDR-LST-ORG-AUX   TO WS-HDR-COMS-LST-ORG          375700      
005593                                     WS-HDR-LST-ORG.              375800      
005594    IF W77-DIALOGO = 1                                            375810      
005595       NEXT SENTENCE                                              375820      
005596    ELSE                                                          375830      
005597    IF WS-DIRECCIONA = 0                                          375900      
005598       MOVE WS-HDR-CCR-ORG TO WS-HDR-CCR-DES                      376000      
005599       MOVE WS-HDR-APL-ORG TO WS-HDR-APL-DES                      376100      
005600       MOVE "0"            TO WS-HDR-APL-ORG                      376200      
005601       MOVE 1              TO WS-HDR-RES                          376300      
005602*******MOVE 5              TO WS-HDR-RES                          376400      
005603       MOVE WS-DATOS-RESPUESTA TO WS-TEXTO                        376500      
005604       IF WS-HDR-COP-ORG > 00                                     376600      
005605          MOVE WS-HDR-COP-ORG TO WS-HDR-CCR-DES                   376700      
005606       ELSE                                                       376800      
005607          NEXT SENTENCE                                           376900      
005608    ELSE                                                          377000      
005609       MOVE 80 TO WS-LONG-MSG                                     377100      
005610       IF WS-MON = 1                                              377200      
005611          DISPLAY "WS-DIRECCIONA "WS-DIRECCIONA                   377300      
005612          DISPLAY "WS-MSG        "WS-MSG.                         377400      
005613****IF WS-HDR-APL-DES NOT = "0" THEN                              377500      
005614       MOVE 1852 TO WS-LONG-MSG                                   377600      
005615       MOVE 06   TO WS-HDR-RES.                                   377700      
005616    IF W77-DIALOGO = 1                                            377710      
005617       MOVE 2    TO WS-HDR-RES.                                   377720      
005618    IF WS-DIRECCIONA = 0                                          377800      
005619       IF WS-MON = 1                                              377900      
005620          STRING "* SALIDA :",WS-MSG DELIMITED BY SIZE INTO       378000      
005621                  REG-MONITOREO                                   378100      
005622          WRITE REG-MONITOREO                                     378200      
005623          DISPLAY  REG-MONITOREO                                  378300      
005624       ELSE NEXT SENTENCE                                         378400      
005625    ELSE                                                          378500      
005626    IF WS-HDR-APL-DES = "0"                                       378600      
005627       MOVE WS-HEADER             TO WS-HEADER-COMS               378700      
005628       MOVE WS-TEXTO              TO WS-TEXTO-COMS                378800      
005629       IF WS-MON = 1                                              378900      
005630          STRING "* SALIDA O/CSI :",WS-MSG-COMS DELIMITED BY SIZE 379000      
005631                  INTO REG-MONITOREO                              379100      
005632          WRITE REG-MONITOREO                                     379200      
005633          DISPLAY  REG-MONITOREO.                                 379300      
005634    ADD 48 TO WS-LONG-MSG                                         379400      
005635    MOVE WS-LONG-MSG TO LIB-LONGMSG                               379500      
005636    MOVE LIB-LONGMSG             TO CS-COMS-OUT-TEXT-LENGTH.      379600      
005637    MOVE 1                       TO CS-COMS-OUT-COUNT.            379700      
005638    MOVE 0                       TO CS-COMS-OUT-STATUS-KEY.       379800      
005639    MOVE LS-COMS-AG-SALIDA-DESG  TO CS-COMS-OUT-AGENDA.           379900      
005640    MOVE LS-COMS-DEFSTATION-DESG TO CS-COMS-OUT-DESTINATION.      380000      
005641    IF WS-DIRECCIONA = 0                                          380100      
005642       SEND CS-COMS-OUT FROM WS-MSG                               380200      
005643       IF WS-MON = 1                                              380300      
005644          DISPLAY "WS-MSG      "WS-MSG                            380400      
005645          DISPLAY "LIB-LONGMSG "LIB-LONGMSG                       380500      
005646          DISPLAY "MENSAJE " WS-MENSAJE-ENTRE-APLICACIONES        380510      
005647       ELSE                                                       380600      
005648          NEXT SENTENCE                                           380700      
005649    ELSE                                                          380800      
005650       SEND CS-COMS-OUT FROM WS-MSG-COMS                          380900      
005651       IF WS-MON = 1                                              381000      
005652          DISPLAY "WS-MSG-COMS "WS-MSG-COMS                       381100      
005653          DISPLAY "LIB-LONGMSG "LIB-LONGMSG.                      381200      
005654    IF CS-COMS-OUT-STATUS-KEY = 0 OR 96                           381300      
005655       NEXT SENTENCE                                              381400      
005656    ELSE                                                          381500      
005657      DISPLAY MY-ID ">> ERROR EN SEND MESSAGE ST-KEY="            381600      
005658              CS-COMS-OUT-STATUS-KEY.                             381700      
005659***********************************************************       381800      
005660*                                                         *       381900      
005661*                  50000-LIBEST                           *       382000      
005662*                                                         *       382100      
005663***********************************************************       382200      
005664 50000-LIBEST.                                                    382300      
005665*RGV v                                                            382400      
005666     IF WS-MON = 1                                                382700      
005667        DISPLAY "ENTRO A 50000-LIBEST"                            382800      
005668*RGV    DISPLAY "WS-RESULTADO        "WS-RESULTADO                382900      
005669        DISPLAY "WKS-CSI             "WKS-SAL-CSI                 383000      
005670        DISPLAY "WS-HDR-CCR-DES      "WS-HDR-CCR-DES              383100      
005671        DISPLAY "WS-HDR-RES          "WS-HDR-RES.                 383200      
005672     IF  WKS-CSIRES-SUC(WS-DE-SUCURSAL) =   ZEROS               OR383300      
005673         WS-HDR-RES                     =   2                     383350      
005674         MOVE  WS-HDR-CCR-DES           TO  WKS-SAL-CSI.          383400      
005675*RGV ^                                                            383500      
005676 900900-DISPLAY.                                                  383600      
005677*===============                                                  383700      
005678    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.          383800      
005679                                                                  383900      
005680 900000-FIN-MAL.                                                  384000      
005681*---------------                                                  384100      
005682                                                                  384200      
005683     MOVE " > FIN MAL DEL PROCESO < " TO TEXTO-LJ.                384300      
005684*     PERFORM 900900-DISPLAY                                      384400      
005685     MOVE "   AVISAR AL RESPONSABLE DEL SISTEMA " TO TEXTO-LJ     384500      
005686*     PERFORM 900900-DISPLAY                                      384600      
005687                                                                  384700      
005688     PERFORM 999999-FIN.                                          384800      
005689                                                                  384900      
005690 999999-FIN.                                                      385000      
005691     MOVE "DISABLE PROGRAM "      TO LS-SMCOMS-STRING1            385100      
005692     MOVE LS-COMS-MY-PROGRAM-NAME TO LS-SMCOMS-STRING2            385200      
005693     CALL "SMCOMS OF SOPORTECOMS"                                 385300      
005694           USING  LS-SMCOMS-COMANDO                               385400      
005695                  LS-SMCOMS-TRABAJO                               385500      
005696           GIVING LS-SMCOMS-RESULT.                               385600      
005697     IF LS-SMCOMS-OK                                              385700      
005698        NEXT SENTENCE                                             385800      
005699     ELSE                                                         385900      
005700        MOVE " ERROR DISABLE RESULTS " TO TEXTO-LJ                386000      
005701        PERFORM 900900-DISPLAY                                    386100      
005702        MOVE LS-SMCOMS-RESULT          TO TEXTO-LJ                386200      
005703        PERFORM 900900-DISPLAY.                                   386300      
005704                                                                  386400      
005705*END OF PROGRAM.                                                  386500      
005706*===============                                                  386600      
005707*INICIA CODIGO DE RENOVACION CRONOS 2000                          386601      
005708*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
005709*  COPY "S151/CRONOS2K/CPY/PD".                                   386602      
005710** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
005711** Unisys has defined for CRONOS2K project                     ** 000200      
005712** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
005713***************************************************************** 000400      
005714***************************************************************** 000600      
005715** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
005716** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
005717** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
005718** date MMDDCCAA, which is returned into the variable          ** 001000      
005719** A2K-FEC-MDCA-001.                                           ** 001100      
005720***************************************************************** 001200      
005721                                                                  001300      
005722 A2K-ACCEPT-TODAYS-DATE.                                          001400      
005723        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
005724*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
005725        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
005726        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
005727        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
005728        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
005729        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
005730                                                                  002200      
005731 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
005732        EXIT.                                                     002240      
005733                                                                  002500      
005734****************************************************************  002600      
005735** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
005736**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
005737**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
005738**baseyear to add the century to the year part.               **  003000      
005739**INPUT is A2K-FEC-AMD-001                                    **  003100      
005740**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
005741****************************************************************  003300      
005742                                                                  003400      
005743 A2K-CONV-AMD-TO-CAMD.                                            003500      
005744         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
005745         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
005746         IF A2K-FEC-AMD-001 = 0                                   003720      
005747            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
005748         ELSE                                                     003741      
005749          IF A2K-FEC-AMD-001 = 999999                             003742      
005750             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
005751         ELSE                                                     003760      
005752         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
005753                 A2K-OBTAIN-CENTURY-EXIT                          003900      
005754         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
005755         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
005756         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
005757         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
005758                                                                  004400      
005759 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
005760         EXIT.                                                    004600      
005761                                                                  004700      
005762******************************************************************004800      
005763**A2K-CONV-MDA-TO-MDCA.                                         **004900      
005764**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
005765** an eight digit format as MMDDCCAA. It use a                  **005100      
005766** baseyear to add century to the yaer.                         **005200      
005767** INPUT is A2K-FEC-MDA-001                                     **005300      
005768** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
005769                                                                  005500      
005770 A2K-CONV-MDA-TO-MDCA.                                            005600      
005771     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
005772     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
005773     IF A2K-FEC-MDA-001 = 0                                       005820      
005774        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
005775     ELSE                                                         005845      
005776      IF A2K-FEC-MDA-001 = 999999                                 005850      
005777         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
005778     ELSE                                                         005860      
005779     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
005780             A2K-OBTAIN-CENTURY-EXIT                              006000      
005781     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
005782     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
005783     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
005784     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
005785                                                                  006500      
005786 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
005787     EXIT.                                                        006700      
005788                                                                  006800      
005789***************************************************************** 006900      
005790**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
005791**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
005792**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
005793**baseyear to add century to the year.                         ** 007300      
005794**INPUT is A2K-FEC-DMA-001                                     ** 007400      
005795**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
005796                                                                  007600      
005797 A2K-CONV-DMA-TO-DMCA.                                            007700      
005798       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
005799       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
005800       IF  A2K-FEC-DMA-001   = 0                                  007920      
005801          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
005802       ELSE                                                       007945      
005803        IF A2K-FEC-DMA-001 = 999999                               007950      
005804          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
005805       ELSE                                                       007960      
005806       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
005807               A2K-OBTAIN-CENTURY-EXIT                            008100      
005808       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
005809       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
005810       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
005811       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
005812                                                                  008600      
005813 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
005814       EXIT.                                                      008800      
005815                                                                  008900      
005816***************************************************************** 009000      
005817** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
005818** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
005819** a 6 digit format as AAMMDD.                                 ** 009300      
005820** It simply removes the century information in the output     ** 009400      
005821** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
005822** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
005823                                                                  009700      
005824 A2K-CONV-CAMD-TO-AMD.                                            009800      
005825     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
005826     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
005827     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
005828     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
005829                                                                  010300      
005830 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
005831      EXIT.                                                       010500      
005832                                                                  010600      
005833******************************************************************010700      
005834******************************************************************010800      
005835** A2K-CONV-MDCA-TO-MDA.                                        **010900      
005836** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
005837** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
005838** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
005839** INPUT is A2K-FEC-MDCA-001                                    **011300      
005840** OUTPUT is A2K-FEC-MDA-001                                    **011400      
005841                                                                  011500      
005842 A2K-CONV-MDCA-TO-MDA.                                            011600      
005843     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
005844     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
005845     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
005846     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
005847                                                                  012100      
005848 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
005849      EXIT.                                                       012300      
005850                                                                  012400      
005851******************************************************************012500      
005852***************************************************************** 012600      
005853** A2K-CONV-DMCA-TO-DMA.                                        **012700      
005854** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
005855** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
005856** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
005857** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
005858** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
005859                                                                  013300      
005860 A2K-CONV-DMCA-TO-DMA.                                            013400      
005861     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
005862     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
005863     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
005864     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
005865                                                                  013900      
005866 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
005867      EXIT.                                                       014100      
005868                                                                  014200      
005869***************************************************************** 014300      
005870 A2K-CONV-MDCA-TO-CAMD.                                           014400      
005871      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
005872      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
005873      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
005874      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
005875      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
005876 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
005877      EXIT.                                                       015100      
005878***************************************************************** 015200      
005879** This paragraph adds century to an year field which is 9(02) ** 015300      
005880** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
005881** Output is A2K-FEC-CCAA-001.                                 ** 015600      
005882***************************************************************** 015700      
005883 A2K-CONV-AA-TO-CCAA.                                             015800      
005884      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
005885      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
005886              A2K-OBTAIN-CENTURY-EXIT.                            016100      
005887      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
005888 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
005889      EXIT.                                                       016400      
005890***************************************************************** 016500      
005891** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
005892** format.                                                     ** 016700      
005893** Input is A2K-FEC-DMCA-001.                                  ** 016800      
005894** Output is A2K-FEC-CAMD-001.                                 ** 016900      
005895***************************************************************** 017000      
005896 A2K-CONV-DMCA-TO-CAMD.                                           017100      
005897      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
005898      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
005899      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
005900      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
005901      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
005902 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
005903      EXIT.                                                       017800      
005904***************************************************************** 017900      
005905** This paragraph desides the Century to be added depending    ** 018000      
005906** on the base year.                                           ** 018100      
005907** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
005908** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
005909***************************************************************** 018400      
005910 A2K-OBTAIN-CENTURY.                                              018500      
005911      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
005912          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
005913      ELSE                                                        018800      
005914          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
005915 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
005916      EXIT.                                                       019100      
005917                                                                  019200      
005918***************************************************************** 019300      
005919** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
005920**  Format                                                     ** 019500      
005921** Input Is A2K-FEC-CAMD-001                                   ** 019600      
005922** Output Is A2K-FEC-DMCA-001                                  ** 019700      
005923***************************************************************** 019800      
005924 A2K-CONV-CAMD-TO-DMCA.                                           019900      
005925      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
005926      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
005927      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
005928      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
005929      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
005930                                                                  020500      
005931 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
005932      EXIT.                                                       020700      
005933                                                                  020800      
005934******************************************************************020900      
005935******************************************************************021000      
005936 A2K-CONV-AM-TO-CAM.                                              021100      
005937      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
005938      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
005939      IF A2K-FEC-AM-001 = 0                                       021220      
005940         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
005941      ELSE                                                        021245      
005942      IF A2K-FEC-AM-001 = 9999                                    021250      
005943         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
005944      ELSE                                                        021260      
005945      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
005946      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
005947      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
005948              A2K-OBTAIN-CENTURY-EXIT                             021600      
005949      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
005950                                                                  021800      
005951 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
005952      EXIT.                                                       022000      
005953                                                                  022100      
005954******************************************************************022200      
005955******************************************************************022300      
005956 A2K-CONV-CAM-TO-AM.                                              022400      
005957      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
005958      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
005959      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
005960                                                                  022800      
005961 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
005962   EXIT.                                                          023000      
005963                                                                  023100      
005964                                                                  023200      
005965                                                                  023500      
005966*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
005967  A2K-CPY-EXIT-PARA.                                              386603      
005968  EXIT.                                                           386604      
005969*TERMINA CODIGO DE RENOVACION CRONOS 2000                         386605      
