000001$SET LINEINFO OPTIMIZE LIST                                       000200      
000002$SET OPTIMIZE                                                     000400      
000003$SET LISTOMITTED                                                  000600      
000004*$SET TADS                                                        000800      
000005 IDENTIFICATION DIVISION.                                         001000      
000006 PROGRAM-ID. EXTENDEDNETWORK.                                     001200      
000007 AUTHOR. HECTOR SERRANO MEZA.                                     001400      
000008                                                                  001600      
000009 ENVIRONMENT DIVISION.                                            001800      
000010 INPUT-OUTPUT SECTION.                                            002000      
000011 FILE-CONTROL.                                                    002200      
000012                                                                  002400      
000013     SELECT A01-MOVS500   ASSIGN       TO DISK                    002600      
000014                          ORGANIZATION IS SEQUENTIAL              002800      
000015                          ACCESS MODE  IS SEQUENTIAL              003000      
000016                          ACTUAL KEY   IS W77-NUMREG-MOV500.      003200      
000017                                                                  003400      
000018     SELECT A02-DESS500   ASSIGN       TO DISK                    003600      
000019                          ACCESS MODE IS RANDOM                   003800      
000020                          ACTUAL KEY IS W77-LLAVE.                004000      
000021                                                                  004200      
000022     SELECT A03-CTL-ENVIO ASSIGN       TO DISK                    004400      
000023                          ACCESS MODE  IS SEQUENTIAL              004600      
000024                          ACTUAL KEY   IS W77-NUMREG-ACC.         004800      
000025                                                                  005000      
000026     SELECT A04-EXTNET-ARCHIVO     ASSIGN   TO DISK.              005200      
000027                                                                  005400      
000028     SELECT A04-EXTNET-ARCHIVO-D   ASSIGN   TO DISK.              005600      
000029                                                                  005800      
000030     SELECT A05-AUTORIZACIONES     ASSIGN   TO DISK               006000      
000031                                   ORGANIZATION IS INDEXED        006200      
000032                                   ACCESS MODE IS DYNAMIC         006400      
000033                                   RECORD KEY  IS KEY-AUTS151.    006600      
000034                                                                  006800      
000035 DATA        DIVISION.                                            007000      
000036 FILE SECTION.                                                    007200      
000037 FD A01-MOVS500                                                   007400      
000038*==============                                                   007600      
000039    VALUE OF TITLE       IS WKS-TITLE-MOVS500                     007800      
000040    VALUE OF BUFFERS IS 1                                         008000      
000041    BLOCK  CONTAINS 144 RECORDS.                                  008200      
000042                                                                  008400      
000043    01 A01-R01-S500               PIC X(450).                     008600      
000044                                                                  008800      
000045 FD A02-DESS500                                                   009000      
000046*==============                                                   009200      
000047    VALUE OF TITLE       IS WKS-TITLE-DESS500                     009400      
000048    VALUE OF BUFFERS IS 1                                         009600      
000049    BLOCK  CONTAINS 120 RECORDS.                                  009800      
000050                                                                  010000      
000051    01 A02-R01-S500               PIC X(540).                     010200      
000052                                                                  010400      
000053 FD A03-CTL-ENVIO                                                 010600      
000054    VALUE OF TITLE       IS WKS-CTLENV.                           010800      
000055                                                                  011000      
000056 01 R01-REG-ENVIO.                                                011200      
000057    03 R01-REG-AUTS500            PIC 9(08).                      011400      
000058    03 R01-REG-SECARCH            PIC 9(04).                      011600      
000059    03 R01-REG-SECDET             PIC 9(08).                      011800      
000060    03 R01-REG-SECDET-DOL         PIC 9(08).                      012000      
000061    03 R01-REG-IND-ENV            PIC 9(06).                      012200      
000062    03 R01-REG-STATUS-FILE        PIC 9(01).                      012250      
000063    03 R01-REG-IND-ARCH           PIC 9(06).                      012300      
000064    03 R01-REG-STATUS-FILE-D      PIC 9(01).                      012320      
000065    03 R01-REG-IND-ARCH-D         PIC 9(06).                      012340      
000066    03 R01-REG-FECNAT             PIC 9(08).                      012400      
000067    03 R01-REG-ABON-PES           PIC 9(08).                      012410      
000068    03 R01-REG-TOTAL-ABON-PES     PIC 9(16)V99.                   012420      
000069    03 R01-REG-CARG-PES           PIC 9(08).                      012430      
000070    03 R01-REG-TOTAL-CARG-PES     PIC 9(16)V99.                   012440      
000071    03 R01-REG-NO-CONT-PES        PIC 9(08).                      012450      
000072    03 R01-REG-ABON-DOL           PIC 9(08).                      012460      
000073    03 R01-REG-TOTAL-ABON-DOL     PIC 9(16)V99.                   012470      
000074    03 R01-REG-CARG-DOL           PIC 9(08).                      012480      
000075    03 R01-REG-TOTAL-CARG-DOL     PIC 9(16)V99.                   012490      
000076    03 R01-REG-NO-CONT-DOL        PIC 9(08).                      012500      
000077    03 FILLER                     PIC X(06).                      012600      
000078                                                                  012800      
000079 FD A04-EXTNET-ARCHIVO                                            013000      
000080    VALUE OF MAXRECSIZE  IS 670                                   013200      
000081    BLOCK CONTAINS       90 RECORDS.                              013400      
000082                                                                  013600      
000083    01 A04-REG-EXTNET             PIC X(670).                     013800      
000084                                                                  014000      
000085 FD A04-EXTNET-ARCHIVO-D                                          014200      
000086    VALUE OF MAXRECSIZE  IS 670                                   014400      
000087    BLOCK CONTAINS       90 RECORDS.                              014600      
000088                                                                  014800      
000089    01 A04-REG-EXTNET-D           PIC X(670).                     015000      
000090                                                                  015200      
000091 FD A05-AUTORIZACIONES                                            015400      
000092    VALUE OF MAXRECSIZE  IS 465                                   015450      
000093    BLOCK CONTAINS       132 RECORDS                              015500      
000094    VALUE OF TITLE       IS WKS-TIT-AUTORIZA.                     015600      
000095                                                                  015800      
000096 01 R01-REG-AUTORIZA.                                             016000      
000097    03 KEY-AUTS151.                                               016200      
000098       05 R01-REG-AUTS500EXT      PIC 9(08).                      016400      
000099    03 R01-REG-AUTAELIM           PIC 9(08)       COMP.           016600      
000100    03 R01-REG-AUTANTS151         PIC 9(08)       COMP.           016800      
000101    03 R01-REG-TIP-PROC           PIC 9(02)       COMP.           017000      
000102    03 R01-REG-TRANSACCIONES     OCCURS 5 TIMES.                  017200      
000103       05 R01-REG-CVETRAN            PIC 9(04)    COMP.           017400      
000104       05 R01-REG-500INDLEY          PIC 9(02)    COMP.           017600      
000105       05 R01-REG-IMPORTE            PIC 9(16)V99 COMP.           017800      
000106    03 R01-REG-500TIPMDA          PIC 9(02)       COMP.           018000      
000107    03 R01-REG-500MEDACC          PIC 9(16)       COMP.           018200      
000108    03 R01-REG-500MONEDA          PIC 9(04)       COMP.           018400      
000109    03 R01-REG-500REFNUM          PIC 9(12)       COMP.           018600      
000110    03 R01-REG-500LEYENDA-1       PIC X(40).                      018800      
000111    03 R01-REG-500LEYENDA-2       PIC X(40).                      019000      
000112    03 R01-REG-500LEYENDA-3       PIC X(40).                      019200      
000113    03 R01-REG-500LEYENDA-4       PIC X(40).                      019400      
000114    03 R01-REG-500LEYENDA-5       PIC X(40).                      019600      
000115    03 R01-REG-500REFADIC1        PIC X(35).                      019800      
000116    03 R01-REG-500REFADIC2        PIC X(35).                      020000      
000117    03 R01-REG-500REFADIC3        PIC X(35).                      020200      
000118    03 R01-REG-500NUMAUTORIZA     PIC 9(08)       COMP.           020400      
000119    03 R01-REG-500NUMSUCOPE       PIC 9(04)       COMP.           020600      
000120    03 R01-REG-500NUMCAJOPE       PIC 9(02)       COMP.           020800      
000121    03 R01-REG-500NUMSUCTRA       PIC 9(04)       COMP.           021000      
000122    03 R01-REG-500NUMCAJTRA       PIC 9(02)       COMP.           021200      
000123    03 R01-REG-HORMOV             PIC 9(06)       COMP.           021400      
000124    03 R01-REG-STATUS             PIC 9(02)       COMP.           021600      
000125    03 FILLER                     PIC X(52).                      021800      
000126                                                                  022000      
000127 WORKING-STORAGE SECTION.                                         022200      
000128                                                                  022400      
000129*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000130* COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS ON CMEMP.".             022600      
000131                                                                  000100      
000132******************************************************************000200      
000133**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
000134**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
000135**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
000136******************************************************************000600      
000137                                                                  000700      
000138 01 A00-R00-HDR-MOV .                                             000800      
000139    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
000140    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
000141    02 FILLER                          PIC  X(08).                001100      
000142    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
000143    02 FILLER                          PIC  X(430).               001300      
000144                                                                  001400      
000145 01 A00-R01-REGMOV .                                              001500      
000146    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
000147    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
000148    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
000149                                                                  001900      
000150    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
000151    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
000152                                       PIC  9(04)      COMP.      002200      
000153    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
000154                                       PIC  9(04)      COMP.      002400      
000155                                                                  002500      
000156    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000157    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
000158                                       PIC  9(02)      COMP.      002800      
000159    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
000160                                       PIC  9(02)      COMP.      003000      
000161    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
000162    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
000163                                       A00-R01-SERVICIO-ALERTA.   003060      
000164       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
000165       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
000166    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
000167    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
000168    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
000169                                       PIC  9(04)      COMP.      003420      
000170    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
000171    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
000172                                       PIC  9(04)      COMP.      003520      
000173    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
000174    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
000175    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
000176                                       PIC  9(02)      COMP.      003900      
000177                                                                  004000      
000178    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
000179    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
000180       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
000181          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
000182          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
000183          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
000184          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
000185          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
000186          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
000187          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
000188                                                                  005100      
000189    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
000190       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
000191       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
000192       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
000193       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
000194       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
000195       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
000196       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
000197                                                                  006000      
000198       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
000199       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
000200       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
000201       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
000202       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
000203       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
000204       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
000205                                                                  006800      
000206       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
000207       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
000208       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
000209       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
000210       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
000211       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
000212       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
000213                                                                  007600      
000214       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
000215       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
000216       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
000217       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
000218       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
000219       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
000220       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
000221                                                                  008400      
000222       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
000223       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
000224       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
000225       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
000226       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
000227       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
000228       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
000229                                                                  009200      
000230    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
000231    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
000232    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
000233    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
000234    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
000235    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
000236       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
000237    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
000238    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
000239    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
000240    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
000241    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
000242    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
000243    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
000244    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
000245       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
000246       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
000247    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
000248    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
000249    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
000250    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
000251    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
000252    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
000253    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
000254    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
000255    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
000256    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
000257    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
000258    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
000259    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
000260    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
000261                                       PIC X(10).                 012600      
000262    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
000263       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
000264       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
000265    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
000266    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
000267    03 A00-R01-FILIAL                  PIC  X(05).                013200      
000268    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
000269       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
000270       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
000271                                                                  013300      
000272    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
000273    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
000274                                       PIC  X(09).                013600      
000275    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
000276                                       PIC  9(18)      COMP.      013800      
000277    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
000278    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
000279                                       PIC  X(9).                 014100      
000280    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
000281    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
000282                                       PIC  X(05).                014400      
000283    03 A00-R01-NIO                     PIC  X(16).                014500      
000284    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
000285    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
000286    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
000287       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
000288    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
000289    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
000290       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
000291    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
000292    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
000293    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
000294    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
000295    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
000296    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
000297                                       PIC  X(04).                015900      
000298    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
000299    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
000300    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
000301                                       PIC  9(04)      COMP.      016300      
000302    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
000303    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
000304    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
000305    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
000306    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
000307                                                                  016900      
000308    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
000309    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
000310       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
000311    03 A00-R01-FILXAPL                 PIC X(165).                017300      
000312                                                                  017400      
000313    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
000314       05 FILLER                       PIC X(96).                 017510      
000315       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
000316       05 FILLER                       PIC X(67).                 017700      
000317                                                                  017702      
000318    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
000319       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
000320       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
000321       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
000322       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
000323       06 WKS-MOV-FILS084              PIC X(154).                017714      
000324                                                                  017800      
000325    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
000326       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
000327       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
000328       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
000329       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
000330       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
000331       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
000332       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
000333       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
000334       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018155      
000335*      CAMPOS NUEVOS                                              018160      
000336       05 A00-R01-SUCFOND              PIC 9(04)      COMP.       018161      
000337       05 A00-R01-CTAFOND              PIC 9(16)      COMP.       018162      
000338       05 A00-R01-OPBANEL              PIC 9(04)      COMP.       018163      
000339       05 A00-R01-GATN                 PIC S9(03)V99   COMP.      018164      
000340       05 A00-R01-GATR                 PIC S9(03)V99   COMP.      018165      
000341       05 A00-R01-FECGAT               PIC 9(08)      COMP.       018166      
000342       05 FILLER                       PIC X(40).                 018167      
000343*       05 FILLER                       PIC X(62).                018170      
000344       05 A00-R01-CTE-087              PIC X(07).                 018210      
000345       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
000346          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
000347          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
000348          07 FILLER                    PIC X(01).                 018281      
000349       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
000350       05 FILLER                       PIC X(61).                 018400      
000351                                                                  018500      
000352    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
000353       05 FILLER                       PIC  X(96).                018610      
000354       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
000355       05 FILLER                       PIC  X(65).                018630      
000356                                                                  018640      
000357    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
000358       05 A00-R01-FORMATO0             PIC  9(02).                018700      
000359       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
000360       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
000361       05 FILLER                       PIC  X(141).               018910      
000362                                                                  019100      
000363    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
000364       05 A00-R01-FORMATO1             PIC  9(02).                019300      
000365       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
000366       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
000367       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
000368       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
000369       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
000370       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
000371       05 A00-R01-ENTSAL               PIC  X(01).                020000      
000372       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
000373       05 FILLER                       PIC  X(69).                020200      
000374                                                                  020300      
000375    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
000376       05 A00-R01-FORMATO2             PIC  9(02).                020500      
000377       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
000378       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
000379       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
000380       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
000381       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
000382       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
000383       05 FILLER                       PIC  X(77).                021200      
000384                                                                  021300      
000385    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
000386       05 A00-R01-FORMATO3             PIC  9(02).                021500      
000387       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
000388       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
000389       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
000390       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
000391       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
000392       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
000393       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
000394       05 FILLER                       PIC  X(69).                022300      
000395                                                                  022400      
000396    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
000397       05 A00-R01-FORMATO4             PIC  9(02).                022600      
000398       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
000399       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
000400       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
000401       05 A00-R01-RFCFT04              PIC  X(13).                023000      
000402       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
000403       05 A00-R01-DIRECCION            PIC  X(40).                023200      
000404       05 FILLER                       PIC  X(85).                023300      
000405                                                                  023400      
000406    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
000407       05 A00-R01-COBERTURA            PIC  X(01).                023408      
000408       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
000409       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
000410       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
000411       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
000412       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
000413       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
000414       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
000415       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
000416       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
000417       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
000418       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
000419       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
000420       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
000421       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
000422       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
000423       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
000424       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
000425       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
000426       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
000427       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
000428       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
000429       05 FILLER                       PIC  X(05).                023492      
000430                                                                  023497      
000431    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
000432       05 A00-R01-4CEROS               PIC  9(04).                023600      
000433       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
000434       05 FILLER                       PIC  X(157).               023800      
000435                                                                  023900      
000436    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
000437       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
000438        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
000439       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
000440       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
000441       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
000442       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
000443       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
000444       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
000445       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
000446       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
000447       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
000448       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
000449       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
000450       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
000451       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
000452       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
000453       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
000454       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
000455       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
000456       05 A00-R01-FILLER               PIC  X(41).                025850      
000457       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
000458       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
000459       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
000460       05 A00-R01-INDPAGO              PIC  9(01).                026200      
000461       05 FILLER                       PIC  X(01).                026210      
000462       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
000463       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
000464       05 FILLER                       PIC  X(52).                026300      
000465                                                                  026400      
000466    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
000467       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
000468       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
000469       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
000470       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
000471       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
000472       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
000473       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
000474       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
000475       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
000476       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
000477       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
000478       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
000479       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
000480          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
000481          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
000482       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
000483       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
000484          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
000485       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
000486          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
000487       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
000488          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
000489       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
000490          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
000491       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
000492          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
000493       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
000494          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
000495       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
000496          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
000497       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
000498          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
000499       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
000500          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
000501       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
000502          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
000503          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
000504       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
000505       05 FILLER                       PIC X(01).                 030101      
000506       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
000507       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
000508       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
000509       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
000510       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
000511       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
000512       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
000513       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
000514          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
000515       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
000516       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
000517       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
000518       05 FILLER                       PIC X(14).                 030700      
000519                                                                  030800      
000520    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
000521       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
000522       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
000523       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
000524       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
000525       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
000526       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
000527       05 A00-R01-151-CITI             PIC  9(02)     COMP.       031520      
000528       05 A00-R01-151-IND-BNE          PIC  9(02)     COMP.       031540      
000529       05 FILLER                       PIC  X(140).               031600      
000530                                                                  031700      
000531    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
000532       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
000533       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
000534       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
000535       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
000536       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
000537       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
000538       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
000539       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
000540       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
000541       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
000542          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
000543          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
000544          07 FILLER                    PIC  X(08).                032740      
000545       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
000546       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
000547       05 A00-R01-NOMORD               PIC  X(30).                033000      
000548       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
000549       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
000550       05 A00-R01-REF-CECO             PIC  X(07).                033500      
000551       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
000552       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
000553          A00-R01-NUM-ORD-PAGO.                                   033800      
000554          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
000555          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
000556                                                                  034100      
000557    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
000558       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
000559       05 A00-R01-RFC-S501             PIC  X(13).                034160      
000560       05 FILLER                       PIC  X(151).               034180      
000561                                                                  034190      
000562    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
000563       05 A00-R01-DATOS-S701           PIC X(116).                034300      
000564       05 A00-R01-PAG-SERV             REDEFINES                  034400      
000565                                       A00-R01-DATOS-S701.        034500      
000566          07 A00-R01-ID                PIC X(30).                 034600      
000567          07 A00-R01-FECREC            PIC 9(06).                 034700      
000568          07 A00-R01-REF1              PIC X(20).                 034800      
000569          07 A00-R01-REF2              PIC X(20).                 034900      
000570          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
000571          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
000572                                       A00-R01-TIPOPAGO.          035200      
000573             09 A00-R01-ESTAB          PIC 9(04).                 035300      
000574             09 A00-R01-SEQ            PIC 9(02).                 035400      
000575          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
000576          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
000577          07 A00-R01-EBPP              PIC 9(03).                 035700      
000578          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
000579          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
000580          07 FILLER                    PIC X(01).                 035728      
000581          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
000582          07 FILLER                    PIC X(18).                 035760      
000583       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
000584                                       A00-R01-DATOS-S701.        035900      
000585          07 A00-R01-RFC               PIC X(13).                 036000      
000586          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
000587          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
000588          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
000589          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
000590          07 FILLER                    PIC X(85).                 036200      
000591       05 FILLER                       PIC X(49).                 036300      
000592                                                                  036400      
000593    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
000594       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
000595       05 A00-R01-CTA-S702             PIC X(40).                 036700      
000596       05 FILLER                       PIC X(113).                036710      
000597                                                                  036720      
000598    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
000599       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
000600       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
000601       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
000602       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
000603       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
000604       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
000605       05 FILLER                       PIC X(72).                 036800      
000606                                                                  036810      
000607                                                                  036820      
000608    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
000609       05 A00-R01-TRUI-S711.                                      036915      
000610          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
000611          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
000612          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
000613           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
000614          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
000615       05 A00-R01-MICR-S711.                                      036945      
000616          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
000617          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
000618          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
000619          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
000620          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
000621          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
000622          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
000623          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
000624       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
000625       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
000626       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
000627       05 A00-R01-FIL-S711             PIC X(05).                 036965      
000628       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
000629       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
000630       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
000631                                                                  036990      
000632    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
000633       05 A00-R01-RFC-502              PIC  X(13).                037100      
000634       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
000635          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
000636          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
000637          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
000638          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
000639          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
000640          07 FILLER                    PIC  9(01) COMP.           037650      
000641       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
000642       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
000643       05 FILLER                       PIC  X(06).                038680      
000644                                                                  038682      
000645    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
000646       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
000647       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
000648       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
000649       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
000650       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
000651       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
000652       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
000653       05 FILLER                       PIC  X(81).                038750      
000654                                                                  038755      
000655    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
000656       05 A00-R01-COP                  PIC  9(13)        .        038900      
000657       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
000658       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
000659       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
000660       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
000661       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
000662       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
000663       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
000664       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
000665       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
000666       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
000667       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
000668       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
000669       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
000670       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
000671       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
000672       05 FILLER                       PIC  X(81)        .        040800      
000673                                                                  040810      
000674    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
000675       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
000676       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
000677       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
000678       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
000679       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
000680       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
000681       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
000682       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
000683       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
000684       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
000685       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
000686       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
000687       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
000688       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
000689       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
000690       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
000691       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
000692       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
000693       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
000694       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
000695       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
000696       05 FILLER                       PIC  X(18).                041040      
000697                                                                  041400      
000698    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
000699    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
000700*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000701                                                                  022800      
000702*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000703* COPY "(S151)S151/FORMATO/ARCHIVO/DATOSADIC ON CMEMP.".          023000      
000704 01 A01-R00-HDR-DES .                                             000100      
000705     03 A00-R00-HDR-HD                 PIC X(02).                 000200      
000706     03 A00-R00-HDR-FCH                PIC 9(08).                 000300      
000707     03 FILLER                         PIC X(530).                000400      
000708 01 A01-R01-DATOS.                                                000500      
000709     03 A01-R01-AUTS151ORI             PIC 9(08) COMP.            000600      
000710     03 A01-R01-DATOS-1.                                          000610      
000711        05 A01-R01-REF-BANAMEX         PIC X(26).                 000620      
000712        05 A01-R01-CVECON-YREFLOC REDEFINES                       000640      
000713           A01-R01-REF-BANAMEX         PIC X(26).                 000700      
000714        05 A01-R01-CVECON-Y-REFV REDEFINES A01-R01-REF-BANAMEX.   000800      
000715           07 A01-R01-CONT-ORIG        PIC 9(20) COMP.            000900      
000716           07 A01-R01-REFLOC-BNM       PIC X(12).                 001000      
000717           07 A01-R01-REFLOC-23POS REDEFINES A01-R01-REFLOC-BNM.  001100      
000718              09 A01-R01-COMPREF       PIC 9(01) COMP.            001200      
000719              09 A01-R01-REF23POS      PIC 9(23) COMP.            001250      
000720           07 A01-R01-REFALFA REDEFINES A01-R01-REFLOC-BNM        001270      
000721                                       PIC X(12).                 001290      
000722           07 FILLER                   PIC X(04).                 001300      
000723        05 A01-R01-REFLOC7-BNM REDEFINES A01-R01-REF-BANAMEX.     001400      
000724           07 FILLER                   PIC X(02).                 001500      
000725           07 A01-R01-LOC07BNM         PIC X(24).                 001600      
000726        05 A01-R01-NOMINA-FUN1         PIC 9(14) COMP.            003600      
000727        05 A01-R01-NOMINA-FUN2         PIC 9(14) COMP.            003700      
000728        05 A01-R01-SDO-FIN.                                       003720      
000729           07 A01-R01-SDO-FIN-S500     PIC S9(15)V99 COMP.        003740      
000730           07 FILLER                   PIC X(05).                 003760      
000731        05 A01-R01-NOMINAS-MC REDEFINES A01-R01-SDO-FIN.          003780      
000732           07 A01-R01-NOM-MAKER        PIC 9(14) COMP.            003800      
000733           07 A01-R01-NOM-CHECKER      PIC 9(14) COMP.            003900      
000734        05 A01-R01-REF-CLIENTE         PIC X(16).                 004000      
000735        05 A01-R01-REFERENCIA1         PIC X(35).                 004100      
000736        05 A01-R01-REFERENCIA1-S500 REDEFINES A01-R01-REFERENCIA1.004110      
000737           07 A01-R01-ORIG-HRAMOV      PIC 9(06).                 004120      
000738           07 A01-R01-ORIG-FECMOV      PIC 9(06).                 004130      
000739           07 A01-R01-ORIG-FOLIO       PIC X(12).                 004140      
000740           07 A01-R01-ORIG-MDE         PIC 9(02).                 004150      
000741           07 A01-R01-ORIG-FILREF1     PIC X(09).                 004160      
000742        05 A01-R01-REF2-CTE            PIC X(35).                 004200      
000743        05 A01-R01-REF3-CTE            PIC X(35).                 004300      
000744        05 A01-R01-REF4-CTE            PIC X(35).                 004400      
000745        05 A01-R01-DATOS-2.                                       004450      
000746           07 A01-R01-LEY1             PIC X(40).                 004500      
000747           07 A01-R02-LEY2             PIC X(40).                 004600      
000748           07 A01-R02-LEY3             PIC X(40).                 004700      
000749           07 A01-R02-LEY4             PIC X(40).                 004800      
000750           07 A01-R02-LEY5             PIC X(40).                 004900      
000751           07 A01-R01-FILXAPL          PIC X(120).                004910      
000752           07 A01-R01-FILXAPL-S203 REDEFINES A01-R01-FILXAPL.     004912      
000753              09 A01-R01-CVE-IMPTO10   PIC 9(06).                 004914      
000754              09 A01-R01-FORMA-PAG10   PIC 9(03).                 004916      
000755              09 A01-R01-IMP-IMPTO10   PIC 9(12).                 004918      
000756              09 A01-R01-CVE-IMPTO11   PIC 9(06).                 004920      
000757              09 A01-R01-FORMA-PAG11   PIC 9(03).                 004922      
000758              09 A01-R01-IMP-IMPTO11   PIC 9(12).                 004924      
000759              09 A01-R01-CVE-IMPTO12   PIC 9(06).                 004926      
000760              09 A01-R01-FORMA-PAG12   PIC 9(03).                 004928      
000761              09 A01-R01-IMP-IMPTO12   PIC 9(12).                 004930      
000762              09 A01-R01-CVE-IMPTO13   PIC 9(06).                 004932      
000763              09 A01-R01-FORMA-PAG13   PIC 9(03).                 004934      
000764              09 A01-R01-IMP-IMPTO13   PIC 9(12).                 004936      
000765              09 A01-R01-CVE-IMPTO14   PIC 9(06).                 004938      
000766              09 A01-R01-FORMA-PAG14   PIC 9(03).                 004940      
000767              09 A01-R01-IMP-IMPTO14   PIC 9(12).                 004942      
000768              09 FILLER                PIC X(15).                 004944      
000769                                                                  004946      
000770*          07 A01-R01-FILXAPL-S711 REDEFINES A01-R01-FILXAPL.     004948      
000771*             09 A01-R01-TRUI-S711.                               004949      
000772*                11 A01-R01-CSIREC-S711 PIC 9(08) COMP.           004950      
000773*                11 A01-R01-CSIOR-S711  PIC 9(08) COMP.           004951      
000774*                11 A01-R01-NUMOP-S711  PIC 9(08) COMP.           004952      
000775*                11 A01-R01-NUMTR-S711  PIC 9(08) COMP.           004953      
000776*                11 A01-R01-INSMN-S711  PIC 9(02) COMP.           004954      
000777*             09 A01-R01-MICR-S711.                               004955      
000778*                11 A01-R01-CODSEG-S711 PIC 9(04) COMP.           004956      
000779*                11 A01-R01-VERPRE-S711 PIC 9(02) COMP.           004957      
000780*                11 A01-R01-CTRMON-S711 PIC 9(02) COMP.           004958      
000781*                11 A01-R01-PLCEC-S711  PIC 9(04) COMP.           004959      
000782*                11 A01-R01-BNCEM-S711  PIC 9(04) COMP.           004960      
000783*                11 A01-R01-DVEIN-S711  PIC 9(02) COMP.           004961      
000784*                11 A01-R01-CTACH-S711  PIC 9(12) COMP.           004962      
000785*                11 A01-R01-REFCH-S711  PIC 9(08) COMP.           004963      
000786*             09 A01-R01-CTABEN-S711    PIC 9(20) COMP.           004964      
000787*             09 A01-R01-BCREC-S711     PIC 9(04) COMP.           004965      
000788*             09 A01-R01-NOMBEN-S711    PIC X(40).                004966      
000789*             09 A01-R01-RFCBCO-S711    PIC X(13).                004967      
000790*             09 A01-R01-FILLER-S711    PIC X(19).                004968      
000791                                                                  004969      
000792           07 A01-R01-FILXAPL-S701 REDEFINES A01-R01-FILXAPL.     004970      
000793              09 A01-R01-NVAAUT-S701   PIC 9(08).                 004971      
000794              09 A01-R01-NVASUCTR-S701 PIC 9(04).                 004972      
000795              09 A01-R01-NVACAJTR-S701 PIC 9(02).                 004973      
000796              09 A01-R01-NVAFECT-S701  PIC 9(08).                 004974      
000797              09 A01-R01-NVOMDPA-S701  PIC 9(02).                 004975      
000798              09 A01-R01-NVALINC-S701  PIC X(30).                 004976      
000799              09 A01-R01-FILLER2-S701  PIC X(66).                 004977      
000800                                                                  004978      
000801           07 A01-R01-FILXAPL-S702 REDEFINES A01-R01-FILXAPL.     004979      
000802              09 A01-R01-STTRAN-S702   PIC 9(01).                 004980      
000803              09 A01-R01-CTEEMI-S702   PIC 9(12) COMP.            004981      
000804              09 A01-R01-CTADES-S702   PIC 9(20) COMP.            004982      
000805              09 A01-R01-IDEORI-S702   PIC 9(01).                 004983      
000806              09 A01-R01-IDEDES-S702   PIC 9(01).                 004984      
000807              09 A01-R01-TCTAEM-S702   PIC 9(02) COMP.            004985      
000808              09 A01-R01-TIARCH-S702   PIC X(01).                 004986      
000809              09 A01-R01-FECARC-S702   PIC 9(08) COMP.            004987      
000810              09 A01-R01-SECARC-S702   PIC 9(02) COMP.            004988      
000811              09 A01-R01-AUTORI-S702   PIC 9(20) COMP.            004989      
000812              09 A01-R01-NOMUSU-S702   PIC X(40).                 004990      
000813              09 A01-R01-TCTAUS-S702   PIC 9(02) COMP.            004991      
000814              09 A01-R01-SUCCON-S702   PIC 9(04) COMP.            004992      
000815              09 A01-R01-CAJCON-S702   PIC 9(04) COMP.            004993      
000816              09 A01-R01-FILLER-S702   PIC X(39).                 004994      
000817                                                                  004995      
000818           07 A01-R01-FILXAPL-S500 REDEFINES A01-R01-FILXAPL.     004996      
000819              09 A01-R01-NOMB-CTE          PIC  X(36).            004997      
000820              09 A01-R01-NOMB-BENEF        PIC  X(50).            004998      
000821              09 A01-R01-CVE-RASTREO-S500  PIC  X(30).            004999      
000822* INI VML                                                         005000      
000823              09 A01-R01-CVE-RASTREO-S500-R REDEFINES             005001      
000824                              A01-R01-CVE-RASTREO-S500.           005002      
000825                 11 A01-R01-TIP-CTA-TRASP  PIC 9(02).             005004      
000826                 11 A01-R01-BCO-CTA-TRASP  PIC 9(05).             005006      
000827                 11 A01-R01-NUM-CTA-TRASP  PIC 9(18).             005007      
000828                 11 A01-R01-FILLER-TRASP   PIC X(05).             005008      
000829* FIN VML                                                         005009      
000830              09 A01-R01-FECHA-PAGO        PIC  9(08)     COMP.   005010      
000831        05 A01-R01-DATOS-2-S264 REDEFINES A01-R01-DATOS-2.        005012      
000832           07 A01-R01-NOMINA-FUN3      PIC 9(14) COMP.            005014      
000833           07 A01-R01-COMISION         PIC 9(10)V99 COMP.         005016      
000834           07 A01-R01-SITUACION        PIC 9(10)V99 COMP.         005018      
000835           07 A01-R01-IVA-COMIS        PIC 9(08)V99 COMP.         005020      
000836           07 A01-R01-IVA-SITUACION    PIC 9(08)V99 COMP.         005022      
000837           07 A01-R01-IVA-FISCAL       PIC 9(12)V99 COMP.         005024      
000838           07 A01-R01-FOLIO-RECEP      PIC 9(10) COMP.            005026      
000839           07 A01-R01-OCUPACION        PIC X(40).                 005028      
000840           07 A01-R01-POBLACION        PIC X(40).                 005030      
000841           07 A01-R01-TIPO-CTA         PIC 9(02) COMP.            005032      
000842           07 A01-R01-NUM-CTE          PIC 9(12) COMP.            005034      
000843           07 A01-R01-NUM-CTA          PIC 9(20) COMP.            005036      
000844           07 A01-R01-CVE-TIPO-IDEN    PIC 9(02) COMP.            005038      
000845           07 A01-R01-NUM-IDEN-OFIC    PIC X(18).                 005040      
000846           07 A01-R01-FECHA-NAC-BEN    PIC 9(08) COMP.            005042      
000847           07 A01-R01-DOMICILIO        PIC X(55).                 005044      
000848           07 A01-R01-COLONIA          PIC X(30).                 005046      
000849           07 A01-R01-TELEFONO         PIC X(10).                 005048      
000850           07 A01-R01-COD-POS          PIC 9(06) COMP.            005050      
000851           07 A01-R01-REF-EMISOR       PIC X(20).                 005052      
000852           07 A01-R01-PIN              PIC 9(12) COMP.            005054      
000853           07 A01-R01-TIPO-CHQ-ORD     PIC 9(02) COMP.            005056      
000854           07 A01-R01-FECHA-EVENTO     PIC 9(08) COMP.            005058      
000855           07 A01-R01-CVE-RASTREO-S264 PIC X(30).                 005060      
000856     03 A01-R01-DATOS-1-R    REDEFINES A01-R01-DATOS-1.           005062      
000857        05 A01-R01-SUB-STA-DOC         PIC 9(02) COMP.            005064      
000858        05 A01-R01-SUC-DESTINO         PIC 9(04) COMP.            005066      
000859        05 A01-R01-TIPO-PREV           PIC X(01).                 005068      
000860        05 A01-R01-CAUSA-CAN-DEV       PIC 9(04) COMP.            005070      
000861        05 A01-R01-NVO-BCO-ORI         PIC 9(06) COMP.            005072      
000862        05 A01-R01-NVO-BCO-DES         PIC 9(06) COMP.            005074      
000863        05 A01-R01-NOM-BENEF-IDEN      PIC X(55).                 005076      
000864        05 A01-R01-NVO-NOM-BENEF       PIC X(55).                 005078      
000865        05 A01-R01-RFC-CURP-BENEF      PIC X(18).                 005080      
000866        05 A01-R01-GTOS-ORD-PAGO       PIC 9(16)V99 COMP.         005082      
000867        05 A01-R01-TIPO-PAGO-CECO      PIC 9(02) COMP.            005084      
000868        05 A01-R01-TIPO-PAGO-SPEI      PIC 9(02) COMP.            005086      
000869        05 A01-R01-TIPO-CONVENIO       PIC 9(02) COMP.            005088      
000870        05 A01-R01-PZA-EDO             PIC 9(06) COMP.            005090      
000871        05 A01-R01-TIPO-CTA-ABO        PIC 9(02) COMP.            005092      
000872        05 A01-R01-NUM-CTE-ABO         PIC 9(12) COMP.            005094      
000873        05 A01-R01-NUM-CTA-ABO         PIC 9(20) COMP.            005096      
000874        05 FILLER                      PIC X(358).                005098      
000875                                                                  005100      
000876     03 A01-R01-DATOS-2-S500 REDEFINES A01-R01-DATOS-1.           005102      
000877        05 A01-R01-TRUI.                                          005104      
000878           07 A01-R01-CSIID-RECEPTOR   PIC 9(08) COMP.            005106      
000879           07 A01-R01-CSIID-ORIGEN     PIC 9(08) COMP.            005108      
000880           07 A01-R01-NUM-OPERACION    PIC 9(08) COMP.            005110      
000881           07 A01-R01-NUM-TRANSACCI    PIC 9(08) COMP.            005112      
000882           07 A01-R01-INST-MONETARIO   PIC 9(02) COMP.            005114      
000883        05 A01-R01-MICR.                                          005116      
000884           07 A01-R01-COD-SEGURIDAD    PIC 9(04) COMP.            005118      
000885           07 A01-R01-VER-PREMARCADO   PIC 9(02) COMP.            005120      
000886           07 A01-R01-COD-TRANSMONE    PIC 9(02) COMP.            005122      
000887           07 A01-R01-PLAZA-CECOBAN    PIC 9(04) COMP.            005124      
000888           07 A01-R01-COD-BCOEMISOR    PIC 9(04) COMP.            005126      
000889           07 A01-R01-DIG-VINTERCAM    PIC 9(02) COMP.            005128      
000890           07 A01-R01-NUM-CTACHEQUE    PIC 9(12) COMP.            005130      
000891           07 A01-R01-NUM-REFCHEQUE    PIC 9(08) COMP.            005132      
000892        05 A01-R01-CTA-BENEFOTROBCO    PIC 9(20) COMP.            005134      
000893        05 A01-R01-BCO-RECEPOTROBCO    PIC 9(04) COMP.            005136      
000894        05 A01-R01-NOM-BENEFOTROBCO    PIC X(40).                 005138      
000895        05 A01-R01-RFC-OTROBCO         PIC X(13).                 005140      
000896        05 A01-R01-NOMPAN-S500         PIC X(05).                 005142      
000897        05 A01-R01-OPCPAN-S500         PIC X(01).                 005144      
000898        05 A01-R01-NUMCTO1-S500        PIC 9(16) COMP.            005146      
000899        05 A01-R01-NUMCTO2-S500        PIC 9(16) COMP.            005148      
000900        05 A01-R01-NUMCTO3-S500        PIC 9(16) COMP.            005150      
000901        05 A01-R01-INDIC-EST           PIC 9(08) COMP.            005152      
000902        05 A01-R01-IND-SUBC            PIC 9(01) COMP.            005154      
000903        05 A01-R01-PRO-SUBC            PIC 9(04) COMP.            005156      
000904        05 A01-R01-INST-SUBC           PIC 9(04) COMP.            005158      
000905        05 A01-R01-MON-SUBC            PIC 9(03) COMP.            005160      
000906        05 A01-R01-CONT-SUBC           PIC 9(16) COMP.            005162      
000907        05 A01-R01-CTAMDA-SUBC         PIC 9(16) COMP.            005164      
000908        05 A01-R01-STA-SUBC            PIC 9(04) COMP.            005166      
000909        05 A01-R01-INDALER-SUBC        PIC 9(04) COMP.            005168      
000910        05 A01-R01-INDCTACON-SUBC      PIC 9(02) COMP.            005170      
000911        05 A01-R01-LEYENDA-SUBC        PIC X(40).                 005171      
000912        05 A01-R01-VALOR-IND           PIC X(02).                 005172      
000913        05 A01-R01-NOMB-BENEF-AMPLI    PIC X(120).                005173      
000914        05 A01-R01-IND-EXTNET          PIC 9(01) COMP.            005174      
000915        05 A01-R01-FILLER              PIC 9(01) COMP.            005176      
000916        05 A01-R01-FILLER-DATOS2-S500  PIC X(205).                005178      
000917*        05 A01-R01-FILLER-DATOS2-S500  PIC X(328).               005180      
000918*        05 A01-R01-FILLER-DATOS2-S500  PIC X(395).               005182      
000919                                                                  005184      
000920     03 FILLER                         PIC X(01).                 005198      
000921     03 A01-R01-APUDES                 PIC 9(08) COMP.            005200      
000922     03 A01-R01-TIPREG                 PIC 9(02) COMP.            005300      
000923                                                                  005400      
000924******************************************************************005500      
000925*          VARIABLES DE LECTURA DATOS ADICIONALES "2"            *005600      
000926******************************************************************005700      
00092701 A01-R02-TESOFE.                                                005800      
000928    03 A01-R02-AUTS151ORI             PIC 9(08) COMP.             005900      
000929    03 A01-R02-DATOS-2-S500.                                      006000      
000930       05 A01-R02-TRUI.                                           006100      
000931          07 A01-R02-CSIID-RECEPTOR   PIC 9(08) COMP.             006200      
000932          07 A01-R02-CSIID-ORIGEN     PIC 9(08) COMP.             006300      
000933          07 A01-R02-NUM-OPERACION    PIC 9(08) COMP.             006400      
000934          07 A01-R02-NUM-TRANSACCI    PIC 9(08) COMP.             006500      
000935          07 A01-R02-INST-MONETARIO   PIC 9(02) COMP.             006600      
000936       05 A01-R02-MICR.                                           006700      
000937          07 A01-R02-COD-SEGURIDAD    PIC 9(04) COMP.             006800      
000938          07 A01-R02-VER-PREMARCADO   PIC 9(02) COMP.             006900      
000939          07 A01-R02-COD-TRANSMONE    PIC 9(02) COMP.             007000      
000940          07 A01-R02-PLAZA-CECOBAN    PIC 9(04) COMP.             007100      
000941          07 A01-R02-COD-BCOEMISOR    PIC 9(04) COMP.             007200      
000942          07 A01-R02-DIG-VINTERCAM    PIC 9(02) COMP.             007300      
000943          07 A01-R02-NUM-CTACHEQUE    PIC 9(12) COMP.             007400      
000944          07 A01-R02-NUM-REFCHEQUE    PIC 9(08) COMP.             007500      
000945       05 A01-R02-CTA-BENEFOTROBCO    PIC 9(20) COMP.             007600      
000946       05 A01-R02-BCO-RECEPOTROBCO    PIC 9(04) COMP.             007700      
000947       05 A01-R02-NOM-BENEFOTROBCO    PIC X(40).                  007800      
000948       05 A01-R02-RFC-OTROBCO         PIC X(13).                  007900      
000949       05 A01-R02-NOMPAN-S500         PIC X(05).                  008000      
000950       05 A01-R02-OPCPAN-S500         PIC X(01).                  008100      
000951       05 A01-R02-NUMCTO1-S500        PIC 9(16) COMP.             008200      
000952       05 A01-R02-NUMCTO2-S500        PIC 9(16) COMP.             008300      
000953       05 A01-R02-NUMCTO3-S500        PIC 9(16) COMP.             008400      
000954       05 A01-R02-INDIC-EST           PIC 9(08) COMP.             008500      
000955       05 A01-R02-IND-SUBC            PIC 9(01) COMP.             008600      
000956       05 A01-R02-PRO-SUBC            PIC 9(04) COMP.             008700      
000957       05 A01-R02-INST-SUBC           PIC 9(04) COMP.             008800      
000958       05 A01-R02-MON-SUBC            PIC 9(03) COMP.             008900      
000959       05 A01-R02-CONT-SUBC           PIC 9(16) COMP.             009000      
000960       05 A01-R02-CTAMDA-SUBC         PIC 9(16) COMP.             009100      
000961       05 A01-R02-STA-SUBC            PIC 9(04) COMP.             009200      
000962       05 A01-R02-INDALER-SUBC        PIC 9(04) COMP.             009300      
000963       05 A01-R02-INDCTACON-SUBC      PIC 9(02) COMP.             009400      
000964       05 A01-R02-LEYENDA-SUBC        PIC X(40).                  009500      
000965       05 A01-R02-VALOR-IND           PIC X(02).                  009520      
000966       05 A01-R02-NOMB-BENEF-AMPLI    PIC X(120).                 009540      
000967       05 A01-R02-IND-EXTNET          PIC 9(01) COMP.             009545      
000968       05 A01-R02-FILLER              PIC 9(01) COMP.             009550      
000969       05 A01-R02-FILLER-DATOS2-S500  PIC X(205).                 009560      
000970*       05 A01-R02-FILLER-DATOS2-S500  PIC X(327).                009600      
000971                                                                  009700      
000972    03 FILLER                         PIC X(01).                  009800      
000973    03 A01-R02-APUDES                 PIC 9(08) COMP.             009900      
000974    03 A01-R02-TIPREG                 PIC 9(02) COMP.             010000      
000975                                                                  010100      
000976*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000977                                                                  023200      
000978*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000979*  COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS/S500/CLIENTESCITIC     023400      
000980*-      " ON CMEMP.".                                             023600      
000981******************************************************************000100      
000982** FORMATO DE LOS ARCHIVOS DE EXTENDED NETWORK INTRADAY´S S500  **000200      
000983**        S151/FORMATO/ARCHIVO/MOVTOS/S500/CLIENTESCITIC        **000300      
000984**  NOMBRE ARCHIVOS :                                           **000400      
000985** (S151)S500/FILE/INTS/151xxS02/CSI/AAAAMMDD/000000145886/00ns **000500      
000986**                          ARCHIVO EN PESOS O MONEDA NACIONAL  **000600      
000987** (S151)S500/FILE/INTS/151xxS02/CSI/AAAAMMDD/000000145857/00ns **000700      
000988**                      ARCHIVO EN DOLARES O MONEDA EXTRANJERA  **000800      
000989** DESCRIPCION DEL ARCHIVO DE MOVTOS DEL S500-S151-S022-INTELAR **000900      
000990**             LONGITUD DEL REGISTRO 320 CARACTERES             **001000      
000991******************************************************************001100      
000992                                                                  001200      
000993******************************************************************001300      
000994*   REGISTRO DEL ARCHIVO DE INTERFACE PARA S500 CLIENTESCITIC    *001400      
000995******************************************************************001500      
000996                                                                  001600      
000997 01 500-R01-HDR-CLIENTESCITIC.                                    001700      
000998    03 500-R01-TIPREG         PIC 9(01)  VALUE 1.                 001800      
000999    03 500-R01-NODORI         PIC 9(02).                          001900      
001000    03 500-R01-FECPROC        PIC 9(06).                          002000      
001001    03 500-R01-SISCTE         PIC 9(12).                          002100      
001002    03 500-R01-SECARC         PIC 9(04).                          002200      
001003    03 500-R01-DESCTESIS      PIC X(36).                          002300      
001004    03 500-R01-FILLER         PIC X(609) VALUE SPACES.            002400      
001005                                                                  002500      
001006 01 500-R02-DET-CLIENTESCITIC WITH LOWER-BOUNDS.                  002600      
001007    03 500-R02-TIPREG         PIC 9(01)  VALUE 2.                 002700      
001008    03 500-R02-SECDET         PIC 9(08).                          002800      
001009    03 500-R02-NUMSUC         PIC 9(04).                          002900      
001010    03 500-R02-NUMCAJ         PIC 9(02).                          003000      
001011    03 500-R02-NUMAUT         PIC 9(08).                          003100      
001012    03 500-R02-CVETRA         PIC 9(04).                          003200      
001013    03 500-R02-TIPMOV         PIC 9(01).                          003300      
001014    03 500-R02-TIPMDA         PIC 9(02).                          003400      
001015    03 500-R02-MEDACC         PIC 9(16).                          003500      
001016    03 500-R02-MEDACC-RED     REDEFINES 500-R02-MEDACC.           003600      
001017       05 500-R02-PREFSUC     PIC 9(04).                          003700      
001018       05 500-R02-CTOCTA      PIC 9(12).                          003800      
001019    03 500-R02-IMPTRAN        PIC 9(14)V99.                       003900      
001020    03 500-R02-MONEDA         PIC 9(03).                          004000      
001021    03 500-R02-REFNUM         PIC 9(12).                          004100      
001022    03 500-R02-VALFIJO        PIC 9(01) VALUE 0.                  004200      
001023    03 500-R02-AGRUPB         PIC X(01) VALUE "B".                004300      
001024    03 500-R02-INDLEY         PIC 9(02).                          004400      
001025    03 500-R02-LEYENDA        PIC X(40).                          004500      
001026    03 500-R02-AGRUPL         PIC X(01) VALUE "l".                004600      
001027    03 500-R02-REFADIC1       PIC X(35).                          004700      
001028    03 500-R02-AGRUPM         PIC X(01) VALUE "m".                004800      
001029    03 500-R02-REFADIC2       PIC X(35).                          004900      
001030    03 500-R02-AGRUPN         PIC X(01) VALUE "n".                005000      
001031    03 500-R02-REFADIC3       PIC X(35).                          005100      
001032    03 500-R02-AGRUPO         PIC X(01) VALUE "o".                005200      
001033    03 500-R02-REFADIC4       PIC X(35).                          005300      
001034    03 500-R02-REDADIC4-R     REDEFINES 500-R02-REFADIC4.         005400      
001035       05 500-R02-TEXAUT      PIC X(02).                          005500      
001036       05 500-R02-NUMAUTORIZA PIC 9(08).                          005600      
001037       05 500-R02-FILREDAR1   PIC X(01).                          005700      
001038       05 500-R02-TEXSUCOPE   PIC X(02).                          005800      
001039       05 500-R02-NUMSUCOPE   PIC 9(04).                          005900      
001040       05 500-R02-NUMCAJOPE   PIC 9(02).                          006000      
001041       05 500-R02-FILREDAR2   PIC X(01).                          006100      
001042       05 500-R02-TEXSUCTRA   PIC X(02).                          006200      
001043       05 500-R02-NUMSUCTRA   PIC 9(04).                          006300      
001044       05 500-R02-NUMCAJTRA   PIC 9(02).                          006400      
001045       05 500-R02-FILREDAR3   PIC X(01).                          006500      
001046       05 500-R02-HORAMOV     PIC 9(06).                          006600      
001047    03 500-R02-DET-DEPOSITO   OCCURS 4 TIMES.                     006700      
001048       05 500-R02-AGRP500     PIC X(02).                          006800      
001049       05 500-R02-IMPTRANAGRP PIC 9(12)V99.                       006900      
001050    03 500-R02-FILLER         PIC X(341) VALUE SPACES.            007000      
001051                                                                  007002      
001052 01 500-R02-DET-CLIENTESCITICE WITH LOWER-BOUNDS.                 007004      
001053    03 500-R02-TIPREGE         PIC 9(01)  VALUE 2.                007006      
001054    03 500-R02-SECDETE         PIC 9(08).                         007008      
001055    03 500-R02-NUMSUCE         PIC 9(04).                         007010      
001056    03 500-R02-NUMCAJE         PIC 9(02).                         007012      
001057    03 500-R02-NUMAUTE         PIC 9(08).                         007014      
001058    03 500-R02-CVETRAE         PIC 9(04).                         007016      
001059    03 500-R02-TIPMOVE         PIC 9(01).                         007018      
001060    03 500-R02-TIPMDAE         PIC 9(02).                         007020      
001061    03 500-R02-MEDACCE         PIC 9(16).                         007022      
001062    03 500-R02-MEDACC-REDE     REDEFINES 500-R02-MEDACCE.         007024      
001063       05 500-R02-PREFSUCE     PIC 9(04).                         007026      
001064       05 500-R02-CTOCTAE      PIC 9(12).                         007028      
001065    03 500-R02-IMPTRANE        PIC 9(14)V99.                      007030      
001066    03 500-R02-MONEDAE         PIC 9(03).                         007032      
001067    03 500-R02-REFNUME         PIC 9(12).                         007034      
001068    03 500-R02-VALFIJOE        PIC 9(01) VALUE 0.                 007036      
001069    03 500-R02-IMPE            PIC 9(12)V99.                      007038      
001070    03 500-R02-FILLERE         PIC X(578) VALUE SPACES.           007040      
001071                                                                  007100      
001072 01 500-R03-TRA-CLIENTESCITIC.                                    007200      
001073    03 500-R03-TIPREG         PIC 9(01)  VALUE 9.                 007300      
001074    03 500-R03-NUMABO         PIC 9(08).                          007400      
001075    03 500-R03-TOTABO         PIC 9(16)V99.                       007500      
001076    03 500-R03-NUMCAR         PIC 9(08).                          007600      
001077    03 500-R03-TOTCAR         PIC 9(16)V99.                       007700      
001078    03 500-R03-NUMNCONT       PIC 9(08).                          007800      
001079    03 500-R03-FILLER         PIC X(609) VALUE SPACES.            007900      
001080*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001081                                                                  023800      
001082 01 WKS-TITLE-MOVS500.                                            024000      
001083    02 FILLER                     PIC X(17) VALUE                 024200      
001084                                  "S151/FILE/MOVS500".            024400      
001085    02 FILLER                     PIC X(01) VALUE "/".            024600      
001086    02 WKS-MOVS1-FECHA            PIC 9(06).                      024800      
001087    02 FILLER                     PIC X(04) VALUE " ON ".         025000      
001088    02 WKS-PACK-MOVS              PIC X(17).                      025200      
001089    02 FILLER                     PIC X(01) VALUE ".".            025400      
001090                                                                  025600      
001091 01 WKS-TITLE-DESS500.                                            025800      
001092    02 FILLER                     PIC X(17) VALUE                 026000      
001093                                  "S151/FILE/DESS500".            026200      
001094    02 FILLER                     PIC X(01) VALUE "/".            026400      
001095    02 WKS-DESS1-FECHA            PIC 9(06).                      026600      
001096    02 FILLER                     PIC X(04) VALUE " ON ".         026800      
001097    02 WKS-PACK-DESS              PIC X(17).                      027000      
001098    02 FILLER                     PIC X(01) VALUE ".".            027200      
001099                                                                  027400      
001100 01 WKS-CTLENV.                                                   027600      
001101    03 FILLER                     PIC X(27) VALUE                 027800      
001102                                  "(S151)S151/FILE/CTLENVP054/".  028000      
001103    03 WKS-FECHA-ENV              PIC 9(06).                      028200      
001104    03 FILLER                     PIC X(10) VALUE                 028400      
001105        " ON CMEMP.".                                             028600      
001106                                                                  028800      
001107  01 WKS-TIT-AUTORIZA.                                            029000      
001108    03 FILLER                     PIC X(29) VALUE                 029200      
001109                                  "(S151)S151/FILE/AUTORIZAP054/".029400      
001110    03 WKS-FECHA-AUT              PIC 9(06).                      029600      
001111    03 FILLER                     PIC X(10) VALUE                 029800      
001112        " ON CMEMP.".                                             030000      
001113                                                                  030200      
001114 01 WKS-TITLE-EXTNET-ARCHIVO.                                     030400      
001115    03 FILLER                     PIC X(24) VALUE                 030600      
001116                                  "S151/FILE/INTS/15121S01/".     030800      
001117    03 WKS-EXTNET-NODO            PIC 9(02).                      031000      
001118    03 FILLER                     PIC X VALUE "/".                031200      
001119    03 WKS-EXTNET-FECHA           PIC 9(08).                      031400      
001120    03 FILLER                     PIC X VALUE "/".                031600      
001121    03 WKS-EXTNET-ARCHIVO         PIC X(12).                      031800      
001122    03 FILLER                     PIC X VALUE "/".                032000      
001123    03 WKS-EXTNET-SECUENCIA       PIC 9(04).                      032200      
001124    03 FILLER                     PIC X(10) VALUE                 032400      
001125       " ON CMEMP.".                                              032600      
001126                                                                  032800      
001127 01 WKS-TITLE-EXTNET-ARCHIVO-D.                                   033000      
001128    03 FILLER                     PIC X(24) VALUE                 033200      
001129                                  "S151/FILE/INTS/15121S01/".     033400      
001130    03 WKS-EXTNET-NODO-D          PIC 9(02).                      033600      
001131    03 FILLER                     PIC X VALUE "/".                033800      
001132    03 WKS-EXTNET-FECHA-D         PIC 9(08).                      034000      
001133    03 FILLER                     PIC X VALUE "/".                034200      
001134    03 WKS-EXTNET-ARCHIVO-D       PIC X(12).                      034400      
001135    03 FILLER                     PIC X VALUE "/".                034600      
001136    03 WKS-EXTNET-SECUENCIA-D     PIC 9(04).                      034800      
001137    03 FILLER                     PIC X(10) VALUE                 035000      
001138       " ON CMEMP.".                                              035200      
001139                                                                  035400      
001140 77 W77-ERROR                     PIC 9(02).                      035600      
001141 77 W77-FIN                       PIC 9(02).                      035800      
001142 77 W77-NUMREG-MOV500             PIC 9(08).                      036000      
001143 77 W77-LLAVE                     PIC 9(08) VALUE ZERO.           036200      
001144 77 W77-MOV-NIVDES                PIC 9(08) VALUE ZERO.           036250      
001145 77 W77-MOV-MOVAUTS151            PIC 9(08) VALUE ZERO.           036300      
001146 77 W77-MOV-AD1AUTS151            PIC 9(08) VALUE ZERO.           036350      
001147 77 W77-MOV-AD2AUTS151            PIC 9(08) VALUE ZERO.           036400      
001148 77 W77-NUMREG-ACC                PIC 9(08).                      036450      
001149                                                                  036800      
001150 77 CONTADOR-LJ                   PIC 9(11) BINARY VALUE 0.       037000      
001151 01 MENSAJE-LJ.                                                   037200      
001152    02 SISTEMA-LJ                 PIC X(04).                      037400      
001153    02 FILLER                     PIC X VALUE "/".                037600      
001154    02 PASO-LJ                    PIC X(04).                      037800      
001155    02 FILLER                     PIC X VALUE "/".                038000      
001156    02 MTP-LJ                     PIC 9(03).                      038200      
001157    02 FILLER                     PIC X VALUE ":".                038400      
001158    02 TIPO-LJ                    PIC X.                          038600      
001159    02 FILLER                     PIC X VALUE ">".                038800      
001160    02 CODIGO-LJ                  PIC 9(06).                      039000      
001161    02 FILLER                     PIC X VALUE "<".                039200      
001162    02 TEXTO-LJ                   PIC X(250).                     039400      
001163                                                                  039600      
001164 77 W77-RESULT-B01                PIC 9(02).                      039800      
001165 01 WKS-FECPRO-S500               PIC 9(08).                      040000      
001166 01 WKS-FECHA-PROCESO REDEFINES WKS-FECPRO-S500.                  040200      
001167    03 WKS-FECPRO-CC              PIC 9(02).                      040400      
001168    03 WKS-FECPRO-6D              PIC 9(06).                      040600      
001169    03 WKS-FECPRO-6D-R REDEFINES WKS-FECPRO-6D.                   040800      
001170       05 WKS-FECPRO-AA           PIC 9(02).                      041000      
001171       05 WKS-FECPRO-MM           PIC 9(02).                      041200      
001172       05 WKS-FECPRO-DD           PIC 9(02).                      041400      
001173                                                                  041600      
001174 01 WKS-CTLVER-LIBID              PIC X(12).                      041800      
001175 01 WKS-CTLVERS-LIBID-R REDEFINES WKS-CTLVER-LIBID.               042000      
001176    03 WKS-LIBID-NOMB             PIC X(09).                      042200      
001177    03 WKS-LIBID-SIST             PIC X(03).                      042400      
001178 01 WKS-CTLVER-NOMLIB             PIC X(72).                      042600      
001179 01 W77-CTLVER-RESULT             PIC S9(11) BINARY.              042800      
001180                                                                  043000      
001181 01 WKS-DATOS-HOST.                                               043200      
001182    03 WKS-NUMCSI-HOST            PIC 9(02).                      043400      
001183    03 WKS-NOMEQUIPO              PIC X(10).                      043600      
001184    03 WKS-NOMCSI                 PIC X(26).                      043800      
001185    03 WKS-LINEA-BATCH            PIC X(05).                      044000      
001186                                                                  044200      
001187 01 WKS-FECHAS.                                                   044400      
001188    03 WKS-FECHA-MAQUINA          PIC X(10) TYPE IS NUMERIC-DATE. 044600      
001189    03 WKS-FECHA-MAQUINA-R REDEFINES WKS-FECHA-MAQUINA.           044800      
001190       05 WKS-FECMAQ-MM           PIC 9(02).                      045000      
001191       05 WKS-DIAGONAL1           PIC X(01).                      045200      
001192       05 WKS-FECMAQ-DD           PIC 9(02).                      045400      
001193       05 WKS-DIAGONAL2           PIC X(01).                      045600      
001194       05 WKS-FECMAQ-AAAA         PIC 9(04).                      045800      
001195       05 WKS-FECMAQ-AAAA-R REDEFINES WKS-FECMAQ-AAAA.            046000      
001196          07 WKS-FECMAQ-CC        PIC 9(02).                      046200      
001197          07 WKS-FECMAQ-AA        PIC 9(02).                      046400      
001198    03 WKS-FECHA-MAQ-8D.                                          046600      
001199       05 WKS-CC-MAQ              PIC 9(02).                      046800      
001200       05 WKS-FECHA-MAQ-6D.                                       047000      
001201          07 WKS-AA-MAQ           PIC 9(02).                      047200      
001202          07 WKS-MM-MAQ           PIC 9(02).                      047400      
001203          07 WKS-DD-MAQ           PIC 9(02).                      047600      
001204    03 WKS-FECHA-MAQ-ANT-8D.                                      047800      
001205       05 WKS-CC-MAQ-ANT          PIC 9(02).                      048000      
001206       05 WKS-FECHA-MAQ-ANT-6D.                                   048200      
001207          07 WKS-AA-MAQ-ANT       PIC 9(02).                      048400      
001208          07 WKS-MM-MAQ-ANT       PIC 9(02).                      048600      
001209          07 WKS-DD-MAQ-ANT       PIC 9(02).                      048800      
001210 01 WKS-HM-MAQ-4D.                                                049000      
001211    03 WKS-HM-HH                  PIC 9(02).                      049200      
001212    03 WKS-HM-MM                  PIC 9(02).                      049400      
001213                                                                  049600      
001214 01 WKS-HR-SIG-ENVIO-EXTNET       PIC 9(08) VALUE ZERO.           049800      
001215                                                                  050000      
001216 01 WKS-SEG-MAQUINA               PIC 9(08).                      050200      
001217 01 WKS-SEG-MAQUINA-ANT           PIC 9(08).                      050400      
001218 01 WKS-HR-MAQUINA                PIC 9(08) TYPE IS NUMERIC-TIME. 050600      
001219 01 WKS-HR-MAQUINA-R REDEFINES WKS-HR-MAQUINA.                    050800      
001220     03 WKS-HH-MAQUINA            PIC 9(02).                      051000      
001221     03 FILLER                    PIC X(01).                      051200      
001222     03 WKS-MM-MAQUINA            PIC 9(02).                      051400      
001223     03 FILLER                    PIC X(01).                      051600      
001224     03 WKS-SS-MAQUINA            PIC 9(02).                      051800      
001225                                                                  052000      
001226 01 WKS-TIT-TASKFILE.                                             052200      
001227    03 FILLER                     PIC X(30) VALUE                 052400      
001228       "FILE TASKFILE (USERBACKUPNAME=".                          052600      
001229    03 FILLER                     PIC X(30) VALUE                 052800      
001230       "TRUE,TITLE=S151/TASKFILE/P054/".                          053000      
001231    03 WKS-TSK-NODO               PIC 9(02).                      053200      
001232    03 WKS-TSK-SUBNODO            PIC 9(02) VALUE ZERO.           053400      
001233    03 FILLER                     PIC X(06) VALUE "/R000/".       053600      
001234    03 WKS-TSK-FECHA.                                             053800      
001235       05 WKS-TSK-AA              PIC 9(02).                      054000      
001236       05 WKS-TSK-MM              PIC 9(02).                      054200      
001237       05 WKS-TSK-DD              PIC 9(02).                      054400      
001238    03 FILLER                     PIC X(01) VALUE "/".            054600      
001239    03 WKS-TSK-MIX                PIC 9(07).                      054800      
001240    03 FILLER                     PIC X(01) VALUE "/".            055000      
001241    03 WKS-TSK-MNEMONICO          PIC X(14) VALUE                 055200      
001242                                  "001TASKFILE );".               055400      
001243 01 WKS-MSG-COMS                 PIC X(1926) WITH LOWER-BOUNDS.   055600      
001244 01 WKS-MSG-COMS-R               REDEFINES WKS-MSG-COMS.          055800      
001245    02 WKS-HEADER-COMS.                                           056000      
001246       03 WKS-HDR-COMS-PREFIJO   PIC X.                           056200      
001247       03 WKS-HDR-COMS-APL-DES   PIC X.                           056400      
001248       03 WKS-HDR-COMS-CCR-DES   PIC 9(02).                       056600      
001249       03 WKS-HDR-COMS-LST-ORG   PIC 9(04).                       056800      
001250       03 WKS-HDR-COMS-LST-ORG-R REDEFINES                        057000      
001251          WKS-HDR-COMS-LST-ORG   PIC 9(08) COMP.                  057200      
001252       03 WKS-HDR-COMS-STATION.                                   057400      
001253          04 WKS-HDR-COMS-TPO    PIC X(01).                       057600      
001254          04 WKS-HDR-COMS-SUC    PIC 9(04).                       057800      
001255          04 WKS-HDR-COMS-PRIV   PIC X(01).                       058000      
001256          04 WKS-HDR-COMS-CAJ    PIC 9(02).                       058200      
001257       03 WKS-HDR-COMS-CCR-ORG   PIC 9(02).                       058400      
001258       03 WKS-HDR-COMS-COP-ORG   PIC 9(02).                       058600      
001259       03 WKS-HDR-COMS-FAC       PIC 9(02).                       058800      
001260       03 WKS-HDR-COMS-APL-ORG   PIC X(01).                       059000      
001261       03 WKS-HDR-COMS-RES       PIC 9(02).                       059200      
001262       03 WKS-HDR-COMS-MASC      PIC X(05).                       059400      
001263       03 WKS-HDR-COMS-PWR       PIC X(06).                       059600      
001264    02 WKS-TEXTO-COMS-SA2        PIC X(1890).                     059800      
001265    02 WKS-TEXTO-COMS-R          REDEFINES WKS-TEXTO-COMS-SA2.    060000      
001266       03 WKS-TRANCODE-COMS      PIC 9(06).                       060200      
001267       03 WKS-TEXTO-COMS         PIC X(1884).                     060400      
001268                                                                  060600      
001269 01 WKS-FECHA1                    PIC 9(08).                      060800      
001270 01 WKS-FECHA1-R  REDEFINES WKS-FECHA1 PIC X(08).                 061000      
001271 01 WKS-FECHA1-RE  REDEFINES WKS-FECHA1.                          061200      
001272    03 WKS-FECHA1-CC              PIC 9(02).                      061400      
001273    03 WKS-FECHA1-6D              PIC 9(06).                      061600      
001274    03 WKS-FECHA1-6D-R  REDEFINES WKS-FECHA1-6D.                  061800      
001275       05 WKS-FECHA1-AA           PIC 9(02).                      062000      
001276       05 WKS-FECHA1-MM           PIC 9(02).                      062200      
001277       05 WKS-FECHA1-DD           PIC 9(02).                      062400      
001278                                                                  062600      
001279 01 WKS-FECHA2                    PIC 9(08).                      062800      
001280 01 WKS-FECHA2-R  REDEFINES WKS-FECHA2 PIC X(08).                 063000      
001281 77 W77-FORMATO                   PIC S9(11) BINARY.              063200      
001282 77 W77-FUNCION                   PIC S9(11) BINARY.              063400      
001283                                                                  063600      
001284 77 W77-HABIL                     PIC 9(02).                      063800      
001285    88 W88-HABIL                  VALUE 0.                        064000      
001286    88 W88-INHABIL                VALUE 1.                        064200      
001287                                                                  064400      
001288 01 WKS-L710-ENT.                                                 064600      
001289    03 WKS-EL710-CAT              PIC 9(06) COMP.                 064800      
001290    03 WKS-EL710-CLAVE            PIC 9(02) COMP.                 065000      
001291    03 WKS-EL710-BUSQUEDA         PIC 9(02) COMP.                 065200      
001292    03 WKS-EL710-REGISTROS        PIC 9(02) COMP.                 065400      
001293    03 WKS-EL710-LLAVE1           PIC 9(12).                      065600      
001294    03 WKS-EL710-LLAVE2           PIC 9(12).                      065800      
001295    03 WKS-EL710-LLAVE3           PIC 9(12).                      066000      
001296    03 WKS-EL710-LLAVE4           PIC 9(12).                      066200      
001297    03 WKS-EL710-LLAVE5           PIC 9(12).                      066400      
001298    03 WKS-EL710-LLAVE6           PIC 9(12).                      066600      
001299    03 WKS-EL710-FEC-VIG          PIC 9(06) COMP.                 066800      
001300    03 WKS-EL710-FECINI           PIC 9(06) COMP.                 067000      
001301    03 WKS-EL710-NIVINI           PIC 9(02) COMP.                 067200      
001302    03 FILLER                     PIC X(11).                      067400      
001303                                                                  067600      
001304 01 WKS-COMS-AG-SALIDA-NAME       PIC X(50).                      067800      
001305 77 W77-COMS-AG-SALIDA-DESG       REAL.                           068000      
001306 77 W77-COMS-RESULT               PIC S9(011) BINARY.             068200      
001307    88 W88-COMS-OK                VALUE     0.                    068400      
001308 01 WKS-COMS-DEFSTATION-NAME      PIC X(18).                      068600      
001309 77 W77-COMS-DEFSTATION-DESG      REAL.                           068800      
001310 01 WKS-NOAPLINCLUDE-PARAMETRO    PIC  X(30).                     069000      
001311 77 W77-NOAPLINCLUDE-DESG         REAL.                           069200      
001312 77 W77-NOAPL-RESULT              PIC S9(11) BINARY.              069400      
001313    88 W88-NOAPL-OK               VALUE 0.                        069600      
001314 77 W77-ACEPTA-MSG                PIC S9(11) BINARY.              069800      
001315    88 W88-ACEPTA-MSG             VALUE 1.                        070000      
001316 77 W77-ESPERACOMS-TIEMPO         PIC S9(11) BINARY VALUE 300.    070200      
001317 77 W77-ESPERACOMS-TIPO-EVENTO    PIC S9(11) BINARY.              070400      
001318    88 W88-POR-MSG                VALUE  1.                       070600      
001319    88 W88-POR-ACCEPT             VALUE  2.                       070800      
001320    88 W88-POR-HI                 VALUE  3.                       071000      
001321    88 W88-POR-TIMEOUT            VALUE  4.                       071200      
001322    88 W88-POR-EVENTO             VALUE  5.                       071400      
001323 01 WKS-TIPO-EVENTO               PIC 9(02).                      071600      
001324 77 W77-EVENTO                    USAGE IS EVENT.                 071800      
001325 01 WKS-SMCOMS-COMANDO.                                           072000      
001326    03 WKS-SMCOMS-STRING1         PIC X(20).                      072200      
001327    03 WKS-SMCOMS-STRING2         PIC X(20).                      072400      
001328 01 WKS-SMCOMS-TRABAJO            PIC X(132).                     072600      
001329 77 W77-SMCOMS-RESULT             PIC S9(11) BINARY.              072800      
001330    88 W88-SMCOMS-OK              VALUE 0.                        073000      
001331 77 W77-STATUS-KEY                PIC 9(04).                      073200      
001332 77 W77-LONGMSG                   PIC 9(04).                      073400      
001333                                                                  073600      
001334*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001335* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         073800      
001336*================================================================ 000100      
001337*         ENTRY-POINT CONSISDIA :                               = 000200      
001338*                                                                 000300      
001339* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
001340* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
001341* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
001342* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
001343* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
001344* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
001345* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
001346* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
001347* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
001348* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
001349*                                                               = 001400      
001350*================================================================ 001500      
001351                                                                  001600      
001352                                                                  001700      
001353*================================================================ 001800      
001354* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
001355*                                                               = 002000      
001356* ENTRADA REQUERIDA :                                           = 002100      
001357*                                                               = 002200      
001358*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
001359*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
001360*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
001361*================================================================ 002600      
001362 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
001363    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
001364    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
001365    03 WKS-B01-CSI                 PIC 9(02).                     003000      
001366    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
001367    03 WKS-B01-FECCON              PIC 9(08).                     003202      
001368    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
001369    03 WKS-B01-STAREG              PIC 9(02).                     003400      
001370    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
001371    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
001372    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
001373    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
001374    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
001375    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
001376    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
001377    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
001378    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
001379    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
001380    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
001381    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
001382    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
001383       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
001384       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
001385       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
001386       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
001387*==============================================================   005200      
001388*                                                             =   005300      
001389* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
001390*                                                             =   005500      
001391* CAMPOS REQUERIDOS :                                         =   005600      
001392*                                                             =   005700      
001393* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
001394* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
001395* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
001396* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
001397*==============================================================   006200      
001398 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
001399    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
001400    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
001401    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
001402    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
001403                                                                  006800      
001404*==============================================================   006900      
001405*                                                             =   007000      
001406* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
001407*                                                             =   007200      
001408* CAMPOS REQUERIDOS :                                         =   007300      
001409*                                                             =   007400      
001410* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
001411* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
001412* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
001413* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
001414*==============================================================   007900      
001415 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
001416    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
001417    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
001418    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
001419    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
001420                                                                  008500      
001421*==============================================================   008600      
001422*                                                             =   008700      
001423* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
001424*                                                             =   008900      
001425* CAMPOS REQUERIDOS :                                         =   009000      
001426*                                                             =   009100      
001427* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
001428* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
001429* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
001430* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
001431*==============================================================   009600      
001432 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
001433    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
001434    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
001435    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
001436    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
001437                                                                  010200      
001438*============================================================     010300      
001439* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
001440*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
001441*                                                           =     010600      
001442*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
001443*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
001444*                                                           =     010900      
001445*  ENTRADA REQUERIDA.                                       =     011000      
001446*                                                           =     011100      
001447*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
001448*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
001449*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
001450*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
001451*============================================================     011600      
001452                                                                  011700      
001453 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
001454     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
001455     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
001456     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
001457     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
001458                                                                  012300      
001459*=============================================================    012400      
001460*                                                            =    012500      
001461* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
001462*             B01-SIS-FECARMOV.                              =    012700      
001463*                                                            =    012800      
001464* ENTRADA REQUERIDAD :                                       =    012900      
001465*                                                            =    013000      
001466*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
001467*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
001468*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
001469*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
001470*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
001471*=============================================================    013600      
001472                                                                  013700      
001473 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
001474     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
001475     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
001476     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
001477     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
001478     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
001479*================================================================ 014400      
001480*                                                               = 014500      
001481* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
001482*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
001483*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
001484*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
001485*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
001486*                                                               = 015100      
001487* ENTRADA REQUERIDA :                                           = 015200      
001488*                                                               = 015300      
001489* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
001490* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
001491* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
001492* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
001493* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
001494*================================================================ 015900      
001495 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
001496    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
001497    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
001498    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
001499    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
001500    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
001501                                                                  016600      
001502*============================================================     016700      
001503*                                                           =     016800      
001504* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
001505*                                                           =     017000      
001506* DATOS REQUERIDOS :                                        =     017100      
001507*                                                           =     017200      
001508* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
001509* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
001510* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
001511* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
001512* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
001513*============================================================     017800      
001514                                                                  017900      
001515 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
001516     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
001517     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
001518     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
001519     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
001520     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
001521                                                                  018600      
001522*============================================================     018700      
001523*                                                           =     018800      
001524* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
001525*                                                           =     019000      
001526* DATOS REQUERIDOS :                                        =     019100      
001527*                                                           =     019200      
001528* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
001529* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
001530* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
001531* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
001532* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
001533*============================================================     019800      
001534                                                                  019900      
001535 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
001536     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
001537     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
001538     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
001539     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
001540     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
001541                                                                  020600      
001542*===============================================================  020700      
001543*                                                              =  020800      
001544* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
001545*              MOVIMIENTOS.                                    =  021000      
001546* DATOS REQUERIDOS :                                           =  021100      
001547*                                                              =  021200      
001548* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
001549* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
001550* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
001551* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
001552* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
001553* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
001554*==============================================================   021900      
001555                                                                  022000      
001556 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
001557     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
001558     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
001559     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
001560     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
001561     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
001562     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
001563*==============================================================   022800      
001564*                                                             =   022900      
001565* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
001566*                                                             =   023100      
001567* CAMPOS REQUERIDOS :                                         =   023200      
001568*                                                             =   023300      
001569* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
001570* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
001571* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
001572* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
001573*==============================================================   023800      
001574 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
001575    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
001576    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
001577    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
001578    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
001579                                                                  024304      
001580*=================================================================024306      
001581*                ENTRY POINT CONSISB01                           =024308      
001582*                                                                =024310      
001583*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
001584*                                                                =024314      
001585*  FUNCIONES DISPONIBLES :                                       =024316      
001586*                                                                =024318      
001587*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
001588*                                                                =024322      
001589*  PARAMETROS REQUERIDOS                                         =024324      
001590*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
001591*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
001592*=================================================================024330      
001593                                                                  024332      
001594 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
001595     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
001596     03 WKS-CON-CSI                PIC 9(02).                     024336      
001597     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
001598     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
001599        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
001600        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
001601        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
001602        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
001603        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
001604                                                                  024400      
001605*=================================================================024500      
001606*                ENTRY POINT B02ARCINTER                         =024600      
001607*                                                                =024700      
001608*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
001609*                                                                =024900      
001610*  FUNCIONES DISPONIBLES :                                       =025000      
001611*                                                                =025100      
001612*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
001613* 19.- ALTAS DE ARCHIVOS.                                        =025300      
001614* 22.- BAJAS DE ARCHIVOS.                                        =025400      
001615* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
001616*                                                                =025600      
001617*  PARAMETROS REQUERIDOS                                         =025700      
001618*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
001619*                                                                =025900      
001620*=================================================================026000      
001621 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
001622     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
001623     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
001624     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
001625     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
001626     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
001627     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
001628     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
001629     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
001630     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
001631     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
001632     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
001633     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
001634     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
001635     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
001636     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
001637     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
001638     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
001639     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
001640     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
001641     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
001642     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
001643     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
001644     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
001645     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
001646     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
001647     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
001648     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
001649     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
001650                                                                  029000      
001651*=================================================================029100      
001652*                ENTRY POINT B04SISTEMA                          =029200      
001653*                                                                =029300      
001654*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
001655*                                                                =029500      
001656*  FUNCIONES DISPONIBLES :                                       =029600      
001657*                                                                =029700      
001658*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
001659*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
001660*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
001661*                                                                =030100      
001662*  PARAMETROS REQUERIDOS                                         =030200      
001663*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
001664*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
001665*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
001666*                                                                =030600      
001667*=================================================================030700      
001668 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
001669     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
001670     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
001671     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
001672     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
001673     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
001674     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
001675     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
001676                                                                  031600      
001677*================================================================ 031700      
001678*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
001679*                                                               = 031900      
001680*  FUNCION                                                      = 032000      
001681*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
001682*   19       ALTAS.                                             = 032200      
001683*   22       BAJAS                                              = 032300      
001684*   37       CAMBIOS.                                           = 032400      
001685*                                                               = 032500      
001686*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
001687*                      FECHA DE PROCESO                         = 032700      
001688*                      NUMERO DE PROCESO                        = 032800      
001689*                      FECHA INICIO                             = 032900      
001690*                      REGISTRO INICIAL                         = 033000      
001691*================================================================ 033100      
001692                                                                  033200      
001693 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
001694     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
001695     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
001696     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
001697     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
001698     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
001699     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
001700     03 WKS-B05-MIX                PIC 9(08).                     034000      
001701     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
001702     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
001703     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
001704     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
001705     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
001706     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
001707                                                                  034700      
001708                                                                  034800      
001709*================================================================ 034900      
001710*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
001711*                                                               = 035100      
001712*  FUNCION                                                      = 035200      
001713*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
001714*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
001715*                                                               = 035500      
001716*================================================================ 035600      
001717                                                                  035700      
001718 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
001719     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
001720     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
001721     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
001722     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
001723     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
001724     03 WKS-B09-NOMREN             PIC X(15).                     036400      
001725                                                                  036500      
001726*===============================================================  036600      
001727*                                                              =  036700      
001728*         ENTRY-POINT CONSISMEN                                =  036800      
001729*                                                              =  036900      
001730*   DATOS REQUERIDOS : FUNCION                                 =  037000      
001731*                      SISTEMA                                 =  037100      
001732*                                                              =  037200      
001733*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
001734*                                                              =  037400      
001735*===============================================================  037500      
001736 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
001737     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
001738     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
001739     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
001740     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
001741     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
001742     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
001743     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
001744     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
001745     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
001746     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
001747     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
001748     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
001749     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
001750     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
001751     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
001752        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
001753        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
001754        05 WKS-B03-AAMM            PIC 9(06).                     039402      
001755        05 WKS-B03-SECOK           PIC 9(10).                     039500      
001756        05 WKS-B03-SECINF          PIC 9(10).                     039600      
001757        05 WKS-B03-SECERR          PIC 9(10).                     039700      
001758        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
001759                                                                  039900      
001760*=====================================================            040000      
001761*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
001762*=====================================================            040200      
001763 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
001764     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
001765     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
001766     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
001767                                                                  040700      
001768*=====================================================            040800      
001769*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
001770*=====================================================            041000      
001771 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
001772     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
001773     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
001774     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
001775                                                                  041500      
001776*=====================================================            041600      
001777*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
001778*=====================================================            041800      
001779 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
001780     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
001781     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
001782     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
001783*=====================================================            042300      
001784*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
001785*=====================================================            042500      
001786 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
001787     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
001788     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
001789     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
001790                                                                  043000      
001791*=====================================================            043100      
001792*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
001793*=====================================================            043300      
001794 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
001795     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
001796     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
001797     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
001798                                                                  043800      
001799*=====================================================            043900      
001800*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
001801*=====================================================            044100      
001802 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
001803     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
001804     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
001805     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
001806                                                                  044600      
001807*=====================================================            044700      
001808*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
001809*=====================================================            044900      
001810 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
001811     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
001812     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
001813     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
001814                                                                  045400      
001815*=====================================================            045500      
001816*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
001817*=====================================================            045700      
001818 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
001819     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
001820     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
001821     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
001822                                                                  046200      
001823*=====================================================            046300      
001824*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
001825*=====================================================            046500      
001826 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
001827     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
001828     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
001829     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
001830                                                                  047000      
001831*=====================================================            047100      
001832*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
001833*=====================================================            047300      
001834 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
001835     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
001836     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
001837     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001838                                                                  047800      
001839*=====================================================            047900      
001840*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001841*=====================================================            048100      
001842 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001843     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001844     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001845     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001846                                                                  048600      
001847*=====================================================            048700      
001848*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001849*=====================================================            048900      
001850 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001851     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001852     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001853     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001854                                                                  049400      
001855*=====================================================            049500      
001856*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001857*=====================================================            049700      
001858 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001859     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001860     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001861     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001862     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001863     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001864     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001865     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001866     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001867     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001868     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001869                                                                  050900      
001870*=====================================================            051000      
001871*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001872*=====================================================            051200      
001873 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001874     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001875     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001876     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001877     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001878                                                                  051800      
001879*=====================================================            051900      
001880*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001881*=====================================================            052100      
001882 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001883     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001884     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001885     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001886     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001887                                                                  052700      
001888*=====================================================            052800      
001889*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001890*=====================================================            053000      
001891 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001892     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001893     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001894     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001895     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001896                                                                  053600      
001897*=====================================================            053700      
001898*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001899*=====================================================            053900      
001900 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001901     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001902     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001903     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001904     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001905                                                                  054500      
001906*=====================================================            054600      
001907*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001908*=====================================================            054800      
001909 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001910     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001911     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001912     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001913     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001914                                                                  055400      
001915*=====================================================            055500      
001916*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001917*=====================================================            055700      
001918 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001919     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001920     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001921     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001922     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001923                                                                  056300      
001924*=====================================================            056400      
001925*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001926*=====================================================            056600      
001927 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001928     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001929     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001930     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001931     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001932                                                                  057200      
001933 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001934*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001935                                                                  074000      
001936 LINKAGE SECTION.                                                 074200      
001937 01 WKS-COMS-MY-PROGRAM-NAME      PIC X(0018).                    074400      
001938 77 W77-COMS-MY-PROGRAM-DESG      REAL.                           074600      
001939                                                                  074800      
001940 77 W77-L710-RESULT               PIC S9(11) BINARY.              075000      
001941 77 W77-RESULT-COMS               PIC 9(06).                      075200      
001942 01 WKS-NUM-CVETRANS              PIC 9(06).                      075400      
001943 77 W77-EOF                       PIC 9(02).                      075600      
001944 77 W77-EOF-ENVIO                 PIC 9(02).                      075800      
001945 01 WKS-NUM-OCCURS                PIC 9(02).                      076000      
001946 01 CVETRAN-EXTNET.                                               076200      
001947    05 WKS-CVETRAN-EXTNET   OCCURS 10000 TIMES.                   076400      
001948       10 WKS-CAT6-CVETRAN        PIC 9(06) COMP.                 076600      
001949       10 WKS-CAT6-AFC            PIC 9(02) COMP.                 076800      
001950                                                                  077000      
001951 77  W77-L710-SISTEMA             PIC S9(11) BINARY.              077200      
001952 77  W77-L710-PROGRAMA            PIC S9(11) BINARY.              077400      
001953                                                                  077600      
001954 01  WKS-L710-SAL.                                                077800      
001955     03 WKS-SL710-NUMREG          PIC 9(02) COMP.                 078000      
001956     03 WKS-SL710-CAT             PIC 9(06) COMP.                 078200      
001957     03 WKS-SL710-FECINI          PIC 9(06) COMP.                 078400      
001958     03 WKS-SL710-NIVINI          PIC 9(02) COMP.                 078600      
001959     03 FILLER                    PIC X(22).                      078800      
001960     03 WKS-SL710-REG OCCURS 10 TIMES.                            079000      
001961        05 WKS-SL710-DAT          PIC 9(12) OCCURS 28 TIMES.      079200      
001962        05 WKS-SL710-FECALTA      PIC 9(06) COMP.                 079400      
001963        05 WKS-SL710-FECBAJA      PIC 9(06) COMP.                 079600      
001964        05 WKS-SL710-FECMOD       PIC 9(06) COMP.                 079800      
001965        05 WKS-SL710-FECVIG       PIC 9(06) COMP.                 080000      
001966        05 FILLER                 PIC X(42).                      080200      
001967                                                                  080400      
001968 77 W77-ERR-CAT                   PIC 9(02).                      080600      
001969 77 W77-HI                        PIC 9(08) VALUE 0.              080800      
001970    88 W88-HI-0                   VALUE 0.                        081000      
001971    88 W88-HI-1                   VALUE 1.                        081200      
001972    88 W88-HI-2                   VALUE 2.                        081400      
001973    88 W88-HI-3                   VALUE 3.                        081600      
001974    88 W88-HI-4                   VALUE 4.                        081800      
001975    88 W88-HI-5                   VALUE 5.                        082000      
001976    88 W88-HI-6                   VALUE 6.                        082200      
001977    88 W88-HI-10                  VALUE 10.                       082400      
001978    88 W88-HI-1822                VALUE 1822.                     082600      
001979    88 W88-HI-1823                VALUE 1823.                     082800      
001980                                                                  083000      
001981 01 WKS-VALOR-HI                  PIC 9(08).                      083200      
001982 01 WKS-VALOR-HI-R     REDEFINES WKS-VALOR-HI.                    083400      
001983    03 WKS-NUM-HI                 PIC 9(04).                      083600      
001984    03 WKS-TIEMPO-HI              PIC 9(04).                      083800      
001985    03 WKS-TIEMPO-HI-R REDEFINES WKS-TIEMPO-HI.                   084000      
001986       05 WKS-HH-HI               PIC 9(02).                      084200      
001987       05 WKS-MM-HI               PIC 9(02).                      084400      
001988 01 WKS-VALOR-HI-99    REDEFINES WKS-VALOR-HI.                    084600      
001989    03 WKS-NUM-HI99-FILL          PIC 9(04).                      084800      
001990    03 WKS-NUM-HI-99              PIC 9(02).                      085000      
001991    03 WKS-NUM-HI99-PROC          PIC 9(02).                      085200      
001992                                                                  085400      
001993 77 W77-MONITOR                   PIC 9(01).                      085600      
001994    88 W88-MONITOR                VALUE 1.                        085800      
001995 77 W77-FIN-ARCH                  PIC 9(02).                      086000      
001996 77 W77-MSG-OK                   PIC 9(02).                       086200      
001997    88 W88-MSG-OK                   VALUE 1.                      086400      
001998                                                                  086600      
001999 01 WKS-BASURA                    PIC X(10).                      086800      
002000 01 MY-ID                         PIC X(10) VALUE "S151/P054>".   087000      
002001                                                                  087200      
002002 77 W77-ENVIO-EXTNET              PIC 9(02).                      087400      
002003     88 W88-ENVIO-EXTNET          VALUE 1.                        087600      
002004 01 WKS-INTERVALO-ENV-EXTNET      PIC 9(04) VALUE 60.             087800      
002005                                                                  088000      
002006 77 W77-AUT-ENVIO500              PIC 9(08).                      088200      
002007 77 W77-SEC-ARCH                  PIC 9(04).                      088400      
002008 77 W77-SEC-DET                   PIC 9(08).                      088600      
002009 77 W77-SEC-DET-DOL               PIC 9(08).                      088800      
002010                                                                  088850      
002011 01 WKS-ARCH-GEN                  PIC 9 VALUE 0.                  088900      
002012                                                                  089000      
002013*========================================================         089200      
002014* VARIABLES PARA ENVIO POR INTELAR                                089400      
002015*========================================================         089600      
002016 01 WKS-INTE-ARCHIVO              PIC X(120).                     089800      
002017 77 W77-INTE-SNT                  PIC S9(11) BINARY.              090000      
002018                                                                  090200      
002019 77 W77-IND                       PIC 9(06).                      090400      
002020 77 W77-IND-ENV                   PIC 9(06).                      090600      
002021                                                                  090800      
002022 01 WKS-IND-EXTNET                PIC 9(01).                      091000      
002023 01 WKS-NULO-NUM                  PIC 9(02) COMP VALUE @00@.      091200      
002024 01 WKS-NULO                      REDEFINES                       091400      
002025    WKS-NULO-NUM                  PIC X(01).                      091600      
002026                                                                  091800      
002027*========================================================         092000      
002028* VARIABLES EXTNET TRAILER                                        092200      
002029*========================================================         092400      
002030 01 WKS-NUM-ABON-PES              PIC 9(08).                      092600      
002031 01 WKS-NUM-TOTAL-ABON-PES        PIC 9(16)V99.                   092800      
002032 01 WKS-NUM-CARG-PES              PIC 9(08).                      093000      
002033 01 WKS-NUM-TOTAL-CARG-PES        PIC 9(16)V99.                   093200      
002034 01 WKS-NUM-NO-CONT-PES           PIC 9(08).                      093400      
002035                                                                  093600      
002036 01 WKS-NUM-ABON-DOL              PIC 9(08).                      093800      
002037 01 WKS-NUM-TOTAL-ABON-DOL        PIC 9(16)V99.                   094000      
002038 01 WKS-NUM-CARG-DOL              PIC 9(08).                      094200      
002039 01 WKS-NUM-TOTAL-CARG-DOL        PIC 9(16)V99.                   094400      
002040 01 WKS-NUM-NO-CONT-DOL           PIC 9(08).                      094600      
002041                                                                  094800      
002042 77 W77-AFC                       PIC 9(04) VALUE 0.              095000      
002043                                                                  095200      
002044*========================================================         095400      
002045* VARIABLES CORTE DE HORARIO CAT1822                              095600      
002046*========================================================         095800      
002047 77 W77-CORTE                     PIC 9(04).                      096000      
002048 01 WKS-TABLA-CORTES.                                             096200      
002049    05 WKS-TAB-CORTES      OCCURS 1000 TIMES.                     096400      
002050       10 WKS-HORA-CORTE          PIC 9(04).                      096600      
002051       10 WKS-CORTE-GENERADO      PIC 9(04).                      096800      
002052                                                                  097000      
002053*========================================================         097200      
002054* VARIABLES CLAVES TRANSACCIÓN CAT1823                            097400      
002055*========================================================         097600      
002056  01 CVETRAN-CAT1823.                                             097800      
002057    05 WKS-CVETRAN-EXTNET-1   OCCURS 5000 TIMES.                  098000      
002058       10 WKS-CAT1823-CVOR        PIC 9(04) COMP.                 098200      
002059       10 WKS-CAT1823-ENVIOCA     PIC 9(02) COMP.                 098400      
002060       10 WKS-CAT1823-CLVTRAN     PIC 9(02) COMP.                 098600      
002061       10 WKS-CAT1823-CLVTRAA     PIC 9(04) COMP.                 098800      
002062       10 WKS-CAT1823-CLVTRAC     PIC 9(04) COMP.                 099000      
002063       10 WKS-CAT1823-AGRP500     PIC X(02).                      099100      
002064 77 W77-ENVIO-CAMELIA             PIC 9(02).                      099200      
002065 77 W77-CVE-TRANSFORMA            PIC 9(02).                      099400      
002066 77 W77-CVE-ABONO                 PIC 9(04).                      099600      
002067 77 W77-CVE-CARGO                 PIC 9(04).                      099800      
002068 77 W77-CMP-AGRP500               PIC X(02).                      099900      
002069 77 W77-LEE                       PIC 9(01).                      100000      
002070 77 W77-VECES                     PIC 9(01).                      100100      
002071 77 W77-LIMITE                    PIC 9(01).                      100200      
002072 77 W77-EXISTE-ELI-EXT            PIC 9(01) VALUE 0.              100300      
002073    88 W88-EXISTE-MOV-EXT         VALUE 1.                        100400      
002074 77 WKS-AUTORIZA-151-KEY          PIC 9(08).                      100600      
002075                                                                  100800      
002076*========================================================         101000      
002077* VARIABLES ARCHIVO AUTORIZACIÓN                                  101200      
002078*========================================================         101400      
002079 01 WKS-REG-AUTS500EXT         PIC 9(08).                         101600      
002080 01 WKS-REG-AUTAELIM           PIC 9(08).                         101800      
002081 01 WKS-REG-AUTANTS151         PIC 9(08).                         102000      
002082 01 WKS-REG-TIP-PROC           PIC 9(02).                         102200      
002083 01 WKS-REG-DATOS-TR.                                             102400      
002084    02 WKS-REG-TRANSACCIONES OCCURS 5 TIMES.                      102600      
002085       03 WKS-REG-CVETRAN            PIC 9(04).                   102800      
002086       03 WKS-REG-500INDLEY          PIC 9(02).                   103000      
002087       03 WKS-REG-IMPORTE            PIC 9(16)V99.                103200      
002088 01 WKS-REG-500TIPMDA          PIC 9(02).                         103400      
002089 01 WKS-REG-500MEDACC          PIC 9(16).                         103600      
002090 01 WKS-REG-500MEDACC-R REDEFINES WKS-REG-500MEDACC.              103800      
002091    02 WKS-REG-500PREFSUC      PIC 9(04).                         104000      
002092    02 WKS-REG-500CTOCTA       PIC 9(12).                         104200      
002093 01 WKS-REG-500MONEDA          PIC 9(04).                         104400      
002094 01 WKS-REG-500REFNUM          PIC 9(12).                         104600      
002095 01 WKS-REG-500LEYENDA-1       PIC X(40).                         104800      
002096 01 WKS-REG-500LEYENDA-2       PIC X(40).                         105000      
002097 01 WKS-REG-500LEYENDA-3       PIC X(40).                         105200      
002098 01 WKS-REG-500LEYENDA-4       PIC X(40).                         105400      
002099 01 WKS-REG-500LEYENDA-5       PIC X(40).                         105600      
002100 01 WKS-REG-500REFADIC1        PIC X(35).                         105800      
002101 01 WKS-REG-500REFADIC2        PIC X(35).                         106000      
002102 01 WKS-REG-500REFADIC3        PIC X(35).                         106200      
002103 01 WKS-REG-500NUMAUTORIZA     PIC 9(08).                         106400      
002104 01 WKS-REG-500NUMSUCOPE       PIC 9(04).                         106600      
002105 01 WKS-REG-500NUMCAJOPE       PIC 9(02).                         106800      
002106 01 WKS-REG-500NUMSUCTRA       PIC 9(04).                         107000      
002107 01 WKS-REG-500NUMCAJTRA       PIC 9(02).                         107200      
002108 01 WKS-REG-HORAMOV            PIC 9(06).                         107400      
002109 01 WKS-REG-STATUS             PIC 9(02).                         107600      
002110* W77-AUTS151                   PIC 9(08).                        107800      
002111 77 W77-RUTA-EXTNET            PIC 9(02).                         107820      
002112 77 W77-IND-ARCH               PIC 9(06).                         107830      
002113 77 W77-STATUS-FILE            PIC 9(01).                         107835      
002114 77 W77-RUTA-EXTNET-D          PIC 9(02).                         107836      
002115 77 W77-IND-ARCH-D             PIC 9(06).                         107837      
002116 77 W77-STATUS-FILE-D          PIC 9(01).                         107838      
002117*========================================================         107840      
002118* VARIABLES DEPOSITOS MIXTOS                                      107860      
002119*========================================================         107880      
002120 01 WKS-IMPTRANAGRP            PIC 9(12)V99.                      107900      
002121 01 WKS-IND-AGRP               PIC 9.                             107942      
002122 01 WKS-CLVTRAN                PIC 9(06).                         107950      
002123                                                                  107960      
002124                                                                  108000      
002125  COMMUNICATION SECTION.                                          108200      
002126  INPUT  HEADER COMS-IN;                                          108400      
002127         PROGRAMDESG            IS CS-COMS-IN-PROGRAM;            108600      
002128         FUNCTIONSTATUS         IS CS-COMS-IN-FUNCTION-STATUS;    108800      
002129         FUNCTIONINDEX          IS CS-COMS-IN-FUNCTION-INDEX;     109000      
002130         USERCODE               IS CS-COMS-IN-USERCODE;           109200      
002131         SECURITYDESG           IS CS-COMS-IN-SECURITY-DESG;      109400      
002132         TRANSPARENT            IS CS-COMS-IN-TRANSPARENT;        109600      
002133         VTFLAG                 IS CS-COMS-IN-VT-FLAG;            109800      
002134         TIMESTAMP              IS CS-COMS-IN-TIMESTAMP;          110000      
002135         STATION                IS CS-COMS-IN-STATION;            110200      
002136         TEXTLENGTH             IS CS-COMS-IN-TEXT-LENGTH;        110400      
002137         STATUSVALUE            IS CS-COMS-IN-STATUS-KEY;         110600      
002138         MESSAGECOUNT           IS CS-COMS-IN-MSG-COUNT;          110800      
002139         RESTART                IS CS-COMS-IN-RST-LOC;            111000      
002140         AGENDA                 IS CS-COMS-IN-AGENDA.             111200      
002141  OUTPUT HEADER COMS-OUT;                                         111400      
002142         DESTCOUNT              IS CS-COMS-OUT-COUNT;             111600      
002143         TEXTLENGTH             IS CS-COMS-OUT-TEXT-LENGTH;       111800      
002144         STATUSVALUE            IS CS-COMS-OUT-STATUS-KEY;        112000      
002145         TRANSPARENT            IS CS-COMS-OUT-TRANSPARENT;       112200      
002146         VTFLAG                 IS CS-COMS-OUT-VT-FLAG;           112400      
002147         CONFIRMFLAG            IS CS-COMS-OUT-CONFIRM-FLAG;      112600      
002148         CONFIRMKEY             IS CS-COMS-OUT-CONFIRM-KEY;       112800      
002149         DESTINATIONDESG        IS CS-COMS-OUT-DESTINATION;       113000      
002150         NEXTINPUTAGENDA        IS CS-COMS-OUT-NEXT-INPUT-AGENDA; 113200      
002151         SETNEXTINPUTAGENDA     IS CS-COMS-OUT-SNEXT-INPUT-AGENDA;113400      
002152         RETAINTRANSACTIONMODE  IS CS-COMS-OUT-SAVE-TRANS-MODE;   113600      
002153         AGENDA                 IS CS-COMS-OUT-AGENDA.            113800      
002154                                                                  114000      
002155 PROCEDURE DIVISION.                                              114200      
002156 DECLARATIVES.                                                    114400      
002157 INTERRUPT-BY-HI SECTION.                                         114600      
002158     USE AS INTERRUPT PROCEDURE.                                  114800      
002159 000A-BEGIN-INTERRUPT.                                            115000      
002160    DISALLOW INTERRUPT.                                           115200      
002161    MOVE "I"                           TO TIPO-LJ.                115400      
002162    MOVE 050104                        TO CODIGO-LJ               115600      
002163    MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-HI.                 115800      
002164* INI VML                                                         116000      
002165    MOVE W77-HI                        TO WKS-VALOR-HI.           116200      
002166    IF WKS-NUM-HI > 0                                             116400      
002167       IF WKS-NUM-HI = 99                                         116600      
002168          NEXT SENTENCE                                           116800      
002169       ELSE                                                       117000      
002170          MOVE WKS-NUM-HI              TO W77-HI.                 117200      
002171    IF WKS-NUM-HI-99 = 99                                         117400      
002172       MOVE WKS-NUM-HI-99              TO W77-HI.                 117600      
002173                                                                  117800      
002174    IF W88-HI-0                                                   118000      
002175       NEXT SENTENCE                                              118200      
002176    ELSE                                                          118400      
002177    IF W88-HI-2                                                   118600      
002178       MOVE SPACES                     TO TEXTO-LJ                118800      
002179       MOVE "PRENDE MONITOR"           TO TEXTO-LJ                119000      
002180       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        119200      
002181       MOVE 1 TO W77-MONITOR                                      119400      
002182    ELSE                                                          119600      
002183    IF W88-HI-3                                                   119800      
002184       MOVE SPACES                     TO TEXTO-LJ                120000      
002185       MOVE "APAGA MONITOR"            TO TEXTO-LJ                120200      
002186       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        120400      
002187       MOVE 0 TO W77-MONITOR                                      120600      
002188    ELSE                                                          120800      
002189    IF W88-HI-4 OR W88-HI-5                                       121000      
002190          MOVE SPACES                     TO TEXTO-LJ             121200      
002191          PERFORM 800000-HI-SALIDA                                121400      
002192          PERFORM 999999-FIN.                                     121600      
002193                                                                  121800      
002194    CHANGE ATTRIBUTE TASKVALUE OF MYSELF TO 0.                    122000      
002195                                                                  122200      
002196     ALLOW INTERRUPT.                                             122400      
002197 0000A-END.                                                       122600      
002198 END DECLARATIVES.                                                122800      
002199 010000-INICIO-PGMA SECTION.                                      123000      
002200 010100-INICIA-CONTROL.                                           123200      
002201    MOVE "S151"                        TO SISTEMA-LJ.             123400      
002202    MOVE "P054"                        TO PASO-LJ.                123600      
002203    MOVE 13                            TO MTP-LJ.                 123800      
002204    MOVE "I"                           TO TIPO-LJ.                124000      
002205    MOVE 050104                        TO CODIGO-LJ.              124200      
002206    PERFORM 020000-INICIO.                                        124400      
002207    PERFORM 030301-STATUS-FILE.                                   124600      
002208    PERFORM 030100-PROCESO UNTIL W77-FIN = 1.                     124800      
002209    STOP RUN.                                                     125000      
002210                                                                  125200      
002211 020000-INICIO.                                                   125400      
002212*==============                                                   125600      
002213     PERFORM 020100-LIBRERIAS.                                    125800      
002214     PERFORM 020200-TASKFILE.                                     126000      
002215     PERFORM 020300-ARCHIVOS.                                     126200      
002216     PERFORM 020400-COMS.                                         126400      
002217     PERFORM 020500-CATALOGO.                                     126600      
002218     PERFORM 020800-CREA-MEZCLA.                                  126800      
002219                                                                  127000      
002220 020100-LIBRERIAS.                                                127200      
002221*=================                                                127400      
002222    CHANGE ATTRIBUTE LIBACCESS         OF "SOPORTECOMS"           127600      
002223                                       TO BYFUNCTION.             127800      
002224    CHANGE ATTRIBUTE FUNCTIONNAME      OF "SOPORTECOMS"           128000      
002225                                       TO "SOPORTECOMS".          128200      
002226                                                                  128400      
002227    CHANGE ATTRIBUTE LIBACCESS         OF "DCILIBRARY"            128600      
002228                                       TO  BYFUNCTION.            128800      
002229    CHANGE ATTRIBUTE FUNCTIONNAME      OF "DCILIBRARY"            129000      
002230                                       TO "COMSSUPPORT".          129200      
002231                                                                  129400      
002232    CHANGE ATTRIBUTE LIBACCESS         OF "CTRLVERS"              129600      
002233                                       TO BYFUNCTION.             129800      
002234    CHANGE ATTRIBUTE FUNCTIONNAME      OF "CTRLVERS"              130000      
002235                                       TO "CTLVERS".              130200      
002236                                                                  130400      
002237    CHANGE ATTRIBUTE LIBACCESS         OF "ADMONXFERS"            130600      
002238                                       TO BYFUNCTION.             130800      
002239    CHANGE ATTRIBUTE FUNCTIONNAME      OF "ADMONXFERS"            131000      
002240                                       TO "ADMONXFERS".           131200      
002241                                                                  131400      
002242    CHANGE ATTRIBUTE LIBACCESS         OF "XFER"                  131600      
002243                                       TO BYFUNCTION.             131800      
002244    CHANGE ATTRIBUTE FUNCTIONNAME      OF "XFER"                  132000      
002245                                       TO "XFER".                 132200      
002246                                                                  132400      
002247    CHANGE ATTRIBUTE LIBACCESS         OF "LOCSUP" TO BYFUNCTION. 132600      
002248    CHANGE ATTRIBUTE FUNCTIONNAME      OF "LOCSUP" TO "LOCSUP".   132800      
002249    CHANGE ATTRIBUTE TITLE             OF "LIB-DISP"              133000      
002250               TO "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".133200      
002251                                                                  133400      
002252    MOVE "S080BD01CON"                 TO     WKS-CTLVER-LIBID.   133600      
002253    CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID    133800      
002254                                              WKS-CTLVER-NOMLIB   134000      
002255                                       GIVING W77-CTLVER-RESULT.  134200      
002256     IF W77-CTLVER-RESULT = 0                                     134400      
002257        CHANGE ATTRIBUTE TITLE OF "S080L710"                      134600      
002258                                       TO     WKS-CTLVER-NOMLIB.  134800      
002259                                                                  135000      
002260    MOVE "S151L001CTL"                 TO     WKS-CTLVER-LIBID.   135200      
002261    CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID    135400      
002262                                              WKS-CTLVER-NOMLIB   135600      
002263                                       GIVING W77-CTLVER-RESULT.  135800      
002264     IF W77-CTLVER-RESULT = 0                                     136000      
002265        CHANGE ATTRIBUTE TITLE         OF "S151-L001"             136200      
002266                                       TO WKS-CTLVER-NOMLIB       136400      
002267     ELSE                                                         136600      
002268        CHANGE ATTRIBUTE TITLE         OF "S151-L001" TO          136800      
002269               "(S151)S151/OBJECT/L001/CONTROL ON CMEMP.".        137000      
002270                                                                  137200      
002271     MOVE 500                          TO WKS-B01-SISTEMA         137400      
002272     MOVE 01                           TO WKS-B01-FUNCION.        137600      
002273     CALL "CONSISDIA IN S151-L001"     USING  WKS-S151B01SISDIA   137800      
002274                                       GIVING W77-RESULT-B01.     138000      
002275                                                                  138200      
002276     IF W77-RESULT-B01 > 0                                        138400      
002277        MOVE W77-RESULT-B01            TO W77-ERROR               138600      
002278        STRING "NO PUEDO OBTENER FECHA DE PROCESO "               138800      
002279               " ERROR EN S151-L001 S500, ERR #" W77-ERROR        139000      
002280        DELIMITED BY SIZE INTO TEXTO-LJ                           139200      
002281        MOVE "O"                       TO TIPO-LJ                 139400      
002282        MOVE 020901                    TO CODIGO-LJ               139600      
002283        CALL "LJ IN LIB-DISP"          USING CONTADOR-LJ,         139800      
002284                                             MENSAJE-LJ           140000      
002285        SET MYSELF(STATUS) TO -1                                  140200      
002286     ELSE                                                         140400      
002287        MOVE WKS-B01-NOMPACMOV         TO WKS-PACK-MOVS           140600      
002288        MOVE WKS-B01-NOMPACDES         TO WKS-PACK-DESS           140800      
002289        MOVE WKS-B01-FECCON            TO WKS-FECHA-PROCESO.      141000      
002290                                                                  141080      
002291                                                                  141200      
002292     CALL "CSIID OF SOPORTECOMS"       USING WKS-DATOS-HOST.      141400      
002293                                                                  141600      
002294     ALLOW INTERRUPT.                                             141800      
002295     ATTACH INTERRUPT-BY-HI            TO ATTRIBUTE EXCEPTIONEVENT142000      
002296                                       OF MYSELF.                 142200      
002297                                                                  142400      
002298 020200-TASKFILE.                                                 142600      
002299*================                                                 142800      
002300    MOVE ZERO                          TO W77-FIN                 143000      
002301    MOVE "/"                           TO WKS-DIAGONAL1           143200      
002302                                          WKS-DIAGONAL2.          143400      
002303    ACCEPT WKS-FECHA-MAQUINA           FROM TODAYS-DATE.          143600      
002304    MOVE WKS-FECMAQ-CC                 TO WKS-CC-MAQ.             143800      
002305    MOVE WKS-FECMAQ-AA                 TO WKS-TSK-AA              144000      
002306                                          WKS-AA-MAQ.             144200      
002307    MOVE WKS-FECMAQ-MM                 TO WKS-TSK-MM              144400      
002308                                          WKS-MM-MAQ.             144600      
002309    MOVE WKS-FECMAQ-DD                 TO WKS-TSK-DD              144800      
002310                                          WKS-DD-MAQ.             145000      
002311                                                                  145200      
002312    MOVE WKS-NUMCSI-HOST               TO WKS-TSK-NODO.           145400      
002313    MOVE ATTRIBUTE MIXNUMBER           OF MYSELF TO WKS-TSK-MIX.  145600      
002314    SET  MYSELF (OPTION)               TO 1926.                   145800      
002315    SET  MYSELF (FILECARDS)            TO WKS-TIT-TASKFILE.       146000      
002316                                                                  146200      
002317     MOVE 18                           TO W77-FUNCION             146400      
002318     MOVE WKS-FECHA-MAQ-8D             TO WKS-FECHA1              146600      
002319                                          WKS-FECHA-MAQ-ANT-8D    146800      
002320     MOVE 0                            TO WKS-FECHA2              147000      
002321     MOVE 13                           TO W77-FORMATO             147200      
002322     CALL "THECALENDAR IN LOCSUP"      USING W77-FUNCION,         147400      
002323                                             WKS-FECHA1,          147600      
002324                                             WKS-FECHA2,          147800      
002325                                             W77-FORMATO.         148000      
002326     IF WKS-FECHA1 = 1                                            148200      
002327        MOVE ZERO                      TO W77-HABIL               148400      
002328     ELSE                                                         148600      
002329        MOVE 1                         TO W77-HABIL.              148800      
002330                                                                  149000      
002331 020300-ARCHIVOS.                                                 149200      
002332*================                                                 149400      
002333    MOVE WKS-FECPRO-6D                 TO WKS-MOVS1-FECHA         149600      
002334                                          WKS-DESS1-FECHA         149800      
002335                                          WKS-FECHA-AUT           150000      
002336                                          WKS-FECHA-ENV.          150200      
002337                                                                  150400      
002338    CHANGE ATTRIBUTE TITLE             OF A01-MOVS500             150600      
002339                                       TO WKS-TITLE-MOVS500.      150800      
002340    CHANGE ATTRIBUTE TITLE             OF A02-DESS500             151000      
002341                                       TO WKS-TITLE-DESS500.      151200      
002342                                                                  151400      
002343    CHANGE ATTRIBUTE TITLE             OF A05-AUTORIZACIONES      151600      
002344                                       TO WKS-TIT-AUTORIZA.       151800      
002345    IF ATTRIBUTE RESIDENT              OF A05-AUTORIZACIONES = 1  152000      
002346       NEXT SENTENCE                                              152200      
002347    ELSE                                                          152400      
002348       OPEN OUTPUT A05-AUTORIZACIONES                             152600      
002349       CLOSE A05-AUTORIZACIONES        WITH SAVE.                 152800      
002350                                                                  153000      
002351    CHANGE ATTRIBUTE TITLE             OF A03-CTL-ENVIO           153200      
002352                                       TO WKS-CTLENV.             153400      
002353    IF ATTRIBUTE RESIDENT              OF A03-CTL-ENVIO = 1       153600      
002354       PERFORM 020350-CONTROL-DIA-INHABIL                         153800      
002355    ELSE                                                          154000      
002356       OPEN OUTPUT A03-CTL-ENVIO                                  154200      
002357       MOVE 1                          TO R01-REG-AUTS500         154400      
002358                                          R01-REG-IND-ENV         154600      
002359       MOVE ZEROS                      TO R01-REG-SECARCH         154800      
002360                                          R01-REG-SECDET          155000      
002361                                          R01-REG-SECDET-DOL      155200      
002362       MOVE WKS-FECHA-MAQ-8D           TO R01-REG-FECNAT          155400      
002363       WRITE R01-REG-ENVIO                                        155600      
002364       CLOSE A03-CTL-ENVIO             WITH SAVE.                 155800      
002365                                                                  156000      
002366 020350-CONTROL-DIA-INHABIL.                                      156200      
002367    OPEN I-O A03-CTL-ENVIO.                                       156400      
002368    MOVE 1                           TO W77-NUMREG-ACC.           156600      
002369    SEEK A03-CTL-ENVIO RECORD.                                    156800      
002370    READ A03-CTL-ENVIO.                                           157000      
002371                                                                  157200      
002372    IF R01-REG-FECNAT = WKS-FECHA-MAQ-8D                          157400      
002373       NEXT SENTENCE                                              157600      
002374    ELSE                                                          157800      
002375    IF WKS-FECHA-PROCESO NOT < WKS-FECHA-MAQ-8D                   158000      
002376*       MOVE R01-REG-AUTS500             TO R01-REG-AUTS500.      158200      
002377       MOVE ZEROS                       TO R01-REG-SECARCH        158400      
002378                                           R01-REG-SECDET         158600      
002379                                           R01-REG-SECDET-DOL     158800      
002380       MOVE 1                           TO R01-REG-IND-ENV        159000      
002381       MOVE WKS-FECHA-MAQ-8D            TO R01-REG-FECNAT.        159200      
002382                                                                  159400      
002383    REWRITE R01-REG-ENVIO INVALID KEY NEXT SENTENCE.              159600      
002384    CLOSE A03-CTL-ENVIO WITH SAVE.                                159800      
002385                                                                  160000      
002386 030318-VALIDA-PROX-CORTE.                                        160200      
002387    IF WKS-HM-MAQ-4D < WKS-HORA-CORTE(W77-IND-ENV)                160400      
002388       MOVE 1                          TO W77-EOF-ENVIO           160600      
002389       IF W77-IND-ENV > 1                                         160800      
002390         COMPUTE W77-IND-ENV = W77-IND-ENV - 1                    161000      
002391       ELSE                                                       161200      
002392          MOVE ZEROS                   TO W77-IND-ENV             161400      
002393    ELSE                                                          161600      
002394       NEXT SENTENCE.                                             161800      
002395                                                                  162000      
002396 020400-COMS.                                                     162200      
002397*============                                                     162400      
002398     ENABLE INPUT COMS-IN    KEY "ONLINE".                        162600      
002399                                                                  162800      
002400*=============== VALIDACION DE AGENDA DE SALIDA ================= 163000      
002401     MOVE "OUTPUT OF LINEA"           TO WKS-COMS-AG-SALIDA-NAME. 163200      
002402     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               163400      
002403           USING  WKS-COMS-AG-SALIDA-NAME                         163600      
002404                  VALUE AGENDA                                    163800      
002405                  W77-COMS-AG-SALIDA-DESG                         164000      
002406           GIVING W77-COMS-RESULT.                                164200      
002407     IF W88-COMS-OK                                               164400      
002408        NEXT SENTENCE                                             164600      
002409     ELSE                                                         164800      
002410        PERFORM 900000-FIN-MAL.                                   165000      
002411                                                                  165200      
002412     MOVE CS-COMS-IN-PROGRAM          TO W77-COMS-MY-PROGRAM-DESG.165400      
002413     CALL "GET-NAME-USING-DESIGNATOR OF DCILIBRARY"               165600      
002414           USING  W77-COMS-MY-PROGRAM-DESG                        165800      
002415                  WKS-COMS-MY-PROGRAM-NAME                        166000      
002416           GIVING W77-COMS-RESULT.                                166200      
002417     IF W88-COMS-OK                                               166400      
002418        NEXT SENTENCE                                             166600      
002419     ELSE                                                         166800      
002420        PERFORM 900000-FIN-MAL.                                   167000      
002421*=============== DESIGNACION DE ESTACION DEFAULT  =============   167200      
002422     MOVE "DEFAULTSTATION"            TO WKS-COMS-DEFSTATION-NAME 167400      
002423     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               167600      
002424           USING  WKS-COMS-DEFSTATION-NAME                        167800      
002425           VALUE  STATION                                         168000      
002426                  W77-COMS-DEFSTATION-DESG                        168200      
002427           GIVING W77-COMS-RESULT.                                168400      
002428     IF W88-COMS-OK                                               168600      
002429        NEXT SENTENCE                                             168800      
002430     ELSE                                                         169000      
002431        PERFORM 900000-FIN-MAL.                                   169200      
002432*=============== DESIGNACION DE ESTACION DEFAULT  =============   169400      
002433     MOVE "DEFAULTSTATION"            TO WKS-COMS-DEFSTATION-NAME.169600      
002434     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               169800      
002435           USING WKS-COMS-DEFSTATION-NAME                         170000      
002436                 VALUE STATION                                    170200      
002437                 W77-COMS-DEFSTATION-DESG                         170400      
002438           GIVING W77-COMS-RESULT.                                170600      
002439     IF W88-COMS-OK                                               170800      
002440        NEXT SENTENCE                                             171000      
002441     ELSE                                                         171200      
002442        PERFORM 900000-FIN-MAL.                                   171400      
002443     MOVE "NOAPL"                    TO WKS-NOAPLINCLUDE-PARAMETRO171600      
002444     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               171800      
002445           USING  WKS-NOAPLINCLUDE-PARAMETRO                      172000      
002446           VALUE  PROGRAM                                         172200      
002447                  W77-NOAPLINCLUDE-DESG                           172400      
002448           GIVING W77-NOAPL-RESULT.                               172600      
002449     IF W88-NOAPL-OK                                              172800      
002450        NEXT SENTENCE                                             173000      
002451     ELSE                                                         173200      
002452        PERFORM 900000-FIN-MAL.                                   173400      
002453                                                                  173600      
002454 020500-CATALOGO.                                                 173800      
002455*================                                                 174000      
002456     PERFORM 020500-CATALOGO-6.                                   174200      
002457     PERFORM 020500-CATALOGO-1822.                                174400      
002458     PERFORM 020500-CATALOGO-1823.                                174600      
002459 020500-CATALOGO-6.                                               174800      
002460*==================                                               175000      
002461     MOVE 6                           TO WKS-EL710-CAT.           175200      
002462     MOVE 2                           TO WKS-EL710-BUSQUEDA.      175400      
002463     MOVE ZERO                        TO WKS-EL710-LLAVE1.        175600      
002464     MOVE 500                         TO WKS-EL710-LLAVE2.        175800      
002465     MOVE 151                         TO W77-L710-SISTEMA.        176000      
002466     MOVE 54                          TO W77-L710-PROGRAMA.       176200      
002467     MOVE 20                          TO WKS-EL710-CLAVE.         176400      
002468     MOVE 10                          TO WKS-EL710-REGISTROS.     176600      
002469     MOVE ZERO                        TO WKS-EL710-LLAVE3         176800      
002470                                         WKS-EL710-LLAVE4         177000      
002471                                         WKS-EL710-LLAVE5         177200      
002472                                         WKS-EL710-LLAVE6         177400      
002473                                         WKS-EL710-FECINI         177600      
002474                                         WKS-EL710-NIVINI         177800      
002475                                         WKS-EL710-FEC-VIG.       178000      
002476     MOVE 0                           TO WKS-NUM-CVETRANS.        178200      
002477     MOVE ZERO                        TO W77-EOF.                 178400      
002478     PERFORM 010610-CLAVES-TRAN       UNTIL W77-EOF = 1.          178600      
002479                                                                  178800      
002480 020500-CATALOGO-1822.                                            179000      
002481*=====================                                            179200      
002482    PERFORM 020550-INICIALIZA-OCC-CORTES VARYING W77-IND-ENV      179400      
002483                                     FROM 1 BY 1 UNTIL            179600      
002484                                     W77-IND-ENV = 1000.          179800      
002485                                                                  180000      
002486    MOVE 151                         TO WKS-EL710-LLAVE1.         180200      
002487    MOVE 1822                        TO WKS-EL710-CAT.            180400      
002488    MOVE 2                           TO WKS-EL710-BUSQUEDA.       180600      
002489    MOVE 1                           TO WKS-EL710-LLAVE2.         180800      
002490    MOVE 151                         TO W77-L710-SISTEMA.         181000      
002491    MOVE 54                          TO W77-L710-PROGRAMA.        181200      
002492    MOVE 20                          TO WKS-EL710-CLAVE.          181400      
002493    MOVE 10                          TO WKS-EL710-REGISTROS.      181600      
002494    MOVE ZERO                        TO WKS-EL710-LLAVE3          181800      
002495                                        WKS-EL710-LLAVE4          182000      
002496                                        WKS-EL710-LLAVE5          182200      
002497                                        WKS-EL710-LLAVE6          182400      
002498                                        WKS-EL710-FECINI          182600      
002499                                        WKS-EL710-NIVINI          182800      
002500                                        WKS-EL710-FEC-VIG.        183000      
002501    MOVE 0                           TO W77-CORTE.                183200      
002502    MOVE ZERO                        TO W77-EOF.                  183400      
002503    PERFORM 010610-CORTES-HORA       UNTIL W77-EOF = 1.           183600      
002504                                                                  183800      
002505    ACCEPT  WKS-HR-MAQUINA           FROM TIME.                   184000      
002506    MOVE WKS-HH-MAQUINA              TO WKS-HM-HH.                184200      
002507    MOVE WKS-MM-MAQUINA              TO WKS-HM-MM.                184400      
002508    PERFORM 030318-VALIDA-PROX-CORTE VARYING W77-IND-ENV          184600      
002509                           FROM 1 BY 1                            184800      
002510                           UNTIL W77-EOF-ENVIO = 1                185000      
002511                           OR WKS-HORA-CORTE(W77-IND-ENV) = 9999. 185200      
002512                                                                  185400      
002513 020550-INICIALIZA-OCC-CORTES.                                    185600      
002514    MOVE 9999                      TO WKS-HORA-CORTE(W77-IND-ENV).185800      
002515                                                                  186000      
002516 020500-CATALOGO-1823.                                            186200      
002517*=====================                                            186400      
002518    MOVE ZERO                        TO WKS-EL710-LLAVE1.         186600      
002519    MOVE 1823                        TO WKS-EL710-CAT.            186800      
002520    MOVE 2                           TO WKS-EL710-BUSQUEDA.       187000      
002521    MOVE ZERO                        TO WKS-EL710-LLAVE2.         187200      
002522    MOVE 151                         TO W77-L710-SISTEMA.         187400      
002523    MOVE 54                          TO W77-L710-PROGRAMA.        187600      
002524    MOVE 20                          TO WKS-EL710-CLAVE.          187800      
002525    MOVE 10                          TO WKS-EL710-REGISTROS.      188000      
002526    MOVE ZERO                        TO WKS-EL710-LLAVE3          188200      
002527                                        WKS-EL710-LLAVE4          188400      
002528                                        WKS-EL710-LLAVE5          188600      
002529                                        WKS-EL710-LLAVE6.         188800      
002530    MOVE ZERO                        TO WKS-EL710-FECINI          189000      
002531                                        WKS-EL710-NIVINI          189200      
002532                                        WKS-EL710-FEC-VIG.        189400      
002533    MOVE 0                           TO W77-CORTE.                189600      
002534    MOVE ZERO                        TO W77-EOF.                  189800      
002535    PERFORM 010610-CLAVES-TRAN1823   UNTIL W77-EOF = 1.           190000      
002536                                                                  190200      
002537  010610-CLAVES-TRAN.                                             190400      
002538*=========================================                        190600      
002539     CALL "L710_CONSUL_DETALLE IN S080L710"                       190800      
002540          USING  W77-L710-SISTEMA,                                191000      
002541                 W77-L710-PROGRAMA,                               191200      
002542                 WKS-L710-ENT,                                    191400      
002543                 WKS-L710-SAL,                                    191600      
002544          GIVING W77-L710-RESULT.                                 191800      
002545                                                                  192000      
002546     IF W77-L710-RESULT = 0 OR 1                                  192200      
002547        PERFORM 010620-LLENA-CATALOGO                             192400      
002548                VARYING WKS-NUM-OCCURS FROM 1 BY 1                192600      
002549                UNTIL WKS-NUM-OCCURS > WKS-SL710-NUMREG           192800      
002550        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,1) TO WKS-EL710-LLAVE1193000      
002551        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,2) TO WKS-EL710-LLAVE2193200      
002552        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,3) TO WKS-EL710-LLAVE3193400      
002553        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,4) TO WKS-EL710-LLAVE4193600      
002554        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,5) TO WKS-EL710-LLAVE5193800      
002555        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,6) TO WKS-EL710-LLAVE6194000      
002556        MOVE WKS-SL710-NIVINI                  TO WKS-EL710-NIVINI194200      
002557        MOVE WKS-SL710-FECINI                  TO WKS-EL710-FECINI194400      
002558     ELSE                                                         194600      
002559        MOVE 1                        TO W77-EOF                  194800      
002560        MOVE W77-L710-RESULT          TO W77-ERR-CAT              195000      
002561        IF W77-ERR-CAT = 20                                       195200      
002562           IF WKS-NUM-CVETRANS = 0                                195400      
002563             MOVE  1                       TO  W77-FIN            195600      
002564             MOVE  "EN CAT 6 NO EXISTEN REG CON MARCA DM"         195800      
002565                                           TO TEXTO-LJ            196000      
002566              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ 196200      
002567           ELSE                                                   196400      
002568              NEXT SENTENCE                                       196600      
002569        ELSE                                                      196800      
002570           MOVE  1                    TO  W77-FIN                 197000      
002571           MOVE "I"                   TO TIPO-LJ                  197200      
002572           MOVE 020901                TO CODIGO-LJ                197400      
002573           STRING "ERROR AL LLAMAR S080BD01CON, RESULT = "        197600      
002574                  W77-ERR-CAT                                     197800      
002575           DELIMITED BY SIZE                                      198000      
002576           INTO TEXTO-LJ                                          198200      
002577           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.   198400      
002578                                                                  198600      
002579  010610-CORTES-HORA.                                             198800      
002580*=========================================                        199000      
002581     CALL "L710_CONSUL_DETALLE IN S080L710"                       199200      
002582          USING  W77-L710-SISTEMA,                                199400      
002583                 W77-L710-PROGRAMA,                               199600      
002584                 WKS-L710-ENT,                                    199800      
002585                 WKS-L710-SAL,                                    200000      
002586          GIVING W77-L710-RESULT.                                 200200      
002587                                                                  200400      
002588     IF W77-L710-RESULT = 0 OR 1                                  200600      
002589        PERFORM 010620-LLENA-CATALOGO-CORTES                      200800      
002590                VARYING WKS-NUM-OCCURS FROM 1 BY 1                201000      
002591                UNTIL WKS-NUM-OCCURS > WKS-SL710-NUMREG           201200      
002592        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,1) TO WKS-EL710-LLAVE1201400      
002593        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,2) TO WKS-EL710-LLAVE2201600      
002594        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,3) TO WKS-EL710-LLAVE3201800      
002595        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,4) TO WKS-EL710-LLAVE4202000      
002596        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,5) TO WKS-EL710-LLAVE5202200      
002597        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,6) TO WKS-EL710-LLAVE6202400      
002598        MOVE WKS-SL710-NIVINI         TO WKS-EL710-NIVINI         202600      
002599        MOVE WKS-SL710-FECINI         TO WKS-EL710-FECINI         202800      
002600     ELSE                                                         203000      
002601        MOVE 1                        TO W77-EOF                  203200      
002602        MOVE W77-L710-RESULT          TO W77-ERR-CAT              203400      
002603        IF W77-ERR-CAT = 20                                       203600      
002604              NEXT SENTENCE                                       203800      
002605        ELSE                                                      204000      
002606           MOVE  1                    TO  W77-FIN                 204200      
002607           MOVE "I"                   TO TIPO-LJ                  204400      
002608           MOVE 020901                TO CODIGO-LJ                204600      
002609           STRING "ERROR AL LLAMAR S080BD01CON, RESULT = "        204800      
002610                  W77-ERR-CAT                                     205000      
002611           DELIMITED BY SIZE                                      205200      
002612           INTO TEXTO-LJ                                          205400      
002613           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.   205600      
002614                                                                  205800      
002615 010610-CLAVES-TRAN1823.                                          206000      
002616*=========================================                        206200      
002617      CALL "L710_CONSUL_DETALLE IN S080L710"                      206400      
002618          USING  W77-L710-SISTEMA,                                206600      
002619                 W77-L710-PROGRAMA,                               206800      
002620                 WKS-L710-ENT,                                    207000      
002621                 WKS-L710-SAL,                                    207200      
002622          GIVING W77-L710-RESULT.                                 207400      
002623                                                                  207600      
002624     IF W77-L710-RESULT = 0 OR 1                                  207800      
002625        PERFORM 010620-LLENA-CATALOGO1823                         208000      
002626                VARYING WKS-NUM-OCCURS FROM 1 BY 1                208200      
002627                UNTIL WKS-NUM-OCCURS > WKS-SL710-NUMREG           208400      
002628        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,1) TO WKS-EL710-LLAVE1208600      
002629        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,2) TO WKS-EL710-LLAVE2208800      
002630        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,3) TO WKS-EL710-LLAVE3209000      
002631        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,4) TO WKS-EL710-LLAVE4209200      
002632        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,5) TO WKS-EL710-LLAVE5209400      
002633        MOVE WKS-SL710-DAT(WKS-SL710-NUMREG,6) TO WKS-EL710-LLAVE6209600      
002634        MOVE WKS-SL710-NIVINI         TO WKS-EL710-NIVINI         209800      
002635        MOVE WKS-SL710-FECINI         TO WKS-EL710-FECINI         210000      
002636     ELSE                                                         210200      
002637        MOVE 1                        TO W77-EOF                  210400      
002638        MOVE W77-L710-RESULT          TO W77-ERR-CAT              210600      
002639        IF W77-ERR-CAT = 20                                       210800      
002640              NEXT SENTENCE                                       211000      
002641        ELSE                                                      211200      
002642           MOVE  1                    TO  W77-FIN                 211400      
002643           MOVE "I"                   TO TIPO-LJ                  211600      
002644           MOVE 020901                TO CODIGO-LJ                211800      
002645           STRING "ERROR AL LLAMAR S080BD01CON, RESULT = "        212000      
002646                  W77-ERR-CAT                                     212200      
002647           DELIMITED BY SIZE                                      212400      
002648           INTO TEXTO-LJ                                          212600      
002649           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.   212800      
002650                                                                  213000      
002651 010620-LLENA-CATALOGO.                                           213200      
002652*=========================================                        213400      
002653    MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,1) TO WKS-NUM-CVETRANS.     213600      
002654    MOVE WKS-NUM-CVETRANS TO WKS-CAT6-CVETRAN(WKS-NUM-CVETRANS).  213800      
002655    MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,11)                         214000      
002656                              TO WKS-CAT6-AFC(WKS-NUM-CVETRANS).  214200      
002657                                                                  214400      
002658 010620-LLENA-CATALOGO-CORTES.                                    214600      
002659*=========================================                        214800      
002660   IF WKS-SL710-DAT(WKS-NUM-OCCURS,2) = 1                         214900      
002661      ADD 1                          TO W77-CORTE                 215000      
002662      MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,3)                        215200      
002663                                     TO WKS-HORA-CORTE(W77-CORTE) 215400      
002664   ELSE                                                           215600      
002665      NEXT SENTENCE.                                              215650      
002666                                                                  215700      
002667  010620-LLENA-CATALOGO1823.                                      215800      
002668*=========================================                        216000      
002669   MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,1) TO WKS-NUM-CVETRANS.      216200      
002670   MOVE WKS-NUM-CVETRANS TO WKS-CAT1823-CVOR(WKS-NUM-CVETRANS).   216400      
002671   MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,2) TO                        216600      
002672                         WKS-CAT1823-ENVIOCA(WKS-NUM-CVETRANS).   216800      
002673   MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,3) TO                        217000      
002674                         WKS-CAT1823-CLVTRAN(WKS-NUM-CVETRANS).   217200      
002675   MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,4) TO                        217400      
002676                         WKS-CAT1823-CLVTRAA(WKS-NUM-CVETRANS).   217600      
002677   MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,5) TO                        217800      
002678                         WKS-CAT1823-CLVTRAC(WKS-NUM-CVETRANS).   218000      
002679   MOVE WKS-SL710-DAT(WKS-NUM-OCCURS,6) TO                        218050      
002680                         WKS-CAT1823-AGRP500(WKS-NUM-CVETRANS).   218100      
002681                                                                  218200      
002682 900000-FIN-MAL.                                                  218400      
002683*===============                                                  218600      
002684    MOVE SPACES                       TO TEXTO-LJ.                218800      
002685    STRING " ERROR EN COMS, FIN ERRONEO DE PROGRAMA "             219000      
002686           " AVISAR AL RESPONSABLE DEL SISTEMA "                  219200      
002687    DELIMITED BY SIZE                                             219400      
002688    INTO TEXTO-LJ.                                                219600      
002689    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.          219800      
002690    PERFORM 999999-FIN.                                           220000      
002691                                                                  220200      
002692 999999-FIN.                                                      220400      
002693*===========                                                      220600      
002694     IF W88-HI-5                                                  220800      
002695        MOVE "DISABLE NOW PROGRAM "   TO WKS-SMCOMS-STRING1       221000      
002696     ELSE                                                         221200      
002697        MOVE "DISABLE PROGRAM "       TO WKS-SMCOMS-STRING1.      221400      
002698     MOVE WKS-COMS-MY-PROGRAM-NAME    TO WKS-SMCOMS-STRING2       221600      
002699     CALL "SMCOMS OF SOPORTECOMS"                                 221800      
002700           USING  WKS-SMCOMS-COMANDO                              222000      
002701                  WKS-SMCOMS-TRABAJO                              222200      
002702           GIVING W77-SMCOMS-RESULT.                              222400      
002703     IF W88-SMCOMS-OK                                             222600      
002704        NEXT SENTENCE                                             222800      
002705     ELSE                                                         223000      
002706        MOVE SPACES                   TO TEXTO-LJ                 223200      
002707        MOVE W77-SMCOMS-RESULT        TO W77-RESULT-COMS          223400      
002708        STRING                                                    223600      
002709             " ERROR DISABLE RESULTS "                            223800      
002710             W77-RESULT-COMS                                      224000      
002711        DELIMITED BY SIZE                                         224200      
002712        INTO TEXTO-LJ                                             224400      
002713        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      224600      
002714                                                                  224800      
002715 800000-HI-SALIDA.                                                225000      
002716*=================                                                225200      
002717    MOVE  020201                      TO CODIGO-LJ.               225400      
002718    MOVE  "I"                         TO TIPO-LJ.                 225600      
002719                                                                  225800      
002720    IF W88-HI-4                                                   226000      
002721       MOVE "TERMINACION NORMAL"      TO TEXTO-LJ                 226200      
002722    ELSE                                                          226400      
002723    IF W88-HI-5                                                   226600      
002724       MOVE "TERMINACION DE EMERGENCIA" TO TEXTO-LJ.              226800      
002725    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                      227000      
002726                                MENSAJE-LJ.                       227200      
002727                                                                  227400      
002728 020800-CREA-MEZCLA.                                              227600      
002729*=====================                                            227800      
002730  MOVE LOW-VALUES                 TO WKS-B05PROCESOS              228000      
002731  MOVE 1                          TO WKS-B05-FUNCION              228200      
002732  MOVE 151                        TO WKS-B05-SISTEMA              228400      
002733  MOVE 54                         TO WKS-B05-FCHPRO               228600      
002734                                     WKS-B05-NUMPRO               228800      
002735  MOVE 9999                       TO WKS-B05-NUMREGINI            229000      
002736  MOVE 0                          TO W77-RESULT-LIBCON            229200      
002737  CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS          229400      
002738                                  GIVING W77-RESULT-LIBCON        229600      
002739  IF W77-RESULT-LIBCON = 0                                        229800      
002740     MOVE 22                         TO WKS-B05-FUNCION           230000      
002741     MOVE 151                        TO WKS-B05-SISTEMA           230200      
002742     MOVE 54                         TO WKS-B05-FCHPRO            230400      
002743                                        WKS-B05-NUMPRO            230600      
002744     MOVE ZEROS                      TO WKS-B05-FCHINI            230800      
002745     MOVE 9999                       TO WKS-B05-NUMREGINI         231000      
002746     MOVE 0                          TO W77-RESULT-LIBCON         231200      
002747     CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS       231400      
002748                                     GIVING W77-RESULT-LIBCON     231600      
002749     IF W77-RESULT-LIBCON = 0                                     231800      
002750        MOVE 19                         TO WKS-B05-FUNCION        232000      
002751        MOVE 151                        TO WKS-B05-SISTEMA        232200      
002752        MOVE WKS-TSK-MIX                TO WKS-B05-MIX            232400      
002753        MOVE 54                         TO WKS-B05-FCHPRO         232600      
002754                                           WKS-B05-NUMPRO         232800      
002755        MOVE ZEROS                      TO WKS-B05-FCHINI         233000      
002756        MOVE 9999                       TO WKS-B05-NUMREGINI      233200      
002757        MOVE 0                          TO W77-RESULT-LIBCON      233400      
002758        CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS    233600      
002759                                        GIVING W77-RESULT-LIBCON  233800      
002760        IF W77-RESULT-LIBCON NOT = 0                              234000      
002761           PERFORM 020860-MENSAJE-LJ                              234200      
002762        ELSE                                                      234400      
002763          NEXT SENTENCE                                           234600      
002764     ELSE                                                         234800      
002765        PERFORM 020860-MENSAJE-LJ                                 235000      
002766  ELSE                                                            235200      
002767     MOVE 19                         TO WKS-B05-FUNCION           235400      
002768     MOVE 151                        TO WKS-B05-SISTEMA           235600      
002769     MOVE WKS-TSK-MIX                TO WKS-B05-MIX               235800      
002770     MOVE 54                         TO WKS-B05-FCHPRO            236000      
002771                                        WKS-B05-NUMPRO            236200      
002772     MOVE ZEROS                      TO WKS-B05-FCHINI            236400      
002773     MOVE 9999                       TO WKS-B05-NUMREGINI         236600      
002774     MOVE 0                          TO W77-RESULT-LIBCON         236800      
002775     CALL "B05PROCESOS IN S151-L001" USING  WKS-B05PROCESOS       237000      
002776                                     GIVING W77-RESULT-LIBCON     237200      
002777     IF W77-RESULT-LIBCON = 0                                     237400      
002778        NEXT SENTENCE                                             237600      
002779     ELSE                                                         237800      
002780        PERFORM 020860-MENSAJE-LJ.                                238000      
002781                                                                  238200      
002782 020860-MENSAJE-LJ.                                               238400      
002783*==================                                               238600      
002784    MOVE "I" TO TIPO-LJ                                           238800      
002785    MOVE 051010 TO CODIGO-LJ                                      239000      
002786    MOVE W77-RESULT-LIBCON            TO W77-ERROR                239200      
002787                                                                  239400      
002788    STRING "FUNCION " WKS-B05-FUNCION " ERROR # " W77-ERROR       239600      
002789    "ERROR AL LLAMADO DE B05PROCESOS" WKS-B05-SISTEMA " "         239800      
002790                  WKS-B05-NUMPRO " " WKS-FECHA-MAQ-8D             240000      
002791    DELIMITED BY SIZE INTO TEXTO-LJ                               240200      
002792    CALL "LJ IN LIB-DISP"       USING CONTADOR-LJ,                240400      
002793                                      MENSAJE-LJ.                 240600      
002794                                                                  240800      
002795 030100-PROCESO.                                                  241000      
002796*===============                                                  241200      
002797    PERFORM 030100-ACEPTA-MENSAGE.                                241400      
002798    IF W88-ACEPTA-MSG                                             241600      
002799       PERFORM 030200-ANALIZA-MSG                                 241800      
002800       IF W88-MSG-OK                                              242000      
002801          PERFORM 030800-ENVIA-RESPUESTA.                         242200      
002802                                                                  242400      
002803 030100-ACEPTA-MENSAGE.                                           242600      
002804*======================                                           242800      
002805    MOVE ZERO                       TO W77-ACEPTA-MSG             243000      
002806                                       WKS-HDR-COMS-RES           243200      
002807                                       W77-ESPERACOMS-TIPO-EVENTO.243400      
002808    CALL "ESPERACOMS OF SOPORTECOMS"                              243600      
002809         USING  W77-ESPERACOMS-TIEMPO                             243800      
002810         GIVING W77-ESPERACOMS-TIPO-EVENTO.                       244000      
002811                                                                  244200      
002812    IF W88-MONITOR                                                244400      
002813       MOVE SPACES                     TO TEXTO-LJ                244600      
002814       MOVE W77-ESPERACOMS-TIPO-EVENTO TO WKS-TIPO-EVENTO         244800      
002815       STRING "EVENTO ESPERACOMS " WKS-TIPO-EVENTO                245000      
002816       DELIMITED BY SIZE INTO TEXTO-LJ                            245200      
002817       CALL "LJ IN LIB-DISP"           USING CONTADOR-LJ          245400      
002818                                             MENSAJE-LJ.          245600      
002819                                                                  245800      
002820    IF W88-POR-MSG                                                246000      
002821       MOVE 1                          TO W77-ACEPTA-MSG          246200      
002822    ELSE                                                          246400      
002823    IF W88-POR-TIMEOUT                                            246600      
002824       NEXT SENTENCE                                              246800      
002825    ELSE                                                          247000      
002826    IF W88-POR-HI                                                 247200      
002827       IF W88-HI-4 OR W88-HI-5                                    247400      
002828          MOVE SPACES                     TO TEXTO-LJ             247600      
002829          PERFORM 800000-HI-SALIDA                                247800      
002830          PERFORM 999999-FIN                                      248000      
002831       ELSE                                                       248200      
002832          IF W88-HI-6                                             248400      
002833             PERFORM 020500-CATALOGO-6                            248600      
002834             MOVE SPACES                      TO TEXTO-LJ         248800      
002835             MOVE "CATALOGO ACTUALIZADO 6"    TO TEXTO-LJ         249000      
002836             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  249200      
002837             MOVE ZERO TO W77-HI                                  249400      
002838          ELSE                                                    249600      
002839          IF W88-HI-1822                                          249800      
002840             PERFORM 020500-CATALOGO-1822                         250000      
002841             MOVE SPACES                      TO TEXTO-LJ         250200      
002842             MOVE "CATALOGO ACTUALIZADO 1822" TO TEXTO-LJ         250400      
002843             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  250600      
002844             MOVE ZERO TO W77-HI                                  250800      
002845          ELSE                                                    251000      
002846          IF W88-HI-1823                                          251200      
002847             PERFORM 020500-CATALOGO-1823                         251400      
002848             MOVE SPACES                      TO TEXTO-LJ         251600      
002849             MOVE "CATALOGO ACTUALIZADO 1823" TO TEXTO-LJ         251800      
002850             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  252000      
002851             MOVE ZERO TO W77-HI                                  252200      
002852          ELSE                                                    252400      
002853             NEXT SENTENCE                                        252600      
002854    ELSE                                                          252800      
002855    IF W88-POR-EVENTO                                             253000      
002856       MOVE 1                          TO W77-ACEPTA-MSG          253200      
002857*      WAIT AND RESET UNTIL 15, ATTRIBUTE EXCEPTIONEVENT OF MYSELF253400      
002858    ELSE                                                          253600      
002859    IF W88-POR-ACCEPT                                             253800      
002860       ACCEPT WKS-BASURA.                                         254000      
002861                                                                  254200      
002862    ACCEPT WKS-FECHA-MAQUINA           FROM TODAYS-DATE.          254400      
002863    MOVE WKS-FECMAQ-CC                 TO WKS-CC-MAQ.             254600      
002864    MOVE WKS-FECMAQ-AA                 TO WKS-AA-MAQ.             254800      
002865    MOVE WKS-FECMAQ-MM                 TO WKS-MM-MAQ.             255000      
002866    MOVE WKS-FECMAQ-DD                 TO WKS-DD-MAQ.             255200      
002867                                                                  255400      
002868    IF WKS-FECHA-MAQ-8D = WKS-FECHA-MAQ-ANT-8D                    255600      
002869       NEXT SENTENCE                                              255800      
002870    ELSE                                                          256000      
002871       MOVE WKS-FECHA-MAQ-8D           TO WKS-FECHA-MAQ-ANT-8D    256200      
002872       MOVE 18                         TO W77-FUNCION             256400      
002873       MOVE WKS-FECHA-MAQ-8D           TO WKS-FECHA1              256600      
002874       MOVE 0                          TO WKS-FECHA2              256800      
002875       MOVE 13                         TO W77-FORMATO             257000      
002876       CALL "THECALENDAR IN LOCSUP"    USING W77-FUNCION,         257200      
002877                                          WKS-FECHA1,             257400      
002878                                          WKS-FECHA2,             257600      
002879                                          W77-FORMATO             257800      
002880       IF WKS-FECHA1 = 1                                          258000      
002881          MOVE ZERO                    TO W77-HABIL               258200      
002882       ELSE                                                       258400      
002883          MOVE 1                       TO W77-HABIL.              258600      
002884                                                                  258800      
002885       PERFORM 030300-GENERA-ARCHIVO.                             259000      
002886                                                                  259200      
002887 030200-ANALIZA-MSG.                                              259400      
002888*===================                                              259600      
002889    MOVE ZERO                          TO W77-MSG-OK              259800      
002890                                          W77-LONGMSG.            260000      
002891    MOVE LOW-VALUES                    TO WKS-MSG-COMS.           260200      
002892    RECEIVE COMS-IN MESSAGE INTO WKS-MSG-COMS                     260400      
002893                         NO DATA NEXT SENTENCE.                   260600      
002894    IF CS-COMS-IN-STATUS-KEY = 99                                 260800      
002895       MOVE 1                          TO W77-FIN                 261000      
002896    ELSE                                                          261200      
002897    IF CS-COMS-IN-STATUS-KEY = 0 OR 89 OR 91 OR 92 OR 93          261400      
002898       MOVE 1                          TO W77-MSG-OK              261600      
002899       MOVE CS-COMS-IN-TEXT-LENGTH     TO W77-LONGMSG             261800      
002900    ELSE                                                          262000      
002901       MOVE SPACES                     TO TEXTO-LJ                262200      
002902       MOVE "ERROR EN RECEIVE COMS"    TO TEXTO-LJ                262400      
002903       CALL "LJ IN LIB-DISP"           USING CONTADOR-LJ          262600      
002904                                             MENSAJE-LJ.          262800      
002905                                                                  263000      
002906    IF W88-MSG-OK OR W77-FIN = 1                                  263200      
002907       IF W88-MONITOR                                             263400      
002908          STRING "MSG ENTRADA " WKS-MSG-COMS                      263600      
002909          DELIMITED BY SIZE INTO MENSAJE-LJ                       263800      
002910          CALL "LJ IN LIB-DISP"        USING CONTADOR-LJ          264000      
002911                                             MENSAJE-LJ           264200      
002912       ELSE                                                       264400      
002913          NEXT SENTENCE                                           264600      
002914    ELSE                                                          264800      
002915       MOVE CS-COMS-IN-STATUS-KEY      TO W77-STATUS-KEY          265000      
002916       MOVE SPACE                      TO TEXTO-LJ                265200      
002917       MOVE "RESULT DEL HEADER NO TRATADO "  TO TEXTO-LJ          265400      
002918       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        265600      
002919       MOVE SPACES                     TO TEXTO-LJ                265800      
002920       MOVE WKS-MSG-COMS               TO TEXTO-LJ                266000      
002921       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ        266200      
002922       MOVE 1                          TO W77-MSG-OK.             266400      
002923                                                                  266600      
002924 030800-ENVIA-RESPUESTA.                                          266800      
002925*=======================                                          267000      
002926    MOVE WKS-NUMCSI-HOST              TO WKS-HDR-COMS-CCR-DES     267200      
002927                                         WKS-HDR-COMS-CCR-ORG.    267400      
002928    MOVE "CONSULTA NO DISPONIBLE"     TO WKS-TEXTO-COMS.          267600      
002929    MOVE WKS-HDR-COMS-APL-ORG         TO WKS-HDR-COMS-APL-DES.    267800      
002930    MOVE W77-LONGMSG                  TO CS-COMS-OUT-TEXT-LENGTH. 268000      
002931    MOVE 1                            TO CS-COMS-OUT-COUNT.       268200      
002932    MOVE 0                            TO CS-COMS-OUT-STATUS-KEY.  268400      
002933    MOVE W77-COMS-AG-SALIDA-DESG      TO CS-COMS-OUT-AGENDA.      268600      
002934    MOVE W77-COMS-DEFSTATION-DESG     TO CS-COMS-OUT-DESTINATION. 268800      
002935    MOVE 015154                       TO WKS-TRANCODE-COMS.       269000      
002936    PERFORM 030710-ENVIA-COMS.                                    269200      
002937                                                                  269400      
002938 030710-ENVIA-COMS.                                               269600      
002939*==================                                               269800      
002940    SEND COMS-OUT FROM WKS-MSG-COMS.                              270000      
002941    IF W88-MONITOR                                                270200      
002942       STRING "MSG SALIDA  " WKS-MSG-COMS                         270400      
002943       DELIMITED BY SIZE INTO MENSAJE-LJ                          270600      
002944       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       270800      
002945                                                                  271000      
002946    IF CS-COMS-OUT-STATUS-KEY = 0 OR 96                           271200      
002947       NEXT SENTENCE                                              271400      
002948    ELSE                                                          271600      
002949       MOVE CS-COMS-OUT-STATUS-KEY    TO W77-STATUS-KEY           271800      
002950       STRING MY-ID " ERROR EN SEND MSG ST-KEY "                  272000      
002951              W77-STATUS-KEY                                      272200      
002952       DELIMITED BY SIZE INTO MENSAJE-LJ                          272400      
002953       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       272600      
002954                                                                  272610      
002955030301-STATUS-FILE.                                               272620      
002956*======================                                           272630      
002957    PERFORM 030318-LEE-CONTROL.                                   272640      
002958    PERFORM 030302-STATUS-EXTNET.                                 272641      
002959                                                                  272643      
002960030302-STATUS-EXTNET.                                             272644      
002961*======================                                           272645      
002962    ACCEPT  WKS-HR-MAQUINA             FROM TIME.                 272650      
002963                                                                  272655      
002964    MOVE WKS-HH-MAQUINA                TO WKS-HM-HH.              272660      
002965    MOVE WKS-MM-MAQUINA                TO WKS-HM-MM.              272665      
002966                                                                  272670      
002967    IF W77-STATUS-FILE = 1 AND W77-IND-ARCH > 0                   272675      
002968       IF WKS-HM-MAQ-4D > WKS-HORA-CORTE(W77-IND-ARCH)            272710      
002969          MOVE 1 TO W77-ENVIO-EXTNET                              272720      
002970          PERFORM 020500-ABRE-ARCH-EXTNET-ANT                     272730      
002971          PERFORM 020500-TRAILER-EXTNET                           272740      
002972          CLOSE A04-EXTNET-ARCHIVO           WITH SAVE            272750      
002973    ELSE                                                          272760      
002974       NEXT SENTENCE.                                             272770      
002975                                                                  272771      
002976    IF W77-STATUS-FILE-D = 1 AND W77-IND-ARCH-D > 0               272774      
002977       IF WKS-HM-MAQ-4D > WKS-HORA-CORTE(W77-IND-ARCH-D)          272780      
002978          MOVE 1 TO W77-ENVIO-EXTNET                              272781      
002979          PERFORM 020500-ABRE-ARCH-EXTNET-D-ANT                   272782      
002980          PERFORM 020500-TRAILER-EXTNET-D                         272783      
002981          CLOSE A04-EXTNET-ARCHIVO-D         WITH SAVE            272784      
002982    ELSE                                                          272786      
002983       NEXT SENTENCE.                                             272788      
002984                                                                  272790      
002985    PERFORM 030375-ENVIO-EXTNET.                                  272792      
002986                                                                  272800      
002987030300-GENERA-ARCHIVO.                                            273000      
002988*======================                                           273200      
002989    PERFORM 030302-VERIFICA-ENVIO.                                273400      
002990    IF WKS-ARCH-GEN = 0                                           273405      
002991       PERFORM 030300-PROC-EXTNET.                                273410      
002992                                                                  273412      
002993    IF WKS-ARCH-GEN = 1                                           273414      
002994       PERFORM 999999-FIN.                                        273416      
002995                                                                  273418      
002996030300-PROC-EXTNET.                                               273420      
002997*======================                                           273425      
002998    PERFORM 030318-LEE-CONTROL.                                   273450      
002999    PERFORM 030374-GENERA-ARCH-EXTNET.                            273550      
003000    PERFORM 030375-ENVIO-EXTNET.                                  273560      
003001                                                                  273600      
003002030375-ENVIO-EXTNET.                                              273650      
003003*======================                                           273700      
003004    IF W88-ENVIO-EXTNET                                           273800      
003005       UNSTRING WKS-TITLE-EXTNET-ARCHIVO DELIMITED BY " "         274400      
003006           INTO WKS-INTE-ARCHIVO                                  274600      
003007       MOVE ZERO                       TO W77-INTE-SNT            274800      
003008       PERFORM 030705-ENVIO-POR-INTELAR                           275000      
003009       UNSTRING WKS-TITLE-EXTNET-ARCHIVO-D DELIMITED BY " "       275200      
003010           INTO WKS-INTE-ARCHIVO                                  275400      
003011       MOVE ZERO                       TO W77-INTE-SNT            275600      
003012       PERFORM 030705-ENVIO-POR-INTELAR                           275800      
003013       MOVE ZERO                       TO W77-ENVIO-EXTNET        276000      
003014       PERFORM 400021-LIMPIA-TRAILER                              276400      
003015       PERFORM 400021-LIMPIA-CTLENV.                              276500      
003016                                                                  276600      
003017030302-VERIFICA-ENVIO.                                            276800      
003018*======================                                           277000      
003019    ACCEPT  WKS-HR-MAQUINA             FROM TIME.                 277200      
003020                                                                  277400      
003021    MOVE WKS-HH-MAQUINA                TO WKS-HM-HH.              277600      
003022    MOVE WKS-MM-MAQUINA                TO WKS-HM-MM.              277800      
003023                                                                  278000      
003024   IF ((WKS-HM-MAQ-4D = WKS-HORA-CORTE(W77-IND-ENV)  OR           278200      
003025        WKS-HM-MAQ-4D > WKS-HORA-CORTE(W77-IND-ENV)) AND          278300      
003026                        W77-ENVIO-EXTNET = 0)                     278350      
003027        MOVE 1                         TO W77-ENVIO-EXTNET.       278400      
003028                                                                  278500      
003029   IF WKS-HORA-CORTE(W77-IND-ENV) = 9999                          278550      
003030      MOVE 1                           TO WKS-ARCH-GEN            278560      
003031   ELSE                                                           278580      
003032      PERFORM 020500-ABRE-ARCH-EXTNET.                            278600      
003033                                                                  279000      
003034                                                                  279600      
003035030318-LEE-CONTROL.                                               279800      
003036*===================                                              280000      
003037    OPEN I-O A03-CTL-ENVIO.                                       280200      
003038    READ A03-CTL-ENVIO.                                           280400      
003039    MOVE R01-REG-AUTS500              TO W77-AUT-ENVIO500.        280600      
003040    MOVE R01-REG-SECARCH              TO W77-SEC-ARCH.            280800      
003041    MOVE R01-REG-SECDET               TO W77-SEC-DET.             281000      
003042    MOVE R01-REG-SECDET-DOL           TO W77-SEC-DET-DOL.         281200      
003043    MOVE R01-REG-STATUS-FILE          TO W77-STATUS-FILE.         281202      
003044    MOVE R01-REG-IND-ARCH             TO W77-IND-ARCH.            281204      
003045    MOVE R01-REG-STATUS-FILE-D        TO W77-STATUS-FILE-D.       281206      
003046    MOVE R01-REG-IND-ARCH-D           TO W77-IND-ARCH-D.          281208      
003047    MOVE R01-REG-ABON-PES             TO WKS-NUM-ABON-PES.        281210      
003048    MOVE R01-REG-TOTAL-ABON-PES       TO WKS-NUM-TOTAL-ABON-PES.  281220      
003049    MOVE R01-REG-CARG-PES             TO WKS-NUM-CARG-PES.        281230      
003050    MOVE R01-REG-TOTAL-CARG-PES       TO WKS-NUM-TOTAL-CARG-PES.  281240      
003051    MOVE R01-REG-NO-CONT-PES          TO WKS-NUM-NO-CONT-PES.     281250      
003052    MOVE R01-REG-ABON-DOL             TO WKS-NUM-ABON-DOL.        281260      
003053    MOVE R01-REG-TOTAL-ABON-DOL       TO WKS-NUM-TOTAL-ABON-DOL.  281270      
003054    MOVE R01-REG-CARG-DOL             TO WKS-NUM-CARG-DOL.        281280      
003055    MOVE R01-REG-TOTAL-CARG-DOL       TO WKS-NUM-TOTAL-CARG-DOL.  281290      
003056    MOVE R01-REG-NO-CONT-DOL          TO WKS-NUM-NO-CONT-DOL.     281300      
003057    CLOSE A03-CTL-ENVIO WITH SAVE.                                281400      
003058                                                                  283200      
003059 020500-ABRE-ARCH-EXTNET.                                         283400      
003060*=======================                                          283600      
003061    MOVE WKS-FECHA-MAQ-8D              TO WKS-EXTNET-FECHA        283800      
003062                                          WKS-EXTNET-FECHA-D.     284000      
003063                                                                  284200      
003064    IF WKS-NUMCSI-HOST = 32 OR 10                                 284400      
003065       MOVE 10                         TO WKS-EXTNET-NODO         284600      
003066                                          WKS-EXTNET-NODO-D       284800      
003067    ELSE                                                          285000      
003068       MOVE WKS-NUMCSI-HOST            TO WKS-EXTNET-NODO         285200      
003069                                          WKS-EXTNET-NODO-D.      285400      
003070    MOVE W77-IND-ENV                   TO WKS-EXTNET-SECUENCIA    285600      
003071                                          WKS-EXTNET-SECUENCIA-D. 285800      
003072    MOVE "000000145886"                TO WKS-EXTNET-ARCHIVO.     286400      
003073    MOVE "000000145857"                TO WKS-EXTNET-ARCHIVO-D.   286600      
003074                                                                  286700      
003075    CHANGE ATTRIBUTE TITLE         OF A04-EXTNET-ARCHIVO          286800      
003076                                   TO WKS-TITLE-EXTNET-ARCHIVO.   287000      
003077    CHANGE ATTRIBUTE TITLE         OF A04-EXTNET-ARCHIVO-D        287200      
003078                                   TO WKS-TITLE-EXTNET-ARCHIVO-D. 287400      
003079                                                                  287500      
003080    IF ATTRIBUTE RESIDENT OF A04-EXTNET-ARCHIVO = VALUE TRUE      287600      
003081       OPEN EXTEND A04-EXTNET-ARCHIVO                             287650      
003082    ELSE                                                          287700      
003083       OPEN OUTPUT A04-EXTNET-ARCHIVO                             287800      
003084       PERFORM 020500-HEADER-EXTNET.                              287820      
003085                                                                  287840      
003086    IF ATTRIBUTE RESIDENT OF A04-EXTNET-ARCHIVO-D = VALUE TRUE    287860      
003087       OPEN EXTEND A04-EXTNET-ARCHIVO-D                           287880      
003088    ELSE                                                          287900      
003089       OPEN OUTPUT A04-EXTNET-ARCHIVO-D                           287920      
003090       PERFORM 020500-HEADER-EXTNET-D.                            287940      
003091                                                                  287942      
003092    PERFORM 400020-ACTUALIZA-IND-ARCH.                            287944      
003093                                                                  287946      
003094020500-ABRE-ARCH-EXTNET-ANT.                                      287948      
003095*===========================                                      287950      
003096    MOVE WKS-FECHA-MAQ-8D              TO WKS-EXTNET-FECHA.       287952      
003097                                                                  287960      
003098    IF WKS-NUMCSI-HOST = 32 OR 10                                 287965      
003099       MOVE 10                         TO WKS-EXTNET-NODO         287970      
003100    ELSE                                                          287980      
003101       MOVE WKS-NUMCSI-HOST            TO WKS-EXTNET-NODO.        287985      
003102    MOVE W77-IND-ARCH                   TO WKS-EXTNET-SECUENCIA.  287995      
003103    MOVE "000000145886"                TO WKS-EXTNET-ARCHIVO.     288005      
003104                                                                  288015      
003105    CHANGE ATTRIBUTE TITLE         OF A04-EXTNET-ARCHIVO          288020      
003106                                   TO WKS-TITLE-EXTNET-ARCHIVO.   288025      
003107                                                                  288040      
003108    IF ATTRIBUTE RESIDENT OF A04-EXTNET-ARCHIVO = VALUE TRUE      288045      
003109       OPEN EXTEND A04-EXTNET-ARCHIVO                             288050      
003110    ELSE                                                          288055      
003111       OPEN OUTPUT A04-EXTNET-ARCHIVO                             288060      
003112       PERFORM 020500-HEADER-EXTNET.                              288065      
003113                                                                  288066      
003114020500-ABRE-ARCH-EXTNET-D-ANT.                                    288067      
003115*===========================                                      288068      
003116    MOVE WKS-FECHA-MAQ-8D              TO WKS-EXTNET-FECHA-D.     288069      
003117                                                                  288070      
003118    IF WKS-NUMCSI-HOST = 32 OR 10                                 288071      
003119       MOVE 10                         TO WKS-EXTNET-NODO-D       288072      
003120    ELSE                                                          288073      
003121       MOVE WKS-NUMCSI-HOST            TO WKS-EXTNET-NODO-D.      288074      
003122    MOVE W77-IND-ARCH-D                TO WKS-EXTNET-SECUENCIA-D. 288075      
003123    MOVE "000000145857"                TO WKS-EXTNET-ARCHIVO-D.   288076      
003124                                                                  288077      
003125    CHANGE ATTRIBUTE TITLE         OF A04-EXTNET-ARCHIVO-D        288078      
003126                                   TO WKS-TITLE-EXTNET-ARCHIVO-D. 288079      
003127                                                                  288080      
003128    IF ATTRIBUTE RESIDENT OF A04-EXTNET-ARCHIVO-D = VALUE TRUE    288081      
003129       OPEN EXTEND A04-EXTNET-ARCHIVO-D                           288082      
003130    ELSE                                                          288083      
003131       OPEN OUTPUT A04-EXTNET-ARCHIVO-D                           288084      
003132       PERFORM 020500-HEADER-EXTNET-D.                            288085      
003133                                                                  288100      
003134020500-HEADER-EXTNET.                                             288200      
003135*====================                                             288400      
003136    MOVE WKS-NUMCSI-HOST               TO 500-R01-NODORI.         288600      
003137    MOVE WKS-FECHA-MAQ-6D              TO 500-R01-FECPROC.        288800      
003138    MOVE 000000145886                  TO 500-R01-SISCTE.         289000      
003139    MOVE W77-IND-ENV                   TO 500-R01-SECARC.         289400      
003140    MOVE "DEPOSITOS EN EFECTIVO CHEQUE"                           289600      
003141                                       TO 500-R01-DESCTESIS.      289800      
003142    WRITE A04-REG-EXTNET   FROM 500-R01-HDR-CLIENTESCITIC.        290000      
003143                                                                  290050      
003144020500-HEADER-EXTNET-D.                                           290100      
003145*====================                                             290150      
003146    MOVE WKS-NUMCSI-HOST               TO 500-R01-NODORI.         290200      
003147    MOVE WKS-FECHA-MAQ-6D              TO 500-R01-FECPROC.        290250      
003148    MOVE  000000145857                 TO 500-R01-SISCTE.         290300      
003149    MOVE W77-IND-ENV                   TO 500-R01-SECARC.         290350      
003150    MOVE "DEPOSITOS EN EFECTIVO CHEQUE"                           290400      
003151                                       TO 500-R01-DESCTESIS.      290450      
003152    WRITE A04-REG-EXTNET-D FROM 500-R01-HDR-CLIENTESCITIC.        290500      
003153                                                                  290600      
003154 020500-TRAILER-EXTNET.                                           290800      
003155*=====================                                            291000      
003156    MOVE WKS-NUM-ABON-PES              TO 500-R03-NUMABO.         291200      
003157    MOVE WKS-NUM-TOTAL-ABON-PES        TO 500-R03-TOTABO.         291400      
003158    MOVE WKS-NUM-CARG-PES              TO 500-R03-NUMCAR.         291600      
003159    MOVE WKS-NUM-TOTAL-CARG-PES        TO 500-R03-TOTCAR.         291800      
003160    MOVE WKS-NUM-NO-CONT-PES           TO 500-R03-NUMNCONT.       292000      
003161    WRITE A04-REG-EXTNET     FROM 500-R03-TRA-CLIENTESCITIC.      292200      
003162                                                                  292300      
003163 020500-TRAILER-EXTNET-D.                                         292400      
003164*=====================                                            292500      
003165    MOVE WKS-NUM-ABON-DOL              TO 500-R03-NUMABO.         292600      
003166    MOVE WKS-NUM-TOTAL-ABON-DOL        TO 500-R03-TOTABO.         292800      
003167    MOVE WKS-NUM-CARG-DOL              TO 500-R03-NUMCAR.         293000      
003168    MOVE WKS-NUM-TOTAL-CARG-DOL        TO 500-R03-TOTCAR.         293200      
003169    MOVE WKS-NUM-NO-CONT-DOL           TO 500-R03-NUMNCONT.       293400      
003170    WRITE A04-REG-EXTNET-D   FROM 500-R03-TRA-CLIENTESCITIC.      293600      
003171                                                                  293800      
003172 030705-ENVIO-POR-INTELAR.                                        294000      
003173*======================                                           294200      
003174* PARA ENVIAR EL ARCHIVO POR INTELAR SE REQUIERE QUE LA VARIABLE  294400      
003175* WKS-INTE-ARCHIVO CONTENGA EL NOMBRE DEL ARCHIVO A ENVIAR        294600      
003176*==============================================================   294800      
003177    CALL "INTELARSND IN ADMONXFERS" USING  WKS-INTE-ARCHIVO       295000      
003178                                    GIVING W77-INTE-SNT.          295200      
003179    IF W77-INTE-SNT NOT = 0                                       295400      
003180       MOVE "E"                       TO TIPO-LJ                  295600      
003181       MOVE 020901                    TO CODIGO-LJ                295800      
003182       STRING "ERROR EN EL ENVIO POR INTELAR DEL ARCHIVO "        296000      
003183              WKS-INTE-ARCHIVO                                    296200      
003184       DELIMITED BY SIZE                                          296400      
003185       INTO TEXTO-LJ                                              296600      
003186       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       296800      
003187                                                                  297000      
003188 030374-GENERA-ARCH-EXTNET.                                       297200      
003189*========================                                         297400      
003190    MOVE ZERO                          TO   W77-FIN-ARCH.         297600      
003191    MOVE W77-AUT-ENVIO500              TO   W77-NUMREG-MOV500.    297800      
003192    ADD 1                              TO   W77-NUMREG-MOV500.    298000      
003193    OPEN INPUT A01-MOVS500.                                       298200      
003194    SEEK A01-MOVS500 RECORD.                                      299000      
003195    READ A01-MOVS500                   INTO A00-R01-REGMOV AT END 299200      
003196                                       MOVE 1 TO W77-FIN-ARCH.    299400      
003197    IF A00-R01-FUNCION = 99                                       299600      
003198       MOVE 1                          TO  W77-FIN-ARCH.          299800      
003199                                                                  299850      
003200    OPEN INPUT A02-DESS500.                                       299900      
003201    OPEN I-O A05-AUTORIZACIONES.                                  299950      
003202                                                                  300000      
003203    PERFORM 030373-SELECCIONA-EXTNET    UNTIL W77-FIN-ARCH = 1.   300200      
003204    IF W88-ENVIO-EXTNET                                           300400      
003205       PERFORM 020500-TRAILER-EXTNET                              300600      
003206       PERFORM 020500-TRAILER-EXTNET-D                            300700      
003207       ADD 1                           TO W77-IND-ENV.            300800      
003208                                                                  301000      
003209    PERFORM 030350-ACTUALIZA-CONTROL.                             301200      
003210    MOVE ZERO                          TO W77-AUT-ENVIO500.       301400      
003211                                                                  301500      
003212    CLOSE A01-MOVS500                  WITH RELEASE.              301600      
003213    CLOSE A02-DESS500.                                            301800      
003214    CLOSE A04-EXTNET-ARCHIVO           WITH SAVE.                 301850      
003215    CLOSE A04-EXTNET-ARCHIVO-D         WITH SAVE.                 301900      
003216    CLOSE A05-AUTORIZACIONES           WITH SAVE.                 302000      
003217                                                                  302200      
003218  030350-ACTUALIZA-CONTROL.                                       302400      
003219*=========================                                        302600      
003220    OPEN I-O A03-CTL-ENVIO.                                       302800      
003221    MOVE 1                             TO W77-NUMREG-ACC.         303000      
003222    SEEK A03-CTL-ENVIO RECORD.                                    303200      
003223    READ A03-CTL-ENVIO.                                           303400      
003224    MOVE W77-AUT-ENVIO500              TO R01-REG-AUTS500.        303600      
003225    MOVE WKS-EXTNET-SECUENCIA          TO R01-REG-SECARCH.        303800      
003226    MOVE W77-SEC-DET                   TO R01-REG-SECDET.         304000      
003227    MOVE W77-SEC-DET-DOL               TO R01-REG-SECDET-DOL.     304200      
003228    MOVE W77-IND-ENV                   TO R01-REG-IND-ENV.        304400      
003229    MOVE WKS-NUM-ABON-PES              TO R01-REG-ABON-PES.       304410      
003230    MOVE WKS-NUM-TOTAL-ABON-PES        TO R01-REG-TOTAL-ABON-PES. 304420      
003231    MOVE WKS-NUM-CARG-PES              TO R01-REG-CARG-PES.       304430      
003232    MOVE WKS-NUM-TOTAL-CARG-PES        TO R01-REG-TOTAL-CARG-PES. 304440      
003233    MOVE WKS-NUM-NO-CONT-PES           TO R01-REG-NO-CONT-PES.    304450      
003234    MOVE WKS-NUM-ABON-DOL              TO R01-REG-ABON-DOL.       304460      
003235    MOVE WKS-NUM-TOTAL-ABON-DOL        TO R01-REG-TOTAL-ABON-DOL. 304470      
003236    MOVE WKS-NUM-CARG-DOL              TO R01-REG-CARG-DOL.       304480      
003237    MOVE WKS-NUM-TOTAL-CARG-DOL        TO R01-REG-TOTAL-CARG-DOL. 304490      
003238    MOVE WKS-NUM-NO-CONT-DOL           TO R01-REG-NO-CONT-DOL.    304500      
003239    MOVE  1                            TO W77-STATUS-FILE.        304520      
003240    MOVE  W77-STATUS-FILE              TO R01-REG-STATUS-FILE.    304540      
003241    MOVE  1                            TO W77-STATUS-FILE-D.      304560      
003242    MOVE  W77-STATUS-FILE-D            TO R01-REG-STATUS-FILE-D.  304580      
003243    REWRITE R01-REG-ENVIO              INVALID KEY NEXT SENTENCE. 304600      
003244    CLOSE A03-CTL-ENVIO WITH SAVE.                                304800      
003245                                                                  304810      
003246400020-ACTUALIZA-IND-ARCH.                                        304820      
003247*=========================                                        304830      
003248    OPEN I-O A03-CTL-ENVIO.                                       304840      
003249    MOVE W77-IND-ENV TO W77-IND-ARCH                              304850      
003250                        W77-IND-ARCH-D.                           304855      
003251    SEEK A03-CTL-ENVIO RECORD.                                    304860      
003252    READ A03-CTL-ENVIO.                                           304870      
003253    MOVE W77-IND-ARCH               TO R01-REG-IND-ARCH.          304880      
003254    MOVE W77-IND-ARCH-D             TO R01-REG-IND-ARCH-D.        304890      
003255    REWRITE R01-REG-ENVIO              INVALID KEY NEXT SENTENCE. 304900      
003256    CLOSE A03-CTL-ENVIO WITH SAVE.                                304910      
003257                                                                  305000      
003258 030373-SELECCIONA-EXTNET.                                        305200      
003259*========================                                         305400      
003260    ADD 1                              TO W77-AUT-ENVIO500.       305600      
003261    MOVE ZEROES                        TO WKS-IND-EXTNET.         305700      
003262                                                                  305820      
003263    IF A00-R01-FORMATO = 2 AND A00-R01-FUNCION = 1                306000      
003264       AND A00-R01-APUDES > 0                                     306020      
003265       MOVE 0 TO W77-LEE                                          306050      
003266                 W77-VECES                                        306100      
003267                 W77-LIMITE                                       306150      
003268       PERFORM 030376-LEE-DATOS-ADIC UNTIL W77-VECES = 6          306200      
003269                                                                  306220      
003270       IF A01-R01-APUDES > 0 AND A00-R01-APUDES > 0               306240      
003271          MOVE 0 TO W77-LEE                                       306260      
003272                    W77-VECES                                     306270      
003273                     W77-LIMITE                                   306275      
003274          PERFORM 030376-LEE-DATOS-ADIC2 UNTIL W77-VECES = 6      306280      
003275          MOVE A01-R02-IND-EXTNET TO WKS-IND-EXTNET.              306300      
003276                                                                  306400      
003277    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 1              306600      
003278       AND (A00-R01-STATUS = 1 OR 2 OR 3 OR 4)                    306800      
003279       AND (A00-R01-ORIGEN = 1 OR 3)                              307000      
003280       AND (A00-R01-FORMATO = 2)                                  307050      
003281       AND WKS-IND-EXTNET = 3                                     307100      
003282          PERFORM 400023-GENERA-MOV-AUTORIZA                      307200      
003283          PERFORM 400040-MUEVE-DATOS-EXTNET VARYING W77-IND FROM 1307400      
003284          BY 1 UNTIL W77-IND >1 OR A00-R01-CVETRAN (W77-IND)=0    307600      
003285    ELSE                                                          308000      
003286    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 2              308200      
003287          MOVE A00-R01-AUT-AELIM-S151     TO WKS-AUTORIZA-151-KEY 308600      
003288          PERFORM 400050-VALIDACION-ELIM-EXTNET                   308800      
003289          PERFORM 400040-ELIM-EXTNET                              309000      
003290    ELSE                                                          309200      
003291    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 21             309400      
003292       PERFORM 500010-ELIMINA-POR-PROCESO                         309600      
003293    ELSE                                                          309800      
003294    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 22             310000      
003295       PERFORM 500030-ELIMINA-POR-PROCESO-AUT                     310200      
003296    ELSE                                                          310400      
003297       NEXT SENTENCE.                                             310600      
003298                                                                  310800      
003299    READ A01-MOVS500 INTO A00-R01-REGMOV                          311000      
003300                     AT END MOVE 1     TO W77-FIN-ARCH.           311200      
003301                                                                  311400      
003302    IF A00-R01-FUNCION = 99                                       311600      
003303       MOVE 1                          TO W77-FIN-ARCH.           311800      
003304                                                                  312000      
003305 400040-ELIM-EXTNET.                                              312200      
003306*====================                                             312300      
003307    IF A00-R01-SISTEMA = 500 AND A00-R01-FUNCION = 2              312400      
003308    AND W88-EXISTE-MOV-EXT                                        312600      
003309       PERFORM 400040-MUEVE-DATOS-ELIM-EXTNET                     312800      
003310                     VARYING W77-IND FROM 1 BY 1                  313000      
003311                     UNTIL   W77-IND >1                           313200      
003312                     OR      WKS-REG-CVETRAN (W77-IND)=0          313400      
003313                                                                  313600      
003314       PERFORM 400030-ACTUALIZA-STATUS                            313800      
003315                                                                  314000      
003316       IF WKS-REG-AUTANTS151 > 0                                  314200      
003317          PERFORM 400020-ELIMINA-AUT-ANTERIORES UNTIL             314400      
003318                                    WKS-REG-AUTANTS151 = 0.       314600      
003319                                                                  314800      
003320 400030-ACTUALIZA-STATUS.                                         315000      
003321*==========================                                       315100      
003322   IF A00-R01-FUNCION = 2                                         315200      
003323      MOVE 2         TO  R01-REG-STATUS                           315400      
003324   ELSE IF A00-R01-FUNCION = 21                                   315600      
003325      MOVE 3         TO  R01-REG-STATUS                           315800      
003326   ELSE IF A00-R01-FUNCION = 22                                   316000      
003327      MOVE 4         TO  R01-REG-STATUS.                          316200      
003328                                                                  316400      
003329   REWRITE R01-REG-AUTORIZA.                                      316600      
003330                                                                  316800      
003331 400020-ELIMINA-AUT-ANTERIORES.                                   317000      
003332*==============================                                   317100      
003333    MOVE WKS-REG-AUTANTS151      TO WKS-AUTORIZA-151-KEY.         317200      
003334    PERFORM 400050-VALIDACION-ELIM-EXTNET.                        317400      
003335                                                                  317600      
003336    IF W88-EXISTE-MOV-EXT                                         317800      
003337       PERFORM 400040-MUEVE-DATOS-ELIM-EXTNET                     318000      
003338                  VARYING W77-IND FROM 1 BY 1                     318200      
003339                  UNTIL   W77-IND >1                              318400      
003340                  OR      WKS-REG-CVETRAN (W77-IND)=0             318600      
003341                                                                  318800      
003342       PERFORM 400030-ACTUALIZA-STATUS.                           319000      
003343                                                                  319200      
003344 500010-ELIMINA-POR-PROCESO.                                      319400      
003345*==============================                                   319450      
003346   MOVE 0 TO W77-EOF.                                             319500      
003347   CLOSE A05-AUTORIZACIONES WITH SAVE.                            319600      
003348   OPEN I-O A05-AUTORIZACIONES.                                   319800      
003349                                                                  320000      
003350   PERFORM 500020-BARRE-AUT-TP UNTIL W77-EOF = 1.                 320200      
003351                                                                  320400      
003352 500020-BARRE-AUT-TP.                                             320600      
003353*==============================                                   320700      
003354   READ A05-AUTORIZACIONES NEXT RECORD                            320800      
003355         AT END                                                   321000      
003356            MOVE 1 TO W77-EOF                                     321200      
003357            EXIT PERFORM.                                         321400      
003358                                                                  321600      
003359   IF R01-REG-TIP-PROC = A00-R01-TIPO-PROC                        321800      
003360      IF R01-REG-STATUS = 1                                       322000      
003361         PERFORM 400053-MUEVE-AUTORIZA-TRABAJO                    322200      
003362         PERFORM 400040-MUEVE-DATOS-ELIM-EXTNET                   322400      
003363                  VARYING W77-IND FROM 1 BY 1                     322600      
003364                  UNTIL   W77-IND >1                              322800      
003365                  OR      WKS-REG-CVETRAN (W77-IND)=0             323000      
003366         PERFORM 400030-ACTUALIZA-STATUS                          323100      
003367      ELSE                                                        323200      
003368         NEXT SENTENCE                                            323400      
003369   ELSE                                                           323600      
003370      NEXT SENTENCE.                                              323800      
003371                                                                  324000      
003372 500030-ELIMINA-POR-PROCESO-AUT.                                  324200      
003373   MOVE 0 TO W77-EOF.                                             324220      
003374                                                                  324350      
003375   MOVE A00-R01-AUT-AELIM-S151  TO  R01-REG-AUTS500EXT            324400      
003376   START A05-AUTORIZACIONES KEY > KEY-AUTS151                     324600      
003377         INVALID KEY                                              324800      
003378            MOVE 1   TO W77-EOF.                                  325000      
003379                                                                  325200      
003380   PERFORM 500020-BARRE-AUT-TP UNTIL W77-EOF = 1.                 325400      
003381                                                                  325600      
003382 400040-MUEVE-DATOS-EXTNET.                                       325800      
003383*=========================                                        326000      
003384     MOVE ZEROS                       TO W77-AFC.                 326200      
003385                                                                  326340      
003386     IF A00-R01-CVETRAN(W77-IND) > 0 AND                          326400      
003387        A00-R01-CVETRAN(W77-IND) < 5001                           326600      
003388         MOVE WKS-CAT6-AFC(A00-R01-CVETRAN(W77-IND))  TO W77-AFC. 326800      
003389                                                                  326850      
003390     IF A00-R01-CVETRAN(W77-IND) = 1009                           326900      
003391        MOVE 2                        TO W77-AFC.                 326950      
003392                                                                  327000      
003393     IF A00-R01-MONEDA = 1 OR 5                                   327200      
003394        MOVE WKS-CAT1823-ENVIOCA(A00-R01-CVETRAN(W77-IND)) TO     327400      
003395                                                W77-ENVIO-CAMELIA 327600      
003396        IF W77-ENVIO-CAMELIA = 2                                  327800      
003397           MOVE  WKS-CAT1823-CLVTRAN(A00-R01-CVETRAN(W77-IND)) TO 328000      
003398                                                W77-CVE-TRANSFORMA328200      
003399           IF W77-CVE-TRANSFORMA = 2                              328400      
003400              IF W77-AFC = 1                                      328600      
003401                 MOVE WKS-CAT1823-CLVTRAC                         328800      
003402                      (A00-R01-CVETRAN(W77-IND)) TO W77-CVE-CARGO 329000      
003403                 MOVE W77-CVE-CARGO              TO 500-R02-CVETRA329200      
003404                 PERFORM 400022-CARGA-DATOS-EXTNET                329400      
003405              ELSE                                                329600      
003406                 IF W77-AFC = 2 OR 9                              329800      
003407                    MOVE WKS-CAT1823-CLVTRAA                      330000      
003408                       (A00-R01-CVETRAN(W77-IND)) TO W77-CVE-ABONO330200      
003409                    MOVE W77-CVE-ABONO           TO 500-R02-CVETRA330400      
003410                    PERFORM 400022-CARGA-DATOS-EXTNET             330600      
003411                 ELSE                                             330800      
003412                    MOVE A00-R01-CVETRAN(W77-IND)                 331000      
003413                                                 TO 500-R02-CVETRA331200      
003414                    PERFORM 400022-CARGA-DATOS-EXTNET             331400      
003415           ELSE                                                   331600      
003416              MOVE A00-R01-CVETRAN(W77-IND)    TO 500-R02-CVETRA  331800      
003417              PERFORM 400022-CARGA-DATOS-EXTNET                   332000      
003418        ELSE                                                      332200      
003419           NEXT SENTENCE                                          332400      
003420     ELSE                                                         332600      
003421         NEXT SENTENCE.                                           332700      
003422                                                                  333000      
003423 400040-MUEVE-DATOS-ELIM-EXTNET.                                  333200      
003424*===============================                                  333400      
003425     MOVE ZEROS                       TO W77-AFC.                 333600      
003426                                                                  333800      
003427*     IF WKS-REG-CVETRAN (W77-IND) > 0 AND                        334000      
003428*        WKS-REG-CVETRAN (W77-IND) < 5001                         334200      
003429*          MOVE WKS-CAT6-AFC(WKS-REG-CVETRAN(W77-IND)) TO W77-AFC.334400      
003430                                                                  334600      
003431     IF WKS-REG-500MONEDA = 1 OR 5                                334800      
003432        MOVE WKS-CAT1823-ENVIOCA(WKS-REG-CVETRAN(W77-IND)) TO     335000      
003433                                                W77-ENVIO-CAMELIA 335200      
003434        IF W77-ENVIO-CAMELIA = 2                                  335210      
003435*           IF W77-AFC = 1                                        335220      
003436*              MOVE WKS-CAT1823-CLVTRAA                           335230      
003437*                   (WKS-REG-CVETRAN(W77-IND)) TO W77-CVE-ABONO   335240      
003438              MOVE 534                        TO 500-R02-CVETRAE  335250      
003439              MOVE 9                          TO W77-AFC          335260      
003440              PERFORM 400022-CARGA-DATOS-EXTNET-ELIM              335270      
003441*           ELSE                                                  335280      
003442*              IF W77-AFC = 2                                     335290      
003443*                 MOVE WKS-CAT1823-CLVTRAC                        335300      
003444*                      (WKS-REG-CVETRAN(W77-IND)) TO W77-CVE-CARGO335310      
003445*                MOVE W77-CVE-CARGO              TO 500-R02-CVETRA335320      
003446*                 MOVE 1                          TO W77-AFC      335330      
003447*                 PERFORM 400022-CARGA-DATOS-EXTNET-ELIM          335340      
003448*              ELSE                                               335350      
003449*                 MOVE WKS-CAT1823-CLVTRAC                        335360      
003450*                (WKS-REG-CVETRAN(W77-IND))      TO 500-R02-CVETRA335370      
003451*                 MOVE WKS-CAT6-AFC(500-R02-CVETRA) TO W77-AFC    335380      
003452*                 PERFORM 400022-CARGA-DATOS-EXTNET-ELIM          335400      
003453        ELSE                                                      339200      
003454           NEXT SENTENCE                                          339400      
003455     ELSE                                                         339600      
003456        NEXT SENTENCE.                                            339800      
003457                                                                  340000      
003458 400050-VALIDACION-ELIM-EXTNET.                                   340200      
003459*===================================                              340400      
003460                                                                  340560      
003461    MOVE 0                           TO W77-EXISTE-ELI-EXT.       340600      
003462    MOVE ZEROS                       TO WKS-REG-AUTS500EXT        340800      
003463                                        WKS-REG-AUTAELIM          341000      
003464                                        WKS-REG-AUTANTS151        341200      
003465                                        WKS-REG-TIP-PROC          341400      
003466                                        WKS-REG-DATOS-TR          341600      
003467                                        WKS-REG-500TIPMDA         341800      
003468                                        WKS-REG-500MEDACC         342000      
003469                                        WKS-REG-500MONEDA         342200      
003470                                        WKS-REG-500REFNUM         342400      
003471                                        WKS-REG-500NUMAUTORIZA    342600      
003472                                        WKS-REG-500NUMSUCOPE      342800      
003473                                        WKS-REG-500NUMCAJOPE      343000      
003474                                        WKS-REG-500NUMSUCTRA      343200      
003475                                        WKS-REG-500NUMCAJTRA      343400      
003476                                        WKS-REG-HORAMOV           343600      
003477                                        WKS-REG-STATUS.           343800      
003478    MOVE SPACES                      TO WKS-REG-500LEYENDA-1      344000      
003479                                        WKS-REG-500LEYENDA-2      344200      
003480                                        WKS-REG-500LEYENDA-3      344400      
003481                                        WKS-REG-500LEYENDA-4      344600      
003482                                        WKS-REG-500LEYENDA-5      344800      
003483                                        WKS-REG-500REFADIC1       345000      
003484                                        WKS-REG-500REFADIC2       345200      
003485                                        WKS-REG-500REFADIC3.      345400      
003486                                                                  345600      
003487    PERFORM 400050-LEE-AUTORIZA.                                  345800      
003488                                                                  346000      
003489    IF W88-EXISTE-MOV-EXT                                         346200      
003490       PERFORM 400053-MUEVE-AUTORIZA-TRABAJO.                     346400      
003491                                                                  346800      
003492 400053-MUEVE-AUTORIZA-TRABAJO.                                   347000      
003493    MOVE R01-REG-AUTS500EXT          TO WKS-REG-AUTS500EXT        347200      
003494    MOVE R01-REG-AUTAELIM            TO WKS-REG-AUTAELIM          347400      
003495    MOVE R01-REG-AUTANTS151          TO WKS-REG-AUTANTS151        347600      
003496    MOVE R01-REG-TIP-PROC            TO WKS-REG-TIP-PROC          347800      
003497    PERFORM 400051-MUEVE-CLAVES-ORIGINALES VARYING W77-IND        348000      
003498         FROM  1 BY 1 UNTIL  W77-IND > 1                          348200      
003499    MOVE R01-REG-500TIPMDA           TO WKS-REG-500TIPMDA         348400      
003500    MOVE R01-REG-500MEDACC           TO WKS-REG-500MEDACC         348600      
003501    MOVE R01-REG-500MONEDA           TO WKS-REG-500MONEDA         348800      
003502    MOVE R01-REG-500REFNUM           TO WKS-REG-500REFNUM         349000      
003503                                                                  349200      
003504    MOVE R01-REG-500LEYENDA-1        TO WKS-REG-500LEYENDA-1      349400      
003505    MOVE R01-REG-500LEYENDA-2        TO WKS-REG-500LEYENDA-2      349600      
003506    MOVE R01-REG-500LEYENDA-3        TO WKS-REG-500LEYENDA-3      349800      
003507    MOVE R01-REG-500LEYENDA-4        TO WKS-REG-500LEYENDA-4      350000      
003508    MOVE R01-REG-500LEYENDA-5        TO WKS-REG-500LEYENDA-5      350200      
003509                                                                  350400      
003510    MOVE R01-REG-500REFADIC1         TO WKS-REG-500REFADIC1       350600      
003511    MOVE R01-REG-500REFADIC2         TO WKS-REG-500REFADIC2       350800      
003512    MOVE R01-REG-500REFADIC3         TO WKS-REG-500REFADIC3       351000      
003513    MOVE R01-REG-500NUMAUTORIZA      TO WKS-REG-500NUMAUTORIZA    351200      
003514    MOVE R01-REG-500NUMSUCOPE        TO WKS-REG-500NUMSUCOPE      351400      
003515    MOVE R01-REG-500NUMCAJOPE        TO WKS-REG-500NUMCAJOPE      351600      
003516    MOVE R01-REG-500NUMSUCTRA        TO WKS-REG-500NUMSUCTRA      351800      
003517    MOVE R01-REG-500NUMCAJTRA        TO WKS-REG-500NUMCAJTRA      352000      
003518    MOVE R01-REG-HORMOV              TO WKS-REG-HORAMOV           352200      
003519    MOVE R01-REG-STATUS              TO WKS-REG-STATUS.           352400      
003520                                                                  352600      
003521 400051-MUEVE-CLAVES-ORIGINALES.                                  352800      
003522   MOVE R01-REG-CVETRAN(W77-IND)   TO WKS-REG-CVETRAN(W77-IND).   353000      
003523   MOVE R01-REG-500INDLEY(W77-IND) TO WKS-REG-500INDLEY(W77-IND). 353200      
003524   MOVE R01-REG-IMPORTE(W77-IND)   TO WKS-REG-IMPORTE(W77-IND).   353400      
003525                                                                  353600      
003526 400050-LEE-AUTORIZA.                                             353800      
003527*==========================                                       353900      
003528   MOVE WKS-AUTORIZA-151-KEY          TO R01-REG-AUTS500EXT       354000      
003529   READ A05-AUTORIZACIONES                                        354200      
003530         INVALID KEY                                              354400      
003531           MOVE 0 TO W77-EXISTE-ELI-EXT                           354600      
003532           EXIT PERFORM.                                          354800      
003533                                                                  355000      
003534   MOVE 1 TO W77-EXISTE-ELI-EXT.                                  355200      
003535                                                                  358800      
003536 400050-MUEVE-MED-ACC.                                            359000      
003537*==========================                                       359200      
003538    IF A00-R01-CVEMDA = 0                                         359400      
003539       MOVE A00-R01-SUCPROM          TO WKS-REG-500PREFSUC        359600      
003540       MOVE A00-R01-CONTRATO         TO WKS-REG-500CTOCTA         359800      
003541    ELSE                                                          360000      
003542    IF A00-R01-CVEMDA = 1                                         360200      
003543       MOVE A00-R01-MDA-SUC          TO WKS-REG-500PREFSUC        360400      
003544       MOVE A00-R01-MDA-CTA          TO WKS-REG-500CTOCTA         360600      
003545    ELSE                                                          360800      
003546    IF A00-R01-CVEMDA = 2                                         361000      
003547       MOVE A00-R01-MDA-CTA          TO WKS-REG-500MEDACC.        361200      
003548                                                                  361250      
003549 400021-LIMPIA-CTLENV.                                            361300      
003550*=========================                                        361350      
003551    OPEN I-O A03-CTL-ENVIO.                                       361355      
003552    SEEK A03-CTL-ENVIO RECORD.                                    361360      
003553    READ A03-CTL-ENVIO.                                           361365      
003554    MOVE 0                           TO W77-STATUS-FILE.          361370      
003555    MOVE W77-STATUS-FILE             TO R01-REG-STATUS-FILE.      361375      
003556    MOVE 0                           TO W77-STATUS-FILE-D.        361380      
003557    MOVE W77-STATUS-FILE-D           TO R01-REG-STATUS-FILE-D.    361390      
003558    MOVE 0                           TO R01-REG-ABON-PES          361400      
003559                                        R01-REG-TOTAL-ABON-PES    361450      
003560                                        R01-REG-CARG-PES          361500      
003561                                        R01-REG-TOTAL-CARG-PES    361550      
003562                                        R01-REG-NO-CONT-PES       361600      
003563                                        R01-REG-ABON-DOL          361650      
003564                                        R01-REG-TOTAL-ABON-DOL    361700      
003565                                        R01-REG-CARG-DOL          361750      
003566                                        R01-REG-TOTAL-CARG-DOL    361800      
003567                                        R01-REG-NO-CONT-DOL.      361850      
003568    REWRITE R01-REG-ENVIO             INVALID KEY NEXT SENTENCE.  361900      
003569    CLOSE A03-CTL-ENVIO WITH SAVE.                                362000      
003570                                                                  362200      
003571 400021-LIMPIA-TRAILER.                                           362400      
003572*=========================                                        362600      
003573    MOVE ZEROS                       TO 500-R03-NUMABO            362800      
003574                                        500-R03-TOTABO            363000      
003575                                        500-R03-NUMCAR            363200      
003576                                        500-R03-TOTCAR            363400      
003577                                        500-R03-NUMNCONT          363600      
003578                                        WKS-NUM-ABON-PES          363800      
003579                                        WKS-NUM-TOTAL-ABON-PES    364000      
003580                                        WKS-NUM-CARG-PES          364200      
003581                                        WKS-NUM-TOTAL-CARG-PES    364400      
003582                                        WKS-NUM-NO-CONT-PES       364600      
003583                                        WKS-NUM-ABON-DOL          364800      
003584                                        WKS-NUM-TOTAL-ABON-DOL    365000      
003585                                        WKS-NUM-CARG-DOL          365200      
003586                                        WKS-NUM-TOTAL-CARG-DOL    365400      
003587                                        WKS-NUM-NO-CONT-DOL.      365600      
003588                                                                  365700      
003589400021-LIMPIA-VARIABLES.                                          365800      
003590*=========================                                        365900      
003591    MOVE ZEROS                       TO 500-R02-SECDET            366000      
003592                                        500-R02-NUMSUC            366100      
003593                                        500-R02-NUMCAJ            366200      
003594                                        500-R02-NUMAUT            366300      
003595                                        500-R02-TIPMOV            366400      
003596                                        500-R02-TIPMDA            366500      
003597                                        500-R02-MEDACC            366600      
003598                                        500-R02-PREFSUC           366700      
003599                                        500-R02-CTOCTA            366800      
003600                                        500-R02-IMPTRAN           366900      
003601                                        500-R02-MONEDA            367000      
003602                                        500-R02-REFNUM            367100      
003603                                        500-R02-INDLEY            367110      
003604                                        WKS-IMPTRANAGRP           367120      
003605                                        500-R02-IMPTRANAGRP(1)    367140      
003606                                        500-R02-IMPTRANAGRP(2)    367160      
003607                                        500-R02-IMPTRANAGRP(3)    367180      
003608                                        500-R02-IMPTRANAGRP(4).   367200      
003609    MOVE SPACES                      TO 500-R02-LEYENDA           367300      
003610                                        500-R02-REFADIC1          367400      
003611                                        500-R02-REFADIC2          367500      
003612                                        500-R02-REFADIC3          367600      
003613                                        500-R02-AGRP500(1)        367800      
003614                                        500-R02-AGRP500(2)        368000      
003615                                        500-R02-AGRP500(3)        368200      
003616                                        500-R02-AGRP500(4).       368400      
003617                                                                  369620      
003618 400023-GENERA-MOV-AUTORIZA.                                      369622      
003619    PERFORM 400024-LIMPIA-CAMPOS-AUT.                             369624      
003620                                                                  369626      
003621    MOVE A00-R01-AUT-S151         TO R01-REG-AUTS500EXT           369628      
003622    MOVE A00-R01-AUT-AELIM-S151   TO R01-REG-AUTAELIM             369630      
003623    MOVE A00-R01-AUT-ANT-S151     TO R01-REG-AUTANTS151           369632      
003624    MOVE A00-R01-TIPO-PROC        TO R01-REG-TIP-PROC             369634      
003625                                                                  369635      
003626    PERFORM 400025-LLENA-CLAVES VARYING W77-IND FROM 1 BY 1       369640      
003627                                UNTIL W77-IND > 1                 369645      
003628                                OR A00-R01-CVETRAN (W77-IND)=0.   369650      
003629                                                                  369655      
003630    MOVE A00-R01-CVEMDA           TO R01-REG-500TIPMDA            369660      
003631    PERFORM 400050-MUEVE-MED-ACC                                  369665      
003632    MOVE WKS-REG-500MEDACC        TO R01-REG-500MEDACC            369670      
003633    MOVE A00-R01-MONEDA           TO R01-REG-500MONEDA            369675      
003634    MOVE A00-R01-REFNUM           TO R01-REG-500REFNUM            369680      
003635                                                                  369685      
003636    MOVE A01-R01-LEY1             TO R01-REG-500LEYENDA-1         369686      
003637    MOVE A01-R02-LEY2             TO R01-REG-500LEYENDA-2         369688      
003638    MOVE A01-R02-LEY3             TO R01-REG-500LEYENDA-3         369690      
003639    MOVE A01-R02-LEY4             TO R01-REG-500LEYENDA-4         369692      
003640    MOVE A01-R02-LEY5             TO R01-REG-500LEYENDA-5.        369694      
003641                                                                  369696      
003642    MOVE A01-R01-REFERENCIA1      TO R01-REG-500REFADIC1          369698      
003643    MOVE A01-R01-REF2-CTE         TO R01-REG-500REFADIC2          369700      
003644    MOVE A01-R01-REF3-CTE         TO R01-REG-500REFADIC3          369702      
003645    MOVE A00-R01-AUTORIZA         TO R01-REG-500NUMAUTORIZA       369705      
003646    MOVE A00-R01-SUCOPER          TO R01-REG-500NUMSUCOPE         369710      
003647    MOVE A00-R01-CAJAOPER         TO R01-REG-500NUMCAJOPE         369715      
003648    MOVE A00-R01-SUCTRAN          TO R01-REG-500NUMSUCTRA         369720      
003649    MOVE A00-R01-CAJATRAN         TO R01-REG-500NUMCAJTRA         369725      
003650    MOVE A00-R01-HORMOV           TO R01-REG-HORMOV               369730      
003651    MOVE 1                        TO R01-REG-STATUS.              369735      
003652    WRITE R01-REG-AUTORIZA.                                       369745      
003653                                                                  369746      
003654 400025-LLENA-CLAVES.                                             369750      
003655    MOVE A00-R01-CVETRAN(W77-IND)TO R01-REG-CVETRAN(W77-IND)      369752      
003656    MOVE A00-R01-INDLEY(W77-IND) TO R01-REG-500INDLEY (W77-IND)   369754      
003657    MOVE A00-R01-IMPORTE(W77-IND)TO R01-REG-IMPORTE(W77-IND) .    369756      
003658                                                                  369758      
003659 400024-LIMPIA-CAMPOS-AUT.                                        369760      
003660   MOVE ZEROES                   TO R01-REG-AUTS500EXT            369762      
003661                                    R01-REG-AUTAELIM              369765      
003662                                    R01-REG-AUTANTS151            369770      
003663                                    R01-REG-TIP-PROC              369775      
003664                                    R01-REG-CVETRAN(1)            369780      
003665                                    R01-REG-500INDLEY(1)          369782      
003666                                    R01-REG-IMPORTE(1)            369784      
003667                                    R01-REG-CVETRAN(2)            369786      
003668                                    R01-REG-500INDLEY(2)          369788      
003669                                    R01-REG-IMPORTE(2)            369790      
003670                                    R01-REG-CVETRAN(3)            369792      
003671                                    R01-REG-500INDLEY(3)          369794      
003672                                    R01-REG-IMPORTE(3)            369796      
003673                                    R01-REG-CVETRAN(4)            369798      
003674                                    R01-REG-500INDLEY(4)          369800      
003675                                    R01-REG-IMPORTE(4)            369802      
003676                                    R01-REG-CVETRAN(5)            369804      
003677                                    R01-REG-500INDLEY(5)          369806      
003678                                    R01-REG-IMPORTE(5)            369808      
003679                                    R01-REG-500TIPMDA             369810      
003680                                    R01-REG-500MEDACC             369812      
003681                                    R01-REG-500REFNUM             369815      
003682                                    R01-REG-500NUMAUTORIZA        369820      
003683                                    R01-REG-500NUMSUCOPE          369825      
003684                                    R01-REG-500NUMCAJOPE          369830      
003685                                    R01-REG-500NUMSUCTRA          369835      
003686                                    R01-REG-500NUMCAJTRA          369840      
003687                                    R01-REG-HORMOV                369845      
003688                                    R01-REG-STATUS.               369850      
003689                                                                  369855      
003690  MOVE SPACES                    TO R01-REG-500LEYENDA-1          369860      
003691                                    R01-REG-500LEYENDA-2          369865      
003692                                    R01-REG-500LEYENDA-3          369870      
003693                                    R01-REG-500LEYENDA-4          369875      
003694                                    R01-REG-500LEYENDA-5          369880      
003695                                    R01-REG-500REFADIC1           369885      
003696                                    R01-REG-500REFADIC2           369890      
003697                                    R01-REG-500REFADIC3.          369895      
003698                                                                  369900      
003699 400022-CARGA-DATOS-EXTNET.                                       370000      
003700*========================                                         370200      
003701    PERFORM 400021-LIMPIA-VARIABLES.                              370400      
003702                                                                  376000      
003703*    ADD 1                            TO W77-SEC-DET.             376200      
003704                                                                  376400      
003705    MOVE A00-R01-AUT-S151            TO 500-R02-SECDET            376600      
003706                                        500-R02-NUMAUT.           376800      
003707    MOVE 4000                        TO 500-R02-NUMSUC.           377000      
003708                                                                  377100      
003709    IF WKS-NUMCSI-HOST = 32 OR 10                                 377200      
003710       MOVE 01                       TO 500-R02-NUMCAJ            377400      
003711    ELSE                                                          377600      
003712       MOVE 02                       TO 500-R02-NUMCAJ.           377800      
003713                                                                  377900      
003714    MOVE W77-AFC                     TO 500-R02-TIPMOV.           378000      
003715    MOVE A00-R01-CVEMDA              TO 500-R02-TIPMDA.           378200      
003716                                                                  378300      
003717    IF A00-R01-CVEMDA = 0                                         378400      
003718       MOVE A00-R01-SUCPROM          TO 500-R02-PREFSUC           378600      
003719       MOVE A00-R01-CONTRATO         TO 500-R02-CTOCTA            378800      
003720    ELSE                                                          379000      
003721    IF A00-R01-CVEMDA = 1                                         379200      
003722       MOVE A00-R01-MDA-SUC          TO 500-R02-PREFSUC           379400      
003723       MOVE A00-R01-MDA-CTA          TO 500-R02-CTOCTA            379600      
003724    ELSE                                                          379800      
003725    IF A00-R01-CVEMDA = 2                                         380000      
003726       MOVE A00-R01-MDA-CTA          TO 500-R02-MEDACC.           380200      
003727                                                                  380300      
003728    MOVE A00-R01-IMPORTE(W77-IND)    TO 500-R02-IMPTRAN.          380400      
003729    MOVE A00-R01-MONEDA              TO 500-R02-MONEDA.           380600      
003730    MOVE A00-R01-REFNUM              TO 500-R02-REFNUM.           380800      
003731    MOVE A00-R01-INDLEY(W77-IND)     TO 500-R02-INDLEY.           381000      
003732                                                                  381100      
003733    IF W77-IND = 1                                                381200      
003734       MOVE A01-R01-LEY1             TO 500-R02-LEYENDA           381400      
003735    ELSE                                                          381600      
003736    IF W77-IND = 2                                                381800      
003737       MOVE A01-R02-LEY2             TO 500-R02-LEYENDA           382000      
003738    ELSE                                                          382200      
003739    IF W77-IND = 3                                                382400      
003740       MOVE A01-R02-LEY3             TO 500-R02-LEYENDA           382600      
003741    ELSE                                                          382800      
003742    IF W77-IND = 4                                                383000      
003743       MOVE A01-R02-LEY4             TO 500-R02-LEYENDA           383200      
003744    ELSE                                                          383400      
003745    IF W77-IND = 5                                                383600      
003746       MOVE A01-R02-LEY5             TO 500-R02-LEYENDA.          383800      
003747                                                                  383900      
003748    IF 500-R02-LEYENDA NOT = SPACES                               384000      
003749       INSPECT 500-R02-LEYENDA REPLACING ALL WKS-NULO BY " ".     384200      
003750    IF A01-R01-REFERENCIA1 NOT = SPACES                           384400      
003751       MOVE A01-R01-REFERENCIA1   TO 500-R02-REFADIC1             384600      
003752       INSPECT 500-R02-REFADIC1 REPLACING ALL WKS-NULO BY " ".    384800      
003753    IF A01-R01-REF2-CTE NOT = SPACES                              385000      
003754       MOVE A01-R01-REF2-CTE      TO 500-R02-REFADIC2             385200      
003755       INSPECT 500-R02-REFADIC2 REPLACING ALL WKS-NULO BY " ".    385400      
003756    IF A01-R01-REF3-CTE NOT = SPACES                              385600      
003757       MOVE A01-R01-REF3-CTE         TO 500-R02-REFADIC3          385800      
003758       INSPECT 500-R02-REFADIC3 REPLACING ALL WKS-NULO BY " ".    386000      
003759                                                                  386100      
003760    MOVE "AU"                     TO 500-R02-TEXAUT.              386200      
003761    MOVE A00-R01-AUTORIZA         TO 500-R02-NUMAUTORIZA.         386400      
003762    MOVE SPACE                    TO 500-R02-FILREDAR1            386600      
003763                                     500-R02-FILREDAR2            386800      
003764                                     500-R02-FILREDAR3.           387000      
003765    MOVE "OP"                     TO 500-R02-TEXSUCOPE.           387200      
003766    MOVE A00-R01-SUCOPER          TO 500-R02-NUMSUCOPE.           387400      
003767    MOVE A00-R01-CAJAOPER         TO 500-R02-NUMCAJOPE.           387600      
003768    MOVE "TR"                     TO 500-R02-TEXSUCTRA.           387800      
003769    MOVE A00-R01-SUCTRAN          TO 500-R02-NUMSUCTRA.           388000      
003770    MOVE A00-R01-CAJATRAN         TO 500-R02-NUMCAJTRA.           388200      
003771    MOVE A00-R01-HORMOV           TO 500-R02-HORAMOV.             388400      
003772                                                                  388450      
003773    MOVE 0                        TO WKS-IND-AGRP.                388500      
003774    PERFORM 400022-CARGA-AGRP-EXTNET.                             388550      
003775                                                                  388600      
003776    IF A00-R01-MONEDA = 1                                         388800      
003777       PERFORM 040040-ACUMULA-TOTALES                             389000      
003778       WRITE A04-REG-EXTNET   FROM 500-R02-DET-CLIENTESCITIC      389200      
003779    ELSE                                                          389400      
003780    IF A00-R01-MONEDA = 5                                         389600      
003781       PERFORM 040040-ACUMULA-TOTALES-DOLAR                       389800      
003782       WRITE A04-REG-EXTNET-D FROM 500-R02-DET-CLIENTESCITIC.     390000      
003783                                                                  390002      
003784400022-CARGA-AGRP-EXTNET.                                         390004      
003785*========================                                         390006      
003786    IF A00-R01-CVETRAN2 > 0                                       390008      
003787       MOVE WKS-CAT1823-CVOR(A00-R01-CVETRAN2) TO WKS-CLVTRAN     390010      
003788       IF WKS-CLVTRAN = A00-R01-CVETRAN2                          390012      
003789          ADD 1                         TO WKS-IND-AGRP           390014      
003790          MOVE WKS-CAT1823-AGRP500(A00-R01-CVETRAN2)              390018      
003791                                        TO W77-CMP-AGRP500        390020      
003792          MOVE W77-CMP-AGRP500    TO 500-R02-AGRP500(WKS-IND-AGRP)390022      
003793          MOVE A00-R01-IMPORTE2   TO WKS-IMPTRANAGRP              390024      
003794          MOVE WKS-IMPTRANAGRP                                    390030      
003795                             TO 500-R02-IMPTRANAGRP(WKS-IND-AGRP).390031      
003796                                                                  390038      
003797    IF A00-R01-CVETRAN3 > 0                                       390040      
003798       MOVE WKS-CAT1823-CVOR(A00-R01-CVETRAN3) TO WKS-CLVTRAN     390042      
003799       IF WKS-CLVTRAN = A00-R01-CVETRAN3                          390044      
003800          ADD 1                         TO WKS-IND-AGRP           390046      
003801          MOVE WKS-CAT1823-AGRP500(A00-R01-CVETRAN3)              390050      
003802                                        TO W77-CMP-AGRP500        390052      
003803          MOVE W77-CMP-AGRP500    TO 500-R02-AGRP500(WKS-IND-AGRP)390054      
003804          MOVE A00-R01-IMPORTE3   TO WKS-IMPTRANAGRP              390056      
003805          MOVE WKS-IMPTRANAGRP                                    390060      
003806                             TO 500-R02-IMPTRANAGRP(WKS-IND-AGRP).390065      
003807                                                                  390072      
003808     IF A00-R01-CVETRAN4 > 0                                      390074      
003809       MOVE WKS-CAT1823-CVOR(A00-R01-CVETRAN4) TO WKS-CLVTRAN     390076      
003810       IF WKS-CLVTRAN = A00-R01-CVETRAN4                          390078      
003811          ADD 1                         TO WKS-IND-AGRP           390080      
003812          MOVE WKS-CAT1823-AGRP500(A00-R01-CVETRAN4)              390084      
003813                                        TO W77-CMP-AGRP500        390086      
003814          MOVE W77-CMP-AGRP500    TO 500-R02-AGRP500(WKS-IND-AGRP)390088      
003815          MOVE A00-R01-IMPORTE4   TO WKS-IMPTRANAGRP              390090      
003816          MOVE WKS-IMPTRANAGRP                                    390095      
003817                             TO 500-R02-IMPTRANAGRP(WKS-IND-AGRP).390100      
003818                                                                  390106      
003819    IF A00-R01-CVETRAN5 > 0                                       390108      
003820       MOVE WKS-CAT1823-CVOR (A00-R01-CVETRAN5) TO WKS-CLVTRAN    390110      
003821       IF WKS-CLVTRAN = A00-R01-CVETRAN5                          390112      
003822          ADD 1                            TO WKS-IND-AGRP        390114      
003823          MOVE WKS-CAT1823-AGRP500(A00-R01-CVETRAN5)              390118      
003824                                           TO W77-CMP-AGRP500     390120      
003825         MOVE W77-CMP-AGRP500     TO 500-R02-AGRP500(WKS-IND-AGRP)390122      
003826         MOVE A00-R01-IMPORTE5    TO WKS-IMPTRANAGRP              390124      
003827         MOVE WKS-IMPTRANAGRP                                     390140      
003828                             TO 500-R02-IMPTRANAGRP(WKS-IND-AGRP).390160      
003829                                                                  390200      
003830400022-CARGA-DATOS-EXTNET-ELIM.                                   390400      
003831*========================                                         390600      
003832 PERFORM 400021-LIMPIA-VAR-E.                                     390800      
003833                                                                  391000      
003834*    ADD 1                            TO W77-SEC-DET.             391200      
003835                                                                  391400      
003836    MOVE WKS-REG-AUTS500EXT          TO 500-R02-SECDETE           391600      
003837                                        500-R02-NUMAUTE.          391800      
003838    MOVE 4000                        TO 500-R02-NUMSUCE.          392000      
003839                                                                  392200      
003840    IF WKS-NUMCSI-HOST = 32 OR 10                                 392400      
003841       MOVE 01                       TO 500-R02-NUMCAJE           392600      
003842    ELSE                                                          392800      
003843       MOVE 02                       TO 500-R02-NUMCAJE.          393000      
003844                                                                  393100      
003845    IF W77-AFC = 9                                                393200      
003846       MOVE 3                        TO 500-R02-TIPMOVE.          393400      
003847                                                                  393500      
003848    MOVE WKS-REG-500TIPMDA           TO 500-R02-TIPMDAE.          393600      
003849                                                                  393800      
003850    IF WKS-REG-500TIPMDA = 0                                      394000      
003851       MOVE WKS-REG-500PREFSUC       TO 500-R02-PREFSUCE          394200      
003852       MOVE WKS-REG-500CTOCTA        TO 500-R02-CTOCTAE           394400      
003853    ELSE                                                          394600      
003854    IF WKS-REG-500TIPMDA = 1                                      394800      
003855       MOVE WKS-REG-500PREFSUC       TO 500-R02-PREFSUCE          395000      
003856       MOVE WKS-REG-500CTOCTA        TO 500-R02-CTOCTAE           395200      
003857    ELSE                                                          395400      
003858    IF WKS-REG-500TIPMDA = 2                                      395600      
003859       MOVE WKS-REG-500MEDACC        TO 500-R02-MEDACCE.          395800      
003860                                                                  396000      
003861    MOVE 0                           TO 500-R02-IMPTRANE.         396200      
003862    MOVE WKS-REG-500MONEDA           TO 500-R02-MONEDAE.          396400      
003863    MOVE WKS-REG-500REFNUM           TO 500-R02-REFNUME.          396600      
003864    MOVE ZEROS                       TO 500-R02-IMPE.             397000      
003865*    IF W77-IND = 1                                               397200      
003866*       MOVE WKS-REG-500LEYENDA-1     TO 500-R02-LEYENDA          397400      
003867*    ELSE                                                         397600      
003868*    IF W77-IND = 2                                               397800      
003869*       MOVE WKS-REG-500LEYENDA-2     TO 500-R02-LEYENDA          398000      
003870*    ELSE                                                         398200      
003871*    IF W77-IND = 3                                               398400      
003872*       MOVE WKS-REG-500LEYENDA-3     TO 500-R02-LEYENDA          398600      
003873*    ELSE                                                         398800      
003874*    IF W77-IND = 4                                               399000      
003875*       MOVE WKS-REG-500LEYENDA-4     TO 500-R02-LEYENDA          399200      
003876*    ELSE                                                         399400      
003877*    IF W77-IND = 5                                               399600      
003878*       MOVE WKS-REG-500LEYENDA-5     TO 500-R02-LEYENDA.         399800      
003879                                                                  400000      
003880*    IF 500-R02-LEYENDA NOT = SPACES                              400200      
003881*       INSPECT 500-R02-LEYENDA REPLACING ALL WKS-NULO BY " ".    400400      
003882*    IF WKS-REG-500REFADIC1 NOT = SPACES                          400600      
003883*       MOVE WKS-REG-500REFADIC1   TO 500-R02-REFADIC1            400800      
003884*       INSPECT 500-R02-REFADIC1 REPLACING ALL WKS-NULO BY " ".   401000      
003885*    IF WKS-REG-500REFADIC2 NOT = SPACES                          401200      
003886*       MOVE WKS-REG-500REFADIC2   TO 500-R02-REFADIC2            401400      
003887*       INSPECT 500-R02-REFADIC2 REPLACING ALL WKS-NULO BY " ".   401600      
003888*    IF WKS-REG-500REFADIC3 NOT = SPACES                          401800      
003889*       MOVE WKS-REG-500REFADIC3         TO 500-R02-REFADIC3      402000      
003890*       INSPECT 500-R02-REFADIC3 REPLACING ALL WKS-NULO BY " ".   402200      
003891                                                                  402410      
003892*    MOVE "AU"                     TO 500-R02-TEXAUT.             402600      
003893*    MOVE WKS-REG-500NUMAUTORIZA   TO 500-R02-NUMAUTORIZA.        402800      
003894*    MOVE SPACE                    TO 500-R02-FILREDAR1           403000      
003895*                                     500-R02-FILREDAR2           403200      
003896*                                     500-R02-FILREDAR3.          403400      
003897*    MOVE "OP"                     TO 500-R02-TEXSUCOPE.          403600      
003898*    MOVE WKS-REG-500NUMSUCOPE     TO 500-R02-NUMSUCOPE.          403800      
003899*    MOVE WKS-REG-500NUMCAJOPE     TO 500-R02-NUMCAJOPE.          404000      
003900*    MOVE "TR"                     TO 500-R02-TEXSUCTRA.          404200      
003901*    MOVE WKS-REG-500NUMSUCTRA     TO 500-R02-NUMSUCTRA.          404400      
003902*    MOVE WKS-REG-500NUMCAJTRA     TO 500-R02-NUMCAJTRA.          404600      
003903*    MOVE WKS-REG-HORAMOV          TO 500-R02-HORAMOV.            404800      
003904                                                                  405000      
003905    IF WKS-REG-500MONEDA  = 1                                     405200      
003906       PERFORM 040040-ACUM-TOT-ELIM                               405400      
003907       WRITE A04-REG-EXTNET   FROM 500-R02-DET-CLIENTESCITICE     405600      
003908    ELSE                                                          405800      
003909    IF WKS-REG-500MONEDA = 5                                      406000      
003910       PERFORM 040040-ACUM-TOT-DOLAR-ELIM                         406200      
003911       WRITE A04-REG-EXTNET-D FROM 500-R02-DET-CLIENTESCITICE.    406400      
003912                                                                  406600      
003913                                                                  406800      
003914 030376-LEE-DATOS-ADIC.                                           407000      
003915*======================                                           407200      
003916*     IF A00-R01-APUDES > 0                                       407400      
003917        COMPUTE W77-LLAVE = A00-R01-APUDES + 1                    407600      
003918        READ A02-DESS500 INTO A01-R01-DATOS                       407800      
003919             INVALID KEY                                          408000      
003920               MOVE 1      TO W77-LEE                             408100      
003921               MOVE A00-R01-APUDES TO W77-MOV-NIVDES              408150      
003922               MOVE A00-R01-AUT-S151  TO W77-MOV-MOVAUTS151       408200      
003923               MOVE A00-R01-AUTORIZA TO W77-MOV-AD1AUTS151        408250      
003924               MOVE "I"    TO TIPO-LJ                             408400      
003925               MOVE 020101 TO CODIGO-LJ                           408600      
003926               STRING "ERROR EN LECTURA DATOS ADICIONALES ",      408800      
003927                       W77-LLAVE, " ** ", W77-MOV-NIVDES, " ** ", 408900      
003928                       W77-MOV-MOVAUTS151, " ** ",                409000      
003929                       W77-MOV-AD1AUTS151                         409100      
003930               DELIMITED BY SIZE INTO TEXTO-LJ                    409200      
003931               CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ409400      
003932               MOVE LOW-VALUES TO A01-R01-DATOS.                  409600      
003933     IF W77-LEE = 1                                               409700      
003934        ADD 1              TO W77-VECES                           409800      
003935        CLOSE A02-DESS500 WITH RELEASE                            409900      
003936        WAIT (5)                                                  410000      
003937        OPEN INPUT A02-DESS500                                    410100      
003938        MOVE 0             TO W77-LEE                             410120      
003939        IF W77-VECES = 6                                          410140      
003940           MOVE 1         TO W77-LIMITE                           410160      
003941        ELSE                                                      410180      
003942           NEXT SENTENCE                                          410200      
003943     ELSE                                                         410220      
003944        IF A01-R01-AUTS151ORI NOT = A00-R01-AUT-S151              410240      
003945           ADD 1             TO W77-VECES                         410260      
003946           CLOSE A02-DESS500 WITH RELEASE                         410280      
003947           WAIT (5)                                               410300      
003948           OPEN INPUT A02-DESS500                                 410320      
003949           MOVE 0            TO W77-LEE                           410330      
003950           IF W77-VECES = 6                                       410340      
003951              MOVE 1         TO W77-LIMITE                        410350      
003952           ELSE                                                   410360      
003953              NEXT SENTENCE                                       410370      
003954       ELSE                                                       410380      
003955           MOVE 6             TO W77-VECES.                       410400      
003956     IF W77-LIMITE = 1                                            410420      
003957       MOVE A00-R01-APUDES    TO W77-MOV-NIVDES                   410440      
003958       MOVE A00-R01-AUT-S151  TO W77-MOV-MOVAUTS151               410460      
003959       MOVE A00-R01-AUTORIZA TO W77-MOV-AD1AUTS151                410480      
003960*       MOVE  TO W77-MOV-AD2AUTS151                               410500      
003961       MOVE "I"    TO TIPO-LJ                                     410520      
003962       MOVE 020101 TO CODIGO-LJ                                   410540      
003963       STRING "ERROR EN LECTURA DATOS ADICIONALES ",              410560      
003964              W77-LLAVE, " ** ", W77-MOV-NIVDES, " ** ",          410580      
003965              W77-MOV-MOVAUTS151, " ** ",                         410600      
003966              W77-MOV-AD1AUTS151                                  410620      
003967       DELIMITED BY SIZE INTO TEXTO-LJ                            410660      
003968       CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ        410680      
003969       MOVE LOW-VALUES TO A01-R01-DATOS.                          410700      
003970                                                                  410720      
003971 030376-LEE-DATOS-ADIC2.                                          411000      
003972*=======================                                          411200      
003973      COMPUTE W77-LLAVE = A01-R01-APUDES + 1                      411400      
003974      READ A02-DESS500 INTO A01-R02-TESOFE                        411600      
003975           INVALID KEY                                            411800      
003976               MOVE 1      TO W77-LEE                             411850      
003977               MOVE A00-R01-APUDES    TO W77-MOV-NIVDES           411900      
003978               MOVE A00-R01-AUT-S151  TO W77-MOV-MOVAUTS151       411950      
003979               MOVE A00-R01-AUTORIZA TO W77-MOV-AD1AUTS151        412000      
003980               MOVE A01-R01-APUDES TO W77-MOV-AD2AUTS151          412050      
003981               MOVE "I"    TO TIPO-LJ                             412200      
003982               MOVE 020101 TO CODIGO-LJ                           412400      
003983               STRING "ERROR EN LECTURA DATOS ADICIONALES ",      412600      
003984                       W77-LLAVE, " ** ", W77-MOV-NIVDES, " ** ", 412650      
003985                       W77-MOV-MOVAUTS151, " ** ",                412700      
003986                       W77-MOV-AD1AUTS151, " ** ",                412750      
003987                       W77-MOV-AD2AUTS151                         412800      
003988               DELIMITED BY SIZE INTO TEXTO-LJ                    413000      
003989               CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ413200      
003990               MOVE LOW-VALUES TO A01-R02-TESOFE.                 413400      
003991                                                                  413420      
003992      IF W77-LEE = 1                                              413440      
003993         ADD 1             TO W77-VECES                           413460      
003994         CLOSE A02-DESS500 WITH RELEASE                           413480      
003995         WAIT (5)                                                 413500      
003996         OPEN INPUT A02-DESS500                                   413520      
003997         MOVE 0            TO W77-LEE                             413522      
003998         IF W77-VECES = 6                                         413524      
003999            MOVE 1         TO W77-LIMITE                          413526      
004000         ELSE                                                     413528      
004001            NEXT SENTENCE                                         413530      
004002      ELSE                                                        413532      
004003        IF A01-R02-AUTS151ORI NOT = A00-R01-AUT-S151              413544      
004004           ADD 1             TO W77-VECES                         413546      
004005           CLOSE A02-DESS500 WITH RELEASE                         413548      
004006           WAIT (5)                                               413550      
004007           OPEN INPUT A02-DESS500                                 413552      
004008           MOVE 0            TO W77-LEE                           413553      
004009           IF W77-VECES = 6                                       413554      
004010              MOVE 1         TO W77-LIMITE                        413555      
004011           ELSE                                                   413556      
004012              NEXT SENTENCE                                       413557      
004013        ELSE                                                      413558      
004014           MOVE 6             TO W77-VECES.                       413560      
004015     IF W77-LIMITE = 1                                            413562      
004016       MOVE A00-R01-APUDES    TO W77-MOV-NIVDES                   413564      
004017       MOVE A00-R01-AUT-S151  TO W77-MOV-MOVAUTS151               413566      
004018       MOVE A00-R01-AUTORIZA TO W77-MOV-AD1AUTS151                413568      
004019       MOVE A01-R01-APUDES TO W77-MOV-AD2AUTS151                  413570      
004020       MOVE "I"    TO TIPO-LJ                                     413572      
004021       MOVE 020101 TO CODIGO-LJ                                   413574      
004022       STRING "ERROR EN LECTURA DATOS ADICIONALES ",              413576      
004023              W77-LLAVE, " ** ", W77-MOV-NIVDES, " ** ",          413578      
004024              W77-MOV-MOVAUTS151, " ** ",                         413580      
004025              W77-MOV-AD1AUTS151, " ** ",                         413582      
004026              W77-MOV-AD2AUTS151                                  413584      
004027       DELIMITED BY SIZE INTO TEXTO-LJ                            413586      
004028       CALL "LJ IN LIB-DISP"  USING CONTADOR-LJ,MENSAJE-LJ        413588      
004029       MOVE LOW-VALUES TO A01-R02-TESOFE.                         413590      
004030                                                                  413600      
004031 040040-ACUMULA-TOTALES.                                          413800      
004032*=======================                                          414000      
004033       IF W77-AFC = 1                                             414200      
004034          ADD 1                          TO WKS-NUM-CARG-PES      414400      
004035          ADD A00-R01-IMPORTE(W77-IND)   TO WKS-NUM-TOTAL-CARG-PES414600      
004036       ELSE                                                       414800      
004037       IF W77-AFC = 2                                             415000      
004038          ADD 1                          TO WKS-NUM-ABON-PES      415200      
004039          ADD A00-R01-IMPORTE(W77-IND)   TO WKS-NUM-TOTAL-ABON-PES415400      
004040       ELSE                                                       415600      
004041       IF W77-AFC = 9                                             415800      
004042          ADD 1                          TO WKS-NUM-NO-CONT-PES.  416000      
004043                                                                  416200      
004044  040040-ACUMULA-TOTALES-DOLAR.                                   416400      
004045*=======================                                          416600      
004046       IF W77-AFC = 1                                             416800      
004047          ADD 1                          TO WKS-NUM-CARG-DOL      417000      
004048          ADD A00-R01-IMPORTE(W77-IND)   TO WKS-NUM-TOTAL-CARG-DOL417200      
004049       ELSE                                                       417400      
004050       IF W77-AFC = 2                                             417600      
004051          ADD 1                          TO WKS-NUM-ABON-DOL      417800      
004052          ADD A00-R01-IMPORTE(W77-IND)   TO WKS-NUM-TOTAL-ABON-DOL418000      
004053       ELSE                                                       418200      
004054       IF W77-AFC = 9                                             418400      
004055          ADD 1                          TO WKS-NUM-NO-CONT-DOL.  418600      
004056                                                                  418800      
004057 040040-ACUM-TOT-ELIM.                                            419000      
004058*=======================                                          419200      
004059       IF W77-AFC = 1                                             419400      
004060          ADD 1                          TO WKS-NUM-CARG-PES      419600      
004061          ADD WKS-REG-IMPORTE(W77-IND)   TO WKS-NUM-TOTAL-CARG-PES419800      
004062       ELSE                                                       420000      
004063       IF W77-AFC = 2                                             420200      
004064          ADD 1                          TO WKS-NUM-ABON-PES      420400      
004065          ADD WKS-REG-IMPORTE(W77-IND)   TO WKS-NUM-TOTAL-ABON-PES420600      
004066       ELSE                                                       420800      
004067       IF W77-AFC = 9                                             421000      
004068          ADD 1                          TO WKS-NUM-NO-CONT-PES.  421200      
004069                                                                  421400      
004070  040040-ACUM-TOT-DOLAR-ELIM.                                     421600      
004071*=======================                                          421800      
004072       IF W77-AFC = 1                                             422000      
004073          ADD 1                          TO WKS-NUM-CARG-DOL      422200      
004074          ADD WKS-REG-IMPORTE(W77-IND)   TO WKS-NUM-TOTAL-CARG-DOL422400      
004075       ELSE                                                       422600      
004076       IF W77-AFC = 2                                             422800      
004077          ADD 1                          TO WKS-NUM-ABON-DOL      423000      
004078          ADD WKS-REG-IMPORTE(W77-IND)   TO WKS-NUM-TOTAL-ABON-DOL423200      
004079       ELSE                                                       423400      
004080       IF W77-AFC = 9                                             423600      
004081          ADD 1                          TO WKS-NUM-NO-CONT-DOL.  423800      
004082                                                                  424000      
004083400021-LIMPIA-VAR-E.                                              424200      
004084*=========================                                        424400      
004085    MOVE ZEROS                       TO 500-R02-SECDETE           424600      
004086                                        500-R02-NUMSUCE           424800      
004087                                        500-R02-NUMCAJE           425000      
004088                                        500-R02-NUMAUTE           425200      
004089                                        500-R02-TIPMOVE           425400      
004090                                        500-R02-TIPMDAE           425600      
004091                                        500-R02-MEDACCE           425800      
004092                                        500-R02-PREFSUCE          426000      
004093                                        500-R02-CTOCTAE           426200      
004094                                        500-R02-IMPTRANE          426400      
004095                                        500-R02-MONEDAE           426600      
004096                                        500-R02-REFNUME           426800      
004097                                        500-R02-IMPE.             427000      
004098     MOVE SPACES                     TO 500-R02-FILLERE.          427200      
